[
  {
    "id": 1,
    "title": "Explainer : How Hamas Ended Up on US List of Terrorist Groups",
    "date": "2024-02-07T20:45:00+00:00",
    "url": "https://www.voanews.com/a/explainer-how-hamas-ended-up-on-us-list-of-terrorist-groups/7478227.html",
    "source": "GDELT",
    "message": "Along with the United States, several countries have listed Hamas as a terrorist organization. The group considers itself a liberation movement for Palestinians against Israeli occupation.\n\nThe U.S. has designated Hamas as a terrorist organization three times, says Matthew Levitt, a specialist on Hamas at the Washington Institute of Near East Policy.\n\n“The first time predates the current terrorism lists and came in the process of the peace process under the Clinton administration in 1995,” he said. The Clinton White House had an executive order, a law banning groups that were threatening the peace process. That included Islamist groups like Hamas and Palestinian Islamic Jihad, and also Jewish extremist groups like Kach and Kahane Chai.”\n\nTwo years later, the U.S. created a new terrorism list.\n\n“Then in 1997, the State Department initiated its Foreign Terrorist Organization or FTO list, which is specific to terrorist groups,” Levitt said. “And Hamas was added to that list because of the acts of terrorism it was conducting not only because it was threatening the peace process but it was at that point carrying out shooting attacks, stabbing attacks and beginning to carry out suicide bombings quite frequently as well.”\n\nThe third time, according to Levitt, came after 9/11 attacks on the U.S. when the Bush administration created a special global terrorism list.\n\nLevitt explained how Hamas fits the definition of a terrorist organization.\n\n“The simple, most basic definition is targeting civilians for the purpose of effecting social or political change,” he said. \"Personally, I simplify it a little bit more: It’s about the tactic. Terrorism is a tactic and if you engage in this tactic of targeting civilians for the purpose of effecting social and political change then that act is an act of terrorism.”\n\nIn its 1988 manifesto, Hamas called for the destruction of Israel. Years later, in 2017, Hamas dropped that language.\n\nBut it continued to incessantly fire rockets into Israeli communities.\n\nOn October 7, thousands of Hamas gunmen stormed into Israel killing 1,200 people, most of them civilians, according to Israeli tallies, and took over more than 20 Israeli kibbutzim and other communities. Among the dead were at least 30 Israelis who also had U.S. citizenship.\n\nIsrael responded to the Hamas attack with a war against Hamas in Gaza.\n\nThe Hamas-run Palestinian Health Ministry in Gaza says more than 27,000 Palestinians have been killed, although that includes both fighters and civilians. Israel says it has killed an estimated 10,000 Hamas fighters, about one third of Hamas’s total force.\n\nIsrael says its forces in Gaza are carrying out precision attacks and are not targeting civilians. It says civilian deaths that are occurring are unintentional.\n\nThe growing civilian death toll and humanitarian crisis in Gaza have led to growing international pressure on Israel to stop the war. The U.S. says that Gaza must eventually be run by a revitalized Palestinian Authority, an idea that Israeli Prime Minister Benjamin Netanyahu has rejected.\n\nHamas, which has ruled Gaza since 2007, is rejecting it too. In a recent interview with a Kuwaiti journalist, former Hamas senior official Khaled Mashaal, who lives in Qatar, rejected the idea of recognizing Israel, and said that the October 7 attack proved that the idea of liberating Palestine “from the river to the sea” is realistic.\n\nMashaal said Hamas has used its rule of Gaza to build up the resistance and all its means. He said the weapons, the weapons production, the planning, the training and the tunnels were built, keeping their backs safe.\n\nThere are 2.3 million civilians living in Gaza, an enclave just 25 miles long.\n\nIsraeli army spokesman Daniel Hagari says Hamas has hidden its fighters in civilian infrastructure.\n\n“Hamas uses hospitals as terror infrastructures,” he said. “Hamas has turned hospitals into command-and-control centers and hideouts for Hamas terrorists and commanders.”\n\nIsraeli Prime Minister Benjamin Netanyahu says he is committed to destroying Hamas as a military power. But four months into the war, Hamas remains in control in parts of Gaza, making it unclear what the future of the enclave will be."
  },
  {
    "id": 2,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.ocregister.com/2024/02/07/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american-troops/",
    "source": "GDELT",
    "message": "By QASSIM ABDUL-ZAHRA, LOLITA C. BALDOR and AAMER MADHANI\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 3,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.eastbaytimes.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nRelated Articles World News | AG: Investigation into Biden document handling is done\n\nAG: Investigation into Biden document handling is done World News | With new funding, IRS expects to collect billions in unpaid taxes\n\nWith new funding, IRS expects to collect billions in unpaid taxes World News | Analysis: What the border bill would and wouldn’t do\n\nAnalysis: What the border bill would and wouldn’t do World News | DoJ moves to address disparities in state crime victim funds\n\nDoJ moves to address disparities in state crime victim funds World News | Biden, first lady honor service members lost in Jordan drone attack Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 4,
    "title": "US drone strike in Baghdad kills militia head responsible for attacks on American troops | Qassim Abdul - Zahra , Lolita C . Baldor & Aamer Madhani",
    "date": "2024-02-08T16:00:00+00:00",
    "url": "https://businessmirror.com.ph/2024/02/08/us-drone-strike-in-baghdad-kills-militia-head-responsible-for-attacks-on-american-troops/",
    "source": "GDELT",
    "message": "BAGHDAD—A US drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the US military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who US officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the US embassy.\n\nThere were conflicting reports on the number of those killed, with US officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, US Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the US “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike—which came at 9:30 p.m. local time—is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the US military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three US troops and injured more than 40 others at a base in Jordan in late January.\n\nThe US has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the US would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing US troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on US forces in Iraq and Syria since October 18, but the latest drone strike in Jordan—the only one in that country so far—was the first to take American troops’ lives. The US, in response, has struck back about a half dozen times since October 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s US strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on US bases there and an assault on the US Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of US forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing US troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\nImage credits: AP/Hadi Mizban\n\n\n\n\n\n"
  },
  {
    "id": 5,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.newsday.com/news/nation/Iraq-Kataib-Hezbollah-drone-strike-j88503",
    "source": "GDELT",
    "message": "BAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nGet the Breaking News newsletter! Get the latest breaking news as it happens. By clicking Sign up, you agree to our privacy policy.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nIraqis gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday, Feb. 7, 2024. Credit: AP/Hadi Mizban\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nCivil defense members gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday, Feb. 7, 2024. Credit: AP/Hadi Mizban\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 6,
    "title": "U . S . drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T00:15:00+00:00",
    "url": "https://www.adn.com/nation-world/2024/02/07/us-drone-strike-in-baghdad-kills-high-ranking-commander-in-iran-backed-militia/",
    "source": "GDELT",
    "message": "Civil defense members gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday, Feb. 7, 2024. (AP Photo/Hadi Mizban)\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nADVERTISEMENT\n\nIraqis gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday, Feb. 7, 2024. (AP Photo/Hadi Mizban)\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 7,
    "title": "Iraq slams US after strike kills pro - Iran commander",
    "date": "2024-02-08T14:00:00+00:00",
    "url": "https://www.al-monitor.com/originals/2024/02/iraq-slams-us-after-strike-kills-pro-iran-commander",
    "source": "GDELT",
    "message": "February 7, 2024 — Baghdad (AFP)\n\nIraq on Thursday condemned a US air strike that killed a senior commander from a pro-Iran armed group accused of having been involved in attacks on American troops in the region.\n\nThe US attack on Wednesday came after a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28.\n\nThe US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members\".\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM.\n\nIraqi authorities slammed the strike as a \"blatant assassination\" in a residential neighbourhood of Baghdad.\n\n\"The international coalition is completely overstepping the reasons and objectives for which it is present on our territory,\" said Yehia Rasool, the military spokesman for Iraq's prime minister.\n\nHe was referring to the US-led military coalition formed in 2014 to fight the Islamic State group -- the year the jihadist group overran nearly a third of Iraq's territory.\n\nRasool later announced in a statement that talks with Washington on the \"end of the mission\" would resume on Sunday.\n\nA first round of talks opened on January 27 following a request by Iraqi Prime Minister Mohamed Shia al-Sudani for a timetable for the withdrawal of US-led troops.\n\nIt was swiftly suspended after the deadly drone strike in Jordan the following day.\n\nKataeb Hezbollah -- which announced it was suspending its operations against US forces after the Jordan attack -- said one of its commanders had been killed, identifying him as Abu Baqr al-Saadi.\n\nThe commander, whose funeral was held on Thursday, was responsible for \"military affairs\" in Syria, an official from the group told AFP.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- had died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Mashtal.\n\n- 'Red lines' -\n\nThe latest US strike sparked condemnation in Iraq, with a pro-Iran parliamentary bloc dubbing it an attack on \"Iraqi sovereignty\".\n\nWashington has \"crossed all red lines by targeting regular forces and men who contributed to defeating Islamic State terrorism,\" said the Coordination Framework, an alliance of pro-Iran Shiite parties.\n\nIraq's pro-Iran Al-Nujaba movement promised a \"targeted retaliation\", saying that \"these crimes will not go unpunished\".\n\nIran joined in the condemnation on Thursday, with foreign ministry spokesman Nasser Kanani calling the strike an act of \"adventurism\" that was \"a threat to regional and international peace and stability\".\n\nUS and allied troops have been targeted more than 165 times in the Middle East since mid-October in attacks linked to the Israel-Hamas war in Gaza.\n\nThe majority of the attacks have been claimed by the Islamic Resistance in Iraq, a loose alliance of Iran-backed groups angered by US support for Israel.\n\nIraq analyst Sajad Jiyad, of the New York-based Century Foundation think tank, said he expected the tensions to continue to spiral.\n\n\"These groups have a lot of capabilities, they are active in several countries now, the US is willing to engage, to retaliate, to kill members of these groups,\" he said.\n\n\"The US is giving no indication it is going to pull back or stand down its military activity in the Middle East,\" he said, adding \"it is very difficult to suddenly see an end to the tensions.\"\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of the coalition against IS.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 8,
    "title": "Iraqi militia leader killed in US drone strike in Baghdad",
    "date": "2024-02-08T15:45:00+00:00",
    "url": "https://www.ktvb.com/article/news/nation-world/us-drone-strike-kills-high-ranking-militia-leader-in-iraq/507-6cfe16ac-0dec-44d9-bf02-1769740860d2",
    "source": "GDELT",
    "message": "N/A"
  },
  {
    "id": 9,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T01:30:00+00:00",
    "url": "https://www.sandiegouniontribune.com/news/nation-world/story/2024-02-07/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say",
    "source": "GDELT",
    "message": "A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nAdvertisement\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 10,
    "title": "Drone strike in Baghdad kills militia commander – NECN",
    "date": "2024-02-08T02:45:00+00:00",
    "url": "https://www.necn.com/news/national-international/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say/3156717/",
    "source": "GDELT",
    "message": "A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nGet New England news, weather forecasts and entertainment stories to your inbox. Sign up for NECN newsletters.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe U.S. launched attacks in Iraq and Syria on Friday following the killing of three American soldiers, according to the Department of Defense.\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 11,
    "title": "Drone strike in Baghdad kills militia commander – NBC 5 Dallas - Fort Worth",
    "date": "2024-02-08T00:15:00+00:00",
    "url": "https://www.nbcdfw.com/news/national-international/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say/3456144/",
    "source": "GDELT",
    "message": "A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nGet DFW local news, weather forecasts and entertainment stories to your inbox. Sign up for NBC DFW newsletters.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe U.S. launched attacks in Iraq and Syria on Friday following the killing of three American soldiers, according to the Department of Defense.\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 12,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T06:45:00+00:00",
    "url": "https://www.hawaiinewsnow.com/2024/02/07/us-drone-strike-targeted-heads-iran-backed-militia-officials-say-group-says-commander-was-killed/",
    "source": "GDELT",
    "message": "BAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\nCopyright 2024 The Associated Press. All rights reserved."
  },
  {
    "id": 13,
    "title": "U . S . drone strike in Baghdad kills high - ranking militia leader , officials say",
    "date": "2024-02-08T04:15:00+00:00",
    "url": "https://www.pressherald.com/2024/02/07/u-s-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american-troops/",
    "source": "GDELT",
    "message": "BAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where several diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nAdvertisement\n\nThe strike – which came at 9:30 p.m. local time – is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. Officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan – the only one in that country so far – was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nAdvertisement\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in the Ras Issa area in the Salif district in Hodeida province.\n\nAssociated Press journalist Ali Jabar in Baghdad contributed to this report.\n\nSend questions/comments to the editors.\n\n« Previous\n\nNext »\n\nfiled under:"
  },
  {
    "id": 14,
    "title": "  Death to America  Mob Takes Streets of Baghdad After U . S . Drone Strike",
    "date": "2024-02-08T19:00:00+00:00",
    "url": "https://www.breitbart.com/middle-east/2024/02/08/death-america-mob-takes-streets-baghdad-u-s-drone-strike-terror-leader/",
    "source": "GDELT",
    "message": "A mob of angry men convened in Baghdad, Iraq, on Wednesday night at the site of a U.S. drone strike that killed several senior members of the Kata’ib Hezbollah terrorist organization, reportedly shouting “America is the Great Satan” and other jihadist slogans.\n\nSome reports indicated that the men were displaying the slogan used by the Shiite terrorist Houthi movement, which reads, “Allahu Akbar, Death to America, Death to Israel, a Curse on the Jews, Victory to Islam”:\n\nIraqi citizens protest recent US aggression following the assassination of a Kataib Hezbollah Iraq leader, commander Abu Baqir al-Saadi. Demonstrators carry the slogan of Yemen's Ansarallah as a symbol of unity. pic.twitter.com/WVRaqXSMrX — The Cradle (@TheCradleMedia) February 7, 2024\n\n“’Allah is great, America is the great Satan,’” shout some demonstrators in a video published on social networks,” the Italian Agenzia Nova reported:\n\nBritish agency Sky News, which had reporters on sight in Baghdad, said that some of the crowds attempted to convene in front of the Green Zone, the heavily fortified neighborhood in the capital, which hosts several foreign embassies, including America’s, shouting “death to America” and menacing some reporters present. The Sky News team left when a man “warned us we needed to leave the area after telling us parts of the crowd wanted to attack us and our vehicle”:\n\nU.S. Central Command announced on Wednesday that it had taken action, “killing a Kata’ib Hezbollah commander responsible for directly planning and participating in attacks on U.S. forces in the region.”\n\n“There are no indications of collateral damage or civilian casualties at this time,” the U.S. military statement read. “The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces’ safety”:\n\nUSCENTCOM Conducts Strike Killing Kata’ib Hezbollah Senior Leader At 9:30 p.m. (Baghdad Time) February 7, U.S. Central Command (CENTCOM) forces conducted a unilateral strike in Iraq in response to the attacks on U.S. service members, killing a Kata’ib Hezbollah commander… pic.twitter.com/Zhkjimx5UG — U.S. Central Command (@CENTCOM) February 7, 2024\n\nKata’ib Hezbollah identified the targeted leader as Abu Baqr al-Saadi, according to the Iranian propaganda outlet PressTV – the man reportedly leading the terrorist militia’s drone operations. One other man killed in the strike was later identified as Arkan Alyawi. U.S. authorities said the strike was a response to Kata’ib Hezbollah and similar Iran-backed groups in the region engaging in dozens of attacks on U.S. troops since October 7, when the genocidal jihadist group Hamas invaded Israel and massacred 1,200 people, in addition to engaging in acts of gang rape, infanticide, torture, and other atrocities.\n\nOne of those attacks, in late January, killed three American servicemembers. The “Islamic Resistance in Iraq,” a name used by several jihadist groups in the region, including Kata’ib Hezbollah, took responsibility for the killings.\n\nKata’ib Hezbollah, or the Hezbollah Brigades, is a Shiite, U.S.-designated terrorist organization with close ties to Iran. It is part of the “Popular Mobilization Forces” (PMF), a coalition of similar militias that the government of Iraq formally integrated into its armed forces during the fight to liberate Iraq and Syria from the Sunni Islamic State “caliphate.” Kata’ib Hezbollah and similar groups claim credit for eradicating the Islamic State, though most of the effort was undertaken by Kurdish Peshmerga and Syrian Democratic Forces (SDF) troops with the aid of American allies.\n\nFollowing the collapse of the Islamic State “caliphate,” the PMF began targeting Kurdish and American forces. In response, under former President Donald Trump, U.S. forces eliminated the founder and leader of Kata’ib Hezbollah, Abu Mahdi al-Muhandis, in a drone strike in Iraq in January 2020. That strike also killed the head of Iran’s Islamic Revolutionary Guard Corps (IRGC) Quds Force, Qasem Soleimani, Tehran’s top terror mastermind. The strikes largely neutralized the Kata’ib Hezbollah threat, though the terrorists have regrouped under current President Joe Biden.\n\nIn late January, Kata’ib Hezbollah issued a statement promising that its terrorists would execute “painful attacks on US occupation forces until they are driven out of Iraq and the region.” Days later, it issued a bizarre missive claiming that it would stop “embarrassing” the government of Iraq by targeting Americans.\n\nKata’ib Hezbollah confirmed the loss of several of its top terrorists on Thursday in a statement in which it “extended congratulations” to the families of those killed for their “martyrdom.”\n\nSecretary-General of Kata’ib Hezbollah Abu Hussein al-Hamidawi declared that the drone strike “calls us to remain steadfast in the jihadist approach.”\n\nThe government of Iraq responded to the American strike with outrage, as the PMF and its terrorist members are formally the Iraqi military.\n\n“Any kind of military attack on the Iraqi territory is unacceptable,” Prime Minister Mohammed Shia’ al-Sudani proclaimed, with an outrage notably absent when Iranian forces conduct operations in Iraq. Sudani, for example, had no meaningful response to the IRGC bombing Erbil, the capital of Iraqi Kurdistan, and killing a baby ten days shy of her first birthday in mid-January. The IRGC claimed that it had bombed a “Mossad base;” in reality, it destroyed the home of a local businessman, killing him and his daughter and injuring several other family members.\n\nYahya Rasool, an Iraqi military spokesman, demanded America withdraw from Iraq completely.\n\n“The international coalition is completely overstepping the reasons and objectives for which it is present on our territory,” he said in a statement following Wednesday’s strike. “This path pushes the Iraqi government more than ever before to end the coalition’s mission which has become a factor of instability for Iraq.”\n\nFollow Frances Martel on Facebook and Twitter."
  },
  {
    "id": 15,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T08:45:00+00:00",
    "url": "https://www.wtae.com/article/us-drone-strike-iran-backed-militia-baghdad/46675127",
    "source": "GDELT",
    "message": "Advertisement US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops Share Copy Link Copy\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.The precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.There were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.Those officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.In a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”The strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.The U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.The Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.There have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.Wednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.On Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.The latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”Also on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.___Madhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 16,
    "title": "Drone strike in Baghdad kills militia commander – NBC Bay Area",
    "date": "2024-02-08T01:30:00+00:00",
    "url": "https://www.nbcbayarea.com/news/national-international/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say/3446934/",
    "source": "GDELT",
    "message": "A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nGet a weekly recap of the latest San Francisco Bay Area housing news. Sign up for NBC Bay Area’s Housing Deconstructed newsletter.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe U.S. launched attacks in Iraq and Syria on Friday following the killing of three American soldiers, according to the Department of Defense.\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 17,
    "title": "Drone strike in Baghdad kills militia commander – NBC 6 South Florida",
    "date": "2024-02-08T01:45:00+00:00",
    "url": "https://www.nbcmiami.com/news/national-international/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say/3228035/",
    "source": "GDELT",
    "message": "A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nGet South Florida local news, weather forecasts and entertainment stories to your inbox. Sign up for NBC South Florida newsletters.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe U.S. launched attacks in Iraq and Syria on Friday following the killing of three American soldiers, according to the Department of Defense.\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 18,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T04:00:00+00:00",
    "url": "https://isp.netscape.com/news/world/story/0001/20240208/bddd82ed18dd94f53e81cbc71d25049a",
    "source": "GDELT",
    "message": "US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops\n\nBAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\n© Copyright The Associated Press. All rights reserved. The information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press."
  },
  {
    "id": 19,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.wsbradio.com/news/world/us-drone-strike/DX66PRJT46UVAZZJNG6VZEIMNI/",
    "source": "GDELT",
    "message": "BAGHDAD — (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington's support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran's Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until \"absolute victory.\"\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
  },
  {
    "id": 20,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T14:30:00+00:00",
    "url": "https://www.wjhg.com/2024/02/07/us-drone-strike-targeted-heads-iran-backed-militia-officials-say-group-says-commander-was-killed/",
    "source": "GDELT",
    "message": "BAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\nCopyright 2024 The Associated Press. All rights reserved."
  },
  {
    "id": 21,
    "title": "Iraq slams US after strike kills pro - Iran commander",
    "date": "2024-02-08T17:00:00+00:00",
    "url": "https://www.naharnet.com:443/stories/en/303276-iraq-slams-us-after-strike-kills-pro-iran-commander",
    "source": "GDELT",
    "message": "N/A"
  },
  {
    "id": 22,
    "title": "US Says It Killed Pro - Iran Commander In Iraq Strike",
    "date": "2024-02-07T23:15:00+00:00",
    "url": "https://www.ndtv.com/world-news/us-says-it-killed-pro-iran-commander-in-iraq-strike-5015171",
    "source": "GDELT",
    "message": "An American air strike in Iraq killed a commander of a pro-Iran armed group on Wednesday.\n\nAn American air strike in Iraq on Wednesday killed a senior commander from a pro-Iran armed group who was involved in attacks on Washington's troops in the region, the US military said.\n\nWashington launched a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28, and the US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members.\"\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM, which said there are \"no indications of collateral damage or civilian casualties at this time.\"\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nA member of Kataeb Hezbollah -- which announced it was suspending violence against US forces after the deadly Jordan attack -- confirmed a commander who was responsible for the \"military file\" in Syria had been killed, identifying him as Abu Baqr al-Saadi.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries now integrated into Iraq's regular security forces, also confirmed Saadi's death in a statement.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Machtal.\n\n- 'Playing with fire' -\n\nAn AFP photographer said security forces deployed in the neighbourhood, barring access to it after the attack.\n\nLater in the evening the remains of a car were removed from the area.\n\nUS and allied troops have been attacked more than 165 times in the Middle East since mid-October in a campaign waged by Iran-backed armed groups angered by US support for Israel in the war in Gaza.\n\nThe United States considers Kataeb Hezbollah -- which Washington says may have been involved in the Jordan attack -- a terrorist group.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in the US strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned on Sunday.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nThe United States and Iraq opened talks on the future of the US-led troop presence in January, following a request by the Iraqi prime minister for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"
  },
  {
    "id": 23,
    "title": "Russian ambassador claims US was  involved  in strike on bakery",
    "date": "2024-02-08T00:00:00+00:00",
    "url": "https://www.newsweek.com/russian-ambassador-claims-us-was-involved-strike-bakery-1867976",
    "source": "GDELT",
    "message": "Russia's ambassador to the United Nations on Tuesday claimed the United States is at least partially responsible for a recent strike on a bakery in a Russian-occupied city in Donbas that resulted in the deaths of over two dozen people.\n\nDuring a meeting of the U.N. Security Council that was initiated by Russia to address the strike, Ambassador Vassily Nebenzia accused Washington of being an accomplice in what Moscow has termed an \"act of terrorism.\"\n\nNebenzia did not offer any evidence to back up his claim. When reached for comment, a U.S. State Department spokesperson told Newsweek: \"We hope people see this false narrative for what it is—standard Kremlin nonsense.\"\n\nAccording to Russia's emergencies ministry, at least 28 people were killed on Saturday when a bakery in the Russian-occupied city of Lysychansk in Ukraine's Luhansk region of Donbas was shelled. Russian publication RTVI reported that the strike was likely carried out by Ukraine using a U.S.-made High Mobility Artillery Rocket System (HIMARS), though Newsweek couldn't independently verify which weapons were used in the attack. Kyiv officials also have not claimed responsibility for the incident.\n\nVassily Nebenzia, Russia's ambassador to the United Nations, speaks during a U.N. Security Council at U.N. headquarters in New York City on August 24, 2023. On Tuesday, Nebenzia accused the U.S. of being partially responsible... Vassily Nebenzia, Russia's ambassador to the United Nations, speaks during a U.N. Security Council at U.N. headquarters in New York City on August 24, 2023. On Tuesday, Nebenzia accused the U.S. of being partially responsible for a strike on a Russian-occupied city, claiming American intelligence is notified in advance of such attacks. More Photo by YUKI IWAMURA/AFP via Getty Images\n\nAmong those killed was Alexey Poteleshchenko, who served as the Kremlin-installed minister of emergency situations in the region. Eduard Sakhnenko, Kremlin's designated mayor of Lysychansk, also reported two municipal deputies were killed in the attack.\n\n\"If someone undertakes to argue that Western countries have nothing to do with it and that Kyiv picks its own targets for strikes, they should be reminded of the confession of Vadym Skibitsky, a representative of the defense intelligence of Ukraine,\" Nebenzia said on Tuesday, according to Russian state-controlled media outlet RT.\n\nSkibitsky is the deputy head of Ukraine's defense intelligence, and Nebenzia was referencing an August 2022 interview he gave to the U.K.'s Telegraph. The newspaper paraphrased Skibitsky as reportedly saying that before Ukraine launches a strike, Washington is notified first and can veto any potential attacks.\n\n\"So it is quite obvious who was involved in the Lysychansk attack,\" the Russian envoy said, per RT.\n\nHowever, the American envoy to the U.N. pushed back on Nebenzia's characterization of the bakery incident during the U.N. Security Council meeting.\n\n\"We have seen the news reports of a strike hitting a bakery in Russia-occupied eastern Ukraine with at least 28 killed on February 3,\" Robert Wood, U.S. deputy ambassador, said. \"While we are unable to independently verify that information, the United States laments all civilian casualties and expresses its sincerest condolences to the families of any civilians killed.\"\n\nWood added: \"To be clear: Russia is the only aggressor in this war and the only one that could end this war today.\""
  },
  {
    "id": 24,
    "title": "US  involved  in deadly Ukrainian attack on Russian bakery - envoy",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.sott.net/article/488683-US-involved-in-deadly-Ukrainian-attack-on-Russian-bakery-envoy",
    "source": "GDELT",
    "message": "© Michael M. Santiago / Getty Images / AFP\n\nSkibitsky admitted that in order to use the HIMARS systems, Kiev must first obtain target clearance from Washington.\n\nWashington is partially responsible for Ukraine's missile strike on a bakery in the city of Lisichansk in Russia's Lugansk People's Republic (LPR) last week that killed over two dozen civilians, Moscow's permanent envoy to the UN Vassily Nebenzia stated on Tuesday.On February 3, the Armed Forces of Ukraine used high-power precision weaponry, presumably US-supplied HIMARS missiles, to target the bakery. The attack almost completely destroyed the two-story building and left some 40 people buried in the rubble, according to Nebenzia. Some 28 civilians died in the strike, including a pregnant woman and her five-year-old child. LPR Minister of Emergency Situations Aleksey Poteleschenko was among those killed in the attack.Speaking at an emergency meeting of the UN Security Council initiated by Russia in response to the strike, Nebenzia stressed thatthe diplomat said.Nebenzia recalled that in August 2022,the ambassador said. This also applies to the \"dozens if not hundreds\" of other crimes committed by Kiev using Western weapons, such as the recent downing of a Russian Il-76 aircraft carrying Ukrainian POWs, he added.The diplomat also pointed out that the time and place of Kiev's attack on Lisichansk were chosen deliberately, as Ukraine's forces were aware that there are not many recreational places left in the city. \"The neo-Nazis deliberately waited for the moment when families went for a walk on their day off, and cynically attacked almost the only place of leisure in Lisichansk,\" Nebenzia said.Тhe Russian envoy reiterated calls on the members of the UN Security Council and the UN leadership to \"strongly condemn the attack on Lisichansk and all other terrorist acts by the Kiev regime.\"\"The Bandera junta views your silence as a carte blanche to commit more crimes. For our part, we confirm that all those involved - the organizers and the perpetrators of this crime - will be identified and held accountable,\" Nebenzia added. Russia will achieve its goals of demilitarizing and denazifying Ukraine through either diplomatic or military means, he insisted."
  },
  {
    "id": 25,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T00:45:00+00:00",
    "url": "https://www.latimes.com/world-nation/story/2024-02-07/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say",
    "source": "GDELT",
    "message": "Civil defense members gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad.\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and is likely to further anger Iraqi government leaders, who U.S. officials said were not notified before the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. Embassy.\n\nThere were conflicting reports on the number killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataib Hezbollah announced Abu Baqir’s death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nAdvertisement\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike came days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Islamic Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nAdvertisement\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in the Ras Issa area in Salif district in Hodeida province.\n\nMadhani reported from Washington. Associated Press journalists Ali Jabar in Baghdad and Lolita Baldor in Washington contributed to this report.\n\n"
  },
  {
    "id": 26,
    "title": "Senior Hezbollah Commander Allegedly Assassinated by Israel in Lebanon | The Jewish Press - JewishPress . com | Hana Levi Julian | 30 Shevat 5784 – Thursday , February 8 , 2024",
    "date": "2024-02-08T18:45:00+00:00",
    "url": "https://www.jewishpress.com/news/middle-east/lebanon/senior-hezbollah-commander-allegedly-assassinated-by-israel-in-lebanon/2024/02/08/",
    "source": "GDELT",
    "message": "Photo Credit: Google Maps\n\nA senior Hezbollah terrorist was reportedly killed Thursday afternoon in a drone strike that took place in the southern Lebanese city of Nabatieh.\n\n“An Israeli drone carried out an air attack at approximately 4:15 pm on a four-wheel-drive vehicle at the eastern entrance to the city of Nabatieh, causing it to catch fire, Lebanon’s official National News Agency reported.\n\n\n\nAdvertisement\n\n\n\n\n\n“A vehicle burned at the Kafr Rumman roundabout in Nabatieh district in southern Lebanon,” the Quds News network reported.\n\nتغطية صحفية: احتراق مركبة على دوار كفر رمان قضاء النبطية في جنوب لبنان؛ جراء قصف طائرة مسيّرة للاحتلال. pic.twitter.com/kb2Mq95dcb — شبكة قدس الإخبارية (@qudsn) February 8, 2024\n\nIranian-backed Hezbollah regional commander Abbas al-Debs was allegedly killed in the targeted assassination. A missile fired by a drone hit on a vehicle that was carrying three people, according to Saudia Arabia’s Al Arabiya television network and the Al-Hadath news outlet.\n\nAl-Debs was linked the Iran’s elite Islamic Revolutionary Guard Corps (IRGC) and was reportedly helping Iran set up air defenses in Syria.\n\nPreliminary information indicated there were two Hezbollah operatives in the car at the time of the attack, which took place on a main street in the city.\n\n3 IDF Soldiers Wounded in Hezbollah Anti-Tank Missile Attack from Lebanon\n\nIsrael’s Galei Tzahal Army Radio reported that the IDF “eliminated a Hezbollah commander responsible for firing rockets at Kiryat Shmona.” The report added that the strike was carried out in response to an anti-tank guided missile (ATGM) attack on Israel by Hezbollah earlier in the day that wounded three IDF soldiers, including one with serious injuries.\n\nEarlier in the day, IDF fighter jets struck a series of Hezbollah terror targets, including weapons inside a truck, terrorist infrastructure, and a military compound in the areas of Khiam and Kfarhamam in southern Lebanon, the IDF Spokesperson said.\n\nSince the October 7 invasion of Israel by Hezbollah’s fellow Iranian proxy in Gaza, the Hamas terrorist organization, 227 people have been killed in Lebanon, including 166 Hezbollah fighters and 27 civilians.\n\nThere have been daily rocket and anti-tank guided missile attacks fired at Israel from Lebanon by Hezbollah since October 8 and Israel Defense Forces have responded to each attack with artillery fire and air strikes targeting Hezbollah infrastructure.\n\nOn October 7, Hamas-led terrorists tortured and slaughtered some 1,200 people, and abducted 253 others, dragging them into Gaza captivity. Israel has managed to free 110 of those hostages so far, but following credible intelligence reports, the Jerusalem government has notified the families of 31 others that their loved ones are no longer living.\n\nNearly 100,000 Israelis living along the northern border with Lebanon evacuated their homes shortly after the October 7 at the urging of the Israel Defense Forces, as did a similar number of Israelis who fled the south. All have become internal refugees, unable to return home due to the ongoing war.\n\nTens of thousands of Lebanese citizens have likewise left their homes in southern Lebanon to flee the fighting — and the approaching full-scale war between Israel and Hezbollah that seems increasingly likely."
  },
  {
    "id": 27,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-07T23:15:00+00:00",
    "url": "https://www.baltimoresun.com/2024/02/07/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american-troops/",
    "source": "GDELT",
    "message": "By QASSIM ABDUL-ZAHRA, LOLITA C. BALDOR and AAMER MADHANI (Associated Press)\n\nBAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah announced Abu Bakr’s death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. Kataib Hezbollah is part of that group and officials have pointed to KH as a key suspect in the Jordan attack.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 28,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-07T23:15:00+00:00",
    "url": "https://www.sun-sentinel.com/2024/02/07/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american-troops/",
    "source": "GDELT",
    "message": "By QASSIM ABDUL-ZAHRA, LOLITA C. BALDOR and AAMER MADHANI (Associated Press)\n\nBAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah announced Abu Bakr’s death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. Kataib Hezbollah is part of that group and officials have pointed to KH as a key suspect in the Jordan attack.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 29,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T00:00:00+00:00",
    "url": "https://isp.netscape.com/news/world/story/0001/20240207/bddd82ed18dd94f53e81cbc71d25049a",
    "source": "GDELT",
    "message": "US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops\n\nBAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report.\n\n© Copyright The Associated Press. All rights reserved. The information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press."
  },
  {
    "id": 30,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T00:00:00+00:00",
    "url": "https://www.news-gazette.com/news/nation-world/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american/article_8747ddbf-ffd3-5b43-8679-63e133f1563b.html",
    "source": "GDELT",
    "message": "The U.S. military says a U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region"
  },
  {
    "id": 31,
    "title": "US Strike Kills Pro - Iran Commander In Baghdad",
    "date": "2024-02-07T23:30:00+00:00",
    "url": "https://www.ibtimes.com/us-strike-kills-pro-iran-commander-baghdad-3724054",
    "source": "GDELT",
    "message": "An American air strike in Iraq on Wednesday killed a senior commander from a pro-Iran armed group who was involved in attacks on Washington's troops in the region, the US military said.\n\nWashington launched a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28, and the US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members.\"\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM, which said there are \"no indications of collateral damage or civilian casualties at this time.\"\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nA member of Kataeb Hezbollah -- which announced it was suspending violence against US forces after the deadly Jordan attack -- confirmed a commander who was responsible for the \"military file\" in Syria had been killed, identifying him as Abu Baqr al-Saadi.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries now integrated into Iraq's regular security forces, also confirmed Saadi's death in a statement.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Machtal.\n\nAn AFP photographer said security forces deployed in the neighbourhood, barring access to it after the attack.\n\nLater in the evening the remains of a car were removed from the area.\n\nUS and allied troops have been attacked more than 165 times in the Middle East since mid-October in a campaign waged by Iran-backed armed groups angered by US support for Israel in the war in Gaza.\n\nThe United States considers Kataeb Hezbollah -- which Washington says may have been involved in the Jordan attack -- a terrorist group.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in the US strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned on Sunday.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nThe United States and Iraq opened talks on the future of the US-led troop presence in January, following a request by the Iraqi prime minister for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 32,
    "title": "Iran strongly condemns  American state terrorism  in Iraq",
    "date": "2024-02-08T16:00:00+00:00",
    "url": "https://www.presstv.ir/Detail/2024/02/08/719716/Iran-strongly-condemns-",
    "source": "GDELT",
    "message": "Iran has strongly condemned the “terrorist act of the American government inside Iraq, which led to the martyrdom of several members of the resistance forces against terrorism”.\n\nThe assassination of Abu Baqir al-Saadi, one of the senior commanders of the fight against terrorism and Daesh, and others is “a clear example of American state terrorism”, Foreign Ministry spokesman Nasser Kan’ani said on Thursday.\n\nThe US military admitted responsibility for a drone strike in Baghdad Wednesday night, which killed three people, including the senior commander of Iraq's Kata'ib Hezbollah resistance group.\n\nAbu Baqir al-Saadi was one of the senior commanders of the fight against terrorism and Daesh.\n\nKan’ani said the assassination is a \"violation of national sovereignty\" and \"territorial integrity of Iraq\" and against international laws and regulations.\n\n“The aggressive act of the terrorist CENTCOM forces in Baghdad was carried out in line with the continuation of the full support of the American government for the crimes of the Zionist regime against the oppressed people of Palestine,” he said.\n\nThe spokesman extended his condolences to the Iraqi nation and government and the families of those assassinated in the attack.\n\nThe attack came nearly a week after the United States carried out a flurry of airstrikes across Iraq and neighboring Syria, killing nearly 40 people.\n\nKan’ani said the continuation of “such adventures” by the US is a threat to regional and international peace and security.\n\nHe underlined the responsibility of the international community as well as the United Nations Security Council in preventing illegal and unilateral actions and attacks by the United States in the region and staving off the expansion of crisis and instability."
  },
  {
    "id": 33,
    "title": "US strike kills pro - Iran commander in Baghdad",
    "date": "2024-02-08T06:15:00+00:00",
    "url": "https://www.hurriyetdailynews.com/us-strike-kills-pro-iran-commander-in-baghdad-190508",
    "source": "GDELT",
    "message": "Tension high as US strike kills pro-Iran commander in Baghdad\n\nBAGHDAD\n\nAn American air strike in the Iraqi capital killed a senior commander from a pro-Iran armed group who was involved in attacks on Washington's troops in the region, the U.S. military has said.\n\nWashington launched a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighboring Jordan on Jan. 28, and the US Central Command (CENTCOM) said the commander killed on Feb. 7 was targeted \"in response to the attacks on U.S. service members.”\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on U.S. forces in the region,\" according to CENTCOM, which said there are \"no indications of collateral damage or civilian casualties at this time.”\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nKataeb Hezbollah - which announced it was suspending violence against U.S. forces after the deadly Jordan attack — confirmed a commander who was responsible for the \"military file\" in Syria had been killed, identifying him as Abu Baqr al-Saadi.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries — of which Kataeb Hezbollah is part — now integrated into Iraq's regular security forces, also confirmed Saadi's death in a statement.\n\n'Playing with fire'\n\nAn AFP photographer said security forces deployed in the neighbourhood, barring access to it after the attack.\n\nLater in the evening the remains of a car were removed from the area.\n\nReacting to the commander's death, Iraq's pro-Iran Al-Nujaba movement in a statement promised a \"targeted retaliation\", assuring that \"these crimes will not go unpunished\".\n\nThe group added that American \"violations\" will not cease without \"a firm official position from the Iraqi government\".\n\nHamas also condemned a \"violation of Iraq's sovereignty and security\", according to a statement.\n\nU.S. and allied troops have been attacked more than 165 times in the Middle East since mid-October in a campaign waged by Iran-backed armed groups angered by U.S. support for Israel in the war in Gaza.\n\nThe United States considers Kataeb Hezbollah — which Washington says may have been involved in the Jordan attack — a terrorist group.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in the U.S. strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned on Sunday.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nThe United States and Iraq opened talks on the future of the U.S.-led troop presence in January, following a request by the Iraqi prime minister for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 34,
    "title": "US drone strike kills two pro - Iran militias in Baghdad",
    "date": "2024-02-08T04:00:00+00:00",
    "url": "https://www.iraqinews.com/iraq/us-drone-strike-kills-two-pro-iran-militias-in-baghdad/",
    "source": "GDELT",
    "message": "Baghdad – A drone strike on Wednesday hit a vehicle in the Iraqi capital Baghdad, killing two commanders of a pro-Iran group, a security source and a group member said.\n\nThe attack comes as tensions soar with the United States carrying out strikes on pro-Iran groups in Iraq and Syria amid the war in the Gaza Strip.\n\nOne of those killed was a commander of the Kataeb Hezbollah group in charge of military affairs in Syria, a member of the pro-Iran Iraqi group told AFP on condition of anonymity.\n\nThe source named the commander as Abu Baqr al-Saadi.\n\nThe security source also reported the deaths of two officials from Kataeb Hezbollah, which has taken part in the past in attacks on US forces in Iraq.\n\nThere was no immediate claim of responsibility for the drone strike.\n\nBut it came nearly a week after the United States struck 85 targets at seven different sites in Iraq and neighbouring Syria of Iranian and pro-Iranian forces.\n\nThose strikes were in retaliation for an attack at the end of January on a base in Jordan that killed three US soldiers.\n\nUS and allied troops have been attacked more than 165 times in the Middle East since mid-October in a campaign waged by Iran-backed armed groups angered by US support for Israel in the war in Gaza.\n\nThe United States considers Kataeb Hezbollah a terrorist group, and officials in Washington had said they believed the group was behind the Jordan attack.\n\nAt the end of January the pro-Iran group said it was suspending its attacks against US forces.\n\nEarlier a security source said the drone had fired three rockets at a 4X4 car in the east Baghdad neighbourhood of Machtal that targeted two officials from the Kataeb Hezbollah.\n\nAnother security official had said the vehicle carried an official from Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries now integrated into Iraq’s regular security forces.\n\nAn AFP photographer said security forces deployed in the neighbourhood barring access to it after the attack.\n\nLater in the evening the carcass of a car was removed from the area.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed in Friday’s US strikes and 36 people wounded. The Syrian Observatory for Human Rights war monitor said at least 23 pro-Iranian fighters were killed in Syria.\n\n“Targeting the Hashed al-Shaabi is playing with fire,” the group’s leader Faleh al-Fayyad warned on Sunday.\n\nThe United States and Iraq have opened talks on the future of the US-led troop presence in January, following a request by the Iraqi prime minister for a timetable for their withdrawal.\n\nThe United States has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are deployed in areas outside government control."
  },
  {
    "id": 35,
    "title": "US drone strike kills militia leader in Iraq",
    "date": "2024-02-08T14:00:00+00:00",
    "url": "https://www.sunstar.com.ph/network/us-drone-strike-kills-militia-leader-in-iraq",
    "source": "GDELT",
    "message": "BAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for \"directly planning and participating in attacks\" on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah's operations in Syria. Kataeb Hezbollah later announced his death \"following the bombing of the American occupation forces\" in a statement.\n\nThose officials spoke on condition of anonymity because they weren't authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said \"there are no indications of collateral damage or civilian casualties at this time.\" It added that the U.S. \"will not hesitate to hold responsible all those who threaten our forces' safety.\"\n\nFragile relations\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington's support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran's Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah."
  },
  {
    "id": 36,
    "title": "Drone strike in Baghdad kills at least one member of Iran - backed militias",
    "date": "2024-02-07T20:15:00+00:00",
    "url": "https://www.dailymail.co.uk/news/article-13057857/drone-strike-baghdad-iran-iraq-militia.html",
    "source": "GDELT",
    "message": "President Joe Biden last week promised he would avenge the killing of three American soldiers at a time of his choosing.\n\nThat came at 9:30pm local time when a U.S. missile destroyed a car in the Iraqi capital Baghdad, killing at least one commander of the Iran-backed Kataib Hezbollah militia, blamed for the attack that on an American base in Jordan last month.\n\nWitnesses reported hearing several loud blasts reverberate across the city.\n\nTwo officials with Iranian-backed militias in Iraq said that one of those killed was Wissam Mohammed 'Abu Bakr' al-Saadi, the commander in charge of Kataib Hezbollah's operations in Syria.\n\nU.S. Central Command confirmed that it had carried out 'a unilateral strike in Iraq in response to the attacks on U.S. service members, killing a Kataib Hezbollah commander responsible for directly planning and participating in attacks on U.S. forces in the region.'\n\nIt added that there were no signs of collateral damage or civilian casualties.\n\nPeople inspect the vehicle targeted by an airstrike in Baghdad, Iraq on February 07, 2024. Witnesses said at least three explosions were heard across the Iraqi capital\n\nTwo officials with Iranian-backed militias in Iraq said that one of those killed was Wissam Mohammed 'Abu Bakr' al-Saadi (above), the commander in charge of Kataib Hezbollah's operations in Syria\n\nTwo officials with Iranian-backed militias said that one of those killed was Wissam Mohammed 'Abu Bakr' al-Saadi, the commander in charge of Kataib Hezbollah's operations in Syria.\n\nA senior U.S. official told DailyMail.com that the strike was part of the response authorized by President Joe Biden last week.\n\nThe January 28 attack killed Specialist Kennedy Ladon Sanders, 24, Specialist Breonna Moffett, 23, and Sgt. William Rivers, 46, and injured more than 40 other troops at a base inside Jordan.\n\nA low-flying enemy drone was not detected by defenses at their base, according to the initial findings of an investigation.\n\nThe soldiers died as they slept at the base, known as Tower 22.\n\n'We will strive to be worthy of their honor and valor. We will carry on their commitment to fight terrorism,' said Biden as he promised action last week.\n\n'And have no doubt — we will hold all those responsible to account at a time and in a manner our choosing.'\n\nOfficials made clear that the response would take weeks to play out, with multiple strikes and less visible actions.\n\n'The first thing you see won't be the last thing,' is how White House national security spokesman John Kirby put it.\n\nThe U.S. blamed the Islamic Resistance in Iraq, an umbrella group of Iran-backed militias, for the attack in Jordan. Officials said they suspected Kataib Hezbollah in particular of leading it.\n\nU.S. Central Command said its forces conducted a 'unilateral strike' at 9:30pm local time\n\nU.S. Army Reserve Sgt. William Jerome Rivers, Spc. Breonna Moffett and Spc. Kennedy Ladon Sanders, who were killed in a drone attack on an outpost in northeast Jordan\n\nMembers of an Iraqi Shiite militant group attend the funeral of a fighter with Kataib Hezbollah. US officials believe the group was behind a drone attack that killed three Americans\n\nAs pressure grew, the group last Tuesday said it was pausing its military operations.\n\n'As we announce the suspension of military and security operations against the occupation forces - in order to prevent embarrassment of the Iraqi government - we will continue to defend our people in Gaza in other ways,' said the group's Secretary-General Abu Hussein al-Hamidawi.\n\nThe American response began last week with strikes at targets in Iraq and Syria. They were followed days later by attacks on Houthi forces in Yemen, who have been harassing international shipping in the Red Sea.\n\n'These Iranian-backed Houthi targets included multiple underground storage facilities, command and control, missile systems, UAV storage and operations sites, radars, and helicopters,' said U.S. Central Command.\n\nAnd on Wednesday night, U.S. forces struck in the heart of Baghdad, hitting a vehicle on a main road in the Mashtal neighborhood of the city.\n\nA crowd quickly gathered security forces closed off the heavily fortified Green Zone, home to many diplomatic compounds, amid calls to storm the U.S. embassy.\n\nIran-backed militias have taken on new significance since Hamas attacked Israel on October 7, stoking a regional conflict by targeting American interests.\n\nYemen's Houthis have emerged as one of the most dangerous foes, launching missile attacks on warships as well as commercial shipping transiting to and from the Suez Canal."
  },
  {
    "id": 37,
    "title": "US strike kills pro - Iran commander in Baghdad",
    "date": "2024-02-08T04:45:00+00:00",
    "url": "https://www.bssnews.net/international/172396",
    "source": "GDELT",
    "message": "BAGHDAD, Feb 8, 2024 (BSS/AFP) - An American air strike in Iraq on Wednesday killed a senior commander from a pro-Iran armed group who was involved in attacks on Washington's troops in the region, the US military said.\n\nWashington launched a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28, and the US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members\".\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM, which said there are \"no indications of collateral damage or civilian casualties at this time\".\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nA member of Kataeb Hezbollah -- which announced it was suspending violence against US forces after the deadly Jordan attack -- confirmed a commander who was responsible for the \"military file\" in Syria had been killed, identifying him as Abu Baqr al-Saadi.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries now integrated into Iraq's regular security forces, also confirmed Saadi's death in a statement.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Machtal.\n\n- 'Playing with fire' -\n\nAn AFP photographer said security forces deployed in the neighbourhood, barring access to it after the attack.\n\nLater in the evening the remains of a car were removed from the area.\n\nReacting to the commander's death, Iraq's pro-Iran Al-Nujaba movement in a statement promised a \"targeted retaliation\", assuring that \"these crimes will not go unpunished\".\n\nThe group added that American \"violations\" will not cease without \"a firm official position from the Iraqi government\".\n\nHamas also condemned a \"violation of Iraq's sovereignty and security\", according to a statement.\n\nUS and allied troops have been attacked more than 165 times in the Middle East since mid-October in a campaign waged by Iran-backed armed groups angered by US support for Israel in the war in Gaza.\n\nThe United States considers Kataeb Hezbollah -- which Washington says may have been involved in the Jordan attack -- a terrorist group.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in the US strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned on Sunday.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nThe United States and Iraq opened talks on the future of the US-led troop presence in January, following a request by the Iraqi prime minister for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 38,
    "title": "Ukraine calls for  urgent  military help after fresh Russian strikes",
    "date": "2024-02-08T02:45:00+00:00",
    "url": "https://mb.com.ph/2024/2/8/ukraine-calls-for-urgent-military-help-after-fresh-russian-strikes",
    "source": "GDELT",
    "message": "N/A"
  },
  {
    "id": 39,
    "title": "UAE condemns terrorist attack in Turkey",
    "date": "2024-02-07T20:45:00+00:00",
    "url": "https://www.khaleejtimes.com/uae/uae-condemns-terrorist-attack-in-turkey-3",
    "source": "GDELT",
    "message": "Security officers check the site where two attackers were killed outside a courthouse in Istanbul, Turkey, on Tuesday. Photo: AP\n\nPublished: Wed 7 Feb 2024, 11:30 PM\n\nThe UA has strongly condemned the terrorist attack in Istanbul, Turkey, which resulted in a number of deaths and injuries to innocent people.\n\nIn a statement, the Ministry of Foreign Affairs (MoFA) affirmed the UAE's support for all efforts by the Turkish government to apprehend those responsible for this terrorist act, as well as for all the measures implemented by Turkey to protect its security and stability.\n\nFurthermore, the Ministry expressed the UAE's strong condemnation of these criminal acts, and its permanent rejection of all forms of violence and terrorism aimed at undermining security and stability in contravention of international law.The Ministry expressed its sincere condolences and sympathy to the government and people of Türkey, and to the families of the victims of this heinous crime, as well as its wishes for a speedy recovery for all the injured.\n\nALSO READ:"
  },
  {
    "id": 40,
    "title": "Netanyahu Rejects Hamas Deal , U . S . Kills Kataib Hezbollah Commander in Iraq",
    "date": "2024-02-08T02:15:00+00:00",
    "url": "https://legalinsurrection.com/2024/02/netanyahu-rejects-hamas-deal-u-s-kills-kataib-hezbollah-commander-in-iraq/",
    "source": "GDELT",
    "message": "Here are a few major updates from the Middle East!\n\nNo Hamas Deal\n\nIsraeli Prime Minister Benjamin Netanyahu rejected Hamas’s “delusional demands.”\n\nThe terrorist group demanded a four-and-a-half-month truce. The terrorists would release the hostages in three stages along with Palestinian prisoners in Israel:\n\nPhase one: A 45-day pause in fighting during which all Israeli women hostages, males under 19, the elderly and sick would be exchanged for Palestinian women and children held in Israeli jails. Israeli forces would withdraw from populated areas of Gaza, and the reconstruction of hospitals and refugee camps would begin.\n\nA 45-day pause in fighting during which all Israeli women hostages, males under 19, the elderly and sick would be exchanged for Palestinian women and children held in Israeli jails. Israeli forces would withdraw from populated areas of Gaza, and the reconstruction of hospitals and refugee camps would begin. Phase two: Remaining male Israeli hostages would be exchanged for Palestinian prisoners and Israeli forces leave Gaza completely.\n\nRemaining male Israeli hostages would be exchanged for Palestinian prisoners and Israeli forces leave Gaza completely. Phase three: Both sides would exchange remains and bodies. The proposed deal would also see deliveries of food and other aid to Gaza increase. By the end of the 135-day pause in fighting, Hamas said negotiations to end the war would have concluded.\n\nThe prisoners, including the women and children, are in prison because they tried to attack Israel. Yes, women and children can be terrorists.\n\nReleasing prisoners would be a mistake. Look at Hamas leader Sinwar, a former Israeli prisoner exchanged for one Israeli soldier.\n\nIsrael learned her lesson:\n\nSpeaking with reporters during a press conference in Jerusalem, Netanyahu insisted that he had made no specific promises regarding the release of Palestinian security prisoners with blood on their hands, or any ratio for Palestinian prisoners to be freed in return for hostages in a potential deal, declaring that Israel “has not committed to anything.” “There is supposed to be some kind of negotiation via the intermediaries. But right now, given what I see from the response by Hamas [to the Israel-backed framework for talks on a deal], they’re not there,” he said. “Surrender to Hamas’s delusional demands, that we’ve just heard, not only would not bring about the freedom of the hostages, but it would only invite an additional slaughter; it would invite disaster for Israel that no Israeli citizens want,” he said.\n\nNetanyahu has felt pressure from the loved ones of the hostages, released hostages, and others around the world to take deals to bring them home.\n\nNetanyahu and the IDF know the best way to preserve Israel is to eliminate Hamas:\n\n“The victory is within reach,” he stated, predicting that the war would be won in a “matter of months” rather than years or decades. Netanyahu’s comments echoed those of IDF Chief of Staff Lt. Gen. Herzi Halevi, who said on Tuesday during a visit to northern Gaza that the hostages’ return “won’t happen without military pressure.” Calling the military’s accomplishments in the offensive against Hamas “unprecedented,” Netanyahu said that 20,000 Hamas fighters are dead or injured — more than half the Hamas fighting force, with 18 of its 24 battalions no longer functional. Israel’s “valiant fighters” have “proved that everything they told us was impossible was possible… and more,” he added, taking aim at “experts,” TV commentators and those in the international community who predicted that the ground offensive would fail.\n\nU.S. Drone Strike in Iraq\n\nThe U.S. conducted a drone strike in Iraq, killing Senior commander Abu Baqir al-Saadi of Kataib Hezbollah, a terrorist group backed by Iran.\n\nThe Pentagon connected al-Saadi to the attack in Jordan that killed three American soldiers:\n\nSgt. William Jerome Rivers, 46, of Carrollton, Ga.\n\nSpc. Kennedy Ladon Sanders, 24, of Waycross, Ga.\n\nSpc. Breonna Alexsondria Moffett, 23, of Savannah, Ga.\n\nThe drone strike occurred in eastern Baghdad.\n\nAmerica only confirmed one death.\n\nOne source said the strike killed three people and hit a vehicle “used by Iraq’s Popular Mobilization Forces (PMF), a state security agency composed of dozens of armed groups, many of them close to Iran.”\n\nUSCENTCOM Conducts Strike Killing Kata’ib Hezbollah Senior Leader At 9:30 p.m. February 7, U.S. Central Command (CENTCOM) forces conducted a unilateral strike in Iraq in response to the attacks on U.S. service members, killing a Kata’ib Hezbollah commander responsible for… pic.twitter.com/JW7Zy8QV7E — U.S. Central Command (@CENTCOM) February 7, 2024\n\n﻿\n\nDonations tax deductible\n\nto the full extent allowed by law."
  },
  {
    "id": 41,
    "title": "Reports : Israeli army kills three Palestinians in West Bank raid",
    "date": "2024-02-08T04:00:00+00:00",
    "url": "https://news.yahoo.com/reports-israeli-army-kills-three-025647841.html",
    "source": "GDELT",
    "message": "The Palestinian Ahmed Al-Sufi with a bandaged head looks on in the aftermath of an Israeli air strike, amid the ongoing conflict between Israel and the Palestinian militant group Hamas. Abed Rahim Khatib/dpa\n\nAccording to Israeli and Palestinian reports, three Palestinians were killed during an army operation in the West Bank on Wednesday.\n\nThe Israel Defense Forces (IDF) said one of the men was suspected of being involved in terrorist activities. According to the Israeli military, they wanted to arrest him, and had surrounded his house in the Nur Shams refugee camp in Tulkarm city in the north-western West Bank.\n\nThe other two people killed had tried to escape from the building. The military's claims could not initially be independently verified.\n\nThe IDF also fired rockets at the house, according to the Palestinian Ministry of Health in Ramallah. The authorities reported two deaths.\n\nThe armed wing of Palestinian President Mahmoud Abbas' Fatah party in the West Bank said that the three victims were members of the al-Aqsa Martyrs' Brigades. One of the men is said to have been a commander.\n\nA general strike was called in Tulkarm on Thursday.\n\nThe situation in the West Bank has worsened significantly since the start of the war between Israel and the the Palestinian militant organization Hamas in the Gaza Strip on October 7.\n\nAccording to the Ministry of Health, around 370 Palestinians have been killed in the West Bank since then. More than 60 Palestinians have been killed in West Bank confrontations with the Israeli military or militant Israeli settlers since the beginning of the year.\n\nIsrael took control of the West Bank and East Jerusalem in the 1967 Six-Day War. Hundreds of thousands of Jewish settlers now live there, surrounded by around 3 million Palestinians, who have Western backing to form their own state in both the West Bank and Gaza Strip.\n\nMeanwhile, fierce fighting and renewed attacks by Israel in the south of the Gaza Strip continued.\n\nThe Israeli army said on Wednesday that \"armed terrorist cells\" had been eliminated and numerous weapons had been seized. It went on to say that paratroopers had \"killed dozens of terrorists in Khan Younis over the past 24 hours.\"\n\nIn one incident in the west of Khan Younis, soldiers encountered three gunmen who fired anti-tank missiles at them. The three men and \"several other terror operatives\" were killed in close-quarter combat.\n\nHamas' armed wing, the al-Qassam Brigades, also described an attack on Israeli soldiers in the west of Khan Younis on Wednesday.\n\nThe United Nations expressed concern about the fate of the civilian population as Israeli ground troops advanced towards the city of Rafah, which lies on the border with Egypt.\n\n\"Their living conditions are abysmal — they lack the basic necessities to survive, stalked by hunger, disease and death,\" said UN Emergency Relief Coordinator Martin Griffiths in Geneva on Wednesday evening.\n\nAccording to UN figures, more than 1 million people are now living in cramped conditions in the city in the south of the Gaza Strip. That is four times as many as before the Gaza war started on October 7.\n\nThe war was triggered by the worst massacre in Israel's history, carried out by fighters from Hamas and other extremist Palestinian organizations on October 7 in Israel near the border with the Gaza Strip. More than 1,200 people were killed on the Israeli side.\n\nIsrael responded with massive airstrikes and a ground offensive in the Gaza Strip.\n\nAccording to Palestinian figures, more than 27,500 people have died in the Gaza Strip since then, Griffiths said. Further fighting in Rafah would cost even more lives. It would also make the already difficult humanitarian aid operations more difficult.\n\n\"To put it simply: This war must stop.\"\n\nPalestinian children look on as they stand by rubble and debris of destroyed houses and vehicles in the aftermath of an Israeli bombardment, amid the ongoing battles between Israel and the Palestinian militant group Hamas. Mohammed Talatene/dpa\n\nPalestinian children look on as they stand by rubble and debris of destroyed houses and vehicles in the aftermath of an Israeli bombardment, amid the ongoing battles between Israel and the Palestinian militant group Hamas. Mohammed Talatene/dpa"
  },
  {
    "id": 42,
    "title": "How Hamas Ended Up On US List Of Terrorist Groups – Analysis",
    "date": "2024-02-08T02:45:00+00:00",
    "url": "https://www.eurasiareview.com/08022024-how-hamas-ended-up-on-us-list-of-terrorist-groups-analysis/",
    "source": "GDELT",
    "message": "By VOA\n\nBy Linda Gradstein\n\nAlong with the United States, several countries have listed Hamas as a terrorist organization. The group considers itself a liberation movement for Palestinians against Israeli occupation.\n\nThe U.S. has designated Hamas as a terrorist organization three times, says Matthew Levitt, a specialist on Hamas at the Washington Institute of Near East Policy.\n\n“The first time predates the current terrorism lists and came in the process of the peace process under the Clinton administration in 1995,” he said. The Clinton White House had an executive order, a law banning groups that were threatening the peace process. That included Islamist groups like Hamas and Palestinian Islamic Jihad, and also Jewish extremist groups like Kach and Kahane Chai.”\n\nTwo years later, the U.S. created a new terrorism list.\n\n“Then in 1997, the State Department initiated its Foreign Terrorist Organization or FTO list, which is specific to terrorist groups,” Levitt said. “And Hamas was added to that list because of the acts of terrorism it was conducting not only because it was threatening the peace process but it was at that point carrying out shooting attacks, stabbing attacks and beginning to carry out suicide bombings quite frequently as well.”\n\nThe third time, according to Levitt, came after 9/11 attacks on the U.S. when the Bush administration created a special global terrorism list.\n\nLevitt explained how Hamas fits the definition of a terrorist organization.\n\n“The simple, most basic definition is targeting civilians for the purpose of effecting social or political change,” he said. Personally, I simplify it a little bit more: It’s about the tactic. Terrorism is a tactic and if you engage in this tactic of targeting civilians for the purpose of effecting social and political change then that act is an act of terrorism.”\n\nIn its 1988 manifesto, Hamas called for the destruction of Israel. Years later, in 2017, Hamas dropped that language.\n\nBut it continued to incessantly fire rockets into Israeli communities.\n\nOn October 7, thousands of Hamas gunmen stormed into Israel killing 1,200 people, most of them civilians, according to Israeli tallies, and took over more than 20 Israeli kibbutzim and other communities. Among the dead were at least 30 Israelis who also had U.S. citizenship.\n\nIsrael responded to the Hamas attack with a war against Hamas in Gaza.\n\nThe Hamas-run Palestinian Health Ministry in Gaza says more than 27,000 Palestinians have been killed, although that includes both fighters and civilians. Israel says it has killed an estimated 10,000 Hamas fighters, about one third of Hamas’s total force.\n\nIsrael says its forces in Gaza are carrying out precision attacks and are not targeting civilians. It says civilian deaths that are occurring are unintentional.\n\nThe growing civilian death toll and humanitarian crisis in Gaza have led to growing international pressure on Israel to stop the war. The U.S. says that Gaza must eventually be run by a revitalized Palestinian Authority, an idea that Israeli Prime Minister Benjamin Netanyahu has rejected.\n\nHamas, which has ruled Gaza since 2007, is rejecting it too. In a recent interview with a Kuwaiti journalist, former Hamas senior official Khaled Mashaal, who lives in Qatar, rejected the idea of recognizing Israel, and said that the October 7 attack proved that the idea of liberating Palestine “from the river to the sea” is realistic.\n\nMashaal said Hamas has used its rule of Gaza to build up the resistance and all its means. He said the weapons, the weapons production, the planning, the training and the tunnels were built, keeping their backs safe.\n\nThere are 2.3 million civilians living in Gaza, an enclave just 25 miles long.\n\nIsraeli army spokesman Daniel Hagari says Hamas has hidden its fighters in civilian infrastructure.\n\n“Hamas uses hospitals as terror infrastructures,” he said. “Hamas has turned hospitals into command-and-control centers and hideouts for Hamas terrorists and commanders.”\n\nIsraeli Prime Minister Benjamin Netanyahu says he is committed to destroying Hamas as a military power. But four months into the war, Hamas remains in control in parts of Gaza, making it unclear what the future of the enclave will be"
  },
  {
    "id": 43,
    "title": "US strike kills senior Kataib Hezbollah commander in Baghdad",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.middleeasteye.net/news/us-strike-kills-senior-kataib-hezbollah-commander-baghdad",
    "source": "GDELT",
    "message": "N/A"
  },
  {
    "id": 44,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T01:30:00+00:00",
    "url": "https://www.record-bee.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 45,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T05:45:00+00:00",
    "url": "https://www.ukiahdailyjournal.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 46,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.times-standard.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 47,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T04:45:00+00:00",
    "url": "https://www.mendocinobeacon.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 48,
    "title": "Strike in Baghdad kills figure linked to attack on US troops",
    "date": "2024-02-08T01:45:00+00:00",
    "url": "https://www.redbluffdailynews.com/2024/02/07/strike-in-baghdad-kills-militia-leader-linked-to-attack-on-us-troops/",
    "source": "GDELT",
    "message": "By Qassim Abdul-Zahra, Lolita C. Baldor and Aamer Madhani | Associated Press\n\nBAGHDAD — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 49,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks",
    "date": "2024-02-08T18:30:00+00:00",
    "url": "https://norfolkdailynews.com/news/national/news_national/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks/article_f0f4f14e-c696-11ee-970e-63e2c7019193.html",
    "source": "GDELT",
    "message": "BEIRUT (AP) — A drone attack on a base housing U.S. troops in eastern Syria killed six allied Kurdish fighters late Sunday, in the first significant attack in Syria or Iraq since the U.S. launched retaliatory strikes over the weekend against Iran-backed militias that have been targeting its …"
  },
  {
    "id": 50,
    "title": "Iraq Slams US After Strike Kills Pro - Iran Commander",
    "date": "2024-02-08T12:45:00+00:00",
    "url": "https://www.ibtimes.com.au/iraq-slams-us-after-strike-kills-pro-iran-commander-1846954",
    "source": "GDELT",
    "message": "Iraq on Thursday condemned a US air strike that killed a senior commander from a pro-Iran armed group accused of having been involved in attacks on American troops in the region.\n\nThe US attack on Wednesday came after a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28.\n\nThe US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members\".\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM.\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nIraqi authorities slammed the strike as a \"blatant assassination\" in a residential neighbourhood of Baghdad.\n\n\"The international coalition is completely overstepping the reasons and objectives for which it is present on our territory,\" said Yehia Rasool, the military spokesman for Iraq's prime minister.\n\n\"This path pushes the Iraqi government more than ever before to end the coalition's mission which has become a factor of instability for Iraq,\" he added.\n\nHe was referring to the US-led international military alliance formed in 2014 to fight the Islamic State group -- the year the jihadist group overran nearly a third of Iraq's territory.\n\nKataeb Hezbollah -- which announced it was suspending its attacks on US forces after the deadly Jordan attack -- said one of its commanders had been killed, identifying him as Abu Baqr al-Saadi. He was responsible for \"military affairs\" in Syria, an official from the group told AFP.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries -- of which Kataeb Hezbollah is part -- now integrated into Iraq's regular security forces, also confirmed Saadi's death.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- had died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Mashtal.\n\nThe latest US strike sparked widespread condemnation in Iraq, with a pro-Iran parliamentary coalition dubbing it an attack on \"Iraqi sovereignty\".\n\nWashington has \"crossed all red lines by targeting regular forces and men who contributed to defeating Islamic State terrorism,\" said the Coordination Framework, an alliance of pro-Iran Shiite parties that includes the Hashed al-Shaabi.\n\nIraq's pro-Iran Al-Nujaba movement in a statement promised a \"targeted retaliation\", assuring that \"these crimes will not go unpunished\".\n\nThe group added that American \"violations\" will not cease without \"a firm official position from the Iraqi government\".\n\nUS and allied troops have been targeted more than 165 times in the Middle East since mid-October in attacks linked to a surge in violence over the Israel-Hamas war in Gaza.\n\nThe majority of the attacks have been claimed by the Islamic Resistance in Iraq, a loose alliance of Iran-backed groups angered by US support for Israel in the war in Gaza.\n\nLebanon's Iran-backed Hezbollah group said \"resistance movements in the region have total confidence\" in their Iraqi counterparts and the commander's killing will only encourage them to continue acts they say are in support of Palestinians.\n\nThe United States considers Kataeb Hezbollah a terrorist group.\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in US strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq and Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned later.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nIraq analyst Sajad Jiyad, of the New York-based Century Foundation think tank, said he expected the tensions to continue to spiral.\n\n\"These groups have a lot of capabilities, they are active in several countries now, the US is willing to engage, to retaliate, to kill members of these groups,\" he said.\n\n\"The US is giving no indication it is going to pull back or stand down its military activity in the Middle East,\" he said, adding \"it is very difficult to suddenly see an end to the tensions.\"\n\nThe United States and Iraq opened talks on the future of the US-led troop presence in January, following a request by Iraqi Prime Minister Mohamed Shia al-Sudani for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 51,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T04:00:00+00:00",
    "url": "https://www.channelnewsasia.com/world/us-drone-strike-iraq-kills-militia-leader-4108261",
    "source": "GDELT",
    "message": "BAGHDAD: A US drone strike blew up a car in the Iraqi capital on Wednesday (Feb 7) night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the US military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who US officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the US embassy.\n\nThere were conflicting reports on the number of those killed, with US officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah announced Abu Bakr’s death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they were not authorised to speak to journalists.\n\nIn a statement, US Central Command said “there are no indications of collateral damage or civilian casualties at this time”. It added that the US “will not hesitate to hold responsible all those who threaten our forces’ safety”."
  },
  {
    "id": 52,
    "title": "Iraq slams US after strike kills pro - Iran commander",
    "date": "2024-02-08T18:30:00+00:00",
    "url": "https://www.spacewar.com/afp/240208153416.2gt1u6gy.html",
    "source": "GDELT",
    "message": "Iraq slams US after strike kills pro-Iran commander\n\n\n\nBaghdad, Feb 8 (AFP) Feb 08, 2024\n\n\n\nIraq on Thursday condemned a US air strike that killed a senior commander from a pro-Iran armed group accused of having been involved in attacks on American troops in the region.\n\nThe US attack on Wednesday came after a wave of strikes on Iran-linked targets in Iraq and Syria last week following the killing of three American troops in neighbouring Jordan on January 28.\n\nThe US Central Command (CENTCOM) said the commander killed Wednesday was targeted \"in response to the attacks on US service members\".\n\nThe strike killed \"a Kataeb Hezbollah commander responsible for directly planning and participating in attacks on US forces in the region,\" according to CENTCOM.\n\n\"The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces' safety,\" it added.\n\nIraqi authorities slammed the strike as a \"blatant assassination\" in a residential neighbourhood of Baghdad.\n\n\"The international coalition is completely overstepping the reasons and objectives for which it is present on our territory,\" said Yehia Rasool, the military spokesman for Iraq's prime minister.\n\n\"This path pushes the Iraqi government more than ever before to end the coalition's mission which has become a factor of instability for Iraq,\" he added.\n\nHe was referring to the US-led international military alliance formed in 2014 to fight the Islamic State group -- the year the jihadist group overran nearly a third of Iraq's territory.\n\nKataeb Hezbollah -- which announced it was suspending its attacks on US forces after the deadly Jordan attack -- said one of its commanders had been killed, identifying him as Abu Baqr al-Saadi. The commander, whose funeral began on Thursday afternoon, was responsible for \"military affairs\" in Syria, an official from the group told AFP.\n\nThe Hashed al-Shaabi, a coalition of mainly pro-Iran paramilitaries -- of which Kataeb Hezbollah is part -- now integrated into Iraq's regular security forces, also confirmed Saadi's death.\n\nAn interior ministry official said a total of three people -- two Kataeb Hezbollah leaders and their driver -- had died in the strike, which was carried out by a drone in the east Baghdad neighbourhood of Mashtal.\n\n\n\n- 'Red lines' -\n\n\n\nThe latest US strike sparked widespread condemnation in Iraq, with a pro-Iran parliamentary coalition dubbing it an attack on \"Iraqi sovereignty\".\n\nWashington has \"crossed all red lines by targeting regular forces and men who contributed to defeating Islamic State terrorism,\" said the Coordination Framework, an alliance of pro-Iran Shiite parties that includes the Hashed al-Shaabi.\n\nIraq's pro-Iran Al-Nujaba movement in a statement promised a \"targeted retaliation\", saying that \"these crimes will not go unpunished\".\n\nThe group added that American \"violations\" will not cease without \"a firm official position from the Iraqi government\".\n\nIran joined in the condemnation on Thursday, with Nasser Kanani, spokesman for the Iranian Ministry of Foreign Affairs, calling the strike an act of \"adventurism\" that was \"a threat to regional and international peace and stability\".\n\nUS and allied troops have been targeted more than 165 times in the Middle East since mid-October in attacks linked to a surge in violence over the Israel-Hamas war in Gaza.\n\nThe majority of the attacks have been claimed by the Islamic Resistance in Iraq, a loose alliance of Iran-backed groups angered by US support for Israel in the war in Gaza.\n\nLebanon's Iran-backed Hezbollah group said \"resistance movements in the region have total confidence\" in their Iraqi counterparts and the commander's killing would only encourage them to continue acts they say are in support of Palestinians.\n\nThe United States considers Kataeb Hezbollah a terrorist group.\n\n\n\n- 'Playing with fire' -\n\n\n\nThe Hashed al-Shaabi has said that 16 of its fighters were killed and 36 people wounded in US strikes on Friday, which Washington said hit 85 targets at seven different sites in Iraq and Syria.\n\n\"Targeting the Hashed al-Shaabi is playing with fire,\" the group's leader Faleh al-Fayyad warned later.\n\nThe Syrian Observatory for Human Rights war monitor said at least 29 pro-Iran fighters were killed in Syria.\n\nIraq analyst Sajad Jiyad, of the New York-based Century Foundation think tank, said he expected the tensions to continue to spiral.\n\n\"These groups have a lot of capabilities, they are active in several countries now, the US is willing to engage, to retaliate, to kill members of these groups,\" he said.\n\n\"The US is giving no indication it is going to pull back or stand down its military activity in the Middle East,\" he said, adding \"it is very difficult to suddenly see an end to the tensions.\"\n\nThe United States and Iraq opened talks on the future of the US-led troop presence in January, following a request by Iraqi Prime Minister Mohamed Shia al-Sudani for a timetable for their withdrawal.\n\nWashington has some 900 troops in Syria and 2,500 in Iraq as part of an international coalition against the Islamic State group.\n\nIts troops in Iraq are deployed at the invitation of Baghdad, but those in Syria are located in areas outside Syrian government control."
  },
  {
    "id": 53,
    "title": "Drone strike on vehicle in Baghdad kills at least one",
    "date": "2024-02-07T21:45:00+00:00",
    "url": "https://www.canberratimes.com.au/story/8514035/drone-strike-on-vehicle-in-baghdad-kills-at-least-one/?cs=14264",
    "source": "GDELT",
    "message": "Kataib Hezbollah fighters and commanders are part of the PMF. Three US troops were killed in January in a drone attack near the Jordan-Syria border that the Pentagon said bore the \"footprints\" of Kataib Hezbollah. The group then announced it was suspending military operations against US troops in the region."
  },
  {
    "id": 54,
    "title": "Bloodbath as 28 dead in Balochistan twin blasts",
    "date": "2024-02-08T04:00:00+00:00",
    "url": "https://www.thenews.com.pk/print/1155486-bloodbath-as-26-dead-in-balochistan-twin-blasts",
    "source": "GDELT",
    "message": "A damaged car is seen at the blast site in Pishin, Balochistan, in this still taken from a video on February 7, 2024. — Geo News\n\nQUETTA: Balochistan witnessed a bloodbath on Wednesday just a day ahead of the general election as two attacks caused the death of at least 28 people and injuries to many others.\n\n\n\nThe Balochistan chief minister has announced a three-day mourning over the loss of lives, Caretaker Information Minister Jan Achakzai said in a presser. He held India responsible for the twin attacks in Balochistan.\n\nIn the first attack, at least 16 people were killed and 25 injured after an explosion took place outside an independent candidate’s office in Pishin. The blast took place outside the political office of Asfand Yar Khan Kakar in Khanozai area. Kakar is contesting elections from NA-265 and PB-47 and PB-48.\n\nSpeaking to Geo News, Asfand Yar Kakar said the bomb was attached to a motorcycle outside his election office. “Eight of our workers were martyred and more than 18 injured in the explosion when the names of polling agents were being finalised in the election office,” he said.\n\nKakar himself was in Barshore when the blast happened and was on his way to Khanozai.\n\nThe injured people were shifted to the Tehsil Hospital, Khanozai, Medical Superintendent Dr Habib told Geo News. He said most of the injured were in critical condition.\n\nThe second blast took place outside the office of JUI-F candidate Maulana Abdul Wassay in Killa Saifullah district in which 12 people were killed and 25 others injured. In the attack, JUI-F leader and candidate for PB-3 Wassay remained unhurt as he was not in the office. Following the explosion, many vehicles caught fire.\n\nDeputy Commissioner Yasar Bazai told Geo News that most of the injured were in critical condition. “The Balochistan government is sending helicopters from Quetta to evacuate the injured,” he added. He said a high alert had been issued across the district. To ascertain the nature of the explosion, a bomb disposal squad team reached the site. The site has been sealed for investigation, he stated.\n\nTalking to Geo, Senior Superintendent of Police (SSP) Akhtar Achakzai said investigations into the nature of the explosion were underway. He said the JUI-F candidate was not at the election office when the blast took place. Security had been beefed up in the area.\n\nAddressing a press conference, Achakzai said the local administration had the authority to call the army, if necessary. The minister said terrorists would not succeed in their objectives adding that the war would continue till the elimination of last terrorist.\n\n“The terrorist state of India has targeted Balochistan through terrorism. We will avenge the martyrs, we will end India’s terrorist agenda. Our war will continue until the end of the last terrorist,” he said.\n\nThe minister assured that peaceful elections will be held in Balochistan tomorrow (today). “The people of Balochistan will come out and destroy the ambitions of terrorists,” Achakzai said.\n\nSpeaking about the injured, the minister said they would be sent to other cities if they could not be treated in Quetta.\n\nAchakzai said the government will continue to perform its responsibilities despite the tragic incident. He said Caretaker Balochistan Chief Minister Ali Mardan Khan Domki had sought a report from the home department on the explosions. “Such incidents are a conspiracy to sabotage the process of peaceful elections,” he said.\n\nSecretary health Balochistan told Geo News that emergency has been imposed across hospitals in Quetta and additional staff had also been called out. He said operation theatres were ready at the Trauma Centre, Civil Hospital, BMC, Benazir and Sheikh Zayed Hospital to treat the injured.\n\nMeanwhile, the Election Commission of Pakistan (ECP) has taken notice of the blast and sought a report from the Balochistan chief secretary and Inspector General of Police (IGP). A spokesperson for the ECP said directives had been issued to take action against those involved in such incidents.\n\nCondemnations poured in from all sides following the twin blasts.\n\nPresident Dr Arif Alvi strongly condemned the blasts and expressed deep grief and sorrow over the loss of precious lives. He sympathized with the family members of martyrs and prayed to Allah Almighty for peace and elevation of the ranks of departed souls.\n\nCaretaker Prime Minister Anwaar-ul-Haq Kakar condemned the loss of precious lives and sought a report from the chief secretary on the incidents. “Every attempt to sabotage the law & order situation will be thwarted,” he said, adding the government was determined to conduct the general elections peacefully.\n\nMeanwhile, Khyber Pakhtunkhwa Governor Haji Ghulam Ali, in a telephone call with Balochistan governor and chief minister, condemned the explosions.\n\nCaretaker Interior Minister Gohar Ejaz also condemned the attack in Pishin, expressing deep sorrow over the loss of precious lives. “Evil elements want to defame Pakistan by creating insecurity during elections,” the minister said, adding that those who play with the lives of innocent citizens will be dealt with an iron hand.\n\nIjaz said the government will take all possible steps to establish peace during the elections.\n\nThe Iranian Embassy in Islamabad also strongly condemned the terrorist attacks in Balochistan.\n\n“Iran condemns the terrorist attack in Balochistan in the strongest terms. Innocent civilians were martyred and injured in this terrorist attack,” a spokesperson for the Iranian Embassy said.\n\nThe spokesperson added that Iran offered its heartfelt condolences to the government and people of Pakistan in this hour of grief.\n\nMeanwhile, the ISIS/Daesh has claimed responsibility for both the attacks, in Killa Saifullah and Pishin."
  },
  {
    "id": 55,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T00:15:00+00:00",
    "url": "https://www.joplinglobe.com/region/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american/article_a2137cb3-ff68-5906-a706-2cd58bf7cb80.html",
    "source": "GDELT",
    "message": "Weather Alert\n\n...WIND ADVISORY IN EFFECT FROM 6 AM TO 6 PM CST THURSDAY... * WHAT...Southwest winds 20 to 30 mph with gusts up to 45 mph expected. * WHERE...Portions of southeast Kansas and central, southwest and west central Missouri. * WHEN...From 6 AM to 6 PM CST Thursday. * IMPACTS...Gusty winds could blow around unsecured objects. Tree limbs could be blown down and a few power outages may result. PRECAUTIONARY/PREPAREDNESS ACTIONS... Use extra caution when driving, especially if operating a high profile vehicle. Secure outdoor objects. &&"
  },
  {
    "id": 56,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T00:45:00+00:00",
    "url": "https://www.thesunchronicle.com/news/nation_world/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american/article_d491b6c0-46de-5a8c-990f-44d9c459ef61.html",
    "source": "GDELT",
    "message": "The U.S. military says a U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region"
  },
  {
    "id": 57,
    "title": "US drone strike in Baghdad kills high - ranking militia leader | News , Sports , Jobs",
    "date": "2024-02-08T08:45:00+00:00",
    "url": "https://www.ironmountaindailynews.com/opinion/columns/2024/02/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader/",
    "source": "GDELT",
    "message": "BAGHDAD (AP) — A U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.\n\nThe precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.\n\nSecurity forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.\n\nThere were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.\n\nThose officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nIn a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nThe strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nThere have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops’ lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.\n\nWednesday’s U.S. strike in Iraq’s capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran’s Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 58,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T08:45:00+00:00",
    "url": "https://www.wvtm13.com/article/us-drone-strike-iran-backed-militia-baghdad/46675127",
    "source": "GDELT",
    "message": "Advertisement US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops Share Copy Link Copy\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.The precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.There were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.Those officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.In a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”The strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.The U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.The Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.There have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.Wednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.On Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.The latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”Also on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.___Madhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 59,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T01:45:00+00:00",
    "url": "https://www.the-messenger.com/news/world/article_0b451bd3-69b7-5a3e-938a-8d463769c35d.html",
    "source": "GDELT",
    "message": "Madisonville, KY (42431)\n\nToday\n\nPartly cloudy skies this evening will become overcast overnight. Low near 45F. Winds SSE at 5 to 10 mph..\n\nTonight\n\nPartly cloudy skies this evening will become overcast overnight. Low near 45F. Winds SSE at 5 to 10 mph."
  },
  {
    "id": 60,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T09:30:00+00:00",
    "url": "https://www.mynbc5.com/article/us-drone-strike-iran-backed-militia-baghdad/46675127",
    "source": "GDELT",
    "message": "Advertisement US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops Share Copy Link Copy\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.The precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.There were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.Those officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.In a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”The strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.The U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.The Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.There have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.Wednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.On Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.The latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”Also on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.___Madhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 61,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T07:15:00+00:00",
    "url": "https://www.4029tv.com/article/us-drone-strike-iran-backed-militia-baghdad/46675127",
    "source": "GDELT",
    "message": "Advertisement US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops Share Copy Link Copy\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.The precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.There were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.Those officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.In a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”The strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.The U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.The Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.There have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.Wednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.On Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.The latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”Also on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.___Madhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 62,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T07:15:00+00:00",
    "url": "https://www.thedailycitizen.com/us-drone-strike-in-baghdad-kills-high-ranking-militia-leader-linked-to-attacks-on-american/article_83d15eb4-e3ef-58c3-b867-add089eb3dd7.html",
    "source": "GDELT",
    "message": "Searcy, AR (72143)\n\nToday\n\nMainly cloudy. Slight chance of a rain shower. High 63F. Winds SSW at 10 to 20 mph..\n\nTonight\n\nCloudy with occasional showers overnight. Low 56F. Winds SSW at 5 to 10 mph. Chance of rain 30%."
  },
  {
    "id": 63,
    "title": "US drone strike in Baghdad kills high - ranking militia leader linked to attacks on American troops",
    "date": "2024-02-08T11:15:00+00:00",
    "url": "https://www.ksbw.com/article/us-drone-strike-iran-backed-militia-baghdad/46675127",
    "source": "GDELT",
    "message": "Advertisement US drone strike in Baghdad kills high-ranking militia leader linked to attacks on American troops Share Copy Link Copy\n\nA U.S. drone strike blew up a car in the Iraqi capital Wednesday night, killing a high-ranking commander of the powerful Kataib Hezbollah militia who is responsible for “directly planning and participating in attacks” on American troops in the region, the U.S. military said Wednesday.The precision blast hit a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, attracting a crowd as emergency teams picked through the wreckage. It came amid roiling tensions in the region, and will likely further anger Iraqi government leaders, who U.S. officials said were not notified in advance of the strike.Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, and there were concerns about social media postings urging protesters to storm the U.S. embassy.There were conflicting reports on the number of those killed, with U.S. officials saying the initial assessment was one, and saying there were no civilians hurt or killed. But two officials with Iran-backed militias in Iraq said that three died, including Wissam Muhammad Sabir Al-Saadi, known as Abu Baqir Al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. Kataeb Hezbollah later announced his death “following the bombing of the American occupation forces” in a statement.Those officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.In a statement, U.S. Central Command said “there are no indications of collateral damage or civilian casualties at this time.” It added that the U.S. “will not hesitate to hold responsible all those who threaten our forces’ safety.”The strike — which came at 9:30 p.m. local time — is certain to inflame already seething relations between Washington and Baghdad. It comes just days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops and injured more than 40 others at a base in Jordan in late January.The U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan. President Joe Biden and other top leaders have repeatedly warned that the U.S. would continue to retaliate against those responsible for the Jordan attack. And officials have suggested that key militia leaders would be likely targets.The Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed more than 27,000 Palestinians, according to the Health Ministry in the Hamas-run territory.There have been nearly 170 attacks on U.S. forces in Iraq and Syria since Oct. 18, but the latest drone strike in Jordan — the only one in that country so far — was the first to take American troops' lives. The U.S., in response, has struck back about a half dozen times since Oct. 27, targeting weapons storage sites, command and control centers, training facilities and other locations used by Iran’s Islamic Revolutionary Guard Corps and Iranian-backed groups, including Kataib Hezbollah.Wednesday's U.S. strike in Iraq's capital drew comparisons to the 2020 drone strike in Baghdad that killed Iran's Quds Force leader Gen. Qassem Soleimani, in response to attacks on U.S. bases there and an assault on the U.S. Embassy in Baghdad. That bombing also killed Abu Mahdi al-Muhandis, deputy commander of Iran-backed militias in Iraq known as the Popular Mobilization Forces. And it enraged Iraqi leaders, triggering demands for the withdrawal of U.S. forces from the country.Kataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.On Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.The latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”Also on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.___Madhani and Baldor reported from Washington. Associated Press journalist Ali Jabar in Baghdad contributed to this report."
  },
  {
    "id": 64,
    "title": "US drone strike in Iraq kills militant commander",
    "date": "2024-02-07T23:15:00+00:00",
    "url": "https://www.yahoo.com/news/us-drone-strike-iraq-kills-214606802.html",
    "source": "GDELT",
    "message": "Iraqis gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday 7 February 2024. (AP Photo/Hadi Mizban) (Copyright 2024 The Associated Press. All rights reserved.)\n\nA US drone strike in Baghdad has killed a high-ranking militia commander.\n\nOfficials in the area said that the drone hit a car in the Iraqi capital Wednesday night, which was being used by three members of the Kataib Hezbollah militia, an influential group. One of the men in the car was a high-ranking commander, according to the Associated Press.\n\nThe incident was a targeted US attack, two officials who spoke on the condition of anonymity told the outlet, confirming that one of the three men killed was the commander in charge of the group’s operations in Syria, Wissam Mohammed “Abu Bakr” al-Saadi.\n\nThe attack happened in the Mashtal neighbourhood in the eastern part of the city. According to the outlet, a crowd formed in the area as emergency officials tried to aid those affected. As a precaution, officials shut off the city’s Green Zone, which is home to diplomatic compounds. Protestors had been calling on eachother to storm the US embassy.\n\nConflict in the area had been heightened.\n\nEarlier this week, the US military launched an air assault against dozens of Iraq and Syria sites which are used for Iranian-backed militia operations and the Iranian Revolutionary Guard, the AP said.\n\nThe attack was initiated in response to another drone strike that killed three US troops in Jordan last month.\n\nUS officials have previously blamed that attack on the Islamic Resistance in Iraq, which consists of a broad coalition of Iraq-backed militias. They also said they suspect Kataib Hezbollah may have played a part in the assault.\n\nKataib Hezbollah previously said it was suspending attacks on US troops so that it would not embarass “the Iraqi government” following the Jordan strike. Still, other groups expressed that they would continue fighting.\n\nIraq’s Islamic Resistance has previously claimed several attacks on bases housing US troops in Syria and Iraq as the Israel-Hamas war continues. So far, 27,707 people have been killed, according to the Gaza Health Ministry.\n\nAdditionally, a couple other attacks occurred this week. On Sunday, the Islamic Resistance said it attacked a base housing US troops and killed six fighters within the Syrian Democratic Forces.\n\nOn Wednesday, tensions were raised again after Israeli Prime Minister Benjamic Netanyahu said he would continue the war until “absolute victory” after he rejected Hamas-proposed terms for a hostage release agreement that could potentially initiate a cease-fire, the AP reported."
  },
  {
    "id": 65,
    "title": "US drone strike in Iraq kills militant commander",
    "date": "2024-02-07T23:45:00+00:00",
    "url": "https://news.yahoo.com/us-drone-strike-iraq-kills-221353264.html",
    "source": "GDELT",
    "message": "Iraqis gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday 7 February 2024. (AP Photo/Hadi Mizban) (Copyright 2024 The Associated Press. All rights reserved.)\n\nA US drone strike in Baghdad has killed a high-ranking militia commander.\n\nOfficials in the area said that the drone hit a car in the Iraqi capital Wednesday night, which was being used by three members of the Kataib Hezbollah militia, an influential group. One of the men in the car was a high-ranking commander, according to the Associated Press.\n\nThe incident was a targeted US attack, two officials who spoke on the condition of anonymity told the outlet, confirming that one of the three men killed was the commander in charge of the group’s operations in Syria, Wissam Mohammed “Abu Bakr” al-Saadi.\n\nThe attack happened in the Mashtal neighbourhood in the eastern part of the city. According to the outlet, a crowd formed in the area as emergency officials tried to aid those affected. As a precaution, officials shut off the city’s Green Zone, which is home to diplomatic compounds. Protestors had been calling on eachother to storm the US embassy.\n\nConflict in the area had been heightened.\n\nEarlier this week, the US military launched an air assault against dozens of Iraq and Syria sites which are used for Iranian-backed militia operations and the Iranian Revolutionary Guard, the AP said.\n\nThe attack was initiated in response to another drone strike that killed three US troops in Jordan last month.\n\nUS officials have previously blamed that attack on the Islamic Resistance in Iraq, which consists of a broad coalition of Iraq-backed militias. They also said they suspect Kataib Hezbollah may have played a part in the assault.\n\nKataib Hezbollah previously said it was suspending attacks on US troops so that it would not embarass “the Iraqi government” following the Jordan strike. Still, other groups expressed that they would continue fighting.\n\nIraq’s Islamic Resistance has previously claimed several attacks on bases housing US troops in Syria and Iraq as the Israel-Hamas war continues. So far, 27,707 people have been killed, according to the Gaza Health Ministry.\n\nAdditionally, a couple other attacks occurred this week. On Sunday, the Islamic Resistance said it attacked a base housing US troops and killed six fighters within the Syrian Democratic Forces.\n\nOn Wednesday, tensions were raised again after Israeli Prime Minister Benjamic Netanyahu said he would continue the war until “absolute victory” after he rejected Hamas-proposed terms for a hostage release agreement that could potentially initiate a cease-fire, the AP reported."
  },
  {
    "id": 66,
    "title": "US drone strike in Iraq kills militant commander",
    "date": "2024-02-07T23:30:00+00:00",
    "url": "https://news.yahoo.com/us-drone-strike-iraq-kills-214606802.html",
    "source": "GDELT",
    "message": "Iraqis gather at the site of a burned vehicle targeted by a U.S. drone strike in east Baghdad, Iraq, Wednesday 7 February 2024. (AP Photo/Hadi Mizban) (Copyright 2024 The Associated Press. All rights reserved.)\n\nA US drone strike in Baghdad has killed a high-ranking militia commander.\n\nOfficials in the area said that the drone hit a car in the Iraqi capital Wednesday night, which was being used by three members of the Kataib Hezbollah militia, an influential group. One of the men in the car was a high-ranking commander, according to the Associated Press.\n\nThe incident was a targeted US attack, two officials who spoke on the condition of anonymity told the outlet, confirming that one of the three men killed was the commander in charge of the group’s operations in Syria, Wissam Mohammed “Abu Bakr” al-Saadi.\n\nThe attack happened in the Mashtal neighbourhood in the eastern part of the city. According to the outlet, a crowd formed in the area as emergency officials tried to aid those affected. As a precaution, officials shut off the city’s Green Zone, which is home to diplomatic compounds. Protestors had been calling on eachother to storm the US embassy.\n\nConflict in the area had been heightened.\n\nEarlier this week, the US military launched an air assault against dozens of Iraq and Syria sites which are used for Iranian-backed militia operations and the Iranian Revolutionary Guard, the AP said.\n\nThe attack was initiated in response to another drone strike that killed three US troops in Jordan last month.\n\nUS officials have previously blamed that attack on the Islamic Resistance in Iraq, which consists of a broad coalition of Iraq-backed militias. They also said they suspect Kataib Hezbollah may have played a part in the assault.\n\nKataib Hezbollah previously said it was suspending attacks on US troops so that it would not embarass “the Iraqi government” following the Jordan strike. Still, other groups expressed that they would continue fighting.\n\nIraq’s Islamic Resistance has previously claimed several attacks on bases housing US troops in Syria and Iraq as the Israel-Hamas war continues. So far, 27,707 people have been killed, according to the Gaza Health Ministry.\n\nAdditionally, a couple other attacks occurred this week. On Sunday, the Islamic Resistance said it attacked a base housing US troops and killed six fighters within the Syrian Democratic Forces.\n\nOn Wednesday, tensions were raised again after Israeli Prime Minister Benjamic Netanyahu said he would continue the war until “absolute victory” after he rejected Hamas-proposed terms for a hostage release agreement that could potentially initiate a cease-fire, the AP reported."
  },
  {
    "id": 67,
    "title": "Top Iran - backed militia commander , linked to US troop deaths , killed in Baghdad",
    "date": "2024-02-07T20:45:00+00:00",
    "url": "https://www.hindustantimes.com/world-news/top-iran-backed-militia-commander-linked-to-us-troop-deaths-killed-in-baghdad-101707337000228.html",
    "source": "GDELT",
    "message": "Senior commander Abu Baqir al-Saadi of Kataib Hezbollah, an Iran-backed armed group in Iraq that the Pentagon linked to an attack that killed three US troops, died in a drone strike on a vehicle in eastern Baghdad on Wednesday night, two security sources said. People inspect a vehicle, after what security sources said was a deadly drone strike, in Baghdad, Iraq,(REUTERS)\n\nOne of the sources said three people were killed and that the vehicle targeted was used by Iraq's Popular Mobilization Forces (PMF), a state security agency composed of dozens of armed groups, many of them close to Iran.\n\nDiscover the thrill of cricket like never before, exclusively on HT. Explore now!\n\nKataib Hezbollah fighters and commanders are part of the PMF. Three US troops were killed in January in a drone attack near the Jordan-Syria border that the Pentagon said bore the \"footprints\" of Kataib Hezbollah. The group then announced it was suspending military operations against US troops in the region.\n\nIraq and Syria have witnessed near-daily tit-for-tat attacks between hardline Iran-backed armed groups and U.S. forces stationed in the region since the Gaza war began in October.\n\nUS officials did not immediately respond to a request for comment on Wednesday's strike.\n\nThe US struck Iran-backed Iraqi groups in Iraq and Syria last weekend in what it said was just the beginning of its response to the killing of three US soldiers in a drone attack.\n\nIn January, a US drone strike killed a senior militia commander in central Baghdad, an attack Washington said came in response to drone and rocket attacks on its forces.\n\nOn Wednesday, Iraqi special forces were on high alert in Baghdad and further units were deployed inside the Green Zone housing international diplomatic missions including the US embassy, a security source said."
  },
  {
    "id": 68,
    "title": "Austin Bay On PointTime To Punish Iran Ayatollah Regime For Its War On The World",
    "date": "2024-02-08T00:45:00+00:00",
    "url": "http://www.strategypage.com/on_point/20240207155634.aspx",
    "source": "GDELT",
    "message": "by Austin Bay February 7, 2024\n\nAyatollah Iran treats the world as a war zone.\n\nHere's a list of regional battlegrounds: Afghanistan, Pakistan, Iraq, Israel, Syria, Lebanon, Persian Gulf Arab nations, Yemen and Jordan. On Jan. 28, a drone launched by an Iranian proxy militia operating in Iraq struck the U.S.-manned Tower 22 observation outpost in northeastern Jordan. The explosion killed three U.S. Army soldiers and injured at least three dozen more service members.\n\nYemen's Houthis, an Iranian proxy army, wage war on global shipping. Their attacks on commercial vessels in the Red Sea and Indian Ocean spike maritime insurance rates. That increases prices for everything, even food. Iran plays the same dirty game with oil prices when it threatens to close the Strait of Hormuz, which connects the oil-producing Persian Gulf to the Indian Ocean.\n\nVenezuela's socialist dictatorship aligns with Tehran. For the past six months, Venezuela's Maduro regime has been threatening to attack neighboring Guyana. On Feb. 5, the AP reported the U.S. is \"increasing its urgent military assistance to Guyana.\" In strategic terms, this means we face an Iranian proxy front in the Western Hemisphere. It's also an oil war with potential global economic consequences. Venezuela has around 400 billion barrels of oil; Guyana has a large field -- perfect targets for ayatollah meddling.\n\nSince the 1990s, Iran's Khomeinist regime has waged a global Aryan nationalist holy war.\n\nIran is Aryanistan. Land of the Aryans. Check it out. The Iran Aryans despise Semites; Arabs and Jews are Semites. Ishmael, Arab progenitor, was a son of Abraham. That's one deep reason Donald Trump's Abraham Accords had traction.\n\nKhomeinist refers to followers of Khomeinism, the violent ideology of the Ayatollah Ruhollah Khomeini who toppled the Shah in 1979. Khomeini was a bitter old man who liked to write love-laced pleasure-enthused Persian poetry when he wasn't despising Western civilization.\n\nFailed artist turning to revolution -- that's a deadly history. Karl Marx was a failed German poet. Marx wanted to be Novalis (a brilliant German Romantic poet and polymath -- check him out). Adolf Hitler (a self-proclaimed Aryan Fuhrer) was a failed painter. I'm told Khomeini's poems are ersatz Omar Khayyam but at times show signs of merit.\n\nBlunt poetry: Khomeini dubbed America the Great Satan.\n\nKhomeinists wage slow war on America and its allies. In 1984, the State Department put Iran on its list of state sponsors of terrorism. It's still on it. Iran uses human trafficking to facilitate and fund destabilizing activities. Regime intelligence and special operations agencies are involved in drug trafficking.\n\nIn 2011, an Iranian operative was arrested before he could assassinate a Saudi diplomat in Washington, D.C. The Iranian operative intended to kill the diplomat with a bomb. An America with open borders is an easy target.\n\nAlas, Iran's corrupt and cynical fanatics rule an educated nation-state that has the petrodollars to turn nuclear knowledge into weapons. And they are doing so. Israel's Stuxnet malware did more to delay Iran's nuclear program than the Obama administration's delusional Joint Comprehensive Plan of Action. The JCPOA put money in the ayatollahs' coffers.\n\nIranian leaders still refer to Israel as a \"one bomb state.\" That refers to one large nuclear weapon striking Tel Aviv.\n\nSo far, the U.S. has responded to the deadly Jan. 28 Tower 22 attack by striking back at Iranian proxies -- at Iraqi, Syrian and Houthi proxies.\n\nI've no doubt that the air and missile strikes have had tactical success -- destroyed launch facilities and munitions dumps, killed a few proxy fighters.\n\nThese tactical strikes, however, ignore the strategic problem -- an inimical regime that is no longer deterred by U.S. might.\n\nAt some point, the Iranian regime itself must suffer a heavy and deadly military blow.\n\nOne option: a \"simultaneous strategic bombing strike\" (SSBS, first described by StrategyPage.com in 2003). In a short time frame, aircraft, cruise missiles, drones and perhaps ballistic missiles with conventional warheads deliver hundreds of precision weapons, hitting regime nuclear targets, Iranian Al-Quds special forces and Revolutionary Guard command and control facilities, air defense sites, ballistic missile sites and intelligence agency facilities.\n\nU.S. forces can do this if the president gives the order.\n\nIn August 2010, NBC's \"Meet the Press\" panel asked Chairman of the Joint Chiefs of Staff Adm. Mike Mullen if the Pentagon had a plan for attacking Iran. Mullen replied, \"We do.\" He added, \"Military actions have been on the table and remain on the table.\"\n\nIt's time for action."
  },
  {
    "id": 69,
    "title": "Navigating Israel War as a Couple When One Spouse is Jewish",
    "date": "2024-02-08T10:30:00+00:00",
    "url": "https://www.nytimes.com/2024/02/08/us/israel-war-marriage.html",
    "source": "GDELT",
    "message": "When Ava Friedmann and Michael Henein were married, they used a tablecloth from Ms. Friedmann’s grandmother as a huppah, or ritual canopy held above the couple in a Jewish wedding. Mr. Henein’s father, who is a Coptic Christian from Egypt, anointed them with holy oil.\n\nThat same braiding of their cultural traditions has steered them over the last three months, as they have talked about the Israel-Hamas war. Both were horrified by the Hamas attack on Oct. 7, but Mr. Henein worried instinctively about the Palestinian lives in Gaza that would be lost because of Israel’s military response. They decided to read identical news sources about the war to help make sure they stayed on the same page.\n\n“We needed to really hear each other and share our perspectives, and make sure we were creating an environment that didn’t lead to conflict between the two of us,” Ms. Friedmann said.\n\nMany American Jews have reconsidered how they feel about Israel and even their own Jewish identity since the Oct. 7 attack, in which Israeli officials say Hamas militants killed roughly 1,200 people. Israel’s reprisal, a bombing campaign and invasion, has killed more than 26,000 people, Palestinian officials say."
  },
  {
    "id": 70,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T01:30:00+00:00",
    "url": "https://english.elpais.com/international/2024-02-07/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say.html",
    "source": "GDELT",
    "message": "People gather as a destroyed vehicle is loaded onto a truck, after what security sources said was a deadly drone strike, in Baghdad, Iraq, February 7, 2024.\n\nA U.S. drone strike hit a car in the Iraqi capital Wednesday night, killing three members of the powerful Kataib Hezbollah militia, including a high-ranking commander, officials said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad. A crowd gathered as emergency response teams picked through the wreckage. Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. embassy.\n\nTwo U.S. officials familiar with the matter said that a senior Kataib Hezbollah commander was targeted in a U.S. strike on Wednesday in Iraq. They were not authorized to comment publicly and spoke on condition of anonymity.\n\nTwo officials with Iran-backed militias in Iraq said that one of the three killed was Wissam Mohammed “Abu Bakr” al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. The officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nThe strike came amid roiling tensions in the region and days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition"
  },
  {
    "id": 71,
    "title": "U . S . drone strike in Baghdad kills high - ranking Kataib Hezbollah militia commander , officials say",
    "date": "2024-02-07T21:45:00+00:00",
    "url": "https://www.washingtontimes.com/news/2024/feb/7/us-drone-strike-in-baghdad-kills-high-ranking-kata/",
    "source": "GDELT",
    "message": "An American military airstrike on Wednesday killed a top commander of an Iran-backed militia umbrella group that the Biden administration says was responsible for recent attacks on U.S. troops, in the latest retaliatory operation against those behind the drone strike that killed three U.S. service members in Jordan late last month.\n\nIn a statement, the Pentagon’s Central Command did not identify the individual in question but said he was a commander of the group Kata‘ib Hezbollah, and had a hand in at least some of the recent missile and drone assaults on American bases in the region.\n\nU.S. forces “conducted a unilateral strike in Iraq in response to the attacks on U.S. service members, killing a Kata’ib Hezbollah commander responsible for directly planning and participating in attacks on U.S. forces in the region,” CENTCOM said.\n\n“There are no indications of collateral damage or civilian casualties at this time,” the statement said. “The United States will continue to take necessary action to protect our people. We will not hesitate to hold responsible all those who threaten our forces’ safety.”\n\nOfficials told the Associated Press that a U.S. drone struck a car traveling through Baghdad on Wednesday night, killing three members of Kata‘ib Hezbollah, including the commander. The strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad, the AP reported.\n\nOfficials with Iran-backed militias in Iraq identified one of the dead as Wissam Mohammed “Abu Bakr” al-Saadi, the commander of Kata‘ib Hezbollah’s operations in Syria, according to media reports.\n\nWednesday’s strike makes good on the Biden administration‘s promise that it would continue hitting back against Kata‘ib Hezbollah and other Iraqi Shiite militias that have direct links to Iran’s Islamic Revolutionary Guard Corps. Last Friday, U.S. fighter jets and drones hit dozens of targets, including command and control headquarters, ammunition storage, intelligence centers, and other facilities used by the Quds Force, a wing of the IRGC, and the militias affiliated with it.\n\nCENTCOM said the Friday missions struck more than 85 targets in a well-coordinated operation. More than 125 precision munitions were used, Pentagon officials said, with some long-range bombers flown from the U.S. to the Middle East to take part in the long-awaited American counterattack.\n\nThose strikes came less than a week after a drone attack killed three American service members at a military base in Jordan. The Pentagon blamed that attack on the network of Iran-backed militias operating across the region.\n\nOver the past few months, those groups have launched more than 150 attacks against U.S. troops in the Middle East. Those attacks have grown more frequent and more deadly since Oct. 7, when the Palestinian militant group Hamas — also financially and logistically backed by Iran — launched its own massive terrorist attack on Israel.\n\nSuccessive U.S. administrations have now proven themselves willing to strike targets in Iraq’s capital when necessary. In January 2020, then-President Donald Trump ordered a strike on Iranian Gen. Qassem Soleimani, the head of Iran’s IRGC, whom the administration painted as the key conduit between Tehran and the Shiite militias attacking U.S. troops. He was killed at Baghdad’s international airport.\n\nWednesday’s attack surely will spark more discord between the U.S. and the Iraqi government, which condemned last week’s strikes against Iran-backed militias on its soil and has begun talks about the possible removal of more than 2,000 American troops based in the country.\n\n• Ben Wolfgang can be reached at bwolfgang@washingtontimes.com."
  },
  {
    "id": 72,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://triblive.com/news/world/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say/",
    "source": "GDELT",
    "message": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\n\nBAGHDAD — A U.S. drone strike hit a car in the Iraqi capital Wednesday night, killing three members of the powerful Kataib Hezbollah militia, including a high-ranking commander, officials said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad. A crowd gathered as emergency response teams picked through the wreckage. Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. embassy.\n\nTwo U.S. officials familiar with the matter said that a senior Kataib Hezbollah commander was targeted in a U.S. strike on Wednesday in Iraq. They were not authorized to comment publicly and spoke on condition of anonymity.\n\nTwo officials with Iran-backed militias in Iraq said that one of the three killed was Wissam Mohammed “Abu Bakr” al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. The officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nThe strike came amid roiling tensions in the region and days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province."
  },
  {
    "id": 73,
    "title": "Drone Strike In Baghdad Kills Powerful Iran - Backed Militia Commander Wissam Mohammed Al - Saadi – The Yeshiva World",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.theyeshivaworld.com/news/general/2259656/drone-strike-in-baghdad-kills-powerful-iran-backed-militia-commander-wissam-mohammed-al-saadi.html",
    "source": "GDELT",
    "message": "A U.S. drone strike hit a car in the Iraqi capital Wednesday night, killing three members of the powerful Kataib Hezbollah militia, including a high-ranking commander, officials said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad. A crowd gathered as emergency response teams picked through the wreckage. Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. embassy.\n\nTwo U.S. officials familiar with the matter said that a senior Kataib Hezbollah commander was targeted in a U.S. strike on Wednesday in Iraq. They were not authorized to comment publicly and spoke on condition of anonymity.\n\nTwo officials with Iran-backed militias in Iraq said that one of the three killed was Wissam Mohammed “Abu Bakr” al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. The officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nThe strike came amid roiling tensions in the region and days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war, saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory.\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid “embarrassing the Iraqi government” after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until “absolute victory.”\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n(AP)"
  },
  {
    "id": 74,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T01:15:00+00:00",
    "url": "https://www.fox10phoenix.com/news/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say",
    "source": "GDELT",
    "message": "A U.S. drone strike hit a car in the Iraqi capital Wednesday night, killing three members of the powerful Kataib Hezbollah militia, including a high-ranking commander, officials said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad. A crowd gathered as emergency response teams picked through the wreckage. Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. embassy.\n\nTwo U.S. officials familiar with the matter said that a senior Kataib Hezbollah commander was targeted in a U.S. strike on Wednesday in Iraq. They were not authorized to comment publicly and spoke on condition of anonymity.\n\nTwo officials with Iran-backed militias in Iraq said that one of the three killed was Wissam Mohammed \"Abu Bakr\" al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. The officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nThe strike came amid roiling tensions in the region and days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war , saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory .\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid \"embarrassing the Iraqi government\" after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until \"absolute victory.\"\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani reported from Washington. Associated Press journalists Ali Jabar in Baghdad and Lolita Baldor in Washington contributed to this report."
  },
  {
    "id": 75,
    "title": "Drone strike in Baghdad kills high - ranking militia commander , officials say",
    "date": "2024-02-08T03:15:00+00:00",
    "url": "https://www.fox5ny.com/news/drone-strike-in-baghdad-kills-high-ranking-militia-commander-officials-say",
    "source": "GDELT",
    "message": "A U.S. drone strike hit a car in the Iraqi capital Wednesday night, killing three members of the powerful Kataib Hezbollah militia, including a high-ranking commander, officials said.\n\nThe strike came on a main thoroughfare in the Mashtal neighborhood in eastern Baghdad. A crowd gathered as emergency response teams picked through the wreckage. Security forces closed off the heavily guarded Green Zone, where a number of diplomatic compounds are located, amid calls for protesters to storm the U.S. embassy.\n\nTwo U.S. officials familiar with the matter said that a senior Kataib Hezbollah commander was targeted in a U.S. strike on Wednesday in Iraq. They were not authorized to comment publicly and spoke on condition of anonymity.\n\nTwo officials with Iran-backed militias in Iraq said that one of the three killed was Wissam Mohammed \"Abu Bakr\" al-Saadi, the commander in charge of Kataib Hezbollah’s operations in Syria. The officials spoke on condition of anonymity because they weren’t authorized to speak to journalists.\n\nThe strike came amid roiling tensions in the region and days after the U.S. military launched an air assault on dozens of sites in Iraq and Syria used by Iranian-backed militias and the Iranian Revolutionary Guard in retaliation for a drone strike that killed three U.S. troops in Jordan in late January.\n\nThe U.S. has blamed the Islamic Resistance in Iraq, a broad coalition of Iran-backed militias, for the attack in Jordan, and officials have said they suspect Kataib Hezbollah in particular of leading it.\n\nThe Islamic Resistance in Iraq has regularly claimed strikes on bases housing U.S. troops in Iraq and Syria against the backdrop of the ongoing Israel-Hamas war , saying that they are in retaliation for Washington’s support of Israel in its war in Gaza that has killed 27,707 Palestinians, according to the Health Ministry in the Hamas-run territory .\n\nKataib Hezbollah had said in a statement that it was suspending attacks on American troops to avoid \"embarrassing the Iraqi government\" after the strike in Jordan, but others have vowed to continue fighting.\n\nOn Sunday, the Islamic Resistance in Iraq claimed a drone attack on a base housing U.S. troops in eastern Syria killed six fighters from the Syrian Democratic Forces, a Kurdish-led group allied with the United States.\n\nThe latest surge in the regional conflict came shortly after Israeli Prime Minister Benjamin Netanyahu on Wednesday rejected terms proposed by Hamas for a hostage-release agreement that would lead to a permanent cease-fire, vowing to continue the war until \"absolute victory.\"\n\nAlso on Wednesday, the media office of the Houthi rebels in Yemen reported two airstrikes in Ras Issa area in Salif district in Hodeida province.\n\n___\n\nMadhani reported from Washington. Associated Press journalists Ali Jabar in Baghdad and Lolita Baldor in Washington contributed to this report."
  }
]