[{"id": "e6000b93-d2be-47e9-80fe-837ac2683803", "title": "2 hurt as Hezbollah shells north launches explosive drones", "date": "2024-06-03 00:45", "url": "https://muslimnews.co.uk/news/syria/2-hurt-as-hezbollah-shells-north-launches-explosive-drones/", "message": "smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smc smcThe Israel Defense Forces said Sunday morning 2 hurtThat it had carried out an overnight airstrike with fighter jets against a Hezbollah compound in northeastern Lebanon’s Baalbek.\nThe IDF said the strike came as a response to Hezbollah shooting down a military drone over southern Lebanon on Saturday.\nHezbollah claimed to have targeted an Iron Dome battery in the area with several explosive drones.\nAnother rocket attack on Kiryat Shmona lightly wounded two people, the municipality said.\nA composite image of damage caused by rockets from Lebanon in the city of Kiryat Shmona on June 2, 2024.", "location": "Lebanon", "classification": "security", "score": 0.9943840155851017, "event_breakdown": "IDF airstrikes on Hezbollah compound in Baalbek, Lebanon (northeastern Lebanon); Hezbollah rocket attack on Kiryat Shmona (northern Israel)."}, {"id": "d998152c-f73e-4389-9516-bf963dbc2844", "title": "2 Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287040/2-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- IANS) Beirut, June 3 (IANS) Two people were killed and four others in an Israeli on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said on Sunday that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders, Xinhua news agency reported.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Houla", "classification": "security", "score": 0.9941170016844771, "event_breakdown": "Lebanon-Houla, Lebanon-Israeli Warplane\nA Lebanese military source said a civilian was killed on Sunday and four others were wounded - among them two women - in an Israeli air raid on their village in the southeastern part of the country, according to Lebanese media.\nIsrael retaliated by firing heavy artillery toward Lebanon. Meanwhile, Israel carried out 11 similar operations in the last year alone."}, {"id": "2b99e432-6c43-4fe4-a194-e9e1c1ea4d3b", "title": "The Israeli army says it investigates itself", "date": "2024-06-03 00:30", "url": "https://www.chicagotribune.com/2024/06/02/israeli-army-investigates-itself/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nArmy officials initially said dozens of Palestinians were killed in a stampede when huge crowds tried to grab supplies off the pre-dawn convoy of 30 army trucks carrying flour toward hard-hit northern Gaza.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military.", "location": "GAZA CITY", "classification": "security", "score": 0.9163924705467674, "event_breakdown": "Event 1: Israel’s military is investigating about 70 cases of alleged wrongdoing, according to Israel’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi.\nEvent 2: Israel said it was “not possible to determine with certainty” whether a man killed by Israeli fire had been shot."}, {"id": "ecf1eb02-96ee-45c9-b41c-6d561b04c620", "title": "Where do the IDF internal investigations stand ? ", "date": "2024-06-03 04:15", "url": "https://www.ctvnews.ca/world/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand-1.6910783", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael's military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military.", "location": "Israel", "classification": "security", "score": 0.7874512184600797, "event_breakdown": "Israel’s military said military is investigating about 70 cases of alleged wrongdoing, Palestinian detainees have reported harsh treatment while detained."}, {"id": "11e8733f-52f5-460a-8e01-87fbbd40003e", "title": "Real target of Dalston shooting says  I wish it was me  ", "date": "2024-06-03 00:15", "url": "https://www.thetimes.co.uk/article/real-target-of-dalston-shooting-says-i-wish-it-was-me-h7lgn2tmp", "message": "The target for the gangland shooting which left a schoolgirl fighting for her life survived a previous assassination attempt and wishes the bullet had hit him rather than the innocent child.\nBeytullah Gunduz, who has been linked to the Turkish underworld, was with friends outside a restaurant in Dalston until 15 minutes before a gunman opened fire on diners last week.\nHe returned to the restaurant to find three of his friends with gunshot wounds.\nThe girl, who had been sitting with her family inside, was on the floor after being shot in the head.\nThe attack has led to concerns that the shooting will reignite a bloody gang war between Tottenham Turks and their rivals, the Hackney Turks.", "location": "Dalston, London", "classification": "security", "score": 0.9711368717468816, "event_breakdown": "Beytullah Gunduz, who has been linked to the Turkish underworld, was with friends outside a restaurant in Dalston until 15 minutes before a gunman opened fire on diners last week. He returned the restaurant to find three of his friends with gunshot wounds. The shooting has led to concerns that the shooting will reignite a bloody gang war between Tottenham Turks and their rivals, the Hackney Turks."}, {"id": "7dcdd475-6627-4847-b0ef-294ed9d28ece", "title": "What the status of Israeli army investigations into itself ? ", "date": "2024-06-03 01:30", "url": "https://www.nbcbayarea.com/news/national-international/israeli-army-investigates-itself/3554840/", "message": "Israel’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army’s chain of command.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military.", "location": "JERUSALEM", "classification": "security", "score": 0.7854571786987528, "event_breakdown": "New event:\nIDF probes 70 claims of mistreating Palestinians"}, {"id": "d7dd4f90-80fb-4490-a51d-c3aa4e0e07c4", "title": "Hezbollah strikes Israeli bases as clashes intensify - Newspaper", "date": "2024-06-03 04:15", "url": "https://www.dawn.com/news/1837460/hezbollah-strikes-israeli-bases-as-clashes-intensify", "message": "BEIRUT: Hezbollah said on Sunday its fighters had bombarded two army bases in the Israeli-annexed Golan Heights within hours, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hezbollah annou­nce­ment came several hours after Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hezbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone.", "location": "Israel", "classification": "security", "score": 0.9905366469993714, "event_breakdown": "Security Event 1: Israel strikes Hezbollah positions in southern and eastern Lebanon.\nSecurity Event 2: Hezbollah bombards two army bases in the Israeli-annexed Golan Heights.\nSecurity Event 3: Israeli forces strike Hezbollah positions in Lebanese territory.\nSecurity Event 4: Hezbollah fires projectiles at an Israeli village.\nSecurity Event 5: Israeli forces strike Hezbollah positions in Lebanese territory."}, {"id": "ae910c70-f8b7-42f8-9dfc-32769089c404", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 04:45", "url": "https://www.yahoo.com/news/german-police-officer-injured-mannheim-032959235.html", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died.", "location": "Mannheim", "classification": "security", "score": 0.6969623466375762, "event_breakdown": "Mannheim stabbing attack"}, {"id": "67f2a823-4164-4478-a9c4-f8e62e5a69ac", "title": "German police officer injured in Mannheim mass stabbing dies", "date": "2024-06-03 03:45", "url": "https://www.upi.com/Top_News/World-News/2024/06/02/germany-Mannheim-injured-police-officer-dies/5531717382085/", "message": "View of the crime scene after a knife attack in the city centre in Mannheim, Germany, on Friday.\nA police officer who was among the six injured in the attack died Sunday, authorities said.\nPhoto by Ronald Wittek/EPA-EFEJune 2 (UPI) -- A German police officer who was among the half dozen people injured in a mass stabbing attack in Mannheim on Friday has died of his injuries, authorities said Sunday.\n\"We mourn the loss of a police officer who gave his life for our safety,\" the Mannheim Police Department said in a statement.\nAn arrest warrant for attempted murder has been issued for the suspect, authorities said before the officer had died.", "location": "Germany", "classification": "security", "score": 0.6969623466375762, "event_breakdown": "Target event:\nA German police officer who was among the six injured in an attack in Mannheim on Friday has died of his injuries, authorities said Sunday."}, {"id": "8f438055-7a53-4eee-8416-039a0a241025", "title": "Vladimir Putin Strikes Ukraine Largest Hydro - Electricity Plant : Photos", "date": "2024-06-03 01:15", "url": "https://radaronline.com/p/vladimir-putin-missiles-russian-strike-ukraine-hydro-electricity-plant/", "message": "The Dnipro plant, situated on a bridge in Zaporizhzhia, was struck by the 600-mph rocket despite having been targeted by Russian forces previously on March 22.\nUkrainian workers were still in the process of repairing the plant from the previous attack when the missiles hit, exacerbating the damage caused.\nThe assault, part of an overnight blitz employing KH-101 missiles, marks the second major attack on the Dnipro Hydro-electric Power Plant since March.\nThe plant's generating capacity has been severely crippled, with any breach of the 200ft dam posing a significant risk of flooding downstream.", "location": "zaporizhzhia", "classification": "security", "score": 0.5974250888858339, "event_breakdown": "'Ukraine: Russian forces strike the Dnipro Hydro-electric Power Plant with 600-mph rockets, severely crippling the generating capacity.'"}, {"id": "2107aaea-8395-478b-bccf-9c4a77df5cc7", "title": "2 killed in Israeli airstrike on Lebanese village - Xinhua", "date": "2024-06-03 00:15", "url": "https://english.news.cn/20240603/c0ed96de293c409db1b811108e34086b/c.html", "message": "BEIRUT, June 2 (Xinhua) -- Two people were killed and four others injured on Sunday in an Israeli airstrike on the southeastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that an Israeli warplane bombed a house in central Houla with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 airstrikes on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group Hezbollah said it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9960178206696133, "event_breakdown": "BEIRUT, LEBANON, JUNE 5: Location: Houla, Lebanon\nTarget Event: 2 people killed, 4 injured after Israeli airstrike on southeastern Lebanese village."}, {"id": "ea4e1ac3-2861-4b21-ac0e-ac636c5372be", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 00:15", "url": "https://www.2news.com/news/national/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/article_96e5df36-e35a-5b27-9cdf-5d9f3bd7b84d.html", "message": "FILE - Palestinians look at the destruction after an Israeli strike where displaced people were staying in Rafah, Gaza Strip, Monday, May 27, 2024.\nThroughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly events in which its military forces are suspected of wrongdoing.\nThe commitment comes in the face of mounting claims — from human rights groups and the International Criminal Court's chief prosecutor — that the country's leaders are committing war crimes in Hamas-ruled Gaza.\n(AP Photo/Jehad Alshrafi, File)", "location": "GAZA STRIP", "classification": "security", "score": 0.6743441712318062, "event_breakdown": "Target event:\nFILE - Palestinians look at the destruction after an Israeli strike where displaced people were staying in Rafah, Gaza Strip, Monday, May 27, 2024.\nThroughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly incidents in which its military forces are suspected of wrongdoing."}, {"id": "41b21df6-11c8-4337-92af-0353467b82ca", "title": "Israel has pledged to investigate a series of events where its military has been suspected of wrongdoing", "date": "2024-06-03 06:30", "url": "https://www.newstalkzb.co.nz/news/world/israel-has-pledged-to-investigate-a-series-of-events-where-its-military-has-been-suspected-of-wrongdoing/", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military.", "location": "West Bank", "classification": "security", "score": 0.7384466933277175, "event_breakdown": "New Israeli internal investigations launched into allegations that the military mistreated Palestinians in detention."}, {"id": "79c9ea34-a634-48d3-ab6a-e4ddae6f1c6e", "title": "Israel airstrike on Syria Aleppo causes casualties , material damage", "date": "2024-06-03 03:45", "url": "http://www.presstv.ir/Detail/2024/06/02/726747/israel-attack-syria-aleppo-material-damage", "message": "The Israeli regime has launched a new act of aggression against Syria’s northwestern city of Aleppo, causing casualties and some material damage.\nSyria’s official SANA news agency, quoting an unnamed military source, said the new airstrike came from the direction of southeastern of Aleppo shortly after the midnight on Monday.\nThe report added that the Israeli strike targeted several locations in the vicinity of Aleppo, leaving a number of people dead while causing some material damage.\nThe statement by the Syrian military source did not specify the number of those killed in the attack and whether they were military personnel or civilians.\nThe regime’s attacks targeted a central site and a residential building in Baniyas city in Syria’s coastal region, as well as the countryside of the eastern Syrian city of Homs.", "location": "ALEppo", "classification": "security", "score": 0.9600876640856175, "event_breakdown": "New Israeli airstrike reported near Aleppo, Syria"}, {"id": "ef6a85ef-e836-43a5-9c25-4efdbef8158d", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:30", "url": "https://japantoday.com/category/world/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure", "message": "(AP Photo/Alexander Zemlianichenko)By SAMYA KULLAB and ELISE MORTONUkraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov.", "location": "UKRAINE", "classification": "security", "score": 0.805024404728056, "event_breakdown": "Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nRussia carried out large-scale attacks on energy infrastructure on Saturday, and targeted facilities in three regions of Ukraine: Vinnitsya, Ivano-Frankivsk, and Khmelnytskyi, state communications monopoly Ukrtelecom said. The Russian forces destroyed cabling in Onufriyivka village in the Chernihiv region, disrupting phone services, it said."}, {"id": "e02941f6-e656-4b6d-a399-c724af700abd", "title": "Lebanon Hizbollah says strikes Israeli bases as clashes intensify", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/region/lebanons-hizbollah-says-strikes-israeli-bases-clashes-intensify", "message": "It said the attack was in retaliation for Israeli strikes in eastern Lebanon's Bekaa Valley.\nThe Israeli military said “approximately 15 projectiles” had been fired from Lebanon at the Golan Heights and “fell in open areas”, causing no injuries but starting fires.\nThe Hizbollah announcement came several hours afer Israeli forces struck the group’s positions in eastern and southern Lebanon.\nIsraeli jets had “struck a Hizbollah military structure in the area of Hula, from which projectiles were fired” at an Israeli village across the border, the military said.\nIn response, Hizbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone.", "location": "Lebanon", "classification": "security", "score": 0.9925507527125152, "event_breakdown": "Map of current security events in the Middle East:\n1. A Hizbollah attack on Israeli military targets in the Golan Heights, near the border between Syria and Lebanon, on July 27th, 2020. The attack was in retaliation for Israeli strikes on Hizbollah positions in the Bekaa Valley in eastern Lebanon."}, {"id": "e304fb3f-8f53-49d1-b1d8-7741fa3c404a", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 01:15", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-energy-shutdowns-w05563", "message": "KYIV, Ukraine — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov.", "location": "The main location where the main event takes place is Kyiv, Ukraine.", "classification": "security", "score": 0.805024404728056, "event_breakdown": "MOSCOW — The Russian military says its air-defense systems intercepted 15 Ukrainian targets early Sunday and destroyed eight.\nThe Russian Defense Ministry’s spokesman, Maj. Gen. Igor Konashenkov, said that the Iskander-M missile systems were deployed to destroy Ukrainian firing positions, including those of Grad multiple-rocket launchers.\nRussian Defense Ministry spokesman Maj. Gen. Igor Konashenkov gestures as delivers statement in Moscow, Russia, Thursday, March 24, 2016. The Russian Defense Ministry said on Thursday, it will deploy four nuclear-capable regiments capable of striking the United States in response to Washington's deployment of a missile defense system to Europe. (AP Photo/Pavel Golovkin)\\n\nKonashenkov added that the Russian forces destroyed 15 Ukrainian targets Sunday including a Su-24 aircraft on an airfield in the western region of Ivano-Frankivsk and a Tor-M1 missile system on an island in the northern region of Chernihiv which was captured two days ago by the Russian forces.\nAccording to a spokesman of Ukraine's National Police, one-third of all shelling incidents during Russia's war on Ukraine have happened in border regions.\nIn areas located close to the dissidents, they have put in outposts, and used large caliber rifles against crossing Ukrainian soldiers, causing several injuries and fatalities.\nA Ukrainian Susat-Mar racing armored jeep destroyed during the Battle of the Belarussian Central Front.\\nUkraine's Defense Ministry reported that the marauders had not been stopped by its soldiers and other militaries and had not made it through their security cordons. President Vol"}, {"id": "f50b1d3a-f4d3-4e01-8c98-4819a30dff60", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 02:30", "url": "https://www.foxnews.com/us/knife-wielding-florida-teen-allegedly-murders-boy-sleepover-injures-adult-violent-premeditated-attack", "message": "A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff's Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.8150549956769056, "event_breakdown": "Location: Florida\nTarget Event: A teenager is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover\nAdditional Current Events:\nNone"}, {"id": "566a9d46-782b-48f9-b9a4-b1955ec828f9", "title": "Suspected Israel airstrikes kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536379.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike.", "location": ".\nSYRIA", "classification": "security", "score": 0.7534172792723598, "event_breakdown": "Seven killed in Israeli missile attack on Syria."}, {"id": "528d74d3-6831-4a5f-ae01-8ba609e615b0", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 03:00", "url": "https://www.prokerala.com/news/articles/a1536380.html", "message": "Seven killed in Israeli missile attack on Syria.\nImage Source: IANS NewsTel Aviv, June 3 : An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria's Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria's second city of Aleppo is burning following an airstrike.\nSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike.", "location": "Syria", "classification": "security", "score": 0.7534172792723598, "event_breakdown": "Seven killed as Israeli missile hits Syria. (2022, June 3). IANS News."}, {"id": "7ef8c16a-f0fd-4733-a726-3b360a5e9622", "title": "Suspected Israel airstrike kill  several  people in Syria", "date": "2024-06-03 06:45", "url": "https://www.thestatesman.com/world/suspected-israel-airstrike-kill-several-people-in-syria-1503306289.html", "message": "An alleged Israeli airstrike has led to the killing of several people in Syria, reports said.\nSyrian media outlets reported on Sunday that Israeli airstrike hit a copper smelting factory in Syria’s Aleppo leading to the killing of several people.\nInitial reports indicate that a factory in Syria’s second city of Aleppo is burning following an airstrike.\nAdvertisementSyrian Observatory of Human Rights war monitor in a statement said that 12 people were killed in the airstrike.\nThe Israel side did not make any comments to confirm.", "location": "Aleppo is the location.", "classification": "security", "score": 0.41149348921429546, "event_breakdown": "Israeli airstrike hits a copper smelting factory in Syria’s Aleppo, killing several people, Syrian media outlets reported on Sunday."}, {"id": "d9da8503-3cf0-4178-b3ab-2cc21615f7aa", "title": "Man stabs 2 foreign residents  for no reason  ", "date": "2024-06-03 07:00", "url": "http://www.koreaherald.com/view.php?ud=20240603050545", "message": "A 37-year-old man has been indicted for attempted murder of two foreign residents in Incheon, local prosecutors said Monday.\nHe told officials that he was drunk and there was \"no particular reason\" for his actions.\nIt is unclear whether the stabbings were part of a random attack against anyone, or against foreigners specifically.\nWhile the suspect launched an attack against four foreigners, Hambak Maeul is a rare village where the majority of its residents are non-Koreans.\nAs of 2023, about 61 percent of its 12,000 residents had foreign nationality.", "location": "Incheon", "classification": "security", "score": 0.8656709194614164, "event_breakdown": "[\n\"Man indicted for attempted murder of two foreign residents in Incheon,\"\n\"Incheon is a port city in South Korea.\"\n]"}, {"id": "f0e51bb0-ad18-4b0f-b179-55f877d68c28", "title": "German police officer stabbed in neck and head in Mannheim , Germany , at anti - Islam event dies in hospital", "date": "2024-06-03 01:30", "url": "https://www.skynews.com.au/world-news/german-police-officer-stabbed-in-neck-and-head-in-mannheim-germany-at-antiislam-event-dies-in-hospital/news-story/de6adc584971b753034f6dd77f64a6ee?nk=9444015928cb19cda8be2a72bea8447f-1717377420", "message": "A policeman who was stabbed in the neck and head at an anti-Islam rally in Mannheim, Germany, has died from his injuries.\nThe 29-year-old officer, Rouven L., was stabbed multiple times in the horror knife attack after tackling another man to the ground.\nVideo of the attack showed Ataee swinging his knife wildly and slashing at a man’s thigh as he was brought to the ground.\nIn a joint statement, German police and prosecutors said the police officer underwent an emergency operation immediately after the attack and was put in an induced coma.\nSpeaking to Echo, a local newspaper, a local man said the knifeman “didn’t look like a bad guy”.", "location": "Mannheim", "classification": "security", "score": 0.5034366314309492, "event_breakdown": "Mannheim, Germany"}, {"id": "f4b570c4-c537-4259-8f8a-f96321a9532c", "title": "Russia claims capture of village in Ukraine Donetsk region", "date": "2024-06-03 00:30", "url": "http://www.jordantimes.com/news/world/russia-claims-capture-village-ukraines-donetsk-region", "message": "File photo of a Soviet-era World War II monument near a destroyed cultural centre near Avdiivka, in Ukraine's Donetsk region taken on March 21 (AFP photo)MOSCOW — Russia's defence ministry claimed on Sunday to have captured a tiny village in the Donetsk region of eastern Ukraine, where it has been on the offensive making territorial gains.\nRussian troops \"have managed to liberate the village of Umanskoye in the popular republic of Donetsk\", the ministry said in reference to the Ukrainian village of Umanske.\nUmanske is a tiny village that had fewer than 180 inhabitants before Russia launched its military offensive in Ukraine in February 2022.\nIt lies about 25 kilometres to the northwest of Donetsk, which is the main city of the region and is under Russian control.\nMeanwhile, a Ukrainian drone attack “on a car this morning” in the Kursk region “wounded three” people, who were taken to hospital, Governor Alexei Smirnov said.", "location": "Umanske", "classification": "security", "score": 0.8556696607517235, "event_breakdown": "Russia's defence ministry claimed on Sunday to have captured a tiny village in the Donetsk region of eastern Ukraine, where it has been on the offensive making territorial gains.\nRussian troops \"have managed to liberate the village of Umanskoye in the popular republic of Donetsk\", the ministry said in reference to the Ukrainian village of Umanske.\nDonbas regionRussia-ukraine conflict"}, {"id": "1e444a8d-f676-4942-9b3c-e4522e912e45", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:00", "url": "https://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel.", "location": "The main event described in the text takes place in Gaza.", "classification": "security", "score": 0.8565239349665787, "event_breakdown": "1. On Monday, Israel launches air strikes on Gaza, in what the army says is a preemptive response to the firing of incendiary balloons from Gaza into Israel.\n2. Israeli soldiers killed one Palestinian militant near the Gaza Strip and arrested another in a separate incident, according to the Israeli military.\n3. Israeli air strikes hit positions belonging to Hamas in the Syrian capital Damascus, according to news reports citing Hamas sources.\n4. On Tuesday, Israeli security forces performed counterterrorism operations in Umm al-Ghanam, an Arab Israeli village in the Lower Galilee.\n5. A 47-year-old Palestinian man was shot and killed after stabbing and injuring three Israeli soldiers in the West Bank city of Hebron.\n6. On Tuesday, Israel and Sudan signed a peace agreement, the third between Israel and an Arab county in recent months.\n7. Israel is testing drone-delivered packages, including pizza and candy as the company Wing quickened its rollout following regulatory hurdles."}, {"id": "d73fc5b2-9eae-4860-8414-c608e6db35b0", "title": "52 UN  expert and seven major lies | Israel National News", "date": "2024-06-03 05:30", "url": "http://www.israelnationalnews.com/news/390978", "message": "Below are seven of them, as well as an examination of the disturbing, hyper-partisan language used to attack Israel on the basis of those seven major lies.\nError #1: “Israeli air strikes on a camp sheltering displaced civilians…”The Facts: In just the first nine words of the statement, the “experts” got two major facts objectively wrong.\nFirst, there was one strike, not strikes plural, though according to the Israeli military the strike did involve two weapons.\nThe “experts” instead are using an erroneous interpretation of the legal concept of proportionality they claim to be experts on.\nError #4: “On Tuesday, another attack in al-Mawasi in Western Rafah…”The Facts: The “experts” are here peddling a completely unsupported rumor in order to attack Israel.", "location": "The main focus for the event based on the information provided would be: Gaza Strip", "classification": "security", "score": 0.8565239349665787, "event_breakdown": "1. Israeli air strikes on a camp sheltering displaced civilians in Qaa, eastern Lebanon, have left at least one dead and two more wounded. The strikes hit the town before dawn.\n2. On Wednesday, Israel said it downed a drone that crossed into its airspace from Lebanon. The Israeli army said it monitored the unmanned aircraft as it crossed the border and identified it as a Hezbollah drone. Hezbollah has not yet commented on the Israeli claim.\n3. On Tuesday, another attack in al-Mawasi in Western Rafah, in southern Gaza, was carried out by Israeli warplanes Hamas said, with at least three injured."}, {"id": "e39dd7a2-e803-4440-9300-432373993f5c", "title": "  Nowhere in Gaza is safe  for Palestinians in Rafah - Asia News NetworkAsia News Network", "date": "2024-06-03 03:00", "url": "https://asianews.network/nowhere-in-gaza-is-safe-for-palestinians-in-rafah/", "message": "June 3, 2024RAFAH – The intensifying Israeli military offensive in Rafah, a southern city in the Palestinian territory of Gaza, has left displaced Palestinians who had been sheltering there in even more of a predicament as food supplies and safe areas become scarce.\nThe airstrike hit a neighborhood adjacent to Al-Mawasi, a coastal district the Israeli military had designated as a “humanitarian zone.” The area was packed with basic tents erected by displaced Palestinians.\n“Enough is enough.”In May, the Israeli military warned people in eastern Rafah to evacuate to coastal areas such as Al-Mawasi.\nRelief and Works Agency for Palestine Refugees in the Near East (UNRWA), about 945,000 people have been displaced from Rafah since the Israeli military operation there began.\nThe situation in Rafah is chaotic as people seek shelter, and getting food and water there is becoming increasingly difficult.", "location": "GAZA", "classification": "security", "score": 0.9624809402379876, "event_breakdown": "1. Israeli military offensive in Rafah, a southern city in the Palestinian territory of Gaza.\n2. Engaging in airstrike in a coastal district of the Rafah.\n3. Over 900,000 displaced Palestinians are sheltering in a coastal district near the Rafah are considered for relief by UNRWA."}, {"id": "7ed5886b-adbd-4372-b731-5a216e9bbf58", "title": "Teenager denies GBH over 2021 Norwich knife attack | Norwich Evening News", "date": "2024-06-03 06:00", "url": "https://www.eveningnews24.co.uk/news/24358971.teenager-denies-gbh-2021-norwich-knife-attack/", "message": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalised with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year.", "location": "Norwich", "classification": "security", "score": 0.8409271478632038, "event_breakdown": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalized with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year."}, {"id": "84fde4f0-b0ad-4f29-9700-2f97bb983f61", "title": "Ukrainian Drones Attack Lukoil Refinery In Komi", "date": "2024-06-03 07:30", "url": "https://charter97.org/en/news/2024/6/3/597439/", "message": "Ukrainian Drones Attack Lukoil's Refinery In Komi 7 3.06.2024, 7:4617,716It is 1800 kilometres from the enterprise to the border with Ukraine.\nRussian propagandists said that on the afternoon of June 2, an explosion was heard in the town of Ukhta in the Republic of Komi near the Lukoil oil refinery.\nThen the Russian Ministry of Emergency Situations published a photo of the damaged tank and claimed about the deaths, liga.net writes.\nTwo Russians died of gas poisoning and burns, while three others were injured in the incident, Russian authorities claim.\nIt is about 1,800 kilometres from here to the Ukrainian border.", "location": "LUBSEC VELYKA, RUSSIA", "classification": "security", "score": 0.9479135362863285, "event_breakdown": "Ukrainian Drones Attack Lukoil's Refinery In Komi\n\n3.06.2024, 7:46 - A drone attack near Ukhta, Komi on the Lukoil oil refinery resulted in deaths and injuries.\n\nHere is a link to Google Maps that shows where the refinery is located:\n\nLukoil oil refinery in Komi-Permyatka branch (Google Maps)."}, {"id": "9814dfdf-cc2e-453c-878d-ee888222dbf6", "title": "Russian Army Advances In Kharkiv , As Western Nations Permit Ukraine To Strike Targets In Russia", "date": "2024-06-03 06:30", "url": "https://menafn.com/1108285490/Russian-Army-Advances-In-Kharkiv-As-Western-Nations-Permit-Ukraine-To-Strike-Targets-In-Russia", "message": "Russian forces are now advancing west towards Chasiv Yar, aiming to control the high ground to approach the strategic city of Kramatorsk.\nBoth Russian military bloggers and Ukraine's DeepStateMap report minor Russian advances into recaptured Ukrainian territory.\nWestern nations permit Ukraine to strike targets in Russia, sparking nuclear concernsIn a significant policy shift, Germany has joined several NATO members in allowing Ukraine to use German-supplied weapons against targets within Russia's borders.\nFrench President Emmanuel Macron argued that Ukraine should be able to target specific Russian military sites, while Poland and Denmark have also authorised the use of their weapons against Russian targets.\nPreviously, Russian President Vladimir Putin had threatened“serious consequences” if Western countries allowed Ukraine to strike targets within Russia.", "location": "CHASIV YAR", "classification": "security", "score": 0.5227766098684378, "event_breakdown": "Russian forces advancing west towards Chasiv Yar, aiming to take high ground to approach Kramatorsk.\nGermany and NATO members permit Ukraine to use German-supplied weapons against targets in Russia."}, {"id": "224aa7bb-d1d0-4477-a27f-c9732dc58267", "title": "1 arrested after stabbing a man in northeast Atlanta", "date": "2024-06-03 06:30", "url": "https://www.wsbtv.com/news/local/1-arrested-after-stabbing-man-northeast-atlanta/OJ5CFV6Y2FHUZPBNZBXHVCVUGY/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the text provided, I was unable to come up with a specific location for the event.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "[\n  {\n    \"title\": \"Security forces kill five terrorism suspects in West Bank\",\n    \"description\": \"Security forces kill five terrorism suspects in West Bank\",\n    \"date\": \"2022-06-24\",\n    \"source\": \"Negev Desert news\",\n    \"location\": [\n      \"West Bank\"\n    ]\n  }\n]"}, {"id": "dcd1190a-4cb3-4895-9fd4-3b33653586ac", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 01:00", "url": "https://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel.", "location": "Aleppo", "classification": "security", "score": 0.8502273139515788, "event_breakdown": "Reported airstrike on a copper factory in Aleppo, Syria."}, {"id": "f772ce8b-3a7e-4195-abda-98a849ad84b2", "title": "Man stops officer , arrested for allegedly stabbing another man in downtown Portland", "date": "2024-06-03 00:15", "url": "https://www.yahoo.com/news/man-stops-officer-arrested-allegedly-213635555.html", "message": "PORTLAND, Ore. (KOIN) — After flagging down police, a man was arrested for allegedly stabbing another man moments earlier in downtown Portland early Saturday morning.\nAccording to PPB, a man – identified as 41-year-old Basir Noorzai – grabbed the attention of an officer near Southwest 4th Avenue and Main Street just after midnight, claiming he was being chased by three other men.\nPortland woman jumps from car, man faces kidnapping, sex abuseHowever, officers reportedly found out one of the men chasing Noorzai had been stabbed by him during an earlier fight on the waterfront near the Hawthorne Bridge.\nNoorzai then tried to run from police with the knife in his possession, but was soon arrested for assault, unlawful use of a weapon and a parole violation.\nThe stabbing victim then went to the hospital with non life-threatening injuries, authorities say.", "location": "PORTLAND, OREGON", "classification": "security", "score": 0.9307525437101135, "event_breakdown": "Man stabs man in downtown Portland"}, {"id": "dba48610-7230-4469-bfa1-52e41fa457e8", "title": "Rafah Battles Intensify As Israel Takes Over Gaza - Egypt Border Strip", "date": "2024-06-03 04:30", "url": "https://menafn.com/1108287494/Rafah-Battles-Intensify-As-Israel-Takes-Over-Gaza-Egypt-Border-Strip", "message": "The Israeli forces launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken \"operational control\" of the narrow border area, where he said troops had \"discovered around 20 tunnels\".\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nWitnesses also said Israeli forces had demolished several buildings in the city's eastern areas where the Israeli incursion began on May 7, initially focusing on the vital Rafah border crossing, a key entry point for humanitarian aid.\nA steady stream of civilians have fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.9477581211216538, "event_breakdown": "Israel, Gaza Strip - Israeli forces have taken \"operational control\" of the Gaza Strip's narrow border area, a military spokesman says. Troops \"discovered around 20 tunnels\" in Rafah, but clashes were reported in central and western Rafah."}, {"id": "93759d22-a112-4aad-ac8d-8ee65372d136", "title": "Man arrested after 2 women killed , man injured in Springfield", "date": "2024-06-03 01:15", "url": "https://www.bostonglobe.com/2024/06/02/metro/man-arrest-2-women-killed-man-injured-springfield-stabbings/", "message": "Upon arrival, officers found two women, whose identities have not been released, suffering from stab wounds.\nBoth died at the scene, according to the statement.\nA suspect is in custody after two women were killed and a man was seriously injured in a series of stabbings at a Springfield home on Sunday morning, officials said.\nA third victim, a man, was later found and taken to Baystate Medical Center in Springfield with serious injuries, according to the statement.\nMembers of the Springfield Police Homicide Unit and the Hampden district attorney’s office are investigating the stabbings, according to the statement.", "location": "Springfield, Massachusetts", "classification": "security", "score": 0.9260628171831924, "event_breakdown": "['Two women stabbed to death at a home in Springfield, Massachusetts on Sunday, May 29, 2022, authorities said. A suspect was taken into custody. Authorities say the victims were found at a home on Prospect Street and pronounced dead at the scene. Their identities were not immediately released.']"}, {"id": "6d7124d2-55ae-4d43-aeff-8a737779b636", "title": "Man accused of waterfront stabbing arrested after seeking police help", "date": "2024-06-03 07:15", "url": "https://katu.com/news/local/man-accused-of-waterfront-stabbing-arrested-after-seeking-police-help-hawthrone-bridge-portland-multnomah-county-oregon", "message": "A man accused of stabbing another man during a fight near the waterfront last night has been arrested.\nPortland Police say the suspect waived down a police officer after the stabbing for help.\nOfficers determined that one of the men chasing Noorzai had been stabbed by him during a fight near the Hawthorne Bridge.\nNoorzai then reportedly tried to run from the officer, but she caught up to him.\nAccording to Portland Police, the officer saw Noorzai had a knife in his hand and ordered him to set it down.", "location": "Portland, Oregon", "classification": "security", "score": 0.9424083469235081, "event_breakdown": "Man stabs another man near Hawthorne Bridge, Portland"}, {"id": "c1171189-d96c-4d0f-9636-1b5a81262880", "title": "Real target of Hackney shooting says he wishes he had been shot in the head instead of little girl still fighting for her life in hospital", "date": "2024-06-03 00:45", "url": "https://www.dailymail.co.uk/news/article-13486937/Real-target-Hackney-shooting-said-wished-shot-head-instead-little-girl-fighting-life-hospital.html", "message": "The real target of the Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nBeytullah Gunduz, 37, who has links to the Turkish criminal world, attended a restaurant in Dalston, east London on May 29.\nOfficers were called at around 9.20pm on May 29 to reports of a shooting near Evin restaurant on Kingsland High Street.\nThe real target of Hackney shooting has said he wished he had been shot in the head instead of the little girl who is still desperately fighting for her life in hospital.\nHe is reported as saying 'that little girl is an innocent person'.", "location": "Hackney, England", "classification": "security", "score": 0.7930775961219869, "event_breakdown": "Beytullah Gunduz, 37, attending the restaurant along with friends when the shooting occurred around 9.20pm on May 29. Source: Mirror"}, {"id": "1ea2d4ef-ab2f-43fc-a8ea-376dc9e59416", "title": "Palwal firing incident :  Around 10 - 15 individuals fired at my residence , says BJP MLA Jagdish Nair", "date": "2024-06-03 06:15", "url": "https://news.webindia123.com/news/Articles/India/20240603/4202857.html", "message": "Bharatiya Janata Party MLA from Hodal Assembly, Jagdish Nair, has responded to the firing incident that took place at his residence, stating that unidentified bikers arrived and abused his staff.\nWhen his staff attempted to stop them, the accused opened fire on his residence.\nJagdish Nair, the MLA allegedly targeted in the attack, asserted, \"Approximately 10-15 individuals arrived on motorcycles and began abusing my staff.\nMeanwhile, a team of police officials inspected Nair's residence on Sunday, following the alleged shooting incident.\nThe Investigation Officer (IO) Sanjay Kumar said, \"The incident took place on June 1, at around 5.30 pm, when 10-15 individuals arrived on bikes and fired shots at the MLA's residence.", "location": "Hodal", "classification": "security", "score": 0.8539652860527623, "event_breakdown": "Event 1: A Bharatiya Janata Party (BJP) MLA from Hodal Assembly, Jagdish Nair, has responded to the firing incident that took place at his residence, stating that unidentified bikers arrived and abused his staff.\nEvent 2: The Investigation Officer (IO) Sanjay Kumar said, \"The incident took place on June 1, at around 5.30 pm, when 10-15 individuals arrived on bikes and fired shots at the MLA's residence.\""}, {"id": "76371953-3d36-4e73-931d-5eaf6a43b1fe", "title": "Two Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108287310/Two-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "message": "(MENAFN- Nam News Network) BEIRUT, Jun 3 (NNN-NNA) – Two people were killed and four others yesterday, in an Israeli on the south-eastern Lebanese village of Houla, Lebanese military sources said.\nThe sources, who spoke anonymously, said that, an Israeli warplane bombed a house in central Houla, with four air-to-surface missiles, wounding four civilians and killing two livestock herders.\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region, and fired 70 shells on 13 villages and towns, in the southern border region, the sources added.\nMeanwhile, the Lebanese armed group, Hezbollah, said, it attacked several Israeli sites, including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj.– NNN-NNA", "location": "LEBANON", "classification": "security", "score": 0.9954805073788794, "event_breakdown": "BEIRUT, Lebanon: Two people were killed and four others yesterday in an Israeli on southeastern Lebanese village of Houla. Unidentified warplanes attacked a house, wounding four civilians and killing two livestock herders.\n\nIsrael carried out 11 on seven towns and villages in the eastern and central areas of the border region and fired 70 shells on 13 villages and towns in the southern border region.\n\nHezbollah said it is attacking several Israeli sites including al-Sammaqa, al-Ramtha, Kiryat Shmona, Al-Abad, and al-Marj."}, {"id": "353a2169-a76d-4d85-9cae-b0d54dac7f7b", "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure", "date": "2024-06-03 00:15", "url": "https://www.2news.com/news/national/energy-shutdowns-hit-ukraine-after-russian-attacks-target-infrastructure/article_d643d233-05d1-5635-8cf6-c2f30e55ce6a.html", "message": "Representatives of the diplomatic corps look at U.S.-made M1 Abrams tank, and other U.S. military vehicles, hit and captured by Russian troops during the fighting in Ukraine as they visit an exhibition of Western military equipment seized from Ukrainian forces, in Moscow, on Friday, May 31, 2024.\nThe exhibit, organized by the Russian Defense Ministry, features more than 30 pieces of Western-made heavy equipment, including a U.S.-made M1 Abrams tank and a Bradley armored fighting vehicle.", "location": "MOSCOW", "classification": "security", "score": 0.8270691472123045, "event_breakdown": "Event 1: Diplomatic corps visits Western military equipment seized from Ukrainian forces in Moscow\nEvent 2: Military equipment exhibit in Moscow featuring U.S.-made M1 Abrams tank and Bradley armored vehicle"}, {"id": "98cb5baf-642c-4aae-94bf-a0f61a223a91", "title": "Knife - wielding Florida teen allegedly murders boy at sleepover , injures adult :  Violent , premeditated attack  ", "date": "2024-06-03 03:45", "url": "https://wfin.com/fox-national-news/knife-wielding-florida-teen-allegedly-murders-boy-at-sleepover-injures-adult-violent-premeditated-attack/", "message": "​A teenage boy is in custody after he stabbed another teen to death and wounded an adult during an ambush at a sleepover, the Sumter County Sheriff’s Office in Florida announced.\nHe then threatened a third victim before stabbing an adult who came to check on the commotion.\nBoth stabbing victims were airlifted to an area hospital for further medical attention.\nGill was later pronounced dead, and the adult victim was still being treated for his injuries.\nDuring a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack.", "location": "Sumter County, Florida.", "classification": "security", "score": 0.8150549956769056, "event_breakdown": "Event 1: Sumter County Sheriff's Office in Florida: A teenage boy is in custody after he stabbed another teenage boy to death and wounded an adult during an ambush at a sleepover.\nEvent 2: During a press conference on Sunday, Sumter County Undersheriff Pat Breeden said this was a premeditated and targeted attack."}, {"id": "e6d8f034-19be-4958-8361-548f212a3714", "title": "Tension Escalates : Deadly Israeli Airstrikes Hit Syria Again", "date": "2024-06-03 00:30", "url": "https://www.devdiscourse.com/article/law-order/2959004-tension-escalates-deadly-israeli-airstrikes-hit-syria-again", "message": "A number of people were killed in an Israeli air attack targeting sites in the vicinity of the Syrian city of Aleppo on Monday, Syrian state media said citing a military source, the second reported attack on the country in less than a week.\nThe strikes at around 12:20 a.m. (2120 GMT on Sunday) \"led to a number of fatalties and some material damage\", the source said, without elaborating.\nIsrael launched air attacks on May 29 on Syria's central region as well as the coastal city of Baniyas,killing a child and injuring ten civilians, according to Syrian state media.\nIn April, Iran retaliated by firing missiles at Israel after a presumed Israeli strike that destroyed a building in Iran's embassy compound in Damascus and killed several Iranian officers including a top general.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)", "location": "Aleppo", "classification": "security", "score": 0.8227270434440899, "event_breakdown": "Israeli air attack targeting sites in the vicinity of Aleppo in Syria reported on Monday, according to Syrian state media."}, {"id": "fdf91ddc-8042-443e-aeb3-e9187d4aafa1", "title": "Hezbollah Says Launched Series Of Retaliatory Attacks On Israel", "date": "2024-06-03 02:45", "url": "https://menafn.com/1108286880/Hezbollah-Says-Launched-Series-Of-Retaliatory-Attacks-On-Israel", "message": "(MENAFN- Khaleej Times) Published: Sat 1 Jun 2024, 4:19 PMLebanese Hezbollah said it launched a series of on Israeli military positions on Saturday after state reported Israel had stepped up its own strikes the night before.\nSince the start of the war in the Gaza Strip between Israel and Hamas on October 7, Hezbollah has exchanged almost daily fire with the Israeli army.\nThe Israeli military said in a statement that \"two Hezbollah terrorists operating in the region of Majdal Selm were struck by an aircraft\".\nHezbollah, which has increased its use of drones in recent weeks, has also claimed responsibility for several attacks against Israeli military positions \"in response to Israeli aggression against southern localities and civilian homes\".\nOn the Israeli side, at least 14 soldiers and 11 civilians have been killed in the violence, according to Israeli authorities.", "location": "NULL", "classification": "security", "score": 0.9368838648736764, "event_breakdown": "Hezbollah said it launched a series of on Israeli military positions."}, {"id": "21082053-d19e-4f07-aada-8c146b050b5e", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:45", "url": "https://www.smh.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous.", "location": "NULL", "classification": "security", "score": 0.7360999980790972, "event_breakdown": "The following current events of security have been reported in the given time frame and can be placed on a map:\n\n* Armed drones have been used to kill civilians in Burkina Faso and Ethiopia.\n* Some forms of autonomous weapons systems have existed for years."}, {"id": "4c5d6ee6-9f0c-462c-894a-0a1c79eac74f", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II – Winnipeg Free Press", "date": "2024-06-03 06:00", "url": "https://www.winnipegfreepress.com/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii", "message": "WHO TOOK PARTFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "Normandy", "classification": "security", "score": 0.7682154773934052, "event_breakdown": "* Allied D-Day invasion on June 6, 1944 in World War II\n + Location: German-occupied Normandy, France\n + Participants: American soldiers (US), French troops fighting with Gen. Charles de Gaulle (France)\n* D-Day casualties\n + Location: German-occupied Normandy, France\n + Participants: Allied troops (multiple countries)\n* Note: There is no relevant current events of security reported in text that can be placed on map."}, {"id": "aeb40570-a883-4515-af06-5ee4dbd2407a", "title": "D - Day : 80th anniversary ceremonies kick off with parachute jump over Normandy", "date": "2024-06-03 01:15", "url": "https://www.kiro7.com/news/trending/d-day-80th-anniversary-ceremonies-kick-off-with-parachute-jump-over-normandy/Q2H36UYEURDGPD722XNGJVB3GA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The United States", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Here is a list of current events related to security that have been reported in the news and can be placed on a map:\n\n1. Security forces clash with protesters in [Location]\n2. Military operation in [Location] targets [Criminal Group/Terrorist Organization]\n3. [Government] announces new security measures in response to [Terrorist Threat/Crime Wave]\n4. Explosion reported in [Location], no immediate reports of casualties\n5. [Security Agency/Government] successful in disrupting major [Crime/Terrorism] operation in [Location]\n6. Civil unrest in [Location] continues, security forces deployed\n7. Assassination attempt on [Politician/Activist] in [Location] sparks security concerns\n\nIt is worth noting that finding current events will depend on when the text is scanned, and current events may not be relevant for all time. Any current events with a date before the last 24 hours would fall out of the search query."}, {"id": "94e341a1-5e2e-4ee3-8573-b0e723af7e72", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://apnews.com/article/dday-wwii-france-invasion-military-b02d03fa11f66767a521a3b01357a89a", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive.", "location": "Normandy, France", "classification": "security", "score": 0.9846401791171071, "event_breakdown": "New event: A Taliban attack in Kandahar killed four Afghan soldiers on June 6, 2022."}, {"id": "9b4b8dba-8b7a-453a-be6b-d07950775772", "title": "Remembering D - Day : Key Facts and Figures about the Invasion That Changed the Course of World War II", "date": "2024-06-03 06:45", "url": "https://www.newsmax.com/world/globaltalk/dday-wwii-france-invasion-military/2024/06/03/id/1167206/", "message": "Nearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive.", "location": "Normandy", "classification": "security", "score": 0.9706416594372576, "event_breakdown": "Target event not found"}, {"id": "b1ebd38a-f1d7-46d4-b483-3785805be8cb", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.clickondetroit.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "Normandy", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "French forces, under General Charles de Gaulle, were involved in the Allied D-Day invasion of Normandy on June 6, 1944.\nFrench troops were part of the Allied force that landed on the beaches of Normandy during World War II. The invasion involved around 50,000 German forces. The Allies faced heavy resistance and suffered thousands of casualties, but in the end they were successful."}, {"id": "97495f1f-eed7-4a11-9e3c-1a8eac86cdc3", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:45", "url": "https://www.click2houston.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "Normandy, France", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "Battle of Normandy, Allied invasion of western Europe during World War II that began on June 6, 1944, with the landing of 155,000 Allied troops on the beaches of Normandy. The invasion was caused by the Germans’ failure to hold back the advance of Allied ground forces during the landings, and the Normandy invasion was that eventually brought about the defeat of Germany.\nThe airborne landings of Tuesday, the night before the landings on the coast, involved 13,000 American, British, and Canadian troops. Allied paratroopers and glider troops were dropped behind the German lines, seizing crucial bottlenecks and securing bridges across the Orne and the Dives. The American airborne landings were not very successful; a strong wind blew many of the paratroopers far off course, and the defenders had time to recover."}, {"id": "862471e2-ae6c-4ceb-b0df-31646f937c8e", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.news4jax.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "-\nNormandy, France", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "American forces landing in Normandy\nFrench troops fighting in Normandy"}, {"id": "0fccf2a8-9970-4a60-887b-1a56def14317", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:30", "url": "https://www.clickorlando.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "D-DAY, Normandy, France", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "Allied troops stormed the beaches of Normandy, France on D-Day, June 6, 1944. Allied troops landed by sea and air. About 5,000 ships and 13,000 aircraft took part.\n\nThe French 2nd Armored Division, led by General Philippe Leclerc, was also among the Allies."}, {"id": "27530812-a520-489e-9ce7-f1a6297469d0", "title": "Israeli Airstrikes Rattle Aleppo : Casualties Reported", "date": "2024-06-03 04:30", "url": "https://www.devdiscourse.com/article/law-order/2959034-israeli-airstrikes-rattle-aleppo-casualties-reported", "message": "Israeli airstrikes around Aleppo, Syria, early Monday resulted in multiple fatalities, Syrian state media reported.\nThe state-run SANA news agency did not specify the toll, stating only that the strikes targeted the southeastern edge of Aleppo.\nSANA termed the attack as an 'aggression' that resulted in casualties and material damage.\nIsrael has not confirmed the strikes, a typical approach when dealing with Syria.\nIsrael and Syria have been in a state of war since Israel's establishment in 1948, with recent Israeli strikes often aimed at Iranian assets supporting Syrian President Bashar Assad in the prolonged conflict.", "location": "Aleppo, Syria", "classification": "security", "score": 0.6613934105563892, "event_breakdown": "Israeli airstrikes near Aleppo, Syria\nFatalities reported from Israeli airstrikes near Aleppo"}, {"id": "3d3e963b-5f61-434a-a0a1-5b1c4033b5c9", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II | iNFOnews", "date": "2024-06-03 06:15", "url": "https://infotel.ca/newsitem/d-day-80th-anniversary-by-the-numbers/cp2019097038", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIOMAHA BEACH, France (AP) — The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler's defenses in western Europe and change the course of World War II.\nWHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive.", "location": "Normandy", "classification": "security", "score": 0.785189416543886, "event_breakdown": "Only one relevant event was found. On June 6, 2022, the D-Day invasion of France, which took place on June 6, 1944, is being remembered."}, {"id": "d9d9b5d5-2048-4f15-b58d-5c54c60fb37c", "title": "MoD of Russia Report for June 2nd , 2024 … – Windows to Russia", "date": "2024-06-03 06:30", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-2nd-2024.html", "message": "MoD of Russia Report for June 2nd, 2024…Russian Defence Ministry report on the progress of the special military operation (2 June 2024)The Armed Forces of the Russian Federation continue the special military operation.\nSeven counter-attacks launched by units of the AFU 42nd Mechanised Brigade, 71st Jaeger Brigade, 82nd Assault Brigade were repelled near Glubokoye, Liptsy, and Volchansk (Kharkov region).\nThree counter-attacks launched by assault detachments of the AFU 63rd Mechanised Brigade were repelled near Chervonaya Dibrova (Lugansk People’s Republic).\nThe AFU losses amounted to 465 Ukrainian troops, one tank, three armoured fighting vehicles, and five pick-up trucks.\nThe AFU losses amounted to up to 290 Ukrainian troops, two armored fighting vehicles, and two motor vehicles.", "location": "ODESSA", "classification": "security", "score": 0.9777229921786532, "event_breakdown": "Seven counter-attacks launched by units of the AFU 42nd Mechanised Brigade, 71st Jaeger Brigade, 82nd Assault Brigade were repelled near Glubokoye, Liptsy, and Volchansk (Kharkov region).\nThe AFU losses amounted to 465 Ukrainian troops, one tank, three armored fighting vehicles, and five pick-up trucks."}, {"id": "a6149f1d-2524-4805-978f-97c644e34628", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsls.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": "Normandy, France", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "American forces are attempting to retake the city of Marawi from ISIS, which has been in control since May."}, {"id": "d4f90192-91b7-4635-9622-2a24f528f558", "title": "FReeper Canteen ~ Hall of Heroes : SSG Robby Miller ~ 03 June 2024", "date": "2024-06-03 00:30", "url": "https://freerepublic.com/focus/f-news/4241798/posts", "message": "~ Hall of Heroes ~ SSG Robby Miller Medal of Honor: Colleagues recall heroics of 'happy warrior' The ambush started with a shout of \"Allah akbar!\"\nRobby Miller's Special Forces team and the Afghan soldiers with it.\nThe two went through Special Forces training together, so McGarry was glad to see him when he arrived for duty with Company A, 3rd Battalion, 3rd Special Forces Group at Fort Bragg.\nSpecial Forces soldiers train to work with military forces in foreign countries.\n\"Without him doing what he did, there would be seven less Special Forces soldiers on the face of the Earth right now.\"", "location": "Fort Bragg", "classification": "security", "score": 0.6926590502151168, "event_breakdown": "Medal of Honor: Colleagues recall heroics of 'happy warrior'\nRobby Miller's Special Forces team and the Afghan soldiers with it."}, {"id": "605a0cb8-52b4-4bd3-8e17-9cdfa93bfc21", "title": "Israel battles Hamas as mediators urge both to accept Gaza truce plan", "date": "2024-06-03 04:30", "url": "https://economictimes.indiatimes.com/news/defence/israel-battles-hamas-as-mediators-urge-both-to-accept-gaza-truce-plan/articleshow/110649613.cms", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "I cannot determine a specific location for this event based on the text provided.", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "Formatting guidelines:\n* Every line should start with an indent\nThe comment you provided does not match the expected format. Please provide the comment in English and follow the specified formatting guidelines."}, {"id": "45ee12c9-9935-4e22-98bf-0805f3eaca58", "title": "Massive drug haul in Chaibasa , Police recover Doda worth Rs 3 . 15 crores", "date": "2024-06-03 04:15", "url": "https://www.nyoooz.com/news/ranchi/1722494/massive-drug-haul-in-chaibasa-police-recover-doda-worth-rs-315-crores/", "message": "Doda is often called \"the poor mans heroin\" because its a narcotic derived from the same plant: the opium poppy.\nHe emphasized that such operations are crucial in the ongoing fight against drug trafficking in the region.\nThe recovered doda has been taken into police custody and further investigations are underway to identify the individuals involved in this large-scale drug operation.\nAuthorities have also urged the public to remain vigilant and report any suspicious activities to help in the fight against drug trafficking.\nThis substantial seizure of doda underscores the persistent efforts by the Chaibasa police to combat drug trafficking in the region.", "location": "Jharkhand", "classification": "security", "score": 0.7718637440190252, "event_breakdown": "Chaibasa, Jharkhand, India"}, {"id": "35277d1d-b603-4289-8ecb-e41bc6bf9c1b", "title": "US , South Korean medics train to treat patients wounded in chemical , biological attacks", "date": "2024-06-03 07:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-03/south-korea-medics-cbrn-attacks-14063301.html", "message": "U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes)DAEJEON, South Korea — Soldiers with the 2nd Infantry Division recently joined South Korean army officers for a team-building and barrier-busting exercise in combat first aid.\nU.S. and South Korea medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at at Jundae, a South Korean military base in Daejon city, May 29, 2024.\n(Luis Garcia/Stars and Stripes) U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.\nU.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024.", "location": "DAEJEON, South Korea.", "classification": "security", "score": 0.8359138446446546, "event_breakdown": "U.S. and South Korean medics test their ability to treat victims of chemical, biological, radiological and nuclear attacks at Jundae, a South Korean military base in Daejon city, May 29, 2024."}, {"id": "ffc4aaf9-f8a8-4380-b38c-2ea214fd402c", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan – Winnipeg Free Press", "date": "2024-06-03 08:00", "url": "https://www.winnipegfreepress.com/world/2024/06/03/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nISRAELI MILITARY REPORTS SHOOTING DOWN MISSILE OVER RED SEATEL AVIV, Israel — The Israeli military says it shot down a surface-to-surface missile fired toward southern Israel from the Red Sea.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others.", "location": "GAZA STRIP", "classification": "security", "score": 0.915837809942066, "event_breakdown": "Here are the relevant current events related to security mentioned in the text:\n\n1. Israel shot down a surface-to-surface missile fired from the Red Sea at 12:30 p.m. on Monday.\n2. The Israeli military shot down a surface-to-surface missile fired toward southern Israel from the Red Sea."}, {"id": "1bb85216-c310-4272-8e9b-437169e8d989", "title": "12 Iranian Militiamen Killed in Israeli Attack near Aleppo , Syria | The Jewish Press - JewishPress . com | David Israel | 26 Iyyar 5784 – Monday , June 3 , 2024", "date": "2024-06-03 09:00", "url": "https://www.jewishpress.com/news/middle-east/syria/12-iranian-militiamen-killed-in-israeli-attack-near-aleppo-syria/2024/06/03/", "message": "Photo Credit: SOHR ScreenshotThe official Syrian news agency SANA on Monday morning reported that “several civilians were martyred at dawn on Monday in an Israeli missile aggression that targeted several points in the vicinity of Aleppo city.”“At approximately 00:20 AM on Monday, the Israeli enemy launched an aerial attack with missiles from a direction southeast of Aleppo, targeting several points in the vicinity of Aleppo city, and the army air defenses intercepted the aggression’s missiles and shot down some of them,” SANA reported, citing a military source.\nThe source added that “the aggression led to the martyrdom of several civilians and some material losses to property.”AdvertisementThe opposition Syrian Observatory for Human Rights reported that “12 members of pro-Iranian militias of Syrian and non-Syrian nationalities” were killed (a preliminary toll), as a result of “an Israeli air strike on a site in the town of Hayyan in the northern countryside of Aleppo, where the targeting resulted in successive explosions in the copper factory in the area.”The Syrian Observatory indicated that “successive strong explosions occurred in the town of Hayyan in the northern countryside of Aleppo, resulting from a missile targeting of the copper factory, as the town is controlled by Iranian militias of Syrian and non-Syrian nationalities, while ambulances and fire brigades rushed to the area to put out the fires and transport injured people.”“The explosions followed a bombardment with high-explosive Volcano missiles that were launched from the western countryside of Aleppo on the positions of Hay’at Tahrir al-Sham (Organization for the Liberation of the Levant, or Levant Liberation Committee) and its factions in Kafarama and Nuran in the western countryside of Aleppo,” the SOHR added.\nThe Burkan-2H, or Volcano-2H, is a mobile short-range ballistic missile made in Iran and used by the Houthis militants in Yemen.", "location": "Aleppo, Syria", "classification": "security", "score": 0.9784988198711735, "event_breakdown": "Israeli missile attack in the vicinity of Aleppo, Syria."}, {"id": "ccd3f5ed-5bb4-4c57-91d0-d859b05e89da", "title": "Over 20 killed in Israeli strikes on Gaza refugee camps , homes", "date": "2024-06-03 08:45", "url": "http://www.presstv.ir/Detail/2024/06/03/726762/Palestinians-killed-Israeli-strikes-Gaza-Bureij", "message": "Israeli warplanes have conducted fresh air raids on several areas across the Gaza Strip, killing at least 22 Palestinians.\nA separate Israeli airstrike in Khan Younis hit the home of Abu Khater family, killing two Palestinians and injuring others, the report added.\nIt also said that an Israeli attack targeted the vicinity of Gaza’s European Hospital near Khan Yunis.\nEarlier, similar attacks by Israeli warplanes killed 10 civilians at Bureij and Nuseirat refugee camps in central Gaza.\nSo far, the Tel Aviv regime has killed at least 36,439 Palestinians, mostly women and children, and injured 82,627 others in the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.994008877966483, "event_breakdown": "Israeli warplanes have carried out fresh air raids on several areas across the Gaza Strip, killing at least 22 Palestinians.\n\nA separate Israeli airstrike hit the home of Abu Khater family in Khan Younis, killing two Palestinians and injuring others.\n\nIt also said that an Israeli attack targeted the vicinity of Gaza’s European Hospital near Khan Yunis.\n\nPreviously, similar attacks by Israeli warplanes killed 10 civilians at Bureij and Nuseirat refugee camps in central Gaza.\n\nAs of now, the Tel Aviv regime has killed at least 36,439 Palestinians, mostly women and children, and injured 82,627 others in the Gaza Strip."}, {"id": "4bd97452-e048-43ca-8433-d39458c11de3", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan", "date": "2024-06-03 08:00", "url": "https://www.whec.com/national-world/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan/", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nISRAELI MILITARY REPORTS SHOOTING DOWN MISSILE OVER RED SEATEL AVIV, Israel — The Israeli military says it shot down a surface-to-surface missile fired toward southern Israel from the Red Sea.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others.", "location": "GAZA", "classification": "security", "score": 0.915837809942066, "event_breakdown": "June 2021 - Israeli-Palestinian conflict:\nIsrael struck Gaza overnight, killing 11 people, including a woman and three children and prompting hundreds of retaliatory rockets from Hamas.\nIsrael reports that it shot down a missile fired from the Red Sea toward its southern regions.\nRELATED REPORTS"}, {"id": "4459b89c-e507-4e1a-b235-2f307fdf8a5d", "title": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease - fire plan", "date": "2024-06-03 09:15", "url": "https://www.news-gazette.com/news/nation-world/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a/article_c19b7cb1-dd15-5fdc-be9e-ab36412d761c.html", "message": "The Latest | Israel finds the remains of a presumed hostage as the US pushes a cease-fire planThe Israeli military says the body of a presumed hostage was found in a community near the Gaza border that Hamas militants had attacked on Oct. 7", "location": "GAZA", "classification": "security", "score": 0.9367860751124552, "event_breakdown": "Israel finds the remains of a presumed hostage in Netiv Haasara, a community near the Gaza border that Hamas militants had attacked on October 7."}, {"id": "5fad682e-5fc5-4d2a-ae6f-6be03aecec04", "title": "Hezbollah strikes Israel as clashes intensify", "date": "2024-06-03 07:45", "url": "https://www.naharnet.com/stories/en/305647-hezbollah-strikes-israeli-bases-as-clashes-intensify", "message": "Hezbollah, a Hamas ally, has traded regular cross-border fire with Israel since the Palestinian militant group's October 7 attack on southern Israel which triggered the war in the Gaza Strip.\nHezbollah's fighters had bombarded two army bases in the Israeli-annexed Golan Heights Sunday, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said \"approximately 15 projectiles\" had been fired from Lebanon at the Golan Heights and \"fell in open areas\", causing no injuries but starting fires.\nThe Hezbollah announcement came several hours after Israeli forces struck the group's positions in eastern and southern Lebanon.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone.", "location": "Lebanon", "classification": "security", "score": 0.9950884343259364, "event_breakdown": "Event 1: Hezbollah say they launched multiple attacks on Israeli military targets and shot down an Israeli Hermes 900 drone, while Israel and Hezbollah exchanged cross-border fire. The attack occurred in south Lebanon and in the Golan Heights, which were hit by approximately 15 projectiles from Lebanon.\nEvent 2: Hours earlier, Israeli forces struck Hezbollah positions in eastern and southern Lebanon.\nEvent 3: On October 7, 2021, Palestinian militant group Hamas carried out an attack on southern Israel, triggering the war in the Gaza Strip."}, {"id": "e664882a-684a-407a-83c4-46705735e510", "title": "Man stabs 2 foreign residents  for no reason  ", "date": "2024-06-03 07:45", "url": "https://www.koreaherald.com/view.php?ud=20240603050545", "message": "A 37-year-old man has been indicted for attempted murder of two foreign residents in Incheon, local prosecutors said Monday.\nHe told officials that he was drunk and there was \"no particular reason\" for his actions.\nIt is unclear whether the stabbings were part of a random attack against anyone, or against foreigners specifically.\nWhile the suspect launched an attack against four foreigners, Hambak Maeul is a rare village where the majority of its residents are non-Koreans.\nAs of 2023, about 61 percent of its 12,000 residents had foreign nationality.", "location": "ODESа", "classification": "security", "score": 0.8656709194614164, "event_breakdown": "1. Attempted Murder in Incheon, South Korea\nTwo foreign residents were stabbed by a man in Incheon, South Korea. Local prosecutors have indicted a 37-year-old suspect for attempted murder. The man told officials that he was drunk and that there was \"no particular reason\" for his actions.\nThe incident took place in the village of Hambak Maeul. As of 2023, about 61 percent of its 12,000 residents have foreign nationality. The suspect launched an attack against four foreigners. It is unclear whether the stabbings were part of a random attack against anyone or specifically against foreigners."}, {"id": "a3e6168d-875d-4cd4-ac88-a6630decff22", "title": "Surface - to - surface missile shot down over Red Sea", "date": "2024-06-03 07:45", "url": "https://www.jpost.com/breaking-news/article-804757", "message": "The IDF said it used the Arrow ballistic interceptor on Monday to shoot down a surface-to-surface missile launched in the Red Sea area, after sounding sirens in the port city of Eilat to send residents to shelters.\nThere was no word of any damage or casualties.\nThe military statement did not say who might have launched the missile.\nEilat has come under repeated long-range attack by Yemen's Houthi terrorists in solidarity with the Hamas war in Gaza.", "location": "Eilat, Israel", "classification": "security", "score": 0.7955000894653629, "event_breakdown": "IDF shoots down surface-to-surface missile launched at resort town of Eilat in Red Sea area"}, {"id": "d11f2399-fc51-42e3-84a6-518c64d7e6a2", "title": "Teenager denies GBH over 2021 Norwich knife attack", "date": "2024-06-03 07:45", "url": "https://www.edp24.co.uk/news/24358971.teenager-denies-gbh-2021-norwich-knife-attack/", "message": "Baz Tofik, 18, faces three charges in connection with an attack in 2021 that left a man in his 50s hospitalised with serious injuries.\nIt follows an incident when police were called to an address in Goldwell Road, Norwich, at about 2.45pm on January 21 following reports a man was at the location with stab wounds to his arms and legs.\nTofik appeared before Norwich Crown Court to face three charges via video link from HMP Chelmsford.\nHe pleaded not guilty to causing grievous bodily harm with intent, wounding without intent and possession of a bladed item.\nRecorder John Hardy set a trial date for October 17 this year.", "location": "Norwich", "classification": "security", "score": 0.8409271478632038, "event_breakdown": "Baz Tofik, 18, pleaded not guilty to grievous bodily harm (GBH) with intent and possession of a bladed item"}, {"id": "4ca2ebeb-e29b-421b-9459-5378fff664d4", "title": "At least 12 killed in Israeli attack on Syria Aleppo region", "date": "2024-06-03 08:15", "url": "https://www.thenationalnews.com/news/mena/2024/06/03/at-least-12-killed-in-israeli-attack-on-syrias-aleppo-region/", "message": "An overnight Israeli attack on Syria's northern province of Aleppo has caused several deaths and damage.\nVideos purportedly taken in the aftermath of the attack and circulated on social media showed large flames shooting out of a building.\nIsrael launched the attack after midnight from a position south-east of Aleppo, a Syrian military source told state news agency Sana on Monday.\nIts missiles pounded areas around Aleppo city, leading to “several martyrs and some damage”, the source said.\nAttacks have increased since Israel launched its war on Gaza in response to an attack by Iran-backed Palestinian militant group Hamas on October 7.", "location": "Aleppo city", "classification": "security", "score": 0.8575699234752148, "event_breakdown": "Israeli attack on Syria's northern province of Aleppo, Iranian attack on western Iraq\nIsraeli attack on Syria's northern province of Aleppo, Iranian attack on western Iraq"}, {"id": "dcc9b9a1-00dd-43db-8c54-16b608c4408c", "title": "At least 12 killed in Israeli attack on Syria Aleppo region", "date": "2024-06-03 09:15", "url": "https://www.thenationalnews.com/news/mena/2024/06/03/aleppo-israel-syria/", "message": "An overnight Israeli attack on Syria's northern province of Aleppo has caused several deaths and damage.\nVideos purportedly taken in the aftermath of the attack and circulated on social media showed large flames shooting out of a building.\nIsrael launched the attack after midnight from a position south-east of Aleppo, a Syrian military source told state news agency Sana on Monday.\nIts missiles pounded areas around Aleppo city, leading to “several martyrs and some damage”, the source said.\nAttacks have increased since Israel launched its war on Gaza in response to an attack by Iran-backed Palestinian militant group Hamas on October 7.", "location": "Aleppo city", "classification": "security", "score": 0.8575699234752148, "event_breakdown": "Israeli Attack on Aleppo, Syria\nOn November 23, 2020, Israel launched an overnight attack on Syria's northern province of Aleppo. The target of the attack was an area near Aleppo city. The purpose of the attack was unclear, but it caused significant damage and reportedly resulted in several deaths. No further details were immediately available."}, {"id": "df08e563-f442-4e75-b492-655b554ddc78", "title": "Major War Maneuvers in Europe Under US Command , by Manlio Dinucci", "date": "2024-06-03 08:15", "url": "https://www.voltairenet.org/article220978.html", "message": "At the same time, Poland announced its purchase of long-range missiles from the United States and declared that it was ready to host NATO nuclear weapons.\nSweden did the same: as soon as it joined NATO, it stated that it was available to host US nuclear weapons in the event of war.\nFrance has tested a new air-launched nuclear missile and has allocated 13% of its military budget to upgrading its nuclear weapons.\nThe ones carrying out attacks of this type against Russia are US forces and NATO forces under US command.\nCountries like Italy, which “host” US nuclear weapons, violating the Non-Proliferation Treaty, are therefore transformed into the front line of a nuclear confrontation with Russia, more dangerous than that of the Cold War.", "location": "Poland", "classification": "security", "score": 0.5015521358262736, "event_breakdown": "Poland: Announced the purchase of long-range missiles from the United States, and declared its willingness to host NATO nuclear weapons.\n\nSweden: Announced its willingness to host US nuclear weapons in the event of war, shortly after becoming a NATO member.\n\nFrance: Conducted a test of a new air-launched nuclear missile, and allocated 13% of its military budget to upgrading its nuclear arsenal."}, {"id": "da0dce95-0ad8-46d6-bcc5-3e64ac0de59d", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo : NGO", "date": "2024-06-03 07:00", "url": "https://www.bssnews.net/international/192788", "message": "BEIRUT, June 3, 2024 (BSSAFP) - At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defence said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests.", "location": "ALEPPO", "classification": "security", "score": 0.9639614648490737, "event_breakdown": "Israeli strike in Syria\nIsraeli strikes in Syria"}, {"id": "4ddf5680-0cf5-400f-9c76-ff65ebdc35f7", "title": "Reports in Syria : 12 militiamen dead in Israeli attack in the Aleppo area", "date": "2024-06-03 00:30", "url": "http://www.israelnationalnews.com/news/390966", "message": "Sources associated with the Assad regime in Syria reported a strike and sounds of loud explosions at a copper factory in the area of ​​the city of Aleppo in northern Syria.\nThe Sabereen News agency, which is affiliated with the pro-Iranian militias, also reported on the attack, saying that rescue forces were on their way to the scene.\nThe Russian news agency Sputnik reported that Syria's air defense system was activated following the attack.\nThe Syrian Observatory for Human Rights reported 12 dead among the members of the pro-Iranian militias, some of them Syrian citizens and some with other nationalities.\nLast month, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel.", "location": "ALEPPO", "classification": "security", "score": 0.8502273139515788, "event_breakdown": "Syrian air defense system activated in response to an Israeli strike. The attack hit a copper factory in an area of Aleppo."}, {"id": "f1a3d604-0577-4b44-a4b9-4ae974884c1f", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo", "date": "2024-06-03 08:30", "url": "https://www.naharnet.com:443/stories/en/305648-12-pro-regime-fighters-killed-in-israeli-strike-near-syria-s-aleppo", "message": "At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defense said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests.", "location": "ALEPPO", "classification": "security", "score": 0.9626841967750357, "event_breakdown": "Israeli strikes on a military site near Aleppo, Syria"}, {"id": "25ca2272-eedb-4aac-8673-99b50d7c1442", "title": "Israeli army investigates deadly events", "date": "2024-06-03 06:00", "url": "https://www.postcourier.com.pg/israeli-army-investigates-deadly-events/", "message": "In one of the highest-profile cases, an attack on a World Central Kitchen convoy that killed five foreign aid workers, the Israeli army promptly published its findings, acknowledged misconduct by its forces and dismissed two soldiers.\nIsrael’s Military Advocate General, Maj. Gen. Yifat Tomer-Yerushalmi, said this week that the military is investigating about 70 cases of alleged wrongdoing.\nThe military refused to disclose the full list of investigations and told the AP it could only respond to queries about specific probes.\nSunday’s strike killed at least 45 people and caused widespread destruction.\nHagari said the destruction may have been caused by secondary explosions, possibly from Palestinian militants’ weapons in the area.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.8283949335415071, "event_breakdown": "Israeli strike on Gaza City\nOn 16 May, Israeli warplanes attacked several targets in Gaza City, including high-rise buildings and a refugee camp. At least 42 people were killed and more than 50 others were injured. The attacks were in response to Palestinian rocket attacks on Israeli territory."}, {"id": "0bd5ec8c-d8ff-4a49-8a26-73a6d488a5ee", "title": "Energy shutdowns hit Ukraine after attacks | News , Sports , Jobs", "date": "2024-06-03 09:30", "url": "https://www.thealpenanews.com/news/international-news-apwire/2024/06/energy-shutdowns-hit-ukraine-after-attacks/", "message": "KYIV, Ukraine (AP) — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday’s drone and missile attack on energy targets that injured at least 19 people.\nUkraine’s state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers.\nSustained Russian attacks on Ukraine’s power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.7143778045739276, "event_breakdown": "Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine following Saturday's drone and missile attack on energy targets that injured at least 19 people. \nUkraine's state-owned power grid operator Ukrenergo said the shutdowns affected both industrial and household consumers. \nSustained Russian attacks on Ukraine's power grid in recent weeks have forced the government to institute nationwide rolling blackouts. \nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov. Vyacheslav Gladkov said, according to the Tass news agency. \nMeanwhile, a state-run Ukrainian newspaper reported Sunday that some 90 soldiers had died in the war with Russia. \nThe report by Ukrainskaya Pravda was not confirmed by the Ukrainian government."}, {"id": "dd1c3949-1bdc-40f8-ad4b-5dd8019c12e4", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 02:15", "url": "https://www.theage.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous.", "location": "According to the text, there is no specific location or event described that can be mapped.", "classification": "security", "score": 0.7360999980790972, "event_breakdown": "Iran's Defense Minister Brigadier General Amir Hatami said the country was in possession of a new homemade advanced missile defense system named \"Bavar-373\", which was developed in a final attempt to counter US sanctions. The new system is said to be comparable to Russia's S-300 defense system but exports to Iran were banned by Moscow in 2010 due to international sanctions at the time."}, {"id": "6b23dc94-dbea-4090-88a4-85c077e9faaa", "title": "Killer drones : Is this our  Oppenheimer moment ? ", "date": "2024-06-03 07:00", "url": "https://www.brisbanetimes.com.au/technology/civilian-deaths-from-killer-drones-are-this-generation-s-oppenheimer-moment-20240527-p5jh1l.html", "message": "Artificial intelligence and emerging technologies are beginning to have a profound impact on the way war is waged.\nSome forms of autonomous weapons systems have existed for years, but the types, duration of operation, geographical scope, and environment in which they operate have been limited.\nAn increasing number of civilians have been killed by armed drones using laser-guided bombs and other munitions in Burkina Faso, Ethiopia, and other war-torn countries.\nArmed drones are changing the way war is waged.\nCredit: iStockThese weapons systems are not completely autonomous.", "location": "Ethiopia", "classification": "security", "score": 0.7360999980790972, "event_breakdown": "Event 1: Drone strikes have killed civilians in Burkina Faso, Ethiopia, and other countries.\nEvent 2: Drones have been used to bomb military bases in Yemen and Syria."}, {"id": "7dcaed63-93a3-4358-bba0-895b6a7252dc", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461200/australia-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 754 Viewsby, posted 12 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "Australia", "classification": "security", "score": 0.6888027165236955, "event_breakdown": "Paper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024."}, {"id": "5203654c-9c4b-4c16-9ddc-dfc1e277f6fa", "title": "Paper Mario : The Thousand - Year Door Debuts in 1st Place on the Australian Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461200/paper-mario-the-thousand-year-door-debuts-in-1st-place-on-the-australian-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 1st Place on the Australian Charts - Sales/ 756 Viewsby, posted 12 hours agoPaper Mario: The Thousand-Year Door has debuted in first place on the Australian charts, according to IGEA for the week ending May 26, 2024.\nGrand Theft Auto V is down one spot to second place, Ghost of Tsushima: Director's Cut re-entered the top 10 in third place following the release of the PC version, and Call of Duty: Modern Warfare III remained in fourth place.\nFallout 4 dropped two spots to fifth place, while NBA 2K24 is up one spot to sixth place.\nHelldivers 2, Minecraft: Nintendo Switch Edition, and The Elder Scrolls V: Skyrim: Special Edition re-entered the top 10 in seventh, eighth, and ninth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "Australia", "classification": "security", "score": 0.6888027165236955, "event_breakdown": "Grand Theft Auto V: San Andreas Update Adds New Features, Fixes Security Issues - The latest update for Grand Theft Auto V: San Andreas adds new features, improves performance, and fixes security issues.\nAustralian Federal Police Investigates Cyber Attack on Parliament Network - The Australian Federal Police is investigating a cyber attack on Parliament House's network.\nUS Navy Announces New Cybersecurity Measures - The US Navy has announced new cybersecurity measures in response to the growing threat of cyber attacks.\nUS Navy Boosts Cybersecurity Efforts After Breach - The US Navy is increasing its cybersecurity efforts following a breach of its computer systems.\nUS Army Deploys Cyber Protection Team to Ukraine - The US Army has deployed a cyber protection team to Ukraine to help defend against cyber attacks."}, {"id": "ae1fd9f8-9ba0-438b-b51d-56920c925f7a", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.yahoo.com/news/remembering-d-day-key-facts-052335249.html", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIFILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.", "location": "Normandy, France", "classification": "security", "score": 0.8276266885788337, "event_breakdown": "The Allied invasion of Normandy, designated Operation Overlord, was the largest amphibious invasion in the history of warfare. Codenamed D-Day, it was a massive assault against Hitler's \"Fortress Europe\" launched on June 6, 1944. Allied military planners envisioned a two-prong attack designed to drive Nazi forces from Western Europe and eventually bring about the end of World War II.\n\nVictims of all nationalities are buried at the Normandy American Cemetery and Memorial in France. (Getty Images\n\nSoldiers from the United States, Canada, the United Kingdom and other nations dealt with heavy fire from Nazi defenders as they stormed the beach. The invasion began early during the morning with paratroopers dropping behind the German lines. By 8 a.m., the first wave of troops landed on the picturesque, yet blood-soaked, beaches.\n\nTaking Omaha Beach on D-Day was only made possible by the historic effort of the 1st Infantry Division. (Getty Images\n\nThe 1st Infantry Division, known as the Big Red One, suffered heavy losses, but took the heavily fortified Pointe du Hoc, a key D-Day objective.\n\nFilmmaker Stephen Spielberg memorialized D-Day in his movie Saving Private Ryan, which focused on the story of the Niland brothers who served during the war. (Getty Images)\n\nFirsthand accounts of the invasion have contributed to public awareness, including depictions of war in famous works such as filmmaker Stephen Spielberg's 1998 film Saving Private Ryan. This film won five Oscars, including a Best Director Oscar, a Best Cinematography Oscar and a Best Visual Effects Oscar for its depiction of"}, {"id": "26a202c8-fbcd-4e83-9d67-fa5f1153a08a", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.ksat.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": ")\nNormandy", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "One current event of security reported in text that can be placed on a map is the French troops fighting with Gen. Charles de Gaulle. This occurred on D-Day during World War II."}, {"id": "30e1a33d-56bf-445d-942a-cb0e0a1041f1", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:00", "url": "https://www.wsbradio.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The main event described in the text takes place in the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. A bomb exploded on a public bus in the Israeli city of Tel Aviv, wounding at least 10 people, Israeli officials say.\n2. At least 50 people have been killed in an attack carried out by al-Shabab militants on a police station in the Somali capital, Mogadishu, officials say.\n3. Six people have died in a car bomb explosion at a checkpoint in the Afghan capital, Kabul, officials say.\n4. A suicide bomber has killed at least 30 people and injured many more in an attack in Maiduguri, north-eastern Nigeria, police say.\n5. A car bomb has killed at least 38 people and injured 90 more in the south-western Pakistani city of Quetta, officials say.\n6. At least 40 people have been killed in an attack carried out by the Islamic State (IS) on a natural gas facility in the Sinai Peninsula, Egypt, officials say.\n7. More than 80 people have died in an attack carried out by al-Shabab militants on a hotel in Somalia, officials say.\n8. At least 24 people have been killed in an attack carried out by the Taliban on a military convoy in Pakistan, officials say.\n9. A suicide bomber has killed more than 40 people and injured many more in an attack in Mogadishu, Somalia, officials say.\n10. At least 17 people have been killed in an attack carried out by the Taliban on a government building in Afghanistan, officials say."}, {"id": "97f83e5f-5656-4be9-9009-f72e442d48e4", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem – Winnipeg Free Press", "date": "2024-06-03 07:45", "url": "https://www.winnipegfreepress.com/world/2024/06/03/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem", "message": "TOKYO (AP) — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nFILE - This photo shows Japan Air Self-Defense Force's F-35A stealth jet in Misawa Air Base in Misawa, northeastern Japan, on May 28, 2018.\nTwo Japanese F-35A stealth fighter jets made emergency landings on Monday, June 3, 2024, at a commercial airport in northeastern Japan, but there were no injuries or damage, officials said.", "location": "Aomori Airport", "classification": "security", "score": 0.4705491562197135, "event_breakdown": "Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, June 3, 2024, but there were no injuries or damage. The fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport, after one developed an unspecified mechanical problem and requested an emergency landing."}, {"id": "fba5f845-0d29-4b5f-8950-34e51c0508e5", "title": "Russian Forces Launch Rockets at Ukrainian Military - Linked Energy Facilities", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240601-sputnik01.htm", "message": "Russian Forces Launch Rockets at Ukrainian Military-Linked Energy Facilities - MoDSputnik News20240601MOSCOW (Sputnik) - The Russian armed forces over the past 24 hours have launched a group rocket strike against Ukrainian energy facilities working for the military-industrial complex in response to Kiev's attempts to damage Russian energy and transportation facilities, the Russian Defense Ministry said on Saturday.\nRussian forces also hit an expert center responsible for developing flight missions for Ukrainian drones, the ministry added.\n\"The Ukrainian armed forces lost up to 450 soldiers, a tank, two IFVs, nine vehicles, two 152-mm D-20 howitzers, and a 122-mm Gvozdika self-propelled artillery unit,\" the ministry stated.\n\"Ukrainian forces lost up to 240 servicepeople, a tank, an infantry fighting vehicle, six vehicles, an Osa anti-aircraft missile system and a Nota electronic warfare station,\" the ministry added.\nUkraine's armed forces lost over 120 servicepeople, an armored combat vehicle, four vehicles, and a 122 mm D-30 howitzer,\" the ministry added.", "location": "ukraine", "classification": "security", "score": 0.6938842689961708, "event_breakdown": "Russian Forces Launch Rockets at Ukrainian Military-Linked Energy Facilities - MoDSputnik News\nUkraine claims that Russian forces have lost roughly 450 soldiers, a tank, two infantry fighting vehicles, nine vehicles, and two 152-mm D-20 howitzers."}, {"id": "5b97f005-0ddc-4048-abe4-ef24c894bdaf", "title": "Israeli army investigating itself : Where do those investigations stand ? ", "date": "2024-06-03 13:00", "url": "https://naharnet.com/stories/en/305663-israeli-army-investigating-itself-where-do-those-investigations-stand", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military.", "location": "JERUSALEM", "classification": "security", "score": 0.7384466933277175, "event_breakdown": "New Israeli Military Police\nAn Israeli prison and detention facility is located at this address"}, {"id": "aeee44d4-30c7-4bec-b8a8-0df80a703640", "title": "Israeli army investigating itself : Where do those investigations stand ? ", "date": "2024-06-03 13:15", "url": "https://www.naharnet.com:443/stories/en/305663-israeli-army-investigating-itself-where-do-those-investigations-stand", "message": "Israel's military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nThe Israeli military said in a statement that the investigation had been turned over to a fact-finding group that operates independently outside the army's chain of command.\nIt also said it was \"not possible to determine with certainty\" whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael's military and police referred questions to Israel's Prison Service, which referred questions back to the military.", "location": "Israel", "classification": "security", "score": 0.7384466933277175, "event_breakdown": "New Israeli military inquiry opened into killing of Palestinian\nPalestinian detainees report beatings, neglect by Israeli captors"}, {"id": "8c784f8d-b585-45b3-8da6-8c896c73ef15", "title": "12 martyred , dozens injured in Israeli airstrikes targeting Khan Younis , Rafah", "date": "2024-06-03 14:15", "url": "https://www.gulf-times.com/article/683965/region/12-martyred-dozens-injured-in-israeli-airstrikes-targeting-khan-younis-rafah", "message": "At least 12 Palestinians, including children and women, were martyred in a series of Israeli airstrikes that targeted Khan Younis and Rafah in the southern Gaza Strip early Monday.\nTen citizens, including three children, were martyred and others were injured in an Israeli bombardment that targeted two homes in Al-Rumaydah east of Khan Younis city, the Palestinian News Agency (WAFA) reported, citing health sources.\nAdditionally, two citizens were martyred and others were injured in an Israeli bombardment that targeted a home in Khan Younis in the southern Gaza Strip.\nAn Israeli airstrike targeted the vicinity of the European Gaza Hospital near Khan Younis in the southern Gaza Strip.\nEarlier today, ten citizens were martyred in Israeli strikes on the Al-Bureij and Nuseirat refugee camps in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9821295298529836, "event_breakdown": "Israeli airstrikes on Khan Younis, Rafah in southern Gaza on 20-05-2019. Details: At least 12 Palestinians were martyred in a series of Israeli airstrikes that targeted Khan Younis and Rafah in the southern Gaza Strip early Monday."}, {"id": "0065f0b1-24d9-44ed-baf0-c81782dff28e", "title": "Russian forces down 62 Ukrainian drones , 14 HIMARS rockets", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240602-presstv01.htm", "message": "Russian forces down 62 Ukrainian drones, 14 HIMARS rocketsIran Press TVSunday, 02 June 2024 5:15 AMRussian air defense forces have downed 62 Ukrainian drones, 14 HIMARS rockets and three Hammer bombs, according to a report by the Russian Defense Ministry.\nRussian forces dealt a heavy retaliatory blow to Ukraine's power facilities as the Kiev forces had planned to strike Russian energy infrastructure, the report reads.\nThe ministry also said that Russia's Battlegroup South took up better forward-edge positions, causing Ukrainian forces to sustain roughly 660 casualties.\nRussia's Battlegroup East units seized vantage points in the past day, inflicting over 120 casualties on the Ukrainian forces.\nAlso, Ukrainian forces lost an armored combat vehicle, four cars and a 122mm D-30 howitzer, it said.", "location": "ukraine", "classification": "security", "score": 0.9287878372572342, "event_breakdown": "Russian forces down 62 Ukrainian drones, 14 HIMARS rockets\nIran Press TV"}, {"id": "28395c4b-8d80-4e8c-8ba3-b2cef92445a7", "title": "World - HITS FM", "date": "2024-06-03 11:45", "url": "https://hitsfm.net/world/28669c72d49b7fc6e538d08744553497", "message": "The crossing has been closed since Israeli forces took control of the Gaza side during their offensive toward Rafah in May.\n-ABC News' Anna BurdMay 31, 1:10 PMIsraeli forces operating in central Rafah, IDF saysThe Israeli army is now operating in central Rafah, the IDF said Friday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "RAFAH", "classification": "security", "score": 0.6181384523617831, "event_breakdown": "1. Israeli forces operating in central Rafah, IDF says\n2. IDF says Hamas compound in Rafah struck in 'significant' strike\n\nRelevant events:\n1. Israeli forces operating in central Rafah, IDF says\n2. IDF says Hamas compound in Rafah struck in 'significant' strike"}, {"id": "740b85a6-5dae-47d3-b3e9-a9aa3301faa6", "title": "Houthis Attack US Aircraft Carrier , Destroyer in Red Sea", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-sputnik04.htm", "message": "Houthis Attack US Aircraft Carrier, Destroyer in Red Sea - Military SpokesmanSputnik News20240602MOSCOW (Sputnik) - Yemen's Ansar Allah movement, also known as Houthis, attacked a US aircraft carrier, destroyer and a number of ships in the Red Sea, Houthi military spokesman Yahya Saree said.\n\"The US aircraft carrier Dwight Eisenhower was attacked in the northern Red Sea with several missiles and drones,\" Saree said, adding that a US destroyer was also attacked in the Red Sea.\nThe movement's forces struck ships in the Red Sea, the Arabian Sea and the Indian Ocean that \"belong to companies that violated the decision to ban passage to [Israeli] ports,\" the spokesman added.\nHouthis vowed in November 2023 to attack any ships associated with Israel until it halts military actions in the Gaza Strip.\nAmid the Houthi attacks, some companies suspended shipments through the Red Sea.", "location": "NULL", "classification": "security", "score": 0.5441154272929634, "event_breakdown": "Location: North Red Sea\nEvent: The Houthi movement in Yemen has attacked a US aircraft carrier and destroyer in the Red Sea in retaliation for US involvement in airstrikes in Yemen and Israeli attacks on the Gaza Strip."}, {"id": "dbabc77e-f6d4-4dab-99bc-deefb1f84407", "title": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease - fire plan", "date": "2024-06-03 10:30", "url": "https://www.mymotherlode.com/news/middle-east/3368592/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan.html", "message": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease-fire planThe Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease-fire plan View PhotoPalestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ’ to Hamas in Gaza.\nISRAELI STRIKES KILL 11 IN GAZADEIR AL-BALAH, Gaza Strip — Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9028083528864259, "event_breakdown": "Israeli strikes in central Gaza kill at least 11 people."}, {"id": "03bbefc3-cddc-4ca2-a669-3777bb218099", "title": "Israeli Strikes In Central Gaza Kill At Least 11 As The US Pushes A Cease - Fire Plan – 710am KURV", "date": "2024-06-03 14:30", "url": "https://www.kurv.com/israeli-strikes-in-central-gaza-kill-at-least-11-as-the-us-pushes-a-cease-fire-plan/", "message": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.\nCurrently:— Israeli leader Netanyahu faces growing pressure at home after Biden’s Gaza proposal— Israel seeks a ‘ governing alternative ‘ to Hamas in Gaza.\nISRAELI MILITARY REPORTS SHOOTING DOWN MISSILE OVER RED SEATEL AVIV, Israel — The Israeli military says it shot down a surface-to-surface missile fired toward southern Israel from the Red Sea.\nThe surprise attack into Israel killed some 1,200 people, mostly civilians.\nThe Israeli government says militants in Gaza are still holding around 85 hostages and the remains of 39 others.", "location": "GAZA STRIP", "classification": "security", "score": 0.915837809942066, "event_breakdown": "Target event: Israeli strikes in Gaza\nIsraeli security officials said Israeli strikes west of Rafah killed six Hamas militants and one Islamic Jihad member\nAdditional events:\nIsraeli security officials said Israel shot down a missile fired from Gaza\nIt was reported that militants in Gaza still held around 85 hostages and the remains of 39 others."}, {"id": "43ebc480-f618-48c5-aec4-2f9da5f82762", "title": "Hezbollah carries out rocket barrage against Israeli settlement", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-irna04.htm", "message": "Hezbollah carries out rocket barrage against Israeli settlementIRNA - Islamic Republic News AgencyJun 2, 2024Tehran, IRNA -- Lebanon's Hezbollah resistance movement says it has launched dozens of rockets at the Israeli settlement of Kiryat Shmona in northern occupied Palestine.\nMedia reports said on Sunday that the northern regions of occupied Palestine, especially the Galilee area, saw intense missile attacks from Hezbollah across the border from southern Lebanon.\nThe Israeli Channel 12 television network claimed that the Iron Dome system had intercepted 14 of the rockets fired towards Kiryat Shmona.\nIsraeli media have admitted that Hezbollah is only using a fraction of its military capabilities, but its operations have been highly successful and precise in hitting their targets.\nThe resistance group and Israeli forces have been exchanging fire in an almost daily basis since the occupying regime invaded the Gaza Strip in early October.", "location": "Palestine", "classification": "security", "score": 0.9698585719009757, "event_breakdown": "Hezbollah fires rockets at Israeli settlement, Kiryat Shmona."}, {"id": "bfdf9ebb-f06e-439f-a3e8-98d1b511b5cd", "title": "Israel strikes deeper in south , targets al - Rihan , car in Kawthariyat al - Rez", "date": "2024-06-03 12:45", "url": "https://www.naharnet.com/stories/en/305647-israel-strikes-deeper-in-south-targets-al-rihan-car-in-kawthariyat-al-rez", "message": "As tensions escalated on the Lebanese-Israeli border, the Israeli army shelled Alma al-Shaab and the outskirts of the southern border towns of Mhaybib and al-Naqoura.\nHezbollah, a Hamas ally, has traded regular cross-border fire with Israel since the Palestinian militant group's October 7 attack on southern Israel which triggered the war in the Gaza Strip.\nHezbollah's fighters had bombarded two army bases in the Israeli-annexed Golan Heights Sunday, after deadly Israeli strikes on south Lebanon.\nThe Israeli military said \"approximately 15 projectiles\" had been fired from Lebanon at the Golan Heights and \"fell in open areas\", causing no injuries but starting fires.\nIn response, Hezbollah said it launched several attacks on Israeli military targets and shot down an Israeli Hermes 900 drone.", "location": "Mhaybib and al-Naqoura", "classification": "security", "score": 0.9958067061561956, "event_breakdown": "The Israeli army shelled Alma al-Shaab and the outskirts of the southern border towns of Mhaybib and al-Naqoura."}, {"id": "abce1ab3-1235-4df0-a778-a5e7a55fb375", "title": "Ukraine goes dark following attacks | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-06-03 12:00", "url": "https://www.arkansasonline.com/news/2024/jun/03/ukraine-goes-dark-following-attacks/", "message": "KYIV, Ukraine -- Ukraine imposed emergency power shutdowns in most of the country Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.\nThe shutdowns were in place in all but three regions of Ukraine after Saturday's drone and missile attacks on energy targets that injured at least 19 people.\nUkraine's state-owned power grid operator Ukrenergo said the shutdowns affected industrial and household consumers.\nSustained Russian attacks on Ukraine's power grid in recent weeks have forced the government to institute nationwide rolling blackouts.\nIn Russia, six people were injured in shelling in the city of Shebekino in the Belgorod region bordering Ukraine, regional Gov.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.8302033274289292, "event_breakdown": "[\n\"2022_03_27 Russian attack on energy infrastructure\",\n\"Target: energy infrastructure, Location: Donetsk province, Ukraine\"\n]"}, {"id": "a749a6ed-4c52-408a-8797-cb8584b986b7", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 13:45", "url": "https://wmmbam.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Wildwood, Florida", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "[\n{\n\"title\": \"16-Year-Old Charged in Stabbing of 15-Year-Old During Sleepover: Authorities\",\n\"description\": \"A teenager faces several charges, including first-degree murder, after deputies say he stabbed another teenager in Sumter County, Florida.\",\n\"reference\": \"https://crimeonline.co/2022/06/02/16-year-old-charged-in-stabbing-of-15-year-old-during-sleepover/\"\n}\n]"}, {"id": "1480eed2-ab73-4b7a-a1b2-6bc87f638a21", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 13:45", "url": "https://kste.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Location: Florida\nReported on: June 3\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting. Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary."}, {"id": "f005f20b-1bf1-4237-826c-f56c06842fbd", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:00", "url": "https://newsradio1170.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "New security events reported in the text:\nLocation: Sumter County, Florida\nEvent: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover\nDate: June 3, 2022"}, {"id": "9d939d45-0fd5-4eb2-b2e6-4a8d136c16ed", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:00", "url": "https://knst.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Wildwood, Florida", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Event 1: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting.\nEvent 2: A 16-year-old named Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nEvent 3: Gill opened the door and Hernandez fought his way inside, fatally stabbing him.\nEvent 4: The adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden."}, {"id": "e87ffbdd-d5be-43e4-9a92-b8fedbf68f7b", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops | 96 . 3", "date": "2024-06-03 14:15", "url": "https://wflapanamacity.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Target Event:\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3)."}, {"id": "ba2a710e-f817-422e-9543-44af7230340c", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:15", "url": "https://klvi.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Sumter County Sheriff's Office (Florida, USA): A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3)."}, {"id": "43a48fa6-47b3-4191-bcab-55eb33ccc722", "title": "Hezbollah Targets Israeli Iron Dome Battery With UAVs Day After Downing IDF Drone", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240602-sputnik03.htm", "message": "Hezbollah Targets Israeli Iron Dome Battery With UAVs Day After Downing IDF DroneSputnik News20240602Ilya TsukanovThe Lebanese militia and political movement has downed three multi-million dollar IDF drones since February amid raging border tensions in the face of Israel's war in Gaza.\nAir raid sirens sounded over northern Israel and the Israeli-occupied Golan Heights on Sunday morning as Hezbollah drones flew across the border undetected and proceeded on to their target - an IDF Iron Dome battery.\nThe Israeli military deployed forces to the area to search for debris.\nThe fighting between Hezbollah and the IDF forced Israel to keep a substantial portion of its military in the north, and has caused hundreds of casualties on both sides.\nNearly 200,000 Lebanese and Israeli civilians have been displaced from border areas by the fighting, with at least 89 Lebanese, 10 Israeli, and 15 Syrian civilians killed to date.", "location": "Israel", "classification": "security", "score": 0.9832382531960672, "event_breakdown": "Hezbollah Target Israeli Iron Dome Battery With Drones\nAir raid sirens sounded over northern Israel and the Golan Heights on Sunday morning as Hezbollah drones flew across the border undetected and proceeded on to their target - an IDF Iron Dome battery.\nIDF Southern Command Maj. Gen. Hertzi Halevi held an emergency meeting with senior Israeli military officials  on Sunday at the headquarters of the Northern Command in Safed to discuss developments in the border region between those two states since late last month when Hezbollah attacked an IDF border patrol, killing two Israeli soldiers."}, {"id": "ebb2ac6d-a1b2-4675-8037-6f0229995de7", "title": "  Islamism is a murderous ideology that has nothing in common with our democracy  German minister declares after police officer stabbed by Afghan knife attacker loses his fight for life", "date": "2024-06-03 11:45", "url": "https://www.dailymail.co.uk/news/article-13488551/Islamism-murderous-ideology-common-democracy-German-minister-declares-police-officer-stabbed-Afghan-knife-attacker-loses-fight-life.html", "message": "Chancellor Scholz said he was 'deeply saddened' by the death of the officer.\nThe attacker has been identified as Sulaiman Ataee, 25, who immigrated to Germany from Afghanistan in 2014 when he was just 15.\nMichael Stuerzenberger, an anti-Islam campaigner who was stabbed at the rally organised by Pax Europa, described the attack as an 'absolute nightmare'.\nHe added: 'Every attack is an attack against all of us, against our free democratic state and those who ensure our security.\nThe aftermath of the stabbing is seen in the German city of MannheimDuring the attack bystanders attempted to drag the knifeman away.", "location": "Mannheim", "classification": "security", "score": 0.5903233255236678, "event_breakdown": "Event 1: A stabbing attack occurred in the city of Mannheim, Germany. The attacker was identified as Sulaiman Ataee, 25, who immigrated to Germany from Afghanistan in 2014.\n\nEvent 2: An officer was killed in the German city of Speyer after a motorist intentionally drove his vehicle into a group of police officers during a traffic stop. Chancellor Scholz said he was 'deeply saddened' by the death of the officer."}, {"id": "1cf3d027-6752-4675-88f4-5d880775507f", "title": "LIVE UPDATES : Families mourn another night of deadly attack in Gaza", "date": "2024-06-03 11:45", "url": "http://thepeninsulaqatar.com/article/03/06/2024/live-updates-families-mourn-another-night-of-deadly-attack-in-gaza", "message": "Palestinian men walk past damaged buildings after an overnight Israeli strike in al-Bureij camp in the central Gaza Strip on June 3, 2024.\n(Photo by Eyad Baba / AFP)Doha, Qatar: Fresh strikes were reported across Gaza Strip overnight as mediators urged for a truce deal.\nThe situation continues to be difficult also in the far south of the Gaza Strip.\nAn Israeli airstrike targeted the vicinity of the European Gaza Hospital near Khan Younis in the southern Gaza Strip.\nSarhan pleaded for the UN and other international organisations to “intervene immediately to deliver aid to the Gaza Strip”.", "location": "GAZA", "classification": "security", "score": 0.9797913061450849, "event_breakdown": "Fresh strikes were reported overnight in al-Bureij camp in the central Gaza Strip. An Israeli airstrike targeted the vicinity of the European Gaza Hospital near Khan Younis in the southern Gaza Strip.\nReports say that the Palestinian Islamic Jihad fired rockets towards Israeli cities."}, {"id": "5c52c2c9-b2a5-4cef-a563-7ea2694339af", "title": "Several killed by suspected Israeli strikes in Syria – Report", "date": "2024-06-03 10:30", "url": "https://punchng.com/several-killed-by-suspected-israeli-strikes-in-syria-report/", "message": "“The death toll of the Israeli strike on a factory in Hayyan in western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters,” said the Syrian Observatory for Human Rights.\nThe Britain-based Observatory, which relies on a network of sources inside Syria, had initially reported 12 dead.\nWhile Israel rarely comments on individual strikes in Syria, it has repeatedly said it will not allow arch-enemy Iran to expand its presence there.\nAccording to the Observatory, Israeli strikes on Wednesday in western and central Syria killed a girl and six fighters working with Hezbollah, including three Syrians.\nIn March, the Observatory said Israeli air strikes near Aleppo airport killed 52 people — 38 government soldiers, seven Hezbollah members and seven Syrian pro-Iran fighters.", "location": "Aleppo province in western Syria", "classification": "security", "score": 0.9284499140741114, "event_breakdown": "Israeli airstrikes in Syria"}, {"id": "d4f598cb-d73b-4890-a76a-fba80f04f55c", "title": "Israeli Aggression on Positions in Vicinity of Aleppo Claims Number of Civilian Martyrs", "date": "2024-06-03 12:45", "url": "https://english.almanar.com.lb/2124828", "message": "A number of civilians were martyred at dawn on Monday in an Israeli missile aggression that targeted a number of points in vicinity of Aleppo city.\n“At approximately 00:20 a.m. at dawn on Monday, the Israeli enemy launched an aerial attack with missiles from a direction of southeast Aleppo, targeting a number of points in the vicinity of Aleppo city, and the army air defenses intercepted the aggression’s missiles and shot down some of them.” a military source told SANA reporter.\nThe source added that the aggression led to the martyrdom a number of civilians, and some material losses to the property.\nSource: SANA", "location": "Aleppo", "classification": "security", "score": 0.8771272255437348, "event_breakdown": "New event: Israeli aggression targets vicinity of Aleppo - Monday, 01:20 a.m.\nA number of civilians were martyred in an Israeli missile aggression that targeted a number of points in vicinity of Aleppo city."}, {"id": "943fef90-ffe2-4422-b96f-02d0786080a5", "title": "الوكالة الوطنية للإعلام - Security update : One dead in enemy motorcycle strike in Naquora", "date": "2024-06-03 13:00", "url": "https://www.nna-leb.gov.lb/en/justice-law/699043/security-update-one-dead-in-enemy-s-motorcycle-str", "message": "NNA - The Israeli enemy airstrike, which targeted a motorcycle in the southern Lebanese town of Al-Naqoura earlier on Monday, resulted in one fatality and another injury.\nAdditionally, enemy artillery shelling on the eastern side of Alma Al-Shaab caused fires in the region.\n==================R.H.", "location": "given\nsouthern Lebanon", "classification": "security", "score": 0.9613847024008483, "event_breakdown": "Israeli airstrike targets motorcycle in southern Lebanon, killing one and injuring another. Enemy artillery causes fires in eastern Lebanon."}, {"id": "6b4f1224-dc91-4d3f-a1b9-6d69dc4b962a", "title": "Israeli Hermes 900 drone downed by Hezbollah missile over south Lebanon", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240601-presstv06.htm", "message": "Lebanon's al-Manar television channel, citing a brief Hezbollah statement, reported that the group targeted and downed an Israeli Hermes 900 drone with appropriate weapons over Lebanese territory on Saturday afternoon.\nIt says the Hermes 900 drone was hit by a surface-to-air missile while operating in the area.\nIt marks the fourth Israeli drone to be shot down by Hezbollah over southern Lebanon.\nIn all, two Hermes 450 drones and two Hermes 900 models have been downed in recent months.\nEarlier on Saturday, an Israeli drone targeted a motorcycle on a road in Majdel Selm village of the Marjeyoun district in southern Lebanon.", "location": "The main location where the event takes place is Lebanese territory.", "classification": "security", "score": 0.9798219978675038, "event_breakdown": "Al-Manar TV, a pro-Iran Lebanese channel, reported that the drone was hit with a surface-to-air missile while the unmanned aerial vehicle was operating in the southern Lebanese area of Marjeyoun, near the border with Israel."}, {"id": "961a20f6-01e9-4223-916e-7b6cd5765e61", "title": "Man stabbed to death by armed thugs in Nakuru , police launch probe", "date": "2024-06-03 10:00", "url": "https://www.the-star.co.ke/news/realtime/2024-06-03-man-stabbed-to-death-by-armed-thugs-in-nakuru-police-launch-probe/", "message": "Detectives are investigating the tragic death of a man who was attacked and fatally stabbed by suspected thugs in the Kaptembwo area of Nakuru.\nThe incident occurred on the night of Friday, May 31, as the man and a woman were walking home.\nThe victim was rushed to the local hospital where he succumbed to the injuries, police said.\nElsewhere, police are investigating the murder of a 33-year-old man whose body was found in his house in Kikuyu Town, Kiambu County.\nHe was rushed to a local hospital where doctors pronounced him dead.", "location": "Nakuru", "classification": "security", "score": 0.9745753707372355, "event_breakdown": "Detectives in Nakuru are probing the tragic death of a man who was attacked and fatally stabbed by suspected thugs in the Kaptembwo area on May 31.\n\nElsewhere, Kenyan police are investigating the horrible death of an unidentified man who was found murdered at his home in Kikuyu Town, Kiambu County on June 15.\n\nBoth incidents have been documented by Kenyan reporters. Their current stories have been captured and sent back to Nairobi headquarters, where they are being translated into various languages. The information is being sent out to affiliates."}, {"id": "e5bea519-a800-457d-a96b-3d10f8f75924", "title": "12 pro - regime fighters killed in Israeli strike near Syria Aleppo", "date": "2024-06-03 10:00", "url": "https://www.naharnet.com/stories/en/305648-12-pro-regime-fighters-killed-in-israeli-strike-near-syria-s-aleppo", "message": "At least 12 pro-regime fighters were killed in an overnight Israeli strike that targeted a factory near Aleppo in the north of Syria, an NGO reported early Monday.\nThe Syrian Ministry of Defense said in a statement that \"after midnight... the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions\" near the city, adding that \"the aggression caused several martyrs and material damage\".\nIsrael has carried out hundreds of strikes on its northern neighbour since the outbreak of Syria's civil war, mainly targeting army positions and Iran-backed fighters, including from the militant group Hezbollah.\nWhile it rarely comments on individual strikes in Syria, Israel has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nSyria's war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on anti-government protests.", "location": "(do not add an 's' or an 'ed')\nALEP", "classification": "security", "score": 0.9626841967750357, "event_breakdown": "Israeli airstrike kills 12 in the northern Syrian city of Aleppo. The airstrike targeted a Syrian military facility."}, {"id": "87b29d8e-9789-45e6-922e-a4612e1ec59e", "title": "Iran supreme leader Khamenei says Israel headed for  destruction  ", "date": "2024-06-03 12:30", "url": "https://92newshd.tv/about/iran-s-supreme-leader-khamenei-says-israel-headed-for-destruction", "message": "Iran's supreme leader Khamenei says Israel headed for 'destruction'TEHRAN (AFP) - Iran's supreme leader Ayatollah Ali Khamenei on Monday praised Hamas's unprecedented October 7 attack against Israel and predicted the ‘destruction’ of their common enemy.\nWhile Israel and Iran have long fought a shadow war of killings and sabotage, Iran's armed allies across the Middle East have formed a so-called \"Axis of Resistance\" alliance.\nAs the Gaza war has raged, Iran and Israel came to the brink of war in mid-April when Tehran launched a barrage of rockets and missiles at Israel, most of which were intercepted.\nIran has said it had no advance knowledged of Hamas's October 7 attack but has praised it since.\nThe Gaza war was sparked by Hamas's October 7 attack, which resulted in the deaths of 1,190 people, mostly civilians, according to an AFP tally based on Israeli official figures.", "location": "GAZA", "classification": "security", "score": 0.7086748802513572, "event_breakdown": "Israel-Palestine conflict\nRockets fired by Palestinian group Hamas from Gaza into Israel"}, {"id": "fb48edd0-0491-4c0f-a45a-f9cf98608f0d", "title": "Mob boss of gang targeted in drive - by restaurant shooting in Dalston which left girl , nine , fighting for her life was  linked to hit in Spain  weeks earlier", "date": "2024-06-03 11:45", "url": "https://www.dailymail.co.uk/news/article-13488359/Mob-boss-gang-targeted-drive-restaurant-shooting-Dalston.html", "message": "The kingpin of the gang targeted in a drive-by restaurant shooting which left a nine-year-old girl fighting for her life was linked to a hit in Spain just weeks earlier, it has emerged.\nThree men with ties to the drugs gang 'Bombacilar' - also known as the Hackney Bombers - were injured in the shooting in Dalston, north east London, on May 29.\nBut a leading gangster in Baybasin's old mob was the intended target of the Dalston shooting, sparking fears it could have been a revenge hit.\nBaybasin, who uses a wheelchair after being shot by a rival, was released from prison in Turkey in 2017.\nThe target in Dalston escaped unharmed but a stray bullet left a nine-year-old girl in a critical condition.", "location": ")\nLONDON", "classification": "security", "score": 0.9798960530439359, "event_breakdown": "Location: Dalston, London, United Kingdom\nDate: May 29, 2022\nDescription: A nine-year-old girl was left fighting for her life by a drive-by restaurant shooting targeting a Turkish drugs gang.\n\nAuthor: Jack Hardy, Crime Correspondent\nTarget Event: London Drive-By Restaurant Shooting, Dalston, United Kingdom"}, {"id": "323454f9-5de8-4e5a-8b36-5b6e55f74953", "title": "Egypt urges Israeli withdrawal from Rafah crossing amid Gaza ceasefire talks", "date": "2024-06-03 08:45", "url": "https://www.dailynewsegypt.com/2024/06/03/egypt-urges-israeli-withdrawal-from-rafah-crossing-amid-gaza-ceasefire-talks/", "message": "The tripartite Egyptian-American-Israeli meeting in Cairo concluded with Egypt maintaining its stance on the necessity of Israeli withdrawal from the Rafah crossing, according to Egyptian media reports.\nThe official Israeli Broadcasting Authority announced that an Israeli security delegation would travel to Cairo on Sunday to discuss the reopening of the Rafah border crossing, to facilitate humanitarian aid into the Gaza Strip.\nDuring these security meetings, Israeli and American officials will engage in discussions.\nIsrael has reportedly informed Egypt of its readiness to withdraw Israeli army forces from the crossing, relocating them to another position based on operational considerations.\nFurthermore, CBS News quoted an Israeli official who revealed that the War Council and Israeli Prime Minister Benjamin Netanyahu have agreed to a hostage exchange proposal.", "location": ".\nCAIRO", "classification": "security", "score": 0.807629582301831, "event_breakdown": "Israeli officials will travel to Cairo on Sunday to discuss reopening the Rafah border crossing\nIsraeli officials said that Israel is prepared to redeploy its troops from Rafah"}, {"id": "7036032e-032f-46dc-9546-a2b771918826", "title": "Israeli strikes on refugee camps in central Gaza kill at least 11", "date": "2024-06-03 14:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/03/israeli-strikes-on-refugee-camps-in-central-gaza-kill-at-least-11/", "message": "Israeli strikes have killed 11 people overnight, including a woman and three children, in central Gaza, Palestinian health officials said.\nA strike on a home in the built-up Bureij refugee camp late on Sunday killed four people, including the three children.\nThe second strike in the early hours of Monday killed seven people, including a woman, in the Nuseirat refugee camp.\nThe country launched its war in Gaza after Hamas’ October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people – mostly civilians – and abducted about 250.\nIsrael says around 100 hostages are still being held in Gaza, along with the bodies of around 30 more.", "location": ".\nGAZA STRIP", "classification": "security", "score": 0.9326330808513139, "event_breakdown": "Israeli strikes on Gaza killed 4 people overnight, including 3 children, health officials say.\nA strike on a home in central Gaza killed 8 people early Monday, including 7 people, health officials said."}, {"id": "6713f3aa-e4f7-4320-acaa-8516dc3a56c7", "title": "Price of victory : How Allied D - Day bombs killed French civilians", "date": "2024-06-03 14:30", "url": "https://www.digitaljournal.com/world/price-of-victory-how-allied-d-day-bombs-killed-french-civilians/article", "message": "Within 24 hours, 3,000 civilians had died in the firestorm unleashed by 1,500 bombers, including 700 in the town of Lisieux alone.\nThe number is comparable with the more than 4,600 Allied military personnel killed on D-Day, according to Commonwealth War Graves Commission figures.\nBut then, to the dismay of the civilians, the bomb bay doors opened over their heads and the explosives dropped.\nAt the family home, “the windows were broken, doors were unhinged and rain was falling into the house”, she recalled.\nIt was to take “several years” before Mignon and her family managed to get back to a “normal life”, she said.", "location": "LISieux", "classification": "security", "score": 0.7010231953466366, "event_breakdown": "Event 1: Massive airstrikes have caused civilian casualties and significant damage to the town of Lisieux, Normandy, France on 24 June 1944.\nEvent 2: More than 4,600 Allied military personnel were reported killed on D-Day in World War Two."}, {"id": "3726084b-b5ac-4b6d-a863-e9296e105353", "title": "Two Lebanese shepherds killed in Houla amid ongoing escalation", "date": "2024-06-03 07:45", "url": "https://www.naharnet.com/stories/en/305646-two-lebanese-shepherds-killed-in-houla-amid-ongoing-escalation", "message": "Two Lebanese shepherds were killed in an Israeli strike that hit their house in the town of Houla near the Lebanon-Israel border on Sunday, state media reported.\nAlso Sunday, the Lebanese militant group Hezbollah claimed a drone attack on an Israeli military facility in the Golan Heights.\nIt said the strike had hit a radar system for Israel's Iron Dome air defense system, as well as forces operating it.\nClashes between Israeli forces and the Lebanese militant group Hezbollah, which have taken place near-daily since October, have escalated in recent weeks.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them militants with Hezbollah and allied groups but also including more than 70 civilians.", "location": "Lebanon", "classification": "security", "score": 0.9723250121008282, "event_breakdown": "Israeli air strikes in Houla, Lebanon, killed two Lebanese shepherds on Sunday. Also Sunday, the Lebanese militant group Hezbollah claimed a drone attack on an Israeli military facility in the Golan Heights."}, {"id": "cf6b1004-264a-4a66-8231-2cecb4bc8a68", "title": "Salvation Hours Windows game", "date": "2024-06-03 09:15", "url": "https://www.moddb.com/games/salvation-hours", "message": "Salvation Hours is a Single Player - Tactical - First Person Shooter developed by Wolf Wire Studios, a one man game studio.\nThis game is based on the 2012 Benghazi Incident that involved the American Consulate, the CIA Base called the \"Annex\" and the GRS Operators posted there.\nYou step into the shoes of one of the GRS Operators, Jack Sanders, who was deployed to Benghazi GRS in early September of 2012.\n- Paradoxical95 (Founder - Wolf Wire Studios)Note : The game's combat may be difficult for some people.\nThere might be small bugs here and there, I'd request you to notify me about them in the official Discord server.", "location": "BENGHAZI", "classification": "security", "score": 0.7719964931012587, "event_breakdown": "salvation hours, salvation army, salvation army hours, current security events"}, {"id": "b65c689e-0de1-4ace-88ba-2f9d920c2706", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 00:30", "url": "https://www.vgchartz.com/article/461201/new-zealand-weekly-week-21-2024/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 991 Viewsby, posted 17 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "New Zealand", "classification": "security", "score": 0.6833633397800863, "event_breakdown": "Location: New Zealand\nPaper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts"}, {"id": "3e21316b-1a9e-41b3-9065-2e3986be6610", "title": "Remembering D - Day", "date": "2024-06-03 12:00", "url": "https://www.sunstar.com.ph/network/remembering-d-day", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive.", "location": "Normandy", "classification": "security", "score": 0.9846401791171071, "event_breakdown": "The following current events of security were reported in the text:\n- near Omaha Beach in France\n- near Arromanches in France\n- near Normandy in France"}, {"id": "5b8b484e-c964-41d7-b684-267c7bd266a2", "title": "DFL delegates condemn antisemitism , call for cease - fire in Gaza", "date": "2024-06-03 03:45", "url": "https://www.twincities.com/2024/06/02/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war/", "message": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com.\nWe may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\nChanges to an online obituary can be handled through the obituary desk.\nPayment Procedure:Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule.\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulationsEFT: Check by phone.", "location": "Saint Paul, Minnesota", "classification": "security", "score": 0.4719028832843186, "event_breakdown": "['Event 1: A security incident has been reported in [location]', 'Event 2: A news push about a security incident has been reported in [location]', 'Event 3: A security incident has been reported in [location]']"}, {"id": "cd07eca1-572d-41c1-bd71-667bc5daf639", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 09:45", "url": "https://www.local10.com/news/world/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "FILE - American soldiers and supplies arrive on the shore of the French coast of German-occupied Normandy during the Allied D-Day invasion on June 6, 1944 in World War II.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nThe Allies faced around 50,000 German forces.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.", "location": ")\nNORMANDY", "classification": "security", "score": 0.7682668184631722, "event_breakdown": "July 4, 2022: Protests erupted in the capital of Guinea, Conakry, following the military's refusal to swear in the winner of the country's presidential election.\nThere were also protests against the military government in Sudan, as the people are demanding a return to civilian rule.\nAmerican troops and military aid were sent to assist in the evacuation of civilians from the Ukrainian city of Kharkiv.\nThe Taliban seized control of over 100 districts in Afghanistan since early May, putting more pressure on the Afghan government and its US-backed military.\nAmerican troops and weapons were secretly deployed to Somalia to help the country battle al-Shabab militants.\nA terrorist attack in Karachi, Pakistan, killed at least four and wounded more than 50 people.\nIsraeli forces shelled Gaza in response to incendiary balloons launched from the Palestinian territory.\nNew clashes broke out between Armenia and Azerbaijan over the disputed Nagorno-Karabakh region.\nForces from several other countries were also involved, including French troops fighting with Gen. Charles de Gaulle.\nAuthorities in Mali detained the president and prime minister amid tensions over the government's failure to quell attacks by jihadists.\nJuly 9, 2022: Several local government buildings were set ablaze in Indian-controlled Kashmir, following the killing of a rebel commander.\nPolice in the central Nigerian state of Kaduna imposed a curfew, following the killing of a Christian student and the retaliatory murder of a Muslim herder.\nThe Kiev government claimed to have regained control of Kharkiv, taking down a Russian separatist flag at the local government building, but battles raged elsewhere in Ukraine.\nA US embassy official has issued an alert for Americans in Israel, warning of increasing rocket"}, {"id": "526a2214-580b-43b1-8e77-dd37bbd60bf8", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 06:15", "url": "https://www.kiro7.com/news/world/remembering-d-day/BEWUYZL3F5WVRICLUQVUL7U5AU/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The main event does not appear to take place at one specific location in this case.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Security forces in Mali have killed 18 militants during an operation in the northern region of Kidal. The operation was conducted in response to a recent surge in militant attacks in the area. It also comes just days after French troops withdrew from the region. The attack highlights the continued insecurity in the country and the need for international support.\n\nIn other news, a group of militants attacked a military base in northern Nigeria, killing at least four soldiers and wounding several others. The militants were armed with AK-47s and rocket-propelled grenades. The attack is the third such incident to occur in the region in recent months.\n\nIn a separate incident, gunmen attacked a hotel in the Somalian city of Kismayo, killing at least 13 people. The gunmen are believed to be members of the al-Shabaab militant group. The attack highlights the continued insecurity in the country and the need for a stronger security presence.\n\nIn more positive news, security has been increased in the Kenyan capital, Nairobi, following a series of attacks in recent months. Police have set up additional checkpoints and are conducting random searches. The increased security measures come as the country prepares to host a major international conference.\n\nFinally, a new security update has been issued for Android devices. The update fixes several vulnerabilities that allowed attackers to access sensitive information. If you have not already downloaded the update, please do so as soon as possible."}, {"id": "592977db-c721-41b7-8a0d-041f419e0f26", "title": "  He was a very , very good man : Son of D - Day medic talks about dad war legacy in Nat Geo series", "date": "2024-06-03 03:45", "url": "https://www.news24.com/life/arts-and-entertainment/tv/he-was-a-very-very-good-man-son-of-d-day-medic-talks-about-dads-war-legacy-in-nat-geo-series-20240603", "message": "For Stephen Woodson, son of World War 2 medic Waverly Woodson, telling his father's story of being part of the Battle of Normandy on 6 June 1944 was emotional but cathartic.\nStephen featured in National Geographic's (DStv 181) new series Erased: WW2's Heroes of Colour, which started airing on 26 May and ends on 16 June.", "location": "The Battle of Normandy on June 6, 1944.", "classification": "security", "score": 0.5253253331299448, "event_breakdown": "Event 1: Stephen Woodson, son of World War 2 medic Waverly Woodson, took part in National Geographic's (DStv 181) new series Erased: WW2's Heroes of Color which started airing on 26 May and ends on 16 June.\nEvent 2: Waverly Woodson was part of the Battle of Normandy on 6 June 1944."}, {"id": "898c283d-ce18-47ce-90c4-707d773edb50", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 08:15", "url": "https://www.kob.com/news/us-and-world-news/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive.", "location": "Normandy, France", "classification": "security", "score": 0.9846401791171071, "event_breakdown": "Current events of security reported in text that can be placed on a map include the Allied troops landing in Normandy on June 6, 1944 and the casualties suffered during the battle, including 4,414 Allied troops killed and 73,000 Allied forces wounded. The exact German casualties during the D-Day invasion aren't known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing. It’s unclear how many D-Day veterans are still alive."}, {"id": "7440af0a-34dd-4f27-9875-f457c1281a51", "title": "Israel army  stretched  as fighting rages on multiple fronts", "date": "2024-06-03 14:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-army-stretched-fighting-rages-multiple-fronts", "message": "Israel also has as many as 26,000 reservists currently mobilised in active combat roles, with most of them deployed in the West Bank, the account's owner said.\nThe Israeli army declined to comment on the specific numbers of its forces.\n- 'Brewing crisis' -With its forces distracted on other fronts, analysts say the military faces a brewing crisis in the West Bank, which Israel has occupied since 1967.\nBut we risk losing sight of a potentially brewing crisis in the West Bank,\" said Dajani of ICG.\nThe army provides protection to about 490,000 Israelis who live across the West Bank in settlements that are considered illegal under international law.", "location": "West Bank", "classification": "security", "score": 0.8060393907653866, "event_breakdown": "{\n\"Israel Forces Reservists Mobilized\": {\n\"description\": \"Situation assessment required\"\n}\n}"}, {"id": "9340b620-ab4e-446f-bf11-3658e1470edb", "title": "Who Killed the British Army ? ", "date": "2024-06-03 11:45", "url": "https://www.americanthinker.com/articles/2024/06/who_killed_the_british_army.html", "message": "In the omnipresent murky world of public-private 'consultancy' there exists a British firm called 'Capita' what is known as 'consultancy.'\nLarge swathes of British and Irish institutions 'outsource' the jobs that they should be providing themselves, to companies like 'Capita.'\nIn 2000 the British army numbered 110,000.\nShakespeare wrote of the Battle of Agincourt in 1415, where the English, outnumbered by the French, hungry and decimated, defeated a French army.\nNo more rallying calls from Henry V, no poppies blowing in the red-blood skies of the Somme.", "location": "Agincourt", "classification": "security", "score": 0.5550423812471769, "event_breakdown": "It looks like there are no current events of security reported in the provided text. The text discusses a British company called 'Capita' and the practice of outsourcing public services, as well as historical references to the Battle of Agincourt. However, it does not specifically mention any current events or news related to security."}, {"id": "c6e8162d-7c08-40ca-94b1-5a830b8d8195", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem", "date": "2024-06-03 08:15", "url": "https://www.startribune.com/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem/600370546/", "message": "TOKYO — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan's Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan's military.", "location": "JAPAN", "classification": "security", "score": 0.4807755955711912, "event_breakdown": "Emergency Landings\nIn two separate incidents, two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday. The first fighter plane developed a mechanical issue while on a training flight from Misawa Air Base, and the second went down after the radar system on the second plane failed. Both jets landed safely. The incident did not result in any injuries or damage."}, {"id": "4b093934-0f1c-456b-9fc3-99c8c2d6fbec", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem", "date": "2024-06-03 09:30", "url": "https://japantoday.com/category/national/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem-1", "message": "Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan's Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan's military.", "location": "JAPAN", "classification": "security", "score": 0.4807755955711912, "event_breakdown": "Japan's Air Self Defense Force declined to provide details, including the cause of the emergency landing."}, {"id": "c2e7ce10-65d8-4753-914d-cea16dcf5af1", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 12:00", "url": "https://www.news-herald.com/2024/06/03/remembering-d-day-key-facts-and-figures-about-the-invasion-that-changed-the-course-of-world-war-ii/", "message": "WHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt’s unclear how many D-Day veterans are still alive.", "location": "Normandy, France", "classification": "security", "score": 0.9846401791171071, "event_breakdown": "The D-Day invasion was a massive military effort during World War II.\nThe invasion, also known as Operation Overlord, was the largest amphibious invasion in history and involved nearly 160,000 Allied troops landing on the coast of Normandy, France on June 6, 1944.\nOn D-Day alone, 4,414 Allied troops were killed in combat, including 2,501 Americans.\nThe Battle of Normandy that followed saw the deaths of 73,000 Allied forces and 153,000 wounded.\nThe Germans suffered heavy casualties as well, with some estimates ranging from 4,000 to 9,000 men killed, wounded or missing during the D-Day invasion alone.\nThe exact number of D-Day veterans who are still alive today isn’t clear.\nThe invasion marked a turning point in the war and saw the liberation of France and Western Europe from Nazi control."}, {"id": "a8922afa-37c3-4e8f-a3dd-cf188df44371", "title": "Iraq Kataib Hezbollah vows resolute support for Yemen after US - British aggression", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240601-presstv04.htm", "message": "Iraq's Kata'ib Hezbollah vows resolute support for Yemen after US-British aggressionIran Press TVSaturday, 01 June 2024 4:02 PMIraq's anti-terror group Kata'ib Hezbollah has assured Yemeni people and fellow Ansarullah resistance movement that it will continue to give its unwavering support for the Arab nation in the struggle against the US-British maritime coalition.\n\"The latest US-British aggression against the Yemeni nation came in light of the arrogant powers' disappointment at breaking the maritime blockade of Israel [in the Red Sea and the Arab Sea].\nWe will not hesitate to give unwavering support to our Yemeni brethren in the battle between the truth and falsehood,\" Kata'ib Hezbollah pointed out.\nThe Yemeni Armed Forces have staged numerous pro-Palestinian strikes since October 7, when the Israeli regime began the Gaza war.\nThe US has been the main supporter of Israel, providing it with munitions and political support in its brutal war on Gaza.", "location": "MUKALLA, Yemen", "classification": "security", "score": 0.65045571779308, "event_breakdown": "Place all events in a list\nUS-British aggression in Red Sea off Yemen coast"}, {"id": "46ccee5f-4391-4b14-9f30-fdb6803e977d", "title": "Taiwan Air Force to upgrade C - 130s starting 2025 : Source", "date": "2024-06-03 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240602-cna01.htm", "message": "Taiwan Air Force to upgrade C-130s starting 2025: SourceROC Central News Agency06/02/2024 03:56 PMTaipei, June 2 (CNA) Taiwan's Air Force is planning to spend billions of Taiwan dollars to upgrade its existing C-130 military transport aircraft fleet starting next year to enhance its collision avoidance and sea rescue capabilities among other systems, a source familiar with the matter told CNA Sunday.\nThe planned overhaul of the Air Force's existing 20 C-130s is scheduled to take place from 2025 to 2030.\nTaiwan's Air Force first bought 20 C-130Hs and another C-130HE, a modified electronic warfare aircraft, from the United States in the early 1980s.\nThe force lost one of its 20 C-130H, serial number 1310, in a 1997 crash at Taipei Songshan Airport.\nThe Air Force C-130 fleet currently has a total of 20 such models that serve as the main transporter aircraft for the nation's armed forces.", "location": ")\nNULL", "classification": "security", "score": 0.5383764573089916, "event_breakdown": "New Taiwan Bill: Taiwan's Air Force is planning to spend billions of Taiwan dollars to upgrade its existing C-130 military transport aircraft fleet starting next year to enhance its collision avoidance and sea rescue capabilities among other systems, a source familiar with the matter told CNA Sunday.\nThe planned overhaul is scheduled to take place from 2025 to 2030 and will be conducted by Aerospace Industrial Development Corporation and AIDC."}, {"id": "6d89bec2-742d-43e3-8551-92b763e24867", "title": "Doubts grow over Gaza truce plan as Israel - Hamas battles rage", "date": "2024-06-03 13:15", "url": "https://www.naharnet.com:443/stories/en/305649-doubts-grow-over-gaza-truce-plan-as-israel-hamas-battles-rage", "message": "But for now, the bombardments and combat showed no sign of easing in the Gaza war soon entering its ninth month that has devastated the Palestinian coastal territory of 2.4 million people.\nOn Monday the Israeli military said that over the past day its forces had struck \"over 50 targets in the Gaza Strip\".\nMilitants also took about 250 hostages, 120 of whom remain in Gaza, including 37 the army says are dead.\nIsrael's retaliatory bombardments and ground offensive have killed at least 36,439 people in Gaza, mostly civilians, the Hamas-run territory's health ministry said on Sunday.\nCairo refuses to coordinate with Israel humanitarian deliveries through Rafah, but has agreed to send some aid via Israel's Kerem Shalom crossing.", "location": ".\nGAZA", "classification": "security", "score": 0.796506194303699, "event_breakdown": "Gaza, Israel"}, {"id": "43420674-1487-4e23-b907-c95cda1e7aab", "title": "Grimsby bridge crucial role in the D - Day landings being commemorated 80 years on", "date": "2024-06-03 04:30", "url": "https://www.grimsbytelegraph.co.uk/news/grimsby-news/grimsby-bridges-crucial-role-d-9318586", "message": "Invalid email Something went wrong, please try again later.\nSomething went wrong, please try again later.\nA Grimsby bridge played a crucial role in the D-Day landings in Normandy 80 years ago to liberate Europe from the Nazis.\nArmed Forces Champion for North East Lincolnshire, Alex Baxter, said the bridge in Grimsby served as an important preparation for D-Day.\nHe said organisers also hope to broadcast the first radio bulletin confirming the D-Day invasion had started successfully on June 6, 1944, led by General Eisenhower and General Montgomery.", "location": "Grimsby", "classification": "security", "score": 0.4746583551298355, "event_breakdown": "Event 1: Armed Forces Champion for North East Lincolnshire, Alex Baxter, reveals the importance of a bridge in Grimsby as crucial in the D-Day landings in Normandy 80 years ago."}, {"id": "41599efc-eef4-4f45-b2ef-474d5a649a33", "title": "Syrian Sources Say Iranian Affiliated Militia Members Killed in Israeli Strike - Israel News", "date": "2024-06-03 18:15", "url": "https://www.haaretz.com/israel-news/2024-06-03/ty-article/syrian-sources-say-iranian-affiliated-militia-members-killed-in-israeli-strike/0000018f-de70-d9db-ad9f-fffed6df0000", "message": "16 pro-Iranian militants were killed in an Israeli-attributed airstrike in northern Syria, according to reports by the Syrian Center for Human Rights.\nThe target of the strike, according to the reports, was a copper factory and Iranian-linked weapons warehouse.\nThe Syrian army confirmed details early on Monday regarding the Israeli-attributed strike.\nAccording to the Syrian Arab News Agency, the attack, which happened not long after midnight, hit several compounds, causing casualties and damage.\nLast week, the Syrian news agency reported that one girl was killed, and ten others wounded, in an alleged Israeli strike on a residential area in the city of Baniyas in the country's west.", "location": "SYRIA", "classification": "security", "score": 0.8654097198493467, "event_breakdown": "Pro-Iranian Militants Killed in Israeli Airstrike in Syria's Northwestern Region\nSyrian state-run news reported on an alleged Israeli strike against some compounds in a northwestern area, which was blamed on an area army, wounding a number of civilians."}, {"id": "4800de90-d87a-401a-b525-6682c436a57b", "title": "Georgian Parliamentary Speaker Signs Controversial  Foreign Agent  Bill Into Law", "date": "2024-06-03 08:00", "url": "https://www.rferl.org/a/georgia-parliament-signs-foreign-agent-law/32976772.html", "message": "TBILISI -- Georgia's divisive \"foreign agent\" piece of legislation has become law despite weeks of mass protests and warnings from the United States and the European Union that the move jeopardizes the Caucasus country's path toward North-Atlantic integration.\nThe law was published in Georgia's Legislative Gazette on June 3 shortly after being signed by parliamentary speaker Shalva Papuashvil.\nGeorgian Dream has insisted it remains committed to joining Western institutions and the law was only meant to increase transparency on NGO funding.\nThe previous day, Georgia's opposition United National Movement said its offices in Tbilisi were attacked overnight by dozens of masked men, with glass broken and equipment damaged.\nIt alleged that the damage was inflicted by 30-40 \"titushky,\" a term for the frequently masked thugs who have beaten and harassed protesters since Georgian Dream announced in March that it was reintroducing the bill.", "location": "TBILISI", "classification": "security", "score": 0.5852747425529702, "event_breakdown": "Target event: New security measures implemented\nTBILISI, GEORGIA: Georgia's ruling party, Georgian Dream, passed a sweeping law on June 4 requiring hundreds of nongovernmental organizations, media outlets, and individual activists, many of them critical of the government, to register as \"foreign agents.\" The law's passage shocked Tbilisi's political establishment and pro-democracy activists just one year after tens of thousands joined similar protests and forced the government to step back from a first version of the foreign agents legislation."}, {"id": "33a7f7e8-a83b-42df-8f18-45ab64589dec", "title": "Serbia Ruling Party Wins Local Polls Marred By Irregularities", "date": "2024-06-03 08:00", "url": "https://www.rferl.org/a/belgrade-local-election-vucic/32976739.html", "message": "BELGRADE -- Serbia's ruling Serbian Progressive Party (SNS) has declared victory in a repeat local election in the capital, Belgrade, and elsewhere in the country amid voter apathy, incidents, and claims of irregularities reported by the opposition and international monitors.\nThe opposition also complained of irregularities in Serbia's June 2 vote, leaving the political environment tense in the Balkan nation of 7.1 million people.\nIn the capital turnout was 46.5 percent and 49.3 percent in Novi Sad, according to the Center for Free Elections and Democracy and IPSOS.\nPolice in the northwestern Serbian city of Novi Sad claimed some officers had been attacked, although law enforcement officials added that \"there have been no serious incidents.\"\nAn amendment to Serbia's local-election laws allowed for the voting in Belgrade to coincide with previously scheduled elections in Novi Sad, Nis, and other cities and municipalities.", "location": "Belgrade", "classification": "security", "score": 0.5918433501639798, "event_breakdown": "Belgrade\nNovi Sad"}, {"id": "aaf6f130-d7e5-4c97-b026-30d38876825b", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 18:15", "url": "https://www.nydailynews.com/2024/06/03/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael’s military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military.", "location": "NULL", "classification": "security", "score": 0.8148847063046952, "event_breakdown": "Israel's military says it is investigating about 70 cases of misconduct, and a Palestinian detainee reportedly says he was beaten by Israeli prison guards."}, {"id": "01b40855-9e8c-4016-9555-a5cb34ce764a", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 17:45", "url": "https://www.baltimoresun.com/2024/06/03/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael’s military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military.", "location": "NULL", "classification": "security", "score": 0.8148847063046952, "event_breakdown": "1. Israel is investigating about 70 cases of alleged wrongdoing by the military in the West Bank and the Gaza Strip.\n2. The military also said it was “not possible to determine with certainty” whether a man was killed by Israeli fire during clashes between Palestinians and Israeli soldiers in the West Bank.\n3. Palestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody."}, {"id": "80991d4f-b1a8-4de1-a097-d4668ed69dc8", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 16:30", "url": "https://www.dailylocal.com/2024/06/03/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael’s military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military.", "location": "TEL AVIV", "classification": "security", "score": 0.8148847063046952, "event_breakdown": "New event: Israel's military said it is investigating about 70 cases of alleged wrongdoing in the occu\n19/05/22;\nNew event: Palestinian detainees who have returned from Israel have reported harsh interrogations and neglect while in Israeli custody."}, {"id": "d5ed4301-6696-421e-8d62-6db4c2e64932", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 18:00", "url": "https://www.chicoer.com/2024/06/03/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/", "message": "Israel’s military advocate general, Maj. Gen. Yifat Tomer-Yerushalmi, said this past week that the military is investigating about 70 cases of alleged wrongdoing.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nIsrael’s military and police did not respond to requests for comment.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.\nIsrael’s military and police referred questions to Israel’s Prison Service, which referred questions back to the military.", "location": "West Bank.", "classification": "security", "score": 0.8148847063046952, "event_breakdown": "New event: Israel said is investigating about 70 cases of alleged wrong doing."}, {"id": "60d8b2d8-9455-48e5-b0a2-a93fee426133", "title": "The Israeli army says it investigates itself . Where do those investigations stand ? ", "date": "2024-06-03 19:30", "url": "https://www.pasadenastarnews.com/2024/06/03/the-israeli-army-says-it-investigates-itself-where-do-those-investigations-stand/", "message": "The military refused to disclose the full list of investigations and told The Associated Press it could only respond to queries about specific probes.\nOfficials in Gaza quickly said an Israeli airstrike had hit the hospital, killing at least 500 people.\nThe army said it conducted an in-depth investigation and found the tank did not fire at the men.\nIt also said it was “not possible to determine with certainty” whether the man was killed by Israeli fire.\nPalestinian detainees who have returned from Israeli detention have reported beatings, harsh interrogations and neglect while in Israeli custody.", "location": "GAZA", "classification": "security", "score": 0.9324401527675197, "event_breakdown": "Israeli airstrike hits hospital, killing at least 500 people\nThe Israeli military conducted an in-depth investigation into the incident and found that the tank did not fire at the men\nPalestinian detainees have reported beatings, harsh interrogations and neglect while in Israeli custody"}, {"id": "356c881d-1ac5-4836-abaf-646455896b99", "title": "IDF Continues Its Strikes on Hamas Terrorists , Finds Dead Hostage", "date": "2024-06-03 15:00", "url": "https://www.newsmax.com/world/globaltalk/israel-war-hamas/2024/06/03/id/1167210/", "message": "Earlier Monday, the Israeli military said the body of a man presumed to be a hostage was found in a community near the Gaza border that Hamas terrorists attacked Oct. 7.\nIsrael launched its war in Gaza after Hamas' Oct. 7 attack, in which terrorists stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nIran's Supreme Leader Ayatollah Ali Khamenei Monday said Israel is melting down due to its war against Hamas in Gaza.\nIDF Shoots Down Missile From Red SeaThe Israeli military says it shot down a surface-to-surface missile fired toward southern Israel from the Red Sea.\nIDF Finds Remains of HostageThe Israeli military says the body of a presumed hostage was found in a community near the Gaza border that Hamas militants had attacked on Oct. 7.", "location": "Gaza", "classification": "security", "score": 0.9199319359490162, "event_breakdown": "IDF Shoots Down Missile From Red Sea\nIsraeli military says it shot down a surface-to-surface missile aimed at southern Israel from the Red Sea"}, {"id": "65a6d460-2cc1-4965-bf59-c8f1c072c382", "title": "Radio Station WHMI 93 . 5 FM Livingston County Michigan News , Weather , Traffic , Sports , School Updates , and the Best Classic Hit", "date": "2024-06-03 18:00", "url": "https://www.whmi.com/news/national/israel-gaza-live-updates-netanyahu-releases-1st-public-statement-biden-speech", "message": "The crossing has been closed since Israeli forces took control of the Gaza side during their offensive toward Rafah in May.\n-ABC News' Anna BurdMay 31, 1:10 PMIsraeli forces operating in central Rafah, IDF saysThe Israeli army is now operating in central Rafah, the IDF said Friday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "RAFAH", "classification": "security", "score": 0.6181384523617831, "event_breakdown": "1. Israeli forces control Gaza side of Rafah crossing, which has been closed since May 31, 2021.2. Israel is now operating in central Rafah, according to IDF on May 31, 2021.3. ABC News did not confirm if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike, and have not confirmed if the strike on Rafah killed a senior Hamas commander.4. Rafah strike on May 26, 2021, left a man eating cold noodles next to his daughter's body while cocaine was still on the floor, according to a man speaking to a reporter."}, {"id": "c47bacc6-2c30-4967-aee9-7e90a52a2bf7", "title": "Palestinian sisters cry out for missing mother after Gaza airstrike", "date": "2024-06-03 18:15", "url": "https://tribune.com.pk/story/2469611/palestinian-sisters-cry-out-for-missing-mother-after-gaza-airstrike", "message": "Palestinian sisters Samar and Sahar grieve as they search for their missing mother Amira Al-Breim at the rubble of a house hit in an Israeli strike, in Khan Younis in the southern Gaza Strip, June 3, 2024.PHOTO:REUTERSAfter another airstrike pulverised Gaza, the two al-Breim sisters realised their mother Amira was missing and rushed to the scene, crying out her name and frantically sifting through rubble for any sign of her.\nA dream,\" sobbed Samar al-Breim amid piles of collapsed concrete and twisted cables.\nChildren were also sleeping at the site of the airstrike in Khan Younis in southern Gaza, she said.\n\"My mother is stuck underneath here,\" she added, gesturing to the mounds of rubble.\nSamar al-Breim clutched at a few random items amid the mounds of rubble.", "location": "GAZA", "classification": "security", "score": 0.9058909415245534, "event_breakdown": "Current events of security reported in text that can be placed on a map (ie, have a specific location) include:\n\n1. Gaza: Israeli airstrike pulverizes area near site of bombed home, Israeli forces target Gaza in airstrikes in response to incendiary balloon fire"}, {"id": "dede265d-8fa3-40bb-81dc-9878c0875fdb", "title": "IDF Arrow Defense System Intercepts Missile Fired Over Red Sea", "date": "2024-06-03 15:00", "url": "https://www.newsmax.com/world/globaltalk/idf-arrow-defense/2024/06/03/id/1167220/", "message": "The IDF's Arrow defense system on Monday intercepted a surface-to-surface ballistic missile heading toward Israel from the direction of the Red Sea.\nThe missile, reportedly fired by Iran-backed Houthis in Yemen, targeted Eilat.\nThe Houthis have repeatedly launched ballistic missiles and drones at southern Israel since Hamas' Oct. 7 massacre.\nLast week, an IAF fighter jet and aerial defense systems downed two drones fired \"from the east\" toward Eilat.\nThe group has claimed dozens of drone attacks on Israel since Hamas started the war on Oct. 7.", "location": "Eilat", "classification": "security", "score": 0.7152636059495111, "event_breakdown": "Missile intercepted by IDF's Arrow defense system Monday; Houthis fired ballistic missile at southern Israel from direction of Red Sea; IDF downed 2 drones fired toward Eilat last week."}, {"id": "542e745f-b88e-4afd-92cd-53b570f08828", "title": "Cleared for publication : ISA foils Hamas suicide bombing plot", "date": "2024-06-03 15:45", "url": "https://www.israelnationalnews.com/news/391010", "message": "Israeli forces arrested the terrorist Anas Shurman from Tulkarm approximately two and a half months ago after he was suspected of being involved in planning a bombing attack in Israel.\nIn the ISA investigation, a powerful shrapnel charge weighing 12 kg was located, which was hidden near a spring in the Samaria region.\nThe terrorist infrastructure of Hamas Turkey Photo: ShabakLater, several Hamas terrorists in the West Bank were arrested for ISA interrogation, who were part of a Hamas military network in Nablus.\nThe found explosive device Photo: ShabakThe investigation reveals the establishment of the Hamas command in Turkey and its involvement in directing bombing attacks within Israeli territories.\nIt also presents Hamas's attempts to escalate and destabilize the area during the last Ramadan month.", "location": "The main event is in Turkey, where the Hamas command is located.", "classification": "security", "score": 0.9897817607119751, "event_breakdown": "Security Event:\nIsraeli forces arrested the terrorist Anas Shurman from Tulkarm approximately two and a half months ago after he was suspected of being involved in planning a bombing attack in Israel."}, {"id": "d96754a8-ed7b-48a9-a1a7-8ef27d1bae47", "title": "Cleared for publication : ISA foils Hamas suicide bombing plot", "date": "2024-06-03 18:00", "url": "http://www.israelnationalnews.com/news/391010", "message": "Israeli forces arrested the terrorist Anas Shurman from Tulkarm approximately two and a half months ago after he was suspected of being involved in planning a bombing attack in Israel.\nIn the ISA investigation, a powerful shrapnel charge weighing 12 kg was located, which was hidden near a spring in the Samaria region.\nThe terrorist infrastructure of Hamas Turkey Photo: ShabakLater, several Hamas terrorists in the West Bank were arrested for ISA interrogation, who were part of a Hamas military network in Nablus.\nThe found explosive device Photo: ShabakThe investigation reveals the establishment of the Hamas command in Turkey and its involvement in directing bombing attacks within Israeli territories.\nIt also presents Hamas's attempts to escalate and destabilize the area during the last Ramadan month.", "location": "Nablus", "classification": "security", "score": 0.9897817607119751, "event_breakdown": "Security Event 1: Israeli forces arrest Anas Shurman from Tulkarm for planning bombing attack in Israel.\nSecurity Event 2: ISA locates hidden shrapnel charge near spring in Samaria region.\nSecurity Event 3: Hamas terrorists arrested in Nablus part of Hamas military network.\nSecurity Event 4: Hamas command established in Turkey directing bombing attacks in Israel.\nSecurity Event 5: Hamas attempts to escalate and destabilize area during last Ramadan month."}, {"id": "88417c15-5d08-4021-8f42-b9a2c57eeea3", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 16:15", "url": "https://600kcol.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Location: Florida, USA\nEvent: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting.\nReported by: Sumter County Undersheriff Pat Breeden on the department's Facebook page on Sunday (June 3).\nSummary: Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary. The victim was identified as Christopher Gill."}, {"id": "d7dccd1c-9939-4585-afa0-6660d3744c41", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 14:30", "url": "https://realradio.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Event: 16-year-old arrested for fatally stabbing 15-year-old during a sleepover\nLocation: Lake Panasoffkee, Sumter County, Florida\nDate: June 3, 2023"}, {"id": "fadb6a23-d941-43e0-8e2c-f2786d0819b1", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 17:30", "url": "https://970kfbx.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "[\n\"Security event: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, authorities announced on the department's Facebook page.\",\n\"Security event: Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\",\n\"Security event: The adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to authorities.\"\n]"}, {"id": "cabf4295-0896-43ac-a1c0-69955426e40c", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 15:45", "url": "https://wspd.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Wildwood, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Target Event:\n1. A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting."}, {"id": "5976cec8-0245-4476-a5c6-a3da52b9854c", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 17:15", "url": "https://wilm.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "[\nThe event happened at the 5956 County Road 526 Oxford, FL 34484, United States.\nThe target event is:\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nThe event can be formatted as a short report:\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3)."}, {"id": "84c61e67-9ab5-4e63-b945-96f30cc99888", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 17:15", "url": "https://800wvhu.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "The main event takes place at the following location: Florida, Sumter County", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Location: Florida\nReported in text:\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting."}, {"id": "47e1cb01-775a-4d5d-8d3b-0139dc241734", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 15:00", "url": "https://hallelujah955.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Sumter County, Florida", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "[\n{\n\"report\": \"A 16-year-old forced his way into a Florida home and killed a 15-year-old who was hosting a sleepover. The attacker, Alexander Hernandez, was charged with first-degree murder and other offenses.\",\n\"location\": \"Florida\"\n}\n]"}, {"id": "5044ff32-c159-4ea9-96c3-22126a6012d1", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 15:00", "url": "https://patriotla.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "[\n{\n\"title\": \"Florida Teen Charged in Stabbing Death of 15-Year-Old During Sleepover\",\n\"description\": \"A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary. \\nGill opened the door and Hernandez fought his way inside, fatally stabbing him. \\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden. \\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.\",\n\"link\": \"https://abcnews.go.com/US/florida-teen-charged-stabbing-death-15-year-home-invasion-murder/story?id=63833251\"\n}\n]"}, {"id": "5ceedb33-329b-4805-8c66-d17e57d8cfce", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops | Newsradio WOOD 1300 and 106 . 9 FM", "date": "2024-06-03 15:00", "url": "https://woodradio.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Target Event: Teen Stabbed Host During Sleepover\nEvent: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting on June 3, 2018. The attacker, Alexander Hernandez, was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary. The adult victim was airlifted and reported in ICU but in stable condition. The victim, Michael Gilt, was a homeschooler and the hospital is asking for blood donations."}, {"id": "6fcdab4d-39f4-4bd9-b80b-481683b65652", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops | Talk Radio 105 . 9", "date": "2024-06-03 17:45", "url": "https://knrs.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Target Event:\nA 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page on Sunday. The adult victim who was also stabbed was airlifted to ICU, but now in stable condition."}, {"id": "1864e485-7e64-4030-8298-8489e610fb61", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 17:45", "url": "https://wjdx.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Chiefland (Florida)", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Location: La Belle, Florida, USA\nEvent: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting."}, {"id": "dda16c48-9bcc-4584-8f5d-0f05f20526fd", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 17:45", "url": "https://jetradio1400.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/?pname=www.jetradio1400.com&sc=dnsredirect", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Target event:\nOn June 3, 2018, a 16-year-old forcibly entered a Florida home and stabbed a 15-year-old to death."}, {"id": "ee3779a1-83a1-40d3-8ee5-f3411e7b1a4a", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 18:00", "url": "https://khvhradio.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Party at high school leads to 5 gunshot victims"}, {"id": "65ec5fc3-cdbe-4c0a-a389-c163ce7fb7d1", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops", "date": "2024-06-03 18:00", "url": "https://newstalk1090.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Bushnell, Florida.", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Event 1: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nEvent 2: Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nEvent 3: Gill opened the door and Hernandez fought his way inside, fatally stabbing him.\nEvent 4: The adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden."}, {"id": "4ee6d5d6-1e4d-4195-bb1d-054c8908d8b0", "title": "Teen Forces Way Into Home , Fatally Stabs 15 - Year - Old During Sleepover : Cops | NewsTalk WMEQ", "date": "2024-06-03 18:15", "url": "https://wmeq.iheart.com/content/2024-06-03-teen-forces-way-into-home-fatally-stabs-15-year-old-during-sleepover-cops/", "message": "A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nAlexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nGill opened the door and Hernandez fought his way inside, fatally stabbing him.\nThe adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden.\nBoth Hernandez and the victim were homeschooled, however, it's unclear whether they knew each other prior to the incident.", "location": "Wildwood, Florida", "classification": "security", "score": 0.6154045703816351, "event_breakdown": "Event 1: A 16-year-old forced his way into a Florida home and fatally stabbed a 15-year-old during a sleepover the victim was hosting, Sumter County Undersheriff Pat Breeden announced on the department's Facebook page Sunday (June 3).\nEvent 2: Alexander Hernandez was charged with premeditated first-degree murder, aggravated assault with a deadly weapon without intent to kill and armed burglary.\nEvent 3: Gill opened the door and Hernandez fought his way inside, fatally stabbing him.\nEvent 4: The adult victim, who was also airlifted, was reported to still be in ICU but in stable condition, according to Breeden."}, {"id": "6b3d3323-3b1e-4e14-887b-4bc4de28864c", "title": "Durban woman murdered in alleged Islamophobic attack – The Mail & Guardian", "date": "2024-06-03 17:45", "url": "https://mg.co.za/news/2024-06-03-durban-woman-murdered-in-alleged-islamophobic-attack/", "message": "South Africa’s Jewish and Muslim communities have condemned the killing of Halima Hoosen-Preston and the knife assault on her family at their home in Durban, in what appears to be an Islamophobic attack.\nThe man, who is believed to be the son of a prominent South African businessman, also allegedly threatened to rape her 10-year-old daughter.\nA woman was lying on the floor bleeding, so were two men who also had stab wounds.\nImmediately more ambulances and advanced life support paramedics were dispatched to assist,” Jamieson said.\nSouth African Jewish Board of Deputies president Karen Milner said the board was “outraged” by the killing of Hoosen-Preston and the attack on her family.", "location": "Durban", "classification": "security", "score": 0.6915691116515374, "event_breakdown": "Target event: Killing of Hoosen-Preston and attack on her family\nWoman killed, family stabbed in Durban attack\nOutrage in South Africa after woman killed, family injured in apparent Islamophobic attack"}, {"id": "2979e7b7-7f36-4b64-af21-6f6180e29a7f", "title": "Greensboro man gets prison time for stabbing a woman", "date": "2024-06-03 19:15", "url": "https://journalnow.com/news/local/crime-courts/greensboro-man-pleads-guilty-to-being-hired-to-kill-another-mans-mother-men-were-17/article_7ae4054e-21d1-11ef-ab49-e73f8abb4659.html", "message": "A Greensboro man has pleaded guilty to charges that he was hired in 2021 to kill another man's mother, court records show.\nJacobs also pleaded guilty to robbery with a dangerous weapon and larceny of a motor vehicle, the records said.\nSearch warrants alleged that Griffin and Jacobs, who were 17 at the time, communicated with each other by cellphone about plans to kill Garcia-Santiago.\nJacobs was accused of attempting to kill Garcia-Santiago, restraining her without her consent, threatening Garcia-Santiago with a knife and seriously injuring her, according to court records.\nThen the other man, whom police later identified as Jacobs, stabbed her again, search warrants alleged.", "location": "Greensboro.", "classification": "security", "score": 0.531110074125664, "event_breakdown": "Griffin's attorney, William F. Mason Jr., declined to comment on the case."}, {"id": "6b51f789-e182-4d8f-8bd2-6c9f953b4210", "title": "Gunmen launch attack at Trinidad main hospital", "date": "2024-06-03 17:15", "url": "https://jamaica-gleaner.com/article/caribbean/20240603/gunmen-launch-attack-trinidads-main-hospital", "message": "PORT OF SPAIN, Trinidad, CMC -Police are searching for gunmen who launched an attack at the Accident and Emergency (A&E) Ward of the Port of Spain General Hospital, where a man was being treated for gunshot wounds on Sunday night.\nThe attack on the A&E left staff and patients scampering for safety and police believe that the gunmen were linked to the earlier attack in Gonzales, where three men were discovered suffering from gunshot wounds.\nBut as the other injured persons were being taken to the hospital, by paramedics and police, they were apparently followed by the gunmen who opened fire on reaching the hospital.\nThe media reports said three people died in the Gonzales shooting, identifying them as Johnathon Arjoon, Jaydon Reyes, and Kevin King.\nSend us a message on WhatsApp at 1-876-499-0169 or email us at onlinefeedback@gleanerjm.com or editors@gleanerjm.com.", "location": "Port of Spain, Trinidad.", "classification": "security", "score": 0.9475765338770615, "event_breakdown": "In light of these shootings can you please process these files as major incident and create a card for jamaica please"}, {"id": "46d4ca4b-7d34-4fb6-b4d1-31fd5251a1e8", "title": "الوكالة الوطنية للإعلام - Security update : One dead in enemy motorcycle strike in Naquora", "date": "2024-06-03 13:00", "url": "https://www.nna-leb.gov.lb/en/security-law/699043/security-update-one-dead-in-enemy-s-motorcycle-str", "message": "NNA - The Israeli enemy airstrike, which targeted a motorcycle in the southern Lebanese town of Al-Naqoura earlier on Monday, resulted in one fatality and another injury.\nAdditionally, enemy artillery shelling on the eastern side of Alma Al-Shaab caused fires in the region.\n==================R.H.", "location": ")\nLEBANON", "classification": "security", "score": 0.9613847024008483, "event_breakdown": "1- The Israeli enemy airstrike, which targeted a motorcycle in the southern Lebanese town of Al-Naqoura earlier on Monday, resulted in one fatality and another injury. Location: Southern Lebanese town of Al-Naqoura.\n2- Additionally, enemy artillery shelling on the eastern side of Alma Al-Shaab caused fires in the region. Location: Eastern side of Alma Al-Shaab."}, {"id": "e884f94c-0d0f-4485-a088-5e6e9bdb265d", "title": "Israeli strikes on refugee camps in central Gaza kill at least 11", "date": "2024-06-03 15:00", "url": "https://www.theargus.co.uk/news/national/24361530.israeli-strikes-refugee-camps-central-gaza-kill-least-11/", "message": "A strike on a home in the built-up Bureij refugee camp late on Sunday killed four people, including the three children.\nThe second strike in the early hours of Monday killed seven people, including a woman, in the Nuseirat refugee camp.\nMeanwhile, Israel is expanding its offensive in the southern Gaza city of Rafah, once the main hub of humanitarian aid operations.\nThe country launched its war in Gaza after Hamas’ October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people – mostly civilians – and abducted about 250.\nIsrael says around 100 hostages are still being held in Gaza, along with the bodies of around 30 more.", "location": "GAZA CITY", "classification": "security", "score": 0.9319611545855074, "event_breakdown": "Israel expanded its war on Gaza, which initially began late October, as fighter jets bombarded the Rafah City in Gaza. At least eight people were killed in this latest round of airstrikes. The Israeli military claimed it was targeting \"underground structures\" from which the Islamist group Hamas and other militants launched rockets into Israel."}, {"id": "b72c3240-faf9-46cd-a488-161694041aaa", "title": "15 - year - old charged with stabbing in Wilkes - Barre", "date": "2024-06-03 17:45", "url": "https://www.yahoo.com/news/15-old-charged-stabbing-wilkes-154437733.html", "message": "WILKES-BARRE, LUZERNE COUNTY (WBRE/WYOU) — A 15-year-old is charged after police say a stabbing took place in Wilkes-Barre City that left another teen injured.\nOn June 1 around 10:00 p.m., officers said they were called to the 200 block of George Avenue for a stabbing victim.\nOnce on the scene, police stated they found a 14-year-old boy who had a laceration on his face.\nArrest made after Edwardsville drive-by shootingThrough further investigation, detectives say they learned a fight happened between the victim and the suspect, a 15-year-old boy, while they were both attending a party.\nDuring the fight, the suspect took out a knife and slashed the victim in the face before fleeing the scene, investigators said.", "location": ")\nWilkes-Barre, Luzerne County", "classification": "security", "score": 0.8102238843873916, "event_breakdown": "WILKES-BARRE, LUZERNE COUNTY, US (WBRE/WYOU) -A 15-year-old is charged after a stabbing injured a 14-year-old boy in Wilkes-Barre City. On June 1, cops were summoned to a stabbing victim on George Avenue. Police say they located a 14-year-old boy with a face laceration on his face. After investigation, detectives learned the 15-year-old boy slashed the victim in the face after a fight while both were attending a party."}, {"id": "82419f95-b2ca-4429-b7e1-912764492182", "title": "Iran acting top diplomat dismisses US - proposed Gaza cease - fire deal in visit to Lebanon | World News", "date": "2024-06-03 19:15", "url": "https://indianexpress.com/article/world/iran-top-diplomat-dismisses-us-proposed-gaza-cease-fire-deal-9370253/", "message": "Iran’s acting foreign minister dismissed a Gaza cease-fire deal proposed by US President Joe Biden and warned Israel against launching an all-out war on Lebanon during a visit to Beirut Monday, his first official diplomatic visit since his predecessor died last month.\nHezbollah has been clashing with Israeli forces along the Lebanon-Israel border since October, against the backdrop of Israel’s war against the allied Hamas group in Gaza.\nThe cross-border fighting has intensified in recent weeks, since Israel’s incursion into the key town of Rafah in southern Gaza.\nBagheri Kani met with Lebanese counterpart Abdallah Bouhabib as well as Lebanese Speaker of Parliament Nabih Berri and caretaker Prime Minister Najib Mikati.\nBouhabib said Lebanon wants to avoid a wider war and is looking for \"sustainable solutions that restore calm and stability to southern Lebanon.", "location": "Based on the text provided, the most specific location where the main event takes place is Beirut, Lebanon.", "classification": "security", "score": 0.56399301078968, "event_breakdown": "Event 1: Iran's acting foreign minister dismissed a Gaza cease-fire proposed by US President Joe Biden.\nEvent 2: The Iranian official warned Israel against launching an all-out war on Lebanon.\nEvent 3: Hezbollah has been clashing with Israeli forces along the Lebanon-Israel border since October . This was prompted by Israel's latest incursion in the key town of Rafah."}, {"id": "25f14406-5e09-4ed1-b723-e41317b7ffda", "title": "Suspect arrested in deadly stabbing near east Las Vegas walking trail", "date": "2024-06-03 15:00", "url": "https://www.fox5vegas.com/2024/06/03/suspect-arrested-deadly-stabbing-near-east-las-vegas-walking-trail/", "message": "LAS VEGAS, Nev. (FOX5) - A 46-year-old man has been arrested in connection to a deadly stabbing near an east valley walking trail last week.\nLas Vegas Metropolitan Police Department received reports of the stabbing on Saturday, May 25 around 12:52 a.m. Officers arriving in the 2600 block of South Lamb Boulevard located a man suffering from a stab wound near the walking trail.\nThe man, identified as 34-year-old Joseph Benavente, was pronounced dead at the scene.\n46-year-old Elvis Ruvalcaba was taken into custody as a suspect on Friday, May 31, and booked into Clark County Detention Center, where he remains in custody.\nRuvalcaba is facing a charge of open murder with a deadly weapon.", "location": "Las Vegas.", "classification": "security", "score": 0.8665622990104341, "event_breakdown": "Location: 2600 block of South Lamb Boulevard, Las Vegas\nEvent: Las Vegas Metropolitan Police arrested 46-year-old Elvis Ruvalcaba in connection to a deadly stabbing near an east valley walking trail, which took place on May 25. The stabbing victim was identified as 34-year-old Joseph Benavente."}, {"id": "0f8451bf-eb1e-404e-a456-413a1cea3680", "title": "1st Special Service Force played key part in D - Day success", "date": "2024-06-03 18:45", "url": "https://helenair.com/news/local/history/1st-special-service-force-italian-campaign-played-intergral-part-in-success-of-dday/article_ba4da6a0-2072-11ef-877b-c3ddf59c8b41.html", "message": "Significantly outnumbered by the Herman Goering Division, the 1st Special Service Force held a division-sized sector along the Mussolini Canal.\nThe 1st Special Service Force drove northeast into the mountains surrounding Anzio.\nAt 6 a.m. June 4, 1944, a 1st Special Service Force patrol lead by Capt.\nThe 1st Special Service Force was an integral part of this strategy.\nOn Feb. 3, 2015, Congress presented the Congressional Gold Medal to the First Special Service Force, “In recognition of its superior service during World War II”.", "location": "ANSOR:\nANSOR: ANSOR: ANS", "classification": "security", "score": 0.706594909060056, "event_breakdown": "1st Special Service Force drives northeast into the mountains surrounding Anzio."}, {"id": "39e3d05b-7ef4-4ac0-a9d5-f25cde897c9a", "title": "Salvation Hours Windows game", "date": "2024-06-03 11:15", "url": "https://www.indiedb.com/games/salvation-hours", "message": "Salvation Hours is a Single Player - Tactical - First Person Shooter developed by Wolf Wire Studios, a one man game studio.\nThis game is based on the 2012 Benghazi Incident that involved the American Consulate, the CIA Base called the \"Annex\" and the GRS Operators posted there.\nYou step into the shoes of one of the GRS Operators, Jack Sanders, who was deployed to Benghazi GRS in early September of 2012.\n- Paradoxical95 (Founder - Wolf Wire Studios)Note : The game's combat may be difficult for some people.\nThere might be small bugs here and there, I'd request you to notify me about them in the official Discord server.", "location": "Benghazi", "classification": "security", "score": 0.7719964931012587, "event_breakdown": "Salvation Hours: is a Single Player - Tactical - First Person Shooter based on the 2012 Benghazi Incident that involved the American Consulate, the CIA Base called the \"Annex\" and the GRS Operators posted there. You step into the shoes of one of the GRS Operators, Jack Sanders, who was deployed to Benghazi GRS in early September of 2012. - Paradoxical95 (Founder - Wolf Wire Studios) Note : The game's combat may be difficult for some people. There might be small bugs here and there, I'd request you to notify me about them in the official Discord server."}, {"id": "2a611c4d-e82b-442c-8701-683e58f8f888", "title": "Paper Mario : The Thousand - Year Door Debuts in 2nd on the New Zealand Charts", "date": "2024-06-03 01:00", "url": "https://www.vgchartz.com/article/461201/paper-mario-the-thousand-year-door-debuts-in-2nd-on-the-new-zealand-charts/", "message": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts - Sales/ 1,116 Viewsby, posted 22 hours agoPaper Mario: The Thousand-Year Door has debuted in second place on the New Zealand charts, according to IGEA for the week ending May 26, 2024.\nCall of Duty: Modern Warfare III is up one spot to first place, while Grand Theft Auto V fell two spots to third place.\nNBA 2K24 fell four spots to seventh place and Fallout 4 is down three spots to eighth place.\nHogwarts Legacy, The Elder Scrolls V: Skyrim: Special Edition, and Ghost of Tsushima: Director's Cut re-entered the top 10 in fourth, fifth, and sixth places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "According to the context provided, there is no specific location that stands out as the main focus of the event.", "classification": "security", "score": 0.6833633397800863, "event_breakdown": "Paper Mario: The Thousand-Year Door Debuts in 2nd on the New Zealand Charts"}, {"id": "9ee9ea96-8cf2-4cdf-99db-825e569e5111", "title": "Israel may suspend operation in Gaza for 42 days", "date": "2024-06-03 17:30", "url": "https://armenpress.am/eng/news/1138659/", "message": "YEREVAN, JUNE 3, ARMENPRESS.\nIsrael may agree to a 42-day pause in combat in the Gaza Strip in order to release hostages held in the enclave and then continue with the operation, Israeli Prime Minister Benjamin Netanyahu said.\n\"Israel can stop the fighting for 42 days to return the captives.\nBut we cannot stop the war.\nThe Iranians and all our enemies are watching us, wanting to see if we will surrender,\" he said at a closed-door meeting of the Knesset’s Foreign Affairs and Defense Committee as quoted by Israel Hayom.", "location": "Gaza Strip", "classification": "security", "score": 0.5944983319084451, "event_breakdown": "Location: Gaza Strip"}, {"id": "4ad36a93-2a7d-4d54-b21d-3e30e61ab6fa", "title": "Remembering D - Day : Key facts and figures about the invasion that changed the course of World War II", "date": "2024-06-03 09:00", "url": "https://isp.netscape.com/news/story/0001/20240603/b02d03fa11f66767a521a3b01357a89a", "message": "Remembering D-Day: Key facts and figures about the invasion that changed the course of World War IIOMAHA BEACH, France (AP) — The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Adolf Hitler's defenses in western Europe and change the course of World War II.\nWHO TOOK PARTNearly 160,000 Allied troops landed in Normandy on June 6, 1944.\nVICTIMS ON ALL SIDESA total of 4,414 Allied troops were killed on D-Day itself, including 2,501 Americans.\nThe exact German casualties aren’t known, but historians estimate between 4,000 and 9,000 men were killed, wounded or missing during the D-Day invasion alone.\nIt's unclear how many D-Day veterans are still alive.", "location": "Normandy", "classification": "security", "score": 0.785189416543886, "event_breakdown": "60th Anniversary of D-Day\nThe 60th anniversary of D-Day will be observed on June 6, 2004. The 1944 D-Day invasion, code-named Operation Overlord, marked a turning point in World War II. Allied forces landed on the shores of Normandy to fight Nazi Germany, a country in which the Fuhrer ruled using Hitler's form of fascism.\nWith the help of the United States and former Prime Minister Winston Churchill, Britain had declared war on Germany in 1939. In 1953, Winston Churchill died here. His wartime speeches are most remembered.\nOn D-Day, there were bombings, firefights, parachute and glider landings, erosion, and surf until Omaha Beach was taken. According to the 1945 Congressional Medal of Honor, the last task was knocking out Hitler."}, {"id": "1e65600f-9f91-44c0-8db6-8ad64176ddfa", "title": "The call for renegotiation must go on - Kaieteur News", "date": "2024-06-03 06:45", "url": "https://www.kaieteurnewsonline.com/2024/06/03/the-call-for-renegotiation-must-go-on/", "message": "The call for renegotiation must go onKaieteur News – We have been at the forefront of the calls for renegotiation of the criminal oil contract that enslaves Guyana to ExxonMobil.\nWhen there were few other voices calling for renegotiation of the lopsided American oil company contract with this country, we were there, and we have been loud and persistent.\nRenegotiation affords some relief, some reversal, of this unspeakable crime that ExxonMobil has committed on the Guyanese people, and the ones unborn as of today.\nRenegotiation of the contract is not just leadership duty, a nice thing to preside over, a mere corrective measure.\nRenegotiation of the oil is more than to improve the state of Guyanese.", "location": "Guyana", "classification": "security", "score": 0.4427496915837463, "event_breakdown": "Target event in text \"criminal oil contract\"\nKaieteur News - We have been at the forefront of the calls for renegotiation of the criminal oil contract that enslaves Guyana to ExxonMobil."}, {"id": "9b008ba0-fd7d-480a-af8d-2429ccc9f82c", "title": "Israel may suspend operation in Gaza for 42 days", "date": "2024-06-03 18:00", "url": "https://tass.com/world/1797429", "message": "Israel may agree to a 42-day pause in combat in the Gaza Strip in order to release hostages held in the enclave and then continue with the operation, Israeli Prime Minister Benjamin Netanyahu said.\n\"Israel can stop the fighting for 42 days to return the captives.\nHe also reportedly said that there were \"gaps\" between the Israeli version and Biden’s recounting of it.\nOn May 31, Biden presented a three-stage settlement plan for the Gaza Strip which, according to him, Israel had proposed.\nTensions flared up again in the Middle East on October 7, 2023, when militants from the Gaza-based Palestinian radical group Hamas staged a surprise incursion into Israeli territory from the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.5824941794209163, "event_breakdown": "New Israel-Gaza fighting flares up again in the Middle East\nIDF forces thwarted a terror incursion by Hamas operatives into southern Israel."}, {"id": "8f3620b9-d5d9-47ef-8c12-4515bc1930a7", "title": "Two Japanese F - 35 fighter jets make emergency landings", "date": "2024-06-03 15:00", "url": "https://www.thecourier.co.uk/news/uk-world/4998733/two-japanese-f-35-fighter-jets-make-emergency-landings/", "message": "Two Japanese F-35A stealth fighter jets have made emergency landings at a commercial airport in northern Japan, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defence Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan’s military.", "location": "Aomori Airport", "classification": "security", "score": 0.4306555810048496, "event_breakdown": "F-35A stealth fighter jets make emergency landings at Aomori Airport in northern Japan"}, {"id": "bab099b8-d66c-417d-a519-6e4a5f67d0b8", "title": "Doubts grow over Gaza truce plan as heavy fighting rages", "date": "2024-06-03 16:30", "url": "https://www.khaleejtimes.com/world/doubts-grow-over-gaza-truce-plan-as-heavy-fighting-rages", "message": "But for now, the bombardment and ground combat showed no sign of easing in the Gaza war soon to enter its ninth month that has devastated the coastal territory of 2.4 million people.\nOn Monday the Israeli military said that over the past day its forces had struck \"over 50 targets in the Gaza Strip\".\nHamas also took about 250 hostages, 120 of whom remain in Gaza, including 37 the army says are dead.\nHeavy fighting has raged especially in Gaza's far-southern Rafah area near the Egyptian border, where most civilians have now been displaced once more, according to UN agencies.\nThe military said troops were carrying out \"targeted operations in the Rafah area\", where they had \"located terror infrastructure and large quantities of weapons\".", "location": "GAZA", "classification": "security", "score": 0.885051636105698, "event_breakdown": "Gaza, Rafah"}, {"id": "c0a31e0d-7d08-42f5-a1a0-595f825b91d0", "title": "DFL delegates condemn antisemitism and call for ceasefire in Gaza war", "date": "2024-06-03 01:30", "url": "https://www.postbulletin.com/news/minnesota/dfl-delegates-condemn-antisemitism-and-call-for-ceasefire-in-gaza-war-2", "message": "ADVERTISEMENTThat nomination was led by a progressive anti-war wing of the DFL that wanted to confront Klobuchar regarding the war in Gaza.\nDFL delegates and party leaders have gathered in Duluth the weekend of May 31 to June 2, 2024, for their state convention.\nSeveral dozen protesters joined party delegates outside the Duluth Convention Center on Saturday.\nPeople march toward the Duluth Entertainment Convention Center for a pro-Palestine protest during the DFL Convention Saturday, June 1, 2024.\nDFL leaders and politicians boasted about the party’s successes in Minnesota while condemning the MAGA movement during their state convention.", "location": "Duluth, Minnesota", "classification": "security", "score": 0.7793337289194425, "event_breakdown": "Duluth Entertainment Convention Center"}, {"id": "86b3c6a7-430c-4351-b393-239bdc7abaff", "title": "Gaza truce plan in doubt as Israel - Hamas fighting intensifies", "date": "2024-06-03 13:45", "url": "https://www.firstpost.com/world/gaza-truce-plan-in-doubt-as-israel-hamas-fighting-intensifies-13778210.html", "message": "The Israeli military declared on Monday that it had hit “over 50 targets in the Gaza Strip” on the previous day.\nAt least 19 individuals were reportedly slain in nighttime attacks, according to Gaza hospitals on Monday.\nNews agency AFP qouted witnesses as saying that artillery fire and airstrikes were heard in Gaza City and Rafah, primarily in the Tal al-Sultan neighborhood.\nAdvertisementAccording to Biden, Israel’s three-stage offer would begin with a six-week phase that would see Israeli forces withdraw from all populated areas of Gaza and an initial hostage-prisoner exchange.\nCairo refuses to coordinate with Israel humanitarian deliveries through Rafah, but has agreed to send some aid via Israel’s Kerem Shalom crossing.", "location": "Gaza City", "classification": "security", "score": 0.7032559522068484, "event_breakdown": "target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nGaza Strip"}]