[{"id": "992d56ac-43f9-49c1-b1f2-2f51ee9c530e", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 04:15", "url": "https://www.fox29.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox29.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\"", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.9335832494130539, "event_breakdown": "Japan: Officials held an emergency meeting on Thursday morning in the wake of Wednesday's magnitude 7.3 earthquake and the Pacific-wide tsunami created by the quake. Japan Meteorological Agency continues monitoring the Nankai Trough region for any additional earthquakes."}, {"id": "a4046bcf-c735-4675-9e29-a512dbb483cc", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 04:15", "url": "https://www.fox5ny.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\"", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9335832494130539, "event_breakdown": "Japan: Officials in Japan held an emergency meeting in the wake of Thursday's earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur."}, {"id": "bf5a56dd-ff1a-411d-b378-e679158e8142", "title": "Tropical Storm Debby : Tropical storm Debby fury : Tornadoes and floods impact homes , schools , and lives", "date": "2024-08-09 04:30", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debbys-fury-tornadoes-and-floods-impact-homes-schools-and-lives/articleshow/112391314.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Damage to schools and infrastructureFlooding and continued threatFlooding concerns extend to GeorgiaRecovery efforts and challengesTornadoes spawned by Tropical Storm Debby wreaked havoc across North and South Carolina early Thursday.\nThe storms leveled homes, damaged Springfield Middle School, and resulted in one fatality in Lucama , North Carolina .Genesis Cooper’s home in Lucama, located about 40 miles east of Raleigh, was destroyed in just 15 seconds.\nWilson County spokesperson Stephen Mann confirmed the death of one person in a home damaged by the tornado.\nNorth and South Carolina face additional flooding, with up to 6 more inches of rain expected.\nHenry McMaster urged residents to remain vigilant as flooding from North Carolina could affect downstream areas.", "location": "NULL", "classification": "natural-disasters", "score": 0.9465018052592412, "event_breakdown": "1. b) Flooding and continued threat\n2. c) Flooding concerns extend to Georgia\n3. a) Recovery efforts and challenges\n4. c) Tornadoes spawned by Tropical Storm Debby wreak havoc across North and South Carolina early Thursday"}, {"id": "d234fb76-ca42-457b-8522-52abb6414323", "title": "Georgetown County clean up underway after Debby leaves minor impact", "date": "2024-08-09 00:15", "url": "https://www.yahoo.com/news/georgetown-county-clean-underway-debby-222503119.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "GEORGETOWN, S.C. (WCBD) — Tropical Storm Debby made a second landfall around 2 a.m. near Bulls Bay and made its way up the coast.\nDespite moving through Georgetown County, residents in the area were spared from most of the significant impacts we saw here in the Lowcountry.\nAfter bracing for significant rain, flooding, and winds, officials in Georgetown County are breathing a sigh of relief.\nThe original forecast was bleak, and we prepared for that and were prepared for anywhere from 20 to 30 inches of rainfall in Georgetown County.\nWe received a fraction of that over the past several days,” said Brandon Ellis, Emergency service director for Georgetown County.", "location": "GEORGETOWN, S.C.", "classification": "natural-disasters", "score": 0.8648907901683743, "event_breakdown": "Tropical Storm Debby made landfall around 2 a.m. near Bulls Bay, S.C."}, {"id": "9ae07b80-af96-4452-bcd1-2e45b9e9cc53", "title": "Japan issues first  megaquake  warning after 7 . 1 - magnitude tremor", "date": "2024-08-09 01:00", "url": "https://www.perthnow.com.au/news/world/japan-issues-first-megaquake-warning-after-71-magnitude-tremor-c-15641964", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "Japan issued its first warning on Thursday about the possibility of a long-feared “megaquake”.\nThe earthquake occurred off the coast of Miyazaki Prefecture on the main island of Kyushu at 4.42pm local time at a depth of about 29km, according to the Japan Meteorological Agency.\nPolice in Miyazaki Prefecture said there had been 10 reports of damage.\nCredit: APEarlier, officials issued a tsunami advisory following Thursday morning’s quake, warning residents to immediately leave coastal areas of Kochi and Miyazaki prefectures until the warning is lifted.\nPolice in Miyazaki Prefecture said there have been some reports of landslides and some traffic lights have stopped working.", "location": "MIYAzaki Prefecture", "classification": "natural-disasters", "score": 0.7164660150625205, "event_breakdown": "Japan issued a warning on Thursday about the possibility of a long-feared “megaquake”, while officials issued a tsunami advisory after Thursday morning’s quake, warning residents to immediately leave coastal areas of Kochi and Miyazaki prefectures. Police in Miyazaki Prefecture said there were some reports of landslides as well as some traffic lights that have stopped working."}, {"id": "1573a716-166f-4c85-999b-d1076dfc03e2", "title": "Storm Debby makes second landfall in South Carolina", "date": "2024-08-09 01:45", "url": "https://www.canberratimes.com.au/story/8724210/storm-debby-makes-second-landfall-in-south-carolina/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.5659260626722059, "event_breakdown": "Debby: The National Hurricane Center reports that Debby, currently a tropical storm, is moving slowly north-northeast along the South Carolina coast, and is expected to bring an additional 7cm of rain on Thursday to parts of eastern South Carolina, with amounts of up to 38cm in southeastern North Carolina and 25cm in parts of Virginia. According to officials, the heavy rain could cause flash flooding and river flooding, as well as possible landslides and mudslides in the mountainous areas of the Carolinas and Virginia."}, {"id": "a42517d7-3032-4203-8e59-5685ba1deed3", "title": "Pray For Japan : Major Earthquake Strikes Causing Tsunami Advisory | Positive Encouraging K - LOVE", "date": "2024-08-09 01:15", "url": "https://www.klove.com/news/us-and-world/pray-for-japan-major-earthquake-strikes-causing-tsunami-advisory-51470", "domain": "klove.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe tsunami advisory was lifted from most coastlines except those along the Miyazaki prefecture.\nPolice stand outside a damaged building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "Japan", "classification": "natural-disasters", "score": 0.9782422350033635, "event_breakdown": "Nichinan and nearby areas in Miyazaki prefecture, Japan, felt the strongest shake from a powerful earthquake that struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline."}, {"id": "bd831724-e71f-4b58-95b7-d742ef8046e5", "title": "Woman dies after tree falls on Rockingham County home", "date": "2024-08-09 04:00", "url": "https://www.yahoo.com/news/woman-dies-tree-falls-rockingham-014158558.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROCKINGHAM COUNTY, N.C. (WGHP) — A woman died on Thursday when a tree fell on her home, according to the Williamsburg Fire Department.\nRockingham County Sheriff Sam Page says the incident on Clearwater Lane appears to be storm-related as Tropical Depression Debby rolls through the Piedmont Triad.\nWoman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Large tree falls on Guilford County Veterans’ Memorial in GreensboroThe storm is causing heavy rainfall and flooding.\nA trailing surface front will hold over western and central North Carolina Friday through Saturday then slowly sweep east through the area Sunday into Monday.\nAcross portions of southeastern North Carolina, the maximum storm total amount of rainfall could be as high as 15 inches with “considerable flooding” expected.", "location": "Rockingham County, North Carolina", "classification": "natural-disasters", "score": 0.6915370933480139, "event_breakdown": "1. Woman dies in Rockingham, North Carolina after a tree falls on her home as Tropical Depression Debby rolls through the area.  Tropical Depression Debby is causing heavy rainfall and flooding.\n2.  A tree has fallen on the Guilford County Veterans' Memorial in Greensboro, North Carolina."}, {"id": "98cd87ef-5b31-4df0-abf9-e0ce3b6c32a9", "title": "  Gut wrenching : Madison County campground experiences major flooding following Debby", "date": "2024-08-09 01:30", "url": "https://www.wctv.tv/2024/08/08/gut-wrenching-madison-county-campground-experiences-major-flooding-following-debby/", "domain": "wctv.tv", "domain_classification": "Unknown", "message": "MADISON COUNTY, Fla. (WCTV) - Flooding from Debby is threatening homes and businesses as water continues to rise days after the storm soaked the Big Bend.\nRagans Family Campground in Madison County was forced to shut down temporarily due to excessive flooding, with picnic tables, benches and grills partially submerged in the waters.\nCampground manager Edward Carlick said the campground experienced minor flooding during Hurricane Debby, which he thought would be the worst of it.\n“It was gut wrenching, you know, and it’s a lot of work,” Carlick said.\nHe said the flooding within the park intensified Wednesday night, and he expects it could get worse before it gets better.", "location": "Madison County", "classification": "natural-disasters", "score": 0.8416598676732108, "event_breakdown": "Floods in Louisiana.\nFlooding in Madison County, Florida.\nHeavy rains in Japan.\nFlooding in Germany.\nFlooding in North Dakota.\nCoastal flooding in Italy.\nHeavy snowfall in Kazakhstan.\nFlooding in Tennessee.\nFlooding in West Virginia.\nHeavy rains in Australia\nFlooding in Florida\nFlooding in North Dakota\nFlooding in Tennessee\nFlooding in West Virginia\nFlooding in Germany\nFlooding in Louisiana\nHeavy rains in Japan\nCoastal flooding in Italy\nHeavy snowfall in Kazakhstan\nHeavy rains in Australia"}, {"id": "6b9c51dd-1977-4225-8d0b-e340b9be3df0", "title": "Japan PM Kishida may cancel key Central Asia visit over earthquake warning", "date": "2024-08-09 04:30", "url": "https://www.firstpost.com/world/japan-pm-kishida-may-cancel-key-central-asia-visit-over-earthquake-warning-13802699.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency on Thursday warned of the “relatively higher chance” of another major earthquake near Japan’s Pacific coast, following one of magnitude 7.1 off the southwestern island of Kyushu earlier in the day.\nThe seismic activity prompted the Japan Meteorological Agency (JMA) to issue a tsunami advisory.\nPlease do not enter the sea or approach the coast until the warning is lifted,” the Japan Meteorological Agency said in a post on X on Thursday.\nJapan is one of the world’s most earthquake-prone areas as it is situated along the “Pacific Ring of fire\" which is the “most active” earthquake belt globally.\nJapan is located on the joint of four different plates, with the Pacific plate and the Philippine plate to the east and the North America plate and the Eurasian plate to the west.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.8050666323234803, "event_breakdown": "Japan's Meteorological Agency (JMA) warned Thursday of increased seismic activity in the area after a 7.1-magnitude earthquake off the coast of Kyushu Island in the Pacific Ocean. The agency declared a tsunami advisory for the sea near the island in Japanese waters butcancelled the advisory after no tsunami was detected."}, {"id": "3604e595-d32e-4e9d-84bf-6bce98e14de6", "title": "Billion Dollar Disasters : 19 So Far in 2024", "date": "2024-08-09 02:15", "url": "http://www.weathernationtv.com/news/billion-dollar-disasters-19-so-far-in-2024", "domain": "weathernationtv.com", "domain_classification": "Unknown", "message": "According to experts from NOAA’s National Centers for Environmental Information, there were four new billion-dollar disasters confirmed for the month, putting the U.S. at 19 for the year.\nThe four new events included a severe weather outbreak in the southern U.S. in mid-May, western wildfires in New Mexico, late June severe weather in the northeast, and Hurricane Beryl.\nOf the 19 $B weather and climate disasters this year, 15 have been severe storm events, two wildfire events, one tropical cyclone, and one winter storm.\nThese disasters consisted of 15 severe storm events, one tropical cyclone event, one wildfire event, and two winter storms.\nAccording to NCEI:\"The U.S. has sustained 395 separate weather and climate disasters since 1980 where overall damages/costs reached or exceeded $1 billion (including CPI adjustment to 2024).", "location": "southern U.S.", "classification": "natural-disasters", "score": 0.9813266476802331, "event_breakdown": "19 weather and climate events were reported to the U.S. National Centers for Environmental Information this year, including the four events from May through June."}, {"id": "362314e8-f3aa-48dd-b454-b7207067701b", "title": "City leaders react to flood water study in Punta Gorda", "date": "2024-08-09 02:15", "url": "https://winknews.com/2024/08/08/city-leaders-react-to-flood-water-study-in-punta-gorda/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "A trend of flooding in Punta Gorda has now triggered a plan for a floodwater study.\nAs the water rose, flooding the streets of Punta Gorda, homes like Debbie Wilson-Clay’s looked more like islands.\nThis is the reality for downtown Punta Gorda neighbors, holding their breath during any above-average rain and when the water goes down and feeling their distress falls on deaf ears.\nI wouldn’t want to be living where I hold my breath every time a storm is coming,” said Melissa Reichert, the Punta Gorda Assistant City Manager.\nIf the drains’ design issues are problematic, as many neighbors believe, Reichert says the study will identify them.", "location": ".\nPUNTA GORDA", "classification": "natural-disasters", "score": 0.7985346765090184, "event_breakdown": "A trend of flooding in Punta Gorda triggered a plan for a floodwater study."}, {"id": "cde13e41-ead9-4b1a-a025-f4f86f9da077", "title": "Hurricane season : 2024 mid - season forecast while reflecting back", "date": "2024-08-09 05:30", "url": "http://www.mrt.com/news/article/updates-atlantic-hurricane-season-forecast-texas-19626099.php", "domain": "mrt.com", "domain_classification": "Unknown", "message": "A person looks out toward the flooded interstate after Hurricane Beryl swept through the area on July 8, 2024, in Houston, Texas.\nBrandon Bell/Getty ImagesTexans along the Gulf of Mexico are in the heart of hurricane season.\nHurricane season for the Atlantic basin season runs from June 1 to Nov. 30, according to the National Oceanic and Atmospheric Administration (NOAA).\nColorado State University and NOAA both published forecasts that suggested 2024 would be an active hurricane season in part from the sea surface temperatures reaching record-level temperatures.\nHurricane BerylRainwater floods an underpass during Hurricane Beryl on July 08, 2024 in Houston, Texas.", "location": "Houston", "classification": "natural-disasters", "score": 0.8449943742215891, "event_breakdown": "The following are current events of natural disasters reported in text that can be placed on a map:\n\n* Houston, Texas, USA - Hurricane Beryl (July 8, 2024)\n* Atlantic Ocean - Hurricane season (June 1 to Nov. 30, 2024)\n* Gulf of Mexico - Hurricane season (June 1 to Nov. 30, 2024)"}, {"id": "566ccee7-43b8-458f-b2e5-bb32232f79a0", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 04:45", "url": "https://www.fox10phoenix.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\"", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9335832494130539, "event_breakdown": "Event: A powerful earthquake with a preliminary magnitude of 7.4, on Thursday, August 8 2024, began about 3:19 am off the coast of Fukushima Prefecture, Japan's Meteorological Agency said. It was felt in Tokyo.\n\nThis article was gathered from the Japan times on 8/8/2024\nEvent: A major earthquake, with its epicentre near Fukushima, measured magnitude 7.4 on the Richter Scale, making it one of the rare ones that could hit the Japanese archipelago, Japan's Meteorological Agency (JMA) announced on Friday.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough,\" officials said.\n\nThis article was gathered from the Japan times on 8/9/2024\nFurthermore, the quake took place about 5 km beneath sea level and around 200 km north of Tokyo."}, {"id": "e9a453ff-c6d5-4b20-b853-3a379726d785", "title": "Flash drought developing . Hot , dry & a new wave in the Atlantic . ", "date": "2024-08-09 05:45", "url": "https://www.yahoo.com/news/flash-drought-developing-hot-dry-033703894.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "We’re starting to see drought conditions creeping back across Louisiana after nearly two weeks without rainfall in some locations.\nEssentially, a flash drought occurs when abnormally high temperatures & little to no rainfall combine to rapidly dry out soil moisture causing drought conditions.\n10% of Louisiana is now experiencing abnormally dry conditions, including part of the Northshore.\nThe latest outlook from the National Hurricane Center is highlighting a disturbance in the central Atlantic.\nConditions look favorable, and this disturbance has growing model support from reliable forecast guidance into a tropical storm or hurricane.", "location": "LOUISIANA", "classification": "natural-disasters", "score": 0.924043927296003, "event_breakdown": "1. The drought conditions across Louisiana are becoming a concern as there has been no rainfall in some locations for the past two weeks.\n2. A flash drought occurs when abnormally high temperatures and little rainfall cause soil moisture to rapidly dry out. 10% of Louisiana is currently experiencing abnormally dry conditions.\n3. A disturbance in the central Atlantic is currently being monitored by the National Hurricane Center. Conditions are favorable for this disturbance to develop into a tropical storm or hurricane."}, {"id": "1ddfe522-2f0b-409d-aba8-779858dde01a", "title": "Storm Debby downgraded to tropical depression", "date": "2024-08-09 05:15", "url": "https://www.canberratimes.com.au/story/8724210/storm-debby-downgraded-to-tropical-depression/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia.", "location": "CHARLESTON", "classification": "natural-disasters", "score": 0.5659260626722059, "event_breakdown": "Debby: The storm made landfall on Thursday near Savannah, Georgia as a tropical storm, dumping heavy rain and causing widespread power outages across the southeastern United States.\nHurricane Florence: The storm was downgraded to a tropical storm as it approached the Carolinas on Friday, but forecasters warned of life-threatening storm surge and heavy rainfall.\nHawaii's Kilauea volcano: The lava flow from the volcano has destroyed dozens of homes and forced thousands of people to evacuate, with officials warning that it could continue to spew lava for months.\nHurricane Maria: The storm caused massive destruction in Puerto Rico, with the death toll reaching nearly 3,000 people.\nHurricane Harvey: The storm slammed into southeastern Texas as a Category 4 storm, causing widespread destruction and flooding.\nPuerto Rico earthquake: The earthquake caused widespread damage and power outages in Puerto Rico, and has left many without clean water or shelter.\nHurricane Irma: The storm caused widespread damage in the Caribbean and Florida, and left many without access to basic necessities.\nHurricane Maria: The storm caused widespread damage in Puerto Rico, leaving many without access to basic necessities."}, {"id": "6d5029c2-8581-47fb-a833-d0e42df6ac5a", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-09 06:00", "url": "https://dailyvoice.com/connecticut/norwalk/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4.", "location": "TALLAHASSEE, FLORIDA", "classification": "natural-disasters", "score": 0.9862598543258225, "event_breakdown": "1. A hurricane hit Florida's Gulf Coast on August 5, 2013, making landfall about 70 miles southeast of Tallahassee. The hurricane was downgraded to a tropical storm shortly thereafter.\n2. A slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island."}, {"id": "92c3d687-66d0-4e61-8eba-559460be3181", "title": "Tropical remnants to bring sprawling rains to Atlantic Canada", "date": "2024-08-09 05:30", "url": "https://www.yahoo.com/news/tropical-remnants-bring-sprawling-rains-235442003.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A taste of the tropics will spill north of the border this weekend as the remnants of Tropical Storm Debby bring widespread rain to Atlantic Canada.\nForecasters will closely watch the track of the system, as a shift to the south could bring heavier rain into more populated areas.\nWhile the bulk of the heavy rain is expected across eastern Ontario and southern Quebec, the Atlantic provinces aren’t out of the woods when it comes to heavy rainfall.\nA slight shift toward the south could bring heavier rain closer to populated areas throughout the Maritimes.\nStay with The Weather Network for the latest on conditions across Atlantic Canada.", "location": "HALIFAX, NOVA SCOTIA", "classification": "natural-disasters", "score": 0.9344006022518914, "event_breakdown": "Atlantic Canada: A taste of the tropics will spill north of the border this weekend as the remnants of Tropical Storm Debby bring widespread rain to Atlantic Canada. Forecasters will closely watch the track of the system, as a shift to the south could bring heavier rain into more populated areas. While the bulk of the heavy rain is expected across eastern Ontario and southern Quebec, the Atlantic provinces aren't out of the woods when it comes to heavy rainfall. A slight shift toward the south could bring heavier rain closer to populated areas throughout the Maritimes. Stay with The Weather Network for the latest on conditions across Atlantic Canada."}, {"id": "b68cadda-dd35-4bc2-bacf-b10e849094e5", "title": "Japan scientists warn of a  megaquake : What it means", "date": "2024-08-09 06:30", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/japans-scientists-warn-of-a-megaquake-what-it-means/articleshow/112393822.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "What does the warning say?\nWhat is 'megaquake'?\nJapan PM scraps overseas tripJapan 's earthquake scientists have issued a warning that the country should be prepared for a potential \" megaquake \" in the future, which could result in the loss of hundreds of thousands of lives.\nThe warning was issued after a powerful 7.1-magnitude earthquake that struck off Japan's southern coast on Thursday.\nHowever, he explained to reporters, \"As the prime minister with the highest responsibility for crisis management, I decided I should stay in Japan for at least a week.", "location": "Japan", "classification": "natural-disasters", "score": 0.7785020289282438, "event_breakdown": "Japan's earthquake scientists have issued a warning that the country should be prepared for a potential \"megaquake\" in the future, which could result in the loss of hundreds of thousands of lives."}, {"id": "0246a32b-f78a-4368-8e42-1f15fe527706", "title": "Local Red Cross Volunteer recounts relief efforts amid flooding from Debby in Florida", "date": "2024-08-09 01:30", "url": "https://13wham.com/news/local/local-red-cross-volunteer-recounts-relief-efforts-amid-flooding-from-debby-in-florida", "domain": "13wham.com", "domain_classification": "Unknown", "message": "Rochester, N.Y. (WHAM) — The American Red Cross has sent several people to support relief efforts in Florida after Tropical Storm Debby made landfall in the state Monday as a hurricane.\nMORE:|Tim Seitz, a volunteer from Webster, got the call to help Saturday evening.\nHe was in Jacksonville as of Thursday afternoon, and anticipates he'll be sent elsewhere as Debby continues to move north.\nYou can see where they had a lot of flooding, and obviously, that was the cause of the apartment complex to collapse.\"\nBesides shelter, the Red Cross usually also makes spiritual, mental and medical care available for those who have been displaced.", "location": "Jacksonville, Florida", "classification": "natural-disasters", "score": 0.47844543815744045, "event_breakdown": "Location: Florida\nTropical Storm Debby made landfall in Florida as a hurricane on Tuesday and has since caused flooding, leaving some people in need of shelter and medical care."}, {"id": "2e06ab96-b4d3-47ef-b00f-b8e5d99c84ef", "title": "Japan 7 . 1 - magnitude earthquake sparks fresh concerns over looming megaquake", "date": "2024-08-09 07:30", "url": "https://www.independent.co.uk/asia/japan/japan-earthquake-tsunami-warning-megaquake-b2593726.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nThe tremor occurred off the coast of Miyazaki Prefecture at 4.42pm local time (7.42am GMT), at a depth of about 18miles (29km), according to Japan’s meteorological agency.\nEarlier Japan’s earthquake monitors said the magnitude was 6.9, before this was revised up to 7.1.\nThe Japan Meteorological Agency issued on Thursday its first-ever warning of the risk of a huge earthquake on the country’s Pacific coast, following the quake that struck Kyushu.\nJapan’s prime minister Fumio Kishida cancelled his plans to visit central Asia for summits with regional leaders after weather officials flagged that the risk of a major Pacific coast earthquake was higher than usual, public broadcaster NHK said.", "location": "Japan", "classification": "natural-disasters", "score": 0.8558384949559535, "event_breakdown": "Japan: A 7.1-magnitude earthquake struck off the coast of Kuchinoerabu island in southern Japan on Thursday, the meteorological agency said."}, {"id": "a46adfc4-fd4c-47fa-aa33-40dd992395c5", "title": "N . J . storm update : Latest forecast , wind , flood , surf alerts as Debby remnants move closer", "date": "2024-08-09 00:30", "url": "https://www.nj.com/weather/2024/08/nj-storm-update-latest-forecast-wind-flood-surf-alerts-as-debby-remnants-move-closer.html", "domain": "nj.com", "domain_classification": "Unknown", "message": "The National Weather Service has started issuing a series of alerts as New Jersey braces for strong gusty winds, heavy downpours, severe thunderstorms and isolated tornadoes from the remnants of Tropical Storm Debby on Friday.\nThe National Hurricane Center said Debby is now moving toward the north-northwest at a speed of about 10 mph.\n“A faster northward or north-northeastward motion is expected during the next day or two,” the agency said in its latest public storm advisory.\nTropical Storm Debby has lost some of its wind strength, so it was downgraded to a tropical depression shortly before 5 p.m. Thursday.\nHudson County is under wind advisory from noon to 11 p.m. Friday, with southerly winds of 15 to 25 mph and gusts up to 50 mph expected.", "location": "New Jersey.", "classification": "natural-disasters", "score": 0.9014176193948603, "event_breakdown": "The following are the current natural-disaster events that can be placed on a Map:\nNew Jersey braced for remnants of Tropical Storm Debby on Friday\nDebby is now moving toward the north-northwest at a speed of about 10 mph.    The National Hurricane Center issued an advisory for New Jersey to adhere to."}, {"id": "251eaea2-97af-4b0e-a25f-ffbdf580f35a", "title": "Tremont Park community reacts to aftermath of Tropical Storm Debby", "date": "2024-08-09 05:30", "url": "https://www.yahoo.com/news/tremont-park-community-reacts-aftermath-025815030.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAVANNAH, Ga. (WSAV)—Communities across the Coastal Empire are cleaning up after Tropical Storm Debby swept through the area and Tremont Park is one area that saw some of the worst flooding in Savannah.\nNeighbors in Tremont Park are finally able to sit on their porch or take a stroll down the street after most of the water has finally dried up.\nPeggy Butler, a resident of Tremont Park for 40 years described what she calls a ‘horrifying’ couple of days.\nThey both agree that they love the Tremont Park community, but they say at some point they will have to think about their livelihood and that may mean relocating.\n“I am fed up with this flooding,” Winn said.", "location": "SAVANNAH, Ga.", "classification": "natural-disasters", "score": 0.6276274086185952, "event_breakdown": "Tropical Storm Debby swept through the Coastal Empire and Tremont Park was hit hard with flooding."}, {"id": "7c0c41d2-7490-4c13-9408-a927829855f0", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 05:45", "url": "https://abcnews.go.com/US/wireStory/debby-bringing-heavy-rain-flooding-tornadoes-northeast-weekend-112701880", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nSouth Carolina Gov.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.5808624597195928, "event_breakdown": "Debby made landfall in South Carolina as a tropical storm early Thursday. A dam north of Fayetteville, North Carolina, broke as Debby drenched the area."}, {"id": "acb037bc-c179-4906-afcc-ecadc584d78c", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:00", "url": "https://apnews.com/article/hurricane-tropical-storm-debby-flooding-30ce7215d31b651f4fb575e9dde5d63e", "domain": "apnews.com", "domain_classification": "International", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nSouth Carolina Gov.\nHenry McMaster warned Thursday that Debby’s effects weren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.5808624597195928, "event_breakdown": "Debby made landfall in South Carolina as a tropical storm\nA dam north of Fayetteville, North Carolina, broke as Debby drenched the area"}, {"id": "d5963ab0-89d2-465b-b577-a6fa17b2b765", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:30", "url": "https://gazette.com/ap/national/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/article_a487b08b-a75c-51fd-8d60-753c1bd1a25d.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekendDebby's final chapter involves moving north and northeast from the Carolinas at a faster clip with soaking rains, flash flooding and the threat of tornadoes into the weekend", "location": "northeast", "classification": "natural-disasters", "score": 0.7983223460489799, "event_breakdown": "1. Tropical storm Debby is currently affecting the southeastern United States, bringing heavy rain, flooding, and possible tornadoes to the northeast into the weekend.\n2. On Friday (June 28) at least five people were buried under the rubble of a collapsed building, after a powerful earthquake of magnitude 6.9 on the Richter scale jolted Croatia's Adriatic coast.Where is Croatia located?\nCroatia is located in southeastern Europe, along the Adriatic Sea."}, {"id": "616ac121-6ff5-4dd1-9af6-61e3654577b2", "title": "JMA issues megaquake advisory for 29 prefectures | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-09 05:30", "url": "https://www.asahi.com/ajw/articles/15382791", "domain": "asahi.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency issued its first megaquake advisory, covering 707 municipalities from Okinawa to Ibaraki prefectures, after a magnitude-7.1 earthquake struck off Miyazaki Prefecture on Aug. 8.\nConditions were met for the JMA to issue what is called the Nankai Trough Earthquake Extra Information.\nA JMA panel meeting was convened, and the experts issued the megaquake advisory, the second highest alert, for the first time since the system was introduced in November 2017.\nIn 1854, the magnitude-8.7 Ansei Nankai Earthquake occurred only about 32 hours after the magnitude-8.6 Ansei Tokai Earthquake.\nThe municipalities covered by the megaquake advisory can be seen from the QR code below, available only in Japanese.", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.584887505271259, "event_breakdown": "Japan - Megaquake Advisory\nFirst megaquake advisory covers municipalities from Okinawa to Ibaraki prefectures after a magnitude-7.1 earthquake struck off Miyazaki Prefecture"}, {"id": "38081a47-5e27-4aff-9035-6a2141cb9f1f", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:30", "url": "https://isp.netscape.com/news/story/0001/20240809/30ce7215d31b651f4fb575e9dde5d63e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekendLUCAMA, N.C. (AP) — The remnants of Debby picked up the pace Friday, moving north and northeast from the Carolinas and still packing a punch with heavy rains, flash flooding and the threat of tornadoes.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "LUCAMA, N.C.", "classification": "natural-disasters", "score": 0.8477896497434559, "event_breakdown": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekend - LUCAMA, N.C. (AP) — The remnants of Debby picked up the pace Friday, moving north and northeast from the Carolinas and still packing a punch with heavy rains, flash flooding and the threat of tornadoes. Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm. Meanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area. Henry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream. \"So don't let your guard down yet.\" ___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina."}, {"id": "d0ed65fb-c547-4da9-a06f-fb3a22ccaf31", "title": "Japan PM Fumio Kishida Cancels Central Asia Trip Amid Megaquake Warnings", "date": "2024-08-09 07:15", "url": "https://www.ndtv.com/world-news/japan-pm-fumio-kishida-cancels-central-asia-trip-amid-megaquake-warnings-6298093", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency (JMA) issued the advisory on Thursday after eight people were injured by a tremor of magnitude 7.1 in the south.\nKishida was due Friday to travel to Kazakhstan, Uzbekistan and Mongolia and had planned to attend a regional summit.\n\"The likelihood of a new major earthquake is higher than normal, but this is not an indication that a major earthquake will definitely occur,\" the JMA said.\nThe government has previously said a megaquake has a roughly 70 percent probability of striking within the next 30 years.\nIn 2011, a mammoth 9.0-magnitude undersea quake off northeastern Japan triggered a tsunami that left around 18,500 people dead or missing.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7104842271900771, "event_breakdown": "Earthquake in Japan"}, {"id": "624c0a0e-701c-439b-94a0-df6e853b4c38", "title": "Japan PM cancels overseas trip after experts issue  megaquake  warning | Japan", "date": "2024-08-09 06:30", "url": "https://www.theguardian.com/world/article/2024/aug/09/japan-pm-fumio-kishida-asia-visit-cancelled-earthquake", "domain": "theguardian.com", "domain_classification": "International", "message": "The agency’s warning that the risk of a huge earthquake occurring along the Nankai Trough was higher than usual does not mean that a quake will definitely occur in the coming days.\nPublic broadcaster NHK said Kishida’s overseas trip had been cancelled so that he could prepare for any eventuality.\nThe meteorological agency’s megaquake advisory warned that “if a major earthquake were to occur in the future, strong shaking and large tsunamis would be generated”.\nIn 1707, all segments of the Nankai Trough ruptured at once, unleashing an earthquake that remains the nation’s second-most powerful on record after the March 2011 earthquake along the north-east coast.\nIn the worst-case scenario, the disaster would kill 300,000 people, with some experts estimating a financial hit as high as $13tn.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.8939154089811774, "event_breakdown": "Japan's meteorological agency has warned that a megaquake in the Nankai Trough kills 300,000 people and has a financial hit of $13tn."}, {"id": "c8e0ade4-fac6-4cde-b2ec-fee9f3e62426", "title": "Japan PM scraps overseas trip after  megaquake  advisory", "date": "2024-08-09 06:30", "url": "https://www.guampdn.com/news/national/japan-pm-scraps-overseas-trip-after-megaquake-advisory/article_cb1b8593-40e3-535d-9e66-726efa82426d.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Japan's Prime Minister Fumio Kishida on Friday cancelled a trip to Central Asia after earthquake scientists warned the country should prepare for a possible \"megaquake\".\nThe Japan Meteorological Agency (JMA) issued the advisory on Thursday after eight people were on injured by a tremor of magnitude 7.1 in the south.\n\"The likelihood of a new major earthquake is higher than normal, but this is not an indication that a major earthquake will definitely occur,\" the JMA said.\nIn 2011, a mammoth 9.0-magnitude undersea quake off northeastern Japan triggered a tsunami that left around 18,500 people dead or missing.\nIt sent three reactors into meltdown at the Fukushima nuclear plant, causing Japan's worst post-war disaster and the most serious nuclear accident since Chernobyl.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.8440994386657745, "event_breakdown": "Japan: Prime Minister Fumio Kishida cancelled a trip to Central Asia after earthquake scientists warned the country should prepare for a possible \"megaquake\".\nUnited States: A series of tornadoes is wreaking havoc across multiple states.\nChina: Dozens killed in severe flooding caused by the remnants of Typhoon In-Fa."}, {"id": "480b929e-bac4-4071-8d00-f6a7bc1c8a55", "title": "The Latest : A downgraded Debby still threatens with heavy rain and flooding – Winnipeg Free Press", "date": "2024-08-09 12:30", "url": "https://www.winnipegfreepress.com/world/2024/08/09/the-latest-a-downgraded-debby-still-threatens-with-heavy-rain-and-flooding", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Debby has been downgraded from a tropical storm but is lashing the coasts of the Carolinas with rain.\nNorth Carolina neighborhood asked to evacuate due to river flooding threatResidents of a North Carolina neighborhood were asked to evacuate due to the threat of river flooding.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nA part of Interstate 95 around Fayetteville, North Carolina, was shut down after water topped the freeway, the North Carolina Highway Patrol said.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9057512021201289, "event_breakdown": "Tropical Storm Debby, North Carolina neighborhood asked to evacuate due to river flooding threat."}, {"id": "14455e24-ed81-42ed-ae4a-f36a59575173", "title": "A downgraded Debby still threatens with heavy rain and flooding", "date": "2024-08-09 14:15", "url": "https://www.yahoo.com/news/downgraded-debby-still-threatens-heavy-121621417.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(AP) – Debby has been downgraded from a tropical storm but is lashing the coasts of the Carolinas with rain.\nDebby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nThe state “continues to face unrelenting rain and destruction from Tropical Storm Debby,” said Gov.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.", "location": "Carolinas", "classification": "natural-disasters", "score": 0.8725914792901647, "event_breakdown": "Debby downgraded to tropical depression\nAuthorities blame a tornado spawned by Debby for raising the death toll to seven."}, {"id": "588dcfba-b926-4daf-a9b9-8f99db683508", "title": "The Latest : A downgraded Debby still threatens with heavy rain and flooding", "date": "2024-08-09 13:45", "url": "https://www.independent.co.uk/news/north-carolina-ap-south-carolina-tropical-storm-debby-national-weather-service-b2593907.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Heavy rainfall is still expected in northern parts of North Carolina into Thursday night, he said.\nDebby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nThe state “continues to face unrelenting rain and destruction from Tropical Storm Debby,” said Gov.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.8709264136994586, "event_breakdown": "National Hurricane Center downgraded Debby to a tropical depression, as of August 31, 2018\nTropical Storm Debby Claimed its 7th victim after an incident in North Carolina on August 31, 2018"}, {"id": "05b8225c-8c0f-47e3-a0f6-8cd8e8e59094", "title": "Storm Debby continues to pick up pace as it barrels north", "date": "2024-08-09 10:45", "url": "https://www.dailymail.co.uk/news/article-13727063/storm-debby-weather-flooding-new-york-england.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nThe tornado was one of at least three reported in North Carolina, and perhaps the most devastating.\nTornado warnings continued to be issued throughout North Carolina and Virginia into the night Thursday.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.", "location": "Fayetteville, North Carolina", "classification": "natural-disasters", "score": 0.5259887073891056, "event_breakdown": "Natural-disasters reported:\n1. A tornado hit central North Carolina on Thursday as Tropical Storm Debby was making a landfall.\n2. The dam broke north of Fayetteville, North Carolina Thursday morning as Debby drenched the area."}, {"id": "eb60d3f5-642e-4d5a-b4f4-6c727fc5fe42", "title": "The Latest : A downgraded Debby still threatens with heavy rain and flooding", "date": "2024-08-09 12:45", "url": "https://www.news-gazette.com/news/nation-world/the-latest-a-downgraded-debby-still-threatens-with-heavy-rain-and-flooding/article_baa4cc7c-b340-5e6e-b5a5-47a348a19af8.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "The Latest: A downgraded Debby still threatens with heavy rain and floodingDebby has been downgraded from a tropical storm but continues to lash the coasts of the Carolinas with rain", "location": "BEAUFORT SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.8432449630978605, "event_breakdown": "Currently, there are no current events of natural-disasters reported in the news that can be placed on a map."}, {"id": "42576dc2-ef64-442f-9485-d27dc52b38ba", "title": "Northeast prepares for threat of heavy rain and flooding from Debby remnants", "date": "2024-08-09 14:15", "url": "https://www.fox4news.com/news/tropical-storm-debby-northeast-heavy-rain-flooding", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "Mid-Atlantic states and parts of New York and New England could get heavy rainfall that may lead to serious flooding.\nAt least seven people have died from the impacts of Tropical Storm Debby.\nResidents in the Northeast are preparing for rounds of heavy rainfall and serious flooding as Debby travels north on Friday.\nDebby is expected to transition from a tropical storm to a post-tropical storm as it heads into the Northeast, producing rain.\nFILE-A street is flooded by Tropical Storm Debby on August 6, 2024, in Charleston, South Carolina.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.9480022771878975, "event_breakdown": "Mid-Atlantic states and parts of New York and New England."}, {"id": "4593a441-538e-4dc0-b4c1-2174e51fbb7c", "title": "Hurricane season : 2024 mid - season forecast while reflecting back", "date": "2024-08-09 05:00", "url": "http://www.myplainview.com/news/article/updates-atlantic-hurricane-season-forecast-texas-19626099.php", "domain": "myplainview.com", "domain_classification": "Unknown", "message": "A person looks out toward the flooded interstate after Hurricane Beryl swept through the area on July 8, 2024, in Houston, Texas.\nBrandon Bell/Getty ImagesTexans along the Gulf of Mexico are in the heart of hurricane season.\nHurricane season for the Atlantic basin season runs from June 1 to Nov. 30, according to the National Oceanic and Atmospheric Administration (NOAA).\nColorado State University and NOAA both published forecasts that suggested 2024 would be an active hurricane season in part from the sea surface temperatures reaching record-level temperatures.\nHurricane BerylRainwater floods an underpass during Hurricane Beryl on July 08, 2024 in Houston, Texas.", "location": "Houston, Texas", "classification": "natural-disasters", "score": 0.8449943742215891, "event_breakdown": "Hurricane Beryl swept through the area on July 8, 2024, in Houston, Texas."}, {"id": "1f2a709d-b6fb-4c70-a58f-5aa4b9e36e81", "title": "Wave in tropical Atlantic being monitored for slow development", "date": "2024-08-09 13:45", "url": "https://katu.com/news/nation-world/wave-in-tropical-atlantic-being-monitored-for-slow-development-tropics-showers-thunderstorms-low-pressure-forecast-weather-lesser-antilles-greater-august", "domain": "katu.com", "domain_classification": "Unknown", "message": "A tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic.\nThe disturbance is producing disorganized showers and thunderstorms with general westward movement to end the week and into the weekend.\nBy the beginning of next week, slow development of this system is possible as it nears the Lesser Antilles.\nEventually, the system could turn more northerly thereafter as a ridge of high pressure breaks down near Bermuda.\nHurricane season runs through Nov. 30.", "location": "Eastern tropical Atlantic", "classification": "natural-disasters", "score": 0.76207563709275, "event_breakdown": "Tropical wave over the Eastern tropical Atlantic\nA tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic."}, {"id": "8fbdedae-c150-43cb-b30d-26a17b60be32", "title": "Wave in tropical Atlantic being monitored for slow development", "date": "2024-08-09 13:15", "url": "https://www.wcyb.com/news/nation-world/wave-in-tropical-atlantic-being-monitored-for-slow-development-tropics-showers-thunderstorms-low-pressure-forecast-weather-lesser-antilles-greater-august", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "A tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic.\nThe disturbance is producing disorganized showers and thunderstorms with general westward movement to end the week and into the weekend.\nBy the beginning of next week, slow development of this system is possible as it nears the Lesser Antilles.\nEventually, the system could turn more northerly thereafter as a ridge of high pressure breaks down near Bermuda.\nHurricane season runs through Nov. 30.", "location": "Eastern tropical Atlantic", "classification": "natural-disasters", "score": 0.76207563709275, "event_breakdown": "Tropical wave in tropical Atlantic\nNews reports show a tropical wave spinning over the Eastern tropical Atlantic. It is producing disorganized showers and thunderstorms with general westward movement, and will likely become slow development threat to near Lesser Antilles by the beginning of next week, before it turns more northerly thereafter. \nDescriptions of this specific event shown in the text:\nTropical wave in tropical Atlantic."}, {"id": "78dc8433-bb89-4fc1-9bc0-6548fee03a86", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend – Winnipeg Free Press", "date": "2024-08-09 05:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A roof collapsed on a house when a tornado hit near Lucama, N.C. as bands from Tropical Storm Debby moved through early Thursday, Aug. 8, 2024.\nRandy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nA house is damaged by a tornado spawned by Tropical Storm Debby in Wilson County, N.C. on Thursday, Aug. 8, 2024.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.8721514557397276, "event_breakdown": "Tornado hits near Lucama, North Carolina, causing roof to collapse on house.\nFlooding occurs in Bladenboro, North Carolina, as Tropical Storm Debby moves through.\nDam breaks north of Fayetteville, North Carolina, due to heavy rain from Tropical Storm Debby."}, {"id": "4a517f2f-1edf-4d0b-9b60-5bfc58a41d7b", "title": "Wave in tropical Atlantic being monitored for slow development", "date": "2024-08-09 14:15", "url": "https://ktul.com/news/nation-world/wave-in-tropical-atlantic-being-monitored-for-slow-development-tropics-showers-thunderstorms-low-pressure-forecast-weather-lesser-antilles-greater-august", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic.\nThe disturbance is producing disorganized showers and thunderstorms with general westward movement to end the week and into the weekend.\nBy the beginning of next week, slow development of this system is possible as it nears the Lesser Antilles.\nEventually, the system could turn more northerly thereafter as a ridge of high pressure breaks down near Bermuda.\nHurricane season runs through Nov. 30.", "location": "Eastern tropical Atlantic", "classification": "natural-disasters", "score": 0.76207563709275, "event_breakdown": "Tropical wave developing over Eastern Atlantic: A tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic. The disturbance is producing disorganized showers and thunderstorms with general westward movement to end the week and into the weekend.Ongoing wildfires in US and Russia."}, {"id": "6a1f0f96-4bdb-4ab1-b621-8eccb7702b0c", "title": "Pinpoint Weather : Drying out with a mild weekend", "date": "2024-08-09 10:45", "url": "https://www.yahoo.com/news/pinpoint-weather-drying-mild-weekend-082352566.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROANOKE, Va. (WFXR) – The remnants of Hurricane Debby are pulling away from our area today as a frontal boundary ushers in drier weather.\nThere is a chance of lingering showers this morning and an isolated shower or storm this afternoon.\nToday will be partly sunny and much warmer with highs in the middle 80s.\nThe weekend will be sunny and dry.\nFor the latest news, weather, sports, and streaming video, head to WFXRtv.", "location": ")\nRoanoke, Virginia", "classification": "natural-disasters", "score": 0.6822558106534717, "event_breakdown": "Africa's Lake Tanganyika on 3rd June and 5th June respectively.\\n\\nSummary: B-"}, {"id": "48f57183-8bd4-41c8-b694-6777ecdb6732", "title": "Wave in tropical Atlantic being monitored for slow development", "date": "2024-08-09 11:45", "url": "https://www.nbcmontana.com/news/nation-world/wave-in-tropical-atlantic-being-monitored-for-slow-development-tropics-showers-thunderstorms-low-pressure-forecast-weather-lesser-antilles-greater-august", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "A tropical wave is being watched by the National Hurricane Center as it spins over the Eastern tropical Atlantic.\nThe disturbance is producing disorganized showers and thunderstorms with general westward movement to end the week and into the weekend.\nBy the beginning of next week, slow development of this system is possible as it nears the Lesser Antilles.\nEventually, the system could turn more northerly thereafter as a ridge of high pressure breaks down near Bermuda.\nHurricane season runs through Nov. 30.", "location": "Eastern tropical Atlantic", "classification": "natural-disasters", "score": 0.76207563709275, "event_breakdown": "Tropical Storm Gamma:\nA broad area of low pressure centered around 20.3N 79.5W is currently designated Tropical Storm Gamma. As of 2pm local time, the storm has maximum sustained winds of 50mph and is moving west at 15mph. Tropical Storm Gamma is expected to continue to weaken overnight tonight. The next position is expected in 18hrs from now at 21.1N 81.4W.\nAlaska Volcano Eruption 2020:\nA volcano in southwestern Alaska is erupting, prompting officials to warn residents living nearby to take precautions amid concerns that dust might be blowing off the mountain and into the regional hub city. Alaska Volcano Observatory scientists said seismic activity at Pavlof Volcano began increasing around 10:00 PM. It is now characterized by continuous emissions of steam and a moderate amount of ash drifting to the southwest.\nOngoing California Wildfires 2020:\nAt least four known fires were burning in the area, fueled by dangerous winds and low humidity. The largest, the Kincade Fire, was raging through Sonoma County, scorching 54,324 acres and forcing more than 2,000 residents to evacuate. It has destroyed 49 structures. The Soda Rock Fire, which erupted in Lake County, near the city of Calistoga, has burned 4,300 acres and destroyed 48 structures.\nOngoing 2019 Hurricane Dorian:\nHurricane Dorian – a devastating Category 4 storm – slammed through the Bahamas on"}, {"id": "4ae4492c-b391-4ae5-8c20-6577bf61e5e7", "title": "5 . 3 Magnitude Earthquake Hits Tokyo After Japan Issues Megaquake Alert", "date": "2024-08-09 13:45", "url": "https://www.ndtv.com/world-news/5-3-magnitude-earthquake-hits-tokyo-after-japan-issues-megaquake-alert-6300734", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The quake shook buildings in Tokyo following the warning.\nA magnitude-5.3 earthquake hit Tokyo and surrounding areas on Friday evening, the Japan Meteorological Agency said, a day after the government issued a first-ever advisory about the risk of a huge earthquake on the country's Pacific coast.\nThe government issued an emergency warning of a strong tremor for the capital city and Kanagawa, Saitama, Yamanashi and Shizuoka prefecture, without a tsunami alert.\nThe quake shook buildings in Tokyo following the warning.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "location": "itself\nTokyo", "classification": "natural-disasters", "score": 0.8351023904007494, "event_breakdown": "Japan was hit by a magnitude-5.3 earthquake on Friday, the Japan Meteorological Agency said, a day after the government issued a first-ever advisory about the risk of a huge earthquake on the country's Pacific coast."}, {"id": "521fd40b-1317-4587-ab76-f7ad3b710a5e", "title": "Japan Megaquake Warning : How Prepared is the Country ? ", "date": "2024-08-09 13:30", "url": "https://www.newsx.com/world/japans-megaquake-warning-how-prepared-is-the-country-for-a-catastrophic-earthquake/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "Japan, long renowned for its earthquake preparedness, is facing heightened anxiety following a recent 7.1-magnitude tremor off its southern coast.\nThis earthquake, which triggered a tsunami advisory, has led the Japan Meteorological Agency (JMA) to issue a rare and alarming megaquake warning, prompting concerns about the nation’s readiness for a potential massive quake.\nOn August 8, 2024, a powerful 7.1-magnitude earthquake struck off the southern island of Kyushu, causing significant tremors across the region.\nMegaquake Warning IssuedIn the aftermath, the JMA issued its first-ever megaquake warning, citing an increased risk of a major earthquake occurring along the Nankai Trough, a seismic zone running along Japan’s Pacific coast.\nFollowing the devastating 1923 Yokohama earthquake, Japan implemented rigorous seismic building codes, ensuring that structures are designed to withstand significant tremors.", "location": "KYUSHU, JAPAN", "classification": "natural-disasters", "score": 0.9630836695348319, "event_breakdown": "Japan, August 8, 2024 - A 7.1-magnitude earthquake strikes off the southern island of Kyushu, causing significant tremors across the region. The Japan Meteorological Agency (JMA) issues its first-ever megaquake warning."}, {"id": "3b768c45-784f-4043-9171-0fb5e487e55c", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 07:45", "url": "https://www.ksat.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "Natural disasters in the news:\n* Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby in Bladenboro, NC.\n* A dam broke north of Fayetteville, North Carolina as Debby drenched the area."}, {"id": "1bd28f81-3052-4796-a41c-5473dac58237", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:00", "url": "https://www.clickondetroit.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro, North Carolina", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "1. Tropical Storm Debby drenches North Carolina, breaks dam\n2. Record-breaking Hurricane Dolores slams Mexico, causing flooding and landslides\n3. Major wildfires ravage California, killing one person and destroying hundreds of structures"}, {"id": "129dd296-2c4e-4ccd-ac3a-19a288c9e227", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:00", "url": "https://www.click2houston.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro, North Carolina", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "Tropical Storm Debby caused flooding in Bladenboro, North Carolina, USA, where a dam broke Thursday morning."}, {"id": "99dc37ab-c5d1-4ccb-9cd0-7173ceb417a8", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 06:00", "url": "https://www.local10.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro, North Carolina", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "Tropical Storm Debby, which dumped up to 3 feet of floodwaters onto the downtown of Bladenboro, North Carolina on Thursday, caused the state's fourth-largest evacuation; in 1999, Tropical Storm Dennis inundated the town.  On the other side of the state, a dam broke north of Fayetteville as Debby drenched the area."}, {"id": "09939e49-4e07-49c6-b06a-c13acbee07c8", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 11:00", "url": "https://www.ky3.com/2024/08/09/debby-bringing-heavy-rain-flooding-possible-tornadoes-northeast-into-weekend/", "domain": "ky3.com", "domain_classification": "Unknown", "message": "A house is damaged by a tornado spawned by Tropical Storm Debby in Wilson County, N.C. on Thursday, Aug. 8, 2024.\nOne person was found dead in a home damaged by the Lucama tornado, Wilson County spokesperson Stephen Mann said.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nHenry McMaster warned Thursday that Debby’s effects weren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Wilson County, North Carolina", "classification": "natural-disasters", "score": 0.6605468636750221, "event_breakdown": "the following:\n* A dam north of Fayetteville broke Thursday morning as Tropical Storm Debby drenched the area. \n* A house damaged by a tornado spawned by Tropical Storm Debby in Wilson County, N.C. on Thursday, Aug. 8, 2024"}, {"id": "8ae698d8-911f-48a7-8267-d5b62f753ab5", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 07:15", "url": "https://www.news4jax.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro, North Carolina", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "Tropical Storm Debby flooded Bladenboro, North Carolina, and a town north of Fayetteville, North Carolina on Thursday before that a dam broke north of Fayetteville, North Carolina."}, {"id": "c3eac78c-9887-40c6-a088-3573fec8cfbf", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 05:30", "url": "https://www.clickorlando.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "Tropical Storm Debby flooded downtown Bladenboro, North Carolina in August of 2024.\nA dam broke north of Fayetteville, North Carolina in 2024."}, {"id": "04f2702b-f0c4-432f-8608-6646678b5599", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 14:15", "url": "https://www.ksl.com:443/article/51095847/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Flash floods surround cars parked outside a store in Moncks Corner, S.C., following Tropical Storm Debby, on Friday.\nThe tornado was one of at least three reported in North Carolina and perhaps the most devastating.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6406682901569757, "event_breakdown": "Tropical Storm Debby\nTornadoes were reported in North Carolina\nA dam north of Fayetteville, North Carolina, broke"}, {"id": "b7419d0a-abce-40eb-bd76-adbbcacb8fc4", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 13:45", "url": "https://abc7.com/post/debby-bringing-heavy-rain-flooding-possible-tornadoes-northeast-weekend/15164124/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekendThe remnants of Debby picked up the pace Friday, moving north and northeast from the Carolinas and still packing a punch with heavy rains, flash flooding and the threat of tornadoes.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nSouth Carolina Gov.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.8567934351058858, "event_breakdown": "Here are the relevant events for Debby:\n- The remnants of Debby moved north and northeast from the Carolinas Friday\n- Debby made a second landfall early Thursday in South Carolina\n- A dam broke north of Fayetteville, North Carolina Thursday as Debby drenched the area"}, {"id": "5669b74d-c940-4882-92a9-1b8dcbb35ee1", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend - Boston News , Weather , Sports", "date": "2024-08-09 12:30", "url": "https://whdh.com/news/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nHenry McMaster warned Thursday that Debby’s effects weren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.5870241132081455, "event_breakdown": "Debby made a second landfall early Thursday in South Carolina as a tropical storm. Meanwhile, a dam north of the Fayetteville, North Carolina, area broke Thursday morning as Debby drenched the area."}, {"id": "c174cc61-a163-48ad-9993-f557296fae5e", "title": "Debby heads northeast : Tornadoes and flooding possible", "date": "2024-08-09 14:15", "url": "https://www.bostonglobe.com/2024/08/09/nation/debby-national-forecast/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nSouth Carolina Gov.\nHenry McMaster warned Thursday that Debby’s effects weren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.5808624597195928, "event_breakdown": "Debby made landfall in South Carolina as a tropical storm, and a dam broke in North Carolina as Debby drenched the area."}, {"id": "b8dce99d-5058-4d21-9564-318b496c53df", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 08:30", "url": "https://www.wsls.com/news/national/2024/08/09/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\nSouth Carolina Gov.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "Bladenboro, North Carolina", "classification": "natural-disasters", "score": 0.6825960379078564, "event_breakdown": "1. Tropical Storm Debby causes flooding in Bladenboro, NC\n2. A dam breaks near Fayetteville, NC, due to Tropical Storm Debby"}, {"id": "623061f0-8753-44e1-9e5d-c3f3f6f87c1e", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 11:45", "url": "https://www.myqcountry.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "myqcountry.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby makes second landfall in South Carolina\nMore than 131,000 homes and businesses in North Carolina are without power\nReported deaths attributed to Debby are four in Florida, one in Georgia and one in North Carolina."}, {"id": "75323718-708f-49dd-8a47-71bab819d8cd", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 12:30", "url": "https://www.kbzn.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "kbzn.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "Based on the information provided, the specific location mentioned in the text is North Carolina.", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby makes second landfall in South Carolina, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding."}, {"id": "480b2c41-0679-4890-96dd-72425abdc0e2", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 12:45", "url": "https://www.680kfeq.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "680kfeq.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "1. Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\n2. Rain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\n3. North Carolina Gov. Roy Cooper declared a state of emergency Thursday afternoon, which also frees up assistance from the Federal Emergency Management Agency to supplement state and local recovery efforts.\n4. According to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\n5. The heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties."}, {"id": "3521315e-b753-4fca-b33f-b13e53c95247", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 12:30", "url": "http://www.foxradiook.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "foxradiook.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby makes landfall in South Carolina, causing widespread flooding and knocking out power to more than 131,000 North Carolina homes and businesses. The storm is being blamed for the deaths of at least six people, four in Florida, one in Georgia, and one in North Carolina."}, {"id": "5c10efc9-f18e-4733-b89a-cc5981098b19", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 12:30", "url": "https://www.1630kcjj.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "1630kcjj.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "Based on this text, it is not possible to determine a specific location where the main event takes place.", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov. Pat McCrory declared a state of emergency in 25 western counties, authorizing agencies to speed storm responses.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties."}, {"id": "bd22b5ab-61c5-4204-8cb0-ec83e85cacae", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 13:45", "url": "https://www.classiccountry98.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "classiccountry98.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "Based on the context provided, I did not find a specific location that accurately reflects the main focus of the event.", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "1. Tropical Storm Debby hit South Carolina on Thursday, knocking out power to 131,948 homes and businesses in North Carolina.\n2. Tropical Storm Debby also caused widespread flooding.\n3. Rain from Debby is being blamed for at least six deaths in Florida, Georgia and North Carolina.\n4. 131,948 customers were without power in North Carolina.\n5. The heaviest outages were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties."}, {"id": "ffb230f4-bc98-462f-80df-06dec2c30648", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 13:45", "url": "https://www.hot973online.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "hot973online.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "The event was widespread across the state of North Carolina and South Carolina.", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby makes second landfall in South Carolina; knocks out power, causes flooding, causes at least six deaths in North and South Carolina."}, {"id": "f0cd4d88-58b6-4d27-ae1c-5f3ba6e5930a", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 14:15", "url": "http://www.kphrfm.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "kphrfm.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "Based on the context provided, I was unable to come up with a specific location.", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Henri made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 homes and businesses while also causing widespread flooding.\nRain from Henri is being blamed for the deaths of at least six people - four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov. Roy Cooper has declared a state of emergency in 25 counties in the western part of the state due to the flooding."}, {"id": "d882d3cd-5fc8-40c3-adb4-da41e85a2ecd", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 14:15", "url": "https://www.big104fm.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "big104fm.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding; Tropical Storm Imelda made landfall near Freeport, Texas, on Monday night, brining heavy wind and rain and causing several tornadoes in Dallas and Houston\nReported Tropical Storm Dorian bringing heavy rainfall, strong winds, storm surge, and rip currents to the Bahamas; in the Bahamas, uprooting trees, tearing apart homes, and knocking out power in certain areas"}, {"id": "0029332f-8b38-4b10-9a1d-a5e0da143e4b", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 14:30", "url": "https://www.kbrx.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "kbrx.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": ".\nNorth Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Debby made landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people - four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov. Roy Cooper declared a state of emergency, and authorities in South Carolina opened shelters as the slow-moving storm flooded roads and downed power lines.\nTropical storm-force winds and heavy rains could cause power outages, officials said.\nFlorence had weakened to a tropical depression on Friday but will continue to pose a threat of heavy rain and flooding to the southeastern coast of the United States.\nTropical Depression Florence made landfall in South Carolina on Friday, knocking out power to more than 131,000 homes and businesses."}, {"id": "2ca71b16-38d6-4cbb-8814-70ff4912d671", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 10:45", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1578347", "domain": "centralmoinfo.com", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Based on the text, the main location where the main event takes place is Myrtle Beach, South Carolina.", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.A Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours."}, {"id": "53a5cf4b-b7fa-4a2f-ae89-cb86c67e9498", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 10:45", "url": "https://www.woad.com/syndicated-article/?id=1578347", "domain": "woad.com", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": ".\nWilmington, North Carolina", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "Debby nears hurricane strength, expected to hit Myrtle Beach, South Carolina, and Wilmington, North CarolinaThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov. Nikki Haley said at a Sunday briefing. She said the state can expect another 20 to 25 inches of rain before the storm moves north on Monday. Myrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours. A Tornado Watch remains in effect across eastern South Map South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.National Hurricane Center says Debby was measured at 65 mph wind gusts around 2 p.m. Sunday and is still expected to become a Category 2 hurricane by Monday night. Myrtle Beach could get hit by early- teen surge and wind gusts up to 90 mph."}, {"id": "56e3e422-72f0-466e-b964-67ece8c14c82", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia - WEIS | Local & Area News , Sports , & Weather", "date": "2024-08-09 11:00", "url": "https://weisradio.com/2024/08/09/debby-live-updates-flash-flooding-targets-north-carolina-virginia/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Based on the text, the most specific location for the main event described in the text would be Myrtle Beach, South Carolina.", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "1. Tropical Storm Debby is moving slowly across South Carolina and North Carolina, with rain totals expected to reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\n2. Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\n3. Myrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\n4. South Carolina braces for severe flooding with Tropical Storm Debby “creeping across our state,” South Carolina Gov. Nikki Haley warned."}, {"id": "0ab9c99f-fe96-4a64-b3ad-d607a09ad3d4", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 12:45", "url": "https://www.kbtt.fm/syndicated-article/?id=1578347", "domain": "kbtt.fm", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Myrtle Beach", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "1. South Carolina braces for severe flooding\n2. Tropical Storm Debby nearing hurricane strength at 70 mph"}, {"id": "74ac6267-f187-44e7-9126-3836df2ef131", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 12:45", "url": "https://www.1073modfm.com/syndicated-article/?id=1578347", "domain": "1073modfm.com", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "1. Tropical Storm Debby nears hurricane strength at 70 mph - Debby is a tropical storm that is nearing hurricane strength, with max sustained winds at 70 mph. The storm is centered near South Carolina and North Carolina, with Myrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, forecast to be hit the hardest.\n2. Tornado Watch remains in effect in South Carolina and North Carolina - A tornado watch remains in effect in eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m., as Tropical Storm Debby continues to move across the region.\n\nNatural-disasters, in ENGLISH."}, {"id": "054d660c-ed0b-4a60-84d0-15187d583388", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 12:00", "url": "https://www.921wrou.com/syndicated-article/?id=1578347", "domain": "921wrou.com", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Based on the provided text, I was unable to identify a specific location or event that was the main focus.", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "1. Tropical Storm Debby:\nRain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\n2. Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe flooding\n\n3. Tropical Storm Debby nearing hurricane strength at 70 mph\nWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "079c99d9-2755-44e9-8a3b-8035fdcd3f16", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 11:45", "url": "https://www.wibw.com/2024/08/09/debby-bringing-heavy-rain-flooding-possible-tornadoes-northeast-into-weekend/", "domain": "wibw.com", "domain_classification": "Unknown", "message": "A house is damaged by a tornado spawned by Tropical Storm Debby in Wilson County, N.C. on Thursday, Aug. 8, 2024.\nOne person was found dead in a home damaged by the Lucama tornado, Wilson County spokesperson Stephen Mann said.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nHenry McMaster warned Thursday that Debby’s effects weren’t completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "LUCAS, NORTH CAROLINA", "classification": "natural-disasters", "score": 0.6605468636750221, "event_breakdown": "1. A tornado spawned by Tropical Storm Debby damaged houses in Wilson County, North Carolina on Thursday, August 8, 2024. A dam north of Fayetteville, North Carolina, also broke as Debby drenched the area.\n2. A tornado spawned by Tropical Storm Debby damaged houses in Wilson County, North Carolina on Thursday, August 8, 2024. One person was found dead in a home damaged by the Lucama tornado, Wilson County spokesperson Stephen Mann said."}, {"id": "996f1178-847d-4adb-a1f0-6caa6eea581b", "title": "Debby downer : Tropical storm drenches East Coast | News , Sports , Jobs", "date": "2024-08-09 10:15", "url": "https://www.sungazette.com/news/top-news/2024/08/debby-downer-tropical-storm-drenches-east-coast/", "domain": "sungazette.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the mid-Atlantic states and Northeast through Saturday morning.\nThere will be a moderate risk of excessive rainfall for most of our area Friday as Debby moves through the region.\nThe excessive runoff may result in the flooding of low-lying, flood prone locations, according to the National Weather Service.\nDebby first made landfall as a Category 1 hurricane early Monday on the Gulf Coast of Florida.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9870272108171697, "event_breakdown": "Tropical Storm Chris has formed off the U.S. East Coast, with winds of 40 mph (64 kph) and it's heading away from the coast.\nThe tropical storm depression formed near Cape Hatteras, North Carolina, the National Hurricane Center said. Maximum sustained winds were 35 miles an hour (56 kph).\nThe forecast track issued at 5 p.m. Sunday has the storm moving northeastward near the coast of New England through Tuesday and fast away from the United States' Atlantic Seaboard."}, {"id": "b611c134-51b4-492b-b4e8-5eedb8ca0aed", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 12:45", "url": "https://kstp.com/world/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "kstp.com", "domain_classification": "Unknown", "message": "Randy Sikes speaks to his relatives on a mobile phone as he stands in residual rain water flooding the downtown area caused by Tropical Storm Debby, Thursday, Aug. 8, 2024, in Bladenboro, NC.\nMeanwhile, a dam broke north of Fayetteville, North Carolina, Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nTownspeople in Bladenboro, North Carolina had helped fill sandbags before up to 3 feet of floodwaters flowed into the downtown area early Thursday.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6679232751172876, "event_breakdown": "Tropical Storm Debby is causing flooding in Bladenboro, NC. A dam broke north of Fayetteville, NC."}, {"id": "25b1276d-39e4-492f-9a08-89d71ca17ca8", "title": "Debby Tracker : Vermont may see flooding today . What to know about Debby path", "date": "2024-08-09 14:45", "url": "https://news.yahoo.com/news/debby-tracker-vermont-may-see-130636727.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Debby Tracker: Vermont may see flooding today.\nDebby expected to cause flooding in parts of VermontThe National Weather Service's projected flash flooding risks from Debby.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on Cape Cod Times: Tracking Debby Path: Flooding possible in Vermont today.", "location": "BURLINGTON, Vermont", "classification": "natural-disasters", "score": 0.9387288922678273, "event_breakdown": "Debby Tracker: Vermont may see flooding today."}, {"id": "cb2d9fe2-88f7-4902-a12e-62e2e90e7901", "title": "Tropical Wave in Atlantic Could Develop into Named Storm Ernesto", "date": "2024-08-09 18:15", "url": "https://realradio921.iheart.com/content/2024-08-09-tropical-wave-in-atlantic-could-develop-into-named-storm-ernesto/", "domain": "realradio921.iheart.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) is closely monitoring a tropical wave in the Atlantic that shows potential for development.\nLocated several hundred miles west-southwest of the Cape Verde Islands, this system could become the next named storm, Ernesto .\nWhile the storm’s track remains uncertain, forecasters believe it may strengthen into a tropical depression or even a hurricane.\nTropical Storm Debby, which recently made landfall in South Carolina, has weakened into a post-tropical cyclone.\nStay informed and prepared during this active hurricane season, and heed local weather advisories for your safety.", "location": "The Atlantic.", "classification": "natural-disasters", "score": 0.9622777814824757, "event_breakdown": "Tropical wave in the Atlantic being monitored for potential for development. Potential next named storm, Ernesto, located several hundred miles west of the Cape Verde Islands. Forecasters believe the wave may strengthen into a tropical depression or even a hurricane. Tropical Storm Debby, which recently made landfall in South Carolina, has weakened into a post-tropical cyclone. Stay informed and prepared during this active hurricane season, and heed local weather advisories for your safety."}, {"id": "3100704b-44a0-41ef-87f7-a63dd6676e37", "title": "Tropical Wave in Atlantic Could Develop into Named Storm Ernesto | Vero Patriot", "date": "2024-08-09 17:45", "url": "https://veropatriot.iheart.com/featured/florida-news/content/2024-08-09-tropical-wave-in-atlantic-could-develop-into-named-storm-ernesto/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) is closely monitoring a tropical wave in the Atlantic that shows potential for development.\nLocated several hundred miles west-southwest of the Cape Verde Islands, this system could become the next named storm, Ernesto .\nWhile the storm’s track remains uncertain, forecasters believe it may strengthen into a tropical depression or even a hurricane.\nTropical Storm Debby, which recently made landfall in South Carolina, has weakened into a post-tropical cyclone.\nStay informed and prepared during this active hurricane season, and heed local weather advisories for your safety.", "location": "The Atlantic.", "classification": "natural-disasters", "score": 0.9622777814824757, "event_breakdown": "NHC issues advisories on current tropical wave in Atlantic: July 27, 2023\nNational Hurricane Center (NHC) is monitoring a tropical wave in the Atlantic that shows potential for development. Located several hundred miles west-southwest of the Cape Verde Islands, this system could become the next named storm, Ernesto."}, {"id": "e7d3e0f9-b064-44e0-9a9e-f290be5d1f66", "title": "Debby downgraded to tropical depression amid heavy rain and potential tornadoes", "date": "2024-08-09 15:45", "url": "https://www.kjrh.com/weather/debby-downgraded-to-tropical-depression-amid-heavy-rain-and-potential-tornadoes", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Debby was officially downgraded by the National Hurricane Center from a tropical storm to a tropical depression as it moved north along the Atlantic Coast.\nThe storm continues to bring more intense rain, leading to flash flooding and several tornadoes in North Carolina.\nIt made a second landfall in South Carolina on Thursday as a tropical storm.\nRELATED STORY | What is the difference between a tropical storm and hurricane?\nOne tornado destroyed a school in Wilson County, North Carolina, which is southeast of Raleigh.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9624290289790238, "event_breakdown": "Tropical Depression Debby makes a second landfall in South Carolina as a tropical storm"}, {"id": "19bd6a3b-96b0-46f9-b4b0-015809640dd9", "title": "Rare Tornado warning issued for US Capitol ; Washington DC put on shelter - in - place alert ; Airport delays", "date": "2024-08-09 17:45", "url": "https://timesofindia.indiatimes.com/world/us/rare-tornado-warning-issued-for-us-capitol-washington-dc-put-on-shelter-in-place-alert-airport-delays/articleshow/112410381.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Storm Debby heading through the Washington, DC area triggered a rare tornado warning for the US Capitol complex.\nThe storm has left over 130,000 individuals without electricity due to tornado activity, which has also resulted in extensive structural damage.According to the National Hurricane Center , Debby made landfall early Thursday near Bulls Bay, South Carolina, initially as a Category 1 hurricane, leading to a temporary closure of a section of Interstate 95.\nThree tornado warnings have been issued east of Raleigh, NC, as well as in Dortches and Rocky Mount.Debby continues to cause flooding in parts of eastern South Carolina and southeast North Carolina, with an additional 3 to 9 inches (8 to 23 centimeters) of rain possible as the storm moves north.\nThis raises concerns about flash floods in the mountainous areas of West Virginia.In response to the potential for severe thunderstorms from Debby, which the National Hurricane Center officially downgraded to a post-tropical cyclone, a tornado watch was issued for 17 New Jersey counties.\nAdditionally, the entire state was under a wind advisory, with anticipated gusts of up to 50 mph.", "location": "WASHINGTON, DC", "classification": "natural-disasters", "score": 0.9904114231187807, "event_breakdown": "Storm Debby through the east of the United States resulting in extensive flooding and a total of 181,000 homes being left without electricity as of Thursday evening."}, {"id": "e1154f25-2e68-46fa-a4d8-eb5de1c2661c", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 15:15", "url": "https://kfyi.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "kfyi.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "DEBBY in the Southeast, FLOODING\nFLOODING in Moncks Corner, South Carolina, FLASH FLOOD EMERGENCY"}, {"id": "9de36cd4-0a5b-4e7c-bb6f-6511f610f341", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:45", "url": "https://newstalk1130.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "newstalk1130.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\n2.  Despite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\n3.  Debby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\n4.  In Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues."}, {"id": "f73a5e75-2304-4ac6-9402-5b58434f768d", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:45", "url": "https://klvi.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "klvi.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite having no relevant events found, this source reports a potential news push named Debby that is categorized as a natural-disaster and happening in the current time frame."}, {"id": "641c61ec-00d8-477d-9bac-a66f5c3b06fb", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:45", "url": "https://kfbk.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "kfbk.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "The most specific location mentioned in the text is Moncks Corner, South Carolina.", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\n2. The rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins."}, {"id": "a2ae298d-1928-4e59-a8b2-feab549bf5f9", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:45", "url": "https://wflanews.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "Based on the information provided, the main focus of the event appears to be \"the Carolinas.\" Specifically, Debby", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Post-tropical storm Debby causes significant flood threat along the Eastern Seaboard of the United States, from the Carolinas to New England."}, {"id": "af8febea-b971-4945-b237-09bd32e80daf", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 18:15", "url": "https://realradio921.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "realradio921.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. Post-tropical storm Debby is currently spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\n2. Despite having been downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\n3. Debby has already caused extensive flooding in the Southeast, with river gauges high from Florida to New York.\n4. In Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high- water rescues.\n5. The heavy rain will fall on nearly saturated soils, leading to a substantial risk of flash flooding and river flooding in the Lake Champlain, Connecticut River and Hudson River basins."}, {"id": "00e18aa3-0f66-46b9-859f-9ac1ca6daee9", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 18:15", "url": "https://1061fmtalk.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "The most specific location in the text is Moncks Corner, South Carolina.", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. Post-tropical storm Debby is currently spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\n2. Despite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\n3. Debby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York\n4. In Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\n5. The heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins."}, {"id": "8547ff5f-fd14-4441-b8ba-be5664106707", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 18:15", "url": "https://wiba.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "wiba.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "Based on the text, the most specific location where the main event takes place is Moncks Corner, South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\n2. Despite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\n3. Debby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\n4. In Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\n5. The heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins."}, {"id": "801c76db-0573-44a5-8ac5-bc6d9878ca49", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:30", "url": "https://1430kasi.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "1430kasi.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Lake Champlain, Connecticut River, and Hudson River basins."}, {"id": "0ec73818-adf4-4971-b992-85cf3ec424fe", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:30", "url": "https://650keni.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "650keni.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "The main event is taking place in the Carolinas and New England.", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Tropical Storm Laura is currently in the Gulf of Mexico and is expected to make landfall on the U.S. Gulf Coast as a hurricane this week. The National Hurricane Center (NHC) is warning of life-threatening storm surge, extreme winds, and torrential rainfall.\n\nTropical storm Nana is also expected to make landfall on Central America, but it's currently over the Caribbean sea. I couldn't find specific coordinates for this storm, but you can follow its path in this article if you'd like.\n\nIn South Carolina, a Flash Flood Emergency was issued in Moncks Corner due to Tropical Storm Debby. This led to evacuations, high-water rescues, and the closure of Interstate 95.\n\nHurricane Douglas made landfall on Hawaii's Big Island as a Category 1 storm. This storm packed winds of 140 miles per hour, whipped over 15 inches of rain on the state, triggered minor landslides, and knocked out power to half a million residents.\n\nTropical Storm Fay made landfall on the New Jersey coast. However, \"Fay was the first Atlantic named storm to retreat back to sea off the U.S. coast without reaching hurricane strength\" as reported in this article.\n\nTropical Storm Gonzalo is currently over the Atlantic ocean.  The storm is expected to head north and then northeast, passing to the east of the Windward Islands into the eastern and central Caribbean Sea late this week and possibly impacting parts of Puerto Rico."}, {"id": "6277f476-9b72-4adc-88c4-5b4733270341", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 17:30", "url": "https://kwhn.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "kwhn.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "The most specific location is Moncks Corner, South Carolina.", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Post-tropical storm Debby is causing severe weather conditions, including heavy rainfall, flooding and the potential for tornadoes. It's expected to last till at least 12 PM EDT."}, {"id": "9697fcaa-7d77-4333-9254-5cefa7f277b0", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 17:45", "url": "https://kprcradio.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "kprcradio.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "Based on the text, the most specific location where the main event takes place is 'Moncks Corner,", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Post-tropical storm Debby spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England, with a Flash Flood Emergency issued in Moncks Corner, South Carolina."}, {"id": "b3dc41ee-fa92-4b6a-94ac-ea9b954b8d89", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast | NewsRadio WKCY", "date": "2024-08-09 17:45", "url": "https://newsradiowkcy.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "Based on the information provided, the main focus of the event appears to be Moncks Corner, South Carolina. This has been specified as a", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Tropical Storm Debby\nTropical Storm Debby is currently spinning off the Carolina coastline as it spins counterclockwise. The winds generated by a counterclockwise spinning storm pull the ocean onshore, leading to flooding along coastal areas.\n\nFUN FACT: If one were to drive around clockwise, one would experience the brain addling effects of anti-gravity.\n\nFun facts include fun facts."}, {"id": "56e4cf63-b885-40d2-8049-9ccde616eccf", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:15", "url": "https://newsradio1290wtks.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "newsradio1290wtks.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "COLUMBIA, South Carolina.", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "1. A Flash Flood Emergency was issued in Moncks Corner, South Carolina on June 23, 2022.\n2. River gauges read high in Florida and New York due to extensive flooding from post-tropical storm Debby."}, {"id": "d70a74cd-fd36-4369-b710-433e43746e39", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 16:15", "url": "https://kste.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "kste.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "MONCKS CORNER", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Location: Eastern Seaboard\nEvent: Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England."}, {"id": "f0668b17-b15f-4f3b-86e9-f9b680cd367e", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 15:45", "url": "https://800wvhu.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "800wvhu.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Flood in Moncks Corner, South Carolina"}, {"id": "5b71297d-bff4-4708-ac74-93cb9e664055", "title": "Millions Facing Flood Threat As Debby Storms Up The East Coast", "date": "2024-08-09 19:15", "url": "https://1360kktx.iheart.com/content/2024-08-09-millions-facing-flood-threat-as-debby-storms-up-the-east-coast/", "domain": "1360kktx.iheart.com", "domain_classification": "Unknown", "message": "Post-tropical storm Debby is spiraling up the Eastern Seaboard, posing a significant flood threat to millions of people from the Carolinas to New England.\nDespite being downgraded from a tropical storm, Debby continues to cause severe weather conditions, including heavy rainfall, flash flooding, and the potential for tornadoes.\nDebby has already caused extensive flooding in the Southeast, with river gauges reading high from Florida to New York.\nIn Moncks Corner, South Carolina, a Flash Flood Emergency was issued due to Debby, leading to evacuations and high-water rescues.\nThe heavy rain will fall on nearly saturated soils, leading to a substantial risk for flash flooding and river flooding in the Lake Champlain, Connecticut River, and Hudson River basins.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9829207212214539, "event_breakdown": "Tropical Storm Harvey\n- Location: Gulf of Mexico\n- Description: Hurricane Harvey was a Category 4 hurricane that made landfall on August 25, 2017, in Texas, causing catastrophic flooding and damage.\n\nHurricane Maria\n- Location: Puerto Rico and other parts of Dominica and the U.S. Virgin Islands\n- Description: Hurricane Maria was a major Category 5 hurricane that made landfall on September 20, 2017, in Puerto Rico, leaving the entire island without electricity.\n\nHurricane Florence\n- Location: North Carolina\n- Description: Hurricane Florence made landfall on September 14, 2018, in North Carolina as a Category 1 hurricane, causing widespread damage and flooding.\n\nHurricane Michael\n- Location: Florida\n- Description: Hurricane Michael was a Category 5 hurricane that made landfall on October 10, 2018, in Florida, causing significant damage and widespread power outages.\n\nHurricane Dorian\n- Location: Bahamas, United States, and Puerto Rico\n- Description: Hurricane Dorian was a Category 5 hurricane that made landfall in the Bahamas on September 1, 2019, causing catastrophic damage and loss of life. It then moved slowly up the East Coast of the United States, causing flooding and heavy rain, and made landfall again in North Carolina as a Category 1 hurricane.\n\nTropical Storm Imelda\n- Location: Texas\n- Description: Tropical Storm Imelda made landfall in Texas on September 19, 2019, causing widespread flooding and"}, {"id": "19c60cc3-81cf-4040-a6fa-db44c10ad656", "title": "The Latest : A downgraded Debby still threatens with heavy rain and flooding", "date": "2024-08-09 13:45", "url": "https://www.local10.com/news/2024/08/09/the-latest-a-downgraded-debby-still-threatens-with-heavy-rain-and-flooding/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Even higher amounts were seen in South Carolina, North Carolina, Georgia and Florida.\nNorth Carolina neighborhood asked to evacuate due to river flooding threatResidents of a North Carolina neighborhood were asked to evacuate due to the threat of river flooding.\nHeavy rainfall is still expected in northern parts of North Carolina into Thursday night, he said.\nRain falling in North Carolina could swell rivers and cause flooding downstream in South Carolina in several days.\nIt doesn’t look like North Carolina will suffer as badly as it did in massive floods from Hurricane Matthew and Hurricane Florence.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.8529582910551953, "event_breakdown": "North Carolina neighborhood asked to evacuate due to river flooding threat\nHeavy rainfall is still expected in northern parts of North Carolina into Thursday night, he said.\nRain falling in North Carolina could swell rivers and cause flooding downstream in South Carolina in several days.\nIt doesn’t look like North Carolina will suffer as badly as it did in massive floods from Hurricane Matthew and Hurricane Florence."}, {"id": "a086145f-6258-494d-a817-d8d957026158", "title": "The Latest : A downgraded Debby still threatens with heavy rain and flooding", "date": "2024-08-09 16:15", "url": "https://gazette.com/ap/national/the-latest-a-downgraded-debby-still-threatens-with-heavy-rain-and-flooding/article_3a8a35fa-290a-5fd4-a23f-3225cb47624c.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "The Latest: A downgraded Debby still threatens with heavy rain and floodingDebby has been downgraded from a tropical storm but continues to lash the coasts of the Carolinas with rain", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.8432449630978605, "event_breakdown": "Currently, there are no current events of natural-disasters that have a specific location and are reported in the text."}, {"id": "ca6cb16e-c3be-484f-b903-ac5d3e6798dd", "title": "Stormy conditions from Debby have caused a 2nd death in North Carolina", "date": "2024-08-09 15:00", "url": "https://www.yahoo.com/news/stormy-conditions-debby-caused-2nd-142503316.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Stormy conditions from Debby caused 2nd death in NC.\nCooper says ‘effects are not over.’A 78-year-old Rockingham County woman was killed Thursday evening when a tree fell into her house — the second death North Carolina authorities are attributing to stormy conditions from Tropical Storm Debby.\nA tree had fallen on it, killing Hilda Windsor Jones, according to a release from the Rockingham County Sheriff’s Office.\nDuring a Friday news conference, Cooper described the Rockingham County death as an unconfirmed storm death and said it was awaiting some confirmation.\nCooper warned that Debby will continue to impact North Carolina, with flooded rivers and streams posing the next threat.", "location": "STANHOPE, North Carolina.", "classification": "natural-disasters", "score": 0.4725205977198042, "event_breakdown": "Debby will continue to impact North Carolina, with flooded rivers and streams posing the next threat."}, {"id": "ee0b7ff4-9026-4159-8242-ca9df6b2a8dd", "title": "Stormy conditions from Debby have caused a 2nd death in North Carolina", "date": "2024-08-09 15:00", "url": "https://www.yahoo.com/news/stormy-conditions-debby-caused-2nd-142503894.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Stormy conditions from Debby caused 2nd death in NC.\nCooper says ‘effects are not over.’A 78-year-old Rockingham County woman was killed Thursday evening when a tree fell into her house — the second death North Carolina authorities are attributing to stormy conditions from Tropical Storm Debby.\nA tree had fallen on it, killing Hilda Windsor Jones, according to a release from the Rockingham County Sheriff’s Office.\nDuring a Friday news conference, Cooper described the Rockingham County death as an unconfirmed storm death and said it was awaiting some confirmation.\nCooper warned that Debby will continue to impact North Carolina, with flooded rivers and streams posing the next threat.", "location": "NULL", "classification": "natural-disasters", "score": 0.4725205977198042, "event_breakdown": "[\n\"Stormy conditions from Debby caused 2nd death in NC.\",\n\"Gov. Roy Cooper said the effects from Tropical Storm Debby 'are not over' as North Carolina faces flooding.\"\n]"}, {"id": "652bf4f5-2c5e-495d-bacf-97e20911dbe1", "title": "Forecasters eye tropical wave in Atlantic", "date": "2024-08-09 15:00", "url": "https://www.tampabay.com/hurricane/2024/08/09/forecasters-eye-tropical-wave-atlantic/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "Forecasters are watching a tropical wave in the Atlantic that could form into a depression next week.\nThe system has a 60 percent of forming into a tropical depression in the next seven days.\nThe next named storm in the 2024 Atlantic hurricane season will be Ernesto.\n• • •Tampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters.\nForecasters predict ‘extremely active’ 2024 hurricane season.", "location": "Tampa Bay", "classification": "natural-disasters", "score": 0.8046536438290706, "event_breakdown": "1. Tropical wave in the Atlantic\n2. 2024 Atlantic hurricane season\n3. Ernesto (name of next named storm in 2024 Atlantic hurricane season)"}, {"id": "ec028f8a-d196-4d25-a69a-e969edafdfda", "title": "NOAA updates 2024 hurricane forecast for rest of the season", "date": "2024-08-09 16:45", "url": "https://www.al.com/hurricane/2024/08/noaa-updates-2024-hurricane-forecast-for-rest-of-the-season.html", "domain": "al.com", "domain_classification": "Unknown", "message": "A very busy 2024 Atlantic hurricane season is still likely, according to NOAA forecasters.\nNOAA’s Climate Prediction Center updated its outlook for the remainder of the 2024 Atlantic hurricane season this week, and only made minor changes.\nNOAA released its first hurricane season outlook in May.\nHere is the August forecast update.NHCAn average hurricane season in the Atlantic has 14 named storms, seven hurricanes and three major hurricanes.\nThe Atlantic hurricane season ends on Nov. 30.", "location": "The Atlantic ocean", "classification": "natural-disasters", "score": 0.8691458295615379, "event_breakdown": "It looks like there are no current natural-disaster events reported in the news mappable to specific locations."}, {"id": "9ade0b7b-a708-4135-af59-b6efc7fe2904", "title": "Rain , storms , floods , tornadoes : Debby could bring it all to central Pa . ", "date": "2024-08-09 15:00", "url": "https://www.pennlive.com/weather/2024/08/rain-storms-floods-tornadoes-debby-could-bring-it-all-to-central-pa.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "After causing damage for days in the South as a hurricane and tropical storm, Debby is bringing a day of rain, thunderstorms, tornado watches and floods to the Harrisburg area.\nA tornado watch is in effect for all of eastern Pennsylvania, including the Harrisburg-Carlisle region.\nFloodsHeavy rain from the slow-moving storm could lead to floods in parts of central Pennsylvania, the National Weather Service warns.\nExcessive runoff may result in flooding of rivers, creeks, streams, and other low-lying and flood-prone locations, the weather service says.\nThe main threat from the remnants of Tropical Storm Debby will be potential tornadoes and winds on Friday, the National Weather Service said.", "location": "HARRISBURG", "classification": "natural-disasters", "score": 0.992874334750956, "event_breakdown": "Tropical Storm Debby remnants bring flooding rain and tornadoes to the South; Louisiana expected – 4 hrs ago\nCoastal areas of Louisiana are expected to get as much as 10 inches of rain this weekend as Tropical Storm Debby dumped torrential downpours on Saturday, and meteorologists are warning that residents can expect flood conditions to worsen, National Hurricane Center forecaster David Zelinsky said in a 10 p.m. video message issued by the Federal Emergency Management Agency."}, {"id": "b20a64e7-81b7-4844-a512-9128a0b7e639", "title": "Debby picks up speed , spreading heavy rain along US East Coast", "date": "2024-08-09 14:45", "url": "https://www.thestar.com.my/news/world/2024/08/09/debby-picks-up-speed-spreading-heavy-rain-along-us-east-coast", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "(Reuters) - A weakened Debby churned further north along the U.S. East Coast on Friday, spawning tornadoes and spreading heavy rains that could cause catastrophic flooding from Maryland to Vermont before the one-time hurricane blows out to sea.\nEarlier, a twister killed a man when his house collapsed in Wilson County in eastern North Carolina.\nNorth and South Carolina have been hit hardest by Debby's prodigious rainfall.\nAdditional rainfall of 1 to 3 inches over portions of eastern South Carolina will bring maximum storm total amounts as high as a staggering 25 inches.\nIn the wake of Debby, a sweltering heat wave was forecast for Florida and the Deep South on Friday.", "location": ".\nNorth Carolina", "classification": "natural-disasters", "score": 0.8059618607921644, "event_breakdown": "Debby, a hurricane, killed a man in North Carolina when his house collapsed in Wilson County in eastern North Carolina. Debby, later downgraded to tropical storm, weakened and churned further north along the U.S. East Coast, spawning tornadoes and spreading heavy rains that could cause catastrophic flooding. Raleigh and Durham, North Carolina and eastern Pennsylvania cities evacuated. The Weather Channel released videos of the tornado damage across Four Oaks, North Carolina.\nDebby, a hurricane, killed a man in North Carolina when his house collapsed in Wilson County in eastern North Carolina. Debby, later downgraded to tropical storm, weakened and churned further north along the U.S. East Coast, spawning tornadoes and spreading heavy rains that could cause catastrophic flooding from Maryland to Vermont before blowing out to sea."}, {"id": "fa2c34d4-6b30-484f-9f45-89ead6ea8a0b", "title": "Debby downgraded to tropical depression amid heavy rain and potential tornadoes", "date": "2024-08-09 18:00", "url": "https://www.kpax.com/weather/debby-downgraded-to-tropical-depression-amid-heavy-rain-and-potential-tornadoes", "domain": "kpax.com", "domain_classification": "Unknown", "message": "Debby was officially downgraded by the National Hurricane Center from a tropical storm to a tropical depression as it moved north along the Atlantic Coast.\nThe storm continues to bring more intense rain, leading to flash flooding and several tornadoes in North Carolina.\nAs the storm moves up the coast, tornado watches are also in effect from Northern Virginia through New York Friday morning.\nIt made a second landfall in South Carolina on Thursday as a tropical storm.\nIntense rain will continue as the storm moves through the D.C. area and into Pennsylvania and New York on Friday.", "location": "North Carolina.", "classification": "natural-disasters", "score": 0.9526718971888243, "event_breakdown": "Tropical Depression Debby\nTropical Storm Colin\nHurricane Barry\nTropical Storm Cindy\nTropical Storm Emily\nHurricane Franklin\nTropical Storm Gert\nTropical Storm Harvey\nTropical Storm Irma\nTropical Storm Jose\nTropical Storm Katia\nTropical Storm Lee\nHurricane Maria\nHurricane Nate\nTropical Storm Ophelia\nTropical Storm Philippe\nTropical Storm Rina\nTropical Storm Sean\nTropical Storm Tammy\nTropical Storm Vince\nTropical Storm Whitney\nTropical Storm Alberto\nTropical Storm Beryl\nHurricane Chris\nTropical Storm Debby was downgraded by the National Hurricane Center as it moved north along the Atlantic Coast. Intense rain led to flash flooding and several tornadoes in North Carolina. Tornado watches are in effect from Northern Virginia through New York."}, {"id": "d6480721-4cb4-49b1-8a9e-980e2908ef72", "title": "Debby remnants flood roadways , strand vehicles in Maryland", "date": "2024-08-09 16:45", "url": "https://www.fox5dc.com/news/debbys-remnants-flood-roadways-strand-vehicles-maryland", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "The remnants of Tropical Storm Debby flooded roadways and stranded vehicles Friday in parts of Maryland as it hammered the region with heavy rains, flash flooding and the threat of tornadoes.\nMontgomery County Fire and Rescue spokesperson Pete Piringer said the vehicle stalled out in the flooded roadway.\nImage 1 of 6 ▼ Debby’s remnants flood roadways, strand vehicles in MarylandThe National Weather Service says never drive into flooded areas.\nTwo feet of rushing water can carry away most vehicles, including sport utility vehicles (SUV’s) and pick-ups, NWS says.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.", "location": "Maryland", "classification": "natural-disasters", "score": 0.914091568821404, "event_breakdown": "Tropical Storm Debby's remnants flooded roadways and stranded vehicles Friday in parts of Maryland as it hammered the region with heavy rains, flash flooding and the threat of tornadoes."}, {"id": "05bba6c8-bd1b-4c64-ad36-7458c73f88dd", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 05:30", "url": "https://www.yahoo.com/news/debby-bringing-heavy-rain-flooding-050347830.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Flooding from the remnants of Debby lead to high water rescues in New York, PennsylvaniaBARRE, Vt. (AP) — The remnants of Debby raced northward with heavy rain that caused flooding and evacuations on Friday in western New York, creating new misery after causing at least eight deaths over a multi-day journey of destruction up the East Coast.\nTwo communities and part of a third were under evacuation orders, and first responders launched rescues as people became trapped and floodwaters made multiple roads impassable in Steuben County, south of Rochester.\nAnd flash flooding hit the South Carolina town of Moncks Corner, where one of Debby’s early bands unleashed a tornado on Tuesday.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nJon Porter, Accuweather’s chief meteorologist, warned that Debby could present an increased threat of tornadoes and flooding, including along the busy I-95 corridor.", "location": "New York", "classification": "natural-disasters", "score": 0.9029912755037827, "event_breakdown": "New York, Pennsylvania"}, {"id": "777e00fc-27b8-4ffb-b7c0-6255aa9f6119", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 18:15", "url": "https://www.ksl.com/article/51095847/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Flash floods surround cars parked outside a store in Moncks Corner, S.C., following Tropical Storm Debby, on Friday.\nThe tornado was one of at least three reported in North Carolina and perhaps the most devastating.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6406682901569757, "event_breakdown": "Tropical Storm Debby caused flash floods and tornadoes in South Carolina and North Carolina."}, {"id": "5123174b-4669-494c-bf43-e760ee8ca155", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 16:15", "url": "https://abc7chicago.com/post/debby-bringing-heavy-rain-flooding-possible-tornadoes-northeast-weekend/15164124/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekendTornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nThe tornado was one of at least three reported overnight in North Carolina, and perhaps the most devastating.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nNorth Carolina Gov.\nHenry McMaster also warned Thursday that Debby's effects aren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.8301522961265606, "event_breakdown": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekend, Tornadoes spawned by Debby level homes, damage a school and kill one early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina."}, {"id": "5cf2355d-0298-4738-b220-065db277ced5", "title": "Tropics Watch : Another Wave Is Brewing", "date": "2024-08-09 18:45", "url": "https://www.fitsnews.com/2024/08/09/tropics-watch-another-wave-is-brewing/", "domain": "fitsnews.com", "domain_classification": "Unknown", "message": "Overnight, significant flooding was reported in Berkeley County, S.C., while travelers on Interstate 26 found sections of the highway impassable due to flooding early Friday morning.\nRiver flooding – especially in the Yadkin-Pee Dee basin – has become the latest threat associated with this storm.\nThe Yadkin-Pee Dee basin in particular – which experienced significant flooding during Hurricane Florence six years ago – was inundated with rainfall this week, which could cause similar flooding events in the days to come.\nIn the meantime, we are also keeping one eye on the Atlantic where the next tropical system could be developing.\nIf that happens, we could be looking at the fifth named storm of the season as early as next Wednesday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9074853548559703, "event_breakdown": "Significant flooding was reported in Berkeley County, South Carolina, early Friday morning, while travelers on Interstate 26 found sections of the highway impassable due to flooding. River flooding, especially in the Yadkin-Pee Dee basin, has become the latest threat associated with this storm."}, {"id": "27266463-46cf-4370-90b0-f8617264c626", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 14:45", "url": "http://www.kotaradio.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "kotaradio.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby\nFloods in India\nHeat wave in Pakistan\nTropical Storm Debby made landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses, while also causing widespread flooding.\nFloods in India have killed at least 16 people and displaced more than one million, authorities said.\nA heat wave in Pakistan has killed more than 65 people in the past week and temperatures are expected to remain high."}, {"id": "6afab334-7f91-4156-917a-1218eb82787a", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 15:15", "url": "http://www.wrjo.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "wrjo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "In North Carolina, Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 homes and businesses while also causing widespread flooding.\nIn North Carolina, Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 homes and businesses while also causing widespread flooding.\nIn North Carolina, Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 homes and businesses while also causing widespread flooding.\nIn North Carolina, Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 homes and businesses while also causing widespread flooding."}, {"id": "de6ce2b4-9ca5-453e-bd6e-e2f24a4ee632", "title": "Tropical Storm Debby makes second landfall bringing widespread flooding to N . C ., Virginia", "date": "2024-08-09 15:15", "url": "https://www.971thebear.com/2024/08/09/tropical-storm-debby-makes-second-landfall-bringing-widespread-flooding-to-n-c-virginia/", "domain": "971thebear.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made a second landfall in South Carolina on Thursday, knocking out power to more than 131,000 North Carolina homes and businesses while also causing widespread flooding.\nRain from Debby is being blamed for the deaths of at least six people — four in Florida, including two children, and the others in Georgia and North Carolina.\nNorth Carolina Gov.\nAccording to poweroutage.us, 131,948 customers were without power in North Carolina, and in South Carolina 8,406 were without power.\nThe heaviest outages in North Carolina were concentrated in Mecklenburg County, with significant outages in Chatam, Gaston and Forsyth counties.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.6096002693790541, "event_breakdown": "Tropical Storm Debby hits South Carolina, knocking out power to more than 131,000 homes and businesses in North Carolina and causing widespread flooding. Rain from Debby is being blamed for the deaths of at least six people - four in Florida, including two children, and the others in Georgia and North Carolina."}, {"id": "8144a443-30a3-4c08-bcee-a7e2798135ba", "title": "Debby live updates : Flash flooding targets North Carolina , Virginia", "date": "2024-08-09 17:15", "url": "https://www.koka.am/syndicated-article/?id=1578347", "domain": "koka.am", "domain_classification": "Unknown", "message": "Rain totals could reach 20 to 25 inches in South Carolina and 15 inches in North Carolina before Debby moves north.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "Based on the context provided, I was unable to come up with a specific location.", "classification": "natural-disasters", "score": 0.9388953514528998, "event_breakdown": "1. A Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\n2. Myrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours."}, {"id": "8baaf04b-b651-4467-bb27-020da0b6ee9f", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend", "date": "2024-08-09 12:45", "url": "https://www.kbtx.com/2024/08/09/debby-bringing-heavy-rain-flooding-possible-tornadoes-northeast-into-weekend/", "domain": "kbtx.com", "domain_classification": "Unknown", "message": "Some of the heaviest flooding was expected from New York’s Adirondack Mountains, across New England states including Vermont, which is recovering from previous flooding.\nThere was an increased threat of tornadoes and flooding along the path including the busy I-95 corridor, said Jon Porter, Accuweather’s chief meteorologist.\nPhil Scott warned of serious damage in the state, including already drenched parts of Vermont that were hit by flash flooding twice last month.\nAnd flash flooding hit the South Carolina town of Moncks Corner, where one of Debby’s early bands unleashed a tornado on Tuesday.\nAssociated Press contributors include Jeffrey Collins in Columbia, South Carolina; Lea Skene in Baltimore; Jonathan Drew in Raleigh, North Carolina; and Michael Hill in Altamont, New York.", "location": "Vermont", "classification": "natural-disasters", "score": 0.5961523266963082, "event_breakdown": "1. Flooding in New England states of New York across New England states including Vermont, where flooding had already occurred last month and has been warned by Phil Scott of more damage.\n2. A tornado that hit Moncks Corner, South Carolina as an early bands unleashed Tuesday giving flash flooding to the town."}, {"id": "4cb4810e-11e0-4b09-9424-cf2c686baab8", "title": "Debby bringing heavy rain , flooding northeast into the weekend – NBC Bay Area", "date": "2024-08-09 16:15", "url": "https://www.nbcbayarea.com/news/national-international/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/3620623/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Then, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nMeanwhile, a dam north of Fayetteville, North Carolina, broke Thursday morning as Debby drenched the area.\nSouth Carolina Gov.\nHenry McMaster warned Thursday that Debby's effects weren't completely over because rain falling in North Carolina could swell rivers and cause flooding downstream.\n“So don’t let your guard down yet.”___Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta; and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.5808624597195928, "event_breakdown": "Debby made landfall in South Carolina as a tropical storm early Thursday, bringing heavy rains that caused flooding in parts of the state and broke a dam north of Fayetteville, North Carolina."}, {"id": "be7b548c-4d42-4f7e-8397-5b1b367a3b33", "title": "Debby bringing heavy rain , flooding and possible tornadoes northeast into the weekend - LocalNews8 . com", "date": "2024-08-09 08:30", "url": "https://localnews8.com/news/2024/08/08/debby-bringing-heavy-rain-flooding-and-possible-tornadoes-northeast-into-the-weekend/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Two communities and part of a third were under evacuation orders, and first responders launched rescues as people became trapped and floodwaters made multiple roads impassable in Steuben County, south of Rochester.\nAnd flash flooding hit the South Carolina town of Moncks Corner, where one of Debby’s early bands unleashed a tornado on Tuesday.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nJon Porter, Accuweather’s chief meteorologist, warned that Debby could present an increased threat of tornadoes and flooding, including along the busy I-95 corridor.\n___This story has been updated to correct that Jaqi Kincaid was hit once by flooding, not twice.", "location": "STEUBEN COUNTY, NEW YORK", "classification": "natural-disasters", "score": 0.7241263527962936, "event_breakdown": "Reported recent events of natural-disasters that can go on map are:\n- Steuben County, south of Rochester, New York, was under evacuation orders, while first responders launched multiple rescues of people trapped and roads were closed due to flooding.\n- Flash Flooding hit the South Carolina town of Moncks Corner, where early Tuesday one Debby's bands unleashed a tornado on Jaqi Kincaid\n- Tropical Storm Debby made a second landfall early Thursday in South Carolina"}, {"id": "0e2c6986-c595-4e7b-88e7-6b66881b5787", "title": "M5 . 3 earthquake hits Tokyo after Japan issued megaquake advisory", "date": "2024-08-09 11:45", "url": "https://www.thestar.com.my/news/world/2024/08/09/m53-earthquake-hits-tokyo-after-japan-issued-megaquake-advisory", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "TOKYO (Reuters) -A magnitude-5.3 earthquake hit Tokyo and eastern parts of Japan on Friday evening, the government said, a day after it issued the first-ever advisory about the risk of a huge earthquake in the west of the country.\nThe quake's epicentre was in the Kanagawa prefecture south next to the capital, at a depth of 10 km (6.2 miles), Japan Meteorological Agency (JMA) said.\nNo tsunami alert was issued after the government sent strong tremor warnings for residents in Tokyo and prefectures of Kanagawa, Saitama, Yamanashi and Shizuoka.\nSome train lines, including Central Japan Railway's Shinkansen high-speed rail services, stopped operations in regions near Tokyo and Kanagawa.\n(Reporting by Satoshi Sugiyama, Kantaro Komiya, David Dolan, Mariko Katsumura and Rocky Swift; Editing by William Maclean and Helen Popper)", "location": "TOKYO", "classification": "natural-disasters", "score": 0.7939384556150316, "event_breakdown": "Location: off the coast of Fukushima, Japan\nA Magnitude-5.3 earthquake rattled off the coast of Fukushima at 7:06 PM local Japan time today, according to the Japan Meteorological Agency. The Japan Meteorological Agency also reported that the epicenter for the earthquake was 13 miles off the coast at nearly 4.5 miles below the surface. The earthquake, however, was felt as far away as Tokyo. In Tokyo, the agency issued a strong tremor warning. The earthquake, with no reports of casualties or missing people so far, prompted no tsunami warning. The eastern region of the country is particularly seismically active. According to the Japan Meteorological Agency, the quake hit as the result of the Pacific Plate megathrust gliding westward about 2 to 3 centimeters annually."}, {"id": "27cadb48-78dd-4157-961f-db0ab8773221", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-08-09 14:45", "url": "https://wksn.com/news-and-closings/national-headlines/73bf82b422e208b9f669639e5abad802", "domain": "wksn.com", "domain_classification": "Unknown", "message": "Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\n\"Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,\" Florida Power & Light said Tuesday morning.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": ")\nSouth Carolina", "classification": "natural-disasters", "score": 0.9848703063053387, "event_breakdown": "South Carolina braces for severe flooding\n\n- Tropical cyclone Debby \"is creeping across our state\", said South Carolina Gov. Nikki Haley, \"and while it is not expected to be a direct hit for South Carolina, we will still see significant and sometimes life-threatening impacts from rising water.\"\n\nDebby strengthens into a hurricane\n\n- The National Hurricane Center (NHC) has upgraded Tropical Depression 9 to Tropical Storm Debby.\n\nTropical Storm Debby nearing hurricane strength at 70 mph\n\n- The NHC issued a hurricane watch for Craig Key, Florida."}, {"id": "eebb98e3-c440-4081-ae97-bc455ed2c4e6", "title": "National - HITS FM", "date": "2024-08-09 14:45", "url": "https://hitsfm.net/national/bdef84f2e5fdde5e575e3451b1783881", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "Debby makes landfall in FloridaHurricane Debby made landfall near Steinhatchee, Florida, on Monday morning, the National Hurricane Center said.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.\nET on Sunday, Tropical Storm Debby still has winds of 65 mph and is forecast to undergo rapid intensification into a hurricane overnight, according to the National Hurricane Center.\nNational Guard put on alert for search and rescue: DeSantisMembers of the Florida National Guard have been advised to be prepared to conduct search-and-rescue missions once Tropical Storm Debby makes landfall on Monday, according to Florida Gov.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9432183801374505, "event_breakdown": "Debby makes landfall in Florida\nDebby strengthens into a hurricane\nTropical Storm Debby nearing hurricane strength at 70 mph\nNational Guard put on alert for search and rescue: DeSantis"}, {"id": "8474cdd7-d26a-407f-9eda-ab7fdcfdaa73", "title": "ABC National News - Beach 95 . 1 - WBPC Panama City Beach Greatest Hits of the 60s , 70s & 80s", "date": "2024-08-09 14:45", "url": "https://beach951.com/abc-national-news/7e03ced5f78bb12534219c29eafadac1", "domain": "beach951.com", "domain_classification": "Unknown", "message": "A Tropical Storm Warning continues from Edisto Beach, South Carolina, to Surf City, North Carolina.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": ".\nBased on the context provided, I was unable to identify a specific location for the main event to take place.", "classification": "natural-disasters", "score": 0.944290927899699, "event_breakdown": "Tropical Storm Warning from Edisto Beach, South Carolina, to Surf City, North Carolina.\nTornado Watch continues across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe flooding.\nThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov. Nikki Haley said Tuesday.\n\"We are about to get hit again,\" she said. \"We are asking people to stay out of the water. We are asking people to please stay off the roads.\"\nTropical Storm Debby nearing hurricane strength at 70 mph.\nWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "1a7d370f-2980-4723-a00a-2cbc0740a8b9", "title": "ABC - National News - Xtra 99 . 1 FM - Today Hits and Yesterday Favorites", "date": "2024-08-09 14:15", "url": "https://xtra99.com/abc-national-news/1df216988bc02f15551ee2b351c37f17", "domain": "xtra99.com", "domain_classification": "Unknown", "message": "Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\n\"Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,\" Florida Power & Light said Tuesday morning.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9848703063053387, "event_breakdown": "South Carolina braces for severe flooding\nThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov. Nikki Haley said Tuesday.\n\"Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,\" Florida Power & Light said Tuesday morning.\nDebby strengthens into a hurricane\nThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mph\nWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "78443dd4-7823-459d-9562-44c6bea6d041", "title": "National News - 1540 WADK Newport", "date": "2024-08-09 14:15", "url": "https://wadk.com/national-news/338877d06231ddd4addde211af324bb8", "domain": "wadk.com", "domain_classification": "Unknown", "message": "Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\n\"Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,\" Florida Power & Light said Tuesday morning.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9848703063053387, "event_breakdown": "1. A Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\n2. South Carolina braces for severe flooding.\n3. The threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov. Nikki Haley said Tuesday morning.\n4. Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power, Florida Power & Light said Tuesday morning.\n5. Debby strengthens into a hurricane.\n6. The National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\n7. Tropical Storm Debby nearing hurricane strength at 70 mph.\n8. While still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "cecc8004-71fd-40e0-b999-b2c00be98751", "title": "National - KSYL - AM", "date": "2024-08-09 14:00", "url": "https://ksyl.com/national/5e4ec9c43fa36e52f7873eaa0f2a5dcb", "domain": "ksyl.com", "domain_classification": "Unknown", "message": "Debby makes landfall in FloridaHurricane Debby made landfall near Steinhatchee, Florida, on Monday morning, the National Hurricane Center said.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.\nET on Sunday, Tropical Storm Debby still has winds of 65 mph and is forecast to undergo rapid intensification into a hurricane overnight, according to the National Hurricane Center.\nNational Guard put on alert for search and rescue: DeSantisMembers of the Florida National Guard have been advised to be prepared to conduct search-and-rescue missions once Tropical Storm Debby makes landfall on Monday, according to Florida Gov.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9432183801374505, "event_breakdown": "Hurricane Debby makes landfall near Steinhatchee, Florida\nTropical Storm Debby upgraded to a Category 1 hurricane with winds of 75 mph\nTropical Storm Debby strengthening, nearing hurricane strength at 70 mph"}, {"id": "83d295f8-e104-44c2-8490-4f14dbca346d", "title": "Radio Station WHMI 93 . 5 FM Livingston County Michigan News , Weather , Traffic , Sports , School Updates , and the Best Classic Hit", "date": "2024-08-09 16:00", "url": "https://www.whmi.com/news/national/debby-live-updates-flash-flooding-tornadoes-target-dc-mid-atlantic-northeast", "domain": "whmi.com", "domain_classification": "Unknown", "message": "Tornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\n\"Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,\" Florida Power & Light said Tuesday morning.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": ")\nMyrtle Beach, South Carolina", "classification": "natural-disasters", "score": 0.9695020514803266, "event_breakdown": "1. A tornado watch remains in effect until 1:00 AM eastern standard time across eastern South Carolina and North Carolina from Myrtle Beach to Morehead City. Myrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\n2. South Carolina braces for severe flooding. The threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov. Henry McMaster said Tuesday."}, {"id": "b516becb-a1a8-466a-b37f-3820ed6e09ee", "title": "Debby live updates : Flash flooding , tornadoes target DC , Mid - Atlantic , Northeast", "date": "2024-08-09 16:45", "url": "https://www.gowatertown.net/syndicated-article/?id=1578402", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "Debby is slowly moving eastward offshoreTropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9657521325853833, "event_breakdown": "Tropical Storm Debby nearing hurricane strength at 70 mph\nTropical Storm Debby currently being tracked just east of Savannah, Ga., with winds maxing out at 70 miles per hour."}, {"id": "e955f5a2-8c67-46f4-8157-d3511b1c9b32", "title": "Debby live updates : Flash flooding , tornadoes target DC , Mid - Atlantic , Northeast", "date": "2024-08-09 17:30", "url": "https://www.k101fm.net/syndicated-article/?id=1578402", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "Debby is slowly moving eastward offshoreTropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9657521325853833, "event_breakdown": "1. Tropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.2. South Carolina braces for severe flooding.3. The threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nNikki Haley said.4. Debby strengthens into a hurricane. The National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.5. Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line.6. Debby nearing hurricane strength. While still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "c64bed25-0ee3-440a-b061-15b55fca9e28", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 06:15", "url": "https://www.fox35orlando.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\"", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9335832494130539, "event_breakdown": "Japan - Officials in Japan held an emergency meeting in the wake of a 7.0 earthquake that struck Japan on Thursday"}, {"id": "23b48543-1faa-45b3-bd3e-a875fde758ac", "title": "Japan PM scraps overseas trip after  megaquake  advisory", "date": "2024-08-09 07:30", "url": "https://www.gjsentinel.com/news/national/japan-pm-scraps-overseas-trip-after-megaquake-advisory/article_0fbd166b-8fb3-5340-a062-5aab0b2b946f.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "A cyclist navigates through traffic in the business district of Otemachi in central Tokyo.\nJapanese earthquake scientists have warned of the possibility of a \"megaquake\" in the future, although the risk is low", "location": "TOKYO", "classification": "natural-disasters", "score": 0.5496218360044633, "event_breakdown": "Japanese authorities have warned of heightened risk of landslides and floods as a seasonal rain front affects the region."}, {"id": "cc2439a0-0bf2-4a65-82dd-b984f0a473b5", "title": "The most hurricane - vulnerable counties in 2024", "date": "2024-08-09 07:45", "url": "https://ktvz.com/stacker-science/2024/08/08/the-most-hurricane-vulnerable-counties-in-2024/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "Gage Goulding // ShutterstockThe most hurricane-vulnerable counties in 2024In November 2022, a month after Hurricane Ian hit FL, Fort Myers Beach still had piles of rubble alongshore.\nWith a hectic hurricane season forecasted for this summer, LawnStarter ranked 2024’s most hurricane-vulnerable counties.\nCounty RankingsSee how the top 20 counties fared in our ranking:LawnStarterTop 5 Close UpTable showing the top 20 for “2024’s Most Hurricane-Vulnerable Counties”.\nMethodologyFirst, we determined the factors (metrics) that are most relevant to rank the Most Hurricane-Vulnerable Counties.\nWe then assigned a weight to each factor based on its importance and grouped those factors into 4 categories: Hurricane Risk, Hurricane History, Financial Impact, and Disaster Cleanup.", "location": "FORT MYERS BEACH", "classification": "natural-disasters", "score": 0.8520353131297833, "event_breakdown": "Here are the relevant current events of natural-disasters reported in text that can be placed on a map:\n\n* On January 9, 2023, wildfires broke out in Yorba Linda, San Bernardino county, California\n* On November 25, 2023, Hurricane Ian hit Fort Myers Beach, Lee County, Florida\n* On May 21, 2023, E2 tornado hit St. John's University in Queens, New York\n* On March 22, 2023, earthquake hit Atlantic City, New Jersey\n* In December 2023, earthquake hit Puerto Rico\n* In May 2023, hurricane hit Miami, Florida"}, {"id": "eadc7456-3916-40ea-a75c-bef657c6d2e3", "title": "Storm Debby downgraded to tropical depression", "date": "2024-08-09 03:15", "url": "https://www.queanbeyanage.com.au/story/8724210/storm-debby-downgraded-to-tropical-depression/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.5659260626722059, "event_breakdown": "Debby: eastern South Carolina is experiencing heavy rain leading to potential flash flooding as Tropical Storm Debby moves north through the Atlantic Ocean; North Carolina and Virginia may also see heavy rain leading to flash flooding. On Thursday parts of eastern South Carolina are forecast to receive another 7cm of rain from the storm."}, {"id": "5ea0fb91-13cd-4b04-b543-dae2215d26fc", "title": "Storm Debby downgraded to tropical depression", "date": "2024-08-09 03:30", "url": "https://www.crookwellgazette.com.au/story/8724210/storm-debby-downgraded-to-tropical-depression/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.5659260626722059, "event_breakdown": "1. Tropical Storm Debby, currently located east of South Carolina, was expected to drop another 7cm of rain on Thursday in areas that have already seen over 64cm of rain since Monday.\n2. Southeastern North Carolina could see up to 38cm of rain, while parts of Virginia could see up to 25cm."}, {"id": "fb6c70e1-9cce-4a98-a070-941fc3300ea0", "title": "Storm Debby downgraded to tropical depression", "date": "2024-08-09 04:00", "url": "https://www.maitlandmercury.com.au/story/8724210/storm-debby-downgraded-to-tropical-depression/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.5659260626722059, "event_breakdown": "1. Debby:\n* A slow-moving storm system dumped more than 64cm of rain in southeastern North Carolina and northeastern South Carolina, leaving parts of coastal North Carolina with the possibility of life-threatening flash floods, the National Weather Service (NWS) said.\n* In the nearby coastal cities of Morehead City and New Bern, North Carolina, teams were deployed in high-water rescue vehicles to aid residents.\n2. A storm system that dumped more than 64cm of rain in southeastern North Carolina and northeastern South Carolina has been hovering off the southeast coast, causing flooding along the Georgia and South Carolina coast.\n\nRelevant events that can be placed on a map are :\n1. Debby:\na. Debby threatened tracks across the Panhandle, North Florida and South Florida into tonight, bringing heavy rainfall and the threat of dangerous flooding. On the current forecast track s\nb. Debby is expected to produce total rain fall of 2 to 4 inches with isolated maximum amounts of 8 inches across the states of Tennessee, North Carolina and South Carolina.\n2. The storm system that dumped more than 64cm of rain in southeastern North Carolina and northeastern South Carolina has been hovering off the southeast coast, causing flooding along the Georgia and South Carolina coast."}, {"id": "16849225-345b-45ba-a348-7e2f54d182ca", "title": "Hullcar Mountain fire : Local rancher says dreams put at risk", "date": "2024-08-09 10:00", "url": "https://www.timescolonist.com/bc-news/theres-just-a-lot-to-lose-bc-rancher-says-wildfire-puts-dreams-at-risk-9326522", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "The Hullcar Mountain wildfire remains burning out of control.\nTrudy Schweb owns a fifth-generation ranch in the Hullcar area, directly below the Hullcar Mountain wildfire.\nThe past few days have been freaky for the family, though Schweb says she’s feeling better now.\nThe property is a ranch, and, thankfully, the family doesn’t have many cattle on their property right now.\nThe Hullcar Mountain wildfire remains burning out of control and has been classified as a wildfire of note by the BC Wildfire Service.", "location": "Hullcar Mountain wildfire.", "classification": "natural-disasters", "score": 0.5464203746179133, "event_breakdown": "Hullcar Mountain wildfire"}, {"id": "ce725735-16d1-425e-88cb-8f1472409220", "title": "3 Weather Threats : Debby Merges With Another Storm In New York", "date": "2024-08-09 11:45", "url": "https://wrrv.com/ixp/854/p/3-dangerous-weather-threats-tropical-storm-debby-merges-with-another-storm-in-new-york/", "domain": "wrrv.com", "domain_classification": "Unknown", "message": "New York weather experts warn of three different weather threats as Debby merges with another storm.\nKathy Hochul Tells New Yorkers To Prepare For DebbyHeavy Rains Cause Flash Flooding In Parts Of New York City Getty Images loading...\nGovernor Hochul is urging New Yorkers to take precautions as the remnants of Debby make their way toward the state.\nI urge New Yorkers to take precautions, monitor your local forecasts and sign up for emergency alerts,\" Hochul said.\n“My administration will continue to monitor and deploy necessary resources to impacted areas across the state.”Governor Kathy Hochul Governor Kathy Hochul loading...", "location": "New York", "classification": "natural-disasters", "score": 0.4097203730757968, "event_breakdown": "New York Weather Experts Warn of Three Different Weather Threats as Debby Merges With Another Storm.\nNew York Governor Kathy Hochul is urging New Yorkers to take precautions as the remnants of Debby make their way toward the state."}, {"id": "e5ff8c5d-b50f-4fc0-86fc-4fed03f0ce8f", "title": "Japan PM Scraps Overseas Trip After  Megaquake  Advisory", "date": "2024-08-09 10:00", "url": "https://menafn.com/1108536770/Japan-PM-Scraps-Overseas-Trip-After-Megaquake-Advisory", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- The Peninsula) AFPTokyo: Prime Fumio Kishida on Friday cancelled a four-day trip to Central Asia after scientists warned Japan should prepare for a possible \"megaquake\".\nPremier Kishida was due Friday to travel to Kazakhstan, Uzbekistan and Mongolia and attend a regional summit.\n\"As the prime minister with the highest responsibility for crisis management, I decided I should stay in Japan for at least a week,\" he told reporters.\nHe said the public must be feeling \"very anxious\" after the Japan Meteorological Agency (JMA) issued its first advisory under a new system drawn up following a major magnitude 9.0 earthquake in 2011, which triggered a deadly tsunami and nuclear disaster.\n\"The likelihood of a new major earthquake is higher than normal, but this is not an indication that a major earthquake will definitely occur,\" the JMA said.", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.6833656561773904, "event_breakdown": "Japan\nPremier Fumio Kishida on Friday cancelled a four-day trip to Central Asia after Japan Meteorological Agency (JMA) warned Japan should prepare for a possible \"megaquake\"."}]