[{"id": "0e169921-7967-4f00-93e0-6d9bb03fae00", "title": "COMMENT | Ulu Tiram  terrorist  attack and national security", "date": "2024-05-25 01:45", "url": "https://www.malaysiakini.com/columns/706613", "message": "COMMENT | I am deeply perplexed as an ordinary citizen of our beloved nation regarding the communication strategies employed by our leaders in addressing national security concerns.\nI firmly believe that the Ulu Tiram attack should unequivocally be classified as a terrorist attack.\nWhether the perpetrator acted alone or had familial ties to Jemaah Islamiyah is inconsequential.\nMoreover, an assault on the police officers and the station should be seen as an assault on the sovereignty of our country and the Yang di-Pertuan Agong.\nThe planning and execution of the attack possess the characteristics commonly associated with terrorist attacks, as acknowledged by experts in the field of terrorism...", "location": "MALAYSIA", "classification": "security", "score": 0.974737686007064, "event_breakdown": "1. Ulu Tiram Police Station attack\n2. Police officers’ assault\n3. Classification of the Ulu Tiram attack as a terrorist attack"}, {"id": "589d2f6e-ba5a-4cae-8a89-6c3190259a40", "title": "Man convicted of murder in Vancouver cop death", "date": "2024-05-25 02:30", "url": "https://www.kptv.com/2024/05/24/man-convicted-murder-vancouver-cop-death/", "message": "VANCOUVER Wash. (KPTV) - A man has been found guilty Friday of multiple murder charges after he was accused of causing the death of an off-duty Vancouver police officer.\nJulio Segura of Yakima has been found guilty of first-degree murder, second-degree murder, possession of a stolen car, first-degree robbery, and attempting to elude a police car.\nHe was found not guilty of first-degree attempted murder, second-degree attempted murder, first-degree attempted kidnapping, and first-degree burglary.\nJudge Retsinas agreed with the defense’s contention that there’s no evidence to support two of the felony murder charges.\nSEE ALSO:A Clark County judge dismissed two of three murder charges against a Yakima man on trial for the death of an off-duty Vancouver officer on Thursday.", "location": "VANCOUVER, Wash.", "classification": "security", "score": 0.9168517445844502, "event_breakdown": "Murder charges filed on Segura Dismissals of some charges A guilty verdict by Segura in trial"}, {"id": "3415430d-4470-4b37-a495-75f393414c9d", "title": "Civilians in Ukraine describe continued Russian attacks in northeastern regions", "date": "2024-05-25 04:00", "url": "https://www.globalissues.org/news/2024/05/24/36805", "message": "The Monitoring Mission in Ukraine has interviewed 90 displaced civilians since the 10 May attack and the team has visited many sites that were struck.\nMany of the interviewees recalled not being able to get shelter, and witnessing their neighbours being killed and injured.\nLocal authority aidMs. Throssell said that local authorities and volunteers are taking risks to help people get to safety.\nIn one instance on 10 May, two medical workers, two ambulance drivers and a local official received injuries while assisting civilians in evacuating Buhaivka.\nSeparately, on 19 May, Russian armed forces attacked a recreation centre in the village of Cherkaska Lozova near Kharkiv city twice in 20 minutes.", "location": "Kharkiv", "classification": "security", "score": 0.8467775514734598, "event_breakdown": "with the number of casualties\n* 10 May: Russian armed forces attack the Buhaivka district near Kharkiv, causing injuries to a local official, two medical workers, and two ambulance drivers during civilian evacuations.\n* 19 May: Russian armed forces attacked the Cherkaska Lozova village near Kharkiv city, striking a recreation centre twice in 20 minutes."}, {"id": "71eb0e2f-e6df-48c8-ba60-ea6d3f2a5e89", "title": "Metro buses being called  LA biggest homeless shelter  by riders", "date": "2024-05-25 02:00", "url": "https://www.foxla.com/news/metro-buses-being-called-las-biggest-homeless-shelter-riders", "message": "Riders are complaining that Metro buses are being used as a place to sleep.\nMay 13: A fight on a Metro bus led to a stabbing in Glendale.\nMay 14: A bus passenger was beaten and robbed in Encino.\nMay 17: A Metro bus passenger was shot and killed in Commerce.\nMay 21: A Metro bus passenger was stabbed in Lynwood.", "location": "Commerce", "classification": "security", "score": 0.9628587205369005, "event_breakdown": "May 13: A fight on a Metro bus led to a stabbing in Glendale.\nMay 14: A bus passenger was beaten and robbed in Encino.\nMay 17: A Metro bus passenger was shot and killed in Commerce.\nMay 21: A Metro bus passenger was stabbed in Lynwood."}, {"id": "24633a0b-2fa1-41ba-9da8-f77b9fb5a0f5", "title": "Ecuador president highlights armed force role in fighting organized crime", "date": "2024-05-25 04:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/25/content_117213079.htm", "message": "You are here:视频播放位置 下载安装Flash播放器QUITO, May 24 (Xinhua) -- Ecuadorian President Daniel Noboa on Friday stressed the role of the armed forces in fighting organized crime and drug trafficking gangs.\nNoboa made the comments as he presided over a ceremony marking the Battle of Pichincha of May 24, 1822, in which Ecuador won its independence from Spain.\n\"During the internal conflict against terrorist groups, once again our soldiers are an example of courage and sacrifice.\nSince Noboa declared the \"internal armed conflict\" on Jan. 9, the military has been deployed to eliminate 22 criminal gangs designated as \"terrorists.\"\n\"The union and support to defeat terrorism is tilting the balance and today we can say that the results are bearing fruit,\" the president said.", "location": "QUITO", "classification": "security", "score": 0.6065738379115964, "event_breakdown": "Security events listed in the text:\n- Ecuadorian President Daniel Noboa's comments on the armed forces role in fighting organized crime and drug trafficking gangs.\n- Deployment of military to eliminate 22 criminal gangs designated as \"terrorists\" since Noboa declared the \"internal armed conflict\" on Jan. 9."}, {"id": "fc331f47-b6c6-4c32-91a8-42d2f898eea0", "title": "Uvalde victim families sue Meta ,  Call of Duty  maker and gun company – NBC Bay Area", "date": "2024-05-25 01:45", "url": "https://www.nbcbayarea.com/news/national-international/uvalde-victim-families-sue-meta-call-of-duty-maker-and-daniel-defense/3548007/", "message": "They also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting — and has already been sued.\n“There is a direct line between the conduct of these companies and the Uvalde shooting,” said Josh Koskoff, an attorney for the families.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.\nUVALDE FAMILIES VS LAW ENFORCEMENTUVALDE FAMILIES VS GUN MAKERSUVALDE FAMILIES VS GAME MAKER", "location": "Uvalde, Texas", "classification": "security", "score": 0.6214803539967373, "event_breakdown": ".u\n1. Uvalde shooting on May 24, 2022\n2. Lawsuit against Daniel Defense, the AR-style rifle manufacturer.\n3. Lawsuit against Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday."}, {"id": "39b68f1f-3baf-40f8-a63d-4fd659b4205e", "title": "Uvalde victim families sue Meta ,  Call of Duty  maker and gun company – NBC 6 South Florida", "date": "2024-05-25 01:00", "url": "https://www.nbcmiami.com/news/national-international/uvalde-victim-families-sue-meta-call-of-duty-maker-and-daniel-defense/3319992/", "message": "They also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting — and has already been sued.\n“There is a direct line between the conduct of these companies and the Uvalde shooting,” said Josh Koskoff, an attorney for the families.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.\nUVALDE FAMILIES VS LAW ENFORCEMENTUVALDE FAMILIES VS GUN MAKERSUVALDE FAMILIES VS GAME MAKER", "location": "Uvalde, Texas", "classification": "security", "score": 0.6214803539967373, "event_breakdown": "Events related to the lawsuit against gun makers:\n1. Families of the victims of the Uvalde school shooting filed a lawsuit against Daniel Defense - a gun-maker in Georgia.\n\nEvents related to the lawsuit against tech giants:\n2. Families in the same school shooting sued Meta, which owns Facebook, seeking to hold the company accountable for having acted negligently by designing, facilitating, and profiting from the creation of Facebook's \"For Sale\" pages.\n\nEvents related to the lawsuit against game makers:\n3. Meta, Daniel Defense, and Activision were named in a lawsuit filed on behalf of victims of a mass shooting in Uvalde, Texas, in which a gunman used an AR-style semi-automatic rifle that he had purchased through an online video game platform."}, {"id": "0953eac2-9eac-48b9-82d9-870b0134895b", "title": "Uvalde families sue Meta and  Call of Duty  maker on 2nd anniversary of school attack – Metro US", "date": "2024-05-25 02:15", "url": "https://www.metro.us/uvalde-families-sue-meta-and-call-of-duty-maker-on-2nd-anniversary-of-school-attack/", "message": "FILE – Reggie Daniels pays his respects a memorial at Robb Elementary School, Thursday, June 9, 2022, in Uvalde, Texas.\nThey also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting — and has already been sued.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nThe lawsuit against Meta and Activision Blizzard — the maker of Call of Duty — were filed in California with additional families of victims from the attack.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.", "location": "Uvalde, Texas", "classification": "security", "score": 0.6628839770085684, "event_breakdown": ".\n- A lawsuit was filed against Daniel Defense, a gun manufacturer in Georgia, by 19 families in Texas.\n- A lawsuit was filed against Meta, the parent company of Facebook, and Activision Blizzard in California."}, {"id": "c90e569d-7857-4fb0-9ee4-f26540b3b487", "title": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attack", "date": "2024-05-25 03:00", "url": "https://www.wsbradio.com/news/uvalde-families-sue/4H7CPIFFTM4RGWBW4UOFQG34AQ/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the provided information, I was not able to find a specific location for the main event. The error message suggests that access is being", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "* Access to this website cannot be granted from outside the United States.\n* Access is restricted based on the user's location."}, {"id": "c74e48b3-b6ae-4c3e-8f74-5ba47cfdbbec", "title": "Uvalde families sue Meta and  Call of Duty  maker on 2nd anniversary of school attack", "date": "2024-05-25 01:00", "url": "https://www.clickondetroit.com/news/national/2024/05/24/uvalde-families-sue-meta-and-call-of-duty-maker-on-2nd-anniversary-of-school-attack/", "message": "FILE - Reggie Daniels pays his respects a memorial at Robb Elementary School, Thursday, June 9, 2022, in Uvalde, Texas.\nThey also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting — and has already been sued.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nThe lawsuit against Meta and Activision Blizzard — the maker of Call of Duty — were filed in California with additional families of victims from the attack.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.", "location": "Uvalde, Texas", "classification": "security", "score": 0.6628839770085684, "event_breakdown": ".\n* 19 families in Texas filed a lawsuit against Daniel Defense on June 8, 2022.\n* Another lawsuit was also filed against the company on the same day.\n* Lawsuits against Meta and Activision Blizzard were filed in California on June 8, 2022."}, {"id": "24fc8c77-e10c-4cce-87dc-02013d37753a", "title": "Israel defiant after World Court ruling on Gaza , vows to continue fighting", "date": "2024-05-25 03:00", "url": "https://www.asiaone.com/world/israel-defiant-after-world-court-ruling-gaza-vows-continue-fighting", "message": "JERUSALEM — Israeli ministers dismissed on May 24's ruling by the International Court of Justice ordering Israel to cease its military operation in the southern Gaza city of Rafah, vowing to continue fighting to free its hostages and defeat Hamas.\nThe ruling by the World Court on May 24 was the latest in a series of steps in recent weeks that have deepened Israel's international isolation over its conduct of the war in Gaza, which has killed more than 35,000 Palestinians, according to local health authorities.\nPrime Minister Benjamin Netanyahu's office rejected the allegations in the case brought by South Africa that Israel was carrying out genocide in Gaza as \"false, outrageous and morally repugnant\".\n\"The State of Israel is committed to continue fighting to return its hostages and promise the security of its citizens — wherever and whenever necessary — including in Rafah,\" he said in a statement.\nALSO READ: World Court to rule on request to halt Israel's Rafah offensive", "location": "JERUSALEM", "classification": "security", "score": 0.592637787812604, "event_breakdown": "Israeli ministers dismiss World Court ruling on Gaza operation"}, {"id": "840a4dac-03c7-42df-b5b6-8800bb6fe389", "title": "Iraq 2003 and Gaza 2023", "date": "2024-05-25 01:00", "url": "https://www.camera.org/article/iraq-2003-and-gaza-2023/", "message": "Journalists looking to make one point or another about the 2023 Hamas war have often contrasted the fighting in Gaza with U.S. combat in Iraq.\nMore often than not, the point being made — at least in our largest and most influential news outlets — has been that the Gaza war is without parallel.\nDoing so belies the newspaper’s claims that the rate of civilian deaths in Gaza compares unfavorably to the period of heavy bombardment in the 2003 Iraq war.\nIn this invasion period, civilian casualties in Iraq were likely higher than those casualties in Gaza.\nLess surprising is the divergence in total numbers of casualties, as the Gaza war drags on without a clear victory.", "location": "Gaza", "classification": "security", "score": 0.8966184306666374, "event_breakdown": "- 2003 Iraq war, with heavy bombardment causing more civilian casualties\n- 2023 Hamas war in Gaza, with likely civilian casualties in Gaza\n- Gaza war drags on without clear victory, no comparison to Iraq invasion period"}, {"id": "23bc80f0-ffa1-4d9c-b1ff-0918e0fe5087", "title": "Uvalde families sue Meta and  Call of Duty  maker on 2nd anniversary of school attack", "date": "2024-05-25 02:15", "url": "https://www.mymotherlode.com/news/national/3363852/vigil-butterfly-release-among-events-to-mark-the-2nd-anniversary-of-the-uvalde-school-shooting.html", "message": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attackUvalde families sue Meta and Call of Duty maker on second anniversary of school attack View PhotoAUSTIN, Texas (AP) — Families in Uvalde took more legal action Friday on the second anniversary of the Robb Elementary School attack, suing Meta Platforms, which owns Instagram, and the maker of the video game Call of Duty over claims the companies bear responsibility for products used by the teenage gunman.\nThey also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting — and has already been sued.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nThe lawsuit against Meta and Activision Blizzard — the maker of Call of Duty — were filed in California with additional families of victims from the attack.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.", "location": "Uvalde, Texas", "classification": "security", "score": 0.4990531864017919, "event_breakdown": "Uvalde families sue Meta, Call of Duty maker\nRobb Elementary School shooting\nLawsuit filed against Daniel Defense"}, {"id": "29653a11-422f-4d8d-8673-923ce5c6e25a", "title": "Deputy commander of Hamas killed in airstrike , says IDF", "date": "2024-05-25 06:00", "url": "https://www.siasat.com/deputy-commander-of-hamas-killed-in-airstrike-says-idf-3032276/", "message": "Tel Aviv: A Deputy Commander of Hamas has been killed in an airstrike in the central Gaza Strip, the Israel Defense Forces (IDF) have announced.\nThe IDF in a statement on Friday night identified the killed Hamas commander as Tziad al-Din al-Sharfa.\nThe Israeli Army said the assassination of the senior Hamas leader was conducted through a joint operation between IDF, Shin Bet and Military Intelligence.\nThe IDF is now specifically focusing on senior leaders of Hamas and is working on specific inputs from Shin Bet and Israel Military intelligence on the movement of senior Hamas group leaders.\nThe Israeli Army in the statement said that he was killed a few days ago after receiving inputs from the internal security agency, Shin Bet.", "location": "Gaza Strip", "classification": "security", "score": 0.963833981725744, "event_breakdown": "Event 1: Deputy Commander of Hamas, Tziad al-Din al-Sharfa, was killed in an Israeli airstrike in the central Gaza Strip.\nEvent 2: The Israeli Army said it assassinated a Hamas leader (al-Din al-Sharfa) after a joint operation by the IDF, Shin Bet and Military Intelligence."}, {"id": "24a94dac-3ada-41bd-87a1-21c40c25fb38", "title": "Ukrainian forces successfully push Russians back in some areas of Kharkiv front – General Staff", "date": "2024-05-25 09:30", "url": "https://www.yahoo.com/news/ukrainian-forces-successfully-push-russians-005005197.html", "message": "Ukrainian defenders are pushing the Russians back from the line of contact on the Kharkiv front with assault operations, and are succeeding in some areas.\nIn addition, Ukrainian defenders are pushing the Russians back from the frontline with assault operations, and are succeeding in some areas.\nRussian forces lost another 100 soldiers in both killed and wounded over the past day.\nOn the Pokrovsk front, Russian forces continued their attempts to break through Ukrainian defences near Ocheretyne.\nUkrainian defenders are inflicting effective fire damage on the Russians, depleting their forces along the entire line of contact.", "location": "Kharkiv front", "classification": "security", "score": 0.9223836352904591, "event_breakdown": "List of Security Reports:\n1. Ukrainian defenders are pushing Russian forces back from the line of contact on the Kharkiv front with assault operations, and are succeeding in some areas.\n2. Russian forces lost 100 soldiers in both killed and wounded over the past day.\n3. On the Pokrovsk front, Russian forces continued their attempts to break through Ukrainian defenses near Ocheretyne.\n4. Ukrainian defenders are inflicting effective fire damage on the Russians, depleting their forces along the entire line of contact."}, {"id": "60c5c3c9-8fde-492a-825d-6e9885e256fb", "title": "World News Roundup : Helicopter Crash , Gaza Strikes , and Global Tensions", "date": "2024-05-25 09:00", "url": "https://www.devdiscourse.com/article/law-order/2949786-world-news-roundup-helicopter-crash-gaza-strikes-and-global-tensions", "message": "Following is a summary of current world news briefs.\nStrikes continue in Gaza, as UN court orders Israel to halt Rafah assaultIsraeli forces stepped up military strikes on Gaza on Friday, residents and medics said, with planes bombing targets in the southern city of Rafah even as the U.N.'s top court ordered Israel to halt its offensive there.\nThe size of the territory returned to Azerbaijan under a border delimitation agreement on Friday was 6.5 square kilometres (2.5 square miles), Mustafayev said.\n\"Our soldiers have now managed to take combat control of the border area where the Russian occupiers entered,\" Zelenskiy said in his nightly video address.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)", "location": "Gaza", "classification": "security", "score": 0.4349235324793927, "event_breakdown": "- Israeli strikes in the Gaza Strip\n- Armenian-Azerbaijani conflict\n- Russia-Ukraine conflict"}, {"id": "c16b8141-e696-4fa3-87f3-5322494372cf", "title": "Man dies in Damascus explosion attributed to Israel", "date": "2024-05-25 09:30", "url": "https://www.ynetnews.com/article/rjlqemk4c", "message": "One dead in car explosion in DamascusA car traveling in the area of Homs in Western Syria carrying Hezbollah operatives was attacked by a drone, the Hezbollah affiliated Al Mayadeen reported on Saturday.\nThe UK based Observatory for Human Rights said the attack was launched by Israel.\n(Lior Ben Ari)At least one person was killed earlier, in an explosion in a car in the Al Mazeh neighborhood of Damascus on Friday, Syria media reported but did not reveal his identity.\nThe official Syrian outlets did not assign blame for the explosion but according to the UK based Observatory for Human Rights, a Syrian opposition group, the victim was \"affiliated with Iran,\" and the explosion was a targeted killing.\n2 View gallery Aftermath of an explosion in a Damascus car killing one ( Photo: Screenshot )\"It is not difficult to infiltrate Syria and Israel has been following officials linked to Iran and Hezbollah,\" the Observatory said in its report, carried by Saudi media.", "location": "Damascus", "classification": "security", "score": 0.861525482226359, "event_breakdown": "1. At least one Hezbollah member was killed by a drone attack in Syria. Syria media reported that a Hezbollah affiliated car was attacked in Homs, Syria.\n2. A Syrian man was killed in a car explosion in Damasus. According to the opposition, was a member of the opposition.\n3. The UK-based Observatory for Human Rights reported that Israel has followed officials linked to Iran and Hezbollah.\n4. The UK-based Observatory for Human Rights reported that Israel has followed officials linked to Iran and Hezbollah."}, {"id": "7dd3843f-d9cc-4314-ab5f-5adc1c95b59b", "title": "Chris Plante : WCK Workers Killed by Israel Were  Catering the Terrorists  ", "date": "2024-05-25 06:00", "url": "https://www.mediaite.com/tv/newsmax-host-says-world-central-kitchen-workers-killed-by-israel-were-catering-the-terrorists/", "message": "Newsmax host Chris Plante alleged that chef José Andrés’ World Central Kitchen and the group’s seven slain aid workers in Gaza were “catering the terrorists” when they were killed by Israeli air strikes.\nIn April, Israel hit an aid convoy that had coordinated its movements with the Israeli military.\nIsrael struck one vehicle, after which survivors got into another vehicle, only for that vehicle to be hit.\nOn Friday’s edition of The Right Squad, Plante accused the victims of providing “catering” to Hamas, which perpetrated the Oct. 7 terrorist attacks in Israel.\n“José Andrés, you know, catering the terrorists, found themselves in a motorcade of Hamas.”Andrés has alleged that Israel deliberately struck the convoy.", "location": "GAZA", "classification": "security", "score": 0.9546433774443591, "event_breakdown": "Event 1: José Andrés' World Central Kitchen coordinates with Israeli military ahead of aid convoy to Gaza.\nEvent 2: Israel strikes one of the convoy's vehicles.\nEvent 3: Survivors from the first vehicle get into another that is also subsequently struck.\nEvent 4: Chris Plante accuses the victims of providing catering for Hamas and suggests Israel deliberately targeted the convoy."}, {"id": "28898b79-d203-4444-9d46-00dceaa12399", "title": "Russia smashes train tracks in a battered Ukrainian border region where children are being evacuated | News , Sports , Jobs", "date": "2024-05-25 08:00", "url": "https://www.nashuatelegraph.com/top-headlines/2024/05/25/russia-smashes-train-tracks-in-a-battered-ukrainian-border-region-where-children-are-being-evacuated/", "message": "The overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.\nThursday’s strike on Kharkiv using S-300 missiles hit a printing company, burning about 50,000 books, Zelenskyy said.", "location": "Kharkiv", "classification": "security", "score": 0.520269193915714, "event_breakdown": "compass.\n1. 'Russia invades Ukraine.'\n2. 'Russia resumes offensive in Ukraine: Strikes targets in Kharkiv, Donbass.'\n3. 'Russia attacks Kharkiv using S-300 missiles.'\n4. 'Russia fires S-300 missile that hits a printing company in Kharkiv.'"}, {"id": "b09c1a17-af81-49ab-85c9-32dd2523c173", "title": "India News | Six Injured in Blast at Explosives Factory in Chhattisgarh Bemetara District", "date": "2024-05-25 09:30", "url": "https://www.latestly.com/agency-news/india-news-six-injured-in-blast-at-explosives-factory-in-chhattisgarhs-bemetara-district-5988837.html", "message": "Bemetara, May 25 (PTI) Six persons were injured in a blast at an explosives manufacturing factory in Chhattisgarh's Bemetara district on Saturday, officials said.\nThe explosion occurred in the unit located near Pirda village in Berla development block, a district administration official said.\n“So far, six people have been reported to be injured in the explosion,” he said, adding that the injured are being shifted to the hospital.\nAlso Read | 'Vote Against Politics of Hatred': Mallikarjun Kharge Urges People To Cast Their Ballot in Sixth Phase of Lok Sabha Elections 2024.\nThe incident comes days after a blast in a chemical factory in Maharashtra's Thane district killed nine persons and injured over 60.", "location": "Bemetara", "classification": "security", "score": 0.981617708978553, "event_breakdown": ".\nSecurity Events\n- A blast at an explosives manufacturing factory in Chhattisgarh's Bemetara district injured six people.\n- An explosion occurred in a unit located in Pirda village.\n- The official said six people were reported to be injured in the explosion.\n- The injured are being shifted to the hospital."}, {"id": "793a3f36-2de7-478d-8e61-50b5f457f77e", "title": "Gaza war : War cuts the heart out of humankind", "date": "2024-05-25 07:30", "url": "https://www.thedailystar.net/opinion/views/news/war-cuts-the-heart-out-humankind-3617651", "message": "Yusuf and Anisa are both members of the Federation of Journalists of Iraq and both have experience as \"stringers\" for Western media companies that came to Baghdad amid the war.\n\"And this is where Saleh [Matasher Tomal] parked his minivan to rescue Saeed, who had not yet died.\nAnd this is where the Apache shot at the minivan, grievously injuring Saleh's children, Sajad and Duah.\"\nThis is precisely what children in Gaza are now breathing as the Israelis drop hundreds of these deadly bombs on residential neighbourhoods.\nIn the case of this ongoing Gaza war, even a cessation of hostilities will not end the violence.", "location": "Baghdad, Iraq", "classification": "security", "score": 0.8155218515497394, "event_breakdown": "Security events in the text:\n\n1. Saleh Matasher Tomal parks his minivan at a specific location to rescue Saeed, who has not yet died.\n2. An Apache fires at the minivan, grievously injuring Saleh's children, Sajad and Duah, at the same location.\n3. Residential neighborhoods in Gaza are subjected to hundreds of deadly bombs dropped by the Israelis.\n4. Even a cessation of hostilities in the ongoing Gaza war will not end the violence."}, {"id": "67908404-5ad0-4e59-bdc2-43b53c020251", "title": "Israel pummels Gaza just a DAY after UN ordered IDF to halt its invasion of the southern city", "date": "2024-05-25 09:30", "url": "https://www.dailymail.co.uk/news/article-13458683/Israel-pummels-Gaza-just-DAY-ordered-IDF-halt-invasion-southern-city.html", "message": "Israel has bombed the Gaza Strip, including Rafah, just one day after the top UN court ordered the IDF to halt its military operations in the southern city.\nIt comes as efforts get underway in Paris to seek a ceasefire in the war sparked by Hamas's October 7 attack.\nIsrael gave no indication it was preparing to change course in Rafah, insisting that the court had got it wrong.\nThe French presidency said they held talks on the Gaza war and ways to set up a Palestinian state alongside Israel.\nTherefore, I do not believe that the shooting or the war will stop other than by force,' said Mohammed Saleh, also in the central Gaza Strip city.", "location": "Gaza", "classification": "security", "score": 0.8330736231081354, "event_breakdown": "- Israel has bombed the Gaza Strip\n- Israel bombed Rafah, including a residential neighborhood\n- France has held talks on the Gaza war"}, {"id": "010c0695-a591-4540-a345-488265fb40cc", "title": "5 / 14 / 24 National Security and Korean News and Commentary", "date": "2024-05-25 07:30", "url": "https://smallwarsjournal.com/index.php/blog/51424-national-security-and-korean-news-and-commentary", "message": "Rifle in hand, Kim Jong Un calls for more powerful North Korean weapons6.\nYoung North Korean recruits tell parents they are fed meager rations7.\nS. Korea, China agree to work for successful trilateral summit with Japan: Seoul ministry11.\nN. Korean municipal delegation heads for Russia's Far East13.\nN. Korean science, technology delegation leaves for Russia14.", "location": "North Korea", "classification": "security", "score": 0.41167034907804795, "event_breakdown": "1. Kim Jong-un, the leader of North Korea, was seen holding a rifle and calling for more powerful weapons.\n2. Young North Korean recruits told their parents that they were being fed meager rations.\n3. South Korea and China agreed to work together to have a successful trilateral summit with Japan.\n4. A municipal delegation from North Korea traveled to Russia's Far East.\n5. A science and technology delegation from North Korea also traveled to Russia."}, {"id": "207b7e30-ccf2-4480-ac79-772184f6d63c", "title": "More than two years on , KU suicide attack perpetrators still at large", "date": "2024-05-25 06:00", "url": "https://tribune.com.pk/story/2468192/more-than-two-years-on-ku-suicide-attack-perpetrators-still-at-large", "message": "More than two years after the deadly suicide attack targeting Chinese nationals at the gate of Karachi University, police have failed to make any arrests even though the banned Baloch Liberation Army (BLA) had claimed responsibility for the attack.\nAn anti-terrorism court has already issued non-bailable arrest warrants for five fugitive BLA terrorists in connection with the April 2022 attack, which killed four people, including three Chinese nationals.\nWhile expressing dissatisfaction over the failure to execute the arrest warrants for the five BLA fugitives, the court reissued non-bailable warrants for their arrest.\nThe fugitives include BLA Commander Bashir, Captain Rehman Gul, Khalil Ahmed Musa, alias Waja, Mir Safir Ahmed, and Bashir Zeib.\nThe victims of the suicide attack were identified as Huang Guiping, Director of the Confucius Institute at the University of Karachi, Ding Moping, Chen Sai, and Khalid, the driver.", "location": "Karachi, Pakistan", "classification": "security", "score": 0.8935342418311439, "event_breakdown": "Security events:\n\n1. April 26, 2022: Suicide attack targeting Chinese nationals at the gate of Karachi University.\n2. April 26, 2022: Police failed to make any arrests in relation to the Karachi University suicide attack.\n3. April 2022: Anti-terrorism court issued non-bailable arrest warrants for five fugitive BLA terrorists involved in the Karachi University attack.\n4. May 2022: Court reissued non-bailable arrest warrants for five BLA terrorists."}, {"id": "97bc20ee-16dd-453a-81a9-f037d890f91d", "title": "Israel strikes Rafah after top UN court orders it to halt offensive", "date": "2024-05-25 08:00", "url": "https://www.channelnewsasia.com/world/israel-strikes-rafah-top-un-court-orders-halt-offensive-4362836", "message": "RAFAH: Israel bombed the Gaza Strip, including Rafah, on Saturday (May 25), a day after the top UN court ordered it to halt military operations in the southern city as efforts get underway in Paris to seek a ceasefire in the war sparked by Hamas' Oct 7 attack.\nThe International Court of Justice (ICJ) also demanded the immediate release of all hostages still held by Palestinian militants, hours after the Israeli military announced troops had recovered the bodies of three more of the captives from northern Gaza.\nThe Hague-based court, whose orders are legally binding but lack direct enforcement mechanisms, also ordered Israel to keep open the Rafah crossing between Egypt and Gaza, which it closed earlier this month at the start of its assault on the city.\nIsrael gave no indication it was preparing to change course in Rafah, insisting that the court had got it wrong.\nThe Palestinian militant group Hamas, which has ruled Gaza since 2007, welcomed the ICJ ruling on Rafah but criticised its decision to exclude the rest of war-torn Gaza from the order.", "location": "GAZA STRIP", "classification": "security", "score": 0.6810116003760439, "event_breakdown": "Israel bombing Gaza, including Rafah, and the International Court of Justice ordering Israel to halt military operations in Rafah, but excluding the rest of Gaza."}, {"id": "aac67dae-7d6d-4de5-9a2b-ef9bcd7bc564", "title": "Lyceum partially destroyed in Kharkiv after Russian attack", "date": "2024-05-25 06:00", "url": "https://www.yahoo.com/news/lyceum-partially-destroyed-kharkiv-russian-232608495.html", "message": "A lyceum in the Slobidskyi district of Kharkiv was partially destroyed by a Russian attack on the night of 24-25 May.\n[A lyceum is a specialised secondary school - ed.]\nSource: Kharkiv Mayor Ihor Terekhov on TelegramDetails: Terekhov said that a nearby high-rise building and several cars had also been damaged.\nIn addition, the main building of the institution was partially destroyed and windows were shattered in several nearby high-rise buildings.\nBackground:On the night of 24-25 May, a series of explosions occurred in Kharkiv around midnight.", "location": "Kharkiv", "classification": "security", "score": 0.9877678662918078, "event_breakdown": "Russian attacks on a lyceum in Kharkiv, as well as nearby high-rise buildings and cars."}, {"id": "0a6aab2b-4a23-4ce7-82d1-c0e1be8c36a7", "title": "Seeking Justice : Uvalde Families Sue Meta and Game Makers on Attack Anniversary", "date": "2024-05-25 06:00", "url": "https://www.devdiscourse.com/article/law-order/2949842-seeking-justice-uvalde-families-sue-meta-and-game-makers-on-attacks-anniversary", "message": "They also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting - and has already been sued.\n\"There is a direct line between the conduct of these companies and the Uvalde shooting,\" said Josh Koskoff, an attorney for the families.\nThe lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.\nIn a congressional hearing in 2022, Daniel Defense CEO Marty Daniels called the Uvalde shooting and others like it \"pure evil\" and \"deeply disturbing.\"", "location": "Uvalde, Texas", "classification": "security", "score": 0.5122066918557376, "event_breakdown": ".\nSecurity events:\nMay 24, 2022 - Shooting at a school in Uvalde, Texas.\nWednesday, June 1, 2022 - Lawsuit is filed in Uvalde, Texas.\nLawsuit against Daniel Defense is filed in Texas."}, {"id": "c1a41ea7-ac93-4963-852d-9602a4285c7a", "title": "A lesson in hypocrisy , double standards and antisemitism at the ICJ", "date": "2024-05-25 05:30", "url": "https://www.jpost.com/opinion/article-802588", "message": "The ICJ may only exercise jurisdiction over claims brought by states if the defendant state agrees to submit to its jurisdiction.\n(credit: MARC ISRAEL SELLEM/THE JERUSALEM POST)On Oct. 7, 2023, the Hamas terror organization, which has controlled Gaza since 2007, launched an attack on Israel.\nIsrael at the ICJIsrael provided the ICJ with evidence proving that it has done its best, way beyond the requirements set by international law, to keep civilians out of harm’s way.\nOver the years, the Israel Supreme Court made orders constraining Israel in its war on terror in ways that go far beyond the rules of international warfare.\nA week ago, Hamas targeted the Israeli soldiers who protected the passage of the humanitarian aid, killing three of them.", "location": "Gaza", "classification": "security", "score": 0.7570794395765816, "event_breakdown": "Events:\n* Hamas launched an attack on Israel on Oct. 7, 2023\n* Israel provided evidence to the ICJ (International Court of Justice) detailing its efforts to keep civilians out of harm's way\n* The Israeli Supreme Court made orders constraining Israel's war on terror\n* Hamas targeted and killed three Israeli solders guarding the passage of humanitarian aid"}, {"id": "522574dd-3896-49b0-a39d-0e8417ac1daa", "title": "IDF : 3 more hostage bodies recovered ; Egypt to permit aid trucks through Gaza entry | Nation and World", "date": "2024-05-25 06:30", "url": "https://www.reviewjournal.com/news/nation-and-world/idf-3-more-hostages-bodies-recovered-egypt-to-permit-aid-trucks-through-gaza-entry-3057065/", "message": "Egypt said it has agreed to send U.N. humanitarian aid trucks through Israel’s main crossing into Gaza, but it remained unclear if they will be able to enter the territory.\nRelatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a performance calling for their return in Tel Aviv, Israel, Thursday, May 23, 2024.\nMeanwhile, the bodies of three more hostages killed in the Oct. 7 Hamas terrorist attack were recovered overnight from Gaza, Israel’s army said Friday.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of at least 39 more, while 17 bodies of hostages have been recovered.\nThe group representing the families of the hostages said the bodies had been returned to their families for burial.", "location": "Gaza", "classification": "security", "score": 0.8729983743384029, "event_breakdown": "- UN humanitarian aid trucks will be directed to Gaza through Israel, but it is unclear if they will be allowed in.\n- The bodies of three more hostages killed in the Oct. 7 Hamas terrorist attack were recovered overnight from Gaza."}, {"id": "69b8817d-3951-4ed9-a97a-f2e8dac58be7", "title": "FIFA Is Latest Target of Palestinian Hijacking", "date": "2024-05-25 05:45", "url": "https://townhall.com/columnists/david-may/2024/05/25/fifa-is-latest-target-of-palestinian-hijacking-n2639520", "message": "Cloaked in the language of justice and human rights, the Palestinian FIFA delegation continued its decades-long campaign of using sports as a weapon against the Jewish state.\nAdvertisementPalestine Football Association head Jibril Rajoub presented his request to expel Israel from FIFA at the conclusion of the 74th FIFA Congress in Bangkok, Thailand.\nRajoub complained that Israel discriminates against Palestinian soccer by allowing Israeli teams in the West Bank to participate in Israeli leagues.\nThe Israeli soccer leader spoke of how he had supported the Palestinian bid to join FIFA as a full member.\nInfantino should prevent FIFA from becoming the latest hostage in the Palestinian campaign to destroy Israel.", "location": "Bangkok, Thailand", "classification": "security", "score": 0.8424011350028221, "event_breakdown": "Security Events:\n- struggle of Palestinians to expel Israel from FIFA\n- A presentation of request by Palestinian’s FIFA leader to expel Israel from FIFA.\n- Rajoub complain that Israel discriminates against Palestinian soccer by allowing Israeli teams in the West Bank to participate in Israeli leagues\n- Request is presented by head of Palestinian soccer association Jibril Rajoub to FIFA"}, {"id": "8d26574f-45e6-4cb6-b6d4-25d286650293", "title": "Brother of Glasgow Airport terrorist arrested over cafe bombing", "date": "2024-05-25 05:15", "url": "https://www.heraldscotland.com/news/24342346.brother-glasgow-airport-terrorist-arrested-cafe-bombing/", "message": "Shazib is accused of placing the IED at the cafe, while Taha is accused of helping Shazib plan the attack.\nAhmed is the younger brother of Kafeel Ahmed, who died after driving a Jeep laden with petrol and gas canisters into Glasgow Airport in June 2007.\nKafeel Ahmed died at Glasgow’s Royal Infirmary weeks after the Glasgow Airport attack.\nAbdullah worked less than three miles from the Glasgow Airport terminal building at Paisley’s Royal Alexandra Hospital.\nThe explosives failed to detonate, and with a police manhunt under way to trace them, the pair then made the decision to launch a suicide attack on Glasgow Airport.", "location": "Glasgow Airport", "classification": "security", "score": 0.8725069962414667, "event_breakdown": "1. The explosives failed to detonate at the cafe.\n2. A police manhunt was under way to trace Shazib and Taha.\n3. Shazib and Taha decided to launch a suicide attack on Glasgow Airport."}, {"id": "e5b98c54-e606-4018-90cb-02ce23ebd606", "title": "CHR seeks accountability over recent bombing of Cotabato Catholic chapel", "date": "2024-05-25 06:00", "url": "https://www.philstar.com/headlines/2024/05/25/2357834/chr-seeks-accountability-over-recent-bombing-cotabato-catholic-chapel", "message": "CHR seeks accountability over recent bombing of Cotabato Catholic chapelOnlookers mill around the Sto.\nNiño Chapel in Purok Bagong Silang in Barangay Rosary Heights 3 in Cotabato City, rocked by a grenade blast on Sunday morning that hurt two worshipers.\nMANILA, Philippines — The Commission on Human Rights (CHR) denounced the recent grenade attack by still unknown perpetrators during a Catholic Mass in Cotabato City, an act which injured two civilians.\nNiño Chapel in Purok Bagong Silang, Barangay Rosary Heights 3.\nWe welcome the efforts currently being pursued by the Cotabato City Police to investigate this matter and ensure that accountability is exacted upon the perpetrators.\"", "location": "Cotabato City, Philippines", "classification": "security", "score": 0.9812026418069983, "event_breakdown": "The recent events in the Philippines, with reference to:\n- the bombing at the Sto. Niño Chapel in Purok Bagong Silang in Barangay Rosary Heights 3 in Cotabato City,\n- the investigation of Cotabato City Police,\n- the effort to ensure accountability by perpetrators,\n- the condemnation of the attack by Boko Haram\n- the targeting of religious shrines and religious symbolism by militants"}, {"id": "c7224d08-4f58-48ea-b7f0-d01ef6f519de", "title": "Australian Bakery Bakes Hamas - Themed Birthday Cake For Four - Year - Old , Probe Launched", "date": "2024-05-25 06:00", "url": "https://www.news18.com/world/australian-bakery-bakes-hamas-terrorist-cake-cupcakes-to-celebrate-four-year-olds-birthday-8903346.html", "message": "Police in Australia are probing a bakery in Sydney which made a cake featuring Hamas terrorist and propagandist Abu Obeida and Palestinian flags for a four-year-old boy.\nHe was dressed in a red and white headscarf and a camouflaged jacket, just like the image of Abu Ubaida on the cake.\nAbu Ubaida was also seen on the cupcakes that were made for Omar’s birthday party.\nIt’s a threat to all Australians,” said Robert Gregory, the chief executive of the Australian Jewish Association.\nIndoctrination starts at a young age and is similar to what is seen across the Middle East,” Australian Jewish Association’s chief said.", "location": "SYDNEY", "classification": "security", "score": 0.48009977829928585, "event_breakdown": "Events:\n\n1. A bakery in Sydney made a cake featuring Hamas terrorist and propagandist Abu Obeida and Palestinian flags for a 4-year-old boy.\n2. Abu Ubaida was seen on the cupcakes.\n3. The chief executive of the Australian Jewish Association called it a threat to all Australians."}, {"id": "b7be559d-39f1-4313-8eac-e0b402959cd6", "title": "Anti - Israel activists argue Arabic is mistranslated in abduction video", "date": "2024-05-25 05:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-802586", "message": "The IDF translated it as the second meaning, while Hamas sympathizers are arguing that the term means woman or girls.\nThe Arabic word “sabaya” doesn’t have sexual connotations.\nRelying on the fabricated IDF “translation” of the word isn’t journalism pic.twitter.com/eOU1tIHtMB — Laila Al-Arian (@LailaAlarian) May 23, 2024The IDF translation implied that the Hamas terrorists were plotting on camera the sexual enslavement and rape of young Israeli women.\nThe alternative would imply that the Hamas terrorists were simply pointing out their captives' youth.\nMost notable are cases by members of the Islamic State (ISIS) against Yazidi women and girls, as well as by Boko Haram against Nigerian women and girls.", "location": "Palestine", "classification": "security", "score": 0.8796248478308212, "event_breakdown": "Events:\n* IDF translation\n* Hamas sympathizers arguing\n* Arabic word “sabaya”\n* Sexual slavery\n* Sexual rape of young Israeli women"}, {"id": "f98df3fe-9189-434a-b2fa-965684aaefd3", "title": "Israel - Hamas War Day 232 : What happening in Gaza ? ", "date": "2024-05-25 05:30", "url": "https://www.jpost.com/israel-hamas-war/2024-05-25/live-updates-802591", "message": "Delegates attend a ruling on South Africa's request to order a halt to Israel's Rafah offensive in Gaza as part of a larger case brought before the Hague-based court by South Africa accusing Israel of genocide, at the International Court of Justice (ICJ), in The Hague, Netherlands May 24, 2024.\n(photo credit: JOHANNA GERON/REUTERS)The International Criminal Court of Justice ruled that Israel needed to halt military operations in Rafah; an area in the Gaza Strip housing a significant number of Palestinian civilians.\nThe ruling was made after South Africa filed to the ICJ to stop Israel from continuing any military actions in Gaza, despite the significant threat Hamas continues to pose to Israel and the Israeli hostages who remain captive there.", "location": "GAZA CITY", "classification": "security", "score": 0.8839944659656803, "event_breakdown": "Events:\n- Ruling to stop Israel's military actions in Rafah by the International Criminal Court of Justice.\n- South Africa filed to the ICJ to stop Israel from continuing any military actions in Gaza.\n- Threats by Hamas against Israel.\n- Presence of Palestinian civilians in Rafah.\n- Hostages of Israeli citizens remaining captive in Gaza."}, {"id": "b8fb96eb-360e-4069-8174-cc6d2c1541c6", "title": "Bournemouth beach double stabbing kills woman as murder probe launched", "date": "2024-05-25 09:15", "url": "https://www.dailystar.co.uk/news/bournemouth-beach-double-stabbing-kills-32889997", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nPolice have launched a murder investigation after the horror attack on Durley Chine beach in Bournemouth on Friday night.\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletter by clicking here.", "location": "Bournemouth", "classification": "security", "score": 0.4319704732152899, "event_breakdown": "Security events:\n- Murder investigation launched in Durley Chine beach in Bournemouth."}, {"id": "9861d27e-7a0c-45ee-91f5-7b393724ed99", "title": "Civilians In Ukraine Describe Continued Russian Attacks In Northeastern Regions", "date": "2024-05-25 08:00", "url": "https://www.scoop.co.nz/stories/WO2405/S00314/civilians-in-ukraine-describe-continued-russian-attacks-in-northeastern-regions.htm", "message": "Civilians In Ukraine Describe Continued Russian Attacks In Northeastern RegionsCivilians in the northeast of Ukraine are experiencing escalated hostilities as Russian armed forces have taken control of several villages, according to testimonies received by the UN Human Rights Monitoring Mission in Ukraine (HRMMU).\nThe Monitoring Mission in Ukraine has interviewed 90 displaced civilians since the 10 May attack and the team has visited many sites that were struck.\nMany of the interviewees recalled not being able to get shelter, and witnessing their neighbours being killed and injured.\nIn one instance on 10 May, two medical workers, two ambulance drivers and a local official received injuries while assisting civilians in evacuating Buhaivka.\nAdvertisement - scroll to continue readingSeparately, on 19 May, Russian armed forces attacked a recreation centre in the village of Cherkaska Lozova near Kharkiv city twice in 20 minutes.", "location": "Kharkiv", "classification": "security", "score": 0.9120568787991774, "event_breakdown": "10 May - attack on Buhaivka, Ukraine\n19 May - attack on a recreation centre in Kharkiv, Ukraine"}, {"id": "e7b89b3a-3a4d-4e41-8ee9-349a914ae2b1", "title": "One killed in car bomb explosion in Syrian capital", "date": "2024-05-25 12:15", "url": "https://www.prokerala.com/news/articles/a1534203.html", "message": "Damascus, May 25 : One person was killed after an explosive device affixed under a car went off in the Syrian capital, Damascus, on Saturday, state news agency SANA said.\nThe victim was the owner of the car that exploded in the Mazzeh neighbourhood of western Damascus, Xinhua news agency reported.\nThe Syrian Observatory for Human Rights said the explosion resulted in the death of an unidentified person inside the car, while the burning and charring of three other vehicles parked at the site.\nInitial reports suggested the sound was caused by a new Israeli bombing of the Mazzeh area in Damascus.\nHowever, activists from the Syrian Observatory confirmed that there was no bombing in the area.", "location": "Damascus", "classification": "security", "score": 0.9777207688699945, "event_breakdown": "Security events in Damascus, Syria:\n- 25 May: One person was killed by an explosion of an explosive device fixed under a car.\n- 25 May: One unidentified victim died due to an explosion in the Mazzeh district of western Damascus, burning and charring three other parked vehicles."}, {"id": "4f0ddbaf-b4b1-4eb5-a2a3-0f0e4e365516", "title": "Car bomb in the Syrian capital kills one . Drone strike near Lebanon border targets two vehicles", "date": "2024-05-25 13:00", "url": "https://apnews.com/article/syria-iran-israel-damascus-mazze-hezbollah-1a813bcbdcbb9eb574230b7f41103c47", "message": "Damascus’ Mazze neighborhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn’t say who the person killed was but said the blast set two other cars ablaze.\nThe Beirut-based Al-Mayadeen TV didn’t say if there were casualties, but the Observatory said two Hezbollah members were killed and several others wounded in the drone strike.\nIran’s military presence in Syria has been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border.\nIsrael responded with a retaliatory war that has killed more than 35,000 Palestinians, many of them women and children, according to Gaza health officials.", "location": "Damascus", "classification": "security", "score": 0.9358082965247685, "event_breakdown": "1. A strike destroyed the Iranian consulate in Mazze, a Damascus neighborhood. According to the Syrian government broadcaster SANA, one death and multiple burned cars were the result of the strike.\n2. Israel and Lebanon-based Hezbollah engaged in a war that produced around 35,000 Palestinian victims, many of them women and children, in the Gaza Strip, according to local officials."}, {"id": "a49150db-8da4-49ac-abe2-e935631f22de", "title": "Car bomb in the Syrian capital kills one while drone strike near Lebanon border targets two vehicles", "date": "2024-05-25 14:00", "url": "https://www.theglobeandmail.com/world/article-car-bomb-in-the-syrian-capital-kills-one-while-drone-strike-near/", "message": "Damascus’ Mazze neighborhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn’t say who the person killed was but said the blast set two other cars ablaze.\nThe Beirut-based Al-Mayadeen TV didn’t say if there were casualties, but the Observatory said two Hezbollah members were killed and several others wounded in the drone strike.\nIran’s military presence in Syria has been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border.\nIsrael responded with a retaliatory war that has killed more than 35,000 Palestinians, many of them women and children, according to Gaza health officials.", "location": "SYRIA", "classification": "security", "score": 0.9358082965247685, "event_breakdown": "1. An explosion erupted in Damascus’ Mazze neighborhood on Saturday, resulting in at least one death and two damaged cars. The blast occurred near the Iranian consulate, which was targeted in a strike last month that Israel assumed responsibility for.\n2. An attack was launched on the Syrian town of Al-Kiswah, around 15 kilometers (9 miles) south of the capital, Damascus, on Monday, killing at least three people, according to the Syrian Observatory for Human Rights. The Observatory, which gathers information from activists within the nation, said the blast also wounded over ten military personnel. The attack set fire to at least three military vehicles.\n3. Media outlets reported that the strike originated from the Al-Tanf area, where Western countries operate a small garrison. However, no side has taken responsibility for the attack. Damascus slammed the assault as a “cowardly American-Israeli mistake,” claiming it comes amid the country’s worst financial crisis since the waring in Syria erupted in 2011.\n4. Israeli attacks during its 11-day military bombardment of Gaza killed more than 35,000 Palestinians, many of them children, according to Gaza health officials. Israel’s attacks on the densely populated enclave—which is home to more than two million people—caused widespread destruction, killing over 250 Palestinians, including 66 children."}, {"id": "753cf135-477b-4da5-afdb-b6fe1934e046", "title": "Deadly Bomb Explosion in Damascu Diplomatic Hub Ignites Regional Tensions", "date": "2024-05-25 13:00", "url": "https://www.devdiscourse.com/article/politics/2950174-deadly-bomb-explosion-in-damascus-diplomatic-hub-ignites-regional-tensions", "message": "Damascus' Mazze neighbourhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn't say who the person killed was but said the blast set two other cars ablaze.\nLebanon-based Hezbollah and Israeli forces have traded cross-border fire a day after the Israel-Hamas war started on October 7 on almost daily basis.\nMeanwhile, Israel says at least 15 soldiers and 10 civilians have so far been killed in the clashes.\nTehran has been sending advisers to Syria since the country's conflict, which later turned into civil war, began in March 2011.", "location": "Damascus", "classification": "security", "score": 0.835107090182599, "event_breakdown": "Events:\n* Explosion in Damascus' Mazze neighbourhood\n* Attack on the Iranian consulate\n* Israel blamed for the strike\n* Cross- border fire between Israel and Hezbollah\n* Casualties reported in the clashes"}, {"id": "05ecb54f-eaf4-4a71-a3da-148c2997f9c0", "title": "Russian strike on Kharkiv printing house : Vivat names killed workers", "date": "2024-05-25 11:00", "url": "https://www.yahoo.com/news/russian-strike-kharkiv-printing-house-072159282.html", "message": "On Publishing, Printing and Book Distribution Workers’ Day, the publisher Vivat Publishing has named seven employees killed by Russia during the attack on their printing house in Kharkiv on 23 May.\nSource: Vivat CEO Yuliia OrlovaDetails: Seven people were killed in a Russian strike on Thursday:Tetiana Khrapina, a print operatorRoman Strohyi, a glueing machine operatorSvitlana Ryzhenko, a brochure makerOlha Kurasova, an automatic sewing machine operatorOlena Ninadovska, an automatic sewing machine operatorHanna Mynaieva, a finishing machine operatorDmytro Shylo, a brochure makerPhoto: vivatBackground: During a large-scale Russian attack on Kharkiv on Thursday, 23 May, the Russians hit a printing house.\nThe police said that the Russians had previously struck with an S-300 anti-aircraft system, and three missiles had hit a shop and the surrounding area.\nAmong the dead were machine operators, a typist and a stacker/packer.\nA Russian missile strike on the Factor-Druk printing house in the Osnovyansky district of Kharkiv destroyed 50,000 books.", "location": "ODESSA", "classification": "security", "score": 0.7967092048819796, "event_breakdown": "Event 1: Seven employees were killed during a Russian attack on the printing house of Vivat Publishing on 23 May.\nEvent 2: The Russians attacked the printing house with an S-300 anti-aircraft system.\nEvent 3: Three Russian missiles hit a shop and the surrounding area during a large scale attack on Kharkiv.\nEvent 4: 50 000 books were destroyed by a Russian missile strike on the Factor-Druk printing house."}, {"id": "c9ead1f7-1b5c-4a58-9bf0-f200ae56b455", "title": "Russians strike railway system in Kharkiv area | The Arkansas Democrat - Gazette", "date": "2024-05-25 12:15", "url": "https://www.arkansasonline.com/news/2024/may/25/russians-strike-railway-system-in-kharkiv-area/", "message": "The overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine's national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin's army is attempting to create a \"buffer zone\" in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe Ukrainian military claimed Friday it had stopped the Russian advance in the north of the Kharkiv region and was conducting counter-offensive operations.\nThursday's strike on Kharkiv using S-300 missiles hit a printing company, burning about 50,000 books, Zelenskyy said.", "location": "KHARKIV", "classification": "security", "score": 0.7453829118324569, "event_breakdown": "1. Russia's offensive in Kharkiv since May 10 led to the evacuation of more than 11,000 people in the region.\n2. Russia's aim is to create a buffer zone in the Kharkiv region to prevent Ukrainian cross-border attacks.\n3. The Ukrainian military claimed it stopped the Russian advance in the Kharkiv region and was conducting counter-offensive operations.\n4. Thursday's strike on Kharkiv using S-300 missiles hit a printing company burning about 50,000 books."}, {"id": "a170b454-ff00-49fe-b0ca-4486e80e275c", "title": "Car bomb in Damascus kills one , drone strike near Lebanon border", "date": "2024-05-25 13:00", "url": "https://www.newarab.com/news/car-bomb-damascus-kills-one-drone-strike-near-lebanon-border", "message": "Damascus’ Mazze neighbourhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn't say who the person killed was but said the blast set two other cars ablaze.\nHours after the blast in Damascus, an Israeli drone strike reportedly targeted a car and a truck outside the western Syrian town of Qusair, northwest of Damascus, close to Lebanon's border, the Observatory and a Beirut-based pan-Arab TV station reported.\nThe Beirut-based Al-Mayadeen TV didn't say if there were casualties, but the Observatory said two Hezbollah members were killed and several others wounded in the drone strike.\nIran's military presence in Syria has been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border.", "location": "Damascus", "classification": "security", "score": 0.9865036633147336, "event_breakdown": "1. The Iranian consulate in Damascus was destroyed in a strike blamed on Israel.\n2. A blast in Damascus killed one person, set two other cars ablaze, and was blamed on an Israeli drone.\n3. Two Hezbollah members were killed and several others wounded in a drone strike outside Qusair, near Damascus."}, {"id": "3386bf31-eea0-4f74-aaef-d228cb3076a7", "title": "Car bomb in the Syrian capital kills one . Drone strike near Lebanon border targets two vehicles", "date": "2024-05-25 12:15", "url": "https://toronto.citynews.ca/2024/05/25/car-bomb-in-the-syrian-capital-kills-one-drone-strike-near-lebanon-border-targets-two-vehicles/", "message": "Damascus’ Mazze neighborhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn’t say who the person killed was but said the blast set two other cars ablaze.\nThe Beirut-based Al-Mayadeen TV didn’t say if there were casualties, but the Observatory said two Hezbollah members were killed and several others wounded in the drone strike.\nIran’s military presence in Syria has been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border.\nIsrael responded with a retaliatory war that has killed more than 35,000 Palestinians, many of them women and children, according to Gaza health officials.", "location": "Damascus", "classification": "security", "score": 0.9358082965247685, "event_breakdown": "Security Events:\n\n- Irnaian consulate destroyed in Damascus\n- One person killed in Damascus\n- Two cars set ablaze in Damascus\n- Two Hezbollah members reportedly killed in Damascus\n- Israeli drone strike in Beirut\n- More than 35,000 Palestinians killed in a recent Israeli war"}, {"id": "bdfaed16-0767-4f99-89a2-c6ecb171c1a2", "title": "US Assault Ship Rushed to Red Sea Fight Meant for Cruisers , Destroyers", "date": "2024-05-25 12:30", "url": "https://www.businessinsider.com/us-assault-ship-rushed-red-sea-fight-meant-cruisers-destroyers-2024-5", "message": "When the Pentagon decided to keep the Bataan in the Red Sea for a period, there were at least three guided-missile destroyers in the area.\nThe amphibious assault ships are highly versatile though, and bring different capabilities into combat.\nAtlantic Ocean, December 12, 2013 - An SH-60 Sea Hawk helicopter lands on the flight deck aboard the multipurpose amphibious assault ship USS Bataan (LHD 5).\nAdvertisementPerhaps the most notable feature of this amphibious assault ship is its well deck, which allows for boats and other water vehicles to dock within the ship.\nArabian Gulf, August 24, 2014 - Marines aboard an amphibious assault vehicle (AAV) exit the well deck of the amphibious assault ship USS Bataan (LHD 5).", "location": "Arabian Gulf", "classification": "security", "score": 0.41580116562995995, "event_breakdown": ".\nEvents:\n- The Pentagon decides to keep a Bataan amphibious assault ship in the Red Sea.\n- Three guided-missile destroyers were in the area.\n- USS Bataan is capable of carrying boats and other vehicles in its well deck."}, {"id": "22db3456-3367-4fea-b64d-c3d42c3be0c7", "title": "The need to act against Taliban – inspired jihadist groups", "date": "2024-05-25 11:45", "url": "https://www.diplomaticourier.com/posts/need-to-act-against-taliban-inspired-jihadist-groups", "message": "Following the tragedy of 9/11 and other major terrorist attacks that followed it, the United Nations member–states began foreseeing increased global terrorist activity resulting from mutually reinforcing symbiotic relationships between different terrorist and criminal networks in permissive environments such as Afghanistan.\nThis prompted them to unanimously adopt the UN Global Counter–Terrorism Strategy on 8 September 2006.\nNow resurgent, al–Qaeda and ISKP have resumed carrying out terrorist attacks across the region.\nWhile al–Qaeda has operationally enabled Tehrik–e–Taliban Pakistan (TTP) to hit targets of strategic choice in Pakistan, ISKP has carried out spectacular terrorist attacks in Afghanistan, Pakistan, Iran, and most recently Moscow.\nA failure to do so guarantees that Taliban–inspired terrorist attacks will spare no one.", "location": "Afghanistan", "classification": "security", "score": 0.8498593722443816, "event_breakdown": "Security Events:\n\n1. On 9/11, terrorists attacked the World Trade Center in New York City.\n2. Following 9/11, terrorist attacks have increased in frequency.\n3. Al-Qaeda and ISKP have resumed carrying out terrorist attacks across the region.\n4. Al-Qaeda has operationally enabled TTP to carry out terrorist attacks in Pakistan.\n5. ISKP has carried out terrorist attacks in Afghanistan, Pakistan, Iran, and most recently Moscow.\n6. The United Nations adopted the Global Counter-Terrorism Strategy on 8 September 2006."}, {"id": "a389e31f-f201-4697-ba6b-33ff104bdf00", "title": "Two Hezbollah members killed in strike in central Syria", "date": "2024-05-25 13:45", "url": "https://www.jpost.com/breaking-news/article-802603", "message": "Two members of the Hezbollah terrorist organization were killed in a strike in central Syria, according to a Saturday KAN report.\nReports in Syria state that the strike is allegedly attributed to Israel.\nAround the same time, strikes were reported in the villages of Markaba and Yaroun in southern Lebanon, Ynet reported, citing the Hezbollah-affiliated Al-Mayadeen new channel.\nYnet also cited another Hezbollah-affiliated television station, Al-Manar, which reported a strike on a house in Al-Adisa near a UNIFIL post.\nThis is a developing story.", "location": ")\nSYRIA", "classification": "security", "score": 0.8844249146496999, "event_breakdown": ".\n1. Two members of the Hezbollah terrorist organization were killed in a strike in central Syria, attributed to Israel.\n2. Strikes were reported in the villages of Markaba and Yaroun in southern Lebanon.\n3. According to another Hezbollah-affiliated television station, Al-Manar, a strike was reported on a house in Al-Adisa near a UNIFIL post."}, {"id": "89f76861-477b-47ee-8edf-b0d767c35ee4", "title": "Satellite images reveal damage from attack on occupier communication point in Alushta", "date": "2024-05-25 13:30", "url": "https://www.yahoo.com/news/satellite-images-reveal-damage-attack-125000880.html", "message": "Satellite images showing the aftermath of a May 23 missile attack on a strategic Russian military facility in temporarily occupied Alushta have appeared on social media, published by the Telegram channel of Radio Svoboda.\nThey show that the rocket attack resulted in at least four hits.\nRead also: Zelenskyy on Crimean Tatar deportation: Unpunished crimes, revived disregard for human life\"Photos from space show locations where rockets likely struck.\nRead also:The Ukrainian side has not yet officially commented on the rocket attack.\nThe target was the FSB border service contact point in the village of Semidvirya, according to some sources.", "location": "Alushta", "classification": "security", "score": 0.4590701877109556, "event_breakdown": "1. May 23, 2022: Rocket attack on the FSB border service contact point in the village of Semidvirya in Alushta Oblast, temporarily occupied by Russia."}, {"id": "ecb80784-e2b2-4db8-acc7-34f45d3346f5", "title": "Heartbroken families sue Instagram and  Call of Duty  maker over deadly school attack", "date": "2024-05-25 11:45", "url": "https://www.mirror.co.uk/news/us-news/heartbroken-families-sue-instagram-call-32890600", "message": "They also filed another lawsuit against Daniel Defense, which manufactured the AR-style rifle used in the May 24, 2022, shooting.\nThe lawsuit against Meta and Activision Blizzard - the maker of Call of Duty - was filed in California with additional families of victims from the attack.\nThe families also accused Instagram of doing little to enforce its rules that ban marketing firearms and harmful content to children.\nAt least two other lawsuits have been filed against Daniel Defense.\nThe Mirror has contacted Meta, Activision Blizzard and Daniel Defense for comment.", "location": "California.", "classification": "security", "score": 0.724225577250092, "event_breakdown": "Security Events:\nMay 24 2022 Shooting - School Shooting - 21 people dead, 17 people injured.\nLawsuit against Meta and Activision Blizzard by families for doing more to prevent school shootings.\nLawsuit against Daniel Defense for the rifle used in school shooting.\nLawsuit against Daniel Defense for filing for an increased share in the school shooting.\nLawsuit against Daniel Defense for the shooting incident at \"Robb Elementary\" elementary school."}, {"id": "6f2b1ccf-490f-48c2-a3da-f12d4e16fa04", "title": "One killed in a car bombing in Damascus", "date": "2024-05-25 11:45", "url": "https://www.thenationalnews.com/news/mena/2024/05/25/one-killed-in-a-car-bombing-in-damascus/", "message": "One person was killed in a car bombing in Damascus on Saturday, the official Syrian news agency Sana reported.\nSana, quoting a police official, said an explosive device went off in a car in the Mazzeh district, killing one person.\nREAD MORE Two IRGC generals killed in Israeli strike on Iranian embassy compound in DamascusSecurity incidents, including blasts targeting military and civilian vehicles, occur intermittently in the capital of war-ravaged Syria.\nThe explosion comes against a backdrop of heightened regional tensions, including the war between Israel and the Iran-backed Palestinian militant group Hamas in the Gaza Strip.\nLast month, an explosive device went off in a car in Mazzeh, an upscale neighbourhood of Damascus, without causing any casualties, Sana reported at the time.", "location": "Damascus", "classification": "security", "score": 0.9976451324365376, "event_breakdown": "1. Security incident in Damascus, Syria: One person was killed in a car bombing in Mazzeh District, Damascus.\n2. Security incident in Damascus: An explosive device went off in a car in the same district, Mazzeh, without causing any casualties."}, {"id": "6bb50ee4-bef0-408b-9c2f-fbfd6470b043", "title": "Israeli drone attack kills 2 Hezbollah members in central Syria : war monitor - Xinhua", "date": "2024-05-25 13:15", "url": "https://english.news.cn/20240525/cb07b2f7b40f487bb073558c86879a43/c.html", "message": "DAMASCUS, May 25 (Xinhua)-- An Israeli drone struck a car and a truck affiliated with Hezbollah near the city of Al-Qusayr in Syria's central Homs province on Saturday, killing two members of the Lebanese armed group, a war monitor reported.\nThe Britain-based watchdog group said that two Hezbollah members were killed, and several others, whose nationalities remained unknown, were injured in the attack.\nThe Observatory's data showed that these strikes have killed 141 military personnel and injured 57 others.\nAmong the fatalities are 21 Iranians from the Islamic Revolutionary Guard Corps, 27 Hezbollah members, 12 Iraqis, 31 Syrian members of Iran-affiliated militias, and 10 non-Syrian members of Iran-affiliated militias.\nAdditionally, 40 Syrian military personnel and 12 civilians, including two women, have been killed, with about 20 civilians sustaining injuries in the attacks.", "location": "Homs, Syria", "classification": "security", "score": 0.9981889286739539, "event_breakdown": "Security events list:\n- There was a US airstrike that targeted militia groups in eastern Syria.\n- 2 Hezbollah members were killed and 4 others were injured when an Israeli drone struck two vehicles in Syria's Homs province.\n- An Israeli airstrike killed one Syrian soldier and injured two others in Aleppo province.\n- An estimated 161 Syrian soldiers and pro-Iranian militiamen have been killed in airstrikes over the past month, 162 vehicles and 358 weapon-laden shipping containers have been destroyed."}, {"id": "78c0fcde-3f2c-48c4-be2b-132c9fa2cfe6", "title": "Israel strikes Rafah after top UN court orders it to halt offensive", "date": "2024-05-25 12:15", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_375335.html", "message": "Israeli air strikes and artillery pounded Rafah, Saturday, despite the U.N.'s top court ordering an immediate halt to its military offensive in the southern Gazan city.\nThe Hague-based ICJ, whose orders are legally binding but lack direct enforcement mechanisms, also instructed Israel to keep the Rafah crossing between Egypt and Gaza, which Israel closed earlier this month, open.\nIsrael gave no indication it was preparing to change course in Rafah, insisting the court had got it wrong.\nIn spite of the ICJ ruling, Israel carried out strikes throughout the Gaza Strip, Saturday morning, as fighting raged between the army and Hamas's armed wing.\nThe U.N. court ordered Israel to allow U.N.-mandated investigators \"unimpeded access\" to Gaza to look into the genocide allegations.", "location": "Rafah", "classification": "security", "score": 0.764749580925212, "event_breakdown": "Event 1: Israeli air strikes and artillery pounded Rafah, Saturday.\nEvent 2: The Hague-based ICJ ordered Israel to halt its offensive in Rafah.\nEvent 3: Israel gave no indication that it would change course in Rafah, insisting the court had got it wrong.\nEvent 4: In spite of the ICJ ruling, Israel carried out strikes throughout the Gaza Strip.\nEvent 5: The U.N. court ordered Israel to allow U.N.-mandated investigators access to Gaza to look into genocide allegations.\nEvent 6: Fighting raged between the army and Hamas's armed wing.\n\nThese are some of the security-related events in the provided text."}, {"id": "c2bd8400-a730-4886-b700-d338ff1bea90", "title": "Aid groups are flying Gaza children to U . S . for health care . Boy , 12 , lands in St . Louis . ", "date": "2024-05-25 12:15", "url": "https://www.stltoday.com/news/local/government-politics/aid-groups-are-flying-gaza-children-to-u-s-for-health-care-boy-12-lands/article_710d776c-16c8-11ef-9ab5-7bfb22e77e40.html", "message": "ST. LOUIS — A dozen people stood waiting anxiously one recent night at Lambert St. Louis International Airport.\nFor Hadi Zaqout, 12, landing in St. Louis \"felt like a dream,\" he said.\nA spokeswoman for Shriners St. Louis, which specializes in treating orthopedic and neuromuscular conditions, said the hospital does not publicly discuss individual patients.\nPhotos: 13-year-old Palestinian boy arrives in St. Louis for medical treatment Heal Palestine volunteers greet Hadi Zakout at St. Louis Lambert International Airport.\nHeal Palestine volunteers greet Hadi Zakout, 12, at St. Louis Lambert International Airport Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinian refugees come to St. Louis for medical treatment Palestinians in St. Louis for medical treatment share their story during protest", "location": "St. Louis", "classification": "security", "score": 0.6322881659668035, "event_breakdown": "* 13-year-old Palestinian boy arrives in St. Louis for medical treatment\n* Palestinian refugees come to St. Louis for medical treatment"}, {"id": "0dcb7f5d-6519-4348-92d4-f6007295c4e9", "title": "Pakistan to compensate families of slain Chinese workers", "date": "2024-05-25 12:00", "url": "https://www.globalsecurity.org/wmd/library/news/pakistan/2024/pakistan-240524-voa01.htm", "message": "Pakistan to compensate families of slain Chinese workersBy Sarah Zaman May 24, 2024Pakistan will pay more than $2 million to the families of Chinese workers killed in a suicide bombing this year.\nFive Chinese workers and their Pakistani driver were killed on March 26 when a suicide bomber rammed an explosive-laden vehicle into their convoy in the country's northwestern Khyber Pakhtunkhwa province.\nIn a visit to Dasu, days after the attack, Pakistani Prime Minister Shahbaz Sharif vowed \"fool-proof\" security arrangements in a meeting with Chinese workers at the hydropower project.\nA special military unit as well as local law enforcement are already responsible for the security of Chinese nationals in Pakistan.\nIn 2021, an attack on a bus carrying workers to the same hydropower project killed 13 people including at least nine Chinese nationals.", "location": "Khyber Pakhtunkhwa province.", "classification": "security", "score": 0.7160478707953515, "event_breakdown": "Here are the security events from the text:\n- March 26, 2024: Suicide bombing in Khyber Pakhtunkhwa province, Pakistan, kills five Chinese workers and their Pakistani driver.\n- March 26, 2024: Pakistani Prime Minister Shahbaz Sharif promises \"fool-proof\" security measures during a meeting with Chinese workers at the Dasu hydropower project, Khyber Pakhtunkhwa.\n- A special military unit and local law enforcement officials are already responsible for the security of Chinese nationals in Pakistan.\n- October 9, 2021: A bus attack at the Dasu hydropower project kills 13 people including at least nine Chinese nationals."}, {"id": "33eeeb29-ca8f-4bb1-be87-4151d00e194f", "title": "Decommissioning The Trusty F - 4 , Koreans Pay Tribute", "date": "2024-05-25 09:45", "url": "https://menafn.com/1108255372/Decommissioning-The-Trusty-F-4-Koreans-Pay-Tribute", "message": "To secure air superiority over the DPRK, the ROK Air Force Chief of Staff Chang Ji-ryang proposed acquisition of the F-4 in the“Five-Year Air Force Enhancement Plan” in 1966.\nAt that time, to effectively operate South Korea's“only” strategic asset, the F-4, the ROK Air Force set a goal to complete F-4 operational readiness by the late 1970s .\nAll told , the ROK Air Force set up a total of 92 F-4D units, 27 RF-4C reconnaissance units and 103 F-4E units.\nTo secure air superiority over the DPRK, the ROK Air Force Chief of Staff Chang Ji-ryang proposed acquisition of the F-4 in the“Five-Year Air Force Enhancement Plan” in 1966.\nAll told , the ROK Air Force set up a total of 92 F-4D units, 27 RF-4C reconnaissance units and 103 F-4E units.", "location": "SEOUL", "classification": "security", "score": 0.5786232544458009, "event_breakdown": "The text discusses the acquisition of F-4 aircraft by the ROK Air Force to secure air superiority over North Korea. The ROK Air Force decided to set up a total of 92 F-4D units, 27 RF-4C reconnaissance units, and 103 F-4E units to achieve this goal. These events are listed as follows:\n\n1. The ROK Air Force proposed acquisition of the F-4 in the Five-Year Air Force Enhancement Plan in 1966.\n2. The ROK Air Force set a goal to complete F-4 operational readiness by the late 1970s.\n3. The ROK Air Force set up a total of 92 F-4D units, 27 RF-4C reconnaissance units, and 103 F-4E units."}, {"id": "c6809e91-52b4-4b82-b97c-d27acc70e230", "title": "Physical Training Key To Military Operational Readiness – CDS", "date": "2024-05-25 13:00", "url": "https://leadership.ng/physical-training-key-to-military-operational-readiness-cds/", "message": "The Chief of Defence Staff (CDS), Gen. Christopher Musa has stated that sporting activities are critical to sharpening the physical fitness, mental alertness and skills of military personnel to ensure combat readiness.\nHe said the security challenges confronting the nation has made the Armed Forces to evolve continuous joint training with emphasis on physical training and sports.\n“Accordingly, physical fitness and mental alertness of personnel have become key considerations for the armed forces to meet the increasing demands of current and emerging threats,” he said.\nSix NAF Commands including the Tactical Air Command, Ground Training Command, Air Training Command, Special Operations Command, Logistics Command, Mobility Command and NAF Headquarters teams competed in the tournament.\nThe NAF headquarters emerged the overall winner,l while the Ground Training Command came second and the Logistics Command came third.", "location": "KADARE, Nigeria", "classification": "security", "score": 0.802270706505529, "event_breakdown": "Here are the security events mentioned in the text:\n\n1. Continuous joint training by the armed forces to deal with security challenges.\n2. Emphasis on physical fitness and mental alertness to meet the increasing demands of current and emerging threats.\n3. A sports tournament organized by the Nigerian Air Force (NAF) involving six commands to enhance physical fitness and mental alertness of military personnel.\n4. The NAF headquarters won the tournament, while Ground Training Command came second and Logistics Command came third.\n\nNote: The text doesn't mention any specific locations or maps for the security events listed."}, {"id": "9ce1818d-6556-42a8-8d45-c64a386017a4", "title": "UK intelligence expects new arrests in Russian Defence Ministry", "date": "2024-05-25 13:00", "url": "https://www.yahoo.com/news/uk-intelligence-expects-arrests-russian-094515195.html", "message": "The Defence Intelligence of the United Kingdom has highlighted the entrenched corruption within the structures of the Russian Ministry of Defence and, in connection with this, expressed expectations of new arrests within the ministry.\nSource: UK Defence Intelligence review dated 25 May, as reported by European PravdaDetails: The ministry mentioned the latest in a series of arrests of officials from the Russian Ministry of Defence, when on 23 May, Russian Deputy Chief of the General Staff Vadim Shamarin was detained on suspicion of bribery.\nThis followed recent arrests of other high-ranking officials of the Russian Ministry of Defence also suspected of corruption – Deputy Defence Minister Timur Ivanov, and Head of Personnel Yury Kuznetsov.\n\"Corruption is deeply rooted in the Russian MOD, and it is likely that there will be further arrests,\" the review stated.\nBackground:UK Defence Intelligence said that Russia is stepping up its war against Ukraine with resources previously earmarked for Africa, including the African Corps, which includes former Wagnerites.", "location": "Russia", "classification": "security", "score": 0.41282137236604705, "event_breakdown": "Events:\n- Arrest of Russian Deputy Chief of the General Staff Vadim Shamarin on suspicion of bribery (UK Defence Intelligence review dated 25 May)\n- Arrest of Russian Deputy Defence Minister Timur Ivanov on suspicion of corruption (UK Defence Intelligence review dated 25 May)\n- Arrest of Head of Personnel Yury Kuznetsov on suspicion of corruption (UK Defence Intelligence review dated 25 May)"}, {"id": "fce625e6-77d2-49d2-8284-ad45e1a03b5c", "title": "Israeli Genocide in Gaza : 231 Days of Horror Result in 35 , 857 Dead , 80 , 293 Injured", "date": "2024-05-25 13:00", "url": "https://english.almanar.com.lb/2118492", "message": "The brutal Israeli occupation in Gaza has led to the deaths of 35,857 Palestinians and left 80,293 others injured in the span of 231 days of relentless aggression since October 7.\nIn just 24 hours, Israeli forces carried out six massacres in Gaza, resulting in the deaths of 57 individuals and injuring 193 others.\npic.twitter.com/v01LNQF6EK — Quds News Network (@QudsNen) May 24, 2024Women and children make up the majority of the victims, according to Palestinian and international groups.\npic.twitter.com/GLppwxPmzS — TIMES OF GAZA (@Timesofgaza) May 24, 2024As international pressure mounts, Israeli Prime Minister Benjamin Netanyahu faces charges of war crimes in Gaza.\nAnd what will the… pic.twitter.com/l1niW3ZIOt — Quds News Network (@QudsNen) May 25, 2024The ongoing genocide in Gaza must be stopped, and perpetrators held accountable for their heinous actions.", "location": "GAZA", "classification": "security", "score": 0.8876252821046918, "event_breakdown": "Event 1: Israeli occupation in Gaza from October 7, 2022 - 231 days of aggression against Palestinians\nEvent 2: Six massacres in Gaza within the span of 24 hours from May 24 - 25, 2024\nEvent 3: Extensive loss of lives in Gaza due to Israeli aggression: 35,857 fatalities and 80,293 injuries\nEvent 4: Israeli military aggression disproportionately affects women and children\nEvent 5: International pressure on Israel for war crimes in Gaza\nEvent 6: Benjamin Netanyahu charged with war crimes in Gaza\nEvent 7: Repetitive occurrences of events resulting in the ongoing genocide in Gaza\nEvent 8: Demands for an end to the genocide in Gaza and the holding of perpetrators accountable"}, {"id": "ed9f9b25-93f7-4014-b3d8-1a1a35e6547d", "title": "US - supplied HIMARS  completely ineffective  against superior Russian jamming technology , report says", "date": "2024-05-25 13:00", "url": "https://www.yahoo.com/news/us-supplied-himars-completely-ineffective-120222342.html", "message": "Russian jamming has rendered US-supplied HIMARS rocket launchers \"completely ineffective.\"\nUS-supplied HIMARS rocket launchers have been rendered \"completely ineffective\" as a result of Russian electronic jamming systems, a new report said.\nAccording to the assessment, Russian jamming can cause the missiles to miss a target by 50 feet or more.\nEarlier this week, a report revealed that US-supplied glide bombs were also continually missing their targets as a result of Russian jamming.\nThe Russian jamming system operates from the ground, projecting a \"cone\" that prevents weapons from communicating with satellites.", "location": "Ukraine", "classification": "security", "score": 0.44100118656253456, "event_breakdown": "Events:\n- US-supplied HIMARS rocket launchers rendered \"completely ineffective\" by Russian electronic jamming systems, according to a report.\n- Russian jamming can cause missile launches to miss a target by 50 feet or more, said assessment.\n- Russian electronic jamming systems causing US-supplied weapons to consistently miss targets, including HIMARS rocket launchers and glide bombs."}, {"id": "1216befe-3618-4653-8c4e-b52d00bf61db", "title": "US - supplied HIMARS  completely ineffective  against superior Russian jamming technology , report says", "date": "2024-05-25 13:00", "url": "https://www.yahoo.com/news/us-supplied-himars-completely-ineffective-120222445.html", "message": "Russian jamming has rendered US-supplied HIMARS rocket launchers \"completely ineffective.\"\nUS-supplied HIMARS rocket launchers have been rendered \"completely ineffective\" as a result of Russian electronic jamming systems, a new report said.\nAccording to the assessment, Russian jamming can cause the missiles to miss a target by 50 feet or more.\nEarlier this week, a report revealed that US-supplied glide bombs were also continually missing their targets as a result of Russian jamming.\nThe Russian jamming system operates from the ground, projecting a \"cone\" that prevents weapons from communicating with satellites.", "location": "Ukraine", "classification": "security", "score": 0.44100118656253456, "event_breakdown": "Events:\n* US-supplied HIMARS rocket launchers rendered \"completely ineffective\" by Russian electronic jamming.\n* Russian jamming causes 50-foot misses in US-supplied missiles.\n* Russian ground jamming projects a \"cone\" preventing weapon-satellite communication."}, {"id": "13ab85ac-4bb2-46f0-94bd-0f790070c2c2", "title": "Uvalde families sue Meta and  Call of Duty  maker on 2nd anniversary of school attack", "date": "2024-05-25 01:45", "url": "https://www.wokv.com/news/uvalde-families-sue/4H7CPIFFTM4RGWBW4UOFQG34AQ/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the provided text, I was unable to determine a specific location for the main event. The error message states that access to the website", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "From the text provided, the security events are as follows:\n\n1. Attempt to access a website from outside the United States.\n2. Denied access to the website due to the country of access."}, {"id": "2cd89ac8-7a56-4dd9-a45c-07b3f0142abe", "title": "Israel  kills two Iran - backed Hezbollah fighters in drone strike in Syria , in move that could increase Middle East tensions after Tehran president helicopter crash death", "date": "2024-05-25 15:00", "url": "https://www.dailymail.co.uk/news/article-13459361/Israel-kills-two-Iran-backed-Hezbollah-fighters-drone-strike-Syria-increase-Middle-East-tensions-Tehran-presidents-helicopter-crash-death.html", "message": "Israel is understood to have killed two fighters from Lebanon's Iran-backed Hezbollah movement in a drone strike in Syria - a move that could increase tensions in the Middle East following the death of Tehran's president in a helicopter crash.\nThis is a third Israeli strike against Hezbollah targets in Syria in about a week.\nThe strikes have increased since Israel's war with Hamas in the Gaza Strip began on October 7.\nIsrael gave no indication it was preparing to change course in Rafah, insisting that the court had got it wrong.\nThe French presidency said they held talks on the Gaza war and ways to set up a Palestinian state alongside Israel.", "location": "Based on the text provided, I couldn't determine a specific location.", "classification": "security", "score": 0.45933787578614926, "event_breakdown": "Events:\nIsraeli drone strikes in Lebanon kill two Hezbollah fighters.\nIsraeli airstrikes in Syria against Hezbollah targets increase as Israel carries out a third strike in a week.\nIsraeli court rules against evacuating buildings in Rafah.\nFrench President held talks on Gaza war with Israel's Prime Minister and ways to set up a Palestinian state."}, {"id": "bb7a2501-fa24-47d1-93f9-676346ed8d59", "title": "Car explosion kills at least one in Syria Damascus | Syria War News", "date": "2024-05-25 16:45", "url": "https://www.aljazeera.com/news/2024/5/25/killed-in-car-explosion-in-syria-damascus", "message": "The explosion comes as an Israeli drone attack reportedly targeted a car and a truck near Syria’s border with Lebanon.\nA car explosion has killed one person in Syria’s capital Damascus, Syrian news agency SANA reported, without identifying the victim.\n“One person was killed when an explosive device exploded in their car in the Mezze district,” a police official quoted by SANA said.\nThe explosion comes against a backdrop of heightened regional tensions, including Israel’s war on Gaza.\nSyria’s war has killed more than half a million people and displaced millions more since it erupted in 2011 after Damascus cracked down on antigovernment protests.", "location": "Mezze, Damascus", "classification": "security", "score": 0.9949934986480965, "event_breakdown": "1. A car explosion was reported in Syria’s capital Damascus, killing one person. Mezze district was the location. The cause of the blast was said to be an explosive device.\n2. Israel targeted a car and a truck near Syria’s border with Lebanon. The target was allegedly by an Israeli drone attack."}, {"id": "d035964b-e40b-40b2-819d-7ee7de88a5dd", "title": "Car bomb in the Syrian capital kills one . Drone strike near Lebanon border targets two vehicles", "date": "2024-05-25 16:00", "url": "https://www.stripes.com/theaters/middle_east/2024-05-25/car-bomb-syria-capital-drone-strike-lebanon-border-13973775.html", "message": "Damascus’ Mazze neighborhood houses the Iranian consulate, destroyed last month in a strike blamed on Israel.\nState news agency, SANA, didn’t say who the person killed was but said the blast set two other cars ablaze.\nThe Beirut-based Al-Mayadeen TV didn’t say if there were casualties, but the Observatory said two Hezbollah members were killed and several others wounded in the drone strike.\nIran’s military presence in Syria has been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border.\nIsrael responded with a retaliatory war that has killed more than 35,000 Palestinians, many of them women and children, according to Gaza health officials.", "location": "Damascus", "classification": "security", "score": 0.9358082965247685, "event_breakdown": "First event: An explosion occurred in the Mazze neighborhood of Damascus, killing one person.\nSecond event: A drone strike targeted Hezbollah members in Syria, leaving two dead and several wounded.\nThird event: A strike targeted the Iranian consulate in Damascus, damaging the building.\nFourth event: Israel launched a retaliatory war in Gaza, killing more than 35,000 Palestinians."}, {"id": "26b5e110-a568-4300-bdbf-c2ffd3eb6268", "title": "Zelenskyy says Ukraine has taken back control in areas of Kharkiv region , aerial attacks continue", "date": "2024-05-25 17:30", "url": "https://www.clickondetroit.com/news/world/2024/05/25/zelenskyy-says-ukraine-has-taken-back-control-in-areas-of-kharkiv-region-aerial-attacks-continue/", "message": "KYIV – Ukrainian forces have secured “combat control” of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nRecommended VideosKharkiv is about 20 kilometers (12 miles) from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nIn addition to the ground offensive operation along Ukraine's northeastern border, Russia is continuing to bombard the Kharkiv region with missiles, guided aerial bombs and drones.", "location": "Kharkiv", "classification": "security", "score": 0.6612773680681135, "event_breakdown": "- Russian forces entered Kharkiv earlier this month.\n- Ukrainian forces secured combat control of the areas where Russian troops had entered.\n- The Ukrainian president said so."}, {"id": "47feb3fe-29db-4c6e-a636-d1b3c56d16e5", "title": "Russian strike on Kharkiv DIY store kills 2 , dozens wounded", "date": "2024-05-25 18:30", "url": "https://www.yahoo.com/news/russian-strike-kharkiv-diy-store-173929133.html", "message": "Kharkiv regional governor Oleg Synegubov said \"unfortunately there are already four dead\" and \"38 wounded\" after two guided Russian bombs hit the store.\nKharkiv, Ukraine's second-largest city, is just a few dozen kilometres from the border and regularly comes under attack from Russian missiles.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n- Border strikes -Russia and Ukraine accused each others' forces of attacks in the border area Saturday.\nRussia said that Ukraine shelled a small town in the Belgorod border region, killing two people and wounding 10.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.9361610093528608, "event_breakdown": "1. On Saturday, Russia accused Ukraine of shelling a small town in the Belgorod border region, killing two civilians and wounding 10.\n2. A regional governor said Russian missiles hit the store in the central city of Kharkiv on Sunday, killing four people and wounding 38.\n3. Kharkiv, Ukraine's second-largest city, is just a few dozen kilometres from the border and regularly comes under attack from Russian missiles after launching a ground offensive in the Kharkiv region on May 10."}, {"id": "7ce35167-7e24-468c-8fd3-b85bba2e84a0", "title": "Russian strike on Kharkiv DIY store kills 2 , dozens wounded", "date": "2024-05-25 19:15", "url": "https://www.digitaljournal.com/world/russian-strike-on-kharkiv-diy-store-kills-2-dozens-wounded/article", "message": "Kharkiv regional governor Oleg Synegubov said at least two people were killed when two guided Russian bombs hit the store.\nKharkiv, Ukraine’s second-largest city, is just a few dozen kilometres from the border and regularly comes under attack from Russian missiles — strikes on the city killed seven people Thursday.\n– Fresh strike –Later Saturday, another strike hit the centre of Kharkiv, injuring eight, Terekhov said, without giving details.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\nRussia said that Ukraine shelled a small town in the Belgorod border region, killing two and wounding 10.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.8661400768524951, "event_breakdown": "Security events:\n- Bomb strikes on Kharkiv city. Became a regular event in Ukraine.\n- A Russian missile reportedly killed seven people.\n- Another strike hit the centre of Kharkiv, injuring eight.\n- Russia launched a ground offensive against the Ukrainian city of Kharkiv.\n- Ukraine shelled a small town in the Belgorod border region. Two people were killed and 10 were injured."}, {"id": "13b8a322-02d2-4408-b1ea-570af887040f", "title": "Iran military supply line to Houthi terrorists exposed by dissident group", "date": "2024-05-25 10:30", "url": "https://www.yahoo.com/news/irans-military-supply-line-houthi-080025880.html", "message": "On March 18, reports noted that the Israel Defense Forces confirmed a Houthi cruise missile had infiltrated Israel, landing near Eilat.\n\"Military weapons and equipment were concealed inside these fenders,\" the MEK said, but the group had no information about the cargo’s final destination.\nIn addition to training, Taleblu also sees signs that Yemen \"has been a testing ground for Iranian weapons.\"\nIran’s relationship with the Houthis is key in its strategy to cause harm to Israel, Taleblu says.\nOriginal article source: Iran's military supply line to Houthi terrorists exposed by dissident group", "location": "YASTANONIM - ISRAEL", "classification": "security", "score": 0.9053413967696197, "event_breakdown": "The events that can be placed on a map from the text are:\n- Houthi missile hit landed in Israel near Eilat, confirmed it had infiltrated the country by Israel Defense Forces (March 18).\n- MEK said military equipment was concealed inside military equipment that landed near Eilat, but they knew nothing about the final destination of the equipment."}, {"id": "ac6aeddd-db9d-4cdf-8fca-99f55a968cb7", "title": "Ukraine gain control in Kharkiv border areas : Zelenskiy", "date": "2024-05-25 17:30", "url": "https://www.canberratimes.com.au/story/8641042/ukraine-gain-control-in-kharkiv-border-areas-zelenskiy/?cs=14232", "message": "Kharkiv is about 20 km from the Russian border.\nMoscow's troops have in recent weeks captured villages in the area as part of a broad push, and analysts say they may be trying to get within artillery range of the city.\nUkrainian authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.4936942821027589, "event_breakdown": "Security events in Kharkiv, Ukraine:\n\n1. Russian military captures villages close to Kharkiv.\n2. Russian military tries to enter in artillery range of Kharkiv.\n3. Ukrainian authorities evacuate 11,000 people from the region since the start of the offensive."}, {"id": "742597fd-ff20-4cc0-b69d-85a843a8c5a4", "title": "Islamic Revolutionary Guard Corps :  Ideological army  for special assignments", "date": "2024-05-25 18:45", "url": "https://www.ynetnews.com/article/skzm4y1v0", "message": "The Revolutionary Guard was founded shortly after the Islamic revolution bringing Ayatollah Ruhollah Musavi Khomeini to power.\nHowever, the Iranian army has changed in recent years, and its leaders are almost completely loyal to the Revolutionary Guard.\nA report in the Saudi newspaper Asharq Al-Awsat estimates that the Revolutionary Guard has over 25 thousand officers in various units, commanded by Hossein Salami, appointed by Khamenei as commander-in-chief of the Islamic Revolutionary Guard Corps in 2018.\nOne of the better-known Revolutionary Guard units is the Quds Force – a military espionage Revolutionary Guard force, that operates beyond Iranian borders.\nThe United States, for example, designated the Revolutionary Guard as a terrorist organization in 2019 and the European Union imposed sanctions on members of the Revolutionary Guard.", "location": "Iran", "classification": "security", "score": 0.9840392056729075, "event_breakdown": "1. Revolutionary Guard is founded at the beginning of the Iranian revolution.\n2. The army changed its loyalty to the Revolutionary Guard.\n3. Crown Prince of Saudi Arabia estimates that Revolutionary Guard has over 25 thousand officers in many military units.\n4. The Quds force is a military espionage force that works beyond Iranian borders.\n5. The U.S. designated the Revolutionary Guard as terrorist organization in 2019 and European Union imposed sanctions on Revolutionary Guard members."}, {"id": "a55c4a7b-f319-4468-a7b8-78bf94313795", "title": "Russian strike on Kharkiv hardware store kills two : official - World", "date": "2024-05-25 15:00", "url": "https://www.brecorder.com/news/40305239/russian-strike-on-kharkiv-hardware-store-kills-two-official", "message": "KYIV: A Russian strike on Saturday hit a store selling building materials in the eastern Ukrainian city of Kharkiv, killing at least two people, its mayor said.\n“We know for sure about two dead,” Kharkiv mayor Igor Terekhov wrote on Telegram, saying that according to preliminary information the strike hit a hypermarket for construction materials in a residential area.\nKharkiv regional governor Oleg Synegubov said that “two Russian guided bombs hit a construction hypermarket” and “a fire broke out over 15,000 square metres”.\nThere are many wounded,” Terekhov wrote on Telegram.\nRussia launched a ground offensive in the northeastern Kharkiv region on May 10, but Ukraine said Friday that it had managed to halt its progress.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.622903045778866, "event_breakdown": "- Two people were killed as a result of a Russian military strike on a store selling building materials in the eastern Ukrainian city of Kharkiv on May 21.\n- The mayor of Kharkiv, Igor Terekhov, said preliminary information indicated the strike hit a hypermarket in a residential area of the cityand that there were also many wounded people."}, {"id": "38eb2849-cda3-4b9b-a3fd-dfdfd1a7fe01", "title": "Israeli Strike Kills 2 Hezbollah Fighters In Syria As Violence Escalates", "date": "2024-05-25 15:30", "url": "https://www.ndtv.com/world-news/israeli-strike-kills-2-hezbollah-fighters-in-syria-as-violence-escalates-5743107", "message": "It was the third strike against Hezbollah targets in Syria in about a week (Representational)An Israeli drone strike in central Syria killed two fighters from Lebanon's Iran-backed Hezbollah movement on Saturday, a war monitor said.\nIt was the third strike against Hezbollah targets in Syria in about a week.\nOn Monday, Israeli strikes in the Qusayr area, which is close to the Lebanese border, killed eight pro-Iranian fighters, said Observatory, a Britain-based monitor with a network of sources in Syria.\nAt least one Hezbollah fighter was among those killed, a source from Hezbollah told AFP at the time.\nIsrael has carried out hundreds of strikes in Syria since the outbreak of the civil war in its northern neighbour, mainly targeting army positions and Iran-backed fighters including from Hezbollah.", "location": "SYRIA", "classification": "security", "score": 0.86923630019613, "event_breakdown": "* Israeli drone strike in central Syria killed two Hezbollah fighters on Saturday\n* Another Israeli drone strike left three pro-government fighters dead in the Menyari region\n* The incident also led to the death of a fighter from the Syrian National Defense Forces, says state media\n* Two explosions were heard in the western Daraa countryside on Monday and the air defense missile system was activated\n* Anti-aircraft defenses shot down an Israeli drone"}, {"id": "b7e73d87-26ab-498a-a6f0-0838b8dc4b88", "title": "At least two killed and others missing after Russia strikes hardware store in Kharkiv", "date": "2024-05-25 18:45", "url": "https://edition.cnn.com/2024/05/25/europe/kharkiv-russian-strike-hypermarket-ukraine-intl/", "message": "CNN —At least two people have been killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\n“The air raid siren went off and some people managed to get out of the building, roughly 100 people.\nHowever there were still people inside the building,” Oleh Syniehubov, the head of the Kharkiv regional military administration, said Saturday in an interview on national television.\n“There is not a single military object nearby,” he added.\nSeven people were killed in Russian strikes on the city Thursday, after locations including a printing house were targeted.", "location": "KHARKIV", "classification": "security", "score": 0.572975603058428, "event_breakdown": "format\n* At least 2 people were killed and 33 injured in a Russian strike in Kharkiv, Ukraine on Saturday.\n* 100 people were able to evacuate the building, but roughly 100 people were inside the building still."}, {"id": "dfa0c571-e5b9-4642-b5ee-ef61fe9df5c6", "title": "Israel presses on with strikes in Gaza after World Court ruling", "date": "2024-05-25 15:15", "url": "https://www.swissinfo.ch/eng/israel-presses-on-with-strikes-in-gaza-after-world-court-ruling/78620820", "message": "Gaza ceasefire talks could soon resume but Israel-Hamas war rages onreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Prospects for a resumption of mediated Gaza ceasefire talks grew on Saturday although Israel carried out new attacks in which Palestinian medics said more than 40 people were killed.\nHe said several people were killed, adding: “Even schools are not safe anymore.”The Israeli military said it was looking into the report.\nThe Israeli military said its troops in the northern district of Jabalia killed dozens of militants in close combat and airstrikes.\nEarlier in the war, Rafah became a refuge for Gazans fleeing fighting elsewhere.\nIsraeli officials said on Saturday that the World Court’s order does not rule out all military action in the area.", "location": "GAZA", "classification": "security", "score": 0.6436074540883062, "event_breakdown": "1. Israeli air strikes kill dozens of Palestinians.\n2. There are reports of several civilian casualties, including a school in Rafah, a city that became a refuge for those fleeing fighting in other parts of Gaza, according to Palestinian medics.\n3. Hamas militants were killed by Israeli troops in the northern district of Jabalia."}, {"id": "78387eb4-d6cc-44c7-b3ee-37c87edab8a1", "title": "Russia - Ukraine updates : Zelenskyy says Ukraine has taken back control in areas of Kharkiv region", "date": "2024-05-25 19:15", "url": "https://www.9news.com.au/world/russia-ukraine-updates-zelenskyy-says-ukraine-taken-back-control-in-areas-of-kharkiv-region/832dc9e2-f947-43bf-a334-35912cde1f32", "message": "Ukrainian forces have secured \"combat control\" of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nKharkiv is about 20 kilometres from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nA police officer examines fragments of a guided bomb after the Russian air raid in Kharkiv, Ukraine, Tuesday, April 30, 2024.\nUkrainian soldiers take part in radiation, chemical and biological hazard drills near Kharkiv, Ukraine, on February 29.", "location": "Kharkiv", "classification": "security", "score": 0.4881384135232103, "event_breakdown": "These are the related security events found in the text:\n- Ukrainian forces securing \"combat control\" of areas where Russian troops entered northeastern Kharkiv.\n- The fighting in Vovchansk after Russia launched an offensive in the Kharkiv region.\n- Russian air raid in Kharkiv.\n- Security training for Ukrainian soldiers near Kharkiv, including radiation, chemical, and biological hazard drills."}, {"id": "5e918a79-f5a8-4ffe-8094-4f54ade6fd88", "title": "Russia hits Kharkiv supermarket in deadly attack", "date": "2024-05-25 18:30", "url": "https://www.euronews.com/my-europe/2024/05/25/russia-hits-kharkiv-supermarket-in-deadly-attack", "message": "By Euronews with APUkrainian president Volodymyr Zelenskyy called the airstrike “a manifestation of Russian madness\".\nUkrainian president Volodymyr Zelenskyy said more than 200 people could have been inside the store.\n\"Only madmen like [Russian President Vladimir] Putin are capable of killing and terrorising people in this way,\" Zelenskyy added.\nFirefighters put out a fire after two guided bombs hit a large construction supplies store in Kharkiv, Ukraine, Saturday, May 25, 2024.\nRussian president Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.", "location": "Kharkiv", "classification": "security", "score": 0.4142800030697502, "event_breakdown": "* An airstrike hit a large construction supply store in Kharkiv, Ukraine on May 25, 2024.\n* Ukrainian president Volodymyr Zelenskyy said more than 200 people could have been inside the store.\n* Firefighters put out a fire after the airstrike.\n* Ukrainian President Volodymyr Zelenskyy said the attack was a “manifestation of Russian madness.\"\n* Russian president Vladimir Putin said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks."}, {"id": "df8e178c-ff41-4093-b9cc-7fa2b2ce9efb", "title": "Spanish defence minister says Gaza war is  real genocide  ", "date": "2024-05-25 15:30", "url": "https://www.yahoo.com/news/spanish-defence-minister-says-gaza-145835131.html", "message": "MADRID (Reuters) - The Spanish defence minister said on Saturday that the conflict in Gaza is a \"real genocide\", as relations between Israel and Spain worsen following Madrid's decision to recognise a Palestinian state.\nThe remark by Spanish Defence Minister Margarita Robles in an interview with TVE state television echoed a comment by Spanish Deputy Prime Minister Yolanda Diaz who earlier this week also described the Gaza conflict as a genocide.\n\"This is not against anyone, this is not against the Israeli state, this is not against the Israelis, who are people we respect,\" she said.\nIsrael's campaign in Gaza has killed nearly 36,000 Palestinians, according to Gaza health officials, and destroyed much of the enclave.\nSpanish Prime Minister Pedro Sanchez said on Wednesday that if more nations recognised the Palestinian state it would add to international pressure for a ceasefire between Israel and Hamas.", "location": "GAZA", "classification": "security", "score": 0.5275883169797415, "event_breakdown": "Events:\n- The conflict in Gaza between Israel and Palestinians\n- Statement by Spanish defence minister Margarita Robles that the conflict in Gaza is a \"real genocide\"\n- Visa restrictions by Israel on senior officials from the Basque region in Spain"}, {"id": "96a4aa7a-6daa-4138-87a3-0c6679c29a0e", "title": "Russian Strike on Kharkiv Hardware Store Kills Two - Official", "date": "2024-05-25 15:15", "url": "https://www.themoscowtimes.com/2024/05/25/russian-strike-on-kharkiv-hardware-store-kills-two-official-a85224", "message": "Kharkiv regional governor Oleh Syniehubov said at least two people were killed and 33 injured when \"two Russian guided bombs hit a construction hypermarket.\"\nThe latest attack came after Russia launched a ground offensive in the Kharkiv region on May 10.\n\"There were a lot of workers and shoppers inside,\" Zelensky said.\nIn the Kharkiv region, Russian troops mounted attacks Saturday in border areas.\nRussia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said in a statement.", "location": "Kharkiv", "classification": "security", "score": 0.9141099217881536, "event_breakdown": "- Russian troops launched an offensive in the Kharkiv region on May 10\n- Two people were killed and 33 injured when Russian guided munitions hit a construction hypermarket in the Kharkiv region\n- Russia shelled the village of Kupiansk-Vuzlovyi, wounding five"}, {"id": "3bf46225-0cbe-4d07-8b0c-75c553c931cd", "title": "ODonnell : Crimson Snow , Honor Is Met with Honor in a Deadly Shootout", "date": "2024-05-25 15:30", "url": "https://www.breitbart.com/politics/2024/05/25/exclusive-odonnell-crimson-snow-honor-is-met-with-honor-in-a-deadly-shootout/", "message": "One chilly night in the winter of 1864, the Union calvary met the Confederates’ surprise raid with a bloody defeat.\nAll along the way, Mosby’s men had intimidated their quarry through basic psychological warfare, riding around being “seen on every little hill and knoll” watching the Federals like hawks.\nFresh off their victory against Hunter, Mosby sought to vanquish Cole and his cavalry once and for all.\nSimultaneously, Mosby’s men fired into Cole’s tents.\nAlso, several of Mosby’s men fell into our hands.” One of those men was the mortally wounded Ranger Charlie Paxson.", "location": "The main event takes place at the Battle of Kelly's Ford, Virginia.", "classification": "security", "score": 0.773327278361305, "event_breakdown": "Security Events:\n\n1. A surprise raid by the Confederate calvary was met unsuccessfully by the Union calvary, resulting in the Confederates gaining victory.\n2. The Confederate calvary intimidated the Union forces by riding around and watching them, causing distress and fear.\n3. A battle between Cole and his cavalry and Mosby’s men took place, with the conclusion unknown.\n4. Several of Mosby’s men fell into Cole’s hands, presumably captured or killed.\n5. One of the Confederate men captured, Charlie Paxson, was mortally wounded, suggesting a fierce battle between the two sides.\n\nNote: These events are listed without conclusions or summaries, and they cover different locations due to the raid and conflicts among soldiers."}, {"id": "61a78210-c116-48b1-9ad0-632521b57b18", "title": "Israel presses on with strikes in Gaza after World Court ruling", "date": "2024-05-25 15:00", "url": "https://gazette.com/news/us-world/israel-presses-on-with-strikes-in-gaza-after-world-court-ruling/article_c5d29a2b-5062-55bb-9343-41ec1a904f05.html", "message": "The International Court of Justice, or World Court, has no means to enforce its emergency ruling in case brought by South Africa accusing Israel of genocide.\nMore than 35,000 Palestinians have been killed in Israel's offensive in Gaza, Gaza's health ministry says.\nA total of 31 Palestinians were killed in the past day in the Gaza Strip, according to local medical officials.\nThe Israeli military said its troops in Jabalia \"eliminated dozens of terrorists in close-quarters combat and aerial strikes.\"\nIsrael has said it is carrying out operations in Rafah, despite growing international opposition, to remove Hamas battalions holed up there.", "location": "GAZA", "classification": "security", "score": 0.7449722388617885, "event_breakdown": "Events:\n- More than 35,000 Palestinians have been killed in Israel's offensive in Gaza\n- A total of 31 Palestinians were killed in the past day in the Gaza Strip\n- Israeli military said its troops in Jabalia \"eliminated dozens of terrorists in close-quarters combat and aerial strikes\"\n- Israel has said it is carrying out operations in Rafah, despite growing international opposition, to remove Hamas battalions holed up there"}, {"id": "da3b2198-b70e-4dda-8c49-0d13b97459d1", "title": "At least two killed and others missing after Russia strikes hardware store in Kharkiv", "date": "2024-05-25 18:30", "url": "https://kesq.com/news/national-world/cnn-world/2024/05/25/at-least-two-killed-and-others-missing-after-russia-strikes-hardware-store-in-kharkiv/", "message": "By Maria Kostenko and Radina Gigova and Darya Tarasova, CNN(CNN) — At least two people have been killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\nOfficials have said there were nearly 200 people inside the building when the strike occurred.\nHowever there were still people inside the building,” Oleh Syniehubov, the head of the Kharkiv regional military administration, said Saturday in an interview on national television.\nSeven people were killed in Russian strikes on the city Thursday, after locations including a printing house were targeted.\nEvery day we call on the world: give us air defense, save people.", "location": "Kharkiv", "classification": "security", "score": 0.45319502477828777, "event_breakdown": ".\nFeb 27, 2022: Russian forces bomb a military unit in Kharkiv, Ukraine's second-largest city.\n15 killed, 34 people injured and 1 kid died on Feb 28, 2022 in Kharkiv, Ukraine after Russian strikes hit a civilian building sheltering 200+ people."}, {"id": "4b3cb54a-96ca-48ad-a8df-cc0c3f68ae92", "title": "Russian strike on Kharkiv : Number of casualties rises to 35 – video", "date": "2024-05-25 19:15", "url": "https://www.yahoo.com/news/russian-strike-kharkiv-number-casualties-155926697.html", "message": "The Epicentr store in Kharkiv following a Russian attack on 25 May.\nSource: Ihor Terekhov, Kharkiv Mayor, on Telegram; Epicentr K group of companies on FacebookQuote from Terekhov: \"The number of casualties has risen to 35.\"\nA large fire broke out as a result of the attack,\" Epicentr K explained.\nEpicentr K said that Russian forces have already destroyed six other Epicentre stores – in Mariupol, Chernihiv, Bucha, Kharkiv, Kherson and Nikopol.\nBy 17:45 (Kyiv time) on 25 May, the fire that broke out as a result of the Russian strike on the Epicentr store in Kharkiv had been contained.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8786003919159656, "event_breakdown": "* Russian forces attacked the Epicentr store in Kharkiv, Ukraine, causing a fire and several deaths.\n* The fire that broke out as a result of the attack was contained by 17:45 (Kyiv time) on 25 May 2022."}, {"id": "83c6ca91-7a0c-488a-b7d5-b72fc824276b", "title": "Man shot , killed in Battle Creek apartment", "date": "2024-05-25 18:30", "url": "https://www.yahoo.com/news/man-shot-killed-battle-creek-164013367.html", "message": "BATTLE CREEK, Mich. (WOOD) — A man was shot and killed in an apartment in Battle Creek early Saturday morning.\nAround 5:40 a.m., officers with the Battle Creek Police Department were sent to the Teal Run apartment complex, located at 5235 Horizon Dr. off of Glenn Cross Road, for a shooting.\nResponding officers found a 21-year-old Battle Creek man with several apparent gunshot wounds in an apartment where he was staying.\nAnyone with information is asked to call BCPD at 269.781.0911 or Silent Observer at 269.964.3888.\nFor the latest news, weather, sports, and streaming video, head to WOODTV.com.", "location": "BATTLE CREEK", "classification": "security", "score": 0.5743184917489744, "event_breakdown": "* 5:40 a.m.: Battle Creek Police Department sent to Teal Run apartment complex for a shooting\n* They found a 21-year-old Battle Creek man with multiple gunshot wounds in an apartment\n* Man was pronounced dead at the scene\n* Anyone with information is asked to call Battle Creek Police Department at 269.781.0911 or Silent Observer at 269.964.3888."}, {"id": "2d866ba4-b364-4584-b2fa-4503d13094eb", "title": "Warmonger Putin bombs hardware superstore in Kharkiv in  vile  attack - killing at least two , wounding more than 20 and sending huge column of black smoke into the sky", "date": "2024-05-25 15:45", "url": "https://www.dailymail.co.uk/news/article-13459425/Warmonger-Putin-bombs-hardware-superstore-Kharkiv-vile-attack-killing-two-wounding-20-sending-huge-column-black-smoke-sky.html", "message": "Two people have been killed and more than 20 injured after Russia bombed a superstore in the Ukrainian city of Kharkiv.\nPresident Volodymyr Zelensky has condemned the attack today - which sent a huge column of black smoke into the sky - as 'vile'.\nThe latest attack came after Russia launched a ground offensive in the Kharkiv region on May 10.\n'As of now, we know that more than 200 people could have been inside the hypermarket,' Zelensky said on Telegram.\nOn Saturday Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said in a statement.", "location": "Kharkiv", "classification": "security", "score": 0.7662670391161464, "event_breakdown": "-May 15 Russia bombed a superstore in the Ukrainian city of Kharkiv killing 2 people and wounding 20\n-May 10 Russia launched a ground offense in the Kharkiv region\n-May 15 Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region"}, {"id": "eedddd03-a4d3-4fd2-9e07-39e72a8ba209", "title": "Ukraine gain control in Kharkiv border areas : Zelenskiy", "date": "2024-05-25 19:30", "url": "https://www.goulburnpost.com.au/story/8641042/ukraine-gain-control-in-kharkiv-border-areas-zelenskiy/?cs=14264", "message": "Kharkiv is about 20 km from the Russian border.\nMoscow's troops have in recent weeks captured villages in the area as part of a broad push, and analysts say they may be trying to get within artillery range of the city.\nUkrainian authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.4936942821027589, "event_breakdown": "Security events in Kharkiv:\n1. Russian troops have captured villages near Kharkiv in recent weeks.\n2. Moscow's troops may be trying to get within artillery range of Kharkiv.\n3. Authorities have evacuated over 11,000 people from the region since the start of Moscow's offensive on May 10."}, {"id": "b9aaeff8-b220-4479-871d-dd16d8021c0a", "title": "Russian strikes on DIY store in Ukraine Kharkiv kill two , injure more than 30", "date": "2024-05-25 19:15", "url": "https://www.swissinfo.ch/eng/russian-strikes-on-diy-store-in-ukraine", "message": "Russian strikes on DIY store in Ukraine’s Kharkiv kill two, injure more than 303 minutesBy Max HunderKHARKIV, Ukraine (Reuters) -Russian strikes on a crowded DIY hardware store in the Ukrainian city of Kharkiv on Saturday killed at least two people, injured more than 30, and triggered a huge blaze, regional officials said.\n“The attack targeted the shopping centre, where there were many people – this is clearly terrorism,” Terekhov said.\nAndriy Kudinov, director of the suburban shopping centre, told local media the store was full of shoppers buying items for their summer cottages.\nUkraine’s second-largest city just 30 kilometres (18 miles) from the Russian border, Kharkiv has been the target of many weeks of Russian attacks.\nWitnesses described panicked scenes at the shopping centre.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.546471176543886, "event_breakdown": "* Russian strikes on a crowded DIY hardware store in the Ukrainian city of Kharkiv on June 11, 2022, killed at least two people.\n* The strike injured more than 30 people.\n* The strike triggered a huge blaze at the shopping centre."}, {"id": "9ea7620d-9d36-4bbe-addf-2a7fdb0a80d8", "title": "Hezbollah Fighters Mark Liberation Day by Dealing More Blows to Israeli Outposts", "date": "2024-05-25 17:00", "url": "https://english.almanar.com.lb/2118690", "message": "At 17:40, the Islamic Resistance fighters targeted a building used by “Israeli” soldiers in Margaliot settlement with rocket weapons in response to “Israeli” attacks on the steadfast southern villages and safe civilian homes.\nAt 19:30, the Islamic Resistance fighters targeted Al-Ramtha site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly.\nAt 23:35 on the night of Thursday, 23-05-2024, the Islamic Resistance fighters targeted a gathering of “Israeli” soldiers at Al-Sarwat Triangle opposite the town of Yaroun with rocket weapons.\nAt 17:20, the Islamic Resistance fighters targeted Al-Malkiya site with two Burkan rockets, hitting it directly.\nAt 18:30, the Islamic Resistance fighters targeted the border company headquarters at Doviv barracks with Falaq rockets, hitting it directly.", "location": "LEBANON", "classification": "security", "score": 0.9945128057108438, "event_breakdown": "1. Rocket attack by Islamic Resistance fighters on a building in Margaliot settlement.\n2. Rocket attack by Islamic Resistance fighters on a building in Kfar Shuba hills.\n3. Rocket attack by Islamic Resistance fighters on a building in Yaroun.\n4. Rocket attack by Islamic Resistance fighters on Al-Malkiya site.\n5. Rocket attack by Islamic Resistance fighters on Doviv barracks."}, {"id": "f9ac5c45-4f6a-48a2-a1e5-e3f01d72ae33", "title": "Spanish defence minister says Gaza war is  real genocide  ", "date": "2024-05-25 17:00", "url": "https://www.khaleejtimes.com/world/spanish-defence-minister-says-gaza-war-is-real-genocide", "message": "Spain's Minister of Defence Margarita Robles.\n— Photo: AFP filePublished: Sat 25 May 2024, 8:09 PM Last updated: Sat 25 May 2024, 8:10 PMThe Spanish defence minister said on Saturday that the conflict in Gaza is a \"real genocide\", as relations between Israel and Spain worsen following Madrid's decision to recognise a Palestinian state.\nThe remark by Spanish Defence Minister Margarita Robles in an interview with TVE state television echoed a comment by Spanish Deputy Prime Minister Yolanda Diaz who earlier this week also described the Gaza conflict as a genocide.\n\"We cannot ignore what is happening in Gaza, which is a real genocide,\" Robles said in the interview, during which she also discussed the Russian-Ukraine tension and conflicts in Africa.\n\"This is not against anyone, this is not against the Israeli state, this is not against the Israelis, who are people we respect,\" she said.", "location": "GAZA", "classification": "security", "score": 0.4136512783936661, "event_breakdown": "then expand.\n1. General tensions between the Spanish government and Israel worsened.\nReport: The Minister of Defence Margarita Robles said that conflicts plaguing Africa are a real crisis.\nShe mentioned Wars in Libya, Cameroon, Mali, Burkina Faso as well as the Sahel, Chad and the Lake Chad Basin and the eastern Congo.\n2. Islands in the Strait of Hormuz disrupting oil transportation, mines, and potential oil tanker attacks\n3. Cyber attacks over the world by several hackers. The government in Spain faced cyber attacks.\n4. IDF busy at the North and South parts of the Gaza strip. Air strikes by Israel."}, {"id": "14d2abcc-5562-487f-a197-ac142b37ef2c", "title": "Russian forces  capture another village in Ukraine  ", "date": "2024-05-25 15:15", "url": "https://www.dailymail.co.uk/news/article-13459337/Russian-forces-capture-village-Ukraine-war-machine-grinds-on.html", "message": "Russian forces have captured another village in Ukraine's eastern Donetsk region, while Kyiv says Moscow is intensifying attacks away from the northeastern Kharkiv region.\nThe Russian defence ministry said that troops had 'taken control of the village of Arkhangelske', located to the north of the city of Donetsk.\nRussian sources yesterday claimed that their president is ready to 'freeze the war' in Ukraine if a negotiated ceasefire that recognises the current battlefield lines can be agreed.\nUkraine's General Staff said on Saturday that Russian forces were \"particularly active\" near the town of Pokrovsk in the Donetsk region.\nOn Saturday, Ukraine said its forces had repelled two attacks in the Kharkiv region and fighting was continuing near the town of Vovchansk, which Moscow is attempting to seize.", "location": "Donetsk region, Ukraine", "classification": "security", "score": 0.7762822669027458, "event_breakdown": "- Russian army capture another village in Ukraine's eastern Donetsk region\n- Kyiv says Moscow is intensifying attacks away from the northeastern Kharkiv region and concentrating on the town Pokrovsk.\n- Ukraine said it repelled two attacks on Kharkiv and that fighting was continuing outside the town of Vovchansk, which Moscow is trying to seize"}, {"id": "d8598949-d040-49de-b1b1-fad122cbaa1a", "title": "EU pressures Israel to obey UN court order to halt Rafah offensive", "date": "2024-05-25 18:30", "url": "https://www.yahoo.com/news/eu-pressures-israel-obey-un-164409531.html", "message": "Even before the ruling, Israel had faced weeks of admonishment by the United States and European capitals over its Rafah operations due to the impact on civilians.\nIsrael argues the assault is necessary to eliminate the Palestinian militant group Hamas from the Gaza Strip.\nIn his post, Borrell also highlighted the court's order for Israel to \"maintain the Rafah crossing open for humanitarian assistance.\"\n\"The suffering of the people in the Gaza Strip and the violence must end,\" he added.\nBefore the Israeli army began its incursion, more than 1 million internally displaced Palestinians from other parts of the Gaza Strip had sought refuge in Rafah.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.496402810164486, "event_breakdown": "Security events:\n- Israel's military operation in Gaza.\n- The Palestinian militant group Hamas' presence in the Gaza Strip.\n- The influx of 1 million internally displaced Palestinians to Rafah from other parts of the Gaza Strip.\n- The urging of the United States and European capitals to Israel regarding its Rafah operations due to their impact on civilians.\n\nNote: It is unclear what the exact time period is for these security events, as the post does not include that information."}, {"id": "5a60dd09-7463-486a-a7f3-58f122ce159c", "title": "Pakistan approves compensation for Chinese workers killed in Bisham suicide attack", "date": "2024-05-25 17:00", "url": "https://article.wn.com/view/2024/05/25/Pakistan_approves_compensation_for_Chinese_workers_killed_in/", "message": "Islamabad [Pakistan], May 25 (ANI): Pakistan's Federal Cabinet approved a package for families of Chinese nationals who died in a suicide attack at the Dasu dam project, ARY News reported on Saturday citing sources.\nFive Chinese engineers and their Pakistani driver were killed in a suicide bombing on March 26 while... read full story", "location": "Dasu dam project", "classification": "security", "score": 0.7418939477072644, "event_breakdown": "* On March 26, five Chinese engineers and their Pakistani driver were killed in a suicide bombing at the Dasu dam project.\n* The families of Chinese nationals killed in the attack will receive financial compensation."}, {"id": "0c3c04e2-4e13-4553-9130-688fc379c1fb", "title": "Video : Hezbollah barrages inflict heavy damage in northern Israel", "date": "2024-05-25 16:30", "url": "https://dailystar.com.lb/hezbollah-barrages-heavy-northern-israel/", "message": "Massive craters, the size of refrigerators, mark the spots where Hezbollah anti-tank missiles have struck along Israel’s northern border.\nThe Iran-backed group has launched thousands of rockets, mortar rounds, anti-tank missiles, and drones at northern Israel.\n### Assessing the DamageThe ongoing barrages have severely impacted Israeli towns and villages near the border, which have been evacuated for over six months.\nThe Israeli military expressed regret for any damage to residents’ property and is working to minimize it as much as possible.\n### Calls for ActionAs the conflict drags on and Hezbollah’s attacks persist, northern residents grow increasingly frustrated with what they see as inaction.", "location": "Israel", "classification": "security", "score": 0.9547809000283981, "event_breakdown": "These are the security events in the text:\n\n- Hezbollah anti-tank missiles have struck Israel’s northern border, creating massive craters.\n- Hezbollah has launched thousands of rockets, mortar rounds, anti-tank missiles, and drones at northern Israel.\n- Israel has evacuated towns and villages near the border with over six months due to the ongoing barrages.\n- Hezbollah's attacks have caused significant property damage in Israeli towns and villages.\n- Israeli military is working to minimize residents' property damage from Hezbollah's attacks.\n- Northern Israel residents are growing increasingly frustrated with the ongoing conflict."}, {"id": "58e3516c-4aba-456e-8cb5-97d7099dc75a", "title": "They were in their 30s , with careers and families . Then the Bay Area murders they committed in their 20s caught up with them", "date": "2024-05-25 15:15", "url": "https://www.eastbaytimes.com/2024/05/25/they-were-in-their-30s-with-careers-and-families-then-the-bay-area-murders-they-committed-in-their-20s-caught-up-with-them/", "message": "The five men had overcome childhoods that were tumultuous, but they’d found stability in their 30s and early 40s.\nBefore they were sentenced, all five men had a chance to lay out their biographies in publicly filed court papers.\nIn 2008, Aguilar himself was shot and partially paralyzed, then subsequently distanced himself from gang life, his attorney wrote.\nWhen he participated in the double killing he was “in the throes of grief” over a friend who’d been killed hours earlier, his lawyers said in court papers.\nThere are still active charges against Luis Rojas and Michael Rebolledo, who are charged with two and three murders, respectively, court records show.", "location": ")\nThe court records were filed in Los Angeles, California, United States.", "classification": "security", "score": 0.4642841829450318, "event_breakdown": "Security Events:\n\n1. Luis Rojas and Michael Rebolledo were charged with multiple counts of murder.\n2. A man named Aguilar was shot and partially paralyzed in 2008, after which he began to distance himself from gang life.\n3. Aguilar was involved in the double killing of a drug gang member and another man.\n4. Aguilar was grieving over a friend's death when he participated in the double killing."}, {"id": "a6fe0b7e-f0fd-4c63-abc0-875ee04b300d", "title": "Russia hits Kharkiv supermarket - authorities", "date": "2024-05-25 15:30", "url": "https://www.yahoo.com/news/russia-hits-kharkiv-supermarket-authorities-145804123.html", "message": "At least two people have been killed and 35 others wounded after Russian forces hit a supermarket in the northern Ukrainian city of Kharkiv with two glide bombs, local officials say.\nUkrainian President Volodymyr Zelensky said over 200 people could have been inside the supermarket when it was attacked.\nPresident Zelensky added: \"This strike on Kharkiv is another manifestation of Russian madness.\nA second strike in central Kharkiv later on Saturday injured eight people, according to Mr Terekhov.\nPresident Volodymyr Zelensky said 3,000 such bombs were dropped on the country in March alone.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8250870125733144, "event_breakdown": "- At least 2 people killed and 35 wounded after Russian forces hit a supermarket in the northern Ukrainian city of Kharkiv with two glide bombs - Russian forces attack supermarket in Kharkiv, injuring 8 people in a separate attack on the same day - More than 200 people may have been inside the supermarket at the time of the attack - President Vladimir Putin's forces are using multiple-launch rocket systems during some of their assault on Ukraine, exploiting a loophole in the agreement that bans missiles with ranges of less than 186 miles."}, {"id": "041ff07f-189d-4b2a-8b42-96cbe7f14dd1", "title": "Ukraine war : Russia attacks Kharkiv supermarket", "date": "2024-05-25 15:30", "url": "https://www.bbc.com/news/articles/cg33y9eedz7o", "message": "Russian strike on Kharkiv supermarket kills twoWatch: BBC's Jeremy Bowen on what new Russian strikes mean for UkraineAt least two people have been killed and 35 others wounded after Russian forces hit a supermarket in the northern Ukrainian city of Kharkiv with two glide bombs, local officials say.\nUkrainian President Volodymyr Zelensky said over 200 people could have been inside the supermarket when it was attacked.\nKharkiv Mayor Ihor Terekhov wrote on Telegram: \"A large number of people are missing.\nPresident Zelensky added: \"This strike on Kharkiv is another manifestation of Russian madness.\n\"Only madmen like [Russian President Vladimir] Putin are capable of killing and terrorising people in this way.\"", "location": "Kharkiv", "classification": "security", "score": 0.6652807708733837, "event_breakdown": "1. Russian forces hit a supermarket in the northern Ukrainian city of Kharkiv with two glide bombs.\n2. Ukrainian President Volodymyr Zelensky said over 200 people could have been inside the supermarket when the attack occurred.\n3. Kharkiv Mayor Ihor Terekhov said many people were believed to have been inside the supermarket.\n4. Two people were killed and 35 others wounded in the attack on Kharkiv.\n5. One Ukrainian President Zelensky said the strike on Kharkiv is another manifestation of Russian madness, and that Russian President Vladimir was capable of killing and terrorising people in this way."}, {"id": "727ffe52-750c-4ecc-a32b-93d0f2d1a49e", "title": "Bulgarian President Radev : It is IMPOSSIBLE for Ukraine to beat Russia – NaturalNews . com", "date": "2024-05-25 18:30", "url": "https://www.naturalnews.com/2024-05-24-bulgaria-president-ukraine-victory-over-russia-impossible.html", "message": "Bulgarian President Radev: It is IMPOSSIBLE for Ukraine to beat RussiaBulgarian President Rumen Radev thinks it is impossible for Ukraine to beat Russia.\nDuring a May 18 address, the Bulgarian leader expressed concern about the Russia-Ukraine war's broad repercussions.\n\"It is unacceptable to present the continuation of the war and the impossible victory over Russia as the only possible solution,\" the Bulgarian president continued.\nRadev also comments on the shooting of Slovak PMThe Bulgarian president was asked by a journalist about the recent assassination attempt on Slovak Prime Minister Robert Fico.\nThe Slovak leader suffered critical injuries as two of the bullets struck him in the abdomen and shoulder.", "location": "Ukraine", "classification": "security", "score": 0.4999580307408006, "event_breakdown": "- Bulgarian President Radev said that it is impossible for Ukraine to beat Russia.\n- A journalist and Slovak PM Robert Fico were shot by terrorists in Slovakia."}, {"id": "fb97ea5b-7e72-4cf2-b563-460a71369a31", "title": "Israel - Hamas war : German minister criticizes Rafah action – DW – 05 / 25 / 2024", "date": "2024-05-25 18:45", "url": "https://www.dw.com/en/israel-hamas-war-german-minister-criticizes-rafah-action/live-69179825", "message": "Israel said that it was acting on the basis of its right to self-defense \"in compliance with international law, including international humanitarian law.\"\nThe Gaza war broke out after Hamas' October 7 attack on Israel resulted in the deaths of some 1,200 people, mostly civilians.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nAccording to Gaza's Hamas-run Health Ministry, more than 35,000 people have been killed in the Palestinian territory since the war began.\nSouth Africa has also been pushing for Israel to end its wider war in Gaza, but the court held back from issuing an order that covers the entire territory.", "location": "GAZA", "classification": "security", "score": 0.5801822130247112, "event_breakdown": "The Gaza war\nHamas' October 7 attack on Israel"}, {"id": "c9f0efe3-561e-4547-a7ff-a18af798d496", "title": "3 More countries set to recognize State of Palestine on May 28 , infuriating Israel – NaturalNews . com", "date": "2024-05-25 18:30", "url": "https://www.naturalnews.com/2024-05-24-3-countries-to-recognize-state-of-palestine.html", "message": "3 More countries set to recognize State of Palestine on May 28, infuriating IsraelIreland, Spain and Norway all announced on May 22 that they planned to recognize Palestinian statehood on the aforementioned date.\nTel Aviv angry at recognition of Palestinian statehoodThe outlet added that the U.K. and Australia are also set to recognize Palestinian statehood.\nIn contrast, the U.S. – Israel's main ally – has reiterated that a Palestinian state should be realized through direct negotiations, not \"unilateral recognition.\"\nMore related stories:Netanyahu REJECTS call for creation of a Palestinian state, says Israel must control EVERYTHING \"from the river to the sea.\"\nSpain to officially recognize Palestinian state, calls on Western powers to do same.", "location": ".\nBased on the text, there is no specific location mentioned.", "classification": "security", "score": 0.4134767080305414, "event_breakdown": "May 22\n* Palestine set to be recognized by Israel, Norway and Ireland\n* Spain will recognize Palestine at end of month\n* U.S. is against recognition of Palestinian statehood"}, {"id": "b57ba652-21bd-488c-813e-3d556ad7fb4f", "title": "Plane Putin Flew On Seriously Damaged Due To Engine Explosion", "date": "2024-05-25 11:15", "url": "https://charter97.org/en/news/2024/5/25/596373/", "message": "Plane Putin Flew On Seriously Damaged Due To Engine Explosion 25 25.05.2024, 11:5850,326The head of the Russian Federation survived only due to the short duration of the flight.\nThe Russian supersonic strategic missile-carrying bomber TU-160M with tail number 801, on which Russian President Vladimir Putin flew in February 2024, was seriously damaged due to a fire that broke out in the engine after the explosion.\nAccording to investigators, during preparations for takeoff there was an explosion, fire and destruction of one of the engines.\nInvestigators say the fire and explosion of the first engine was the result of the failure of a defective turbine support.\n“On February 22, Putin flew on this particular plane and survived only due to the short duration of the flight,” the message says.", "location": "RUSSIA", "classification": "security", "score": 0.7698990644198008, "event_breakdown": "Events\n-------------------------\n- TU-160M with tail number 801 bomber was seriously damaged due to a fire in an engine after an explosion\n- Fire and explosion of engine on the bomber happened during takeoff due to a defective turbine support\n- The Russian President, Vladimir Putin, flew on this plane on February 22, 2024 but only because the flight was brief\n- Vladimir Putin only survived this flight because of the short amount of it"}, {"id": "7a15d412-d719-496e-a988-1b997fd94395", "title": "Zelenskyy says Ukraine has taken back control in areas of Kharkiv region , aerial attacks continue", "date": "2024-05-25 15:15", "url": "https://www.news4jax.com/news/world/2024/05/25/zelenskyy-says-ukraine-has-taken-back-control-in-areas-of-kharkiv-region-aerial-attacks-continue/", "message": "KYIV – Ukrainian forces have secured “combat control” of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nRecommended VideosKharkiv is about 20 kilometers (12 miles) from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nIn addition to the ground offensive operation along Ukraine's northeastern border, Russia is continuing to bombard the Kharkiv region with missiles, guided aerial bombs and drones.", "location": "Kharkiv", "classification": "security", "score": 0.6612773680681135, "event_breakdown": "1. Russian forces entered Kharkiv, a northeastern city in Ukraine, on February 24.\n2. Ukrainian forces retook ground in Vovchansk, a flashpoint for fighting since the Russian offensive began.\n3. Russia is bombarding the Kharkiv region with missiles, bombs and drones.\n4. Russia has said it is attempting to create a buffer zone in Kharkiv in order to protect itself from Ukrainian cross-border attacks."}, {"id": "4f6bcbd0-40f9-41c1-84cf-4841131a0b98", "title": "Russian strikes on Ukrainian city of Kharkiv kill at least two , dozens injured", "date": "2024-05-25 18:30", "url": "https://www.channelnewsasia.com/world/russian-strikes-ukrainian-city-kharkiv-kill-least-two-dozens-injured-4363416", "message": "KHARKIV: Russian strikes on a crowded DIY hardware store in the Ukrainian city of Kharkiv on Saturday (May 25) killed at least two people, wounded many more, and triggered a huge blaze that fire crews were battling to contain, regional officials said.\nOleh Syniehubov, Kharkiv regional governor, said via the Telegram messaging app that two guided bombs had hit the DIY hypermarket in a residential area of the city.\nKharkiv Mayor Ihor Terekhov said many people were unaccounted for but gave no immediate figures.\nOfficials said up to 200 people could have been in the hypermarket at the time of the strikes.\n\"The attack targeted the shopping centre, where there were many people - this is clearly terrorism,\" Terekhov said.", "location": ")\nKHARKIV", "classification": "security", "score": 0.6218346762057702, "event_breakdown": "1. Russian strikes on a crowded DIY hardware store in the Ukrainian city of Kharkiv killed at least two people, wounded many more, and triggered a huge blaze that fire crews were battling to contain, regional officials said.\n2. Governor Oleh Syniehubov said via the Telegram messaging app that two guided bombs had hit the DIY hypermarket in a residential area of the city.\n3. Kharkiv Mayor Ihor Terekhov said many people were unaccounted for but gave no immediate figures.\n4. Officials believe up to 200 people could have been in the hypermarket at the time of the strikes.\n5. Mayor Ihor Terekhov said many citizens were missing."}, {"id": "09c52d5b-2f57-425f-b265-d67f1d45595e", "title": "Hamas Planned Attacks on Israeli Embassy and U . S . Military Base in Germany", "date": "2024-05-25 17:00", "url": "https://www.algemeiner.com/2024/05/25/hamas-planned-attacks-on-israeli-embassy-and-u-s-military-base-in-germany/", "message": "i24 News – A Hamas terrorist cell had plotted attacks against the Israeli embassy in Berlin and a U.S. military base in Germany, according to a report by the German newspaper Welt am Sonntag.\nThe suspect, of Lebanese origin, was found to be in possession of target locations on his smartphone.\nThe German security services disclosed that the suspect received instructions directly from Hamas officials in Lebanon.\nThe network’s objective is to target Jewish and Israeli sites abroad.\nFurther investigations are ongoing to dismantle any remaining elements of the terrorist cell and to prevent similar threats in the future.", "location": "Germany", "classification": "security", "score": 0.9466585790134485, "event_breakdown": "Here is the text split into individual events based on the information you've requested:\n1. Hamas terrorist cell plotted attack against the Israeli embassy in Berlin.\n2. Hamas terrorist cell plotted attack against a U.S. military base in Germany.\n3. Hamas terrorist cell received instructions directly from Hamas officials in Lebanon.\n4. A Lebanese suspect was in possession of target locations on his smartphone.\n5. The objectives of the Hamas network are to target Jewish and Israeli sites abroad.\n6. Further investigations are ongoing to dismantle any remaining elements of the terrorist cell.\n7. Further investigations are ongoing to prevent similar threats in the future."}, {"id": "8052dd11-ee9b-44e8-b2bf-cbdc469ad0bf", "title": "Russian forces strike Kupyansk - Vuzlovyi , injure five , damage vehicles", "date": "2024-05-25 15:15", "url": "https://www.yahoo.com/news/russian-forces-strike-kupyansk-vuzlovyi-134000792.html", "message": "The Russian army hit Kupyansk-Vuzlovyi in Kharkiv Oblast with a guided aerial bomb on the afternoon of May 25, injuring five people and damaging emergency and civilian cars, regional governor Oleh Synehubov reported on Telegram.\nRead also: Russian strike ravages Kharkiv Oblast railway infrastructureOther details are being clarified.\nRead also:On May 25, Russia attacked Kharkiv at night and during the day with Iskander-M missiles and anti-aircraft missiles.\nDuring the night strike in the Slobid district, one missile hit a lyceum building and another hit an industrial zone.\nRead the original article on The New Voice of Ukraine", "location": "KUPYANSK-VUZLOVYI", "classification": "security", "score": 0.9277540791083464, "event_breakdown": "May 25 Russian army used guided aerial bomb to damage Kupiansk in Kharkiv Oblast."}, {"id": "73be0c54-c0a0-41df-a68a-ce68808b346c", "title": "2 people killed by Russian bombing of Ukrainian supermarket", "date": "2024-05-25 20:00", "url": "https://www.yahoo.com/news/2-people-killed-russian-bombing-190541731.html", "message": "At least two people were killed Saturday after a Russian military strike at a supermarket in the northern Ukrainian city of Kharkiv.\nPhoto by Sergey Kozlov/EPA-EFEMay 25 (UPI) -- A Russian military strike in the northern Ukrainian city of Kharkiv killed at least two people on Saturday.\nAt least 35 other people were injured after Russian forces dropped two bombs near a supermarket, leading to a large fire.\nThe attack comes just two days after a Russian missile strike on Kharkiv killed at least seven people and wounded over a dozen more.\nAt least 11 people were killed by Russian missile strikes in Kharkiv last weekend.", "location": "Kharkiv", "classification": "security", "score": 0.9263019390083834, "event_breakdown": "Events:\n- Russian military dropped two bombs near a supermarket in the northern Ukrainian city of Kharkiv, killing at least two people.\n- Another Russian missile strike on the northern Ukrainian city of Kharkiv killed at least seven people and wounded over a dozen more."}, {"id": "c1eb3ae5-d42e-4b86-b664-8470d01be080", "title": "Ukraine war : Crowded DIY store in Kharkiv hit by Russian airstrikes , killing at least four people", "date": "2024-05-25 19:45", "url": "https://news.sky.com/story/ukraine-war-crowded-diy-store-in-kharkiv-hit-by-russian-airstrikes-killing-at-least-two-people-13143032", "message": "At least four people have been killed after a crowded DIY store in the Ukrainian city of Kharkiv was hit by Russian strikes, regional officials say.\n\"The attack targeted the shopping centre, where there were many people - this is clearly terrorism,\" he said.\nAndriy Kudinov, director of the suburban shopping centre, told local media the hardware store was full of shoppers buying items for their summer cottages.\nImage: The shopping mall was hit by Russian airstrikes.\nKharkiv, which is Ukraine's second-largest city around 18 miles (30 km) from the Russian border, has been the target of many weeks of Russian attacks.", "location": "Kharkiv", "classification": "security", "score": 0.6286530914280937, "event_breakdown": "* A crowded DIY store in Kharkiv, the second-largest city of Ukraine, was hit by Russian airstrikes, regional officials say.\n* The attack targeted a suburb shopping centre, which was full of shoppers buying items for their summer gardens.\n* At least four people were killed, according to authorities."}, {"id": "115120db-b672-4f32-a090-08162261affc", "title": "The war against Israel in the courts is a danger to Britain Armed Forces , too", "date": "2024-05-25 20:00", "url": "https://www.yahoo.com/news/war-against-israel-courts-danger-193000376.html", "message": "At precisely the same time Mr Khan made his announcement regarding Israel, he also said he intends to secure warrants for the leaders of the Hamas terrorist group.\nWorld leaders were quick in their condemnation of this manifestly unhelpful decision and the UK was right to join the criticism.\nOn the contrary, Israel has made extensive efforts to facilitate humanitarian aid to Gaza’s civilian population, totalling more than 550,000 tonnes since October 7.\nHamas’s deliberate strategy of embedding itself within urban areas means that civilians will be killed and civilian infrastructure destroyed.\nLawfare and the politicisation of armed conflict puts our own Armed Forces at great risk.", "location": ")\nGaza", "classification": "security", "score": 0.7162958769903516, "event_breakdown": "Security Events:\n\n1. Mr Khan's announcement regarding the arrest warrants for the leaders of Hamas.\n2. World leaders' condemnation of Mr Khan's decision.\n3. UK's criticism over Mr Khan's announcement.\n4. Israel's extensive efforts to facilitate the humanitarian aid to Gaza's civilian population.\n5. Hamas's deliberate strategy of embedding itself within urban areas.\n6. Civilian casualties and destruction of civilian infrastructure in Gaza due to Hamas's strategy.\n7. Lawfare and the politicisation of armed conflict.\n8. Risk posed by lawfare and the politicisation of armed conflict to our own Armed Forces."}, {"id": "c97be4f8-e60e-4849-bb80-16b8e909cd90", "title": "The war against Israel in the courts is a danger to Britain Armed Forces , too", "date": "2024-05-25 20:00", "url": "https://www.aol.co.uk/news/war-against-israel-courts-danger-193000841.html", "message": "World leaders were quick in their condemnation of this manifestly unhelpful decision and the UK was right to join the criticism.\nNo impartial observer could reasonably conclude that Israeli leaders are committing such heinous crimes.\nOn the contrary, Israel has made extensive efforts to facilitate humanitarian aid to Gaza’s civilian population, totalling more than 550,000 tonnes since October 7.\nHamas’s deliberate strategy of embedding itself within urban areas means that civilians will be killed and civilian infrastructure destroyed.\nLawfare and the politicisation of armed conflict puts our own Armed Forces at great risk.", "location": "Gaza", "classification": "security", "score": 0.7481087328659854, "event_breakdown": "Security Events:\n1. World leaders' condemnation of Israel's decision.\n2. UK's criticism of Israel's decision.\n3. More than 550,00 tonnes of humanitarian aid facilitated by Israel to Gaza's civilian population.\n4. Hamas's deliberate strategy of embedding itself within urban areas.\n5. Destruction of civilian infrastructure due to Hamas's strategy.\n6. Politicisation of armed conflict and  lawfare putting Israeli Armed Forces at great risk."}, {"id": "3a520507-3b60-4c09-9b7f-cfa4b00c4df9", "title": "At least four killed in Russian missile attacks on Kharkiv", "date": "2024-05-25 20:15", "url": "https://www.theguardian.com/world/article/2024/may/25/people-killed-in-russian-missile-attacks-on-kharkiv", "message": "Russian strikes on a crowded DIY hardware store and a residential area in the Ukrainian city of Kharkiv killed at least six people and injured 40 on Saturday, local officials said.\n“The attack targeted the shopping centre, where there were many people – this is clearly terrorism,” Terekhov said.\nKharkiv, Ukraine’s second-largest city, is just 30km (18 miles) from the Russian border and has been the target of Russian attacks for weeks.\nHuge clouds of dark smoke billowed over the shopping centre.\nWitnesses described panicked scenes at the shopping centre.", "location": "KHARKIV", "classification": "security", "score": 0.6860434688950227, "event_breakdown": "1. Russian strikes on a crowded DIY store.\n2. Russian strikes on a residential area.\n3. Russian attacks on a shopping centre in Kharkiv."}, {"id": "b6a5b6e4-f2e7-4e1e-9737-1a8e80ccf0c0", "title": "Ukraine updates : Russian strike on Kharkiv DIY store kills 6 – DW – 05 / 26 / 2024", "date": "2024-05-25 23:00", "url": "https://www.dw.com/en/ukraine-updates-russian-strike-on-kharkiv-diy-store-kills-6/live-69179887", "message": "Skip next section Death toll in DIY store strike rises to 6, local officials say05/26/2024 May 26, 2024 Death toll in DIY store strike rises to 6, local officials sayRussian strikes on a crowded DIY hardware store in Kharkiv on Saturday killed at least six people and injured dozens, the region’s Governor Oleh Syniehubov said on national television.\nForty people were injured, with at least three in serious condition.\nKharkiv Mayor Ihor Terekhov said about 120 people had been in the hardware store when the bombs struck.\n\"The attack targeted the shopping center, where there were many people — this is clearly terrorism,\" Terekhov said.\nThe past week has seen an uptick in strikes on the city after Russian troops stormed across the border, opening a new front north of the city.", "location": "Kharkiv is the main focus of the event.", "classification": "security", "score": 0.9009686806008829, "event_breakdown": "- 6 people killed in a DIY hardware store in Kharkiv (05/26/2024)\n- 40 people injured in a crowded DIY store in Kharkiv (05/26/2024)\n- 3 people seriously injured in a bombarded supermarket in Kharkiv (05/26/2024)\n- 120 people in a Kharkiv shopping center when a bomb fell (05/26/2024)\n- Increase of strikes against Kharkiv after Russian troops invaded northern fronts."}, {"id": "7e7b4b24-6d5a-407e-9134-6ffcfeb0fe49", "title": "Zelenskyy Says Ukraine Has Taken Back Control in Areas of Kharkiv Region , Aerial Attacks Continue", "date": "2024-05-25 19:45", "url": "https://www.military.com/daily-news/2024/05/25/zelenskyy-says-ukraine-has-taken-back-control-areas-of-kharkiv-region-aerial-attacks-continue.html", "message": "KYIV, Ukraine (AP) — Ukrainian forces have secured “combat control” of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nKharkiv is about 20 kilometers (12 miles) from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nIn addition to the ground offensive operation along Ukraine's northeastern border, Russia is continuing to bombard the Kharkiv region with missiles, guided aerial bombs and drones.", "location": "Vovchansk", "classification": "security", "score": 0.6612773680681135, "event_breakdown": ".\nGround offensive in Kharkiv region. Russia's second-largest city."}, {"id": "b9ed92eb-c559-4802-ac11-b196093e72fb", "title": "US - made GBU - 39 SDB Glide Bomb is Beating Russian Jamming In Ukraine", "date": "2024-05-25 23:15", "url": "https://theaviationist.com/2024/05/25/gbu-39-sdb-glide-bomb-in-ukraine/", "message": "The GBU-39 small-diameter bombs have proved resilient to jamming, with nearly 90 percent hitting their targets.\nUS-supplied GBU-39/B SDB (Small Diameter Bomb) is being proven largely “resilient” to Russia’s EW (Electronic Warfare) “jamming,” according to reports.\nIt is also fitted onto the warhead section of a HIMARS rocket, becoming the GLSDB.\nGiven the networked nature of Russia’s IADS (Integrated Air Defense System), the S-300 battery must be passing on the HIMARS rocket detection to the Buk system.\n“Russian jamming signals are sent up from the ground and form a cone-shaped area.", "location": "The location I found based on this text is Ukraine.\"\nUkraine", "classification": "security", "score": 0.45543633058218774, "event_breakdown": "* US-supplied GBU-39/B SDBs \"resilient\" to Russian jamming.\n* SDB fitted onto the warhead section of a HIMARS rocket.\n* S-300 battery passing on the HIMARS rocket detection to Buk system."}, {"id": "768cfab5-c64b-45da-86e6-c5ce719803b1", "title": "Senior UN Official Condemns Russia Kharkiv Mall Attack", "date": "2024-05-25 20:15", "url": "https://www.miragenews.com/senior-un-official-condemns-russias-kharkiv-1242995/", "message": "\"I am appalled and shocked by the terrifying news arriving from Kharkiv\", said Ms. Brown in a statement.\nThe strike hit a busy shopping centre with scores of civilian casualties and massive damage to civilian facilities\".\nThe senior UN official added that attacks by Russian forces hitting civilians and civilian infrastructure must stop, and noted that intentionally directing an attack against civilian infrastructure is strictly prohibited under international humanitarian law.\nAccording to UN sources, a second attack on Saturday is believed to have caused some 12 casualties.\nFollowing Russian advances, the northeastern Kharkiv region is now on the frontline of the war in Ukraine.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.7422947652821792, "event_breakdown": "Here is the list of security events related to the war in Ukraine from the given text:\n\n* On March 16, 2022 the city of Kharkiv was hit by a Russian missile strike.\n* The second attack is believed to have occurred on Saturday, March 19, 2022.\n* Russian forces have advanced into the northeastern city of Kharkiv."}, {"id": "c9c22cc3-9545-4f7c-be7a-08d0a58771c6", "title": "Ukraine updates : Russian strike on Kharkiv DIY store kills 2 – DW – 05 / 25 / 2024", "date": "2024-05-25 17:30", "url": "https://www.dw.com/en/ukraine-updates-russian-strike-on-kharkiv-diy-store-kills-2/live-69179887", "message": "Skip next section Death toll in DIY store strike rises to 6, local officials say05/26/2024 May 26, 2024 Death toll in DIY store strike rises to 6, local officials sayRussian strikes on a crowded DIY hardware store in Kharkiv on Saturday killed at least six people and injured dozens, the region’s Governor Oleh Syniehubov said on national television.\nForty people were injured, with at least three in serious condition.\nKharkiv Mayor Ihor Terekhov said about 120 people had been in the hardware store when the bombs struck.\n\"The attack targeted the shopping center, where there were many people — this is clearly terrorism,\" Terekhov said.\nThe past week has seen an uptick in strikes on the city after Russian troops stormed across the border, opening a new front north of the city.", "location": "Kharkiv", "classification": "security", "score": 0.9009686806008829, "event_breakdown": "1. Russian strikes on a crowded DIY hardware store in Kharkiv killed 6 people and injured 40.\n2. Russian troops stormed across the border north of Kharkiv and opened a new front."}, {"id": "09aef28b-2b5e-4adb-9104-e4d2854ee826", "title": "Gaza : 31 killed in fresh attacks as Israel says World Court ruling does not rule out Rafah offensive", "date": "2024-05-25 20:15", "url": "https://www.irishtimes.com/world/middle-east/2024/05/25/gaza-31-killed-in-fresh-attacks-as-israel-says-world-court-ruling-does-not-rule-out-rafah-offensive/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah in the southern Gaza Strip.\nThe International Court of Justice (ICJ), or World Court, has no means to enforce its emergency ruling in case brought by South Africa accusing Israel of genocide.\nNearly 36,000 Palestinians have been killed in the offensive, Gaza’s health ministry says, and much of Gaza has been devastated.\nA total of 31 Palestinians were killed in the past day in the Gaza Strip, according to local medical officials.\nEarlier, Taoiseach Simon Harris condemned Israel’s bombing of the Gaza Strip, including Rafah, a day after the ICJ made its ruling.", "location": "GAZA STRIP", "classification": "security", "score": 0.871736716866856, "event_breakdown": "* Gaza health ministry says 36,000 Palestinians have died so far in offensive which has been devastating to much of Gaza.\n* Taoiseach Simon Harris (Irish Prime Minister) condemned Israel’s bombing of the Gaza Strip, including Rafah. \n* In the day prior, the International Court of Justice issued an emergency ruling which found Isreal guilty of genocide."}, {"id": "0fe7622d-541f-4f76-9e50-c4f0fdeb8c07", "title": "Zelenskyy Says Ukraine Has Taken Back Control In Areas Of Kharkiv Region , Aerial Attacks Continue – 710am KURV", "date": "2024-05-25 22:15", "url": "https://www.kurv.com/zelenskyy-says-ukraine-has-taken-back-control-in-areas-of-kharkiv-region-aerial-attacks-continue/", "message": "(AP) — Ukrainian forces have secured “combat control” of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nKharkiv is about 20 kilometers (12 miles) from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nIn addition to the ground offensive operation along Ukraine’s northeastern border, Russia is continuing to bombard the Kharkiv region with missiles, guided aerial bombs and drones.", "location": "Kharkiv", "classification": "security", "score": 0.6612773680681135, "event_breakdown": "- Russian military launched an offensive in the northeastern Kharkiv region of Ukraine.\n- Ukrainian forces secured \"combat control\" after heavy fighting in the Vovchansk area of   the Kharkiv region.\n- Russian forces continue to bombard the Kharkiv region with missiles and other weapons."}, {"id": "bf0a6443-b696-424d-82d1-966c41c71e56", "title": "Russian strike on Kharkiv DIY store kills 4 , dozens wounded", "date": "2024-05-25 22:00", "url": "https://timesofmalta.com/article/russian-strike-kharkiv-diy-store-kills-4-dozens-wounded.1093042", "message": "Kharkiv regional governor Oleg Synegubov said \"unfortunately there are already four dead\" and \"38 wounded\" after two guided Russian bombs hit the store.\nKharkiv, Ukraine's second-largest city, is just a few dozen kilometres from the border and regularly comes under attack from Russian missiles.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n\"There were a lot of workers and shoppers inside,\" Zelensky said.\nRussia said that Ukraine shelled a small town in the Belgorod border region, killing two people and wounding 10.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.9083495586414003, "event_breakdown": "- Kharkiv, Ukraine's second-largest city, comes under attack from Russian missiles\n- Russia has launched a ground offensive in the Kharkiv region on May 10\n- Two guided Russian bombs hit the store in the city of Kharkiv\n- The casualty information has been confirmed\n- Russian missiles attack the city of Kharkiv, Ukraine\n- Russia launched a ground offensive in the Kharkiv region on May 10"}, {"id": "8ee0c35f-c7ff-4501-a6db-7cbd6724ada3", "title": "Spanish defense minister says Gaza war is  real genocide  ", "date": "2024-05-25 20:00", "url": "https://www.stripes.com/theaters/europe/2024-05-25/spain-defense-minister-gaza-war-genocide-13975490.html", "message": "Spanish Defense Minister Margarita Robles attends a meeting during a NATO summit in Madrid, Spain, on June 29, 2022.\n(Yves Herman/Reuters)MADRID — The Spanish defense minister said on Saturday that the conflict in Gaza is a “real genocide”, as relations between Israel and Spain worsen following Madrid’s decision to recognize a Palestinian state.\nThe remark by Spanish Defence Minister Margarita Robles in an interview with TVE state television echoed a comment by Spanish Deputy Prime Minister Yolanda Diaz who earlier this week also described the Gaza conflict as a genocide.\n“We cannot ignore what is happening in Gaza, which is a real genocide,” Robles said in the interview, during which she also discussed the Russian invasion of Ukraine and conflicts in Africa.\n“This is not against anyone, this is not against the Israeli state, this is not against the Israelis, who are people we respect,” she said.", "location": "GAZA", "classification": "security", "score": 0.7142585308171866, "event_breakdown": "— Spanish Defense Minister calls Gaza conflict a \"real genocide\"\n— Spanish Deputy Prime Minister Yolanda Diaz described Gaza conflict as a genocide"}, {"id": "e64e3f49-f5e3-43de-a14a-e7e220fb48e7", "title": "Russian strike on Kharkiv DIY store kills six : governor", "date": "2024-05-25 21:45", "url": "https://www.guampdn.com/news/national/russian-strike-on-kharkiv-diy-store-kills-six-governor/article_511e0f96-cbec-50cf-b4e1-a6757249b989.html", "message": "Kharkiv regional governor Oleg Synegubov said on Telegram that six people \"died on the spot\", 40 were wounded and 16 missing after two guided Russian bombs hit the store.\n- 'Brutal blow' -Later Saturday, another strike hit the centre of Kharkiv, wounding 14 in an area containing a post office, a hairdresser and a cafe, the city's mayor Igor Terekhov said.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n- Border strikes -Russia and Ukraine accused each others' forces of attacks in the border area Saturday.\nUkraine said Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.9300668556795119, "event_breakdown": "- Russian forces bomb \"Semtoyailo Central Market\" in Kharkiv, Ukraine, killing 6 people, wounding 40 and 16 missing.\n- A strike hits the centre of Kharkiv wounds 14 after the Russian ground offensive was launched on May 10th.\n- Another strike in Kupiansk-Vuzlovy damaged a railway hub in the Kharkiv region."}, {"id": "568e28e8-4f54-4b7d-bce1-7d34f0fadc14", "title": "Israel presses on with strikes in Gaza after World Court ruling", "date": "2024-05-25 23:00", "url": "https://www.devdiscourse.com/article/law-order/2950277-israel-presses-on-with-strikes-in-gaza-after-world-court-ruling", "message": "The International Court of Justice, or World Court, has no means to enforce its emergency ruling in case brought by South Africa accusing Israel of genocide.\nMore than 35,000 Palestinians have been killed in Israel's offensive in Gaza, Gaza's health ministry says.\nA total of 31 Palestinians were killed in the past day in the Gaza Strip, according to local medical officials.\nThe Israeli military said its troops in Jabalia \"eliminated dozens of terrorists in close-quarters combat and aerial strikes.\"\nIsrael has said it is carrying out operations in Rafah, despite growing international opposition, to remove Hamas battalions holed up there.", "location": "GAZA CITY", "classification": "security", "score": 0.7449722388617885, "event_breakdown": "Events from the text:\n- Over 35,000 Palestinians killed in Israel's offensive in Gaza.\n- 31 Palestinians killed in the past day in Gaza.\n- Israeli military eliminated dozens of terrorists in close-quarters combat and aerial strikes.\n- Israel has operations in Rafah to remove Hamas battalions."}, {"id": "b991a18a-1511-4dba-b2d9-2fbe31f7cc1e", "title": "Life , Death , And A Dilemma On Ukraine New Front Line : Stay Or Go", "date": "2024-05-25 22:15", "url": "https://www.rferl.org/a/ukraine-russia-war-kharkiv-offensive-civilians/32963555.html", "message": "KOZACHA LOPAN, Ukraine – A three-kilometer shell shot from the Russian border, the boom of artillery fire rumbled over the village of Kozacha Lopan from both north and south every 10 minutes or less on a day in mid-May.\nTetyana has lived in Kozacha Lopan her whole life.\nNow, signs all over town offer evacuation at no cost -- but she, her 93-year-old husband, and their daughter, Natasha, don’t want to leave.\nMany of their neighbors, as well as people from other villages in the Kharkiv region, have been squeezed out by the Russian advance.\nBack in Kozacha Lopan, there’s something else that makes Natasha reluctant to leave: her own pets and the strays she takes care of.", "location": "Kozacha Lopan", "classification": "security", "score": 0.5086226162675648, "event_breakdown": "* Russian border is shelling Kozacha Lopan every 10 minutes on a day in mid-May from the north and south (3 km)\n* Locals are offered evacuation with the support of the government, but few people left the village so far.\n* In the middle of the text there's a map of Kozacha Lopan, in the report of the government as a potential dangerous area (crises, and education).\n* Terrorists from Sakha region (Russia) tried to occupy the Pliomorets school in this town. \n* Terrorists seized media company in yavashytsia for info war reasons.\n* Terrorists destroyed all bus stations in yavashytsia quite early in the war."}, {"id": "3b426674-9141-44af-a9c6-fc1a9d6ab645", "title": "Ukraine gain control in Kharkiv border areas : Zelenskiy", "date": "2024-05-25 19:45", "url": "https://www.naroomanewsonline.com.au/story/8641042/ukraine-gain-control-in-kharkiv-border-areas-zelenskiy/?cs=14264", "message": "Kharkiv is about 20 km from the Russian border.\nMoscow's troops have in recent weeks captured villages in the area as part of a broad push, and analysts say they may be trying to get within artillery range of the city.\nUkrainian authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.4936942821027589, "event_breakdown": "Security events in Kharkiv:\n1. Russian troops capture villages near Kharkiv.\n2. Russian troops advance towards Kharkiv.\n2. Ukrainian authorities evacuate more than 11,000 people from the region."}, {"id": "ba482106-dbd4-473f-850d-814178a07826", "title": "2 Killed In Russian Strike On Ukraine DIY Store , Hundreds Feared Inside", "date": "2024-05-25 20:00", "url": "https://www.ndtv.com/world-news/2-killed-in-russian-strike-on-ukraine-diy-store-hundreds-feared-inside-5744725", "message": "Kharkiv regional governor Oleg Synegubov said \"unfortunately there are already four dead\" and \"38 wounded\" after two guided Russian bombs hit the store.\nTwo of those killed \"were men who worked in the hypermarket,\" Synegubov said earlier in a video posted on Telegram.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\nRussia said that Ukraine shelled a small town in the Belgorod border region, killing two people and wounding 10.\nUkraine said Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said.", "location": "Kharkiv", "classification": "security", "score": 0.921734830096929, "event_breakdown": ".\n1. Several Russian bombs hit a store in the Kharkiv region of Ukraine, killing four people, wounding 38 and damaging the store."}, {"id": "2e5c6af4-4522-4ab0-bb97-feb58e4dc4cc", "title": "Ukraine gain control in Kharkiv border areas : Zelenskiy", "date": "2024-05-25 19:45", "url": "https://www.yasstribune.com.au/story/8641042/ukraine-gain-control-in-kharkiv-border-areas-zelenskiy/?cs=14264", "message": "Kharkiv is about 20 km from the Russian border.\nMoscow's troops have in recent weeks captured villages in the area as part of a broad push, and analysts say they may be trying to get within artillery range of the city.\nUkrainian authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.4936942821027589, "event_breakdown": "Troops of Moscow captured villages around Kharkiv, aiming at getting closer to the city. Authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10th."}, {"id": "c72ff54a-8aca-43b0-a17c-70a61b53e2fa", "title": "Ukraine gain control in Kharkiv border areas : Zelenskiy", "date": "2024-05-25 20:00", "url": "https://www.queanbeyanage.com.au/story/8641042/ukraine-gain-control-in-kharkiv-border-areas-zelenskiy/?cs=14264", "message": "Kharkiv is about 20 km from the Russian border.\nMoscow's troops have in recent weeks captured villages in the area as part of a broad push, and analysts say they may be trying to get within artillery range of the city.\nUkrainian authorities have evacuated more than 11,000 people from the region since the start of the offensive on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.4936942821027589, "event_breakdown": "Security events:\n- Russian troops capture villages near Kharkiv as part of a broad offensive.\n- Moscow's troops may be trying to reach artillery range of Kharkiv.\n- More than 11,000 people were evacuated from regions near Kharkiv since May 10."}, {"id": "76aec4ce-e8f8-40e4-8632-e7f4b0b40bfc", "title": "Police urged to investigate former IRA commander who confessed to assassinating King Charles great uncle , Lord Mountbatten", "date": "2024-05-25 22:00", "url": "https://www.dailymail.co.uk/news/article-13459959/Police-urged-investigate-former-IRA-commander-confessed-assassinating-King-Charless-great-uncle-Lord-Mountbatten.html", "message": "Police last night faced mounting pressure to investigate a former IRA commander who confessed to The Mail on Sunday that he was behind the assassination of King Charles's great uncle.\nMichael Hayes callously boasted to this newspaper that he designed the bomb that killed Lord Mountbatten and masterminded the 1979 atrocity in Sligo, Ireland.\nBut, despite his comments this month, the Irish police have refused to say whether they intend to investigate him.\nLord Mountbatten was murdered aged 79 when the IRA blew up his fishing boat during a holiday at his summer home in Mullaghmore, Sligo.\nSpeaking to the MoS at his home in Dublin, Hayes bragged: 'I blew up Earl Mountbatten', adding: 'Yes, I blew him up.", "location": "Sligo, Ireland", "classification": "security", "score": 0.8188314329195243, "event_breakdown": "Event 1: The Mail on Sunday interviews an IRA commander who confessed to the assassination of Prince Charles's great uncle, Lord Mountbatten\nEvent 2: The IRA commander admits to designing the bomb and masterminding the 1979 atrocity in Sligo, Ireland\nEvent 3: Despite confessing to the murder, the Irish police have refused to say whether they intend to investigate the former IRA commander"}, {"id": "91f2180a-f3d1-4966-b16b-950cef0b1420", "title": "Israel Pursues Rafah Offensive Despite UN Court Ruling", "date": "2024-05-25 20:00", "url": "https://easternmirrornagaland.com/israel-pursues-rafah-offensive-despite-un-court-ruling/", "message": "TEL AVIV — Israel’s armed forces were active in the southernmost city of the Gaza Strip on Saturday, despite a call by the International Court of Justice (ICJ) for an immediate end to the military operation in Rafah.\nIsraeli soldiers killed several Palestinian gunmen who had previously fired at the Israelis, the army said.\nThe Palestinian news agency Wafa reported that one civilian was killed in an Israeli airstrike in the city, which borders Egypt.\nOn Friday, the ICJ ordered Israel to immediately end the military operation in Rafah, as part of a case brought by South Africa.\nAccording to the army, Israeli soldiers killed dozens of enemy fighters in the last 24 hours, partly in close combat and partly through targeted airstrikes.", "location": "RAFAH", "classification": "security", "score": 0.9113330071378316, "event_breakdown": "Event 1: Israeli soldiers killed several Palestinian gunmen. The Palestinian news agency Wafa reported that one civilian was killed in an Israeli airstrike in Rafah.\nEvent 2: Despite a call by the International Court of Justice for an immediate end to the military operation in Rafah, Israel’s armed forces were active in the southernmost city of the Gaza Strip on Saturday.\nEvent 3: The army said Israeli soldiers killed dozens of enemy fighters in the Gaza Strip in the last 24 hours, partly in close combat and partly through targeted airstrikes."}, {"id": "6bed6d50-919e-4643-b11f-9aed0ec1aea8", "title": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attack", "date": "2024-05-25 22:00", "url": "https://www.timesfreepress.com/news/2024/may/25/uvalde-families-sue-meta-and-call-of-duty-maker-on-second-anniversary-of-school-attack/", "message": "The lawsuit against Georgia-based gun-maker Daniel Defense was filed in Texas by the same group of 19 families who sued on Wednesday.\nThe lawsuit against Meta and Activision Blizzard — the maker of Call of Duty — were filed in California with additional families of victims from the attack.\nDaniel Defense and Meta each did not immediately respond to emails requesting comment.\nIn a congressional hearing in 2022, Daniel Defense CEO Marty Daniels called the Uvalde shooting and others like it \"pure evil\" and \"deeply disturbing.\"\nAt least two other lawsuits have been filed against Daniel Defense.", "location": "Georgia", "classification": "security", "score": 0.68404530877918, "event_breakdown": ".\n* A lawsuit against a Georgia-based gun-maker, Daniel Defense, was filed in Texas by a group of 19 families who sued on Wednesday.\n* Another lawsuit against Meta and Activision Blizzard - the maker of Call of Duty - was filed in California with additional families of victims from the Uvalde school shooting.\n* The CEO of Daniel Defense described Uvalde and other schools shootings as \"pure evil\" and \"deeply disturbing\" in a 2022 congressional hearing."}, {"id": "cb18e03e-3f4f-4d07-9655-68d510dadb3d", "title": "PACE President reacts to Russian attack on Kharkiv hypermarket", "date": "2024-05-25 22:15", "url": "https://www.yahoo.com/news/pace-president-reacts-russian-attack-180450362.html", "message": "Theodoros Roussopoulos, President of the Parliamentary Assembly of the Council of Europe (PACE), has condemned the Russian air strikes on the Epicentr construction materials hypermarket in Kharkiv.\nQuote: \"Bombing a construction hypermarket in Kharkiv on a Saturday is one additional evidence of the brutal and criminal character of Russia’s leadership.\nBombing a construction hypermarket in Kharkiv on a Saturday is one additional evidence of the brutal and criminal character of Russia’s leadership.\n— Theodoros Rousopoulos (@PACE_President) May 25, 2024Background:Czechia’s Foreign Minister Jan Lipavský said that the Russian strike on the Epicentr hypermarket in Kharkiv on 25 May proves that Russian leader Vladimir Putin is not interested in peace.\nRussian forces struck an Epicentr home improvement hypermarket in Kharkiv on the afternoon of Saturday, 25 May, killing two.", "location": "Kharkiv", "classification": "security", "score": 0.6251682349498455, "event_breakdown": ".\nKharkiv, 25 May - Epicentr building materials hypermarket was bombed."}, {"id": "91a31935-2ac7-4430-a138-67d5fa388ea7", "title": "Russian strike on Kharkiv DIY store kills six : governor", "date": "2024-05-25 22:15", "url": "https://www.voiceofalexandria.com/news/national/russian-strike-on-kharkiv-diy-store-kills-six-governor/article_61c5f97c-9691-5ca4-8ab6-3a4af2d7a875.html", "message": "Kharkiv regional governor Oleg Synegubov said on Telegram that six people \"died on the spot\", 40 were wounded and 16 missing after two guided Russian bombs hit the store.\n- 'Brutal blow' -Later Saturday, another strike hit the centre of Kharkiv, wounding 14 in an area containing a post office, a hairdresser and a cafe, the city's mayor Igor Terekhov said.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n- Border strikes -Russia and Ukraine accused each others' forces of attacks in the border area Saturday.\nUkraine said Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said.", "location": "Kharkiv", "classification": "security", "score": 0.9300668556795119, "event_breakdown": ".\n- The governor said two Russian bombs struck a grocery store in Balakliya town in northern Kharkiv, killing six people, wounding 40, and 16 missing in the city. - Another strike wounded 14 as a border hub, a café and nearby buildings. - Russia and Ukraine accused each other of shelling attacks in the border areas, and 5 people were hurt."}, {"id": "a02bafc3-042e-4afe-8ab0-526cb8e33e06", "title": "Russian strike on Kharkiv DIY store kills six : governor", "date": "2024-05-25 22:00", "url": "https://www.benningtonbanner.com/news/national/russian-strike-on-kharkiv-diy-store-kills-six-governor/article_b300df3b-54d5-5169-bcb0-b42299b58d12.html", "message": "Kharkiv regional governor Oleg Synegubov said on Telegram that six people \"died on the spot\", 40 were wounded and 16 missing after two guided Russian bombs hit the store.\n- 'Brutal blow' -Later Saturday, another strike hit the centre of Kharkiv, wounding 14 in an area containing a post office, a hairdresser and a cafe, the city's mayor Igor Terekhov said.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n- Border strikes -Russia and Ukraine accused each others' forces of attacks in the border area Saturday.\nUkraine said Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.9300668556795119, "event_breakdown": "1. Bombs hit store in the northeast city of Kharkiv, causing six deaths, 40 injuries, and 16 reported missing. \n2. Another strike targeted central Kharkiv, wounding 14 people near a cafe and a post office. \n3. Russian and Ukrainian forces accused each other of attacks in the border area. Four civilians were wounded in Russian shelling in Ukraine, and five were wounded by Ukrainian forces in Russia."}, {"id": "cb633ba5-6872-4ea1-ae93-cd8d7cee4183", "title": "Infinite Unknown – Page 4056 – The man who trades freedom for security does not deserve nor will he ever receive either . – Benjamin Franklin", "date": "2024-05-25 20:00", "url": "https://infiniteunknown.net/page/4056/", "message": "The FBI views Ardito as one of the most powerful men in the Genovese family, a major part of the national Mafia.\nThe surveillance technique came to light in an opinion published this week by U.S. District Judge Lewis Kaplan.\nHe ruled that the “roving bug” was legal because federal wiretapping law is broad enough to permit eavesdropping even of conversations that take place near a suspect’s cell phone.\n“They can be remotely accessed and made to transmit room audio all the time,” he said.\n“You can do that without having physical access to the phone.”Read moreFBI Taps Cell Phone Microphone As Surveillance Tool", "location": "FBI Headquarters, Washington D.C", "classification": "security", "score": 0.4542322582434381, "event_breakdown": "Some security events in the text are:\n1. The FBI views Ardito as one of the most powerful men in the Genovese family, a major part of the national Mafia.\n2. The wiretapping technique came to light in an opinion published this week by U.S. District Judge Lewis Kaplan.\n3. He ruled that the “roving bug” was legal because federal wiretapping law is broad enough to permit eavesdropping even of conversations that take place near a suspect’s cell phone.\n4. The FBI can remotely access a cell phone microphone and make it transmit room audio all the time, without having physical access to the phone.\nNote that some events are related, and therefore are listed as a single event in brief."}, {"id": "1c5644a8-6669-4154-9864-81b3fda207bd", "title": "Russians conduct around 100 offensive and assault operations on 25 May – General Staff", "date": "2024-05-25 22:15", "url": "https://www.yahoo.com/news/russians-conduct-around-100-offensive-183941896.html", "message": "Russian troops carried out 99 offensive and assault operations on Saturday 25 May.\nMeanwhile, the Ukrainian Defence Forces are taking all necessary measures to deplete the offensive potential of Russian troops, fighting the enemy and destroying their equipment.\"\nSix Russian attacks have been successfully repelled by Ukrainian soldiers, four are still ongoing.\nHalf of them were successfully repelled by Ukraine's Defence Forces, and seven are still ongoing.\nOn the Orikhiv front, the Russians attempted three assault attacks near Robotyne and Novoandriivka, but failed.", "location": "ORikhiv", "classification": "security", "score": 0.7451955267246352, "event_breakdown": ".\n* Russian troops carried out 99 offensive and assault operations on Saturday 25 May.\n* Ukrainian Defence Forces successfully repelled six Russian attacks, four are currently ongoing.\n* Russia attempted three assault attacks near Orikhiv but failed."}, {"id": "d3f181af-aac4-47dd-a33b-cf9940f1adf2", "title": "Russian attacks on DIY store , city centre in Ukraine Kharkiv kill six , injure dozens", "date": "2024-05-25 23:15", "url": "https://www.channelnewsasia.com/world/russian-attacks-diy-store-city-centre-ukraines-kharkiv-kill-six-injure-dozens-4363416", "message": "Kharkiv Mayor Ihor Terekhov said about 120 people had been in the hardware store when the bombs struck.\n\"The attack targeted the shopping centre, where there were many people - this is clearly terrorism,\" Terekhov said.\nThe past week has seen an uptick in strikes on the city after Russian troops stormed across the border, opening a new front north of the city.\nRussia has bombarded Kharkiv, which lies about 30 kilometres (20 miles) from its border, throughout the war, having reached its outskirts in a failed bid to capture it in 2022.", "location": "Kharkiv", "classification": "security", "score": 0.7660926048844101, "event_breakdown": "1. Russian troops stormed across the border and opened a new front north of the city.\n2. Russian troops tried to capture the city of Kharkiv in 2022, but were stopped by Ukrainian troops.\n3. Russian troops have reached the outskirts of Kharkiv and bombarded the city throughout the war.\n4. Russian troops shelled the city, leaving two dead and edging closer to the centre of eastern Ukraine's second city.\n5. Russian troops bomb attacked Kharkiv and a shopping center, and the Mayor says it's clearly terrorism."}, {"id": "00bcda4b-139c-4062-88ff-68a2ebac2211", "title": "Multiple people killed , dozens injured in Russian airstrike on Ukraine shopping center", "date": "2024-05-25 23:15", "url": "https://www.aol.com/multiple-people-killed-dozens-injured-205538617.html", "message": "Russian forces struck a Ukrainian shopping center in Kharkiv on Saturday, leaving four people dead and 38 people wounded according to local officials.\nPHOTO: Ukrainian rescuers work at the site of shelling of a market in Kharkiv, Ukraine, on May 25, 2024.\nPHOTO: Firefighters inspect a heavily damaged office building following Russian air strike in Kharkiv, on May 25, 2024, amid the Russian invasion of Ukraine.\nPHOTO: Firefighters work at a site of a household item shopping mall hit by a Russian air strike, amid Russia's attack on Ukraine, in Kharkiv, Ukraine, on May 25, 2024.\nMultiple people killed, dozens injured in Russian airstrike on Ukraine shopping center originally appeared on abcnews.go.com", "location": "Kharkiv", "classification": "security", "score": 0.8705777558228226, "event_breakdown": ".\nRussian forces hit a Ukrainian shopping center in Kharkiv. \nFive people were killed and 38 wounded following airstrikes."}]