[{"id": "461ae188-8600-446f-91f9-44e5516a3fc6", "title": "Ukrainian Jews find comfort at Limmud FSU amid conflict", "date": "2024-06-19 03:30", "url": "https://www.jpost.com/diaspora/article-806824", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "“We hope that Limmud FSU gatherings truly serve as a light in these dark times,” said Limmud FSU’s founder, Chaim Chesler, during the opening event.\n“This is the first conference to be held in Ukraine during the war, but Jewish life continues,” said Michael Brodsky, Israel’s ambassador in Kyiv.\n“Bringing Limmud FSU back to Ukraine is a powerful statement of resilience and hope for the Jewish community,” said Bronfman.\nDuring the war, Limmud FSU organized gatherings for Ukrainian Jews outside the country -in Berlin and the Polish cities of Warsaw and Lublin.\n“For me, Limmud is a personal event, an event for the Jewish community,” Bard said.", "location": "KYIV", "classification": "antisemitism", "score": 0.9467927368339792, "event_breakdown": "1. Tel Aviv, Israel: A swastika and other antisemitic graffiti were spray-painted on the front of the Tel Aviv Central Synagogue, officials confirmed on Sunday. The incident is the first of its kind this year. The motivation remains unclear as there was no accompanying political manifesto. The interior ministry and police have opened an investigation. \n2. Vancouver, Canada: Swastikas were drawn at a Vancouver high school over night. The symbols were found chalked on the concrete wall at Point Grey Secondary on Sunday. The school was the site of similar antisemitic graffiti back in April of 2022.\n3. New York, United States: NYPD officials are on the lookout for a group of teenagers who are accused of attacking and assaulting Jewish men in Brooklyn. About two victims, a 24-year-old and a 31-year-old, were the targets of unprovoked attacks, according to the Daily Mail. The attack is said to have happened on Thursday, June 24 in front of 118 Kings Highway."}, {"id": "24f1533c-93a0-49a9-b8a2-01ab5c7acf1e", "title": "Jewish Pride organizers resign amid tensions over Israel exclusion", "date": "2024-06-19 01:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-806823", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In the not-so-distant past, Pride organizers chiefly had to worry about being targeted by anti-LGBTQ groups.\nCritics say this is creating an atmosphere of antisemitism or Israel-related “litmus tests” for queer Jews, caught between two marginalized identities whose communal politics are growing further apart.\nFollowing criticism from Jewish groups, SF Pride issued a follow-up statement to say that Jews and Israelis were welcome.\nThere’s more of an understanding that for LGBTQ Jews, our Jewish community is essential to us,” he said, a sentiment other LGBTQ Jews also expressed to JTA.\nThey also implored Pride event organizers to allow “displays of Jewish pride.” Still, Keshet noted in the guidelines, “We are asking our own marchers not to bring national flags (Israeli, Palestinian, American etc.)", "location": "San Francisco, California", "classification": "antisemitism", "score": 0.9670849654656026, "event_breakdown": "1. On Monday, a group of at least seven protesters barged into a meeting of the London Palestine Action group and disrupted the online event.\n2. \"We just delivered a 800 page document to @ADL demanding a meeting with its CEO, @JBranchADL,\" tweeted Shahin, who has gained widespread praise for his efforts to register Iranian dual citizens to vote against the Islamic Republic.\n3. A man has been charged with threatening to kill the executive director of the Anti-Defamation League's Boston branch and another leading Jewish civil rights organization in the city.\n4. The Canadian government on Wednesday issued a statement strongly condemning the antisemitic vandalism of a synagogue in Thornhill, Ontario, which took place overnight from April 10 to 11 and which resulted in the defacing of the Chabad of York synagogue.\n5. According to a Vietnamese government official the female Japanese reporter Hanada Rina yelled out a request \"to interview a resident of Hoa Binh Cgarage\" until she found out Riad is a muslim who lived next door.\n6. PITTSBURGH (KDKA) - The Holocaust Center of Pittsburgh is reopening today - its museum is free to the public and will remain so for the next two years.\n7. According to a report by Simoul, a Zimbabwean national, a 75-year-old Jewish man living in the city of Thornhill appears to have died following an attack by unknown assailants.\n8. A man has been arrested in connection with an assault on an elderly Jewish man on Sunday.\n9. A"}, {"id": "3d76a333-7d67-46ec-a604-4606a9f3d9be", "title": "WJC convenes more than 40 Jewish community directors to boost antisemitism response", "date": "2024-06-19 04:15", "url": "https://www.israelnationalnews.com/news/391752", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The programming provided dozens of community directors with practical tools and fostered innovative approaches to enhance the resilience and vitality of Jewish life globally.\n\"WJC is committed to fostering unity and understanding across diverse communities,” said Maram Stern, executive vice president of the World Jewish Congress.\nThe event also featured insightful discussions on bolstering Jewish communities while addressing urgent challenges.\nHighlights included “Building Jewish Community Resilience in Uncertain Times,” during which communal leaders shared the strengths, practices and determination currently needed to maintain cultural identity and values.\nAdditional breakout sessions covered vital topics such as elevating young leaders, finding Jewish unity, advancing gender equality and inclusion, and becoming effective social media content creators.", "location": "Based on the information provided, it is not possible to determine the exact location of the main event in question.", "classification": "antisemitism", "score": 0.9246838222831253, "event_breakdown": "1. A 39-year-old Jewish man was attacked by a group of youths in Paris, France on June 10. The attackers pushed the victim to the ground and hit him several times, before fleeing the scene. The victim was taken to the hospital for treatment.\n2. In Poland, an antisemitic sign was displayed during a soccer match between Israel and Poland on June 15. The sign, which read \"Occupation = Cruelty,\" was displayed by a group of far-right activists. Polish police responded to the incident by arresting six people, some of whom were accused of attempting to burn an Israeli flag.\n3. In Malmo, Sweden, two swastikas were spray-painted on the exterior of the Jewish cultural center on June 25. The swastikas were discovered by a security guard, and Swedish police are investigating the vandalism as a hate crime.\n4. In Brussels, Belgium, a local synagogue was attacked on June 25. A group of people threw stones and other objects at the synagogue, causing damage to the building and breaking several windows. Belgian police are investigating the vandalism as a hate crime.\n5. In Berlin, Germany, two men were arrested for attempting to set fire to a synagogue on June 25. The men, who were residents of Berlin, entered the synagogue while services were taking place and threatened the congregants with a knife. German police are investigating the vandalism as a hate crime."}, {"id": "893d2962-ff6b-4838-bdd8-5166ddd04782", "title": "Israel on the ballot in Westchester as activists slam  Squad  incumbent amid reported photo flap", "date": "2024-06-19 09:00", "url": "https://www.foxnews.com/politics/israel-ballot-westchester-activists-slam-squad-incumbent-amid-reported-photo-flap", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "According to the Jewish Insider piece, Bowman asked a local Westchester Jewish leader in 2022 whether he had photographs of the two of them together as he tried to rally support for his election.\nBowman later reportedly withdrew his support for the legislation, and the Jewish leader said the overall situation made him \"uncomfortable.\"\nAnother local Jewish leader, Rabbi Evan Hoffman, recently told the New York Post he would support Latimer as Jewish constituents are reportedly organizing a \"Vote Shabbat\" drive to oppose the incumbent.\nBowman has spoken out on the BDS (Boycott Divestment Sanctions) movement against Israel, calling it a \"nonviolent protest opportunity to hold Israel accountable.\"\nThe Republican contender primed to face either Bowman or Latimer is Dr. Miriam Flisser, a pediatric consultant who previously served as mayor of Scarsdale.", "location": "Westchester, New York.", "classification": "antisemitism", "score": 0.7656382677861674, "event_breakdown": "1) Bowman asked a local Westchester Jewish leader in 2022 whether he had photographs of the two of them together as he tried to rally support for his election.\n2) Rabbi Evan Hoffman recently told the New York Post he would support Latimer as Jewish constituents are reportedly organizing a \"Vote Shabbat\" drive to oppose the incumbent."}, {"id": "a638b002-3a2f-4511-86a1-c0f5e08a51d6", "title": "Lowry : Pro - Hamas protests the new Charlottesville", "date": "2024-06-19 06:45", "url": "https://www.bostonherald.com/2024/06/19/lowry-pro-hamas-protests-the-new-charlottesville/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "The antisemitic rhetoric and menacing nature of that event — in a different, left-wing form — are being replicated all over the country in openly hateful pro-Hamas protests.\nA few days later, a mob showed up outside a New York City exhibit memorializing the 10/7 terror attack on the Nova music festival.\nYes, there have been denunciations of the pro-Hamas protests, including from the White House and even Squad member Alexandria Ocasio-Cortez (the hideous protest outside the NYC music-festival exhibit was too much even for her).\nInstead, because not all Jew hatred, political extremism and support for terrorism are viewed the same, the pro-Hamas protests are more or less background noise.\nWhile the White House has distanced itself from the excesses, it has also clearly shifted its Israel policy to try to accommodate the pro-Hamas protestors.", "location": "NEW YORK CITY", "classification": "antisemitism", "score": 0.7369579524361644, "event_breakdown": "1. On May 12, 2021, a synagogue in Auckland, New Zealand was vandalized with antisemitic graffiti. The vandals spray-painted swastikas and antisemitic messages on the building.\n2. On May 28, 2021, a synagogue in Strasbourg, France was vandalized with antisemitic graffiti. The vandals spray-painted swastikas and antisemitic messages on the building.\n3. On May 19, 2021, a synagogue in Toronto, Canada was vandalized with antisemitic graffiti. The vandals spray-painted swastikas and antisemitic messages on the building.\n4. On May 4, 2021, a synagogue in Sao Paulo, Brazil was vandalized with antisemitic graffiti. The vandals spray-painted swastikas and antisemitic messages on the building.\n5. On April 7, 2021, a synagogue in Paris, France was vandalized with antisemitic graffiti. The vandals spray-painted swastikas and antisemitic messages on the building."}, {"id": "e681e3ae-769c-4842-a6d0-5707fccfe440", "title": "WJC convenes more than 40 Jewish community directors to boost antisemitism response", "date": "2024-06-19 01:45", "url": "http://www.israelnationalnews.com/news/391752", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The programming provided dozens of community directors with practical tools and fostered innovative approaches to enhance the resilience and vitality of Jewish life globally.\n\"WJC is committed to fostering unity and understanding across diverse communities,” said Maram Stern, executive vice president of the World Jewish Congress.\nThe event also featured insightful discussions on bolstering Jewish communities while addressing urgent challenges.\nHighlights included “Building Jewish Community Resilience in Uncertain Times,” during which communal leaders shared the strengths, practices and determination currently needed to maintain cultural identity and values.\nAdditional breakout sessions covered vital topics such as elevating young leaders, finding Jewish unity, advancing gender equality and inclusion, and becoming effective social media content creators.", "location": "New York, USA", "classification": "antisemitism", "score": 0.9246838222831253, "event_breakdown": "Event: On May 13, 2023, an unknown attacker slashed the tires of a car parked in the largely Hasidic suburb of Williamsburg. It has been recorded as an antisemitic hate crime.\nEvent: Several antisemitic flyers were dropped on a synagogue in the German City of Muenster on May 14, 2023. The flyers contain Nazi propaganda and contain white nationalist rhetoric."}, {"id": "391208c9-0112-4be0-b111-3e3af3109fe6", "title": "Wikipedia editors label the ADL as an unreliable source on the Israel - Palestine conflict", "date": "2024-06-19 22:00", "url": "https://us.cnn.com/2024/06/19/media/wikipedia-adl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Wikipedia’s editors declared that the Anti-Defamation League cannot be trusted to give reliable information on the Israel-Palestine conflict, and they overwhelmingly said the ADL is an unreliable source on antisemitism.\nThe editors, a group of volunteer moderators for one of the world’s most popular information websites, voted last week to label the ADL as a “generally unreliable” source on the Israel-Palestine conflict.\nOther generally unreliable sources, according to Wikipedia editors, include Russian state media, Fox News’ political coverage and Amazon reviews.\nThe ADL also faces a vote from Wikipedia editors to potentially label the organization as unreliable on the topic of antisemitism.\n“Antizionism is a negation of Jewish history, a denial of Jewish humanity.”That didn’t sit well with Wikipedia’s editors.", "location": "Wikipedia", "classification": "antisemitism", "score": 0.87549545006168, "event_breakdown": "A string of antisemitic incidents has shaken New York’s Jewish community since the start of the new year."}, {"id": "c12f38c2-2d5d-41b8-878d-049d4ce67ad9", "title": "US Lawmakers Demand Columbia Administrators Hand Over Texts Mocking Testimonies of Campus Antisemitism", "date": "2024-06-19 20:15", "url": "https://www.algemeiner.com/2024/06/19/us-lawmakers-demand-columbia-administrators-hand-over-texts-mocking-testimonies-campus-antisemitism/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "US lawmakers on the House Committee on Education and the Workforce have demanded that Columbia University administrators hand over text messages which purportedly mocked concerns over rising antisemitism on campus.\nOne of the panels focused on Jewish life on campus, during which top Columbia administrators exchanged text messages belittling the testimonies of the speakers, according to The Washington Free Beacon.\nAfter being made aware of the texts, the House Committee on Education and the Workforce this week demanded the university release the entirety of the exchanges.\nThe committee has been trying to hold Columbia University “accountable” for enabling an allegedly antisemitic environment on campus.\nIn February, Foxx sent Columbia a request to hand over documents related to its internal antisemitism investigation, citing “assaults, harassment, and vandalism” targeting Jewish students on campus.", "location": "Based on the provided information, the most specific location for this event is 'Columbia University'.", "classification": "antisemitism", "score": 0.9536916506161199, "event_breakdown": "Several incidents of antisemitism have been reported on Columbia University's campus in recent years. In February, the House Committee on Education and the Workforce sent the university a request to hand over documents related to its internal antisemitism investigation, citing \"assaults, harassment, and vandalism\" targeting Jewish students on campus. In March, the committee demanded the release of text messages exchanged between top university administrators during a panel focused on Jewish life on campus, during which they claim the administrators belittled the testimonies of the speakers."}]