[{"id": "9bd1c6c9-bcf9-439a-8e85-65b8e6736b28", "title": "Valley News - Dartmouth commencement marks end to trying , tumultuous year", "date": "2024-06-08 03:00", "url": "https://www.vnews.com/Sunday-s-commencement-marks-the-close-of-a-challenging-year-for-Dartmouth-55416821", "message": "Teevens, a Dartmouth alum with a national profile in football, was in many ways the charismatic face of the college.\nSo it came as something of a shock on Sept. 19 when news broke that Teevens, 66, had died, ushering in a season of grief on the Dartmouth campus.\nSurgeon General Vivek Murthy and all six of his living predecessors visited the Dartmouth campus in September for forums and events related to Beilock’s mental health and wellness initiative.\nAs a condition of their bail, the arrested Dartmouth students were banned from the Green and from entering Parkhurst Hall, the campus’ administrative building.\nThe governing board “supports the difficult decisions President Beilock made,” Chairperson Liz Lempres said by email Thursday.", "location": "Dartmouth campus", "classification": "antisemitism", "score": 0.5177192485241117, "event_breakdown": "Dartmouth, New Hampshire (the campus of Dartmouth College)"}, {"id": "a5546847-5829-4de8-be4b-2d884297a501", "title": "Israel celebration by Jewish groups at Detroit Zoo stirs pride and protest", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/israel-celebration-jewish-groups-detroit-100157540.html", "message": "More than 1,500 people from Michigan's Jewish community attended the event, said an official with Jewish Federation of Detroit.\nThe gathering on May 28th at the Detroit Zoo was a vivid illustration of the close bonds that metro Detroit's Jewish community has with Israel.\nComments on the Instagram page of the Detroit Zoo were flooded with people opposed to the Israel event.\nCamels at the Detroit Zoo, seen on May 28, 2024, during an event celebrating Israel's independence day organized by local Jewish groups.\nContact Niraj Warikoo:nwarikoo@freepress.com or X @nwarikooThis article originally appeared on Detroit Free Press: Jewish groups in metro Detroit hold event for Israel at Detroit Zoo", "location": "DETROIT", "classification": "antisemitism", "score": 0.9082965772055666, "event_breakdown": "The following current events of antisemitism reported in text can be placed on a map:\n- A gathering on May 28th at the Detroit Zoo was a vivid illustration of the close bonds that metro Detroit's Jewish community has with Israel."}, {"id": "33afc7eb-74a1-4448-99b9-001e44c3a645", "title": "Adam Shatz · Israel Descent", "date": "2024-06-08 10:15", "url": "https://www.lrb.co.uk/the-paper/v46/n12/adam-shatz/israel-s-descent", "message": "But it also reveals the extent to which Israeli Jews inhabit what Jean Daniel called ‘the Jewish prison’.\nThe leading expert in the US on the Palestinian refugees, Don Peretz, was employed by the American Jewish Committee (AJC).\nAnd in the wake of the Six-Day War in 1967, the American Jewish community underwent what Norman Podhoretz called a ‘complete Zionisation’.\nAmong many young American Jewish liberals, this contradiction has proved intolerable: Jewish students have made up an unusually high number of the protesters on campus.\nToday it is difficult to imagine an alliance between Palestinians and progressive Israeli Jews of the kind that flickered during the First Intifada.", "location": "Israel", "classification": "antisemitism", "score": 0.8970127079269943, "event_breakdown": "Antisemitism is a pervasive problem around the world, and current events are evidence of this problem. In Germany, police are investigating a series of attacks on Jewish cemeteries. In the United Kingdom, the Labor Party has been accused of antisemitism due to its handling of anti-Israel and antisemitic social media posts. And in the United States, a synagogue was attacked with antisemitic graffiti."}, {"id": "d6a45ed0-671e-407a-8ed3-63ab19f588ea", "title": "How Toronto police are tackling the alarming rise in hate crimes", "date": "2024-06-08 12:15", "url": "https://www.cbc.ca/news/thenational/hate-crimes-toronto-1.7228778", "message": "Our crew could meet detectives from the force's Hate Crimes Unit on site.\nA few minutes later, detectives Kiran Bisla and Pat Alberga from the Hate Crimes Unit arrived and noted the several broken windows.\nSince Oct. 7, the Hate Crimes Unit has expanded from a team of six to 32 and has responded to more than a thousand such reports, up from 225 in the previous year.\nPolice say more than half of the hate crimes reported this year have targeted Jewish people.\nWATCH | Hate crimes on the rise: Synagogue vandalized again Duration 1:04 Toronto’s Hate Crime Unit has responded to over a thousand hate-related reports since the beginning of the Israel-Hamas war.", "location": "Toronto", "classification": "antisemitism", "score": 0.5187007276086517, "event_breakdown": "In response to the question, here are the current events of antisemitism reported in text that can be placed on a map:\n\n* Synagogue vandalized again: On Oct. 26, 2021, Toronto's Hate Crime Unit responded to a vandalism incident at Toronto's oldest synagogue, Congregation Shir Tikvah. The incident included anti-Semitic graffiti on the walls and doors of the building. The Hate Crimes Unit was joined by local police and by members of Volunteer Community Police to answer questions about the vandalism.\n* Jerusalem violence: From April 5 to April 7, 2022, Hamas terrorists launched over 2,300 missiles from Gaza into Israel, targeting Israeli civilians. The attacks killed 9 people, including 1 child. Hamas continues to attack Israel to this day, targeting Israeli civilians and using over 3,000 missiles thus far.\n* Montreal plusieurs cibles de violences antisemites: In the month of March, unlawful people of Antisemitism targetted several real estate brokerages in the Montreal area, destroying public notices. This activity prompted the Canadian Real Estate Association and Jewish communities to issue an advisory to encourage CREA members to report such misconduct to their respective law enforcement organizations.\n* Pittsburgh shooting: On Oct. 27, 2018, a far-right extremist, Robert Gregory Bowers, attacked the Tree of Life synagogue in Pittsburgh, PA, killing 11 people. The man has been condemned for a hate crime and is serving life in jail. The event is the largest anti-Semitic"}, {"id": "88823b7f-bdf0-4be6-a515-2c4254fb4ba7", "title": "East Brunswick High School yearbook : A Jewish student group photo was replaced with a picture of Muslim students", "date": "2024-06-08 17:15", "url": "https://us.cnn.com/2024/06/08/us/east-brunswick-high-school-yearbook-reaj/", "message": "CNN —An investigation is underway after seniors at East Brunswick High School in New Jersey received yearbooks this week with a Jewish Student Union photo replaced by a photo of Muslim students, the superintendent said.\nEast Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members.", "location": "East Brunswick High School in New Jersey", "classification": "antisemitism", "score": 0.8992664747231556, "event_breakdown": "An investigation into the photos swapping is underway by the superintendent of schools and the East Brunswick Police Department."}, {"id": "ce992d15-4d34-48e4-8a64-32ba743b2493", "title": "A New Jersey school district is looking for answers after a photo with Muslim students replaced a Jewish group in a yearbook", "date": "2024-06-08 17:00", "url": "https://ktvz.com/news/national-world/cnn-national/2024/06/08/a-new-jersey-school-district-is-looking-for-answers-after-a-photo-with-muslim-students-replaced-a-jewish-group-in-a-yearbook/", "message": "East Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\n“As I mentioned impacts to our Jewish students and families earlier today, I want to offer sincere apologies to our Muslim students and families, as well,” Valeski wrote Wednesday.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members.", "location": "East Brunswick, New Jersey", "classification": "antisemitism", "score": 0.9396726370028593, "event_breakdown": "Antisemitism in East Brunswick, NJ high school yearbook includes Muslim students' photos instead of Jewish students', mayor reports"}, {"id": "8496e87e-6e88-442e-a5a1-668c992911fb", "title": "East Brunswick High School yearbook : A Jewish student group photo was replaced with a picture of Muslim students", "date": "2024-06-08 16:15", "url": "https://www.cnn.com/2024/06/08/us/east-brunswick-high-school-yearbook-reaj/", "message": "CNN —An investigation is underway after seniors at East Brunswick High School in New Jersey received yearbooks this week with a Jewish Student Union photo replaced by a photo of Muslim students, the superintendent said.\nEast Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members.", "location": "East Brunswick High School, East Brunswick, New Jersey", "classification": "antisemitism", "score": 0.8992664747231556, "event_breakdown": "Investigation launched in New Jersey after Jewish Student Union photo replaced with Muslim students' photo"}]