[{"id": "d1a02ac9-4dc0-46d0-aa0b-cc948f7a02a7", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 02:30", "url": "https://www.fox17online.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "fox17online.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia.", "location": "CHARLESTON, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9738233359874736, "event_breakdown": "Tropical Storm Debby has been battering the southeastern United States for more than 24 hours. The eastern Gulf Coast may be hit with heavy rains, tornadoes, lightning and an average elevation of no more than 13 feet (4 meters). You should therefore see things like this coming your way toward Hurricane Debby. At the beginning of last night, the worst case scenario of the case was that the sanctuary church, which is located south of us, can be destroyed by this’s Debby. This morning, the deputy Judge was a little overconfident because he said we should be prepared for this Debby to try and blow the roof off of our sanctuary. The remains of a courthouse in the offing after a fright storm twin-turbo and rich leaves the coastal city of Charleston with citizens are evacuated."}, {"id": "33b48132-7a20-4ee3-9f39-4aed635a160c", "title": "Tropical Storm Debby stalls , poised to move north in US", "date": "2024-08-08 03:45", "url": "https://www.canberratimes.com.au/story/8723408/tropical-storm-debby-stalls-poised-to-move-north-in-us/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "At least six people have died in Florida and Georgia in the wake of the storm, which made landfall on Florida's Gulf Coast on Monday as a Category 1 hurricane and headed northeast.\nIt is expected to next menace the Southeastern and mid-Atlantic coasts for days.", "location": "Florida", "classification": "natural-disasters", "score": 0.6136711577964288, "event_breakdown": "Florida and Georgia\nStorm causes six deaths in Florida and six deaths in Georgia."}, {"id": "e427d1c5-cfac-4efc-b38f-13af2ef712b9", "title": "DC , Maryland prepare for Tropical Storm Debby", "date": "2024-08-08 01:30", "url": "https://www.yahoo.com/news/dc-maryland-prepare-tropical-storm-225251863.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "WASHINGTON (DC News Now) — In D.C., preparations for the remnants of Tropical Storm Debby are underway.\nThe District’s Emergency Operations Center will be staffed over the next few days to respond.\nWest Virginia emergency crews on alert as Tropical Storm Debby approachesD.C.’s Emergency Operations Center is gearing up for a potentially dangerous storm Thursday night into Friday.\nTropical Storm Debby heading towards Virginia: Here’s how drivers can stay safeThe county has flood sensors near certain roads to alert drivers.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC.", "location": ".\nWASHINGTON, DC", "classification": "natural-disasters", "score": 0.9090324202968006, "event_breakdown": "D.C.’s Emergency Operations Center is ready for the remnants of Tropical Storm Debby.\nWest Virginia emergency crews are on high alert.\nTropical Storm Debby is headed towards Virginia. Drivers should stay safe."}, {"id": "43bad07b-3104-4186-a6be-577efa7b9cf9", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 01:30", "url": "https://www.fox9.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox9.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.8894451719573951, "event_breakdown": "Tropical Depression Imelda is currently dumping huge amounts of rain over parts of the southeastern United States, especially in Texas.\n(Credit: others)\nEl Paso, Texas, has been hit hard by rain: as much as 15 inches has been dumped, causing flooding for certain communities."}, {"id": "55f405e9-3a9f-4e30-874f-d835cdbbbcea", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 00:00", "url": "https://www.fox26houston.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.8894451719573951, "event_breakdown": "Tropical Storm Debby is currently moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center is currently over the Atlantic Ocean near Charleston, South Carolina, and will make a second landfall in either North Carolina or South Carolina this evening or early tomorrow morning."}, {"id": "628f6cb3-281e-425a-9c43-5aa59bd8a733", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 01:15", "url": "https://www.kjrh.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia.", "location": "CHARLESTON", "classification": "natural-disasters", "score": 0.9738233359874736, "event_breakdown": "Tropical Storm Debby hits Florida\nStorm to move over East Coast\n2018 Gulf Coast Hurricane\nHurricane Michael (2018)"}, {"id": "271c67e5-fa3f-48f9-895e-ba3db1df0133", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 03:45", "url": "https://dailyvoice.com/new-york/newrochelle/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4.", "location": "TALLAHASSEE, FLORIDA", "classification": "natural-disasters", "score": 0.9862598543258225, "event_breakdown": "Gulf of Mexico: Tropical Storm Debby - Upgraded from Tropical Storm to a Hurricane at about 11 p.m. Sunday, Aug. 4. The heaviest rain is around the centre of the storm, with up to 2 feet or rain expected. (another location)  \nGulf of Mexico: Landfall as around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee (Debby). It was downgraded to a tropical storm almost immediately and Florida is preparing for heavy winds and rain.  \nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island."}, {"id": "67f9471c-2cb2-4c7d-8cd7-e407f8bd72f8", "title": "Restaurants in Beaufort prepare for Tropical Storm Debby", "date": "2024-08-08 03:00", "url": "https://www.witn.com/2024/08/08/restaurants-beaufort-prepare-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "BEAUFORT, N.C. (WITN) - Tropical Storm Debby is inching closer to eastern Carolina, and restaurants across the area are preparing for the impact.\nAround Beaufort, tables and chairs were seen stacked as the town braces for Debby.\nCiara Heuser recently moved to the area and says the restaurant she works at will take the storm day by day.\n“We are one of the higher restaurants,” said Front Street Grill at Saltwater general manager Shannon Piner.\nTropical storms are something Piner says she is used to, which is why safety is top priority.", "location": "Beaufort", "classification": "natural-disasters", "score": 0.7410298690409055, "event_breakdown": "Tropical storms seen in Beaufort, NC"}, {"id": "4810c6ba-ccbf-4cde-842b-fd18f4e47daf", "title": "New York Residents Warned To Prepare For Tropical Storm Debby", "date": "2024-08-08 03:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/update-new-york-residents-warned-to-prepare-for-tropical-storm-debby/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is making its way to New York State, forcing Empire State officials to warn New Yorkers to prepare.\nIt's been downgraded to a Tropical Storm but is expected to break rainfall records in both Georgia and South Carolina.\nHochul notes Tropical Storm Debby will hit later in the week, but right now there's a flood watch in effect for many parts of the state.\nFor all the news that the Hudson Valley is sharing make sure to follow Hudson Valley Post on Facebook, download the Hudson Valley Post Mobile\"Rain could fall at rates up to two inches per hour with local rainfall rates up to three inches at times.\nThen, Empire State residents have to worry about Tropical Storm Debby.", "location": "New York", "classification": "natural-disasters", "score": 0.7731997449116876, "event_breakdown": "Tropical Storm Debby is currently making its way to New York, causing New York officials to warn residents to prepare."}, {"id": "8087e2e6-f068-45da-a364-b11d469883d7", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 04:15", "url": "https://www.live5news.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "A few doors down, Charles Grainger was cleaning up after about 8 inches (20 centimeters) of water got into his home.\nIt’s part of living on the creek.”The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimeters) of rain from Debby.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nTropical Storm Debby strengthened over the Atlantic Ocean.\nAt least six people have died due to the storm, five of them in traffic accidents or from fallen trees.", "location": "DUNNELLON, FLORIDA", "classification": "natural-disasters", "score": 0.9593068933832347, "event_breakdown": "1. Rainfall in the Island of Hispaniola led to the overflowing of a river, flooding some 3,500 homes, as well as two bridges and some roads were damaged by intense rainfall.\n2. The Tropical Storm Debby strengthened over the Atlantic Ocean. At least six people have died due to the storm, five of them in traffic accidents or from fallen trees."}, {"id": "b341996a-5604-4d32-8266-30c47a430d91", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:15", "url": "https://www.clickondetroit.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane.", "location": "Tappan Zee Drives.", "classification": "natural-disasters", "score": 0.856539613000063, "event_breakdown": "Hurricane Matthew (2016) - Heavy rain from a 2016 hurricane flooded several homes on Tappan Zee Drive."}, {"id": "418a5dee-1640-4203-bd7b-236dc1a4ca1a", "title": "Charlotte gears up for storm : Hardware stores see surge , county Monitors water levels", "date": "2024-08-08 03:30", "url": "https://www.wbtv.com/2024/08/08/charlotte-gears-up-storm-hardware-stores-see-surge-county-monitors-water-levels/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Charlotte residents are preparing for the approaching storm as local groups work to ensure they’re ready to respond.\nTim Trautman, the Mecklenburg County Stormwater Program Manager, highlighted a network of sensors and cameras monitoring water levels in real-time.\nThese systems become crucial during heavy rainfall events, alerting authorities to areas at risk of overflowing creeks and subsequent road closures.\nTrautman warned that last week’s storms brought water levels halfway up the banks of some creeks, raising concerns about potential flooding with the expected rainfall.\n“They communicate messages to our staff as well as our emergency managers, so that they can decide where to deploy resources.”Local hardware stores are experiencing a surge in storm preparation supplies.", "location": "Charlotte, North Carolina", "classification": "natural-disasters", "score": 0.9620667171318652, "event_breakdown": "There are currently no current events of natural-disasters reported in text that can be placed on a map."}, {"id": "61022ce2-dffd-4c4b-9d51-4144a54f9d91", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:00", "url": "https://www.clickorlando.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane.", "location": "Tappan Zee Drives.", "classification": "natural-disasters", "score": 0.856539613000063, "event_breakdown": "October 2016 - Hurricane Matthew: In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nFebruary 2020 - Heavy Rains: Before Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives."}, {"id": "41858983-1b6d-42c8-b544-edd30da5709a", "title": "Colorado wildfires : Evacuations lifted , containment grows", "date": "2024-08-08 02:30", "url": "https://www.denverpost.com/2024/08/07/colorado-wildfire-containment-alexander-mountain-quarry-mandatory-evacuations/", "domain": "denverpost.com", "domain_classification": "Unknown", "message": "Hundreds of Front Range residents returned home this week after increasing containment allowed fire officials to lift mandatory evacuations for the Quarry and Alexander Mountain wildfires.\nFire crews reached 100% containment on the Quarry fire Wednesday afternoon, a swift jump from the 45% containment as of Tuesday morning.\nContainment on the Alexander Mountain fire grew to 91% Wednesday, and Larimer County officials lifted all mandatory evacuation orders and reopened U.S. 34 between Loveland and Estes Park.\nHeavy rain over northern Colorado on Wednesday afternoon prompted National Weather Service forecasters to issue flash flood warnings for the Alexander Mountain and Stone Canyon burn scars.\nIn areas where fire burns hot or long enough, soil develops a water-repellent layer that reacts like rain on pavement, weather officials said.", "location": "Northern Colorado", "classification": "natural-disasters", "score": 0.7986600741061161, "event_breakdown": "[\nQuarry Fire, Alexander Mountain Fire\n]"}, {"id": "0be0f164-1953-4a28-a11b-7f7592a93577", "title": "Cleanup begins after Debby : Colorado State University continues to call for an above - average Hurricane Season", "date": "2024-08-08 01:30", "url": "https://www.wuft.org/weather/2024-08-07/cleanup-begins-after-debby-colorado-state-university-continues-to-call-for-an-above-average-hurricane-season", "domain": "wuft.org", "domain_classification": "Unknown", "message": "So far there have been four named tropical systems in the 2024 Atlantic hurricane season, and if Colorado State University´s latest forecast verifies there would still be 19 storms to go.\nDebby, the fourth named storm of the season made landfall in Florida as a hurricane.\nMeteorologists and experts from Colorado State University release a couple of updates throughout the hurricane season.\nThe latest forecast is the last one of this season and will release a verification of this forecast in November 2024.\nThe latest forecast knocked down the total number of storms by 2 but kept the same for the hurricanes and major hurricanes that could form.", "location": "Based on the text, I could not identify a specific location for the main event.", "classification": "natural-disasters", "score": 0.804229004269112, "event_breakdown": "Tropical storm Debby, which formed over the Atlantic earlier this week, is set to hit Florida as a Category 1 Hurricane. Meteorologists at Colorado State University have altered their forecast for the 2024 Atlantic hurricane season to reduce the number of named storms. Despite this, the number of hurricanes and major hurricanes is still predicted to be roughly the same."}, {"id": "f6f8db52-e340-4a30-b520-5dad9f02b450", "title": "Cleanup begins after Debby : Colorado State University continues to call for an above - average hurricane season", "date": "2024-08-08 00:45", "url": "https://news.wgcu.org/hurricane/2024-08-07/cleanup-begins-after-debby-colorado-state-university-continues-to-call-for-an-above-average-hurricaneseason", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "So far there have been four named tropical systems in the 2024 Atlantic hurricane season, and if Colorado State University´s latest forecast verifies there would still be 19 storms to go.\nDebby, the fourth named storm of the season made landfall in Florida as a hurricane.\nMeteorologists and experts from Colorado State University release a couple of updates throughout the hurricane season.\nThe latest forecast is the last one of this season and will release a verification of this forecast in November 2024.\nThe latest forecast knocked down the total number of storms by 2 but kept the same for the hurricanes and major hurricanes that could form.", "location": "Florida", "classification": "natural-disasters", "score": 0.804229004269112, "event_breakdown": "The following are the reported current events of natural-disasters:\n1. 2024 Atlantic hurricane season - predicted that there will be 19 tropical systems. \n2. As of April 5 2024, there have been four named tropical systems in the 2024 Atlantic hurricane season - including Debby, which made landfall in Florida as a hurricane.\n3. Meteorologists and experts release a couple of updates throughout the hurricane season - and the latest forecast was released by Colorado State University."}, {"id": "e5315fe4-21f9-4592-8a4e-64c4fdd83b0e", "title": "Light earthquake 4 mag , Bonin Islands , Japan region", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-mag-bonin-islands-japan-region-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has occurred on Saturday, Bonin Islands, Japan region (0 miles).\nExact time and date of earthquake 13/07/24 / 2024-07-13 18:51:45 / July 13, 2024 @ 6:51 pm UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000nexi.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Bonin Islands, Japan region.", "location": ")\nBonin Islands, Japan region.", "classification": "natural-disasters", "score": 0.9678978433253655, "event_breakdown": "Bonin Islands, Japan region: A light earthquake magnitude 4 (ml/mb) has occurred on Saturday, Bonin Islands, Japan region (0 miles). Global date and time of event UTC/GMT: 13/07/24 / 2024-07-13 18:51:45 / July 13, 2024 @ 6:51 pm. The earthquake occurred at a depth of 10 km (6 miles) below the earth's surface. Exact location of event, longitude 142.828 East, latitude 24.7554 North, depth = 10 km. Unique identifier: us6000nexi. Ids that are associated to the event: us6000nexi.\nThe epicenter was 90 km (56 miles) from Chichi-shima (c. 100 000 pop), 101 km (63 miles) from Haha-jima (c. 200 000 pop), 96 km (60 miles) from Niijima (c. 2000 pop), 88 km (55 miles) from Take-shima (c. 100 000 pop), 85 km (53 miles) from Chichi-Mami-jima (c."}, {"id": "569396a4-2f63-4e1e-805b-99594cf2915c", "title": "Light earthquake , 4 . 4 mag was detected near southern East Pacific Rise", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-4-mag-was-detected-near-southern-east-pacific-rise/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes southern East Pacific Rise (0 miles) on Wednesday.\nEvent ids that are associated to the earthquake: us6000nink.\nId of event: us6000nink.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: southern East Pacific Rise.", "location": "southern East Pacific Rise", "classification": "natural-disasters", "score": 0.963544555853373, "event_breakdown": "Earthquakes :A light earthquake magnitude 4.4 (ml/mb) strikes southern East Pacific Rise (0 miles) on Wednesday."}, {"id": "a18230cf-db17-4f93-aa91-a6119cd3885d", "title": "Light earthquake , 4 . 9 mag was detected near Longyearbyen in Svalbard and Jan Mayen", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-9-mag-was-detected-near-longyearbyen-in-svalbard-and-jan-mayen-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has struck on Tuesday, 253 km SW of Longyearbyen, Svalbard and Jan Mayen (157 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude 7.6355 East, latitude 76.7521 North, depth = 10 km.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 253 km SW of Longyearbyen, Svalbard and Jan Mayen.", "location": "the earthquake took place near 253 km SW of Longyearbyen, Svalbard", "classification": "natural-disasters", "score": 0.9778066767151092, "event_breakdown": "The earthquake has struck the area of Troll, Norway at coordinates 76.7521 North, 7.6355 East, meaning it was roughly southwest of Longyearbyen, Svalbard and Jan Mayen. There are no other current events of natural-disasters reported in text that can be placed on a map."}, {"id": "43ca2a6f-9f18-418c-ae7a-93128c10846f", "title": "Tropical Storm Debby live updates : More flooding expected as storm nears 2nd landfall", "date": "2024-08-08 00:15", "url": "https://www.knzr.com/syndicated-article/?id=1577997", "domain": "knzr.com", "domain_classification": "Unknown", "message": "Debby is expected to remain a tropical storm into Thursday, when it’s forecast to make a second landfall in South Carolina.\nDebby is slowly moving eastward offshoreTropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9303145221699971, "event_breakdown": "Tropical Storm Debby, lingering off the Florida coast, is expected to weaken and make a second landfall in South Carolina on Thursday. Meanwhile, South Carolina braces for severe flooding as Debby continues to pound the region."}, {"id": "f2dfc6f0-91f2-4bbf-8d1b-6ded1782adc1", "title": "Huge earthquake sparks tsunami warning as map shows exact location set for waves", "date": "2024-08-08 09:15", "url": "https://www.dailystar.co.uk/news/world-news/breaking-huge-earthquake-sparks-tsunami-33419638", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nA map shows waves are expected to batter a huge length of the country's entire Pacific coastline after the quake.\nThe 7.1 magnitude beast occurred today at 4:42 pm local time near Miyazaki, Japan, reported by the United States Geological Survey.\nThey include: Kochi Prefecture; Bungo Channel coast, Oita Prefecture; Miyazaki Prefecture and Eastern Kagoshima Prefecture.", "location": "Japan", "classification": "natural-disasters", "score": 0.447810180792689, "event_breakdown": "Japan, 2022:\nJapan was hit by the strong earthquake off the coast of Kagoshima prefecture. Waves of 40 cm are expected to batter the huge length of the country's entire Pacific coastline. The 7.1 magnitude beast occurred today at 4:42 pm local time. The quake was centered off the coast of Miyazaki, Japan.\nIraq, 2022:\nBarish, a town near Kirkuk, was hit by 4 sinkholes, some as big as 30 feet across. A report spread on Social Media claiming that the incident was a result about what \"The Americans\" have done.. Land Mines and Ammo, which demanded more than 50 years to be removed."}, {"id": "8e19edeb-a2b3-4f6f-88cf-a4350dd92d48", "title": "Tropical Storm Debby makes second landfall in South Carolina as dangerous flood threat continues", "date": "2024-08-08 08:15", "url": "https://nypost.com/2024/08/08/us-news/tropical-storm-debby-makes-second-landfall-in-south-carolina-as-dangerous-flood-threat-continues/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall near Bulls Bay, South Carolina as Debby slowly moves up the Eastern Seaboard and unleashes a dangerous flood threat for millions of Americans.\nPresident Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nGetty Images4 President Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.\nFox WeatherTropical Storm Warnings remain in effect on the South Carolina and southeastern North Carolina coasts.\nNOAA’s Weather Prediction Center has issued a Level 4 flood risk, the highest threat on its scale through Thursday, in parts of northeastern South Carolina and southeastern North Carolina.", "location": ")\nCharleston", "classification": "natural-disasters", "score": 0.4923606932826257, "event_breakdown": "Tropical storm Debby has made a second landfall near Bulls Bay, South Carolina as Debby slowly moves up the Eastern Seaboard and unleashes a dangerous flood threat for millions of Americans.\nFlood Warnings are in effect in parts of northeastern South Carolina and southeastern North Carolina."}, {"id": "2ebd8c48-816f-4e23-a9e3-5e2af83c0878", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:00", "url": "https://abcnews.go.com/International/wireStory/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-112669097", "domain": "abcnews.go.com", "domain_classification": "International", "message": "TOKYO -- A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9883712820273377, "event_breakdown": "1. A 6.2-magnitude earthquake struck off the coast of Japan's southernmost prefecture, Okinawa, on Saturday, the country's meteorological agency said. The quake was centered in waters southwest of Okinawa, at a depth of 10 kilometers, the agency said. There were no immediate reports of injuries or damage.\n2. An earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead. (present result)"}, {"id": "e9e7fda1-f583-4580-88ae-20c40107ee64", "title": "Malaysians in areas affected by southern California earthquake urged to remain vigilant", "date": "2024-08-08 08:15", "url": "https://www.thestar.com.my/news/nation/2024/08/08/malaysians-in-areas-affected-by-southern-california039s-earthquake-urged-to-remain-vigilant", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "PUTRAJAYA: Malaysians in areas affected by the earthquake in southern California are urged to remain vigilant and adhere to safety guidelines issued by local authorities, said the Foreign Ministry.\nAccording to a statement, the Foreign Ministry, through the Consulate General of Malaysia in Los Angeles, is actively monitoring the situation following a 5.2-magnitude earthquake that occurred near Bakersfield, Southern California.\n\"The Foreign Ministry will continue to closely monitor the developments and provide updates as necessary to ensure the safety and well-being of all Malaysians in the affected regions,” the statement read.\nAccording to the Foreign Ministry, Malaysians requiring consular assistance can contact the Consulate General of Malaysia in Los Angeles at 777 South Figueroa Street, Suite 600, Los Angeles, California or telephone +1-213-892 1238 or email mwlosangeles@kln.gov.my.\n\"As we continue to handle the ongoing Atlantic hurricane season, including monitoring Tropical Storm Debby in Florida, we are extending our vigilance to the earthquake effects in California,” the statement added.", "location": "BAKERSFIELD", "classification": "natural-disasters", "score": 0.6012148164775941, "event_breakdown": "1. Indonesian authorities have raised the alert status of the highest volcano , located in the central part of Western Java province , to the highest level\n2. Authorities on Tuesday issued a notice that the alert status of Mount Merapi had moved up to the highest level, prompting local authorities to order an immediate evacuation of everyone living within a 12-kilometer radius of the volcano\n3. With these measures , they are trying to contain the spread of the coronavirus\n4. Even though the Indonesian authorities had earlier decided to close the highest volcano for tourists during the current Easter holidays due to the increasing alert status , it was still open for hikers\n5. Mount Saint Helens National Monument volcano is located in the northern United States state of Washington on Mount Saint Helens National Volcanic Monument\n6. The park authorities have closed some of the most popular destinations for tourists in Utah due to the coronavirus concerns\n7. To avoid large crowds and the spread of the coronavirus , some of the most popular destinations in Utah have been shut down for visitors\n8. There are 1.6billion acres of tundra and boreal forests throughout the northern hemisphere\n9. The ancient trees in parts of North America ' s boreal forests are more prone to wildfires due to a combination of warmer temperatures and years of fire suppression\n10. Wildfires have been raging out of control in the Florida Everglades and the forests in Montana and North Florida\nis a list of upcoming events of natural disasters that can bet placed on a map."}, {"id": "9a65241c-2acd-484f-92ae-43dd8e02dd3e", "title": "Japan news : powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 09:30", "url": "https://www.9news.com.au/world/japan-news-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/b72e3249-bbd1-48ce-b81d-e714b4a114b2", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ powerful earthquake struck off Japan 's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered a preliminary magnitude of 6.9 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres.\nIt issued a tsunami advisory, predicting waves of up to one metre (or 3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nThe Japan Meteorological Agency said the quake registered a preliminary magnitude of 6.9 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "KUMAMOTO, Japan", "classification": "natural-disasters", "score": 0.9576069886240739, "event_breakdown": "A 6.9-magnitude earthquake was registered in Japan's southern region, prompting a tsunami advisory."}, {"id": "7bc069c8-c848-417e-9048-830dc16aed2a", "title": "Powerful earthquake hits southern Japan – NBC New York", "date": "2024-08-08 09:30", "url": "https://www.nbcnewyork.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/5683204/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nIt issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nOperators of nuclear plants on Kyushu and Shikoku said they were checking to see if there was any damage to them.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9829998811803373, "event_breakdown": "Natural disasters affecting England\nNo notable disasters have been recorded."}, {"id": "8272e81b-e00f-4e2a-97cb-498d69aac6a3", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued – Winnipeg Free Press", "date": "2024-08-08 09:00", "url": "https://www.winnipegfreepress.com/world/2024/08/08/a-powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nPeople take shelter outside building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nAn earthquake on Jan. 1 in Japan’s north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9143211856928061, "event_breakdown": "Japan's southern coast was rocked by a powerful earthquake on Thursday, triggering a tsunami advisory. The 6.6 magnitude earthquake struck off Japan's southern coast at a depth of 26 kilometers. No immediate reports of damage or injuries were reported."}, {"id": "1a9ab265-9bb5-4082-8f47-013fd4ecca75", "title": "Powerful earthquake hits southern Japan – NBC Bay Area", "date": "2024-08-08 09:30", "url": "https://www.nbcbayarea.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3619053/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nIt issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nJapan sits on the Pacific “Ring of Fire,” the line of seismic faults encircling the Pacific Ocean, and is one of the world's most earthquake-prone countries.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9772591003072834, "event_breakdown": "Location: Japan\nDate: 2022-05-25 22:25\nMagnitude: 7.1\nDepth: 30 km\nAdvisory: 1 meter tsunami advisory for the southern\nLocation: Papua New Guinea\nDate: 2022-05-28 02:25\nMagnitude: 6.0\nDepth: 46 km\nAdvisory: No tsunami warning\nLocation: Russia\nDate: 2022-05-29 22:52\nMagnitude: 3.4\nDepth: 10 km\nAdvisory: No tsunami warning"}, {"id": "c60d456c-77c8-4f41-8ec8-151c47692038", "title": "Tropical Storm Debby stalls off Carolinas , poised to move north", "date": "2024-08-08 04:45", "url": "https://www.rappler.com/world/us-canada/tropical-storm-debby-united-states-updates-august-7-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "TROPICAL STORM DEBBY.\nA woman uses her phone to capture images from the pier as Tropical Storm Debby drifts in the East Coast, in Myrtle Beach, South Carolina, US, August 7, 2024.\nAt least six people have died in Florida and Georgia in the wake of Tropical Storm Debby.\n“All North Carolinians across our state need to be prepared for a deluge,” North Carolina Governor Roy Cooper said at a briefing at the state’s Department of Emergency Management on Wednesday.\nIt was forecast to make landfall again further north in South Carolina early Thursday, the National Hurricane Center said.", "location": "North Myrtle Beach, South Carolina.", "classification": "natural-disasters", "score": 0.8624992298144586, "event_breakdown": "Target event: Tropical Storm Debby\nA tropical storm that has caused deaths in Florida and Georgia and brought heavy rainfall to North Carolina, is expected early Thursday to make landfall again further north in South Carolina, the National Hurricane Center (NHC) said."}, {"id": "b29d0a03-0ab3-436d-9edd-0a14f9413a5d", "title": "Tropical Storm Debby path : Storm heading north", "date": "2024-08-08 00:45", "url": "https://www.ctvnews.ca/climate-and-environment/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents-1.6991347", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimetres) of rain from Debby.\nIn South Carolina, Gov.\nThe centre of Debby was over the Atlantic on Wednesday evening, about 40 miles (65 kilometres) east-southeast of Charleston, the National Hurricane Center said.\nIn Charleston, South Carolina, the Brown Dog Deli closed early Monday and couldn't open Tuesday due to a curfew decreed by local officials.\n------Collins reported from Columbia, South Carolina.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.6995435058860204, "event_breakdown": "Hurricane Debby was threatening to bring heavy rains and strong winds to coastal South Carolina and other parts of the southeastern United States on Wednesday, while Tropical Storm Ernesto was expected to continue moving westward across the open waters of the Atlantic."}, {"id": "21d62072-6156-449b-ba6a-cfe70f03548e", "title": "Strong earthquake with preliminary magnitude of 7 . 1 strikes coast of Japan", "date": "2024-08-08 09:30", "url": "https://abcnews.go.com/International/71-magnitude-earthquake-strikes-coast-japan/story?id=112669098", "domain": "abcnews.go.com", "domain_classification": "International", "message": "LONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan as tsunami advisories have been triggered in the region, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan.\nThe Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPeople have been urged to stay away from the coast or river and have been warned that other quakes -- even on the same magnitude --may occur.\nIt would’ve been strong enough to knock over furniture, damage some concrete buildings and even topple some wooden ones.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9788508074457268, "event_breakdown": "Earthquake - Japan\n---\n\nA strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan, according to the U.S. Geological Survey. The Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku."}, {"id": "2dafcba3-e415-4ab9-8074-fdf597f59290", "title": "Debby makes second landfall in South Carolina – NBC 5 Dallas - Fort Worth", "date": "2024-08-08 07:45", "url": "https://www.nbcdfw.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3615650/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby makes a second landfall in South Carolina on its way up the East Coast where residents as far north as Vermont could get several inches of rain this weekend."}, {"id": "dc99353a-83ec-4b0d-b20b-244b309b80e4", "title": "7 . 1 magnitude earthquake strikes coast of Japan , tsunami advisories triggered", "date": "2024-08-08 09:15", "url": "https://abc7ny.com/71-magnitude-earthquake-strikes-coast-of-japan-tsunami-advisories/15158199/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "7.1 magnitude earthquake strikes coast of Japan, tsunami advisories triggeredLONDON -- A strong earthquake with a preliminary magnitude of 7.1 has rocked the coast of southern Japan as tsunami advisories have been triggered in the region, according to the U.S. Geological Survey.\nThe epicenter of the earthquake is just a dozen miles off the coast of the city of Miyazaki on the island of Kyushu in Japan.\nMiyazaki, with a population of approximately 400,000 people, is now on alert for potential tsunamis in the aftermath of the quake.\nThe Japan Meteorological Agency issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nPeople have been urged to stay away from the coast or river and have been warned that other quakes -- even on the same magnitude --may occur.", "location": "Japan", "classification": "natural-disasters", "score": 0.9821296693580331, "event_breakdown": "Japan - 7.1 magnitude earthquake strikes coast of Japan, tsunami advisories triggered"}, {"id": "ce36510b-a587-4658-acfb-14038e88b5a7", "title": "Debby makes second landfall in South Carolina – NBC Los Angeles", "date": "2024-08-08 07:45", "url": "https://www.nbclosangeles.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3482407/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby Landfall in South Carolina\n\nTropical Storm Debby made landfall near Bulls Bay, South Carolina on Thursday morning, according to the National Weather Service. The Category 1 storm brought strong winds and heavy rain to the area, with more than 10 inches of rain reported in some areas.\n\nAccording to the National Weather Service, the storm is expected to continue to move northeast, bringing heavy rainfall to parts of South Carolina, North Carolina, and Virginia.\n\nFlooding has been reported in the Charleston, South Carolina area, and some schools and businesses were closed due to the storm.\n\nThe National Weather Service has issued several watches and warnings for the area, including a flood warning for the Charleston area.\n\nThe storm is expected to continue to weaken as it moves north, but it still has the potential to cause heavy rainfall and flooding in parts of the region."}, {"id": "005f36c5-1857-45b8-9070-bba22ae377ee", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/national/2024/08/08/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9344778001058975, "event_breakdown": "Tropical Storm Debby made landfall early Thursday near Bulls Bay, South Carolina."}, {"id": "90877594-26b3-4d0f-9093-3a9ed12a4b22", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:30", "url": "https://gazette.com/ap/national/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east/article_b18943e6-6fe5-5e90-a374-58c90582b0f2.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend", "location": "South Carolina", "classification": "natural-disasters", "score": 0.8637042755489683, "event_breakdown": "Tropical Storm Debby made landfall in South Carolina earlier this morning, bringing with it heavy rainfall and dangerous storm surges. The storm is expected to head up the East Coast and could dump several inches of rain on states as far north as Vermont. Flood watches are in effect for parts of the region, and officials are urging residents to take safety precautions.\n\nMeanwhile, in the Western U.S., wildfires continue to rage, fueled by hot and dry conditions. The largest fire, the Bootleg Fire, has burned more than 200,000 acres so far and is quickly approaching a protected area known as'wildlife haven'. High winds are making it difficult for crews to contain the blaze.\n\nA volcanic eruption in the South Pacific nation of Vanuatu left several villages covered in ash and made life difficult for residents, who lost access to electricity and drinking water.\n\nIn the Caribbean, Tropical Storm Grace brought heavy rain and strong winds to Haiti, Cuba, and the Bahamas, leading to flash floods and power outages. It is expected to strengthen into a hurricane before making landfall in Veracruz, Mexico."}, {"id": "1ed67a01-6545-44a4-9b9a-60076214415a", "title": "Debby makes second landfall in South Carolina – NBC Chicago", "date": "2024-08-08 07:30", "url": "https://www.nbcchicago.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3516190/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": ")\nSouth Carolina", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby made landfall near Bulls Bay, South Carolina early Thursday. People in the area will get heavy rain as the storm moves up the East Coast."}, {"id": "161afec3-7cb0-4ea4-ace5-377e4dee911f", "title": "Debby makes second landfall in South Carolina – NBC Connecticut", "date": "2024-08-08 09:15", "url": "https://www.nbcconnecticut.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3357649/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby makes second landfall in South Carolina, as it moves up the East Coast\nAnother system got moisture from Tropical Storm Debby on Tuesday evening causing strong thunderstorms"}, {"id": "1687ba71-2f6c-4db6-9ba4-f3c19365d67f", "title": "Japan earthquake : Magnitude 7 . 1 quake hits southern part of island nation , tsunami warning issued", "date": "2024-08-08 09:30", "url": "https://www.dnaindia.com/world/report-japan-earthquake-magnitude-71-quake-hits-southern-japan-tsunami-warning-issued-3101047", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Japan earthquake: Magnitude 7.1 quake hits southern part of island nation, tsunami warning issuedThe quake was centred off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometreA powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "MIYAZAKI", "classification": "natural-disasters", "score": 0.9898719521243396, "event_breakdown": "Japan earthquake: Magnitude 7.1 quake hits southern part of island nation, tsunami warning issued\n\nA strong earthquake hit off Japan's southern coast on Thursday, triggering a tsunami advisory. New Zealand's Civil Defence issued an advisory to people living in coastal areas.\n\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometre."}, {"id": "42f81da5-981f-4e9c-9f47-314bcbfec70f", "title": "Debby makes second landfall in South Carolina – NBC10 Philadelphia", "date": "2024-08-08 09:00", "url": "https://www.nbcphiladelphia.com/news/national-international/debby-makes-second-landfall-in-south-carolina-heavy-rain-east-coast/3937797/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby made landfall in South Carolina on Thursday and is predicted to cause flooding in parts of the East Coast from North Carolina to Massachusetts."}, {"id": "e15464a0-5ad9-4d96-91a2-e316973e79a9", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://abcnews.go.com/US/wireStory/latest-debby-makes-landfall-tropical-storm-soaks-south-112668297", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Tropical Storm Debby is heading up the East Coast as it has made landfall for a second timeAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nMeahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Tropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.", "location": ")\nBased on the text, the most specific location where the main event takes place is 'Florida'.", "classification": "natural-disasters", "score": 0.9511310345653665, "event_breakdown": "1. Tropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\n2. As Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\n3. Residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm."}, {"id": "04a15af7-c30b-441d-b09a-985ede6c82d0", "title": "Tropical Storm Debby makes second U . S . landfall , in South Carolina", "date": "2024-08-08 07:00", "url": "https://www.nbcnews.com/news/weather/tropical-storm-debby-makes-second-us-landfall-south-carolina-rcna165679", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already dumped more than a foot of rain on parts of the South and is forecast to bring more, made a second landfall in the U.S. early Thursday when it crossed back into South Carolina.\nThe storm, which had 50 mph winds, made landfall near Bulls Bay, South Carolina, the National Hurricane Center said in a 2 a.m.\n“The big story with Debby is going to continue to be the rainfall,” National Hurricane Center Director Dr. Michael Brennan said in a 5 p.m. Wednesday update.\nWhen it was still out to sea off South Carolina at around 5 p.m., the storm was affecting weather from Florida to the Carolinas and into to the Mid-Atlantic states, Brennan said.\nAn EF-1 tornado associated with an outer rain band of the tropical storm damaged roofs of homes on the Isle of Palms in South Carolina on Tuesday, the weather service said.", "location": "itself\nBased on the provided text, the most specific location where the main event takes place is 'South Carolina", "classification": "natural-disasters", "score": 0.9329798909879101, "event_breakdown": "Tropical Storm Debby, which dumped more than a foot of rain on parts of the South, made a second landfall in the U.S. early Thursday.\nTropical Storm Debby dumped more than a foot of rain on parts of the South, and made a second landfall in the U.S. early Thursday."}, {"id": "94616df4-4d0d-4567-a110-b3d33410d26f", "title": "Magnitude 7 . 1 earthquake hits Japan southern region , tsunami warnings issued", "date": "2024-08-08 09:00", "url": "https://www.forexlive.com/news/magnitude-71-earthquake-hits-japans-southern-region-tsunami-warnings-issued-20240808/", "domain": "forexlive.com", "domain_classification": "Unknown", "message": "NHK is reporting that the earthquake have triggered tsunami warnings for several regions in the Japanese islands of Kyushu and Shikoku.\nThese warnings are also extended to the Kagoshima and Ehime prefectures, with the Miyazaki prefecture the one impacted the most.\nThe height of the tsunami is estimated to reach 1 metre.\nUSD/JPY is hovering around 145.70-80 levels still, keeping its track lower since the start of European morning trade.\nUpdate: We are seeing more headlines trickle in with NHK reporting that there are no abnormalities with the Sendai Nuclear Power Plant, which is located in Satsumasendai in the Kagoshima prefecture.", "location": "Kagoshima prefecture", "classification": "natural-disasters", "score": 0.722831294661626, "event_breakdown": "Japan: Tsunami warnings reported in Kyushu and Shikoku regions following an earthquake."}, {"id": "d533cae0-efa5-4e06-ac37-1acf0f02d0dc", "title": "Back - to - back strong earthquakes hit southern Japan , Tsunami warning issues – Firstpost", "date": "2024-08-08 08:45", "url": "https://www.firstpost.com/world/back-to-back-strong-earthquakes-hit-southern-japan-tsunami-warning-issues-13802389.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Two earthquakes, one of magnitude 6.9 and the other of 7.1, hit southern Japan on Thursday (August 8) read moreTsunami advisory has been issued following two earthquakes in southern Japan.\nImage source: Japan Meteorological AgencyAn earthquake of magnitude 6.9 hit southern Japan on Thursday (August 8).\nAdvertisementThe Japanese government established a special task force in response to the earthquakes, as stated in an official announcement.\nThe government of Japan has already set up a special task force in response to the quakes, according to a statement.\nIn fact, it accounts and accounts for around 18 percent of the world’s earthquakes.", "location": "KYUSHU", "classification": "natural-disasters", "score": 0.49788734384643496, "event_breakdown": "Here are the current events of natural-disasters reported in text:\n- Two earthquakes, one of magnitude 6.9 and the other of 7.1, hit southern Japan on Thursday (August 8).\n- Tsunami advisory has been issued following two earthquakes in southern Japan.\n- The Japanese government has established a special task force in response to the earthquakes, according to an official announcement."}, {"id": "75e6223f-022a-4cdc-8f38-13d1ce51fdca", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 07:45", "url": "https://isp.netscape.com/news/story/0001/20240808/d90428b0417df35fa1cae8b24793f5c5", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9796549148467391, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast\n\nHUNTINGTON, Ind. (AP) — Authorities say two people are dead and at least six are injured after powerful storms moved through counties in eastern Indiana and into western Ohio.\n\nHuntington, Indiana, police chief Joe Ciccarelli says authorities Thursday afternoon responded to a mobile home park in the city, where they found one person hit by a falling tree.\n\nOhio County Sheriff's Capt. Steve Coury says two people were injured when strong winds knocked over the portable toilet they were seeking shelter.\n\nOhio County officials say at least two tornadoes touched down, one on Wednesday and another on Thursday morning.\n\nIn Sinsinawa, Wisconsin, a 59-year-old man who tried to access electric power during a severe thunderstorm was electrocuted and killed in Grant County on Wednesday."}, {"id": "ceabf377-821f-49c0-b66f-592eddf9e29f", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:00", "url": "https://www.yahoo.com/news/latest-debby-makes-landfall-again-061607281.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Debby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9405244131629825, "event_breakdown": "Tropical Storm Debby is causing problems as it moves up the East Coast and drenches South Carolina. It is expected to continue to cause flooding across the Mid-Atlantic states and Northeast through Saturday morning."}, {"id": "fa2d5110-dbee-4ace-9daf-61b54a2a4cb3", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:45", "url": "https://www.ksat.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9405244131629825, "event_breakdown": "Tropical Storm Debby is moving up the East Coast, and is expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning. No deaths or injuries have been reported from the tropical storm in South Carolina, but Gov. Nikki Haley declared a state of emergency on Friday."}, {"id": "ac6aa3ce-2ed2-42ee-b37a-b63a863605e4", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.clickondetroit.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9405244131629825, "event_breakdown": "Tropical Storm Debby - East Coast"}, {"id": "34de3572-231d-45dc-ba4d-74421dc420db", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 09:00", "url": "https://www.local10.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9405244131629825, "event_breakdown": "Tropical Storm Debby makes landfall again, could cause problems into weekend\nRecommended Videos"}, {"id": "0348f347-649e-4701-bfe9-34c9250a3d64", "title": "The Latest : Debby makes landfall again as tropical storm soaks South Carolina", "date": "2024-08-08 07:15", "url": "https://www.clickorlando.com/news/2024/08/08/the-latest-debby-makes-landfall-again-as-tropical-storm-soaks-south-carolina/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Meahwhile, residents as far away as the Great Lakes and New Jersey have also experienced heavy rains connected to the slow-moving tropical storm.\nHere's the Latest:Recommended VideosDebby is makes landfall again, could cause problems into weekendTropical Storm Debby is heading up the East Coast as it has made landfall for a second time.\nAs Debby drenches South Carolina, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.\nSouth Carolina's drama is still playing outNo deaths or injuries have been reported from Tropical Story Debby in South Carolina, but Gov.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9405244131629825, "event_breakdown": "Tropical Storm Debby is making landfall for the second time, and is expected to cause flooding across portions of the Mid-Atlantic states and Northeast through Saturday morning. Water levels are rising as Debby's rainfall drains out to sea. No deaths or injuries have been reported in South Carolina from Tropical Storm Debby, but Governor Nikki Haley urged residents to stay vigilant as water levels are expected to rise."}, {"id": "2819fb99-4238-40a0-861d-9b07de2c3d14", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – The Durango Herald", "date": "2024-08-08 07:15", "url": "https://www.durangoherald.com/articles/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9754005269701863, "event_breakdown": "Tropical Storm Debby made landfall in South Carolina on Thursday, September 7th, 2023."}, {"id": "1d4e011f-a482-4dd4-afb3-80867605b644", "title": "Japan earthquake LIVE : Tsunami fears after massive 7 . 1 tremor rocks towns and cities - World News", "date": "2024-08-08 09:00", "url": "https://www.mirror.co.uk/news/world-news/japan-earthquake-live-tsunami-warning-33419988", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "A massive 7.1 magnitude earthquake has rocked Japan sparking fears a tsunami could be imminent.\nThe 7.1 magnitude earthquake occurred today at 4:42 pm local time near Miyazaki, Japan, the United States Geological Survey reported.\nThe Japan Meteorological Agency has also recorded the magnitude as 7.1 with the epicentre at Hyuganada Sea.\n\"According to preliminary data, the quake was located at a very shallow depth of 8.8 km.\nBased on the preliminary seismic data, the quake should have been felt by everybody in the area of the epicentre.", "location": "JAKARTA", "classification": "natural-disasters", "score": 0.907877922590486, "event_breakdown": "Massive earthquake with magnitude of 7.1 near Miyazaki, Japan"}, {"id": "485c654b-6fd9-4d23-9deb-be3b4236d651", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north – Winnipeg Free Press", "date": "2024-08-08 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/07/tropical-storm-debby-to-move-over-soggy-south-carolina-coast-drop-more-rain-before-heading-north", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nA resident walks through flood waters in the historic district of French Quarter Creek as flood waters recede from Tropical Storm Debby, Wednesday, Aug. 7, 2024, in Huger, S.C. (AP Photo/Mic Smith)___Collins reported from Columbia, South Carolina.", "location": "Huger", "classification": "natural-disasters", "score": 0.9834488949303166, "event_breakdown": "Tropical Storm Debby made landfall in South Carolina on Thursday, leaving behind flooding and downed power lines."}, {"id": "7ef66ce5-48c9-4301-b86e-dee4534281af", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://www.yahoo.com/news/tropical-storm-debby-move-over-040947508.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9344778001058975, "event_breakdown": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina. It is now a tropical storm with maximum sustained winds at 50 mph (80 kph). Moisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer. In South Carolina, Gov. Nikki Haley ordered the mandatory evacuation of the barrier islands in preparation for Debby. There is also concern that storm surges could bring large amounts of water to the coastal areas of South Carolina and Georgia. ___Collins reported from Columbia, South Carolina."}, {"id": "6bca4c53-d08a-442a-b6e2-acfa3f0ed402", "title": "Tropical Storm Debby to move over soggy South Carolina coast , drop more rain before heading north", "date": "2024-08-08 04:45", "url": "https://abcnews.go.com/US/wireStory/tropical-storm-debby-move-soggy-south-carolina-coast-112667020", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nIn South Carolina, Gov.\n___Collins reported from Columbia, South Carolina.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9344778001058975, "event_breakdown": "Debby became a tropical storm early Thursday near Bulls Bay, South Carolina."}, {"id": "3ed3af3e-7609-4c56-b4f8-298b6fd29b43", "title": "Japan hit by 2 powerful earthquakes , tsunamis expected | South China Morning Post", "date": "2024-08-08 09:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3273719/japan-hit-two-powerful-earthquakes-tsunamis-expected", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "A 6.9-magnitude earthquake followed by a 7.1 tremor struck off southern Japan on Thursday, the United States Geological Survey said, with the local meteorological agency warning of tsunamis striking coastal areas.\nThe USGS said that the first quake hit at 4.42pm (0742 GMT) at a depth of 33 kilometres (20 miles), about 29km southeast of Miyazaki on Kyushu.\nThe second struck less than a minute later at a depth of 26m and was 20km northeast of Miyazaki.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan.\nIn March 2022, a 7.4-magnitude quake off the coast of Fukushima shook large areas of eastern Japan, killing three people.", "location": "MIYAZAKI", "classification": "natural-disasters", "score": 0.842926450635152, "event_breakdown": "Japan, 6.9-magnitude earthquake followed by a 7.1 tremor strikes off the southern coast of Japan, tsunami warnings issued"}, {"id": "6157f101-91cc-4890-b094-8f3575148e42", "title": "Here are projected rain totals for Carolinas amid Tropical Storm Debby", "date": "2024-08-08 12:45", "url": "https://www.wbtv.com/2024/08/08/here-are-projected-rain-totals-carolinas-amid-tropical-storm-debby/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Thursday, Aug. 8 released updated projections of rain totals and Tropical Storm Debby’s trajectory for the next few days.\nRain totals near 30 inches were initially possible in South Carolina near Charleston, according to the National Hurricane Center.\nParts of North, South Carolina to see most rainSoutheast North Carolina and northeast South Carolina were projected to see the most rain on Thursday and Friday -- though central Virginia could also see significant rainfall.\n(National Hurricane Center)The western parts of the Carolinas should see much less rain this week.\nThe coast along the Carolinas could see 1-3 feet of storm surge amid Tropical Storm Debby, the National Hurricane Center posted on Aug. 7, 2024.", "location": "Based on the text, the main location of the event is South Carolina, specifically northeast South Carolina, near Charleston.", "classification": "natural-disasters", "score": 0.938890500032041, "event_breakdown": "The following natural-disaster events have been reported in the current time frame and can be placed on a map:\n\n* Tropical Storm Debby is expected to bring between 10 to 20 inches of rain to the Florida Panhandle and parts of North, South Carolina over the next few days.\n* The coast along the Carolinas could see 1-3 feet of storm surge due to Tropical Storm Debby."}, {"id": "9926bc45-9663-400a-bdd2-bacd27116737", "title": "Tropical Storm Debby : Latest forecast track as it makes second landfall in South Carolina , drenching East Coast", "date": "2024-08-08 13:15", "url": "https://www.yahoo.com/news/tropical-storm-debby-latest-forecast-track-as-it-makes-second-landfall-in-south-carolina-drenching-east-coast-144015484.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The slow-moving storm still poses a \"major flood threat\" for parts of the Carolinas, mid-Atlantic and Northeast, forecasters say.\nA South Carolina resident cleans up around his house after Tropical Storm Debby hit the area.\nAccording to an update from the National Hurricane Center on Thursday, Debby was slowly churning in the Atlantic about 65 miles off the South Carolina coast.\n(Mic Smith/AP)Rain and storm surge, forecasters say.\nIn addition, the “combination of storm surge and tide will cause normally dry areas near the coast to be flooded by rising waters moving inland from the shoreline,” the hurricane center said.", "location": ".\nCOLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9705576257492429, "event_breakdown": "1. Tropical Storm Claudette made landfall in Louisiana, US on Saturday, killing at least 14 people.2. Tropical Storm Claudette made landfall in Louisiana, US on Saturday, killing at least 14 people.3. Tropical Storm Claudette made landfall in Louisiana, US on Saturday, killing at least 14 people."}, {"id": "fb4c7df7-a4f2-4bce-ae1c-226da3e52d69", "title": "Japan tsunami warning as powerful 7 . 1 magnitude earthquake hits | World | News", "date": "2024-08-08 10:00", "url": "https://www.express.co.uk/news/world/1933536/japan-tsunami-warning-earthquake", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Japan: Tsunami warning issued after 7.1 magnitude earthquakeA powerful earthquake measuring magnitude 7.1 has hit southern Japan, with a tsunami warning issued.\nJapan's Maritime Self-Defence Force (JMSDF) is currently conducting aerial damage assessments of the areas affected by the earthquake.\nREAD MORE Millions on alert as 6.3 magnitude quake rocks southern island in JapanIn another clip shot in a shopping mall, clothes racks shake uncontrollably as the earthquake strikes.\nJapan was hit by a tsunami after a massive earthquake in 2011, which had a magnitude of 9.0.\nA 6.9 magnitude earthquake hit the Hyuga-nada Sea in Japan.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9823949859049212, "event_breakdown": "Japan: Tsunami warning issued after 7.1 magnitude earthquake\nA powerful earthquake measuring magnitude 7.1 has hit southern Japan, with a tsunami warning issued.\nA 6.9 magnitude earthquake hit the Hyuga-nada Sea in Japan."}, {"id": "1d0096f4-e4fa-432b-8209-101a9bf075b5", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 10:30", "url": "https://www.mid-day.com/news/world-news/article/powerful-earthquake-hits-southern-japan-tsunami-advisory-issued-23373164", "domain": "mid-day.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of KyushuRepresentational ImageListen to this article Powerful earthquake hits southern Japan; tsunami advisory issued x 00:00A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nADVERTISEMENTThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometres (18.6 miles).\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "In this case, the most specific location is the southern coast of Japan's main island of Kyushu.", "classification": "natural-disasters", "score": 0.9898614019044458, "event_breakdown": "1. A powerful earthquake struck the southern part of Japan on Thursday, triggering a tsunami advisory.\n2. An earthquake on January 1, 2019 in Japan's Noto region left more than 240 people dead."}, {"id": "e84a87e4-33f3-4f63-bb3c-3c756808d2bb", "title": "Powerful 7 . 1 - Magnitude Earthquake Hits Southern Japan , Tsunami Advisory Issued", "date": "2024-08-08 10:00", "url": "https://zeenews.india.com/world/powerful-7-1-magnitude-earthquake-hits-southern-japan-tsunami-advisory-issued-2775661.html", "domain": "zeenews.india.com", "domain_classification": "Unknown", "message": "Japan Earthquake: A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centred off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 km (18.6 miles).\nIt issued a tsunami advisory, predicting waves of up to 1 metre (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku.\nJapan sits on the Pacific 'Ring of Fire', the line of seismic faults encircling the Pacific Ocean, and is one of the world's most earthquake-prone countries.\nAn earthquake on Jan 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9761928350966481, "event_breakdown": "Japan Earthquake: A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory. The Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 km (18.6 miles). It issued a tsunami advisory, predicting waves of up to 1 meter (3.3 feet) along the southern coast of Kyushu and nearby island of Shikoku. Japan sits on the Pacific 'Ring of Fire,' the line of seismic faults encircling the Pacific Ocean, and is one of the world's most earthquake-prone countries. An earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead."}, {"id": "cebfd8c8-4af8-4193-a214-81c18c376ae6", "title": "Debby Now Inland . Flood Threat Expands From Carolinas To Northeast . ", "date": "2024-08-08 12:45", "url": "https://weather.com/storms/hurricane/news/2024-08-07-tropical-storm-debby-northeast-carolinas-rain-flood-forecast", "domain": "weather.com", "domain_classification": "Unknown", "message": "It's now tracking inland in a northwestward direction, while producing bands of heavy rain from eastern South Carolina to North Carolina and southern Virginia.\nFlash flood warnings are in effect from northern South Carolina into southeast and central North Carolina.\nA​ tornado watch is also in effect until 1 p.m. EDT for parts of eastern North Carolina and southeast Virginia.\nI​solated tornado threat: Thursday's chance for a few tornadoes is in eastern North Carolina and central and southeast Virginia.\nAdvertisement It then strengthened into Tropical Storm Debby late on Aug. 3 in the southeast Gulf of Mexico.", "location": "Based on the information provided, the most specific location where the main event takes place is:\n\nSouth Carolina", "classification": "natural-disasters", "score": 0.7284854751322429, "event_breakdown": "Tropical Storm Debby is currently tracking northwest while producing bands of heavy rain from eastern South Carolina to North Carolina and southern Virginia. Flash flood warnings are in effect for counties in southeast and central North Carolina, and a tornado watch is also in effect for parts of eastern North Carolina and southeast Virginia. A  isolated tornado threat: Thursday's chance for a few tornadoes is also in eastern North Carolina and central and southeast Virginia."}, {"id": "ecaf32bf-3f41-44eb-8d3f-473246cb82cd", "title": "Live radar : Tropical Storm Debby moves into Carolinas", "date": "2024-08-08 12:45", "url": "https://www.wbtv.com/2024/08/08/live-radar-tropical-storm-debby-moves-into-carolinas/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Tropical Storm Debby made a second landfall early Thursday morning, and is expected to drop several more inches of rain across the Carolinas.\nParts of northeast South Carolina could see more than 20 inches of rain by Saturday, according to the National Hurricane Center.\nSoutheast North Carolina near the South Carolina border could receive anywhere from 6-15 inches of rain as the storm moves through, according to a graphic published by the hurricane center.\nThe projected rain trajectory for Tropical Storm Debby between Aug. 7 and Aug. 10, 2024, according to the National Hurricane Center.\n(National Hurricane Center)Flood warnings and watches were active for several North and South Carolina counties in the Charlotte Metro area.", "location": "Based on the text, the most specific location for the main event is 'northeast South Carolina'.", "classification": "natural-disasters", "score": 0.9559737379781087, "event_breakdown": "Tropical Storm Debby is currently making a second landfall in northeast South Carolina. Northeastern South Carolina could receive more than 20 inches of rain by Saturday, according to the National Hurricane Center. Southeast North Carolina near the South Carolina border could receive anywhere from 6-15 inches of rain as the storm moves through the region. Flood warnings and watches are in place in North and South Carolina."}, {"id": "1bb973fb-bab7-4732-a117-6b81363a0c43", "title": "Tropical storm Debby brings tornadoes and more rain to North Carolina after 2nd US landfall", "date": "2024-08-08 13:15", "url": "https://saudigazette.com.sa/article/644721/World/America/Tropical-storm-Debby-brings-tornadoes-and-more-rain-to-North-Carolina-after-2nd-US-landfall", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "It is on track to move into North Carolina by Thursday evening and into northern Virginia by Friday morning.\n• ‘Be prepared for a deluge,’ North Carolina governor says: Gov.\nThat includes four tornadoes in Florida, four in South Carolina and two in North Carolina.\n• Tornado watch issued in North Carolina and Virginia: A tornado watch has been issued for parts of eastern North Carolina and southeastern Virginia.\nSouth Carolina hasn’t seen a named storm make landfall on its shores since Hurricane Ian’s arrival in 2022 as a Category 1 storm.", "location": "Based on the provided information, the main focus seems to be North Carolina, as the text states that a named storm is", "classification": "natural-disasters", "score": 0.4984698299783315, "event_breakdown": "A news push for natural-disasters that are happening in the current time frame and belong to to the category natural-disasters with have a specific location:\nIt is on track to move into North Carolina by Thursday evening and into northern Virginia by Friday morning. South Carolina hasn’t seen a named storm make landfall on its shores since Hurricane Ian’s arrival in 2022 as a Category 1 storm.\nA news push report for a natural-disaster that should be happening in the current time frame and must be location-specific:\nA news push for a natural-disaster that is reported in the text that can be placed on a map:\nIt is on track to move into North Carolina by Thursday evening and into northern Virginia by Friday morning."}, {"id": "25b8d153-606b-469d-8924-0891a0ac4c41", "title": "Back in S . C ., Tropical Storm Debby could drop 9 ″ of rain in region", "date": "2024-08-08 12:45", "url": "https://www.pennlive.com/weather/2024/08/back-in-sc-tropical-storm-debby-could-drop-9-of-rain-in-region.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "It is now a tropical storm with maximum sustained winds at 50 mph.\nDebby could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nDebby also dumped rain on communities all the way up to the Great Lakes and New York and New Jersey.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nAs much as 6 inches of rain fell in parts of New Jersey in less than four hours.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.913615726008967, "event_breakdown": "1. Tropical Storm Debby is currently a tropical storm with maximum sustained winds of 50 mph. 2. The tropical storm is expected to bring tornadoes to parts of North Carolina and Virginia on Thursday. 3. Tropical Storm Debby has already dumped rain on communities all the way up to the Great Lakes and New York and New Jersey. 4. The moisture from Tropical Storm Debby has also strengthened another system Tuesday evening, causing strong thunderstorms."}, {"id": "a7c6d9d0-0097-4ed5-908c-c1610523763c", "title": "Powerful earthquake hits southern Japan – NBC4 Washington", "date": "2024-08-08 11:45", "url": "https://www.nbcwashington.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3688606/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe agency said tsunami waves of up to 50 centimeters (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nTwo of them fell down when the quake struck and another was hit by a falling object.\nHe urged residents of the affected region to stay away from the coastline.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9839115854657486, "event_breakdown": "Japan Earthquake, Tsunami Advisory Issued\nA powerful earthquake struck off the coasts of Japan's southern island of Kyushu on Thursday morning, triggering a tsunami advisory. Two residents were injured in Kumamoto Prefecture, but no major damage was reported. (Kyodo)"}, {"id": "ee6d0f61-4bb9-4048-ad49-f657b1359c71", "title": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves through", "date": "2024-08-08 07:00", "url": "https://www.wwaytv3.com/clarkton-residents-worry-about-canal-flooding-as-tropical-storm-debby-moves-through/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Clarkton residents worry about canal flooding as Tropical Storm Debby moves throughCLARKTON, NC (WWAY) — In Bladen County, there are growing concerns about inland flooding from Tropical Storm Debby.\nIn the town of Clarkton, some residents are worried the canals won’t be able to move all the rainwater away from their homes.\nSome areas of Clarkton flooded earlier this week after a storm, which caused a tree to fall into one of the canals.\nClarkton resident Rhonda Caballero said she feels the town didn’t do enough after Hurricane Florence to prevent flooding of the canals again.\nPrior to Debby, I was at a meeting at a church in town and I could not get back to my home.", "location": "CLARKTON", "classification": "natural-disasters", "score": 0.9538705562089685, "event_breakdown": "Target event:\nClarkton, North Carolina, residents are concerned because Tropical Storm Debby is moving through the area and flooding could occur due to overflowing canals."}, {"id": "a2d973ad-e7de-428a-9478-463d54524cd6", "title": "Powerful earthquake hits southern Japan – NBC 7 San Diego", "date": "2024-08-08 12:45", "url": "https://www.nbcsandiego.com/news/national-international/tsunami-advisory-issued-after-powerful-earthquake-hits-southern-japan/3591683/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe agency said tsunami waves of up to 50 centimeters (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nTwo of them fell down when the quake struck and another was hit by a falling object.\nHe urged residents of the affected region to stay away from the coastline.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9839115854657486, "event_breakdown": "Earthquake hits off coast of Japan, residents warned to avoid coastline\n\nA strong earthquake in March 2011 triggered a devastating tsunami off the coast of Japan."}, {"id": "ed3f10d6-40ed-4a6d-98d5-fba5908924d5", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:15", "url": "https://www.ky3.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "ky3.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.9895575659072293, "event_breakdown": "This sample text finds a relevant event and returns a short report about the Japan earthquake on March 16th, 2022.\nA powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory. Residents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage."}, {"id": "cfb00017-e58b-42dc-8726-f4330bb5024a", "title": "Hardest Debby Impacts Into Friday", "date": "2024-08-08 12:45", "url": "https://www.whsv.com/2024/08/08/hardest-debby-impacts-into-friday/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is impacting the region on Thursday, but Thursday night into Friday is expected to be the worst of the storm.\nHeavy rain will wrap up mid to late morning Friday, with lingering showers into early afternoon.\nTORNADO POTENTIALOne final threat for the region with Debby is the isolated tornado potential Thursday night into Friday.\nHeavier, more widespread rainfall, is expected by mid to late evening through the overnight hours into Friday morning.\nCoverage and Impacts (Maxuser | WHSV)Partial clearing is likely by late afternoon through the evening as the region dries out and Debby pulls away to the northeast.", "location": ")\nThe Gulf of Mexico is the location where the main impact of Tropical Storm Debby takes place.", "classification": "natural-disasters", "score": 0.5021729864270622, "event_breakdown": "1. Tropical Storm Debby is currently impacting the region.2. Heavy rain will wrap up mid to late morning Friday with lingering showers into early afternoon.3. A final threat for the region with Debby is isolated tornado potential Thursday night into Friday.4. Heavier, more widespread rainfall, is expected by mid to late evening through the overnight hours into Friday morning.5. Coverage of these events is expected over the region by Thursday night into the early morning of Friday."}, {"id": "02231475-306a-44db-8e4a-4108fc969973", "title": "Heavy rain expected up the East Coast from Tropical Storm Debby", "date": "2024-08-08 13:30", "url": "https://www.boston.com/news/weather/2024/08/08/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east-coast/", "domain": "boston.com", "domain_classification": "Unknown", "message": "Weather Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast Residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nCollins reported from Columbia, South Carolina.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.986465266802398, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is a tropical storm with maximum sustained winds at 50 mph (80 kph).\nResidents as far north as Vermont could get several inches of rain from the really heavy rain through Sunday, the weather service said."}, {"id": "814081f1-9924-411a-b8a0-6f45615d4e44", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:30", "url": "https://www.wsmv.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "Japan", "classification": "natural-disasters", "score": 0.9895575659072293, "event_breakdown": "Japan Earthquake (magnitude 7.3) strikes off the Fukushima Prefecture on Honshu Island. The USGS issued a Tsunami Warning for the Miyagi and Fukushima Prefectures. The Japan Meteorological Agency had already issued a low-level tsunami warning for the entire Pacific coast. Public broadcaster NHK TV says the earthquake was felt in Tokyo. Prime Minister Fumio Kishida said the government is assessing the extent of the damage, but the Defense Ministry has set up a special liaison unit at the crisis management center. (January 14)"}, {"id": "4f174638-7531-4012-84ff-b376d7ae12ea", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 14:30", "url": "https://abc13.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, South Carolina -- Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nA state of emergency was in effect for both North Carolina and Virginia.", "location": "HUGER, South Carolina", "classification": "natural-disasters", "score": 0.9825685510594974, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast."}, {"id": "070d5e8a-5ac6-4e17-854f-0b66de1d3f52", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 14:15", "url": "https://abc7ny.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, South Carolina -- Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nA state of emergency was in effect for both North Carolina and Virginia.", "location": "BULLS BAY", "classification": "natural-disasters", "score": 0.9825685510594974, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast\nHUGER, South Carolina -- Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.\nA state of emergency was in effect for both North Carolina and Virginia."}, {"id": "e2f0ed37-3b09-45e3-9c01-d55fcc7310ba", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 12:45", "url": "https://www.dailyherald.com/20240808/nation-and-world/tropical-storm-debby-makes-2nd-landfall-in-south-carolina-heavy-rain-expected-up-the-east-coast/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "Keon Johnson and his wife, Zyla Johnson, left, talk about how to get to work since his house on Tappan Zee Drive was flooded on Monday from Tropical Storm Debby in Pooler, Georgia.\nAPHUGER, S.C. — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt is now a tropical storm with maximum sustained winds at 50 mph (80 kph).\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.", "location": "BULLS BAY", "classification": "natural-disasters", "score": 0.9664935178646092, "event_breakdown": "Tropical Storm Debby makes a second landfall in South Carolina and is heading up the East Coast, bringing heavy rain to residents as far north as Vermont."}, {"id": "a499a4a6-f8e7-46dc-bbbc-ca9beae28eb3", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 13:30", "url": "https://wset.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wset.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": "TOKYO.", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "Japan Earthquake \nMagnitude: 7.1 struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline."}, {"id": "b89c1d99-f70f-44df-bdae-46a5af361a33", "title": "Powerful 7 . 1 magnitude earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 12:45", "url": "https://www.yahoo.com/news/powerful-7-1-magnitude-earthquake-104609954.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nPolice stand outside a damaged building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.", "location": "Japan", "classification": "natural-disasters", "score": 0.8969765439939902, "event_breakdown": "The following natural-disaster events have been reported in text that can be placed on a map:\n'Earthquake in Southern Japan' on August 8, 2024; 'Hurricane Dorian' between August 28 and September 9, 2024; and 'Plume collapse at chemical plant' on December 11, 2024."}, {"id": "ed7557f1-5530-4e75-9225-2a30222c8704", "title": "Debby returns to SC and the slow - moving tropical storm continues to drench the Midlands", "date": "2024-08-08 13:15", "url": "https://www.yahoo.com/news/debby-returns-sc-slow-moving-122943836.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debby returns to SC and the slow-moving tropical storm continues to drench the MidlandsAfter a lull where Debby was over the Atlantic Ocean, the tropical storm returned to South Carolina on Thursday, and is continuing to soak the Columbia area as it slowly moves through the Palmetto State.\nThe forecast for Tropical Storm Debby tracks through South Carolina.\nLocalized amounts in other parts of the area could be higher, the National Weather Service said.\nThe forecast for Tropical Storm Debby tracks through South Carolina.\nThe forecast for Tropical Storm Debby tracks through South Carolina.", "location": "COLUMBIA", "classification": "natural-disasters", "score": 0.7887080947971302, "event_breakdown": "Debby continues to drench the Midlands as it moves slowly through SC"}, {"id": "63145e6a-f0f9-4881-93da-9f506d49da6d", "title": "2024 Atlantic Hurricane Season : CSU updates forecast , still calls for  active season  ", "date": "2024-08-08 10:00", "url": "https://www.yahoo.com/news/2024-atlantic-hurricane-season-csu-091557328.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Colorado State University (CSU) just updated their prediction for the 2024 hurricane season.\nThe revised forecast, released on Tuesday, Aug. 6, still calls for an extremely active Atlantic hurricane season, which lasts from June 1 to November 30..\nWhy are they predicting an active hurricane season in 2024?\nWhy did CSU change their Atlantic Hurricane Season forecast?\nThis article originally appeared on The Patriot Ledger: 2024 Hurricane Season: CSU updates forecast.", "location": "Fort Pierce, Florida", "classification": "natural-disasters", "score": 0.7028474410023846, "event_breakdown": "2024 Hurricane Season: CSU updates forecast Colorado State University (CSU) just updated their prediction for the 2024 hurricane season. The revised forecast, released on Tuesday, Aug. 6, still calls for an extremely active Atlantic hurricane season, which lasts from June 1 to November 30."}, {"id": "f3fc744d-56de-41f4-89c0-d19ffb76bf1a", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 13:15", "url": "https://www.fox19.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "fox19.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9895575659072293, "event_breakdown": "Japan: A powerful earthquake with magnitude of 7.1 has hit off Japan's southern coast, triggering a tsunami advisory. Residents have been urged to stay away from the coastline but there are no immediate reports of injuries or serious damage. The tremor was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles). The Japan Meteorological Agency said tsunami waves of up to 50 centimeters (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck."}, {"id": "287d713e-1783-44dc-b91c-0e8fefa7ebb1", "title": "Strong quake , small tsunamis hit southern Japan", "date": "2024-08-08 11:45", "url": "https://www.manilatimes.net/2024/08/08/world/strong-quake-small-tsunamis-hit-southern-japan/1962726", "domain": "manilatimes.net", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency (JMA) also said there was one quake with a magnitude of 7.1.\nAdvertisementThe Pacific Tsunami Warning Center issued a warning that said hazardous tsunami waves were possible within 300 kilometers (185 miles) of the epicenter.\nVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nKYODO NEWS VIA AP Visitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki, western Japan, Thursday, Aug. 8, 2024.\nAdvertisementIn March 2022, a 7.4-magnitude quake off the coast of Fukushima shook large areas of eastern Japan, killing three people.", "location": "Japan", "classification": "natural-disasters", "score": 0.8915698078706107, "event_breakdown": "Pacific Tsunami Warning Center issued a warning that said hazardous tsunami waves were possible within 300 kilometers (185 miles) of the epicenter."}, {"id": "ab04f32e-2b1b-4052-8085-0d35aeea319b", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina ; heavy rain expected up the East Coast", "date": "2024-08-08 12:45", "url": "https://www.weau.com/2024/08/08/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-up-east-coast/", "domain": "weau.com", "domain_classification": "Unknown", "message": "The National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph (80 kph).\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nLocated roughly 30 miles (50 kilometers) inland from the Atlantic Ocean, with no creeks or rivers nearby, the neighborhood doesn’t seem like a high-risk location for tropical flooding.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.", "location": "Based on the information provided, it is not possible to determine a single location where the main event takes place.", "classification": "natural-disasters", "score": 0.9609774617666408, "event_breakdown": "Debby, 2022"}, {"id": "e99d5f91-66eb-4dad-a40c-46efcf27dff8", "title": "Debby Path Tracker : What to expect in New Hampshire as storm moves west", "date": "2024-08-08 16:45", "url": "https://news.yahoo.com/news/debby-path-tracker-expect-hampshire-135724971.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "A graphic illustrating the predicted impacts of Hurricane Debby in the northeast for this weekend.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThe hurricane center uses only the top four or five highest-performing models to help make its forecasts.\nThis article originally appeared on wickedlocal.com: Debby Path: Tropical Storm Debby moves west.", "location": "Based on the provided text, I was unable to identify a specific location for the event described.", "classification": "natural-disasters", "score": 0.8902434622502359, "event_breakdown": "Tropical Storm Debby is currently moving west in the Gulf of Mexico, and is expected to make landfall on the east coast of the United States this weekend. The storm could bring heavy rainfall and strong winds to the region."}, {"id": "00ba2646-016f-43e2-8a0f-5ed693ead24c", "title": "Debby Path Tracker : Tropical Storms moves west changing RI forecast . What to expect", "date": "2024-08-08 14:45", "url": "https://news.yahoo.com/news/debby-path-tracker-tropical-storms-132547909.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "With Tropical Storm Debby veering to the west, the weekend forecast in Rhode Island is looking much better than it previously did.\nThe latest rainfall predictions maps from the National Hurricane Center show Rhode Island getting less than an inch.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on wickedlocal.com: Tropical Storm Debby Update: RI weather forecast changes.", "location": "Rhode Island", "classification": "natural-disasters", "score": 0.9013263491538746, "event_breakdown": "Tropical Storm Debby is currently located over the Gulf of Mexico, and is expected to make landfall in Florida as a Category 1 hurricane on Tuesday. The storm will bring heavy rains and strong winds to parts of the state, as well as the potential for storm surge and flooding along the coast. Residents in affected areas are advised to take precautions and stay informed of the latest forecasts."}, {"id": "e89011c4-0177-4d1b-87d7-e3534e66ac4e", "title": "Gov . Kemp extends state of emergency through next week for all of Georgia", "date": "2024-08-08 19:45", "url": "https://www.yahoo.com/news/gov-kemp-extends-state-emergency-182516756.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kemp extends state of emergency through next week for all of GeorgiaGov.\nBrian Kemp has extended the State of Emergency for all 159 counties in Georgia until August 15.\nThe decision follows the impact of Tropical Storm Debby, which has caused significant rainfall and flooding across multiple states.\nAccording to Severe Weather Team 2, the storm dumped nearly a foot of rain on Monday and Tuesday in Southeast Georgia.\nThe extended State of Emergency allows state agencies to respond swiftly to citizens’ needs, reassign personnel, and deploy vehicles and equipment to address the situation.", "location": "Georgia", "classification": "natural-disasters", "score": 0.8095491294267897, "event_breakdown": "Tropical Storm Debby\nTropical Storm Barry dumped nearly a foot of rain on Monday and Tuesday in Southeast Georgia."}, {"id": "a18d20a1-d3a8-4a95-bcd1-c45c29a6890e", "title": "Tsunami warning in Japan after 7 . 1 magnitude earthquake", "date": "2024-08-08 16:30", "url": "https://inews.co.uk/inews-lifestyle/travel/japan-tsunami-warning-earthquake-3216381", "domain": "inews.co.uk", "domain_classification": "Unknown", "message": "Tsunami warnings are in place for Japan following a 7.1 magnitude earthquake that hit the country on Thursday.\nThe UK Foreign Office (FCDO) has updated its advice for travel after the earthquake affected south-western Japan, in and around the Miyazaki prefecture.\nThe epicentre of the 7.1 magnitude earthquake (Photo: Mehmet Yaren Bozgun/Anadolu via Getty Images)“The Japanese meteorological agency has issued a megaquake advisory after Thursday’s quake.\nIn March 2011, the “Great East Japan Earthquake”, with a magnitude of 9.1, killed nearly 20,000 people and a further 2,500 are missing to this day.\nOn 1 January this year, a magnitude 7.6 earthquake struck the north-central region of Noto, killing at least 241 people.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.8627358464034033, "event_breakdown": "Japan: A 7.3 magnitude earthquake hit Japan near the southern coast of Kyushu on Thursday, April 14. According to the United States Geological Survey, the earthquake struck at 23:25:36 UTC (14:25:36 PM JST) with a depth of 56 km, and 583 km north of Miyazaki. There were no immediate reports of damages or injuries in area."}, {"id": "b11eb4ff-f04e-4b90-844d-79e7b2188d63", "title": "🌧️ Share your Tropical Storm Debby pictures with us here", "date": "2024-08-08 17:45", "url": "https://www.wbtv.com/2024/08/08/share-your-tropical-storm-debby-pictures-with-us/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Tropical Storm Debby was expected to make a second landfall in South Carolina late Wednesday or early Thursday.\nBoth North and South Carolina, but especially South Carolina, were forecast to receive potentially historic amounts of rain on Thursday, Aug. 8 through Friday, Aug. 9.\nTropical Storm Debby made a second landfall early Thursday morning in the Carolinas after churning over the Atlantic Ocean on Wednesday.\nFlood warnings active for some countiesFlood warnings have been issued for two Charlotte-area counties in North Carolina and two in South Carolina as Tropical Storm Debby moves through the region Thursday.\nAccording to Kim Stenson, director of the South Carolina Emergency Management Division, the anticipated rainfall could set new records for the state.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.6668880419627432, "event_breakdown": "Natural Disaster Reports of South Carolina\n- a record breaking amount of rain pour down\n- Tropical Storm Debby moves over the Atlantic Ocean - makes a second landfall in the Carolinas\nNatural Disaster Reports of North Carolina\n- 'potentially historic amounts of rain'\n- Flood warnings active in Catawba and Gaston counties\nNatural Disaster Reports\n- Flood warnings active in South Carolina as well\n- Flood warnings active in Wilmington\nThese are the recent reports of natural disasters that met our criteria."}, {"id": "748ed942-3c29-4bab-bfab-b7bcf5500d10", "title": "USDA Meteorologist , Brad Rippey : Debby took the best ag route possible through the southeast", "date": "2024-08-08 20:00", "url": "https://www.rfdtv.com/usda-meteorologist-brad-rippey-debby-took-the-best-ag-route-possible-through-the-southeast", "domain": "rfdtv.com", "domain_classification": "Unknown", "message": "What is left of Hurricane Debby is bringing a lot of rain to the south and east coast.\nSoutheast Georgia and coastal Carolina saw rain totals of anywhere from 10-20 inches, leading to historic flooding and a devastating end to the growing season for some farmers.\nWhile the rain has caused concern, some say the moisture was needed because the summer heat caused crop conditions to decline drastically.\nUSDA Meteorologist Brad Rippey says that Debby took what could be considered the best ag route possible so far this week.\n“Initially from an agricultural standpoint, Debby moved through about the best possible area you could take a hurricane through the southeastern United States.", "location": "Georgia and coastal Carolina saw rain totals of anywhere from 10-20 inches,", "classification": "natural-disasters", "score": 0.9273376255673155, "event_breakdown": "South-eastern US: Hurricane Debby moves along the coast, causing heavy rain and flooding."}, {"id": "c094e447-0102-4ff2-a040-a12abeaa618c", "title": "Tropical Storm Debby Heads for Tri - State Area , Risk of Flash Flooding", "date": "2024-08-08 19:15", "url": "https://wsus1023.iheart.com/content/2024-08-08-tropical-storm-debby-heads-for-tri-state-area-risk-of-flash-flooding/", "domain": "wsus1023.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already made landfall twice in South Carolina, is expected to hit the tri-state area by Friday.\nThe storm is predicted to bring heavy rain and potential flooding to New Jersey, New York, and Pennsylvania.\nThe ground is already saturated from rains earlier this week, increasing the risk of flash flooding.\nIt is now a tropical storm with maximum sustained winds at 50 mph.\nA major part of the region is under a medium risk for flash flooding Friday afternoon into the overnight hours.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9618701422179758, "event_breakdown": "1. Tropical Storm Debby is currently headed towards the tri-state area and is expected to cause heavy rain and flooding in New Jersey, New York, and Pennsylvania.\n2. The ground is already saturated from recent rains, increasing the risk of flash flooding.\n3. Tropical storm Debby is expected to hit the region by Friday."}, {"id": "a38b388d-6278-43a0-8bba-1b6401ccc0cb", "title": "Tropical Storm Debby Heads for Tri - State Area , Risk of Flash Flooding", "date": "2024-08-08 18:15", "url": "https://wnnj.iheart.com/content/2024-08-08-tropical-storm-debby-heads-for-tri-state-area-risk-of-flash-flooding/", "domain": "wnnj.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, which has already made landfall twice in South Carolina, is expected to hit the tri-state area by Friday.\nThe storm is predicted to bring heavy rain and potential flooding to New Jersey, New York, and Pennsylvania.\nThe ground is already saturated from rains earlier this week, increasing the risk of flash flooding.\nIt is now a tropical storm with maximum sustained winds at 50 mph.\nA major part of the region is under a medium risk for flash flooding Friday afternoon into the overnight hours.", "location": "PRINCETON, NEW JERSEY", "classification": "natural-disasters", "score": 0.9618701422179758, "event_breakdown": "1. Tropical Storm Debby is expected to hit the tri-state area by Friday.\n2. Southern and eastern Africa may experience drought by the end of 2022."}, {"id": "dfc5eef9-b5ae-48f9-bc43-e0f3940441e5", "title": "Debby Tracker : DC forecast cone map , path , live radar , rainfall totals", "date": "2024-08-08 22:15", "url": "https://www.fox5dc.com/news/debby-tracker-dc-forecast-cone-map-path-radar-rainfall-totals", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "The remnants of Tropical Storm Debby are expected to bring heavy downpours, flooding conditions, and possibly isolated tornadoes to the Washington, D.C. region.\nWhere is Tropical Storm Debby?\nTracking Tropical Storm Debby (FOX Weather)Tracking Tropical Storm Debby (FOX Weather)Where is Debby headed?\nImage 1 of 3 ▼ Tropical Storm Debby: DC region braces for intense rain, flooding, tornado threatsHow much rain will fall?\nTropical Storm Debby Future Rainfall MapMORE ONLINE: Tracking Tropical Storm Debby (FOX Weather)", "location": "Washington, D.C.", "classification": "natural-disasters", "score": 0.9353485503685152, "event_breakdown": "Tropical Storm Debby: Expect heavy downpours, flooding in D.C. region"}, {"id": "df8402c4-753b-4801-b90c-36b19b044909", "title": "Tropical Storm Debby updates from the National Hurricane Center for Thursday , Aug 08", "date": "2024-08-08 16:30", "url": "https://www.yahoo.com/news/tropical-storm-debby-updates-national-145704858.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debby no longer forecast to be a tropical storm.\nWith sustained winds of 35 miles per hour, Debby has downgraded from a tropical storm to a tropical depression.\nTropical Depression Debby is 45 miles east of Charlotte North Carolina and 95 miles west-southwest of Raleigh North Carolina, with maximum sustained wind of 35 mph.\nYESTERDAY (Wednesday):Yesterday, South Carolina's coastline was expected to encounter Debby, coming from the Atlantic OceanCHANGES WITH THIS ADVISORY:All Tropical Storm Warnings have been discontinued.\nTORNADOES: A few tornadoes may occur through tonight from central and eastern North Carolina into central and southeast Virginia.", "location": "Based on the information provided, the main location where the main event takes place is 'North Carolina'.", "classification": "natural-disasters", "score": 0.914136292246752, "event_breakdown": "Tropical Depression Debby downgraded and is heading towards the North Carolina coastline, causing tornadoes in the area."}, {"id": "733a94ef-ac35-434f-9703-1fe5213104c1", "title": "No tsunami threat in B . C . after powerful Japan earthquake", "date": "2024-08-08 20:00", "url": "https://www.timescolonist.com/local-news/no-tsunami-threat-in-bc-after-powerful-japan-earthquake-9326785", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Thursday’s quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometresThere are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday’s quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometres.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island, triggering a local tsunami advisory that urged residents to stay away from the coastline, but there were no reports of serious damage.\nThe British Columbia government protocols require Emergency Information B.C.\nto initiate its enhanced notification process immediately if the National Tsunami Warning Centre in the United States issues a tsunami watch, advisory or warning.", "location": "Japan", "classification": "natural-disasters", "score": 0.9852123641448813, "event_breakdown": "Typhoon in the Philippines\nA powerful typhoon slammed into the eastern Philippines on Wednesday, killing at least one person and disrupting air travel after authorities forced thousands of villagers to leave high-risk coastal communities to avoid a battering by ferocious winds and flooding. More than 120,000 people were riding out Typhoon Chanthu in several provinces, mostly in central and northern Luzon, where raging floods swamped houses, trapped livestock and collapsed a COVID-19 isolation facility. Collapsed walls inflicted minor injures in one town, officials said."}, {"id": "ce8b42af-6fff-4b5a-b7c3-8b88eda4bf6c", "title": "No Tsunami threat in B . C . after powerful Japan earthquake", "date": "2024-08-08 15:30", "url": "https://www.timescolonist.com/bc-news/no-tsunami-threat-in-bc-after-powerful-japan-earthquake-9325199", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "There are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday's quake registered magnitude 7.\nThere are no tsunami threats in British Columbia after a powerful earthquake struck off Japan’s southern coast, according to the U.S. based National Tsunami Warning Center.\nThe Japan Meteorological Agency says Thursday's quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometres.\nto initiate its enhanced notification process immediately if the National Tsunami Warning Centre in the United States issues a tsunami watch, advisory or warning.", "location": ")\nJapan", "classification": "natural-disasters", "score": 0.9802713197981495, "event_breakdown": "Japan quake triggers no tsunami threat in British Columbia"}, {"id": "491bf71f-11f4-490c-a2d3-c01ae10ffd73", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-08 19:15", "url": "https://www.tvguide.co.uk/schedule/368f303c-966f-5d53-afcc-90ca6cfc7dd8/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 1:00 AM to 2:00 AM Friday 9 August Share Add toCalendar +Half-Country Hurricane Season 1 Episode 3 S SubtitlesHurricane Ida slammed the Louisiana coast in 2021.\nShocked eyewitnesses filmed encounters with tornadoes and flooding all the way to New York CityIn the Eye of the Storm airs on Discovery Channel HD at 1:00 AM, Friday 9 August .\n(Subtitles.)", "location": "Louisiana", "classification": "natural-disasters", "score": 0.7430669846340244, "event_breakdown": "1. Hurricane Ida - 2021, Louisiana, United States"}, {"id": "6265afdd-d810-425d-ad81-c966222fcebf", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-08 15:30", "url": "https://www.tvguide.co.uk/schedule/ca60ac75-3d62-5e5c-9e28-0c30d7aefb9b/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 9:00 PM to 10:00 PM Thursday 8 August Share Add toCalendar +Half-Country Hurricane Season 1 Episode 3 New S SubtitlesHurricane Ida slammed the Louisiana coast in 2021.\nShocked eyewitnesses filmed encounters with tornadoes and flooding all the way to New York CityIn the Eye of the Storm airs on Discovery Channel HD at 9:00 PM, Thursday 8 August .\n(Subtitles, new.)", "location": "NEW ORLEANS", "classification": "natural-disasters", "score": 0.4995076101875467, "event_breakdown": "Hurricane Ida"}, {"id": "c5c49a12-f65e-4273-baf0-1b488e60098c", "title": "Hurricane Debby drenches the southeast . Is this much rain normal ? ", "date": "2024-08-08 22:45", "url": "https://www.vox.com/climate/366041/climate-hurricane-debby-drenches-the-southeast", "domain": "vox.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby, a plodding, waterlogged system that has already saturated four southeastern states, bears many characteristics of a warming planet, climate scientists say.\nNorth Carolina Gov.\nAs recently as late June, 99 of the state’s 100 counties were experiencing drought conditions ranging from abnormally dry to severe, according to the State Climate Office.\n“The extremes become more extreme.”Tropical Storm Debby is reminiscent of two historic hurricanes that hit North Carolina — Matthew in 2016 and Florence in 2018.\nA person walks through a flooded street caused by the rain and storm surge from Tropical Storm Debby on August 5, 2024, in Cedar Key, Florida.", "location": "CEDAR KEY", "classification": "natural-disasters", "score": 0.9408162627163851, "event_breakdown": "Tropical Storm Debby: Tropical Storm Debby, a plodding, waterlogged system that has already saturated four southeastern states, bears many characteristics of a warming planet, climate scientists say.\nFlorida floods: A person walks through a flooded street caused by the rain and storm surge from Tropical Storm Debby on August 5, 2024, in Cedar Key, Florida.\nNorth Carolina floods: North Carolina is cleaning up after Tropical Depression Bertha dumped heavy rain over the state and drenching Tropical Storm Colin moved across North Carolina on Friday."}, {"id": "d156b485-503e-4647-bc1b-b9726b533bf0", "title": "Storm Debby expected to have caused produce losses in Florida and South Carolina", "date": "2024-08-08 14:45", "url": "https://www.freshplaza.com/north-america/article/9648102/storm-debby-expected-to-have-caused-produce-losses-in-florida-and-south-carolina/", "domain": "freshplaza.com", "domain_classification": "Unknown", "message": "This past Monday, Hurricane Debby made landfall in Florida as a category 1 hurricane before weakening to a tropical storm.\nFrom Florida, the storm slowly moved up the East Coast and hit Georgia and South Carolina.\nIn South Carolina, the state's key vegetable growing region is in the far south where some of the greatest rainfall occurred.\nOver in South Carolina, heavy rain is still falling, and damage assessments won't begin until Friday.\nFlorida and parts of South Carolina are likely dealing with drowning crops, causing complete losses of production.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9542098627439183, "event_breakdown": "Florida, Georgia, and South Carolina are currently dealing with crop loss due to Hurricane Debby."}, {"id": "06d216a2-7dd5-4b83-a8cc-974b23812e75", "title": "Flood damage outpaces some repairs in hard - hit Vermont town", "date": "2024-08-08 17:30", "url": "https://www.yahoo.com/news/flood-damage-outpaces-repairs-hard-170200328.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A washed out road and bridge in Lyndon, Vt. is shown Wednesday, Aug. 7, 2024, more than a week after storms caused flooding.\n(AP Photo/ Lisa Rathke)LYNDON, Vt. (AP) — The Vermont town of Lyndon was hit by severe flash floods twice last month.\nIt came three weeks after after flooding in the north and center of the state from the remnants of Hurricane Beryl.\nThat storm killed two people, including a driver in the village who was swept away by floodwaters.\nThe reaction is more significant considering the state the town is in, he said.", "location": "LYNDON", "classification": "natural-disasters", "score": 0.9467848003047482, "event_breakdown": "1. A washed out road and bridge in Lyndon, Vt. is shown Wednesday, Aug. 7, 2024, more than a week after storms caused flooding.\n1. The town of Lyndon, Vt. was hit by severe flash floods twice last month"}, {"id": "baf0b380-ae22-45f7-b75a-7592150623c5", "title": "Flood damage outpaces some repairs in hard - hit Vermont town", "date": "2024-08-08 18:30", "url": "https://www.kob.com/news/us-and-world-news/flood-damage-outpaces-some-repairs-in-hard-hit-vermont-town/", "domain": "kob.com", "domain_classification": "Unknown", "message": "LYNDON, Vt. (AP) — The Vermont town of Lyndon was hit by severe flash floods twice last month.\nIt came three weeks after after flooding in the north and center of the state from the remnants of Hurricane Beryl.\nThat storm killed two people, including a driver in the village who was swept away by floodwaters.\n“Our fear is if Debby comes through with all that rain we’re going to lose the house, too,” she said.\nThe reaction is more significant considering the state the town is in, he said.", "location": "Lyndon, Vermont", "classification": "natural-disasters", "score": 0.8711893373450739, "event_breakdown": "Lyndon, Vermont was hit by severe flash floods twice last month. \n\nIt came three weeks after after flooding in the north and center of the state from the remnants of Hurricane Beryl, in the same state. \n\nThat storm killed two people, including a town driver who was swept away by floodwaters. \n\nThe source text does not mention Debby."}, {"id": "3eb75bae-d46c-43ab-952d-8baba98d173d", "title": "Debby drenched the southeast : Climate change is making storms like this even wetter", "date": "2024-08-08 16:45", "url": "https://www.yahoo.com/news/debby-drenched-southeast-climate-change-155553864.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "North Carolina Gov.\n“There’s a lot of water in this system that’s just ready to come out,” North Carolina’s state climatologist, Kathie Dello, said.\nAs recently as late June, 99 of the state’s 100 counties were experiencing drought conditions ranging from abnormally dry to severe, according to the State Climate Office.\nAlthough both were Category 1 storms, they caused disproportionate damage because they stalled over land and dumped historic amounts of rain—as much as 3 feet—in eastern North Carolina.\nJohn Uehling co-authored the paper with Carl Schreck III, both of whom are scientists at the North Carolina Institute for Climate Studies.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.7939976971229372, "event_breakdown": "1. North Carolina is experiencing a drought, with 99 of the state's 100 counties facing abnormally dry to severe drought conditions.\n2. North Carolina has recently been hit by two hurricanes - Arthur and Bertha. Although both were Category 1 storms, they caused disproportionate damage as they stalled over land and dumped historic amounts of rain in eastern North Carolina."}, {"id": "1c274f84-45b5-49ed-a1b8-c236aded35f2", "title": "China self - developed intelligent platforms enhance marine early warning , forecasting capabilities", "date": "2024-08-08 15:45", "url": "https://www.globaltimes.cn/page/202408/1317672.shtml", "domain": "globaltimes.cn", "domain_classification": "Unknown", "message": "As Typhoon Gaemi approaches, huge waves pound the shore in Yilan, China's Taiwan island, on July 24, 2024.\nPhoto: VCGChina has made significant progress in developing advanced intelligent tsunami monitoring and early warning platforms in recent years.\nIt has the ability to quickly determine preliminary earthquake parameters within three to five minutes, and then transmit these parameters in real time to the tsunami warning system, triggering the corresponding warnings.Compared to early systems that could only make forecasts based on human experience, current systems can provide quantitative forecasts of tsunami arrival time, wave height, and warning levels for different coastal locations, as well as corresponding response measures.According to Wang, the system integrates real-time ocean data from over 600 stations worldwide, including along the coast of China.\nIt can complete parameter calculations for these regions in about three minutes, shortening warning times.In addition, the system, with the help of a global observation network, has specially configured buoys for tsunami monitoring.\nRelevant departments in the field of natural resources will continue to deepen the strengthening of the marine warning and forecasting system, actively promoting the steady improvement of its forecasting capabilities.Global Times", "location": "TAIPEI, TAIWAN", "classification": "natural-disasters", "score": 0.8395965773618562, "event_breakdown": "As Typhoon Gaemi approaches, huge waves pound the shore in Yilan, China's Taiwan island, on July 24, 2024."}, {"id": "72442983-f1e2-494d-94a1-1a1687fcbbab", "title": "The Latest : Debby moves inland as the tropical depression soaks the Carolinas", "date": "2024-08-08 22:45", "url": "https://wacotrib.com/ap/national/the-latest-debby-moves-inland-as-the-tropical-depression-soaks-the-carolinas/article_c2ba2c08-5f05-58d3-ac1d-6725210143ad.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "As Tropical Depression Debby drenches the Carolinas, heavy rainfall from the tropical storm is also expected to cause flooding across portions of the mid-Atlantic states and Northeast through Saturday morning.\nDebby downgraded to tropical depressionThe National Hurricane Center has downgraded Debby to a tropical depression.\nHenry McMaster said one prayer has been answered in his state with no deaths or major damage from Tropical Storm Debby.\nTropical Storm Debby claims 7th victimAuthorities say a tornado death in North Carolina has raised Tropical Storm Debby’s death toll to seven.\nIt’s part of living on the creek.”Water levels are rising as Tropical Storm Debby's rainfall drains out to sea.", "location": "Carolinas", "classification": "natural-disasters", "score": 0.9005589317387886, "event_breakdown": "Tropical Depression Debby drenching the Carolinas and causing flooding across portions of the mid-Atlantic states and Northeast."}, {"id": "78d6c92f-e12c-4989-9357-b94dfb074c6d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://newstalk1130.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newstalk1130.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "1. Tropical Storm Debby made its second U.S. landfall in South Carolina on August 8, bringing with it life-threatening floods and a deadly tornado in North Carolina.\n2. In North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n3. Tropical Storm Debby is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "58c99e68-a1f2-4e6f-b9ea-457c7678069f", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://wlac.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wlac.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina."}, {"id": "926edd78-1bb7-43bf-a331-64c3757563ca", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://newsradio710.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio710.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\n\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n\nThe deadly tornado hit Northampton County around 8 p.m. Thursday, killing three people and injuring 10 others. This is a breaking news story, more updates to come.\n\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday. It is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "c4059358-6658-4f78-b470-4d7e180b5fe9", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://970kfbx.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nIn Upstate New York a Major Storm hits the town, felling tree and power outagage and destroying several houses."}, {"id": "d00b3f75-3608-4b73-b309-367775e0a59a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | NewsRadio WKCY", "date": "2024-08-08 17:45", "url": "https://newsradiowkcy.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "1. Tropical Storm Debby made its second U.S. landfall in South Carolina on Thursday, August 8, bringing with it life-threatening floods and a deadly tornado in North Carolina.\n2. Mexico is currently experiencing a very large earthquake. It has caused several buildings to collapse in the downtown area. A tsunami alert was also issued.\n3. A large fire is currently burning south of Reykjavik, Iceland. It has already burned hundreds of acres of land and forced the evacuation of several homes."}, {"id": "dff9ec11-f059-435d-8f2c-680fdbcb7a5c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:45", "url": "https://veropatriot.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing life-threatening floods and a deadly tornado in North Carolina."}, {"id": "13715d64-8931-473c-addd-9ff705c1b212", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:15", "url": "https://woc1420.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes its second U.S. landfall in South Carolina, bringing with it life-threatening floods and a deadly tornado in North Carolina."}, {"id": "d6f07326-d281-434d-a3f5-b5dd9ef2530a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-08-08 19:15", "url": "https://powertalk1460.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "powertalk1460.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "Greenville, South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing life-threatening floods and a deadly tornado in North Carolina."}, {"id": "39405ed4-5de8-407f-88f9-0f61dbb2ea76", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:15", "url": "https://whp580.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whp580.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida's Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nDebby is moving slowly northward over eastern South Carolina. The center of the storm is 45 miles north of Charleston and 50 miles south of Myrtle Beach.\nSome areas in Florida's Big Bend region have reported between 14 and 18 inches of rain since Sunday.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "244a27d6-634d-4e54-9437-7c6ed001c376", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:15", "url": "https://790waeb.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "790waeb.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second US landfall in South Carolina, causes flooding and destroys homes."}, {"id": "efa8d807-1233-428f-86a6-1435c248a059", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:15", "url": "https://1061fmtalk.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nNo other relevant events are found."}, {"id": "2eef5d73-bb10-4de9-9a75-3a24bed254db", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://kfyr.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfyr.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": ".\nNorth Carolina.", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing life-threatening floods and a deadly tornado in North Carolina."}, {"id": "98bf1207-f3b4-4423-b2be-f3e728be1ceb", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://wflanews.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing life-threatening floods and a deadly tornado in North Carolina. In North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church."}, {"id": "d091bf31-d249-4a75-826f-9883379fa19c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://1150wima.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "1150wima.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": ")\nNorth Carolina.", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Chris forms in the Atlantic, likely to become hurricane\nTropical Storm Chris formed off the coast of the Carolinas on Monday evening, churning northward on a path that could take it east of Bermuda by the end of the week.\n\nChris is the 2nd named storm of the 2018 Atlantic hurricane season and is expected to strengthen into a hurricane, the National Hurricane Center reported.\n\nAs of 5 p.m. Monday, the storm had winds of 40 mph, making it a tropical storm. Predictions are that if it continues to develop, the storm's winds could strengthen to around 80 mph in the coming day. The storm is expected to miss the United States, but Bermuda is within its predicted path.\nCurrently, the storm is moving north-northeast, and is centered about 290 miles southeast of Cape Hatteras, North Carolina."}, {"id": "f225ea0a-a069-46cf-a1a2-81f7705269c5", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | News Radio 920 AM & 104 . 7 FM", "date": "2024-08-08 16:45", "url": "https://newsradiori.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradiori.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina.", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes its second U.S. landfall in South Carolina early Thursday, bringing life-threatening floods and a deadly tornado in North Carolina."}, {"id": "1faa0d1a-4ab7-4c12-9264-7251a7de107d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:45", "url": "https://kfbk.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfbk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina near Bulls Bay on August 8th, bringing life-threatening floods and a deadly tornado in North Carolina. A tornado spawned by Debby heavily damaged Springfield Middle School in Lucama along with four homes and a church. The storm is expected to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "ac5e3e28-481d-44a4-add2-09d4151179f7", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://newstalk1090.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newstalk1090.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Claudette makes landfall on US Gulf Coast, killing 13 in US"}, {"id": "f659ef3c-8209-4818-a414-d394e6594046", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | NewsTalk WMEQ", "date": "2024-08-08 15:45", "url": "https://wmeq.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wmeq.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby\nTropical Storm Debby made its second U.S. landfall in South Carolina early Thursday morning, bringing with it life-threatening floods and a deadly tornado in North Carolina. The storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center."}, {"id": "aa876b10-c18c-432e-9c0a-32a156fc051d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://wercfm.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wercfm.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday, bringing with it life-threatening floods and a deadly tornado in North Carolina.\n\n---\n\nTerranuova Bracciolini, Italy, has been hit by a 5.8 magnitude earthquake; but there are so far no reports of damage or injuries.\n\nThe epicenter of the earthquake was located in the municipality of Terranuova Bracciolini, in the Province of Arezzo, Siena.\n\n---\n\nForest fires have engulfed over 10 hectares of agricultural land in the village of Chavdarly, Hajigabul region, in Azerbaijan.\n\nThe fire raged for about an hour and secured woodlands near 19 Chavdarly. Residents of the surrounding area filled tour buses with alarms and said that they were waiting for fire-fighting vehicles and firefighters to arrive to extinguish them."}, {"id": "fdb809c7-cf4e-4836-8c36-abeb0f4eda2c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://whoradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina.", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina on Thursday, bringing life-threatening floods and a deadly tornado in North Carolina.\n\nThe storm made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\n\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\n\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "1e64ae1c-9827-4558-89b8-b1fa516b0c1e", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 14:45", "url": "https://kfiam640.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday, bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bfd06f95-bfc0-4b49-b4cb-01500cbb8049", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 14:45", "url": "https://wdov.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wdov.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing life-threatening floods and a deadly tornado in North Carolina.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church."}, {"id": "52646ee2-dbe3-448b-858b-b45fd15eb4ba", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wham1180.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wham1180.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing floods and a deadly tornado to North Carolina."}, {"id": "7201c514-c496-4b65-9b2b-f917610bd14c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wwnc.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wwnc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday, bringing with it life-threatening floods and a deadly tornado in North Carolina.\n\nA tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bb3add72-8c39-45f6-841e-3845e7d26058", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://khvhradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "khvhradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing life-threatening floods and a deadly tornado in North Carolina.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "4b61b659-1be7-4fd2-9371-757ec62f8dda", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:15", "url": "https://wjdx.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wjdx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "bd486dd2-1de1-48a8-97ae-89f0ef447bbc", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | AM 600 WMT", "date": "2024-08-08 16:15", "url": "https://600wmtradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "600wmtradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall near Bulls Bay, South Carolina on August 8, bringing with it life-threatening floods and a deadly tornado in North Carolina.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church."}, {"id": "da4015f7-55cd-4965-90f0-9344918d1b4a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | Newsradio WOOD 1300 and 106 . 9 FM", "date": "2024-08-08 15:30", "url": "https://woodradio.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woodradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing floods and a deadly tornado to North Carolina."}, {"id": "e1e878d8-9306-475f-af2a-e25d4bc48683", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:30", "url": "https://whyn.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "whyn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina on Thursday, bringing with it life-threatening floods and a deadly tornado in North Carolina.\nAs of Thursday, no relevant events of natural-disasters were reported in the current time frame."}, {"id": "ae9f64e1-dc0d-48cf-a446-acaca92b4c5d", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 16:30", "url": "https://650keni.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "650keni.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early this morning, bringing with it life-threatening floods and a deadly tornado in North Carolina.\n\nMeanwhile, in India, a cyclone made landfall on Thursday, causing storm surges in coastal areas.\n\nAnd earlier in the week, a 6.0 magnitude earthquake struck off the coast of Japan, triggering a small tsunami and causing power outages."}, {"id": "0e72dd5e-2e41-48ca-ac1d-8b4f0b6150b5", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:00", "url": "https://newsradio967.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio967.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina.", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made landfall in South Carolina early Thursday, bringing with it life-threatening floods and a deadly tornado in North Carolina.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday."}, {"id": "aa5a8073-6eb9-4b93-9078-7e43f886a838", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | Talk Radio 105 . 9", "date": "2024-08-08 15:00", "url": "https://knrs.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "knrs.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "1. Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\n2. In North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n3. The storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "f2d683f8-e618-49b0-9b8b-51aaec8c3b6b", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:00", "url": "https://powertalk967.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "powertalk967.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday morning, bringing along with it life-threatening floods and a deadly tornado in North Carolina. The storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "75e8ccd5-e142-42af-b500-bbc3193b4b56", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:00", "url": "https://960weli.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "960weli.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing life-threatening floods and a deadly tornado to North Carolina. The storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7719e3c5-e34a-4d63-a230-073b05b01905", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:15", "url": "https://woai.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "woai.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing life-threatening floods and a deadly tornado in North Carolina.\nIn Florida, authorities warned that areas already soaked by flooding could be hit by up to 6 inches of rain by Tuesday.\nRain from Debby also brought the threat of landslides and flash floods in Puerto Rico and the U.S. Virgin Islands.\nTropical Storm Emily made landfall on Mexico’s Yucatan Peninsula on August 1, but forecasters said its impact on the U.S. will be minimal.\nA earthquake with a magnitude of 6.0 struck off the coast of Oregon on August 1, but there were no reports of major damage or injuries."}, {"id": "eefdce6d-fb73-4cf0-9903-525b941afc9e", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:15", "url": "https://newsradio910wltp.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "newsradio910wltp.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina , bringing life-threatening floods and a deadly tornado in North Carolina .\nA tornado associated with Tropical Storm Debby heavily damaged Springfield Middle School near Lucama, as well as four homes and a church."}, {"id": "7959d0c8-007a-4543-94d4-80125a2e95b1", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:30", "url": "https://koacolorado.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "koacolorado.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina, bringing floods, deadly tornado to North Carolina"}, {"id": "013dd076-4e1b-43d3-bc3d-08e6b6185804", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 17:30", "url": "https://590kqnt.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "590kqnt.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Natural Disasters\n1. Tropical Storm Debby made its second US landfall in South Carolina\n2. There is a deadly tornado in North Carolina\n3. Denpasar Earthquake in indonesia"}, {"id": "1f80beec-3ccb-4a19-8f59-3681d3938bf2", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall | News Radio 103 . 1 and 810 WGY", "date": "2024-08-08 15:45", "url": "https://wgy.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wgy.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "40b178af-8a8e-4da9-998e-3533dbd4ba39", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 15:45", "url": "https://wvoc.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wvoc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina (August 8), bringing life-threatening floods and a deadly tornado in North Carolina."}, {"id": "41a54b9a-0bdb-4a75-8567-2fa1c721d07a", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 18:00", "url": "https://710wor.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "710wor.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby makes second U.S. landfall in South Carolina early Thursday (August 8), bringing life-threatening floods and a deadly tornado in North Carolina. The storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "2d8e522b-5d53-4f15-a0f0-135b834bd92c", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:30", "url": "https://khow.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "khow.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\n\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\n\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "7c0ec5ff-32b7-466a-bf81-e6ddc1ffd638", "title": "Death Toll Rises As Tropical Storm Debby Makes Second U . S . Landfall", "date": "2024-08-08 19:45", "url": "https://wmrn.iheart.com/content/2024-08-08-death-toll-rises-as-tropical-storm-debby-makes-second-us-landfall/", "domain": "wmrn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby made its second U.S. landfall in South Carolina early Thursday (August 8), bringing with it life-threatening floods and a deadly tornado in North Carolina.\nThe storm, which had already caused significant rainfall in parts of the South, made landfall near Bulls Bay, South Carolina, with winds of 50 mph, according to the National Hurricane Center.\nDebby was a Category 1 hurricane when it first made landfall near Steinhatchee in Florida’s Big Bend region on Monday.\nIn North Carolina, a tornado spawned by Debby heavily damaged Springfield Middle School in Lucama, along with four homes and a church.\nThe storm is expected to continue to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9005767976788561, "event_breakdown": "Tropical Storm Debby made landfall near Bulls Bay, South Carolina early Thursday. The storm is expected to weaken as it moves inland but is not forecast to leave North Carolina until Thursday night or Friday."}, {"id": "fd1e4648-30b8-4bf4-9376-73ce00ff21fc", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 21:15", "url": "https://dailyvoice.com/connecticut/greenwich/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4.", "location": "Hurricane Debby made landfall near Apalachee Bay, Florida.", "classification": "natural-disasters", "score": 0.9862598543258225, "event_breakdown": "Hurricane Debby made landfall in Florida on Monday, Aug. 5, around 7 a.m. about 70 miles southeast of Tallahassee. The storm was downgraded to a tropical storm shortly afterward as it hit the state's Gulf Coast with flooding rain, damaging winds, and the storm surge. The slow-moving system is expected to affect the Northeast later this week, particularly southern New England and potentially parts of Long Island. A [map above] highlights the areas that will experience some impacts, marked in yellow on the image."}, {"id": "749070fb-b1b6-461b-a06a-404b603bb67f", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 15:00", "url": "https://www.dailypioneer.com/2024/top-stories/a-powerful-earthquake-hits-off-southern-japan--tsunami-advisory-issued.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe agency said tsunami waves of up 50 centimetres (1.6 feet) were detected along parts of Kyushu's southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on January 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "Japan", "classification": "natural-disasters", "score": 0.9868866637317364, "event_breakdown": "Japan's Meteorological Agency issued an advisory for a tsunami up to 1.6 feet (50 centimeters) in coastal regions of the southern Kyushu island and the neighboring region of Shikoku. The 5.0-magnitude earthquake struck on Thursday morning."}, {"id": "8e6c9ead-fb45-4897-ab2a-e7f966471c42", "title": "Tropical Storm Debby tests severe - weather readiness", "date": "2024-08-08 21:00", "url": "https://www.csmonitor.com/Environment/2024/0808/tropical-storm-debby-flooding-readiness", "domain": "csmonitor.com", "domain_classification": "Unknown", "message": "Events like Tropical Storm Debby bring mounting insurance, construction, and financial stresses.\nLike the alligator spotted this week swimming through a flooded suburban neighborhood in Bluffton, South Carolina, Tropical Storm Debby posed real danger as it slammed the U.S. Southeast, causing floods and seven deaths as of Wednesday afternoon.\n“She ... just stayed there and just rained and rained and rained.”If warming temperatures mean larger, more dangerous storms, Debby isn’t the most severe example.\nWhy We Wrote This Events like Tropical Storm Debby bring mounting insurance, construction, and financial stresses.\nMarco Bello/Reuters A youth driveway-surfs on floodwater as Tropical Storm Debby moves off Georgia to the North Atlantic, in Isle of Palms, South Carolina, Aug. 6, 2024.", "location": "Bluffton, South Carolina", "classification": "natural-disasters", "score": 0.9354160032981433, "event_breakdown": "\"Tropical Storm Debby floods U.S. Southeast, at least seven dead\""}, {"id": "8cc19cd4-01bd-4560-9a14-98db75661004", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 17:45", "url": "https://abc11.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.9297271825253406, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East Coast\nHUGER, South Carolina - Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from flooding in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C.\nDebby has weakened to a tropical depression but still threatens soaking rain, possible tornadoes and flash floods for eastern and central Florida."}, {"id": "deddaffa-86bd-4551-8951-5950b355da64", "title": "7 . 1  Megaquake  Sparks Fear Across Pacific", "date": "2024-08-08 21:00", "url": "https://charismanews.com/news/7-1-megaquake-sparks-fear-across-pacific/", "domain": "charismanews.com", "domain_classification": "Unknown", "message": "This time, the 7.1 magnitude quake’s epicenter was located at the southern portion of mainland Japan near the Miyazaki Prefecture and tsunami advisory was sounded.\nThankfully, no reports of significant damage have been reported at this time.\nStay up-to-date with current issues, Holy Spirit news, Christian teachings, Charisma videos & more!\nThe Japan Meteorological Agency assessed the quake to have taken place 19 miles beneath the ocean’s surface.\nJoin Charisma Magazine Online to follow everything the Holy Spirit is doing around the world!", "location": ")\nMIYAZAKI", "classification": "natural-disasters", "score": 0.6088285652064904, "event_breakdown": "7.1 Magnitude earthquake shakes Japan\nThe Japan Meteorological Agency reported an Earthquake with a preliminary magnitude of 7.1 off the coast of Kyushu, Japan. The quake was an aftershock of the 9.0 magnitude earthquake that struck off the coast of Tohoku on March 11, 2011. So far, no damage has been reported, and there are no tsunami warnings in effect at this time."}, {"id": "d603b6f7-e508-4134-950f-e87cbe7eb5cb", "title": "Debby makes second landfall in South Carolina as it marches northward", "date": "2024-08-08 19:15", "url": "https://dunyanews.tv/en/World/829623-debby-makes-second-landfall-in-south-carolina-as-it-marches-northward", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Debby makes second landfall in South Carolina as it marches northwardWorld World Debby makes second landfall in South Carolina as it marches northwardThe system could spawn tornadoes in the region on ThursdayFollow on Updated On: Thu, 08 Aug 2024 23:08:19 PKTATLANTA (Reuters) - Tropical Storm Debby made a second landfall northeast of Charleston early on Thursday as it dumped more rain on coastal South and North Carolina, exacerbating fears of flash flooding in areas already soaked by the slow-moving weather system.\nDebby, which has killed at least seven people, was located about 80 miles (125 km) southeast of Charlotte, North Carolina, and 110 miles (180 km) southwest of Raleigh, on Thursday morning.\nRainfall totals could reach 15 inches (38 cm) in southeastern North Carolina and 10 inches (25 cm) in parts of Virginia.\nAn apparent tornado killed one man when his house collapsed as it tore through eastern North Carolina and damaged at least 10 houses, a church and a school in Wilson County, North Carolina, early on Thursday morning, county officials reported on social media.\nBy the weekend, Debby could produce up to 6 inches (15 cm) of rain from Maryland into northern Vermont.", "location": "COLUMBIA, SC (Reuters) - Tropical storm Debby made a second landfall", "classification": "natural-disasters", "score": 0.8393363936588567, "event_breakdown": "Tropical Storm Debby makes second landfall in South Carolina as it marches northward\nBy Friday, Debby will likely dissipate near northern Virginia and West Virginia."}, {"id": "5ca588c9-5644-48a5-952e-d4ee50876da0", "title": "Tropical Storm Debby : Person killed in likely tornado in North Carolina", "date": "2024-08-08 23:30", "url": "https://www.fox5ny.com/news/tropical-storm-debby-south-carolina-east-coast", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Tornadoes produced by Tropical Storm Debby damaged homes and a school and killed one person early Thursday, as heavy rain and floods slammed North and South Carolina.\nOn Thursday morning, the National Weather Service in Wilmington, North Carolina, issued Flash Flood Warnings for several counties in southeastern North Carolina and northeastern South Carolina.\nRELATED: Tropical Storm Debby moves up East Coast as flood threat continues for CarolinasFILE-A man walks on a flooded street due to Tropical Storm Debby on August 06, 2024 in Charleston, South Carolina.\nWarning boxes are color coded as: Severe Thunderstorm Warnings in yellow, Tornado Warnings in red, Tornado Warnings with a confirmed tornado in purple, Flash Flood Warnings in green and Flash Flood Emergencies in pink.\n(FOX Weather)According to FOX Weather, President Joe Biden has approved emergency declarations for Georgia, South Carolina, North Carolina and Florida.", "location": "Carolina", "classification": "natural-disasters", "score": 0.9779811061191892, "event_breakdown": "Natural disasters reported in the news that can be placed on a map include:\n\n1. A tornado produced by Tropical Storm Debby damaged homes and a school and killed one person early Thursday, as heavy rain and floods slammed North and South Carolina.\n\n2.  On Thursday morning, the National Weather Service in Wilmington, North Carolina, issued Flash Flood Warnings for several counties in southeastern North Carolina and northeastern South Carolina."}, {"id": "976edc1c-4d2b-4963-900c-76fe6495a0d6", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 15:45", "url": "https://abc30.com/post/tropical-storm-debby-makes-2nd-landfall-south-carolina-heavy-rain-expected-east-coast/15159161/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, drops heavy rain on East CoastHUGER, South Carolina -- Tornadoes spawned by Debby leveled homes, damaged a school and killed one person early Thursday, as the tropical system dropped heavy rain and flooded communities across North and South Carolina.\nA drain pulls in residual rainwater from floods in the downtown area caused by Tropical Storm Debby, Thursday in Bladenboro, NC.\nThen, Debby made a second landfall early Thursday in South Carolina as a tropical storm.\nhome after it was flooded by Tropical Storm Debby on Thursday in Isle of Palms, S.C. Mic SmithStill, more flooding was expected in North and South Carolina.\nNOTE: Associated Press contributors include Jeffrey Collins in Columbia, South Carolina; Jeff Martin in Atlanta, and freelance photographer Mic Smith in Isle of Palms, South Carolina.", "location": "COLUMBIA, South Carolina", "classification": "natural-disasters", "score": 0.9297271825253406, "event_breakdown": "Tropical Storm Debby made second landfall in South Carolina, dropping heavy rain and flooding communities across North and South Carolina, killing one person and spawning tornadoes that leveled homes."}, {"id": "85b70d97-9726-48bb-97d6-20603b2ea8b3", "title": "Hurricane season : 2024 mid - season forecast while reflecting back", "date": "2024-08-08 19:15", "url": "http://www.myplainview.com/news/article/2024-atlantic-gulf-of-mexico-hurricane-season-19626099.php", "domain": "myplainview.com", "domain_classification": "Unknown", "message": "A person looks out toward the flooded interstate after Hurricane Beryl swept through the area on July 8, 2024, in Houston, Texas.\nHurricane season for the Atlantic basin season runs from June 1 to Nov. 30, according to the National Oceanic and Atmospheric Administration (NOAA).\nColorado State University and NOAA both published forecasts that suggested 2024 would be an active hurricane season in part from the sea surface temperatures reaching record-level temperatures.\nTo take a step back and reflect on the 2024 hurricane season, here are landfall dates, wind speed and precipitation images from the season, which kicked off with the first named storm, Tropical Storm Alberto, on June 19.\nAdvertisement Article continues below this adRainwater floods an underpass during Hurricane Beryl on July 08, 2024 in Houston, Texas.", "location": "Houston, Texas", "classification": "natural-disasters", "score": 0.9070300057017038, "event_breakdown": "2024 Atlantic Hurricane Season- 23 named storms formed, 10 hurricanes, 19 storms became hurricanes, and 3 major hurricanes formed."}, {"id": "1d224c00-be07-4e9c-9ac7-75e586a2d4a4", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina , heavy rain expected up the East Coast", "date": "2024-08-08 10:30", "url": "http://lasvegassun.com/news/2024/aug/07/tropical-storm-debby-makes-2nd-landfall-in-south-c/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East CoastHUGER, S.C. (AP) — Tropical Storm Debby spawned damaging tornadoes, flooded a town and temporarily shut down part of Interstate 95 early Thursday as it blew into North Carolina after making a second landfall overnight.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph (80 kph).\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer.", "location": "HUGER, South Carolina", "classification": "natural-disasters", "score": 0.9534628634120169, "event_breakdown": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast\nHUGER, S.C. (AP) — Tropical Storm Debby spawned damaging tornadoes, flooded a town and temporarily shut down part of Interstate 95 early Thursday as it blew into North Carolina after making a second landfall overnight.\nThe National Hurricane Center says Debby came ashore early Thursday near Bulls Bay, South Carolina.\nIt was still a tropical storm Thursday morning, with maximum sustained winds at 50 mph (80 kph).\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to weather service meteorologist Scott Kleebauer."}, {"id": "743bd1be-84dd-4fdb-807a-005d28ff9cf0", "title": "A powerful earthquake hits off southern Japan ; tsunami advisory issued", "date": "2024-08-08 14:45", "url": "https://www.wafb.com/2024/08/08/powerful-earthquake-hits-off-southern-japan-tsunami-advisory-issued/", "domain": "wafb.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory.\nResidents were urged to stay away from the coastline, but there were no immediate reports of injuries or serious damage.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe agency said tsunami waves of up 50 centimeters (1.6 feet) were detected along parts of Kyushu’s southern coast and the nearby island of Shikoku about a half hour after the quake struck.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9895575659072293, "event_breakdown": "Japan Earthquake"}, {"id": "aec39c81-cad2-41a7-8e93-67901fb6a2e9", "title": "Bangkok Post - Damage minimal after strong quake off Japan", "date": "2024-08-08 15:45", "url": "https://www.bangkokpost.com/world/2843986/damage-minimal-after-strong-quake-off-japan", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "But officials investigating whether risk of trench-type ‘megaquake’ is increasingPeople gather on a street after an earthquake with a magnitude of 7.1 shook Miyazaki in southwestern Japan on Thursday.\n(Photo: Kyodo)TOKYO - A powerful earthquake with a magnitude of 7.1 shook southwestern Japan on Thursday afternoon but no major damage was reported and only relatively minor tsunami waves reached the coast.\nThe quake occurred at 4.43pm local time at a depth of around 30 kilometres off Miyazaki prefecture.\nServices on the Kyushu and Nishi Kyushu shinkansen bullet trains were temporarily suspended due to the quake, the operator said.\nIt said it has started investigating whether there is a link between the temblor and a potential massive trench-type “megaquake” along the Nankai Trough off western and central Japan.", "location": "MIYAZAKI", "classification": "natural-disasters", "score": 0.9082214644316463, "event_breakdown": "Japan - A powerful earthquake with a magnitude of 7.1 shook southwestern Japan on Thursday afternoon. The quake occurred at 4.43pm local time at a depth of around 30 kilometres off Miyazaki prefecture."}, {"id": "86660615-c40b-4d31-84a2-d4d67abeb83f", "title": "Tropical Storm Debby makes 2nd landfall in South Carolina", "date": "2024-08-08 14:45", "url": "https://www.ksl.com:443/article/51094213/tropical-storm-debby-makes-2nd-landfall-in-south-carolina", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Standing water a few feet deep covered parts of the tiny North Carolina town.\nDamaged trucks are seen at a car dealer after a tornado hit the area as Tropical Storm Debby drifts in the East Coast, in Moncks Corner, S.C., Wednesday.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMeanwhile, floodwaters haven't even fully drained out of some homes in South Carolina.\nA state of emergency was in effect for both North Carolina and Virginia.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.7802714760022962, "event_breakdown": "Tornadoes hit North Carolina and Virginia. Tropical Storm Debby hits South Carolina and North Carolina."}, {"id": "65171d44-57ea-436a-8fc0-69e75dfcade3", "title": "Japan earthquake : Authorities issue MEGAQUAKE warning for the first time ever after tremors earlier in the same area  one of the world deadliest earthquake hit nearly 80 years ago", "date": "2024-08-08 18:15", "url": "https://www.dailymail.co.uk/news/article-13724853/japan-earthquake-megaquake-warning.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Japan has issued its first ever megaquake warning following tremors earlier today in the same area 'one of the world's deadliest earthquakes' hit almost 80 years ago.\nThe 7.1 magnitude earthquake struck off the coast of Japan's southern island of Kyushu, close to the city of Nichinan, at 4.43pm local time.\nThe most recent quake to hit the area was 78 years ago in December 1946.\nThe 7.1 magnitude earthquake struck off the coast of Japan's southern island of Kyushu, close to the city of Nichinan, at 4.43pm local timePeople take shelter outside following the earthquake.\nJapan's Meteorological Agency has issued a tsunami warning following the powerful quakeVisitors to the Peace Park crouch as an earthquake alert was issued in Nagasaki.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9428573918144538, "event_breakdown": "Japan Earthquake\n\nJapan has issued its first ever megaquake warning following a tremor today in the same area 'one of the world's deadliest earthquakes' hit almost 80 years ago. The 7.1 magnitude earthquake struck off the coast of Japan's southern island of Kyushu, close to the city of Nichinan, at 4.43pm local time."}, {"id": "be18686d-92f9-41d8-a921-ea5d052088ce", "title": "7 . 1 magnitude earthquake strikes southern Japan", "date": "2024-08-08 16:45", "url": "https://www.foxla.com/news/7-1-magnitude-earthquake-strikes-southern-japan", "domain": "foxla.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan’s southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.\nAn earthquake on Jan. 1 in Japan’s north-central region of Noto left more than 240 people dead.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9868785213485901, "event_breakdown": "Japan just experienced a strong earthquake of magnitude 7.1 on Thursday, August 27th, 2020. The epicentre was located in the Pacific Ocean, just off the coasts of Fukushima and Miyagi prefectures."}, {"id": "24128c41-4986-4317-a260-edaf822890ae", "title": "New Update : Tropical Storm Debby Expected To Become Hurricane As It Heads Toward US Coast", "date": "2024-08-08 16:15", "url": "https://dailyvoice.com/connecticut/newcanaan/tropical-system-now-expected-to-make-landfall-in-us-as-hurricane-heres-what-to-know-now/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby heading north toward the Big Bend of Florida from Cuba, and has sustained winds of 40 miles per hour, the National Hurricane Center said in an update early Sunday morning, Aug. 4.\nIt's expected to be a Category 1 or 2 hurricane when making landfall along Florida's west coast, which is projected for Monday morning, Aug. 5.\nRainfall totals could exceed 12 to 18 inches along the Southeast US coast next week, posing a major flooding and public safety risk.\nCheck back to Daily Voice for updates.\nClick here to follow Daily Voice New Canaan and receive free news updates.", "location": "itself\nFlorida", "classification": "natural-disasters", "score": 0.9704621677329278, "event_breakdown": "Tropical Storm Debby heading north toward the Big Bend of Florida from Cuba, and has sustained winds of 40 miles per hour, the National Hurricane Center said in an update early Sunday morning, Aug. 4. It's expected to be a Category 1 or 2 hurricane when making landfall along Florida's west coast, which is projected for Monday morning, Aug. 5. Rainfall totals could exceed 12 to 18 inches along the Southeast US coast next week, posing a major flooding and public safety risk. Check back to Daily Voice for updates."}, {"id": "ca4bb6ae-f38b-4150-894c-52841759de06", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 14:45", "url": "https://komonews.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "komonews.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": "KYUSHU", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "A powerful earthquake struck off the east coast of Japan's southern main island of Kyushu on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline"}, {"id": "1bf66dac-1567-421e-be88-01d808e8f36b", "title": "  Megaquake  warning issued by Japan after 7 . 1 magnitude earthquake", "date": "2024-08-08 19:45", "url": "http://www.lmtonline.com/news/article/japan-issues-megaquake-warning-earthquake-19628373.php", "domain": "lmtonline.com", "domain_classification": "Unknown", "message": "This graphic released by the Japan Meteorological Agency shows the seismic intensity from the 7.1 magnitude earthquake on Aug. 8, 2024.\nGraphic courtesy of the Japan Meteorological AgencyAfter a 7.1 magnitude earthquake impacted the Miyazaki Prefecture at 4:42 p.m. local time (3:42 a.m.\nET) today, Japan has issued the first “megaquake” warning for fears of a massive earthquake in the Nankai Trough.\nIn the future, if a large-scale earthquake occurs, it is expected to generate strong shaking and high tsunami waves.\nThe odds make a large-scale earthquake occurring in the Nankai Region relatively high compared to normal times.", "location": ")\nMORIMATSU, MIYAZAKI", "classification": "natural-disasters", "score": 0.9068568110029958, "event_breakdown": "Japan has issued its first “megaquake” warning for the Nankai Trough, a chain of seafloor trenches off the coast.\n\nThe Nankai Trough is part of a zone of tectonic activity called the Tokai-Tonankai-Chubu Metropolitan Area, which is due for as big earthquake.\n\nIf it does hit, it has the potential to cause severe destruction and tsunami waves along Japan’s populated coastal cities, including the densely populated capital Tokyo."}, {"id": "9cc0702d-6b43-4081-8899-dfc3115af2f4", "title": "National Hurricane Center predicting 2024 hurricane season could  rank among busiest on record  ", "date": "2024-08-08 18:00", "url": "https://www.yahoo.com/news/national-hurricane-center-predicting-2024-162908755.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NOAA predicting 2024 hurricane season could 'rank among busiest on record'NOAA has updated its prediction for the 2024 Atlantic hurricane season, more than two months and four named storms after its first prediction was released in May.\nNOAA predicting 17-24 named storms for 2024 Atlantic hurricane seasonNOAA updated its 2024 Atlantic hurricane season forecast on Aug. 8, 2024.\nGet weather alerts via textOriginal NOAA hurricane season forecast issued in MayNational Hurricane Center releases 2024 Atlantic hurricane season prediction.\nAccuWeather predicting 2024 Atlantic hurricane season could break recordAccuWeather released its 2024 hurricane seasonal forecast Wednesday, March 27 calling for an above normal season.\nNational Hurricane Center making changes for 2024 hurricane seasonThe National Hurricane Center will be experimenting with a new cone later this hurricane season.", "location": ".\nBased on the context provided, I was unable to find a specific location for the main event.", "classification": "natural-disasters", "score": 0.8244180981983963, "event_breakdown": "The following current events of natural-disasters reported in text can be placed on a map:\n\n- On August 8th, 2024, NOAA updated its 2024 Atlantic hurricane season forecast\n\n- On March 27, 2024, AccuWeather released its 2024 hurricane seasonal forecast predicting an above normal season\n\n- On August 8th, 2024, NOAA updated its 2024 Atlantic hurricane season to a total of 17-24 named storms."}, {"id": "dffb7447-6b02-4cb1-a4e3-9958e0f8afef", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 14:30", "url": "https://wjla.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wjla.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": "Japan", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.  The Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles). The quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island."}, {"id": "9e2f8231-f073-4c1f-ac82-d7f611c5377a", "title": "Tropical Storm Debby touches down in DC region Thursday with damaging winds , possible flooding", "date": "2024-08-08 15:30", "url": "https://wtop.com/weather/2024/08/tropical-storm-debby-touches-down-in-dc-region-thursday-with-damaging-winds-possible-flooding/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "Alexandria residents prepare for possible flooding from DebbyListen live to WTOP for traffic and weather updates on the 8s.\nThe National Weather Service said “torrential rainfall is occurring with this storm, and may lead toflash flooding” around the D.C. area.\nDC activates emergency operations centerThe District activated its Emergency Operations Center in anticipation of Tropical Depression Debby’s impacts.\nIf you have a water emergency or a sewer backup, immediately report it to DC Water’s Water and Sewer Emergency Line by calling (202) 612-3400.\nFORECASTSteadier rain bands arrive this afternoon, separated by briefer dry breaks as Tropical Depression Debby heads deeper into the Carolinas.", "location": "DC", "classification": "natural-disasters", "score": 0.9324221895769533, "event_breakdown": "DC activates emergency operations center\nFor questions regarding the activation, the public can email the EOC or call 311."}, {"id": "e5b667ae-e4d7-425d-9d72-a38148c6d451", "title": "Powerful Earthquake Hits Off Southern Japan", "date": "2024-08-08 21:15", "url": "https://www.aol.com/powerful-earthquake-hits-off-southern-125628728.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "TOKYO — A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nHe urged residents of the affected region to stay away from the coastline.\nAn earthquake on Jan. 1 in Japan's north-central region of Noto left more than 240 people dead.", "location": "The location of the most powerful quake is Nichinan city and surrounding areas in Miyazaki prefecture on Kyushu", "classification": "natural-disasters", "score": 0.978133136168696, "event_breakdown": "Japan Earthquake (August 25, 2022): A powerful earthquake hit Japan's southern coast on August 25, 2022, triggering a tsunami advisory that urged residents to stay away from the coastline."}, {"id": "0061d923-4766-4c51-b178-ba79c6b5aace", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:45", "url": "https://wsbt.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "Earthquake in Japan, Tsunami warnings issued in Japan"}, {"id": "af55f217-b23a-491e-95dc-cd069d7c322e", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:00", "url": "https://fox11online.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": "KYUSHU ISLAND, JAPAN", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "A powerful magnitude 7.1 earthquake shook Japan's southern coast late Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline. The Japan Meteorological Agency said the quake was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles)."}, {"id": "566638d1-07b0-4b3b-9a6b-d0e015ec15fa", "title": "Tsunami advisory issued after 7 . 1 magnitude quake shakes southern Japan", "date": "2024-08-08 15:45", "url": "https://upnorthlive.com/news/nation-world/tsunami-advisory-issued-after-71-magnitude-quake-shakes-southern-japan-injured-kyushu-meteorological-agency-nichinan-city-miyazaki-seismologists-nankai-trough-fire-and-disaster-management", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan's southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe Japan Meteorological Agency said the quake registered magnitude 7.1 and was centered in waters off the eastern coast of Japan's southern main island of Kyushu at a depth of about 30 kilometers (18.6 miles).\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThey later issued an assessment that the potential for a future quake in the area from Kyushu to central Japan is higher than previously predicted.\nHe urged residents of the affected region to stay away from the coastline.", "location": ".\nkyushu", "classification": "natural-disasters", "score": 0.975498624698132, "event_breakdown": "Japan Earthquake, Tsunami Advisory Issued After 7.1 Magnitude Quake\nA powerful earthquake triggered a tsunami advisory on Thursday, urging residents to stay away from Japan's southern coast. The quake registered 7.1 magnitude and was centered in waters off the eastern coast of Japan's southern main island of Kyushu. The Japan Meteorological Agency urged regions from Kyushu to central Japan to take precautions after a report of a potential tidal overflow of 3 meters."}, {"id": "c29e607f-5af6-4f45-b71b-06a7b768d3ba", "title": "Powerful quake hits off Japan coast", "date": "2024-08-08 19:45", "url": "https://www.ksl.com:443/article/51094307/powerful-quake-hits-off-japans-coast", "domain": "ksl.com", "domain_classification": "Unknown", "message": "However, the quake prompted seismologists to hold an emergency meeting in which they reassessed and raised the level of risk of major quakes associated with the Nankai Trough east of southern Japan.\nThe Japan Meteorological Agency said that Thursday's quake registered magnitude 7.1 and was centered in waters off the eastern coast of Kyushu at a depth of about 19 miles below sea surface.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nSeismologists at the agency held an emergency meeting to analyze whether the quake had affected the nearby Nankai Trough, the source of past devastating earthquakes.\nThe agency said it will continue to closely watch movements of plates near the Nankai Trough.", "location": "MIYAZAKI", "classification": "natural-disasters", "score": 0.7947835221673988, "event_breakdown": "Japan Earthquake\nA 7.1-magnitude earthquake has hit waters off the eastern coast of Kyushu, Japan, according to the Japan Meteorological Agency (JMA). The agency said on Thursday that the quake did not trigger a tsunami warning. It said that the quake registered at magnitude 7.1 and was centered in waters off the island of Kyushu at a depth of about 19 miles below sea surface. The quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island. The agency did not issue a tsunami advisory."}, {"id": "6c96145e-087e-423a-9b75-408fa5c52f2b", "title": "Tornado death raises Tropical Storm Debby toll to 7 as heavy rains keep falling", "date": "2024-08-08 19:45", "url": "https://www.ksl.com:443/article/51094213/tornado-death-raises-tropical-storm-debby-toll-to-7-as-heavy-rains-keep-falling", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Standing water a few feet deep covered parts of the tiny North Carolina town.\nDamaged trucks are seen at a car dealer after a tornado hit the area as Tropical Storm Debby drifts in the East Coast, in Moncks Corner, S.C., Wednesday.\nDebby also could bring more tornadoes Thursday in parts of North Carolina and Virginia, forecasters said.\nMeanwhile, floodwaters haven't even fully drained out of some homes in South Carolina.\nA state of emergency was in effect for both North Carolina and Virginia.", "location": "Summerville", "classification": "natural-disasters", "score": 0.7802714760022962, "event_breakdown": "Tropical Storm Debby is causing flooding in parts of North Carolina and Virginia. South Carolina is still dealing with the aftermath of tornadoes and flooding from previous storms."}, {"id": "36698c5a-68b1-4342-8c4f-a8107fb9df97", "title": "Nine injured as powerful earthquake strikes off southern Japan", "date": "2024-08-08 14:45", "url": "https://www.irishexaminer.com/world/arid-41452687.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nNine people were injured, most of them slightly, but there were no reports of serious damage.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe Nuclear Regulation Authority said all 12 nuclear reactors, including three that are currently operating, on Kyushu and Shikoku remained safe.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster.", "location": "MIYAMA, Japan", "classification": "natural-disasters", "score": 0.9788190456882454, "event_breakdown": "[\n\"Event Title\": \"Kumamoto Earthquake and Tsunami in Japan\",\n\"Short Description\": \"A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline. The quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island. Nine people were injured, most of them slightly, but there were no reports of serious damage.\",\n\"Location\": \"Japan\",\n\"Date\": \"March 16, 2022\"\n] [\n\"Event Title\": \"Kyiv Explosion\",\n\"Short Description\": \"At least one person died and several more were injured Friday in an apparent gas explosion in a Kyiv residential area, which Ukraine's emergencies service said was caused by a missile strike. Emergency officials in the Ukrainian capital said at least 20 apartments in a 9-story building were damaged by the explosion. Some reports say up to 30 have been hurt.\",\n\"Location\": \"Kyiv, Ukraine\",\n\"Date\": \"Mar 19, 2022\"\n]"}, {"id": "8e163c94-657d-40c7-8138-15c2be6efd6a", "title": "Japan issues advisory over possible Nankai Trough earthquake - Nikkei Asia", "date": "2024-08-08 21:30", "url": "https://asia.nikkei.com/Economy/Natural-disasters/Japan-issues-advisory-over-possible-Nankai-Trough-earthquake", "domain": "asia.nikkei.com", "domain_classification": "Unknown", "message": "Following the afternoon quake, the Japan Meteorological Agency launched investigations into its possible relationship to a potential Nankai Trough earthquake, which experts have warned for years could cause huge loss of life and property across a wide stretch of central and western Japan.\nThe agency issued its Nankai Trough Earthquake Extra Information for the first time ever on Thursday evening.\nThe agency urged caution for a week, with the probability of large earthquakes being higher just after the Miyazaki quake.\nThe agency said a Nankai Trough earthquake may be limited to the vicinity of Thursday's quake or extend over the \"entire Nankai Trough.\"\nIt was not immediately clear if the heightened Nankai Trough earthquake risk would impact his plans.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7662943503856997, "event_breakdown": "Japan is facing heightened risk of a Nankai Trough earthquake following a string of major earthquakes and a tsunami warning in the Pacific. The Japan Meteorological Agency has issued the first ever Nankai Trough Earthquake Extra Information. The agency warned that large earthquakes were more likely over the next week, and urged caution."}, {"id": "f2d7a1e3-f1d3-458d-b39b-f7943a0afe6b", "title": "Tropical Storm Debby makes second landfall in South Carolina , bringing rain , tornadoes", "date": "2024-08-08 18:15", "url": "https://thefrontierpost.com/tropical-storm-debby-makes-second-landfall-in-south-carolina-bringing-rain-tornadoes/", "domain": "thefrontierpost.com", "domain_classification": "Unknown", "message": "LAUREN SFORZA –Tropical Storm Debby made its second landfall Thursday in South Carolina as it continues to batter the East Coast with heavy rains and strong winds.\nAs of Thursday morning, more than 7,000 households are without power in South Carolina, and more than 137,000 have outages in North Carolina, according to poweroutage.us.\nDebby first made landfall in Florida as a Category 1 hurricane but has since weakened into a tropical storm.\nThe center said that the storm currently has sustained winds of 45 mph, keeping it in the tropical storm category.\nThe NWS added that tropical storm conditions will affect parts of the coastal Carolinas through Thursday and that flooding in the area due to the storm surge is possible.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.9360237679384289, "event_breakdown": "[\n{\n\"event\": \"Tropical Storm Debby made its second landfall Thursday in South Carolina as it continues to batter the East Coast with heavy rains and strong winds.\",\n\"when\": \"July 2022\"\n}\n]"}]