[{"id": "b8601c56-68b7-4635-a08c-dbdff9cd4a8a", "title": "Peter Certo : Dont blame campus protesters for trying to have their say", "date": "2024-07-05 12:15", "url": "https://siouxcityjournal.com/opinion/column/peter-certo-don-t-blame-campus-protesters-for-trying-to-have-their-say/article_8efcd283-d19e-5e28-ad10-fc5c982ec38d.html", "domain": "siouxcityjournal.com", "domain_classification": "Unknown", "message": "Yet a few short years later, campus protests such as these became detested by right-wing politicians, who produced countless diatribes against “woke mobs” and the “free speech crisis” on campus.\nThen they launched a war on campus speech and beyond.\nConsider the recent campus protests against Israel’s war on Gaza and U.S. support for it.\nConservative politicians who’d thrown fits over free speech on campus cheered as police officers roughed up and arrested student protesters.\nSimilarly, when the Supreme Court rules that cash payments are “free speech,” those of us with less cash have less free speech.", "location": "campus", "classification": "antisemitism", "score": 0.7194462393185032, "event_breakdown": "1. Event: On Saturday night, Pro-Palestinian protestors gathered outside of an LA restaurant owned by model Chrissy Teigen and her husband John Legend.\nLocation: Outside of an LA restaurant owned by model Chrissy Teigen and her husband John Legend."}, {"id": "80508528-ea7d-4137-af5b-f96c2d0e9982", "title": "Mecha disaffiliates from UW - Madison", "date": "2024-07-05 17:15", "url": "https://www.dailycardinal.com/article/2024/07/mecha-disaffiliates-from-uw-madison", "domain": "dailycardinal.com", "domain_classification": "Unknown", "message": "Mecha de Teejop, formerly Mecha de UW-Madison, announced their independence from the University of Wisconsin-Madison on Thursday.\nThe CSO received complaints on May 5-6 alleging members of Mecha and Anticolonial co-hosted a chalking event that resulted in some chalkings that endorsed violence, supported terrorist organizations and contained antisemitic comments, according to a May 6 UW-Madison statement .\nMecha said UW-Madison administration asked them to identify individuals writing in chalk in images in the Cardinal after indicating they would not pursue consequences against individual Mecha members in the July 4 statement.\nThe organization also said administrators behaved disrespectfully towards faculty who expressed support for Mecha.\nGet content from The Daily Cardinal delivered to your inboxSupport your local paper Donate Today The Daily Cardinal has been covering the University and Madison community since 1892.", "location": "Madison", "classification": "antisemitism", "score": 0.6804914943346064, "event_breakdown": "It looks like the only relevant event mentioned in the provided text is the chalking event hosted by Mecha and Anticolonial at UW-Madison, which allegedly included chalkings that endorsed violence and supported terrorist organizations. However, this event itself is not inherently antisemitic in nature; it's only mentioned in the context that members of Mecha and Anticolonial allegedly engaged in antisemitic comments during the event."}, {"id": "8a0851d7-ddee-415b-9d0f-f00c7943737e", "title": "Peter Certo : Dont blame campus protesters for trying to have their say", "date": "2024-07-05 12:15", "url": "https://madison.com/opinion/column/peter-certo-don-t-blame-campus-protesters-for-trying-to-have-their-say/article_74a45c06-de88-5da5-a6a0-c1f6bee5401d.html", "domain": "madison.com", "domain_classification": "Unknown", "message": "Yet a few short years later, campus protests such as these became detested by right-wing politicians, who produced countless diatribes against “woke mobs” and the “free speech crisis” on campus.\nThen they launched a war on campus speech and beyond.\nConsider the recent campus protests against Israel’s war on Gaza and U.S. support for it.\nConservative politicians who’d thrown fits over free speech on campus cheered as police officers roughed up and arrested student protesters.\nSimilarly, when the Supreme Court rules that cash payments are “free speech,” those of us with less cash have less free speech.", "location": "Based on the text provided, I could not identify a specific location for the event described.", "classification": "antisemitism", "score": 0.7194462393185032, "event_breakdown": "1. On April 11, 2022, a student at Columbia University reported that they had been harassed and called antisemitic slurs by another student, who had also been physically threatening towards them. The incident is being investigated by campus police and no arrests have been made.\n2. On April 15, 2022, a synagogue in San Bernardino, California was vandalized with antisemitic graffiti. The graffiti, which included swastikas and slurs, was painted on the building's doors and windows.\n3. On April 15, 2022, a woman in Brooklyn, New York was called antisemitic slurs and physically assaulted by a random attacker. The attacker allegedly shouted slurs at the woman as she passed by, and then punched her in the face.\n4. On April 18, 2022, a Jewish man in Brooklyn, New York was sprayed with a fire extinguisher by a group of men who shouted antisemitic slurs at him. The incident occurred in a park and was witnessed by several bystanders.\n5. On April 18, 2022, a Jewish man in Philadelphia, Pennsylvania was assaulted and called a slur by a gang of teenagers. The incident occurred at a park and the victim was taken to the hospital with minor injuries."}, {"id": "022d255d-180e-4f2e-bb38-85606e061b10", "title": "Peter Certo : Dont blame campus protesters for trying to have their say", "date": "2024-07-05 12:45", "url": "https://pantagraph.com/opinion/column/peter-certo-don-t-blame-campus-protesters-for-trying-to-have-their-say/article_8ead28f3-6bd2-52c4-87e9-2a5f2c0afe39.html", "domain": "pantagraph.com", "domain_classification": "Unknown", "message": "Yet a few short years later, campus protests such as these became detested by right-wing politicians, who produced countless diatribes against “woke mobs” and the “free speech crisis” on campus.\nThen they launched a war on campus speech and beyond.\nConsider the recent campus protests against Israel’s war on Gaza and U.S. support for it.\nConservative politicians who’d thrown fits over free speech on campus cheered as police officers roughed up and arrested student protesters.\nSimilarly, when the Supreme Court rules that cash payments are “free speech,” those of us with less cash have less free speech.", "location": "campus", "classification": "antisemitism", "score": 0.7194462393185032, "event_breakdown": "The map will be updated on a regular basis.\n1. Event: On Saturday, a group of Jewish diners were attacked by a pro-Palestinian group in Los Angeles.\n2. Event: Pro-Israel and pro-Palestine protesters clashed at an anti-Israel demonstration in New York City.\n3. Event: A Jewish man was violently assaulted and his car vandalized by a group of pro-Palestinian attackers in London.\n4. Event: A synagogue in Lyon, France was vandalized with anti-Semitic graffiti and swastikas.\n5. Event: A Jewish man was attacked by a pro-Palestinian attacker in Berlin."}]