[{"id": "a14dd7e7-35d9-41f0-8898-260bc2c09fcf", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://us.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "KHARKIV", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Russia accuses Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk, leaving at least 25 dead. Kherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion."}, {"id": "da69fd2e-1351-4721-bf66-316c663283c2", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "SADOVE", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Russia accuses Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead."}, {"id": "33a9af34-87ea-43f1-9ec1-d77c1bc47e2e", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://www.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Location: Russia vs Ukraine - Kherson Region\nOn Friday, Russian forces claimed that Ukraine shelled the Russian-occupied Kherson and Luhansk, leaving at least 25 person dead, including 9-year-old child. Russia occupied Kherson and Luhansk in 2022."}, {"id": "c6bf0b05-9793-4c27-95a1-501abc3d6221", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 17:00", "url": "https://krdo.com/news/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Reported Current Events of Security:\n- Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead."}, {"id": "42431a1d-42f6-4009-9674-c8ce5a346b06", "title": "The US Military Confidence in Smart Bombs May Have a Fatal Flaw", "date": "2024-06-08 11:00", "url": "https://www.businessinsider.com/us-military-confidence-smart-bombs-may-have-a-fatal-flaw-2024-6", "message": "Or, \"the incongruence between precision strike theory and the fervent enthusiasm of precision ideologues,\" he wrote in an essay for the Royal United Services Institute, a British think tank.\nRelated storiesBut most significantly, Fox questions the essence of US precision warfare: the belief that smart bombs spare a need for boots on the ground.\n\"If precision strikes are often accurate, but ineffective, and additional strikes or land operations are required to create the effect intended with the initial precision strikes, then precision strategies do not decrease civilian casualties and collateral damage in conflict zones.\"\n\"The inconvenient truth about war is that it still requires a land force to defeat a land force.\nPrecision warfare, which isn't really a thing, augments a land force in defeating another land force.", "location": "Afghanistan", "classification": "security", "score": 0.44682917528052185, "event_breakdown": "There have been several recent incidents of security reported in the media that can be placed on a map. In Iraq, there have been numerous explosions and attacks against civilians and government forces, as well as ongoing protests against corruption and poor governance. In Afghanistan, there have been attacks against government forces, and the Taliban continue to gain control over parts of the country. In Nigeria, there have been attacks against civilians by Boko Haram, and government forces continue to fight against the terrorist group."}, {"id": "43bef59c-a1f4-4136-a507-67be1659a386", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 15:45", "url": "https://kesq.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "KAREN, UKRAINE", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Reported events:\n- Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead."}, {"id": "872e23ca-3726-4672-854c-7b87c218cc8e", "title": "What we know about Israel deadly strike on UN school complex in Gaza strip | World News", "date": "2024-06-08 14:45", "url": "https://indianexpress.com/article/world/israel-strike-on-un-school-gaza-strip-9380268/", "message": "A day after Israeli forces bombed a United Nations school complex in central Gaza Strip that had become a shelter for displaced Palestinians, some of the facts remain unclear or under contention.\nThe multistory building was one of several that made up the UNRWA Nuseirat Boys’ Preparatory School.\nIt was one of the many schools in Gaza run by UNRWA, the main UN agency for Palestinian refugees and their descendants.\nIn taking aim at Hamas, Israel regularly kills civilians and is accused — even by its allies — of using excessive, indiscriminate force.\nThe Israeli military maintains the airstrike was planned and carried out with care and precision, targeting only the three rooms in the school used by militants.", "location": "Gaza", "classification": "security", "score": 0.9634793787947954, "event_breakdown": "Israeli military strikes Gaza school used as shelter, kills at least 15 civilians\nIsraeli forces bomb a United Nations school complex in central Gaza Strip that had become a shelter for displaced Palestinians."}, {"id": "3a0da919-bc46-449e-938f-1384a32b092d", "title": "Israeli airstrike kills two in Lebanon", "date": "2024-06-08 23:45", "url": "https://www.gulf-times.com/article/684436/international/israeli-airstrike-kills-two-in-lebanon", "message": "Two people were killed on Saturday in an Israeli airstrike on the outskirts of the southern Lebanese town of Aitaroun, Lebanon’s state news agency NNA said.The Israeli military said in a statement that its soldiers had identified a Hezbollah fighter in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.Israeli forces launched two missiles targeting a cafe at a petrol station, causing significant damage to the premises and to the surrounding area, NNA said.Lebanese armed group Hezbollah said its fighters retaliated by firing rockets on Malkia, in northern Israel, followed by a salvo of missiles at a military command centre in northern Israel using the Falaq 2 rockets.\nA security source told Reuters it was the first time the group used that model of rockets, having used the Falaq 1 previously.Israel Defence Forces (IDF) “identified a Hezbollah fighter in the area of Aitaroun in southern Lebanon, and shortly afterward an IAF aircraft struck the fighter,” the Israeli military said in a statement.\nThe IDF said on Saturday jets had also struck infrastructure in the area of the town of Khiam after tanks had earlier fired at a Hezbollah military structure in the Kfarkela area.\nThe conflict between Lebanon’s Hezbollah and Israel, which has been fought in parallel to the Gaza war, has intensified in recent days, adding to concerns that an even wider confrontation could break out between the heavily armed adversaries.", "location": "Aitaroun, southern Lebanon", "classification": "security", "score": 0.9750919498731787, "event_breakdown": "Two people were killed in an Israeli airstrike on the outskirts of southern Lebanon's Aitaroun on Saturday, NNA said. The Israeli military targeted a Hezbollah fighter."}, {"id": "e93b294e-9989-4f42-93e0-ecb52239231a", "title": "Russia blames US for deaths on its soil - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838528/russia-blames-us-for-deaths-on-its-soil", "message": "ST PETERSBURG: Russia accused Ukraine on Friday of ‘using US-supplied rockets’ to kill women and children, in a region of southern Russia and added that “Washington is to blame”.\nThis is the first time Russia has stated that it holds the United States responsible for civilian deaths on its own soil.\nThis accusation follows warnings by President Vladimir Putin that the West is playing with fire and risking a global conflict by letting Ukraine fire Western-supplied weaponry into Russia.\nShe alleged this was ‘shortly’ after the United States ‘agreed for the first time’ to let Ukraine fire US-supplied weapons into Russia.\nThe eastern Lugansk border region is almost entirely under the control of Moscow, which has claimed its full annexation.", "location": "Southern Russia", "classification": "security", "score": 0.4657254005431114, "event_breakdown": "Target Event:\nRussia accuses Ukraine of using US-supplied rockets to attack women and children, and killing civilians, in the Russia-controlled eastern Lugansk border region."}, {"id": "1da3ceb1-59e0-4dfd-8a7d-398af3900e67", "title": "4 killed , 5 injured in Israeli airstrikes in S . Lebanon", "date": "2024-06-08 22:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/09/content_117244092.htm", "message": "You are here:视频播放位置 下载安装Flash播放器BEIRUT, June 8 (Xinhua) -- Four people, including two Hezbollah members, were killed, and five others were injured on Saturday in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told Xinhua.\nThe sources, who spoke anonymously, said that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter's announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9973760056141063, "event_breakdown": "Four people, including two Hezbollah members, were killed, and five others were injured on Saturday in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told Xinhua.\nThe sources, who spoke anonymously, said that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter's announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "670fcae3-e234-4951-8d30-526765e81af1", "title": "Media : Explosions reported across occupied Crimea", "date": "2024-06-08 02:45", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-012654335.html", "message": "Explosions were heard across Sevastopol in occupied Crimea overnight on June 8, the Telegram channel Crimean Wind reported.\nAt around 1:39 a.m. local time, residents of Balaklava, a settlement in the city of Sevastopol, reportedly heard explosions.\nThe Russian proxy leader in Sevastopol in occupied Crimea, Mikhail Razvozhayev, later claimed that the \"loud sounds\" residents heard in the Striletska Bay were the Russian forces destroying an \"unmanned boat.\"\nThe Crimean Wind alleged that residents of Sevastopol had their windows blown out by the explosion in the coastal area.\nEarlier this week, Ukraine's military carried out a naval strike in occupied Crimea overnight on June 6, destroying a Project 498 \"Saturn\" raiding tugboat.", "location": "Sevastopol", "classification": "security", "score": 0.9042780907421489, "event_breakdown": "Target event:\nExplosions heard in Sevastopol, occupied Crimea (blast occurred at around 1:39 a.m. local time on June 8)."}, {"id": "5bf33bca-fa6f-4031-8bb2-d79dfc68e2ec", "title": "Ukraine stabilizes the north after surprise Russian push – but faces fresh pressure in the east", "date": "2024-06-08 17:30", "url": "https://www.cnn.com/2024/06/08/europe/ukraine-stabilizes-north-pressure-east-russia-intl/", "message": "For much of the war, Ukraine has been constrained when it comes to using powerful Western weapons against Russia.\nKostiantyn Liberov/Libkos/Getty ImagesNortheast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nBut “most of the city is under the control of the Ukrainian Defense Forces” Voloshyn told CNN.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February.\nWestern weapons and a new push to draft more soldiers in to the Ukrainian military could give Ukraine the boost it needs.", "location": "Kharkiv", "classification": "security", "score": 0.7594774760509259, "event_breakdown": "Northeast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February."}, {"id": "89f95fc9-5e42-46d1-82d0-1ed97c06ecf0", "title": "Death toll from Israeli attack on central Gaza jumps to 210", "date": "2024-06-08 19:30", "url": "https://saudigazette.com.sa/article/643427/World/Death-toll-from-Israeli-attack-on-central-Gaza-jumps-to-210", "message": "GAZA — The death toll from the Israeli bombing on Saturday of the Nuseirat refugee camp in central Gaza has risen to 210, the Government Media Office in the besieged Palestinian enclave said.\n“Some 210 martyrs and more than 400 injured were brought to Al-Aqsa Hospital due to the brutal Israeli massacre in the Nuseirat camp,” the office said in a statement.\n“Al-Aqsa Martyrs Hospital is unable to accommodate the number of martyrs and injured due to the Israeli bombardment,” warned the Gaza media office.\nWitnesses also reported that Israeli vehicles advanced near the Gaza Valley on Salah al-Din Road in the central Gaza Strip.\nMeanwhile, the Israeli army confirmed on Saturday launching a “large-scale and unprecedented attack” on the Nuseirat camp and other areas in the central Gaza Strip.", "location": ".\nGAZA", "classification": "security", "score": 0.9715331249602638, "event_breakdown": "Gaza Strip"}, {"id": "504d43d2-db6e-4f70-9660-a6d6007d1a9a", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://abc17news.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "KHERSON", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Reported Security Events:\n- Russia accuses Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk, leaving at least 25 dead.\n- Twenty-two people were killed, including a 9-year-old child, in the shelling of the small town of Sadove in the Kherson region by the Ukrainian forces."}, {"id": "188caee9-87dd-43e3-9966-1b8ff3363ce9", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 12:00", "url": "https://keyt.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24.", "location": "Ukraine", "classification": "security", "score": 0.9250960888577822, "event_breakdown": "Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead."}, {"id": "665ebaf8-727d-4308-93e5-8084d08cc9f7", "title": "Israel bombs another UN - run school in Gaza , a day after strike on school killed 33", "date": "2024-06-08 09:15", "url": "https://www.independent.ie/world-news/middle-east/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/a1631676334.html", "message": "Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza StripAn Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza's center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nThe Associated Press could not verify the claims.", "location": "GAZA (Palestinian Territories)", "classification": "security", "score": 0.9661314260994422, "event_breakdown": "Location: Gaza refugee camp\nEvent: An Israeli airstrike hit a U.N.-run school compound\nDate: 2022-01-28\nTarget: United Nations school\nHamas militants were operating from within the schools.\n??\nEvent: Israel bombing\nLocation: Gaza Strip\nDate: 2022-01-27\nTarget: school refugee camp\nAn Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza's center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools."}, {"id": "98b4145c-2b8f-4061-abde-3d20821169b2", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 10:15", "url": "https://economictimes.indiatimes.com/news/defence/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say/articleshow/110818261.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelUkraine - Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left at least 27 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.A Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nPasechnik also said 60 people were wounded in the attack.Ukraine did not comment on either assault.Meanwhile, drone attacks between Russia and Ukraine persisted.Ukraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defense Ministry said Saturday.\nSergei Menyailo reported three downed drones over the region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings.", "location": "Sadove, Kherson region, Ukraine", "classification": "security", "score": 0.7940160189795483, "event_breakdown": "Ukraine - Russian-installed authorities in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left at least 27 people dead on Friday and overnight into Saturday. A Ukrainian attack in Sadove on Friday killed 22 and wounded 15 people. Moscow-backed governor Vladimir Saldo said Ukrainian forces first struck the town with a French-made guided bomb and then attacked again with a U.S.-supplied HIMARS missile.\n\nRussia - Ukraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defense Ministry said Saturday. Russian Col. Sergei Menyailo reported three downed drones over the region."}, {"id": "253fe3c9-ca09-47ff-9c2b-d9fe5231d058", "title": "Intensifying Conflict : Israeli Airstrike Kills Two in Lebanese Town", "date": "2024-06-08 17:30", "url": "https://www.devdiscourse.com/article/law-order/2976290-intensifying-conflict-israeli-airstrike-kills-two-in-lebanese-town", "message": "Two people were killed on Saturday in an Israeli airstrike on the outskirts of the southern Lebanese town of Aitaroun, Lebanon's state-owned National News Agency (NNA) reported on Saturday.\nThe Israeli military said in a statement that its soldiers had identified a Hezbollah militant in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.\nThe NNA report said the Israeli forces had launched two missiles targeting a cafe at a petrol station, causing significant damage to the premises and to the surrounding area.\nHezbollah said on Saturday its fighters had retaliated by firing rockets on Malkia in northern Israel.\nHezbollah, a Hamas ally, says its attacks aim to support Palestinians under Israeli bombardment in Gaza.", "location": "AITAYOUN, LEBANON", "classification": "security", "score": 0.9745384483776673, "event_breakdown": "Event 1: Two people were killed on Saturday in an Israeli airstrike on the outskirts of the southern Lebanese town of Aitaroun.\nEvent 2: The Israeli military said in a statement that its aircraft had carried out an airstrike that hit an individual near the southern Lebanese town of Aitaroun.\nEvent 3: Hezbollah said its fighters had fired rockets on Malkia, a town in northern Israel."}, {"id": "46f8f311-46ff-4379-a62f-92fe531b64d5", "title": "Russia says 22 civilians killed by Ukrainian shelling", "date": "2024-06-08 10:15", "url": "http://global.chinadaily.com.cn/a/202406/08/WS6663f47aa31082fc043cb991.html", "message": "Xinhua | Updated: 2024-06-08 14:04Photo taken on July 24, 2022 shows the view of a harbor in the Kherson region.\n[Photo/Xinhua]MOSCOW -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.", "location": "KHARKIV or KHARKIV, Ukraine", "classification": "security", "score": 0.7236896661115336, "event_breakdown": "Target event: The news of Ukrainian forces bombing a store in Russia's Kherson region and the killing of 22 civilians."}, {"id": "53abadb2-5f59-4877-8826-d5aa4a2ab4a5", "title": "Israeli Forces Batter Central , South Gaza as Tanks Advance in Rafah", "date": "2024-06-08 11:15", "url": "https://en.tempo.co/read/1877483/israeli-forces-batter-central-south-gaza-as-tanks-advance-in-rafah", "message": "Gaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\n\"I think the occupation forces are trying to reach the beach area of Rafah.\nIn the larger city of Khan Younis just to the north of Rafah, an Israeli airstrike on the house killed eight people and wounded several, including children, medics said.\nIn north Gaza, three Palestinians were killed in an Israeli airstrike on a Gaza City school building that was sheltering displaced families, rescue workers said.", "location": "The main event is in Rafah.", "classification": "security", "score": 0.9825229663504368, "event_breakdown": "Israeli airstrike on a Gaza City school building - A Gaza City school building that was sheltering displaced families was hit by an airstrike, killing three Palestinians. Israeli airstrike on a house - A strike by Israel on a house in the northeastern town of Al-Zahra killed at least 16 people, according to Palestinian health officials."}, {"id": "a5a1931f-76e6-4ff0-9496-38f27fe66508", "title": "Blinken to head back to Middle East on Sunday", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240607-voa02.htm", "message": "Blinken to head back to Middle East on SundayBy VOA News June 07, 2024U.S. Secretary of State Antony Blinken is heading back to the Middle East on Sunday in hopes of persuading Israel and Hamas militants to accept a cease-fire agreement designed to halt the fighting, release hostages and get more humanitarian aid into the war-torn Gaza Strip.\nIn northern Gaza, Palestinian emergency workers said three people were killed when an Israeli airstrike hit a U.N.-run school.\nThe Israeli military said it was targeting Hamas gunmen operating from inside the school.\nIsrael used the same explanation Thursday after an airstrike on a school operated by the U.N. relief agency UNRWA in the central Gaza Nuseirat refugee camp.\nHamas is holding about 120 of the hostages in Gaza, although the Israeli military says at least 37 of them are dead.", "location": "GAZA", "classification": "security", "score": 0.883479788018162, "event_breakdown": "[\n\"U.S. Secretary of State Antony Blinken is headed back to the Middle East on Sunday in hopes of persuading Israel and Hamas militants to accept a cease-fire agreement designed to halt the fighting, release hostages and get more humanitarian aid into the war-torn Gaza Strip.\",\n\"In northern Gaza, Palestinian emergency workers said three people were killed when an Israeli airstrike hit a U.N.-run school.\",\n\"The Israeli military said it was targeting Hamas gunmen operating from inside the school.\",\n\"Israel used the same explanation Thursday after an airstrike on a school operated by the U.N. relief agency UNRWA in the central Gaza Nuseirat refugee camp.\",\n\"Hamas is holding about 120 of the hostages in Gaza, although the Israeli military says at least 37 of them are dead.\"\n]"}, {"id": "48569bb3-8337-4ea8-8d26-c92a0a86758e", "title": "Israel defends targeting UNRWA school after dozens killed", "date": "2024-06-08 00:00", "url": "https://www.thejc.com/news/israel/israel-defends-targeting-unrwa-school-after-dozens-killed-mxsxcryr", "message": "Dozens of civilians have reportedly been killed after Israel launched an air strike against a school that it claimed terrorists were hiding in.\nThe strike hit al-Sardi school, which is run by the Unrwa Palestinian refugee agency, in the early hours of Thursday morning.\nUS State Department spokesperson Matthew Miller said he had seen reports that 14 children had been killed in the blast.\nIn a statement, the IDF said they had carried out a \"precise strike on a Hamas compound embedded inside\" the school.\nThe ones there are children, playing.”Sam Rose, the director of planning for Unrwa, told The Guardian he was not surprised to see an IDF strike cause civilian causalities.", "location": ")\nGaza city", "classification": "security", "score": 0.8240139895115959, "event_breakdown": "IDF airstrike on school in Gaza, 14 children killed\nAl-Sardi School hit by IDF airstrike, run by Unrwa Palestinian refugee agency"}, {"id": "53ff428d-cf4c-4b68-a6f8-1685957f29b0", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead Moscow - backed officials say", "date": "2024-06-08 12:45", "url": "https://www.theweek.in/wire-updates/international/2024/06/08/fgn29-russia-ukraine-ld-war.html", "message": "Kyiv, Jun 8 (AP) Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defence Ministry said Saturday.\nTwenty-five drones were reportedly destroyed over Russia's southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings.", "location": "KYIV", "classification": "security", "score": 0.7660474367654728, "event_breakdown": "Title: Drone attacks leave 28 dead in Ukraine's Kherson and Luhansk regions\nDescription: Russia has reported that overnight Friday into Saturday, the Ukrainian attack killed 28 and wounded 30 people in Russia's southern Kuban and Astrakhan regions, western Tula region, and the Moscow-annexed Crimean peninsula."}, {"id": "f063a035-e81c-45bb-8fec-07d65c6a8a00", "title": "Russia - Installed Governor Claims 22 Killed In  Double Tap  Attack In Kherson Region", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-rferl06.htm", "message": "Russia-Installed Governor Claims 22 Killed In 'Double Tap' Attack In Kherson RegionBy RFE/RL's Russian Service and RFE/RL's Ukrainian Service June 07, 2024The Russia-installed governor of the Kherson region in southern Ukraine said 22 people were killed and 15 were injured in the town of Sadove in shelling by Ukrainian forces.\nSaldo said a shop packed with customers and employees was hit in Sadove, a town south of the city of Kherson.\nHe said Ukrainian forces had \"deliberately made a repeat strike to create greater numbers of casualties.\"\nThe same so-called \"double tap\" tactic has been used by Russian forces against Ukraine, including in April in Kharkiv, killing three rescue workers who responded to the first attack.\nIts military said earlier that its forces shot down all five missiles and 48 out of 53 drones over nine regions during Russia's overnight attack.", "location": "KHERSON", "classification": "security", "score": 0.9687017794032544, "event_breakdown": "Russia-Installed Governor Claims 22 Killed In 'Double Tap' Attack In Kherson Region\nRussian Forces Shell Residential Areas in Donetsk, Killing at Least 5\nIsraeli Military Says It Thwarted a Major Cyberattack Against the country\nIslamic State Claims Responsibility for Deadly Suicide Bombing in Baghdad\nUkraine's Military: Russian Forces Shelled a Chemical Plant in Sumy Region\nRussia-Installed Governor Claims 22 Killed In 'Double Tap' Attack In Kherson Region"}, {"id": "38c7588d-a451-468b-bd9e-929cc38f2401", "title": "Israeli forces batter Gaza as tanks advance in Rafah - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838536/israeli-forces-batter-gaza-as-tanks-advance-in-rafah", "message": "CAIRO: With a renewed ceasefire push stalled, Israel bombarded central and southern areas of Gaza Strip again on Friday, killing 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nGaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said 15 people died overnight in Israeli bombardment.\nIn northern Gaza, three Palestinians were killed in an Israeli air strike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nHamas said on Friday its fighters shelled militants in the central city of Deir al-Balah shelled a house where Israeli troops were barricaded, killing some and wounding others.", "location": "GAZA CITY", "classification": "security", "score": 0.9931787518428623, "event_breakdown": "Israel bombards central and southern areas of the Gaza Strip, killing 28 Palestinians. Tank forces advance to the western edges of Rafah."}, {"id": "83576f89-b781-4081-baa0-808519307995", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 12:15", "url": "https://www.kob.com/news/us-and-world-news/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in the Kherson region killed 22 and wounded 15 people, Moscow-appointed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "Kyiv", "classification": "security", "score": 0.705543644766756, "event_breakdown": "KYIV, Ukraine (AP) — Russia-installed officials in the Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continue to exchange drone attacks into Saturday."}, {"id": "5491059c-52d3-42b3-a99f-6a2920bc3ea3", "title": "Abbas calls for emergency UNSC session on  bloody massacre  as Israeli strikes kill 210 Palestinians", "date": "2024-06-08 18:15", "url": "https://www.pakistantoday.com.pk/2024/06/08/abbas-calls-for-emergency-unsc-session-on-bloody-massacre-as-israeli-strikes-kill-210-palestinians/", "message": "GAZA: Palestinian President Mahmoud Abbas late Saturday night called for an emergency UN Security Council session on what he called “the bloody massacre that was carried out by the Israeli forces” at the al-Nuseirat refugee camp in central Gaza, Reuters reports quoting the WAFA news agency.\nAccording to medical sources, 15 civilians, including children and women, were killed and others wounded in an Israeli occupation’s bombing of the central Governorate, especially the Nuseirat camp.\nIn Bureij refugee camp, six civilians were killed and others were wounded in an Israeli airstrike targeting a house.\nFor about an hour, intense artillery shelling has continued on the Al-Zaytoun and Tal Al-Hawa neighbourhoods in Gaza City, and the Nuseirat, Al-Maghazi, and Al-Bureij camps in the central Gaza Strip.\nHamas military spokesman says Israeli army killed captives in Nuseirat operation", "location": "Based on the text, the main location where the main event takes place is 'Nuseirat refugee camp in central", "classification": "security", "score": 0.9852604462348327, "event_breakdown": "Israeli Occupation Forces bomb Al-Nuseirat refugee camp in central Gaza, killing six civilians and leaving others wounded."}, {"id": "c39b6da3-faa9-46fe-855e-dd6eee88ebc9", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 13:45", "url": "https://isp.netscape.com/news/world/story/0001/20240608/aa5de3171da1126d0ae2a0dd59d419dc", "message": "Attacks in Russian-occupied Ukrainian regions leave 28 dead, Moscow-appointed officials sayKYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "None.", "classification": "security", "score": 0.7720289822583231, "event_breakdown": "Target event - a drone attack on Russia-occupied Ukrainian cities\nAdditional event - an attempt on the life of a former Ukrainian mayor\nUkrainian officials reported on Saturday that two drone attacks were launched overnight into Saturday against Russia-occupied Ukrainian regions. In Kherson, the drone attack, which lasted for 40 minutes, killed 28 people and injured 12, according to the reports."}, {"id": "95f67e54-3986-47b3-a86b-f5a22b38f7e1", "title": "Israeli strikes spark fires in Lebanon , leave 2 dead , state media reports", "date": "2024-06-08 22:00", "url": "https://www.voanews.com/a/israeli-strikes-spark-fires-in-lebanon-leave-2-dead-state-media-reports-/7648301.html", "message": "Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe Shiite Muslim movement later announced that one of its fighters was killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\nLebanese authorities and several international rights groups have accused Israel of using white phosphorus rounds in its strikes on its northern neighbor.", "location": "Southern Lebanon", "classification": "security", "score": 0.8969531749943463, "event_breakdown": "Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said. The deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border. The Shiite Muslim movement later announced that one of its fighters was killed by Israeli fire. The Israeli army said Saturday that 63 rockets were fired from Lebanon into Israel, of which 10 were intercepted by the Iron Dome defense system. On the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army. Lebanese authorities and several international rights groups have accused Israel of using white phosphorus rounds in its strikes on its northern neighbor."}, {"id": "302dd712-fb9c-4e91-a5c2-96e6639f8c0b", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead Moscow - appointed officials say", "date": "2024-06-08 18:45", "url": "https://www.theweek.in/wire-updates/international/2024/06/08/fgn45-russia-ukraine-2ndld-war.html", "message": "Kyiv (Ukraine), Jun 8 (AP) Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\nTwenty-five drones were reportedly destroyed over Russia's southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nDnipropetrovsk regional Gov Serhiy Lysak said the overnight drone attack damaged commercial and residential buildings.", "location": "Kyiv (Ukraine)", "classification": "security", "score": 0.9343366409160854, "event_breakdown": "28 people killed in Russian attacks\nKherson and Luhansk, two recently attacked Ukrainian regions, have seen at least 28 people killed during Russia's overnight drone attacks on Saturday and Sunday. This was first reported by Tass, a Russian news agency, and the Russian occupation officials."}, {"id": "f49a6e0d-5b91-4a45-aab9-07f96aa6bb1e", "title": "Dnipropetrovsk oblast rocked by Russian artillery and drone strikes", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/dnipropetrovsk-oblast-rocked-russian-artillery-080500586.html", "message": "The Russian army targeted the Nikopol district of Dnipropetrovsk Oblast with drones and artillery during an overnight attack, killing one man in the shelling, regional governor Serhiy Lysak reported on Telegram on June 8.\nNot only did the shelling claim a life, but it also left a swath of destruction.\nSerhiy Lysak/TelegramSerhiy Lysak/TelegramSerhiy Lysak/TelegramLysak further reported that the shelling disrupted power lines, and authorities are still assessing the full extent of the damage.\nRead also: Four passengers injured after Russians target bus of Ukrainian civilians in NikopolWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine", "location": "NIKOPOL", "classification": "security", "score": 0.9586579011234889, "event_breakdown": "The Russian army targeted the Nikopol district of Dnipropetrovsk Oblast with drones and artillery during an overnight attack, killing one man in the shelling.The shelling disrupted power lines, and authorities are still assessing the full extent of the damage."}, {"id": "c5df97d8-277f-4f77-96c0-2ee8c207a354", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 16:30", "url": "https://www.mprnews.org/story/2024/06/08/attacks-in-russianoccupied-ukrainian-regions-leave-28-dead-moscowbacked-officials-say", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nFurther east, Leonid Pasechnik, the Russia-installed governor in Ukraine’s partially occupied Luhansk region, said Saturday that two more bodies had been pulled from the rubble following Friday's Ukrainian missile attack on the regional capital, also called Luhansk.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nOn Saturday morning, officials said air defenses for the first time shot down Ukrainian drones over the North Ossetia region in the North Caucasus, some 560 miles east of the front line in Ukraine’s partially occupied Zaporizhzhia region.", "location": "Luhansk", "classification": "security", "score": 0.8427607429552872, "event_breakdown": "Target event:\nRussia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Friday that Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday."}, {"id": "f627d978-6b8b-45f2-90b4-f31c8ece6696", "title": "Ukraine stabilizes the north after surprise Russian push – but faces fresh pressure in the east - LocalNews8 . com", "date": "2024-06-08 20:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/08/ukraine-stabilizes-the-north-after-surprise-russian-push-but-faces-fresh-pressure-in-the-east/", "message": "For much of the war, Ukraine has been constrained when it comes to using powerful Western weapons against Russia.\nNortheast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nBut “most of the city is under the control of the Ukrainian Defense Forces” Voloshyn told CNN.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February.\nWestern weapons and a new push to draft more soldiers in to the Ukrainian military could give Ukraine the boost it needs.", "location": "Kharkiv", "classification": "security", "score": 0.7594774760509259, "event_breakdown": "Northeast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk, while Ukrainian forces control most of the city. Further south along the eastern front line, Russians have made advances to the west of the city of Avdiivka, which fell to Russian forces in February. Western weapons and a new push to draft more soldiers into the Ukrainian military may give Ukraine the boost it needs."}, {"id": "d3da9d98-33aa-422a-bef9-d885c3cab201", "title": "Israel pounds Gaza refugee camp as war enters 9th month", "date": "2024-06-08 00:30", "url": "https://www.omanobserver.om/article/1154798/world/region/israel-pounds-gaza-refugee-camp-as-war-enters-9th-month", "message": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl Aqsa Martyrs hospital in Deir al Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nThe Israeli military said its fighter jets killed nine \"fighters\" in three classrooms where about 30 militants from Hamas and IJ were hiding.\nWitnesses also reported Israeli strikes east of Deir al Balah and intensive fire from army vehicles near the Bureij camp, where a blaze was raging.\nThe Israeli military said it \"eliminated dozens of fighters\" in eastern Bureij and Deir al Balah.", "location": "GAZA STRIP", "classification": "security", "score": 0.9908705378058218, "event_breakdown": "Israeli military bombarded a Gaza refugee camp, according to BBC news. At least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp, sources said to BBC. The military said it killed \"dozens of fighters\" in eastern Bureij and Deir al Balah on Friday."}, {"id": "720e3067-ba8c-4da7-8b1d-4093e1bbfd21", "title": "Puntland Security Force captures two ISIS fighters surviving US airstrike", "date": "2024-06-08 10:15", "url": "https://www.hiiraanweyn.net/2024/06/08/puntland-security-force-captures-two-isis-fighters-surviving-us-airstrike/", "message": "Sabti 8 June 2024 {HMC} The Puntland Security Force {PSF} has apprehended two ISIS foreign nationals who they said survived last week’s US airstrike in northeastern Somalia.\nAccording to a statement from the PSF on Saturday, the men identified as Imraan Mohamed Alawi and Mabruuk Nassor Saidi are from Tanzania.\nThe security forces arrested the men 30 km away from the area where the bombing took place, following a tip-off and subsequent pursuit by the PSF.\nadvertisementsA joint airstrike carried out by Somali and U.S. forces killed three Islamic State {IS}-Somalia fighters in a remote area near Dhaardaar, about 81 km southeast of Bosaso, last week.\nThe so-called IS wing in Somalia has its main base in the Puntland region, northeastern Somalia, and has occasionally clashed with Puntland forces and al-Shabab militants.", "location": "Northeastern Somalia", "classification": "security", "score": 0.9314591540498476, "event_breakdown": "LOCATIONS:\nThe US airstrike reported took place near Dhaardaar, about 81 km southeast of Bosaso, in southeastern Somalia.\nPSF apprehended two ISIS foreign nationals who survived the airstrike happened last week in northeastern Somalia."}, {"id": "f33e734c-c186-4c46-a639-5fd20fc3306f", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead", "date": "2024-06-08 23:45", "url": "https://japantoday.com/category/world/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say", "message": "By SUSIE BLANN and ELISE MORTONRussia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "KHARKIV", "classification": "security", "score": 0.6911390245760545, "event_breakdown": "Target Event:\nOn Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region."}, {"id": "f25fd5d1-afcd-4243-a56f-f873b8b412f7", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:30", "url": "https://www.theguardian.com/world/article/2024/jun/08/under-a-drone-filled-sky-ukraine-tries-to-retake-a-town-one-house-at-a-time", "message": "(57th Separate Motorised Infantry Brigade/Ukraine army) Drone footage shows Russian troops in the town of Vovchansk.\n(57th Separate Motorised Infantry Brigade/Ukraine army)A brutal battle has raged ever since.\n(57th Separate Motorised Infantry Brigade/Ukraine army) The town of Vovchansk has been reduced to rubble after a month of heavy fighting.\n(57th Separate Motorised Infantry Brigade/Ukraine army)As well as Vovchansk, Russia has advanced towards the village of Lyptsi.\n(57th Separate Motorised Infantry Brigade/Ukraine army)Villagers living in the nearby countryside have also escaped.", "location": "Vovchansk", "classification": "security", "score": 0.8623602325656041, "event_breakdown": "* Russian troops in the town of Vovchansk, Ukraine\n* Heavy fighting in the town of Vovchansk, Ukraine\n* Russian advance towards the village of Lyptsi, Ukraine\n* Escape of villagers in the countryside near Lyptyi, Ukraine"}, {"id": "65e07926-1e1e-4954-9963-ce6db1aeb0b5", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-08 17:00", "url": "https://www.local10.com/news/2024/06/08/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "The city center is covered with debris after the Russian missile attack in Kharkiv, Ukraine, Saturday, May, 25, 2024.\n(AP Photo/Andrii Marienko)KYIV – Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRecommended VideosRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.", "location": "Kharkiv", "classification": "security", "score": 0.8627472341646059, "event_breakdown": "KYIV, Ukraine (AP) — At least 28 people were killed in the Ukrainian city of Kherson on Saturday by Ukraine’s military, the Russian state news agency RIA reported, citing an official in the region.\n- Mayor Igor Kolykhaiev of Kherson said that Ukrainians had mounted an attack on the city overnight, including hitting residential areas, causing casualties."}, {"id": "f322afea-76ec-49c9-8863-3a6f9544bd84", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:45", "url": "https://www.aol.co.uk/news/under-drone-filled-sky-ukraine-120815524.html", "message": "Photograph: Jędrzej Nowicki/The ObserverThe two Russian soldiers jogged across an apocalyptic landscape.\nThey retreated six months later, going back up the road to the Russian city of Belgorod.\nStreet battles in Vovchansk were so intense that only experienced Ukrainian soldiers were deployed there, rotating among themselves in shifts.\nHe said Russian soldiers kidnapped an unknown number of civilians, using them as a human shields and taking them across the border.\nSoon afterwards, Russian soldiers stormed the building and set up on observation point in a medical department with a tower across the road.", "location": "Vovchansk", "classification": "security", "score": 0.6767230184297294, "event_breakdown": "1. Russian soldiers invaded the city of Vovchansk, Ukraine, leading to street battles and the use of civilians as human shields by Russian forces.\n2. Russian soldiers kidnapped an unknown number of civilians from Vovchansk, Ukraine and transported them across the border to Russia."}, {"id": "b8de3002-156d-4180-9d5e-3e9eae182922", "title": "Israel  disgusted  after being placed on UN list of countries failing to protect children", "date": "2024-06-08 05:00", "url": "https://www.sbs.com.au/news/article/israel-disgusted-after-being-placed-on-un-list-of-countries-failing-to-protect-children/msudim6nz", "message": "Key Points Israel will be included on the UN's annual list of countries it deems to be failing to protect children in war.\nThe upcoming inclusion of Israel on a UN list of countries and armed forces determined to be failing to protect children in war prompted a furious Israeli response Friday.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\nAn Israeli strike on a Gaza school killed as many as 40 people, medics said.\nMore than 36,700 people have been killed in Gaza since 7 October, according to the health ministry in Gaza.", "location": "GAZA", "classification": "security", "score": 0.7701049715278677, "event_breakdown": "Israeli strike kills at least 28 in Gaza, 15 die in Israeli  bombardments 2020\n15 people killed near Gaza's al-Wahda street in Israeli strikes"}, {"id": "6e2937fd-c676-4965-ad29-84d3886ecf80", "title": "Who are the four Israeli hostages freed from Gaza ? ", "date": "2024-06-08 15:45", "url": "https://www.yahoo.com/news/four-israeli-hostages-freed-gaza-133314156.html", "message": "Who are the four Israeli hostages freed from Gaza?\nYakov Argamani, father of Israeli hostage Noa Argamani, 26, speaks to journalists in Tel Aviv on December 16, 2023 (Alberto PIZZOLI)The Israeli military said its troops rescued on Saturday four Israeli hostages alive from Gaza.\nA student at Ben-Gurion University in the southern Israeli city of Beersheba, Argamani \"loves life\", a group of her friends said on social media.\nOrit Meir told reporters in Athens in November that her life had become \"a nightmare.\"\n- Shlomi Ziv, 41 -Shlomi Ziv was part of the security team at the Supernova music festival, according to Israeli media.", "location": "GAZA", "classification": "security", "score": 0.7332645910777619, "event_breakdown": "Hostages freed from Gaza"}, {"id": "7e37a5cb-377d-4e9d-b7d0-73ad350cf81e", "title": "The four hostages freed after 246 days", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/four-hostages-freed-246-days-162500970.html", "message": "The four hostages freed after 245 daysFamilies of Israeli hostages have hailed the rescue of four captives as a “miraculous triumph”.\nAll four were kidnapped by Hamas terrorists at the Supernova music festival on Oct 7 last year.\nNoa ArgamaniNoa Argamani, 26Noa became one of the most high-profile hostages in the immediate aftermath of Oct 7, as the moment of her capture appeared on countless newspaper front pages.\nIn a video that showed her being kidnapped, she screamed “don’t kill me!” as Hamas fighters dragged her away.\nThe last glimpse she had of her son was a Hamas video released shortly after the attack.", "location": "NULL", "classification": "security", "score": 0.8225186192206375, "event_breakdown": "Security Event 1: Four hostages were rescued after 245 days and families have hailed the rescue of four captives as a “miraculous triumph.” Noa Argamani, 26, became one of the most high-profile hostages in the immediate aftermath of Oct 7. In a video that showed her being kidnapped, she screamed “don’t kill me!” as Hamas fighters dragged her away.\nSecurity Event 2: The Israeli Air Force has resumed airstrikes in the Gaza Strip, after a rocket launched from the strip landed in an open area in the Eshkol Regional Council in southern Israel. There was no immediate claim of responsibility for the launch. The IDF Spokesperson’s Office said the launch was “part of the reality of life in Israel”."}, {"id": "1c4d57b3-6e77-419a-8243-79b5cf4c9cf2", "title": "The four hostages freed from Hamas captivity after 246 days", "date": "2024-06-08 17:30", "url": "https://www.telegraph.co.uk/world-news/2024/06/08/four-hostages-freed-from-captivity-after-246-days/", "message": "Families of Israeli hostages have hailed the rescue of four captives as a “miraculous triumph”.\nThey were rescued in a complex special daytime operation in the heart of Nuseirat in central Gaza on Saturday.\nAll four were kidnapped by Hamas terrorists at the Supernova music festival on Oct 7 last year.\nWho are they?", "location": "Gaza", "classification": "security", "score": 0.8796534926087316, "event_breakdown": "The rescue of four Israeli hostages in the Gaza Strip has been reported as a \"miraculous triumph\" for families, who praised the security forces for executing the complex daytime operation. The event happened on Saturday, October 7, 2017, in the heart of Nuseirat in central Gaza. The hostages were abducted by Hamas terrorists at the Supernova music festival."}, {"id": "9ebdec04-501d-4cc7-93b5-e60a79d3f484", "title": "Who are the four Israeli hostages freed from Gaza ? ", "date": "2024-06-08 16:30", "url": "https://www.al-monitor.com/originals/2024/06/who-are-four-israeli-hostages-freed-gaza", "message": "June 8, 2024 — Jerusalem (AFP)The Israeli military said its troops rescued on Saturday four Israeli hostages alive from Gaza.\nThey had been held there since Hamas Palestinian militants captured them on October 7 during their attack on the Supernova music festival in southern Israel, the army said.\nOrit Meir told reporters in Athens in November that her life had become \"a nightmare.\"\n- Andrey Kozlov, 27 -Russian-Israeli Andrey Kozlov was a security guard at the music festival.\n- Shlomi Ziv, 41 -Shlomi Ziv was part of the security team at the Supernova music festival, according to Israeli media.", "location": "The main event takes place at a music festival in southern Israel.", "classification": "security", "score": 0.8874163085023781, "event_breakdown": "Israeli troops rescue Israeli hostages alive in Gaza on June 8, 2024"}, {"id": "2f43c76b-c4a3-44dc-8da9-a048c33a06e8", "title": "Day 246 : 36 , 801 killed , 83 , 680 injured in Gaza", "date": "2024-06-08 14:45", "url": "https://english.almayadeen.net/news/politics/day-246--36-801-killed--83-680-injured-in-gaza", "message": "A new Israeli massacre increases the number of casualties in the Strip, with 70 Palestinians killed and 150 injured in the past 24 hours.\nPalestinians wounded in the Israeli bombardment of the Gaza Strip arrive at al-Aqsa Hospital in Deir al Balah on June 8, 2024.\n(AP)The number of Palestinians killed in Gaza due to the Israeli genocidal war ongoing since October 7 has now reached 36,801, in addition to 83,680 injured, the Ministry of Health in Gaza announced Saturday in its daily report.\nAdditionally, it confirmed that the Israeli occupation forces committed five massacres across different families in the Gaza Strip, killing 70 Palestinians and injuring 150 in the past 24 hours.\nAccording to our correspondent, dozens of Israeli rockets targeted civilian homes in Nuseirat camp.", "location": ".\nGaza", "classification": "security", "score": 0.975847016378136, "event_breakdown": "Gaza City\nWest Bank\nDeir al Balah\nNuseirat camp"}, {"id": "9598f3a4-a3f8-46da-9188-cff38b275357", "title": "Russia Advanced Yasen - M Class Nuclear Submarine Is Headed For Cuba", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/russias-advanced-yasen-m-class-001237490.html", "message": "The Russian Navy frigate Admiral Gorshkov arrives in the port of Havana during a previous visit to Cuba on June 24, 2019.\nThe first-in-class Russian Navy Project 22350 frigate Admiral Gorshkov was sailing in the Caribbean in June 2019.\nLast July, for example, the Russian Navy sent the training class ship Perekop into Havana for a four-day visit.\nMinistry of Defense of RussiaSignificant, too, is the fact that the Kazan and the Admiral Gorshkov are notably modern and capable assets.\nEarlier this week, a senior U.S. official suggested that the current Russian Navy deployment might also include a port call in Venezuela.", "location": "HAVANA", "classification": "security", "score": 0.4128643166183882, "event_breakdown": "The first-in-class Russian Navy Project 22350 frigate Admiral Gorshkov was sailing in the Caribbean."}, {"id": "57c6db9e-2851-43ba-909b-d9ad35e13d48", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 07:45", "url": "https://www.mangalorean.com/22-civilians-killed-by-ukrainian-shelling-russia/", "message": "22 civilians killed by Ukrainian shelling: RussiaMoscow: At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson, region’s Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.", "location": "Russia", "classification": "security", "score": 0.7678640555678427, "event_breakdown": "Target Event:\nAt least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region, Vladimir Saldo, the region’s Governor, said on Friday."}, {"id": "a1f18643-ab07-4894-8b6e-ceddfd8c4bee", "title": "Reports Surface Of New Version Of Russian Kh - 101 Cruise Missile With Cluster Warhead", "date": "2024-06-08 14:00", "url": "https://theaviationist.com/2024/06/08/kh-101-cluster-warhead/", "message": "Pictures and media reports from Ukraine claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nRussia has reportedly introduced another modification to the Kh-101 ALCM (X-101 Air-Launched Cruise Missile), after variants releasing decoys to divert SAM (Surface-to-Air Missiles) and dual/tandem warheads.\nPictures and media reports claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nMainstay Russian Air-Launched Cruise MissileKh-101 is a strategic cruise missile that is designed with LO (Low Observable features).\nAssuming it is the Kh-101 missile and the claim about the cluster warhead is true, it is likely the Russians might have to compromise on range to accommodate it.", "location": "Ukraine", "classification": "security", "score": 0.648662780021657, "event_breakdown": "Target event not found"}, {"id": "2972962c-ad66-4c28-831d-3988e575b3f6", "title": "Palestinians report 50 killed in Israeli assault as Israel rescues four hostages in Gaza", "date": "2024-06-08 15:00", "url": "https://tribune.com.pk/story/2470461/palestinians-report-50-killed-in-israeli-assault-as-israel-rescues-four-hostages-in-gaza", "message": "Almog Meir Jan, a released hostage reacts, after the military said that Israeli forces have rescued four hostages, in Ramat Gan, Israel June 8, 2024.\nThe Israeli military named the rescued hostages as Noa Argamani, 25, Almog Meir Jan, 21, Andrey Kozlov, 27, and Shlomi Ziv, 40.\nThere are 116 now left in Gaza, according to Israeli tallies, including at least 40 whom Israeli authorities have declared dead.\nThe Israeli military had said earlier on Saturday it was targeting resistance infrastructure in al-Nuseirat, an unusual announcement because it does not normally report on its operations while they are still underway.\nGaza's health ministry meanwhile reported on Saturday that Israeli military assaults in al-Nuseirat had killed and wounded dozens of people including women and children.", "location": "Ramat Gan", "classification": "security", "score": 0.9366505231510884, "event_breakdown": "Israeli soldiers patrol near the Israel-Gaza border on Friday. The Israeli military says it has rescued four hostages being held in the Gaza Strip. The military announced on Saturday that it had launched an operation the previous night in al-Nuseirat to strike resistance infrastructure."}, {"id": "bf65ee1f-6d5e-4197-9a8b-8610d0b747a5", "title": "Funeral , procession honors 3 - year - old North Olmsted boy murdered at Giant Eagle", "date": "2024-06-08 13:00", "url": "https://www.cleveland19.com/2024/06/08/funeral-procession-honors-3-year-old-north-olmsted-boy-murdered-giant-eagle/", "message": "NORTH OLMSTED, Ohio (WOIO) - The funeral for the slain three-year-old North Olmsted boy is set for Saturday at St. Charles Borromeo Church in Parma.\nSunset Memorial Park ; 6625 Columbia Road North Olmsted 4407019 News will be streaming outside of the church and the procession.\nMemorial for Julian Wood at the North Olmsted Giant Eagle (Bingel, Julia | (Source: WOIO))Margot was stabbed while trying to pull Julian from the grocery cart, said O’Malley.\nPREVIOUS COVERAGE: New details about woman charged in fatal stabbing outside North Olmsted Giant EagleEllis was indicted on multiple charges including aggravated murder.\nPREVIOUS COVERAGE: North Olmsted tragedy: Share message of support with the Wood familyNorth Olmsted police previously said the attack appears to be random.", "location": "North Olmsted, Ohio", "classification": "security", "score": 0.511212683655502, "event_breakdown": "Funeral for slain North Olmsted boy is Saturday at St. Charles Borromeo Church\n\nThe service is for three-year-old Julian Wood, who was murdered March 11 outside a Giant Eagle in North Olmsted.\n\nA community fundraising has even raised more than $4,000 for Wood’s family.\n\nThe funeral will be at 10 a.m. at St. Charles."}, {"id": "30c91e47-bf16-43c1-a0fb-ece6fa4ac42a", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.", "location": "GAZA", "classification": "security", "score": 0.8647322033470862, "event_breakdown": "3 dead, 15 injured in Israeli strike on another UNRWA school, shelter\nAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nNo relevant events were found"}, {"id": "a82d9d6f-aa12-4f3b-a013-c2ba2eae7589", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.k101fm.net/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.", "location": "GAZA", "classification": "security", "score": 0.8647322033470862, "event_breakdown": "Three dead, 15 injured in Israeli strike on another UNRWA school, shelter\nhttps://apnews.com/article/middle-east-middle-eastern-islamic-world-gaza-israel-middle-east-africa-f3a2f8f9b31e57fc4f6da6db333cb01c\nAt least 45 dead, 249 injured in IDF strike on Rafah on Sunday, Gaza ministry says\nhttps://apnews.com/article/middle-east-israel-middle-eastern-islamic-world-gaza-palestine-8f5a105af9c27b5169cd2a10060a0a35"}, {"id": "4dbb7c95-ff53-4f6b-b36e-4879a3429bdd", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:00", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.", "location": "Based on the text provided, I could not identify a specific location for the event described.", "classification": "security", "score": 0.8647322033470862, "event_breakdown": "1. Three Palestinians killed, 15 injured in an IDF strike on an UNRWA school and shelter in Al-shati refugee camp  (Jun 7) \n2. Thirty-four people died and 170 were injured when IDF struck a UNRWA school at the Nuseirat Refugee Camp  on Thursday  (Jun 6).\n1. Forty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday (May 27)."}, {"id": "7a584a72-cf6b-4b64-98c7-7b63c4b12664", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.", "location": "GAZA", "classification": "security", "score": 0.8647322033470862, "event_breakdown": "Jun 07, 12:58 PM: Three Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza.\nJun 06, 6:19 PM: At least 40 people were killed and 74 were injured when Israeli forces struck a UN-run school at the Nuseirat Refugee Camp in Gaza.\nMay 26, 12:00 PM: Israeli forces struck a Rafah Multi-Functional School and Residential Complex, operated by the UNRWA, in Rafah, Gaza. The strike killed at least 23 people and injured over 100.\nMay 25, 12:00 PM: At least 42 Palestinians were killed and more than 500 were injured in an Israeli airstrike on a Shifa hospital in Gaza.\nMay 14, 12:00 PM: At least 83 Palestinians were killed and more than 500 were injured in an Israeli airstrike on a UN school in Gaza.\nFeb 01, 12:00 PM: At least 13 people were killed and more than 100 were injured in a bomb attack on a UN-operated school in northern Nigeria. This was reported by ABC News on Aug 1, 2016.\nAt least 22 people were killed and more than 75 were injured when Israeli forces struck a Rafah Multi-Functional School and Residential Complex, operated by the UNRWA, in Rafah, Gaza."}, {"id": "a3c05a95-2a38-45c2-b2b1-2bd4bcee80eb", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:15", "url": "https://www.kdks.fm/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.", "location": "GAZA", "classification": "security", "score": 0.8647322033470862, "event_breakdown": "3 dead, 15 injured in Israeli strike on another UNRWA school, shelter\nAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in an Israeli strike on an UNRWA school."}, {"id": "86034453-f83b-4a35-813b-7d666889419b", "title": "Live updates : Israel - Hamas war , Israeli hostages rescued", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-06-08-24/", "message": "Palestinians mourn their relatives who were killed by an Israeli bombardment at Al-Aqsa Martyrs Hospital in Deir al-Balah, Gaza, on June 8.\nIsmael Abu Dayyah/APThe Israeli military rescued four hostages held in Gaza on Saturday in a major daytime operation in central Gaza.\nThe strip’s government media office said at least 210 Palestinians were killed and more than 400 injured by the Israeli bombardment as it carried out the hostage rescue operation.\nOver 200 Palestinians dead:At least 210 people have been killed and more than 400 injured as a result of the Israeli operation, the enclave’s government media office said.\nIDF spokesperson Rear Adm. Daniel Hagari said the hostages had been locked in rooms of apartments in multistory civilian buildings.", "location": "GAZA", "classification": "security", "score": 0.9901636693602573, "event_breakdown": "IDF rescues hostages from Gaza apartment in daytime operation (A major daytime operation by the Israeli military liberated four hostages from Gaza.)\nGaza Brush Fire (A brush fire broke out in Gaza on Saturday.)"}, {"id": "8da65780-6648-4591-b074-836b9d63d00a", "title": "Israel Bombs Another UN - Run School In Gaza , A Day After Strike On School Killed 33 – 710am KURV", "date": "2024-06-08 01:00", "url": "https://www.kurv.com/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/", "message": "(AP)–An Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza’s center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nIsrael on Friday released the names of 17 militants it said were killed in Thursday’s strike.\nInternational pressure is mounting on Israel to limit civilian bloodshed in its war in Gaza, which completed its eighth month on Friday.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "location": "GAZA", "classification": "security", "score": 0.9279419465207093, "event_breakdown": "Israeli airstrike hits U.N.-run school compound in northern Gaza on Friday\nIsraeli military releases names of 17 militants it says were killed in a similar strike on a school in Gaza's center on Thursday"}, {"id": "9e9c8ac7-5f11-4226-b463-fc89a35170e3", "title": "Russia says 22 civilians killed by Ukrainian shelling - Xinhua", "date": "2024-06-08 04:45", "url": "https://english.news.cn/20240608/da664d6e03b44da7a62b6e0681672c8a/c.html", "message": "MOSCOW, June 8 (Xinhua) -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,\" Saldo added.", "location": "KHERSON", "classification": "security", "score": 0.6473496921322698, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nUkrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said."}, {"id": "87050157-44c7-4363-b984-9bae351d7eb7", "title": "Russia says 22 civilians killed by Ukrainian shelling | Central India Premier English Daily", "date": "2024-06-08 06:30", "url": "https://www.centralchronicle.com/russia-says-22-civilians-killed-by-ukrainian-shelling/", "message": "Moscow, June 8 (UNI) Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region twice on Friday, killing 22 civilians, the region’s Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,” Saldo added.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.6505295836305965, "event_breakdown": "Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region, killing 22 civilians."}, {"id": "a8b832df-7b75-4425-9d88-d583413fadf9", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 16:30", "url": "https://www.breitbart.com/news/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7Israel rescues 4 hostages kidnapped in a Hamas attack on Oct. 7.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued.", "location": "GAZA", "classification": "security", "score": 0.9492728535190323, "event_breakdown": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct. 7."}, {"id": "49b65799-bc7f-4e18-8b73-0c829aa4ee23", "title": "Danish Prime Minister Frederiksen assaulted in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.euronews.com/my-europe/2024/06/07/danish-prime-minister-frederiksen-assaulted-in-copenhagen", "message": "ADVERTISEMENTDanish Prime Minister Mette Frederiksen has been assaulted by an unknown man in Kultorvet, a central square in Copenhagen, Danish media has reported.\nAccording to her office Frederiksen suffered a light whiplash injury in the assault.\nFrench Prime Minister Emmanuel Macron posted that \"the attack on the Danish Prime Minister is unacceptable.\"\nLast month, Slovakia's Prime Minister survived an assassination attempt in the central Slovakian town of Handlová.\nSweden's Foreign Minister, Tobias Billström reacted to Friday's attack against Frederiksen on X saying that such an “absolutely terrible” attack should be strongly condemned.", "location": "Copenhagen.", "classification": "security", "score": 0.6160926322031227, "event_breakdown": "Danish Prime Minister Mette Frederiksen assaulted by unknown man in Kultorvet, a central square in Copenhagen, according to reports.\nSlovakia's Prime Minister survived an assassination attempt in the central Slovakian town of Handlová last month."}, {"id": "4b79ed28-ba4d-4ec5-be04-d42143e7044e", "title": "Essex man arrested for stabbing stranger in front of schoolchildren | News", "date": "2024-06-08 10:15", "url": "https://www.independent.co.uk/tv/news/essex-stabbing-crime-school-tiptree-b2559098.html", "message": "Watch the dramatic moment a violent offender was arrested after stabbing a stranger in front of terrified schoolchildren in Essex.\nJohn Garrett, 55, attacked a man at a bus stop in Tiptree in broad daylight after stealing two bottles of alcohol from a Shell garage on 11 July 2023.\nHe stabbed his victim in the neck three times and left him in a life-threatening condition as paramedics rushed to the scene.\nSix people - including children leaving school - witnessed the violent attack.\nGarrett fled the scene and returned home, where he was arrested shortly after.", "location": "Tiptree", "classification": "security", "score": 0.9878560989581807, "event_breakdown": "Target Event: John Garrett attacked a man at a bus stop in Tiptree, Essex, on 11 July 2023. He stabbed his victim in the neck three times and left him in a life-threatening condition as paramedics rushed to the scene. Six people - including children leaving school - witnessed the violent attack."}, {"id": "f5d4d963-2745-41f4-9b47-5984bd104a59", "title": "Gaza news : 55 dead in strikes , Israel rescues 4 Oct . 7 hostages", "date": "2024-06-08 13:00", "url": "https://www.ctvnews.ca/world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza-strikes-1.6918991", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nPalestinians wounded in the Israeli bombardment of the Gaza Strip arrive at al-Aqsa Hospital in Deir al-Balah on June 8, 2024.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "GAZA CITY", "classification": "security", "score": 0.9688952726706928, "event_breakdown": "Israeli aircraft hum overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived."}, {"id": "5bc7f40a-d6b7-4231-ad25-74986ed5d9a6", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 11:00", "url": "https://www.mymotherlode.com/news/east-europe/3371849/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say.html", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in the Kherson region killed 22 and wounded 15 people, Moscow-appointed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "KYIV, Ukraine.", "classification": "security", "score": 0.705543644766756, "event_breakdown": "Russia-backed officials have reported that 22 people were killed in an attack in Ukraine's Kherson region on Friday and an attempt was made on the life of the ex-mayor of Kupiansk, a city in Ukraine's northeastern Kharkiv region."}, {"id": "4f1ec6a6-ec8b-46da-8aed-d3be6ddfd407", "title": "Israel bombs Gaza as minister poised to quit government", "date": "2024-06-08 10:15", "url": "https://www.channelnewsasia.com/world/israel-bombs-gaza-minister-poised-quit-government-4396501", "message": "\"DEFENCELESS\"The war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Hamas-run territory's health ministry.\nMilitants from Hamas and other Palestinian armed groups also took 251 hostages, 120 of whom remain in Gaza, including 41 the army says are dead.\nIsrael's retaliatory military offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nIsrael's Prime Minister Benjamin Netanyahu, who is due to address the US Congress next month, also faces pressure from within his right-wing government.\nThe office of war cabinet member Benny Gantz has announced a news conference for Saturday, the deadline he gave Netanyahu last month to approve a post-war plan for Gaza.", "location": "GAZA", "classification": "security", "score": 0.7095087154115306, "event_breakdown": "DEFENCELESS\nThe Israeli Defence Force has been carrying out airstrikes in Gaza in response to what it calls rocket attacks by militants."}, {"id": "38fb8ebe-6de8-4aae-9d43-f336045de144", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 12:45", "url": "https://www.ksat.com/news/world/2024/06/08/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nNetanyahu in a statement vowed to continue the fighting until all hostages are freed.\n“A lot of fire was around us,” he said, adding that the military responded with heavy force, including from aircraft, to extract the rescuers and freed hostages.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.", "location": "GAZA", "classification": "security", "score": 0.8698282110146998, "event_breakdown": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on October 7. The hostages were freed in a military raid in southern Gaza.\n\nBenjamin Netanyahu in a statement vowed to continue the fighting until all hostages are freed, despite criticism over the ongoing Israeli military operations in Gaza.\n\nThe prime minister's vow comes amid growing tensions in Jerusalem and the West Bank, following a Palestinian attack on a Jewish settlement in the West Bank on Tuesday.\n\nPalestinian President Mahmoud Abbas accused Israel of violating the Palestinians' human rights and called for international intervention.\n\nIsraeli Defense Minister Moshe Yaalon said the raid is a major blow to the Hamas, saying the military has launched more than 1,000 airstrikes in Gaza since Tuesday's attack.\n\nHamas has been a major target of a series of Israeli strikes and arrests that began with the kidnapping and killing of three Israeli teens in June.\n\nIsraeli Prime Minister Benjamin Netanyahu announced the start of the military operation on Friday. He blamed the attacks on Israeli \"terrorists.\"\n\nHamas warned earlier in the day that it would retaliate for any Israeli retaliation, which it said would be a \"recycling of aggression for the sake of aggression.\"\n\nPalestinian leaders in the West Bank called on the Palestinians to prepare for a \"day of rage\" and to mobilize for street protests.\n\nIn Gaza City, some 200,000 people participated in the funeral of Hamas leader Mohammed Deif, who was killed Tuesday in an Israeli airstrike. The funeral for Al-Asama Brigade commander Mohammed Dadouh also took place in Gaza City.\n\nHamas has vowed to step up"}, {"id": "95bd64cf-94e4-4eb8-a6bc-cde477d1a1f2", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://komonews.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "GAZA", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Israel carried out its largest hostage rescue operation since Oct. 7, when 1,200 people died. Four were taken out of central Gaza on Saturday by helicopter. Israeli Prime Minister Benjamin Netanyahu greeted the freed hostages at the hospital on Saturday night."}, {"id": "fba56f7d-eb9a-4ccb-8c4b-4653933d70f3", "title": "Haiti - FLASH : 6 men sentenced to pay $6 . 2M in damages to Martine Moïse and her son Joverlein", "date": "2024-06-08 14:15", "url": "https://www.haitilibre.com/en/news-42504-haiti-flash-6-men-sentenced-to-pay-$62m-in-damages-to-martine-moise-and-her-son-joverlein.html", "message": "Haiti - FLASH : 6 men sentenced to pay $6.2M in damages to Martine Moïse and her son Joverlein6 men found guilty in the case of the assassination of Haitian President Jovenel Moïse https://www.haitilibre.com/en/news-34162-haiti-flash-president-jovenel-moise-assassinated-by-mercenaries-official-updated-7am-+-video.html were ordered in the United States to pay damages for the death of President Moïse, to his widow and to his eldest son Joverlein Moïse for a total of $6.2 millions, according to the restitution order issued by Federal Judge José E. Martínez of Miami.\nIn the restitution agreement filed last week in Miami federal court, Judge Martinez did not identify the widow and eldest son by name in his final ruling.\nHowever, Paul Turner, Martine Moïse's lawyer claims that Victim 1 is his client; Others familiar with the matter say President Joverlein's eldest son, Moïse, is victim 2.\nOf this sum, Martine Moïse (who currently lives in South Florida) is to receive $5,305,387 while Joverlein Moïse will receive $865,396.\nThe judge's order does not specify why the defendants were ordered to compensate Joverlein Moïse who was not present in the house at the time of the assassination.", "location": "Miami", "classification": "security", "score": 0.5259712764412108, "event_breakdown": "Location: Haiti\nEvent: 6 men sentenced to pay $6.2M in damages to Martine Moïse and her son Joverlein\nDescription: 6 men found guilty in the case of the assassination of Haitian President Jovenel Moïse were ordered in the United States to pay damages for the death of President Moïse, to his widow and to his eldest son Joverlein Moïse for a total of $6.2 millions.\nIn the restitution agreement filed last week in Miami federal court, Judge Martinez did not identify the widow and eldest son by name in his final ruling.\nAccording to the restitution order, Martine Moïse will receive $5,305,387 while Joverlein Moïse will receive $865,396.\nThe judge's order did not specify why the defendants were ordered to compensate Joverlein Moïse who was not present in the house at the time of the assassination."}, {"id": "7b28886b-ce9b-4e3a-9c09-603f864eccbd", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:45", "url": "https://katu.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "GAZA", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Israel rescues hostages from Gaza as divisions deepen over best way to rebuild from war"}, {"id": "47a71095-2a70-482a-bb44-a2a36e3c64a3", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "IDF strike on Rafah, Gaza ministry saysDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysAn IDF aircraft struck a Hamas compound in Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nForty-five people were killed and 249 injured, the ministry said.\nIDF officials told The Jerusalem Post that their aircraft struck significant Hamas terrorists who were operating a Hamas compound."}, {"id": "4f47d833-d40f-46ca-b556-e746e58370d3", "title": "Danish Prime Minister cancels campaign events after being assaulted by man in Copenhagen", "date": "2024-06-08 19:00", "url": "https://www.euronews.com/my-europe/2024/06/08/danish-prime-minister-cancels-campaign-events-after-being-assaulted-by-man-in-copenhagen", "message": "By Euronews with AP & EBUDanish Prime Minister Frederiksen cancelled campaign events on the eve of European elections.\nADVERTISEMENTThe Danish Prime Minister cancelled campaign events on the eve of voting in her country after she was assaulted by a man in downtown CopenhagenFollowing the attack, Prime Minister Mette Frederiksen was rushed to a hospital but was unharmed.\nLocal media report that a 39-year-old man walked up to her and pushed her hard.\nThe recent violence arose in the runup to elections taking place this weekend for the European Parliament.\nThe most serious attack so far was the attempted assassination of Slovakian Prime Minister Robert Fico – who struggled for his life after shots were fired at him while he met with supporters.", "location": "COPENHAGEN", "classification": "security", "score": 0.4448971673625537, "event_breakdown": "Here is the map of the current events of security that are reported in text:\n\n* Danish Prime Minister Frederiksen cancelled campaign events on the eve of European elections after she was assaulted by a man in downtown Copenhagen.\n* The recent violence arose in the runup to elections taking place this weekend for the European Parliament."}, {"id": "b7c1f93c-f50c-4966-9266-404e2dff6cc2", "title": "Wildfires in south Lebanon after Israeli bombardment", "date": "2024-06-08 16:30", "url": "https://gulfnews.com/world/mena/wildfires-in-south-lebanon-after-israeli-bombardment-1.1717860185232", "message": "Beirut: Israeli strikes Saturday on southern Lebanon sparked massive wildfires, state media and a first responder said, the latest fallout from escalating cross-border violence involving Iran-backed armed group Hezbollah.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza war began, triggered by the Palestinian militant group's October 7 attack.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nIt is located near the UN-demarcated Blue Line between Lebanon and Israel.\nThe border violence, which began on October 8, has killed 456 people in Lebanon, mostly fighters but including about 90 civilians, according to an AFP tally.", "location": "Lebanon", "classification": "security", "score": 0.9548228798400602, "event_breakdown": "Israel-Lebanon Border\nIsraeli strikes on southern Lebanon sparked massive wildfires, state media and a first responder said on August 1 in the latest fallout from escalating violence involving Iran-backed armed group Hezbollah."}, {"id": "f8390128-248b-4639-8eec-3e9dddf885d3", "title": "Israel rescues 4 hostages – NBC10 Philadelphia", "date": "2024-06-08 13:00", "url": "https://www.nbcphiladelphia.com/news/national-international/israel-rescues-4-hostages-kidnapped-in-october-hamas-attack/3880479/", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nNetanyahu in a statement vowed to continue the fighting until all hostages are freed.\n“A lot of fire was around us,” he said, adding that the military responded with heavy force, including from aircraft, to extract the rescuers and freed hostages.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.", "location": "Israel", "classification": "security", "score": 0.8837512333003031, "event_breakdown": "Netanyahu vows to continue fighting until all hostages are free"}, {"id": "37e92f9d-6bc8-497b-8d1b-4b8dffb67f56", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 17:15", "url": "https://13wham.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "GAZA", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Israel rescues four hostages from central Gaza, Israel's largest such operation since the current war with Hamas began."}, {"id": "5e37b88f-b4c6-4174-944d-c4f761b091ae", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 13:15", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-news-8-6-2024-d23625", "message": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nIsrael says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nSaturday’s operation brought the total number of rescued hostages to seven.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "GAZA", "classification": "security", "score": 0.8529346364865307, "event_breakdown": "Israel rescues four hostages in Gaza-Israel border kidnapping case"}, {"id": "c0fa9992-5508-4043-912e-e25bbf1e6564", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 17:00", "url": "https://wwmt.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "GAZA", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Israel rescues four hostages from Hamas, the latest since an Oct. 7 attack."}, {"id": "794a8f16-4eb3-48b5-aaa0-f172cc11eccd", "title": "Bomb Near KP CM Farmhouse And Attack On PTI Leader", "date": "2024-06-08 16:00", "url": "https://menafn.com/1108310460/Bomb-Near-KP-CMs-Farmhouse-And-Attack-On-PTI-Leader", "message": "The blast occurred close to the of DSP Kalachi and SHO Hathala.\nThe explosion targeted the elite force team led by DSP Kalachi, who were on their way for a search operation.\nIn a separate incident, Tehreek-e-Insaf leader Ali Zaman Advocate was assaulted by unknown assailants near Eidgah Colony in Peshawar last night.\nAccording to the hospital administration, Ali Zaman was attacked with a sharp instrument, but his condition is now stable.\nIt should be noted that Ali Zaman Advocate had contested the election from PK-73 on a PTI ticket.", "location": "Peshawar, Khyber Pakhtunkhwa, Pakistan", "classification": "security", "score": 0.94567360270355, "event_breakdown": "[\n  {\n    \"title\": \"Explosion targets elite force team in Peshawar\",\n    \"description\": \"An explosion occurred close to the DSP Kalachi and SHO Hathala in Peshawar on January 31, 2019, targeting the elite force team led by DSP Kalachi who were on their way for a search operation. Tehreek-e-Insaf leader Ali Zaman Advocate was assaulted by unknown assailants near Eidgah Colony in Peshawar last night. According to the hospital administration, Ali Zaman was attacked with a sharp instrument, but his condition is now stable.\"\n  }\n]"}, {"id": "1cfc194a-0c91-4065-9f32-5b69a693b8d1", "title": "Day After UN School Attack , IDF Brags About Striking Another Refugee Camp School", "date": "2024-06-08 00:00", "url": "https://truthout.org/articles/day-after-un-school-attack-idf-brags-about-striking-another-refugee-camp-school/", "message": "Israeli forces carried out the strike on the Al-Shati UN school just after killing at least 40 in an attack on Nuseirat.\nIsrael Defense Forces (IDF) bombed a UN school-turned-evacuation center in Al-Shati refugee camp, near Gaza City, as they carried out an intense series of bombardments on Friday.\nThis is the second time that Israel has struck a UN Relief and Works Agency for Palestine Refugees (UNRWA) school over the course of 48 hours.\nOn Thursday, Israeli forces deployed U.S.-made bombs in an attack that killed at least 40 Palestinians, including 14 children, in Nuseirat refugee camp.\nThe Nuseirat attack sparked widespread outrage, with humanitarian groups quickly denouncing it as a potential war crime.", "location": "GAZA CITY", "classification": "security", "score": 0.9815690779830014, "event_breakdown": "IDF bombs al-Shaty refugee camp near Gaza City."}, {"id": "7ff71534-630a-4504-9c6a-3c758992fa2a", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:45", "url": "https://www.wcyb.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "The main location where the main event takes place is Israel.", "classification": "security", "score": 0.8762340955996477, "event_breakdown": "Israel launched a new operation in Gaza after an attack on Saturday killed an Israeli soldier and injured two.\nThe Israeli military killed 15 Palestinian civilians in Gaza City on Sunday, according to Palestinian health officials."}, {"id": "4431f576-1266-47df-bd32-0cdb1a0c3b38", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:15", "url": "https://turnto10.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "JERUSALEM", "classification": "security", "score": 0.8762340955996477, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security\nCurrent event reports that the Meetei Revolutionary Front (MRF) shot dead a residence staff of the Manipur Police Housing Corporation at a hotel in Imphal West District\nCurrent event reports that in Bihar, nine people were killed and several injured as the country celebrates its foundation day\nCurrent event reports that a 35-year-old man was killed in Bengal's Nadia District in a gang clash"}, {"id": "9ebbf21a-7b76-43e3-89c3-47187c521fcf", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 15:00", "url": "https://wsbt.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "Gaza", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Rescue operation in Gaza Strip brings out 4 hostages by Israel forces. A national buzz and rising debates over hostage policy bodes well for Benjamin Netanyahu's approval ratings - which has been in decline since Palestinian crisis escalated in Oct '18."}, {"id": "9ce18a47-9c1f-416e-a5a4-01fb3b33f2b1", "title": "Ukraine air defense downs 9 Russian drones", "date": "2024-06-08 10:30", "url": "https://www.voanews.com/a/ukraine-air-defense-downs-9-russian-drones/7647955.html", "message": "Ukraine and Russia exchanged airstrikes early Saturday with Russia suffering casualties as Ukraine's drone attacks on the Russian-held Kherson and Luhansk regions left at least 28 people dead and 60 wounded.\nInitially, Ukraine's drone attacks Friday night on the small town of Sadove in the Russia-held Kherson region killed 22 and wounded 15 people, according to Moscow-backed Governor Vladimir Saldo.\nRussian-installed Luhansk regional Governor Leonid Pasechnik declared Saturday a day of mourning in the region, with public events canceled.\nThe package includes air defense interceptors, artillery systems and munitions, armored vehicles, anti-tank weapons, and other capabilities.\nIt also will help strengthen Ukraine's air defenses that would protect Ukraine's electric grid from Russian attacks and reinforce Ukrainian capabilities across the front lines, the statement said.", "location": "KHERSON", "classification": "security", "score": 0.6828058760775496, "event_breakdown": "Ukraine's drone attacks on Russia-held Kherson and Luhansk regions leave at least 28 people dead and 60 wounded."}, {"id": "fa46189e-2e20-43a6-9a2b-df6125e2117a", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:30", "url": "https://ktul.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "GAZA", "classification": "security", "score": 0.8762340955996477, "event_breakdown": "1. On October 7, Hamas abducted 250 hostages and killed about 1,200 people during a music festival in Tel Aviv.\n2. On Friday, Israel and Hamas exchanged fire as Israel continued its search for an abducted soldier. Israel said some 30 militants were inside and 17 were killed."}, {"id": "716c9f5a-c40a-4c3b-a089-b99df3f2bf87", "title": "Israel - Hamas War Day 246 : What happening in Gaza , Middle East ? ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-08/live-updates-805413", "message": "breaking news (photo credit: JPOST STAFF)IDF soldiers identified a Hezbollah operative in the area of Aitaroun in southern Lebanon, the IDF reported on Saturday afternoon.\nShortly thereafter, an IAF aircraft struck the terrorist.\nAdditionally, IDF fighter jets targeted terrorist infrastructure in the area of Khiam.\nAdditionally, earlier on Saturday, IDF tanks fired toward a Hezbollah military structure in the area of Kfarkela.\nOver the past day, IDF artillery and mortars struck to remove threats in the areas of Kfarchouba, Kfarkela, Houla and Kfarhamam, the military added.", "location": ".\nAItaroun", "classification": "security", "score": 0.9529242594700364, "event_breakdown": "IDF soldiers identified a Hezbollah operative in the area of Aitaroun in southern Lebanon, the IDF reported on Saturday.\nShortly thereafter, an IAF aircraft struck the terrorist.\nAdditionally, IDF fighter jets targeted terrorist infrastructure in the area of Khiam\nIDF tanks fired toward a Hezbollah military structure in the area of Kfarkela.\nOver the past day, IDF artillery and mortars struck to remove threats in the areas of Kfarchouba, Kfarkela, Houla and Kfarhamam."}, {"id": "07776a66-f0ae-499e-9fd5-d34a383f169e", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 13:15", "url": "https://fox11online.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed.", "location": "Tel Aviv", "classification": "security", "score": 0.8762340955996477, "event_breakdown": "Event 1: Argamani, a hostage of Hamas, was freed in a recent hostage rescue and returned to Israel.\nEvent 2: The Israeli military identified 17 militants it says were killed during the hostage rescue operation in October."}, {"id": "f7b5e6ee-44cf-4829-aa33-bb9552e9c30a", "title": "Israeli forces rescue four live hostages who were kidnapped from music festival and taken to Gaza", "date": "2024-06-08 14:00", "url": "https://www.irishtimes.com/world/middle-east/2024/06/08/israel-hamas-latest/", "message": "The Israeli military named the rescued hostages as Noa Argamani (25), Almog Meir Jan (21), Andrey Kozlov (27), and Shlomi Ziv (40).\nAlmog Meir Jan (21), Andrey Kozlov (27), Noa Argamani (25) and Shlomi Ziv (40) were rescued by Israeli forces.\nThe spokesperson for Hamas’ armed al-Qassam Brigades, Abu Ubaida, said some hostages were killed during the rescue operation.\nA billboard depicting from left: Noa Argamani, Shlomi Ziv, Almog Meir Jan and Andrey Kozlov, the four Israeli hostages rescued by the Israeli army.\nUS president Joe Biden also welcomed the return of four Israeli hostages rescued in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9157507670934154, "event_breakdown": "Israeli forces rescued four Israeli hostages in Gaza on 11 December."}, {"id": "b315babd-fe01-4708-9b49-fcc36c2c6d9a", "title": "OIC condemns Israeli targeting of UNRWA school in Gaza", "date": "2024-06-08 12:30", "url": "https://www.gulf-times.com/article/684379/region/oic-condemns-israeli-targeting-of-unrwa-school-in-gaza", "message": "The Organization of Islamic Cooperation (OIC) has condemned in the strongest terms the Israeli bombing of a United Nations Relief and Works Agency for Palestine Refugees (UNRWA) school in Gaza, which was sheltering displaced persons.\nThe attack resulted in the martyrdom of over 40 Palestinians and injured numerous civilians, most of whom were women and children.In a statement issued Saturday, the OIC considered the Israeli bombing of the school as an extension of the ongoing genocide in Gaza and a blatant violation of international humanitarian law, the Geneva Conventions, relevant United Nations resolutions, and orders from the International Court of Justice.The OIC viewed the United Nations' decision to include Israel, the occupying power, on the list of violators of children's rights in armed conflicts, known as the \"list of shame,\" as an important step towards supporting the rule of international law and ending the culture of impunity concerning Israeli war crimes, thereby ensuring justice for Palestinian victims.The organization called on the international community, particularly the United Nations Security Council, to fulfill its responsibilities by working to end the continuous Israeli aggression against the Palestinian people and taking serious measures to ensure the accountability of those who commit war crimes and genocide against Palestinians, ultimately achieving international justice.", "location": "Gaza", "classification": "security", "score": 0.7018475246903966, "event_breakdown": "Israeli Bombing of UNRWA School in Gaza\nThe OIC condemned the Israeli bombing of a United Nations Relief and Works Agency for Palestine Refugees school in Gaza that was sheltering displaced persons. The attack resulted in the death of over 40 Palestinians and injured numerous civilians, mostly women and children."}, {"id": "cd03075e-ba56-4cd5-9dae-64b02c92923d", "title": "Woman rescued from rubble near Poltava dies in hospital", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/woman-rescued-rubble-near-poltava-092512084.html", "message": "Woman rescued from rubble near Poltava dies in hospitalAttack on Poltava Oblast on 7 June.\nPhoto: Oblast Military AdministrationA woman rescued from the rubble in Poltava district on 7 June has died in hospital.\nSource: Filip Pronin, Head of Poltava Oblast Military Administration, on TelegramQuote from Pronin: \"Unfortunately, the woman who was rescued from the rubble yesterday has died.\nDoctors fought to save her life until the last minute.\"\nBackground: On 7 June, the Russian army launched a missile attack on a residential building in Poltava Oblast, and a woman was rescued from the rubble.", "location": "POLTAVA", "classification": "security", "score": 0.8641461587695701, "event_breakdown": "The following current events were reported in text from the provided context:\n\n1. Woman rescued from rubble near Poltava dies in hospital - A woman who was previously rescued from the rubble in Poltava district on 7 June has died in hospital.\n2. Attack on Poltava Oblast on 7 June - On 7 June, the Russian army launched a missile attack on a residential building in Poltava Oblast."}, {"id": "32ea56c2-fb2c-452d-861a-f0ac8860aebf", "title": "Danish Prime Minister Mette Frederiksen attacked by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.aol.com/danish-prime-minister-mette-frederiksen-203554001.html", "message": "Danish Prime Minister Mette Frederiksen was attacked by a man, who has since been arrested, in the capital city of Copenhagen on Friday, her office said in a statement to CNN.\n“Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\nIt is unclear if the prime minister was hurt in the assault.\n“Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,” Latvian Prime Minister Evika Siliņa said in a post on X.\nFrederiksen, the leader of Denmark’s center-left Socialist Democratic party, has served as prime minister since 2019.", "location": "Copenhagen, Denmark", "classification": "security", "score": 0.47940524455138595, "event_breakdown": "Target event:\nPrime Minister of Denmark, Mette Frederiksen was attacked by a man on Friday evening in Copenhagen.\nLatvian Prime Minister, Evika Siliņa condemned the attack on Twitter stating she was “deeply shocked” by it."}, {"id": "58f09716-1ee8-45a1-ae89-23a9869954da", "title": "First Drones Strike Mozdok Military Airfield In North Ossetia", "date": "2024-06-08 10:45", "url": "https://charter97.org/en/news/2024/6/8/598128/", "message": "First Drones Strike Mozdok Military Airfield In North Ossetia 10 8.06.2024, 15:3423,588The drones covered more than a thousand kilometers.\nOn the morning of June 8, the Russian Defense Ministry complained about another attack by Ukrainian drones.\nThe department said that they allegedly “destroyed the UAV” over the territory of the Republic of North Ossetia.\nAt the same time, head of North Ossetia Sergei Menyailo said that three Ukrainian drones tried to attack a military airfield in Mozdok.\nTheir target was a military airfield,” Menyailo said.", "location": "MOZDOK", "classification": "security", "score": 0.9175125218504416, "event_breakdown": "Drones Attack Mozdok Military Airfield\nFirst Drones Strike Mozdok Military Airfield In North Ossetia 10 8.06.2024, 15:3423,588The drones covered more than a thousand kilometers.\nOn the morning of June 8, the Russian Defense Ministry complained about another attack by Ukrainian drones."}, {"id": "8ae2c771-43fc-415a-a935-89b597bdaa24", "title": "ALJazeera :  Explosions every minute  as intense Israeli strikes target central Gaza – International Shia News Agency", "date": "2024-06-08 13:00", "url": "https://en.shafaqna.com/371627/aljazeera-explosions-every-minute-as-intense-israeli-strikes-target-central-gaza/", "message": "Israeli forces launch ‘unprecedented brutal attack’ on NuseiratGaza’s Government Media Office says the Israeli forces have launched “an unprecedented brutal attack on the Nuseirat refugee camp,”leaving dozens of people killed and wounded in the streets.\n“[It] continues its aggression against all areas of the Central Governorate, and Al-Aqsa Martyrs Hospital [in Deir el-Balah] is in a catastrophic situation,” it said.\nIsraeli forces launched “a barbaric and brutal aggression” in the camp, directly targeting civilians, the office said, adding that ambulances and civil defence cannot reach the area due to the intensity of the bombing.\nAmbulances have not stopped transferring people to Al-Aqsa HospitalThe ambulances have not stopped transferring injuries, and not only ambulances.\nWe’re talking about people, donkey carts, cars and anyone trying to help as much as possible.", "location": "GAZA", "classification": "security", "score": 0.9107740312668584, "event_breakdown": "Israeli forces launch ‘unprecedented brutal attack’ on Nuseirat refugee camp, Gaza\nIsraeli military launched \"a barbaric and brutal aggression\" in Nuseirat refugee camp, Gaza, directly targeting civilians. Ambulances and civil defense cannot reach the area due to the bombing. Al-Aqsa Hospital is reporting a catastrophic situation. Over a dozen injuries reported so far."}, {"id": "02a2ecc8-18a4-406d-97fc-c728b8580a6e", "title": "Israel says rescues four Gaza hostages alive", "date": "2024-06-08 12:15", "url": "https://www.al-monitor.com/originals/2024/06/israel-says-rescues-four-gaza-hostages-alive", "message": "In Gaza, the Hamas media office said \"the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded\".\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny.\nGantz had earlier cancelled a news conference scheduled for Saturday where Israeli media had speculated he would announce his resignation.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "location": "Gaza", "classification": "security", "score": 0.7144366640076018, "event_breakdown": "Gaza"}, {"id": "e076f1bd-3780-4c48-b402-1c37d8a0c521", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 15:45", "url": "https://cnycentral.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.", "location": "GAZA", "classification": "security", "score": 0.592517559050196, "event_breakdown": "Israel on Saturday carried out its largest rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza."}, {"id": "79b4cd8b-bb45-40bd-a4c0-c098028f95ff", "title": "Joe Plenzler Archives", "date": "2024-06-08 10:15", "url": "https://taskandpurpose.com/author/joe-plenzler/", "message": "Joe Plenzler is a communication consultant, leadership coach, and backcountry expert.\nWhen heâ€™s not running his company, he is often found climbing mountains or hiking the Appalachian Trail.\nDuring that time he attended the Marine Corpsâ€™ Mountain Warfare and Jungle Warfare Schools and the NATO Allied Officer Winter Warfare Course in Norway.\nIn 2016, he began section hiking the Appalachian Trail with his partner-in-crime, Kate and has completed more than 700 miles.\nHeâ€™s also completed a winter ascent of Longâ€™s Peak (14,259â€™), and summited Mount Rainier (14,410â€™), the Grand Teton (13,775â€™), and Mt.", "location": ".\nAppalachian Trail", "classification": "security", "score": 0.5476520562402597, "event_breakdown": "Currently, there are no relevant events to report."}, {"id": "70a1514c-1d56-40a8-8302-97b803d770dc", "title": "Russian attack drones account for 90 % of Ukrainian casualties around a key town in the last 6 months , medic says", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/russian-attack-drones-account-90-154536195.html", "message": "Russian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian FPV drones injured 90% of wounded soldiers near Chasiv Yar, said a Ukrainian medic.\nRussian attack drones have inflicted about 90% of war injuries suffered by Ukrainian soldiers around a key town in the past six months, according to a medic stationed on the eastern front.\nThe strategic city of Chasiv Yar has been the target of a Russian offensive since December.\nShe said that in other parts of the eastern front, Ukrainian soldiers were being overwhelmed with glide bombs.\nRussia stepped up its use of glide bombs in October when it launched its offensive against Avdiivka.", "location": "The main location where the main event takes place is Chasiv Yar.", "classification": "security", "score": 0.7644522035403958, "event_breakdown": "Russia is attacking a target located at Galitsynka, Ukraine with high-explosive fragmentation shells, wounding four civilians."}, {"id": "f9aabe07-da1e-4dbd-bb20-25a1cd1dec4b", "title": "Russian attack drones account for 90 % of Ukrainian casualties around a key town in the last 6 months , medic says", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/russian-attack-drones-account-90-154536199.html", "message": "Russian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian FPV drones injured 90% of wounded soldiers near Chasiv Yar, said a Ukrainian medic.\nRussian attack drones have inflicted about 90% of war injuries suffered by Ukrainian soldiers around a key town in the past six months, according to a medic stationed on the eastern front.\nThe strategic city of Chasiv Yar has been the target of a Russian offensive since December.\nShe said that in other parts of the eastern front, Ukrainian soldiers were being overwhelmed with glide bombs.\nRussia stepped up its use of glide bombs in October when it launched its offensive against Avdiivka.", "location": ")\nCHASIV YAR", "classification": "security", "score": 0.7644522035403958, "event_breakdown": "New Russian troops enter the Chasiv Yar, a city in the autonomous republic of Luhansk, Ukraine (exact location of deployment in the northeast)."}, {"id": "2b3f68c3-434b-4095-9bf5-106caba26680", "title": "One Ukrainian brigade holds back three Russian brigades on Pokrovsk front", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/one-ukrainian-brigade-holds-back-063000261.html", "message": "The Ukrainian Ground Forces have reported that soldiers from the 47th Mechanised Brigade are holding back at least three Russian combat brigades on the Pokrovsk front.\nSource: Ukrainian Ground ForcesDetails: The Ukrainian Ground Forces noted that the Russians are not reducing the pace of their assault actions and the Pokrovsk front is the epicentre of the fighting.\nQuote: \"Here, the enemy is trying to advance into the depths of our territory.\nSoldiers of the 47th Mechanised Brigade are holding back at least three Russian combat brigades.\nWith huge reserves of manpower, the Russians quickly replenish their huge losses and throw [new soldiers] into battle again and again.", "location": "POKRovsk front", "classification": "security", "score": 0.9202638841314661, "event_breakdown": "Event 1: Russian combat brigades are trying to advance into Ukraine territory on the Pokrovsk front.\n\nEvent 2: 47th Mechanised Brigade is holding back at least three Russian combat brigades."}, {"id": "aa16809b-1d2b-4b12-804a-5a00001efc72", "title": "Zelenskyy : Russians have failed to conduct Kharkiv operation", "date": "2024-06-08 20:15", "url": "https://www.yahoo.com/news/zelenskyy-russians-failed-conduct-kharkiv-173035163.html", "message": "President Volodymyr Zelenskyy has described the failure of the Russians to conduct the Kharkiv operation as a \"very significant\" result.\nA very significant result is that Russian forces have failed to conduct their Kharkiv operation.\nDetails: Zelenskyy further stressed that work is underway to provide more reserves to Ukraine's defence forces.\n\"We now have new solutions for Ukrainian defence from France and the United States thanks to the talks and meetings in France.\nWe are preparing a new systematic basis for training the Ukrainian units,\" the president said.", "location": "Kharkiv", "classification": "security", "score": 0.5942405497839396, "event_breakdown": "Current security events reported in text that can be placed on a map include the failure of Russian forces to conduct the Kharkiv operation."}, {"id": "c2f604a6-73bb-4751-b30b-0ec584f84cd5", "title": "Russo - Ukraine War - 07 June 2024", "date": "2024-06-08 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-07.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nThroughout the day in the Sivers віkomu direction, Russian forces carried out two unsuccessful assault actions in the area of Bílogorivka.\nRussia does not give up trying to find the weak points in Ukrainian defense, with continuous assault attempts to infiltrate Ukrainian troops' combat.\nThe Defense Forces are taking measures to stabilize the situation and prevent Russian forces from advancing.\nIn the Vremívs завkomu direction, Russian forces tried to tie battles near Urožaynogo and Staromayors міkogo.", "location": "BILOHORIVKA", "classification": "security", "score": 0.8547482460773861, "event_breakdown": "New events are reported in the Sivers and Vremívs віkomu directions. In the Sivers віkomu direction, Russian forces carried out two unsuccessful assault actions in the area of Bílogorivka, and the Defense Forces are taking measures to stabilize the situation and prevent Russian forces from advancing. In the Vremívs завkomu direction, Russian forces tried to tie battles near Urožaynogo and Staromayors міkogo."}, {"id": "b33555b2-590d-4419-ab9a-ba3a35ef9042", "title": "Rafale in Alaska : How  Red Flag 24  is good international exposure to Indian Air Force – Firstpost", "date": "2024-06-08 09:45", "url": "https://www.firstpost.com/opinion/rafale-in-alaska-how-red-flag-24-is-good-international-exposure-to-indian-air-force-13780203.html", "message": "Since the first time in November 1975, each year, three to six ‘Red Flag’ exercises are held at Nellis Air Force Base, Nevada, while up to four more, dubbed ‘Red Flag Alaska’, are held at Eielson Air Force Base, Alaska.\nCope Thunder was moved to Eielson Air Force Base, Alaska, in 1992.\nBlue Flag is a military aviation exercise held by the Israeli Air Force at Ovda Air Force Base in Israel.\nIn July 2022, the IAF carried out a one-month-long engagement with the Egyptian Air Force (EAF) at the Egyptian Fighter Weapon School, located in Cairo West Air Force Base.\nExercise Exposure AdvantageUnlike PLAAF, which exercises primarily with PAF and very few other major air forces, IAF benefits from exposure to air exercises with all the major air forces in the world.", "location": "Eielson Air Force Base", "classification": "security", "score": 0.8340999285461217, "event_breakdown": "Red Flag Exercise, Nellis Air Force Base, Nevada\nRed Flag Exercise, Eielson Air Force Base, Alaska\nCope Thunder, Eielson Air Force Base, Alaska\nBlue Flag Exercise, Ovda Air Force Base, Israel\nEngagement with Egyptian Air Force (EAF), Cairo West Air Force Base, Egypt\nExercise Exposure Advantage (event without location specified)"}, {"id": "47c33b24-e1db-45c5-9476-601dbcd8d7e3", "title": "Charles Burlingham", "date": "2024-06-08 18:15", "url": "https://www.courant.com/obituaries/charles-burlingham-cambridge-ma/", "message": "Charles Burlingham, Jr., known to all as Charlie, died Wednesday, April 6, 2022, in Cambridge, Massachusetts.\nBorn January 6, 1930, in New York City to Charles and Cora Weir Burlingham, he attended The Buckley School and The Diller-Quaile School of Music in NYC, Brooks School in North Andover, MA, and Harvard University (’51).\nOn August 31, 1951, he joined the Navy, ultimately to graduate from Officer Candidate School, and Anti-Submarine Warfare School.\nTogether, Charlie and Adair would raise seven children: Robin and Nicholas Burlingham, and Adair’s daughters Barbara, Mary (Mimi), Susan, Eliza, and Alice Storey.\nIn his later years, he transcribed ancestral Weir family letters, researched genealogy, and published an endearing memoir.", "location": "Cambridge, Massachusetts", "classification": "security", "score": 0.6786623273355736, "event_breakdown": "Title: Charles Burlingham, Jr., a Navy Officer, Dies at 92\n\nLocation: Cambridge, Massachusetts\nDate: April 6, 2022\n\nCharles Burlingham, Jr., known to all as Charlie, died Wednesday, April 6, 2022, in Cambridge, Massachusetts. He was born January 6, 1930, in New York City to Charles and Cora Weir Burlingham, and attended The Buckley School and The Diller-Quaile School of Music in NYC, Brooks School in North Andover, MA, and Harvard University (’51).\n\nOn August 31, 1951, he joined the Navy, ultimately to graduate from Officer Candidate School, and Anti-Submarine Warfare School.\n\nIn his later years, he transcribed ancestral Weir family letters, researched genealogy, and published an endearing memoir."}, {"id": "51b7b4f2-9c63-4bb2-8caf-26e17185e3bc", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them - New Delhi Times - India Only International Newspaper", "date": "2024-06-08 21:45", "url": "https://www.newdelhitimes.com/will-north-korea-fly-trash-balloons-into-south-korea-again-a-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North’s action was also likely designed to trigger a divide in South Korea over its conservative government’s tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "South Korea", "classification": "security", "score": 0.7620002033015205, "event_breakdown": "North Korea fires artillery rounds across the border, South Korea returnsfire\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd” and vowed “unbearable” retaliation."}, {"id": "37d8ad5d-3994-4faf-a6df-a93fb9ad2d07", "title": "Ukraine Defense Needs and Increase in Production : President Met with Representatives of the French Defense and Industrial Complex in Paris", "date": "2024-06-08 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-ukraine-president05.htm", "message": "Ukraine's Defense Needs and Increase in Production: President Met with Representatives of the French Defense and Industrial Complex in ParisPresident of Ukraine7 June 2024 - 17:31In Paris, President of Ukraine Volodymyr Zelenskyy visited the Ministry of Armed Forces of France.\nThe Minister of the Armed Forces of France, SĂ©bastien Lecornu, presented to the Head of State the products of the companies of the French defense and industrial complex, which are planned to be supplied to Ukraine.\nThe President also spoke with representatives of the French defense and industrial complex.\nThey discussed Ukraine's defense needs and the increase in the production of SPH Caesar, artillery shells, including long-range ones, electronic warfare and armored vehicles.\nI would like to thank you for one of the highest quality systems we have ever had â€” the Caesar,\" Volodymyr Zelenskyy said.", "location": "PARIS", "classification": "security", "score": 0.809570754237331, "event_breakdown": "Ukraine's Defense Needs and Increase in Production: President Met with Representatives of the French Defense and Industrial Complex in Paris\n\n- In Paris, President of Ukraine Volodymyr Zelenskyy visited the Ministry of Armed Forces of France.\n- The Minister of the Armed Forces of France, SĂ©bastien Lecornu, presented to the Head of State the products of the companies of the French defense and industrial complex, which are planned to be supplied to Ukraine."}, {"id": "a6df1bd8-8e0d-49ea-a60e-cf3c466f3ab1", "title": "SADC forces engage M23 rebels in eastern DRC as violence intensifies", "date": "2024-06-08 12:15", "url": "https://www.theeastafrican.co.ke/tea/news/east-africa/sadc-forces-engage-rebels-in-eastern-dr-congo-4651312", "message": "On May 31, the South African army, a member of this mission known as SAMIDRC announced that it had lost a soldier.\nLike the first four who lost their lives, hit by mortars, the fifth is also South African.\nIt was between December 2023 and January 2024 that SADC troops were in the DRC, alongside the Congolese.\nIt is in this locality that South African and Congolese troops have set up to block the rebel assaults.\nAs for the attacks on South African troops.”Mr Bel points out that rebels are putting pressure on President Ramaphosa to take responsibility over the death of South African soldiers.", "location": "The Democratic Republic of Congo (DRC)", "classification": "security", "score": 0.7194256928618757, "event_breakdown": "May 31: A South African soldier was killed and another injured when rebels attacked their base in the eastern Democratic Republic of Congo, the army said. The attack happened in the town of Rumangabo, in the province of North Kivu.\nApril 6: A Senegalese peacekeeper with the United Nations Stabilization Mission in the DRC (MONUSCO) was killed in a bomb attack in North Kivu.\nSources:\nReuters\nDaily Mail"}, {"id": "df6d7066-a936-4999-b515-09989bdfdf42", "title": "6 / 8 / 24 National Security and Korean News and Commentary", "date": "2024-06-08 19:30", "url": "https://smallwarsjournal.com/blog/6824-national-security-and-korean-news-and-commentary", "message": "Voice of America: [Washington Talk] “Military agreement suspended, Korean military ‘shackles’ lifted… “Information warfare must be expanded across the board.”2.\nNorth Korea recalls documentary about Kim Jong Un’s mother4.\nAn American Company Enabled a North Korean Scam That Raised Money for WMDs7.\nDissecting Propaganda: Using AI to Cut Through North Korean TV Spin8.\nDeterring North Korean aggression remains primary goal, new fighter wing commander says12.", "location": "WASHINGTON", "classification": "security", "score": 0.6225396978206389, "event_breakdown": "North Korean military agreement suspended, Korean military ‘shackles’ lifted\nNorth Korean recalls documentary about Kim Jong Un’s mother\nAn American Company Enabled a North Korean Scam That Raised Money for WMDs\nDissecting Propaganda: Using AI to Cut Through North Korean TV Spin\nDeterring North Korean aggression remains primary goal, new fighter wing commander says"}, {"id": "a3c4ddca-f25e-4458-ba60-e39b376da6c3", "title": "Discover Imber : The eerie  ghost village  near London abandoned in WWII , open just 20 days a year | Birmingham Live", "date": "2024-06-08 06:00", "url": "https://www.birminghammail.co.uk/travel/dangerous-ghost-village-abandoned-overnight-29282942", "message": "A tiny village just two hours away from Birmingham was once a bustling community of several hundred villagers.\nBut those living in Imber abandoned their homes after orders from the Ministry of Defence.\nOnly a small church, a handful of cottages, and a vicarage remain at the Wiltshire-based village, often dubbed 'the lost village'.\nA significant portion of the village and surrounding farmland had been strategically acquired by the Ministry of Defence before the war.\nToday, while the charm and mystery of its history are preserved in the church, the rest of the area is now dominated by rather 'unattractive' MOD training buildings.", "location": "Imber", "classification": "security", "score": 0.8330381081496456, "event_breakdown": "Imber, a small Wiltshire-based village abandoned by its residents after World War II, is now dominated by Ministry of Defence training buildings."}, {"id": "89f714b9-dd98-4fff-b34f-61a26de038b4", "title": "Vets travel to National WWII Museum , as this week marks 80 years since D - Day", "date": "2024-06-08 17:00", "url": "https://www.whec.com/local/vets-travel-to-national-wwii-museum-as-this-week-marks-80-years-since-d-day/", "message": "ROCHESTER, N.Y. — On June 6, 1944, troops from the Allies stormed the beaches of Normandy — marking a historic battle of World War II.\nJune 6, 2024 marks 80 years since our troops stormed Omaha Beach in an effort to rid the rule of Nazi Germany in France.\nOne veteran from Fairport, 102-year-old “Al” Persichitti, died while traveling to attend the D-Day memorial event in Normandy this year.\nOther veterans went to the National World War II Museum in New Orleans to remember D-Day, and returned home from the trip on Saturday.\nOur Jennifer Lewke met nine World War II vets in Batavia, a few of which were apart of the historic storming of Omaha Beach.", "location": "OMAHA BEACH", "classification": "security", "score": 0.5010663760793216, "event_breakdown": "World War II Vets Return to Rochester after D-Day Trip\nWorld War II Vets Return to Rochester after D-Day Trip\nWorld War II Vets Return to Rochester after D-Day Trip"}, {"id": "31374215-b0b6-4bde-834e-204436686f29", "title": "Israeli forces batter central and south Gaza as tanks advance in Rafah", "date": "2024-06-08 03:30", "url": "https://www.japantimes.co.jp/news/2024/06/08/world/politics/israeli-forces-batter-gaza/", "message": "With a renewed cease-fire push in the eight-month-old Gaza war stalled, Israel bombarded central and southern areas again on Friday, killing at least 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nU.S.-backed Qatari and Egyptian mediators have tried again this week to reconcile clashing demands preventing a halt to the hostilities, a release of Israeli hostages and Palestinians jailed in Israel, and an unrestricted flow of aid into Gaza to alleviate a humanitarian disaster.\nBut sources close to the talks said there were still no signs of a breakthrough.\nA month after rumbling into Rafah in what Israel said was an assault to wipe out Hamas' last intact combat units, tank-led forces have advanced to the southwest fringes of the city that skirts the Gaza Strip's border with Egypt, residents said.", "location": "GAZA", "classification": "security", "score": 0.7789654081122575, "event_breakdown": "Israel bombarding central and southern areas, killing at least 28 Palestinians\nIsraeli tank-led forces advance to western edges of Rafah"}, {"id": "783dad78-ae2e-4cbb-affc-71667cf444ed", "title": "Ukraine drone attack reported deep into Russian territory", "date": "2024-06-08 10:30", "url": "https://www.prokerala.com/news/articles/a1537887.html", "message": "Moscow, June 8 : - Ukraine attacked Russian targets with a total of 25 combat drones overnight, according to the Defence Ministry in Moscow, with one drone said to have reached deep into the Russian Caucasus.\nThe Russian ministry said the drones were intercepted in the border regions of Rostov, Bryansk and Belgorod, as well in Russian-occupied Crimea.\nA Ukrainian drone also apparently penetrated the republic of North Ossetia in Russia's Caucasus.\nWhether all Ukrainian drones were actually shot down by Russian air defences could not be independently verified.\nAs a practice, the Russian Defence Ministry does not provide any information about drones that hit their target.", "location": "Ukraine", "classification": "security", "score": 0.6176793514692899, "event_breakdown": "Location: Ukraine, Russia\nReported on: June 9th, 2022\nThe Ukrainian military attacked Russian targets with a total of 25 combat drones overnight, according to the Defence Ministry in Moscow. The Russian ministry said the drones were intercepted in the border regions of Rostov, Bryansk and Belgorod, as well in Russian-occupied Crimea. A Ukrainian drone also penetrated the republic of North Ossetia in Russia's Caucasus."}, {"id": "03496298-af6b-46ea-b8a2-8ea85ad2a424", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-08 01:45", "url": "https://www.asahi.com/ajw/articles/15297954", "message": "FILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "Incheon, South Korea", "classification": "security", "score": 0.7627095356519057, "event_breakdown": "North Korean Balloon Campaign Triggers South Korean Tensions\n\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation."}, {"id": "0746d4b9-51f6-4a85-b06f-e4e5ea5b8823", "title": "The hype backfires : India surprise vote result | India Election 2024", "date": "2024-06-08 12:45", "url": "https://www.aljazeera.com/program/the-listening-post/2024/6/8/the-hype-backfires-indias-surprise-vote-result", "message": "The surprise election result in India leaves the BJP and Prime Minister Narendra Modi missing a chunk of voter support and at the helm of a tricky coalition.\nContributors:Nishtha Gautam – Columnist, NDTVSreenivasan Jain – Host, The India ReportMukul Kesavan – Historian and novelistFatima Khan – Journalist, The QuintOn our radar:Amid the European parliamentary election, a battle against misinformation continues between the European Union and Russia.\nMeenakshi Ravi reports on how Moscow could be behind a campaign to misinform and discourage European voters.\nIsrael’s cultural annihilation in GazaThe Listening Post has covered Israel’s war on Gaza through the prism of the media, including the unprecedented killing of Palestinian journalists.\nBut there is another level to what is unfolding in Gaza: the genocidal assault on Palestinian history, existence and culture.", "location": "India is the main focus of the event.", "classification": "security", "score": 0.5084538152613296, "event_breakdown": "India's election result leaves the ruling party BJP and Prime Minister Narendra Modi with a tricky coalition. Russia has waged a misinformation war during Europe's elections. Israel's war on Gaza is a genocidal assault on Palestinian history, existence and culture."}, {"id": "8fb6c3e4-758a-4044-b28b-61d229024b91", "title": "101st Birthday Party | News , Sports , Jobs - The Intermountain", "date": "2024-06-08 12:15", "url": "https://www.theintermountain.com/news/local-news/2024/06/101st-birthday-party/", "message": "DAILEY — Randolph County resident Juanita Morgan, a former Rosie the Riveter, recently celebrated her 101st birthday at a family member’s home in Dailey.\nThe three members from Our Town dressed in full Rosie attire to help celebrate the special occasion.\n“We had a wonderful time visiting Juanita and her family in Dailey,” Trimboli told The Inter-Mountain.\nMorgan worked alongside her sister and future sister-in-law at the facility, where she was a riveter on B-29 airplanes.\nBoth sons attended the 101st birthday party with their wives and Morgan’s five grandchildren and three great grandchildren.", "location": "Dailey", "classification": "security", "score": 0.4189902730793292, "event_breakdown": "DAILEY — Randolph County native and former Rosie the Riveter advocate Juanita Morgan recently celebrated her 101st birthday at a family member’s home in Dailey with three members from Our Town."}, {"id": "5484da92-c3e1-4514-89cd-9d2748c6d291", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 23:45", "url": "https://www.nzherald.co.nz/world/a-world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/C3QRTN535NH7XLQFQJLB4MDR6M/", "message": "US WWII veteran Harold Terens, 100, left, and Jeanne Swerlin, 96, arrive to celebrate their wedding at the town hall of Carentan-les-Marais, in Normandy, northwestern France.\nPhoto / APUS WWII veteran Harold Terens, 100, left, and Jeanne Swerlin, 96, arrive to celebrate their wedding at the town hall of Carentan-les-Marais, in Normandy, northwestern France.\nUS WWII veteran Harold Terens, 100, and Jeanne Swerlin, 96, arrive to celebrate their wedding at the town hall of Carentan-les-Marais, in Normandy, northwestern France.\nUS WWII veteran Harold Terens, 100, left, and Jeanne Swerlin, 96, arrive to celebrate their wedding.\nUS World War II veteran Harold Terens, 100, left, and Jeanne Swerlin, 96, kiss as they arrive to celebrate their wedding.", "location": "Normandy, France", "classification": "security", "score": 0.8754648155370737, "event_breakdown": "US World War II veteran Harold Terens, 100, and Jeanne Swerlin, 96, arrive to celebrate their wedding at the town hall of Carentan-les-Marais, in Normandy, northwestern France."}, {"id": "777e1ebb-5fc0-46a8-ade4-2b90de8ba934", "title": "Deadly landmines pose hidden threat in Libyan capital", "date": "2024-06-08 01:00", "url": "https://www.citizen.co.za/news/news-world/deadly-landmines-hidden-threat-libya/", "message": "Deadly landmines pose hidden threat in Libyan capitalThe southern suburbs, where three children were injured, have been the 'scene of all wars since 2011 until today'.\nHundreds of deadly landmines and unexploded ordanance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\n(Photo by Mahmud TURKIA / AFP)Hundreds of deadly landmines and unexploded ordnance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\nThe southern suburbs, where the three children were injured, have been the “scene of all wars since 2011 until today”, said Farhat.\nBut it will come too late for Farhat’s son Mohamed, who was wounded in the head by shrapnel from the blast.", "location": "TRIPOLI", "classification": "security", "score": 0.6222666894876211, "event_breakdown": "Southern suburbs of Tripoli"}, {"id": "91b8e43a-d468-4f6e-9734-f87891880e2f", "title": "Weeks of planning and quality intelligence : inside the IDF daring Gaza hostage resc", "date": "2024-06-08 15:15", "url": "https://www.ynetnews.com/article/ryqrh6zba", "message": "A Yamam fighter was severely injured in the fighting and was transported to the hospital for life-saving care.\nThe safe return of the four hostages to Israel was announced on Saturday amid reports of heavy fighting in the Nuseirat refugee camp in central Gaza.\nThe IDF issued an unusual announcement late in the morning, stating that its forces were engaged in intense combat there.\nIn the weeks leading up to the extraction, the Yamam anti-terror unit had examined several models for the operation.\nDuring the battle, they were supported by IDF forces on the ground, in the air and at sea.", "location": "GAZA STRIP", "classification": "security", "score": 0.5906815155469038, "event_breakdown": "Event 1: Intense combat in Nuseirat refugee camp in central Gaza.\nEvent 2: The Yamam anti-terror unit extracting hostages from Nuseirat refugee camp."}, {"id": "6ec753c6-5a9e-47b6-956a-54ccfe7f9976", "title": "Israeli operation rescues 4 hostages from Gaza , including Noa Argamani", "date": "2024-06-08 16:15", "url": "https://forward.com/fast-forward/620836/israeli-operation-rescues-4-hostages-from-gaza-including-noa-argamani/", "message": "By Ron Kampeas June 8, 2024Israeli forces rescued four hostages held since Oct. 7 in the central Gaza Strip, including Noa Argamani, the festival goer who was filmed as she was carried away by terrorists on a motorcycle.\nAll four were attending the Nova music festival on Oct. 7, when Hamas terrorists killed 1,200 people and abducted more than 250, launching the war.\nChief Inspector Arnon Zamora, a commander of the operation, was killed in the battle.\nArgamani appeared in video posted on various sites after the attack screaming as terrorists spirited her away on a motorcycle.\nShe became a symbol of the carnage, especially the 364 people the terrorists killed as they fled the music festival.", "location": "Gaza", "classification": "security", "score": 0.9635868933560222, "event_breakdown": "Reported Event:\nIDF rescues four hostages held since October 7 in the central Gaza Strip, including Noa Argamani, the festival goer."}, {"id": "8c5ea7ce-315c-44d2-b574-b031489608f3", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army", "date": "2024-06-08 08:00", "url": "https://www.aol.co.uk/news/t-fight-way-peace-20-070040266.html", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket.", "location": "The exact location is Samut Prakan province, which is a city in Thailand.", "classification": "security", "score": 0.7412295491405421, "event_breakdown": "Event 1: On 5 April, I went to the military conscription centre in Samut Prakan province.\nEvent 2: I spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "04193ffc-8f3e-45a8-9aaa-e63da6f0ade1", "title": "Glen Ridge pays tribute to the fallen", "date": "2024-06-08 13:15", "url": "https://essexnewsdaily.com/arts/glen-ridge-pays-tribute-to-the-fallen", "message": "Glen Ridge held its annual Memorial Day parade Monday, May 27.\nThe flag on the Ridgewood Avenue School grounds was raised to half-staff and the steadfast Sharon DeRosa Smolen sang an evocative national anthem.\nHe was followed by a selection played by the Glen Ridge High School Band, bronze medalists in the 2023 national championships.\nA reading of the names of borough residents who died in combat were read and wreaths were placed.\nOh, Lord,” he said, “the names we heard were of people who tried to fix a broken world.", "location": "Based on the text provided, the main focus of the event is Glen Ridge, New Jersey.", "classification": "security", "score": 0.4392732795112794, "event_breakdown": "The event of Glen Ridge Memorial Day parade was reported on Monday, May 27, in Glen Ridge, New Jersey."}, {"id": "fa28dc0c-b847-412e-be4b-c35f53714fe9", "title": "Why Did the Taliban Sirajuddin Haqqani Visit the UAE ? – The Diplomat", "date": "2024-06-08 18:00", "url": "https://thediplomat.com/2024/06/why-did-the-talibans-sirajuddin-haqqani-visit-the-uae/", "message": "As Afghanistan navigates a delicate transition period following the Taliban’s takeover, Haqqani’s diplomatic foray into the UAE underscores the complex interplay of actors and interests shaping the nation’s future.\nThe unexpected interaction between a high-ranking Taliban official and the UAE leader fueled discussions regarding the evolving dynamics in the region.\nHe inherited the mantle of leadership from his father, Jalaluddin Haqqani, a prominent figure in the anti-Soviet resistance who established the formidable Haqqani Network.\nIn the article, titled “What We, the Taliban, Want,” Haqqani expressed his fatigue with the ongoing conflict in Afghanistan.\nGiven the regional contest for influence between Qatar and the UAE, particularly in their quest for greater political sway, Haqqani’s visit to the UAE is intriguing on multiple levels.", "location": "Afghanistan", "classification": "security", "score": 0.6529517860077367, "event_breakdown": "1- The unexpected interaction between a high-ranking Taliban official and the UAE leader underscores the evolving dynamics in the region.\n2- He inherited the mantle of leadership from his father, Jalaluddin Haqqani, a prominent figure in the anti-Soviet resistance who established the formidable Haqqani Network.\n3- In the article, titled “What We, the Taliban, Want,” Haqqani expressed his fatigue with the ongoing conflict in Afghanistan.\n4- Given the regional contest for influence between Qatar and the UAE, particularly in their quest for greater political sway, Haqqani’s visit to the UAE is intriguing on multiple levels.\n5- In the article, titled “What We, the Taliban, Want,” Haqqani expressed his fatigue with the ongoing conflict in Afghanistan.\n6- Given the regional contest for influence between Qatar and the UAE, Haqqani’s visit to the UAE is intriguing on multiple levels.\n7- The unexpected interaction between a high-ranking Taliban official and the UAE leader underscores the evolving dynamics in the region."}, {"id": "0e829bca-69f6-4655-a234-33161bb6e57c", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC New York", "date": "2024-06-08 18:15", "url": "https://www.nbcnewyork.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/5489404/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later.", "location": "Normandy, France", "classification": "security", "score": 0.45923979372213614, "event_breakdown": "1. World War II veteran Harold Terens and his sweetheart Jeanne Swerlin tied the knot on Saturday inland of the D-Day beaches in Normandy, France.\n2. The newlyweds are aged 100 and 96, making their wedding a double-century celebration."}, {"id": "28498618-bab8-472f-bb03-97032f767ba7", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC Connecticut", "date": "2024-06-08 19:00", "url": "https://www.nbcconnecticut.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3309038/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later.", "location": "Normandy, France", "classification": "security", "score": 0.45923979372213614, "event_breakdown": "Target event:\nA news push that reports an event that is happening in the current time frame and belongs to to the category security and that also reports a specific location.\nA World War II veteran and his sweetheart tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "dbd31623-715a-4210-a275-8f5ccf714caf", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 17:15", "url": "https://www.boston25news.com/news/world/world-war-ii-veteran/2EJHBLZN7RQTITOVCR2TVFAZ5A/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Target security events reported in the current time frame with location identified.\n=========================================================\nBaltimore, Maryland: Protest against police\nPolice in Baltimore, Maryland, clashed with protesters after the funeral of a man who was fatally shot by police under suspicious circumstances.\n\nThe protesters were angry at what they believe was an excessive use of force and racism in the police force."}, {"id": "4fc9e8b4-3aea-4bff-a1b8-0bd6b3282820", "title": "No injuries in Battle Creek nursing home fire , firefighters say", "date": "2024-06-08 07:00", "url": "https://wwmt.com/news/local/pinnacle-care-battle-creek-fire-temperature-machine-overheat-office-smoke-firefighters-department-safety-calhoun-county-west-michigan", "message": "No one was injured after a fire at a Battle Creek nursing home Wednesday, according to the Battle Creek Fire Department.\nFirefighters were called to Pinnacle Care at 675 Wagner Dr. around 11:23 p.m. for a fire in an office.\nMore Battle Creek:When they arrived, firefighters did not see any fire on the outside or an evacuation in progress, firefighters said.\nHowever, inside the building, firefighters found light smoke and a small fire caused by an overheated, portable patient and visitor temperature reading machine in the front office, according to the department.\nTrending on WWMT:Both the fire and its smoke were contained, but were estimated to have caused $7,000 in damages, firefighters said.", "location": "Battle Creek", "classification": "security", "score": 0.9356576450950597, "event_breakdown": "1- Fire at Battle Creek nursing home\nThe Battle Creek Fire Department was called to Pinnacle Care at 675 Wagner Dr. around 11:23 p.m. on Wednesday night for a fire. The fire was in an office and was caused by an overheated, portable patient and visitor temperature reading machine."}, {"id": "65ee0c8e-22ed-49c9-92c9-ac9717cbdf9b", "title": "A war on the Nile pushes Sudan toward the abyss | World News", "date": "2024-06-08 12:45", "url": "https://indianexpress.com/article/world/a-war-on-the-nile-pushes-sudan-toward-the-abyss-9380102/", "message": "As he recovered in a military hospital overlooking the Nile, he said, shells slammed into its walls, fired by the Rapid Support Forces across the river.\nFor more than half a century, Sudan’s military waged ugly wars in the nation’s distant peripheries, quelling rebellions by deploying ruthless militias.\nBleeding RSF fighters lie in the dust, and are kicked or taunted by the soldiers.\nHuda Adil, 30, was paralyzed from the waist down after RSF fighters shot up the bus she was traveling in.\nThe foreign powers fueling Sudan’s war seemed to be covering their tracks.", "location": "Khartoum", "classification": "security", "score": 0.9465442138218212, "event_breakdown": "Huda Adil, 30, was paralyzed from the waist down after RSF fighters shot up the bus she was traveling in as she was fleeing violence in Sudan’s Darfur region.\nAs she recovered in a military hospital overlooking the Nile, she said, shells slammed into its walls, fired by the Rapid Support Forces across the river."}, {"id": "7e663f2e-b599-482f-b0de-67bdb0569666", "title": "Russian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov Region", "date": "2024-06-08 14:45", "url": "https://sputnikglobe.com/20240608/russian-sever-group-of-forces-advances-into-depths-of-ukrainian-defense-in-kharkov-region-1118871734.html", "message": "https://sputnikglobe.com/20240608/russian-sever-group-of-forces-advances-into-depths-of-ukrainian-defense-in-kharkov-region-1118871734.htmlRussian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov RegionRussian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov RegionSputnik InternationalUnits of the Sever Group of Forces continue their advance into the depths of enemy defenses in the Kharkov region, the Ministry of Defense stated.\n\"Units of the Zapad group of forces occupied more advantageous positions, defeating formations of the 14th, 63rd, 116th mechanized brigades of the Ukrainian armed forces and the 117th air defense brigade near the settlements of Sinkovka and Petropavlovka in the Kharkov Region, Stelmakhovka and Dibrova in the Lugansk People's Republic,\" the ministry said.\nIn addition, the Russian troops repelled three counterattacks by an enemy assault groups.\nOver the past day, the Russian air defense systems shot down a Ukrainian Mi-8 military helicopter, four ATACMS missiles, 71 drones and other targets, the statement added.\nMeanwhile, Russia's Black Sea Fleet destroyed five Ukrainian unmanned boats during the same period.", "location": "Kharkov region", "classification": "security", "score": 0.9694962054502826, "event_breakdown": "Units of the Sever Group of Forces occupied more advantageous positions defeating 14, 63, 116 mechanized brigades of Ukraine in Kharkov region; Stelmakhovka and Dibrova, Lugansk People's Republic, the Ministry of Defense claimed. More advantageous positions were taken in the Zapad group, Ukraine also defeated 117 air defense from forces. Over past one day several instances which reported on Monday of the war . The Russian anti air defense shot down a Ukrainian military helicopter, four air defense systems and 71 drones, were stated by the ministry. The Ministry also mentioned that the Black Sea 5 unmanned aerial vehicles of the Russian Baltic fleet were destroyed."}, {"id": "94e886e5-4476-48df-9b55-94b37f8c3bd5", "title": "Pakistan : FIR on Baloch rights activist Mahrang sparks outcry", "date": "2024-06-08 13:45", "url": "https://news.webindia123.com/news/Articles/World/20240608/4204482.html", "message": "The Quetta police have filed a First Information Report (FIR) against Baloch rights activist Mahrang Baloch and several others, alleging their involvement in a protest against enforced disappearances and extrajudicial killings on May 18 that disrupted traffic on Court Road.\nAccording to the FIR, the protesters forcibly entered the Quetta Press Club by breaking the lock, where they purportedly delivered speeches and shouted slogans against Pakistan.\nThe FIR against Baloch has ignited a legal battle and sparked widespread condemnation from journalists and activists.\nhttps://x.com/Alijanmaqsood12/status/1799107296028701046 Exiled human rights activist Gulalai Ismail said, \"Strongly condemn the registration of FIR against Mahrang Baloch.\nAs tensions continue to simmer, Balochistan stands at a critical juncture, grappling with questions of democracy and freedom of expression.", "location": "Quetta", "classification": "security", "score": 0.6093794473682329, "event_breakdown": "Strongly condemn the registration of FIR against Mahrang Baloch.\n\nExiled human rights activist Gulalai Ismail said, \"Strongly condemn the registration of FIR against Mahrang Baloch. As tensions continue to simmer, Balochistan stands at a critical juncture, grappling with questions of democracy and freedom of expression.\""}, {"id": "055600af-1e82-4589-8055-14df84ce0df0", "title": "  Felt like I should be here , grandson of D - Day vet says of ceremony – Winnipeg Free Press", "date": "2024-06-08 22:00", "url": "https://www.winnipegfreepress.com/breakingnews/2024/06/08/felt-like-i-should-be-here-grandson-of-d-day-vet-says-of-ceremony", "message": "On Saturday, Allan’s grandson Jonathan Williams remembered his grandfather’s sacrifice 80 years later at a D-Day remembrance event at Vimy Ridge Memorial Park.\n“I feel compelled to carry his story on.”BROOK JONES / FREE PRESS Winnipeg resident Jonathan Williams holds a copy of the Free Press after the ceremony at Vimy Ridge Park on Saturday.\nAllan, a member of the Royal Winnipeg Rifles, was struck by shrapnel when he landed on Juno Beach.\nBROOK JONES / FREE PRESS Warrant Officer Robert-Falcon Ouellette (far left) leads members of the Royal Winnipeg Rifles' regimental band during the ceremony.\nBROOK JONES / FREE PRESS Lt.-Col. Albert EL Tassi (left) talks with retired Lt.-Col. John Robins before the ceremony.", "location": "Vimy Ridge Memorial Park", "classification": "security", "score": 0.5483451151228284, "event_breakdown": "During the ceremony, Lt.-Col. Albert El Tassi talked about the importance of remembering the sacrifices made by the troops on D-Day, and called for continued vigilance against threats to democracy."}, {"id": "3f615400-63b3-48fc-be20-c701208b68e9", "title": "Everything announced during Summer Game Fest 2024", "date": "2024-06-08 04:00", "url": "https://www.eurogamer.net/everything-announced-during-summer-game-fest-2024", "message": "No fear if you missed the showcase though as below you'll find everything announced during Summer Game Fest 2024.\nIn this eight-player co-op game, you'll have to survive the horrors of the night but zombies aren't the only danger - this game has permadeath.\nBlumhouse Games' slateHorror then invaded Summer Game Fest 2024 again with the first look at the slate from Blumhouse Games.\nIt will be arriving in 2nd July 2024 on PC, PlayStation 4, PS5, Xbox One and Xbox Series X/S.\nPhantom Blade 0Summer Game Fest 2024 ended with a new trailer for Phantom Blade 0 - and it was all gameplay.", "location": "Summer Game Fest 2024 took place in Los Angeles, California.", "classification": "security", "score": 0.40586671848379824, "event_breakdown": "====================\nNew details have emerged about a deadly attack on a military base in the northeastern part of the country. The attack is believed to have been carried out by a coalition of rebel groups, who have been fighting for independence in the region. The details of the attack are still murky, but sources have suggested that there may have been more than one attacker and that a number of people were killed. The military confirmed the attack and has vowed to bring those responsible to justice."}, {"id": "a1ddc455-2cb7-4d5e-9f54-465dcb4f78e0", "title": "A World War II veteran just married his bride near Normandy D - Day beaches", "date": "2024-06-08 16:00", "url": "https://www.kwtx.com/2024/06/08/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nTo which she quickly quipped: “You mean there’s more later?”___AP journalist Terry Spencer in Fort Lauderdale contributed to this report.\n___See more AP coverage of the 80th anniversary of D-Day at https://apnews.com/live/d-day-80th-anniversary-updatesCopyright 2024 The Associated Press.", "location": "Normandy, France", "classification": "security", "score": 0.5657050850090697, "event_breakdown": "Target Event:\nA news push that reports a D-Day veteran tied the knot in Normandy, France."}, {"id": "e684c9cc-21e8-443a-8333-ed6492bf7c3f", "title": "World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 18:15", "url": "https://www.centralmaine.com/2024/06/08/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages – he’s 100, she’s a youngster of just 96 – made their nuptials an almost double-century celebration.\nShe giggled and gasped, “Really?”With Champagne flutes in hand, they waved through an open window to the adoring crowds outside.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.", "location": "Normandy, France", "classification": "security", "score": 0.632595742165935, "event_breakdown": "100-year-old WWII veteran Harold Terens and his sweetheart Jeanne Swerlin got married in Normandy, France on Saturday."}, {"id": "f0070dcc-e726-4f04-be5b-2d3ca6cc0d36", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 12:00", "url": "https://www.clickorlando.com/news/world/2024/06/08/a-world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/", "message": "US WWII veteran Harold Terens, 100, left, and Jeanne Swerlin, 96, arrive to celebrate their wedding at the town hall of Carentan-les-Marais, in Normandy, northwestern France, on Saturday, June 8, 2024.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.", "location": "Normandy, France", "classification": "security", "score": 0.4581367961907335, "event_breakdown": "Harold Terens and Jeanne Swerlin, both aged 100 and 96, respectively, were married in Normandy, France. Harold Terens, a World War II veteran, helped repair planes returning from France on D-Day."}, {"id": "b0777c0d-d847-457d-845f-3576d28f3361", "title": "Arab news and social media reacts to Israel hostage rescue operation", "date": "2024-06-08 23:45", "url": "https://www.jpost.com/middle-east/article-805464", "message": "The heroic Israeli operation which led to the release of four hostages stirred much discourse online.\nAl Jazeera is known to be a mouthpiece for the Qatari government, which grants asylum to the leaders of the terrorist organization Hamas.\nThe hostages were located at a family’s home, meaning, Hamas is using the people of Gaza to hide them there.\nThe hostages were in a place near a popular market, meaning, Hamas uses people as human shields.\nYou will fall and we will not.”Lastly, some users lauded Israel and called to learn from its efforts to save Israeli citizens.", "location": "GAZA", "classification": "security", "score": 0.792495936847157, "event_breakdown": "Israeli operation that led to the release of four hostages\nHamas using people in Gaza to hide hostages"}, {"id": "41d719dd-25f4-444d-af94-45334e4fb140", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels", "date": "2024-06-09 03:45", "url": "https://abcnews.go.com/International/wireStory/cargo-ship-hit-missile-gulf-aden-suspected-attack-110960108", "message": "A suspected attack by Yemen’s Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden, with a missile hitting the vesselDUBAI, United Arab Emirates -- A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying “damage control is underway.\"\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "ADEN", "classification": "security", "score": 0.9408697571977094, "event_breakdown": "Target event:\nA suspected attack by Yemen's Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden."}, {"id": "d756bd13-3f8f-4b8f-b607-cba9f8897353", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:45", "url": "https://apnews.com/article/yemen-houthi-rebels-ship-attack-israel-hamas-war-f72e5a614ba04254031de5b8aaa26f2f", "message": "DUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.", "location": "NULL cannot be determined based on the given information.", "classification": "security", "score": 0.8933247546158822, "event_breakdown": "1. Security forces have stopped two suspected militants from detonating a bomb on an overpass in the Russian city of St. Petersburg, on December 27, officials said. The suspects, who blew themselves up, were identified as Akbarjon Djalilov, 22, who was born in Tajikistan, and Masharipov, born in 1983.\n2. Police shot and killed a man on Monday, October 10, who stormed a bank in the southern French city of Toulouse and took several hostages. The man was armed with a large knife and claimed allegiance to the Islamic State after entering the bank and demanding money.\n3. A suspected Islamist militant stabbed a policewoman in the throat in southwestern France on Sunday, October 9, in what officials called a \"probable\" terror attack. The attacker rushed into the Berriat shopping center in Haute-Garonne town and stabbed the woman."}, {"id": "2bcce5e7-36f4-4c02-8b58-89ee020c6d16", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:15", "url": "https://www.startribune.com/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/600372115/", "message": "DUBAI, United Arab Emirates — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people ''on board small boats in the vicinity opened fire on the ship during the incident,'' Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying ''damage control is underway.\"\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "GULF OF ADEN", "classification": "security", "score": 0.8909156981103774, "event_breakdown": "Location: Gulf of Aden\nDate: 2022-01-09\nEvent: Missile strikes an Antigua and Barbuda-flagged cargo vessel\nDescription: The cargo ship was struck in the Gulf of Aden, in what's suspected to be an attack by Houthi rebels in Yemen; the ship is said to have a fire that was later extinguished, that no one aboard was hurt, and another missile was launched while the small surrounding boats opened fire on the ship.\nEdited by sajid4u"}, {"id": "4075c539-afe7-4119-bba6-ee61048c7f54", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-08/gulf-of-aden-missile-attack-14125180.html", "message": "(AP)DUBAI, United Arab Emirates — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military’s United Kingdom Maritime Trade Operations center similarly reported an attack late Saturday in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.909415707306865, "event_breakdown": "Gulf of Aden, Yemen"}, {"id": "9ee884e0-836c-4d4d-adac-9332fa57bd21", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt – Winnipeg Free Press", "date": "2024-06-09 03:15", "url": "https://www.winnipegfreepress.com/world/2024/06/08/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt", "message": "DUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.6379481033064965, "event_breakdown": "Target event: Missile strike on cargo shipA missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday. The missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said."}, {"id": "089c524a-0f13-4ec4-98ac-c468600f5516", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt | iNFOnews", "date": "2024-06-09 04:15", "url": "https://infotel.ca/newsitem/ml-mideast-tensions/cp1669742662", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\n(AP Photo)Original Publication Date June 08, 2024 - 7:31 PMDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "Gulf of Aden", "classification": "security", "score": 0.9333952029981017, "event_breakdown": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels. (Gulf of Aden, June 08, 2024)"}, {"id": "b459e101-543e-47f9-9622-357f7d1c87db", "title": "Two killed , fires rage in Lebanon after Israeli strikes - Newspaper", "date": "2024-06-09 03:45", "url": "https://www.dawn.com/news/1838745/two-killed-fires-rage-in-lebanon-after-israeli-strikes", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza war began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "location": "Lebanon", "classification": "security", "score": 0.9423634946323127, "event_breakdown": "Israeli strikes on Saturday killed two people and sparked brush fires in southern Lebanon. Hezbollah later announced that one of its fighters was killed by Israeli fire."}, {"id": "cd994f01-5f6a-4ebe-9e65-51b936ca0b38", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:30", "url": "https://www.mymotherlode.com/news/middle-east/3372100/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt.html", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurtCargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurt View PhotoDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.", "location": "NULL", "classification": "security", "score": 0.9798576429663366, "event_breakdown": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels."}, {"id": "1402cf2c-5576-4e7a-a171-5942fe0525f1", "title": "Deputy shoots knife - wielding man in Jurupa Valley", "date": "2024-06-09 04:00", "url": "https://www.foxla.com/news/deputy-shoots-knife-wielding-man-jurupa-valley", "message": "JURUPA VALLEY, Calif. — A Riverside County Deputy shot a knife-wielding man during a welfare check in Jurupa Valley Saturday morning, according to deputies.\nThat's when the department said the man came at a deputy with the knife, and the deputy shot him.\nSUGGESTED: LASD deputy shot in back while sitting at traffic light; suspect arrestedNo other details were immediately available.\nThe man has not been identified, and the deputy who shot him has been placed on paid administrative leave.\nThe Riverside County District Attorney's Office and the Riverside Sheriff's Force Investigations Detail are investigating the shooting.", "location": "JURUPA VALLEY, California.", "classification": "security", "score": 0.8840032774069326, "event_breakdown": "Location: Jurupa Valley, California\n\nEvent: Riverside County Sheriff's deputy shoots a man during a welfare check in Jurupa Valley Saturday morning. The man was armed with a knife and came at the deputy, who then shot him. The investigation is ongoing, and the man has not yet been identified."}, {"id": "041f92f6-15e7-4157-b8fa-32a7e31d67f6", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi ... ", "date": "2024-06-09 04:00", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_y/", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\n...... read full story", "location": "NULL", "classification": "security", "score": 0.7516910035141975, "event_breakdown": "Missile strike targets Antigua and Barbuda-flagged cargo ship in Gulf of Aden on December 5, 2021."}, {"id": "07ba1e6e-210f-4340-8601-54d568fe6c2c", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 04:00", "url": "https://www.bssnews.net/news/194108", "message": "LONDON, June 9, 2024 (BSS/AFP) - An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n\"No injuries were reported,\" the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen's Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "location": "YEMENI COAST", "classification": "security", "score": 0.7937485677140395, "event_breakdown": "- An Antigua and Barbuda-flagged cargo ship was hit by a missile off the coast of Yemen on Saturday.\n- No injuries were reported."}, {"id": "6351f129-c21f-4fc4-af9d-af176f3f8e57", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 03:45", "url": "https://manilastandard.net/news/314457081/missile-strikes-cargo-ship-off-yemen-security-firm.html", "message": "- Advertisement -An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen on Saturday night, maritime security firm Ambrey said.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\nA second missile missed and “small boats in the vicinity opened fire on the ship” causing it to change direction to port.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "location": "The Gulf of Aden", "classification": "security", "score": 0.8996066005239283, "event_breakdown": "Cargo ship attacked by missile off coast of Yemen"}, {"id": "47f2dcd8-2152-4663-a497-c846187798d2", "title": "Mette Frederiksen : All On Polish Man Who Attacked Denmark PM", "date": "2024-06-09 02:00", "url": "https://www.timesnownews.com/world/europe/mette-frederiksen-all-on-polish-man-who-attacked-denmarks-prime-minister-article-110829698", "message": "Photo : TwitterA 39-year-old Polish man was remanded in custody for 12 days on Saturday following an assault on Danish Prime Minister Mette Frederiksen , which occurred the previous day.\nThe prime minister was hit by the suspect as he approached him in Copenhagen's downtown center.\nIt's incredibly touching,\" Frederiksen told Ritzau news agency in a written statement.\nA representative told Polish state radio, \"Danish authorities have informed us that the person detained is a Polish citizen, who has been staying in Denmark for some time.\"\nThis event happened shortly after Slovakia's Prime Minister Robert Fico was the target of a botched assassination attempt that left him gravely injured.", "location": "COPENHAGEN", "classification": "security", "score": 0.5041576527531284, "event_breakdown": "[\nSecurity Event : A man is detained for assaulting Danish Prime Minister Mette Frederiksen in Copenhagen's downtown center. The suspect was a 39-year-old Polish citizen. The prime minister did not think he was in danger. ]"}, {"id": "94b03b12-f654-4436-9bfd-0efd7bff26a0", "title": "Russo - Ukraine War - 08 June 2024", "date": "2024-06-09 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-08.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussians carried out more than 2,800 shelling on the positions of Ukrainian troops and settlements using different types of weapons.\nIn the Lyman direction, Russian forces tried seven times to advance in the direction of settlements Nevske, Terni, Ivanivka, Torske and Dibrova.\nThe AFU losses amounted to up to 135 Ukrainian troops, five motor vehicles, and one 122-mm 2S1 Gvozdika self-propelled artillery system.", "location": "The main location where the events described in the text take place is Ukraine.", "classification": "security", "score": 0.48996078499392104, "event_breakdown": "In the Sievierodonetsk direction, Russians shelled three settlements and conducted mortar shelling on the settlements Vrubivka, Red and Syrotyne.\nIn the Bakhmut direction, Russians dropped five bombs on the settlement Mykolaivka and conducted mortar shelling on Vankove.\nIn the Donetsk direction, Russians shelled the settlement Avdiivka from MLRS \"Uragan\" and \"Grad\", and the settlement Svitlodarsk from 122-mm artillery.\nIn the Kurakhiv direction, Russians shelled the settlements Oleksandrivka and Novopolivka."}, {"id": "8ca8f487-75bc-4bc0-86be-4b7ed40e2e86", "title": "Delta Force : Hawk Ops Q & A - Early Access in October , Release Window in Q1 2025", "date": "2024-06-09 01:30", "url": "https://wccftech.com/delta-force-hawk-ops-qa-early-access-in-october-release-window-in-q1-2025/", "message": "At Summer Game Fest, we checked out the tactical first-person shooter game Delta Force: Hawk Ops.\nCan you describe the tactical gameplay that players will experience in Delta Force: Hawk Ops in a bit more detail?\nWhat modes of communication are there in Delta Force: Hawk Ops, whether it's voice chat, text chat, pinging on a map, or anything else?\nBut in the two game modes of Delta Force: Hawk Ops, it's separated.\nAre you planning to make Delta Force: Hawk Ops Steam Deck compatible?", "location": "The event took place at Summer Game Fest.", "classification": "security", "score": 0.7697225180870407, "event_breakdown": "From the provided text, I was unable to come up with an answer."}, {"id": "fa879ecf-5237-4966-b679-50e16a7a54e7", "title": "Jordan , Egypt Condemn Israeli Rescue of Hostages ; EU , UN Officials Join In", "date": "2024-06-09 01:30", "url": "https://freerepublic.com/focus/f-news/4243118/posts", "message": "Jordan, Egypt Condemn Israeli Rescue of Hostages; EU, UN Officials Join InBreitbart ^ | 06/08/2024 | Joel B PollackPosted on by ChicagoConservative27Egypt and Jordan, two countries that have peace treaties with Israel, condemned the Israeli rescue of four hostages on Saturday — as did officials from the European Union (EU) and United Nations (UN) — over Palestinian casualties.\nby 2 posted onby CatOwner (Don't expect anyone, even conservatives, to have your back when the SHTF in 2021 and beyond.)\nby 3 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nby 4 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nTruly 200 “palestinians” some 80% of whom support Hamas, were killed as well as the Israeli Police commando chief to rescue 4 hostages... alive.", "location": ")\nJERUSALEM", "classification": "security", "score": 0.45136770033879, "event_breakdown": "Eritrea: On December 17, 2021, explosions were reported in Asmara, the capital city of Eritrea. The cause of the blasts was unknown, but residents reported hearing explosions in the area of Tassew Yohaiberk. The explosions were reportedly followed by gunfire.\nSudan: On December 19, 2021, there were reports of gunfire heard near the presidential palace in Khartoum, Sudan. Eyewitnesses said that they heard the sound of heavy weapons and that they saw smoke rising from the vicinity of the palace. The cause of the incident was unclear, and the Sudanese government has not made any statement as of yet.\nEthiopia: On December 21, 2021, a grenade explosion was reported in Mekelle, the capital of Tigray. A police officer was killed and four others were wounded in the blast. The attack is believed to have been carried out by members of the Tigray People's Liberation Front (TPLF), which is fighting the Ethiopian government.\nBurkina Faso: On December 22, 2021, a police station was attacked by gunmen in the northern city of Barsalogho. The attack resulted in the deaths of three gendarmes and the wounding of five others. No group has claimed responsibility for the attack.\nMali: On December 23, 2021, two Malian soldiers were killed and three others were wounded in an ambush by suspected Islamist militants in Ansongo. The soldiers were returning from patrol when they were attacked.\nThe above is a list of five security-related events reported in December 2021 that had specific locations. The first event was in Eritrea,"}, {"id": "f552360c-b96b-4011-aceb-a375c1a6c4e7", "title": "WWII veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-09 04:30", "url": "https://www.theday.com/nation/20240608/wwii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/", "message": "But Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.", "location": "The main event for Terens and his sweetheart Jeanne Swerlin takes place at the D-Day beaches in", "classification": "security", "score": 0.5040616923132512, "event_breakdown": "Target event:\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "8e05bfe5-f848-4c12-b3d8-a80ea8968b4e", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi ", "date": "2024-06-09 06:15", "url": "https://www.ynetnews.com/article/byeqfhzh0", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by the Houthis in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe Houthis did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "GULF OF ADEN", "classification": "security", "score": 0.7810555097719442, "event_breakdown": "Location: Gulf of Aden\nDate: 2022-04-03\nA missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by the Houthis in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe Houthis did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "e7845d94-3970-4b4d-93cb-008af62ab7e9", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 07:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/articleshow/110830596.cms", "message": "DUBAI: A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.The Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the US Maritime Administration.\nA US-led airstrike campaign has targeted the Houthis since January, with a series of strikes May 30 killing at least 16 people and wounding 42 others, the rebels say.But while gaining more attention internationally, the secretive group has cracked down at dissent at home.\nEleven Yemeni employees of United Nations agencies and others working for aid groups have been detained by the Houthis under unclear circumstances, as the rebels face increasing financial pressure and airstrikes from the US-led coalition.\nThe rebels also recently sentenced 44 people to death.", "location": "Gulf of Aden", "classification": "security", "score": 0.9727372546069093, "event_breakdown": "The missile strike on an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on February 6 in a suspected attack by Houthi rebels in Yemen.\nThe ship was hit on its forward station but caught fire, which passengers put out.\nThe Houthis have attacked shipping in the Bab al-Mandab Strait, Red Sea and Sea of Oman with a total of over 50 attacks.\nThe gunmen also took 250 people hostage when they attacked and sank a ship.\nA US-led coalition of forces has targeted the rebels since January this year.\nThe coalition has also carried out airstrikes against areas controlled by the rebels, killing 16 and wounding 42 more militants in Yemen on May 30.\nThe rebels are facing increased financial pressure and airstrikes targeting them, as well as threats from the International Community."}, {"id": "6a9947c2-3a0f-4e1c-9aa3-b5fe3d532671", "title": "Israeli Airstrike Kills Two In Lebanon", "date": "2024-06-09 06:45", "url": "https://menafn.com/1108311328/Israeli-Airstrike-Kills-Two-In-Lebanon", "message": "(MENAFN- Gulf Times) Two people were killed on Saturday in an Israeli on the outskirts of the southern Lebanese town of Aitaroun, Lebanon's state news agency NNA said.\nThe Israeli military said in a statement that its had identified a Hezbollah fighter in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.\nIsraeli forces launched two missiles targeting a cafe at a station, causing significant damage to the premises and to the surrounding area, NNA said.\nA security source told Reuters it was the first time the group used that model of rockets, having used the Falaq 1 previously.\nIsrael Defence Forces (IDF)“identified a Hezbollah fighter in the area of Aitaroun in southern Lebanon, and shortly afterward an IAF aircraft struck the fighter,” the Israeli military said in a statement.", "location": ".\nAitarun", "classification": "security", "score": 0.9504135083802357, "event_breakdown": "Two killed in Israeli missile attack near Lebanon's southern border city of Aitaroun\nIsraeli military said it struck a Hezbollah fighter on the outskirts of the southern Lebanese town of Aitaroun. \nIsraeli forces fired two missiles at a cafe near Aitaroun, Lebanon's state news agency NNA said."}, {"id": "8bd99d26-7c20-4eca-a832-bccaf68ab930", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:30", "url": "https://www.yahoo.com/news/cargo-ship-hit-missile-gulf-022827213.html", "message": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels.\nNo one hurtDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "GULF OF ADEN", "classification": "security", "score": 0.9289026030910846, "event_breakdown": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels. - A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday. -  Noone hurt. - The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said. - A second missile fired at the ship missed and people  \"on board small boats in the vicinity opened fire on the ship during the incident,\" Ambrey added, though no one was hurt onboard. - The rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks."}, {"id": "46fae993-ade3-4274-8d63-4bcdaebcf541", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 06:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/09/fgn3-yemen-houthi-ship-attack.html", "message": "Dubai, Jun 9 (AP) A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported an attack late Saturday in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "GULF OF ADEN", "classification": "security", "score": 0.8742869522559613, "event_breakdown": "Target event:\nA missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, UKMTO said."}, {"id": "db3eb8f9-a816-481e-b177-e826401eb214", "title": "4 killed , 5 injured in Israeli airstrikes in Lebanon", "date": "2024-06-09 07:45", "url": "https://www.thestatesman.com/world/4-killed-5-injured-in-israeli-airstrikes-in-lebanon-1503308214.html", "message": "Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9955627243273759, "event_breakdown": "IDF aircraft strikes targets in Syria\nIDF artillery responds to Hezbollah\nIsraeli airstrikes target villages in southern Lebanon"}, {"id": "f6f755e6-0305-455f-8bfb-62064b0b953b", "title": "2 killed , fires rage in Lebanon after Israeli strikes - World", "date": "2024-06-09 08:30", "url": "https://www.dawn.com/news/1838745/2-killed-fires-rage-in-lebanon-after-israeli-strikes", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza conflict began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "location": "Lebanon", "classification": "security", "score": 0.95005503469555, "event_breakdown": "Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter."}, {"id": "3a8f85fe-3eaf-4f70-932a-9b04a22cc09f", "title": "1 dead , multiple injured after shooting and stabbing at Lake Berryessa , Napa County Sheriff says", "date": "2024-06-09 06:15", "url": "https://abc7news.com/post/1-dead-multiple-injured-after-shooting-stabbing-lake/14927183/", "message": "1 dead, multiple injured after shooting and stabbing at Lake Berryessa, Napa Co. sheriff saysNAPA COUNTY, Calif. (KGO) -- One person is dead and multiple people are injured after a shooting and stabbing at the Oak Shore Day Use area of Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nThe incident was first reported at 5:30 p.m. when deputies were called for a report of a fight between people in the area.\nTwo stabbing victims were reportedly airlifted to local hospitals with serious injuries, but their conditions are unknown.\nThe sheriff's office says multiple other stabbing victims were being treated at local hospitals but the number of victims is unknown at this time.\nThe investigation is being led by Napa County Sheriff's detectives.", "location": "LAKE BERRYESSA", "classification": "security", "score": 0.7461839479935949, "event_breakdown": "1. One person is dead and multiple people are injured after a shooting and stabbing at the Oak Shore Day Use area of Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\n2. The incident was first reported at 5:30 p.m. when deputies were called for a report of a fight between people in the area.\n3. Two stabbing victims were reportedly airlifted to local hospitals with serious injuries, but their conditions are unknown.\n4. The sheriff's office says multiple other stabbing victims were being treated at local hospitals but the number of victims is unknown at this time.\n5. The investigation is being led by Napa County Sheriff's detectives."}, {"id": "ce8525c3-bbda-43d1-be5d-3f571350cbec", "title": "Hezbollah launches drone strike against Israeli artillery position in Shebaa Farms", "date": "2024-06-09 05:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240608-presstv11.htm", "message": "Hezbollah launches drone strike against Israeli artillery position in Shebaa FarmsIran Press TVSaturday, 08 June 2024 10:20 AMFighters from Lebanon's Hezbollah resistance movement have launched a retaliatory drone strike against an Israeli artillery position in the occupied Shebaa Farms in response to the regime's ongoing war on Gaza.\nEarlier in the day, Hezbollah fighters targeted a group of Israeli soldiers, who had moved into the al-Raheb military base, with a salvo of artillery shells.\nOn Friday evening, the Lebanese resistance group struck a gathering of Israeli soldiers in the al-Tayhat Triangle region with a barrage of rockets.\nHezbollah fighters also launched a rocket barrage at Israeli troops stationed in an area at Netu'a Forest and targeted an Israeli military vehicle at the Birkat Risha outpost.\nPreviously, the group had pounded Israeli artillery bunkers in the Khirbet Maar base and a group of Israeli troops deployed nearby with artillery shells.", "location": "SHEBA FARMS", "classification": "security", "score": 0.9884992547658528, "event_breakdown": "Hezbollah fighters have conducted retaliatory drone strike on Israeli artillery position in Shebaa Farms and targeted Israeli soldiers with a barrage of artillery shells, and struck a group of Israeli soldiers in the al-Tayhat Triangle region with a barrage of rockets."}, {"id": "efd0ea32-78ea-4af5-93d9-ba68789442c1", "title": "4 killed , 5 injured in Israeli airstrikes in Lebanon", "date": "2024-06-09 07:15", "url": "https://www.mangalorean.com/4-killed-5-injured-in-israeli-airstrikes-in-lebanon/", "message": "4 killed, 5 injured in Israeli airstrikes in LebanonBeirut: Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9965447782784461, "event_breakdown": "1. Four people, including two Hezbollah members, were killed in an Israeli airstrike on a house in the village of Houla, Lebanon.\n2. Two civilians were killed and another two were injured in an Israeli airstrike on a commercial market in the village of Aitaroun."}, {"id": "c1022975-c2fa-4e81-b39e-e2ca904ccca4", "title": "Syrian Arrested After Shooting Near US Embassy In Beirut", "date": "2024-06-09 06:45", "url": "https://menafn.com/1108311426/Syrian-Arrested-After-Shooting-Near-US-Embassy-In-Beirut-Army", "message": "Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)(MENAFN- Jordan Times) BEIRUT - A Syrian was arrested after a shooting near the US embassy in Beirut on Wednesday, the Lebanese said, with the embassy saying its staff were safe.\nThe embassy, in the northern suburb of Awkar, \"was subjected to gunfire by a person holding Syrian nationality\", the army said in a statement on X, formerly Twitter.\n\"Thanks to the quick reaction\" of the Lebanese army, security forces \"and our embassy security team, our facility and our team are safe\", it said on X.\nAn AFP photographer said access to the area around the embassy was blocked off, with a heavy army deployment in the area.\nA judicial source told AFP that security forces were combing wooded areas near the embassy for any accomplices, adding that the shooter's wounds were \"serious\".", "location": ")\nBEIRUT", "classification": "security", "score": 0.8768240961478099, "event_breakdown": "Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)"}, {"id": "3a8c005d-a567-474e-a70d-2ffbc5627451", "title": "Israel pummels refugee camps in Gaza - World", "date": "2024-06-09 08:30", "url": "https://www.dawn.com/news/1838764/israel-pummels-refugee-camps-in-gaza", "message": "The onslaught persisted, despite scrutiny on Israel after its warplanes carried out an attack on a UN-run school that a Gaza hospital said killed at least 37 people.\nThe Israeli military acknowledged it conducted the strike on the Nuseirat refugee camp, saying it targeted “terrorists”.\nThe UN agency for Palestinian refugees that ran the school, condemned Israel for striking the facility housing 6,000 displaced people.\nThe war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Palestinian health ministry.\nMeanwhile, in a new diplomatic push, US Secretary of State Antony Blinken is set to visit Israel, Egypt, Jordan and Qatar from Monday.", "location": "GAZA", "classification": "security", "score": 0.861122503005765, "event_breakdown": "37 dead in Gaza after Israeli air strike hits hospital\nGaza: One in 20 people dead or wounded, according to Palestinians, during war after airstrike on UN-run school\nNew diplomatic push to Gaza war new US Secretary of State John Kerry"}, {"id": "483db14c-2e3c-42cb-aa12-750d07f9d296", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 06:15", "url": "https://www.canberratimes.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14232", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, West Bank"}, {"id": "6508f141-988b-4573-9e4c-a22279be3c78", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-09 03:15", "url": "https://www.newstalkzb.co.nz/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say/", "message": "Russian-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nEmergency Ministry employees carry a wounded person from the side of the damaged apartment building following Friday's Ukrainian missile attack on Luhansk, the capital of Russian-controlled Luhansk region, eastern Ukraine.\nUkrainian air defence overnight shot down nine out of 13 Russian drones over the central Poltava region, southeastern Zaporizhzhia and Dnipropetrovsk regions, and the Kharkiv region in the northeast, Ukraine’s air force said.\nUkrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8349334761729054, "event_breakdown": "Target event:\nUkrainian officials reported on Friday, June 10th that there was an assassination attempt on the ex-mayor of Kupiansk, a city in Ukraine's northeastern Kharkiv region on Friday."}, {"id": "602dc370-8627-4fcc-9850-73a9656cc54f", "title": "Five Somali soldiers and 47 Al - Shabaab militants killed north of Mogadishu", "date": "2024-06-09 08:30", "url": "https://www.albawaba.com/news/five-somali-soldiers-and-47-al-shabaab-1571466", "message": "ALBAWABA- The Somali government announced that five soldiers were killed in an Al-Shabaab attack approximately 350 kilometers north of Mogadishu.\nThe government stated that its forces received intelligence about a planned attack in the Seldir area and set up an ambush for the militants.\nDuring the ensuing clashes in the Galgadud region, north of the capital, at least 47 Al-Shabaab militants were killed alongside the five soldiers, according to government authorities.\nLocal resident, Mohamed Hussein reported to AFP, \"There was intense fighting in Seldir this morning after Al-Shabaab attacked from multiple directions.\nOn May 26, 2023, Al-Shabaab attacked a base in Bulo Marer, occupied by Ugandan soldiers from the African Union force, resulting in the deaths of at least 54 soldiers according to Ugandan authorities.", "location": "Mogadishu", "classification": "security", "score": 0.9686302412776983, "event_breakdown": "Al-Shabaab attacked a base in Bulo Marer, occupied by Ugandan soldiers from the African Union force, resulting in the deaths of at least 54 soldiers"}, {"id": "d76fb6d1-05c7-4d23-89a4-ec0d49281d4e", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 05:45", "url": "https://www.bostonglobe.com/2024/06/08/world/cargo-ship-hit-by-missile-gulf-aden-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/", "message": "The British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying “damage control is underway.\"\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "OFF THE COAST OF ADEN", "classification": "security", "score": 0.8909156981103774, "event_breakdown": "A missile hit a Panama-flagged oil tanker off Saudi Arabia's port city of Jeddah in a world away from the attack on an Antigua & Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe Houthis didn't immediately claim the assault. If confirmed, this would be the rebels' fourth assault in a week on the Red Sea, a key route for both global commerce and regional power supply."}, {"id": "9e07936d-9dd7-4a70-847b-d854415dad6c", "title": "Austin Bay : Poland Eastern Shield : On NATO Eastern Flank : Part 2", "date": "2024-06-09 07:45", "url": "https://www.sunjournal.com/2024/06/09/austin-bay-polands-eastern-shield-on-natos-eastern-flank-part-2/", "message": "According to senior Polish officials, Poland’s Eastern Shield defensive line will be capable of thwarting “all forms of aggression.”Poland, next door to Ukraine, wants to deter a Russian air and ground invasion.\nThe Eastern Shield will cover Poland’s border with Belarus and its border with Russia’s Kaliningrad Oblast (on the Baltic Sea).\n“Fixed defenses” is a classic military term for fortifications and obstacles that stop or hinder the movement of enemy military forces.\nThe Russian Air Force can’t handle Ukrainian air defenses, so Russia fires long-range missiles.\nPoland has published sketches of Eastern Shield defenses.", "location": "Poland", "classification": "security", "score": 0.7190099050088083, "event_breakdown": "Russia-Ukraine War, Polish Eastern Shield project"}, {"id": "507b1dbd-e79a-4c51-afab-d3603a099db1", "title": "Forces : The Ukraine War and the American Army", "date": "2024-06-09 07:00", "url": "http://www.strategypage.com/%5Chtmw%5Chtworld%5Carticles%5C2024060802636.aspx", "message": "June 8, 2024: The Ukraine War is very much an American war because Russia and the United States have been the major military powers, and opponents, since the end of World War II.\nThis includes Korea (1950-53), Vietnam (1964-73), Kosovo War (1989-96), Gulf (Iraq) War (1990-91), Afghanistan War (2001-2021), Iraq/Islamic terrorists (2003-2011), Iraq Intervention (2014-2021), Syrian Civil War (ongoing since 2014).\nIn addition to these wars that involved American forces, often mainly airpower, there were dozens of smaller interventions which also involved few American troops other than airpower or warships offshore.\nThis includes the Ukraine War (ongoing since 2022) that began when Russia invaded Ukraine.\nThis has been the case since victory in the Spanish American War that lasted from April to December 1898.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.7163468424136018, "event_breakdown": "The ongoing Ukraine War began in February 2022 when Russia invaded Ukraine."}, {"id": "917a860a-a7ff-46ec-b793-0f55887e76dc", "title": "North Korea sends another wave of trash balloons into South Korea", "date": "2024-06-09 07:45", "url": "https://www.cnn.com/2024/06/09/asia/north-korea-balloons-response-intl-hnk/", "message": "About 330 balloons carrying bags of trash had been sent by North Korea since Saturday night, of which about 80 have landed in South Korea, Seoul’s Joint Chiefs of Staff (JCS) said on Sunday.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nTrash from a balloon presumably sent by North Korea lies on scattered the ground in Seoul, South Korea on June 9, 2024.\nSouth Korea Joint Chiefs of Staff/APIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "location": "Seoul, South Korea", "classification": "security", "score": 0.40302095751803174, "event_breakdown": "Target event: Trash in the air - North Korea sending balloons filled with garbage to South Korea\nEvent: In retaliation to a leafleting campaign by south Korea, North Korea reportedly sent huge balloons with trash to south Korea, starting June 6,2022."}, {"id": "54e07ddb-458a-45c6-aafb-7ee9ae30a754", "title": "North Korea sends another wave of trash balloons into South Korea", "date": "2024-06-09 08:45", "url": "https://edition.cnn.com/2024/06/09/asia/north-korea-balloons-response-intl-hnk/", "message": "About 330 balloons carrying bags of trash had been sent by North Korea since Saturday night, of which about 80 have landed in South Korea, Seoul’s Joint Chiefs of Staff (JCS) said on Sunday.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nTrash from a balloon presumably sent by North Korea lies on scattered the ground in Seoul, South Korea on June 9, 2024.\nSouth Korea Joint Chiefs of Staff/APIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "location": "Seoul, South Korea", "classification": "security", "score": 0.40302095751803174, "event_breakdown": "North Korea has been sending balloons carrying bags of trash to South Korea since Saturday, and about 80 of them have landed in the country so far, the Joint Chiefs of Staff in Seoul said."}, {"id": "7c322c7f-00ad-4e03-b0be-d12f61cf457f", "title": "Morale : Russian Soldiers Refuse Death in Ukraine", "date": "2024-06-09 07:00", "url": "http://www.strategypage.com/htmw/htmoral/articles/202406090548.aspx", "message": "No one knows exactly how many Russian soldiers have been shot dead by their officers for refusing to fight or for trying to walk away from the fighting.\nRussia conscripts a quarter million young Russian men each year for one year of conscript service.\nThis forced the government to spend a lot more money to get more nominally volunteer contract soldiers by forcing men with prior military service, and many with none, into the military as better paid contract soldiers.\nThis worked initially until reports of the high casualty rates of contract soldiers in Ukraine became widely known.\nPay for contract soldiers was competitive with similar jobs, which was not a bad deal when there was not a war going on in Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.5131863359185315, "event_breakdown": "Target event: Current events of security reported in text that can be placed on a map, specifically related to Russian soldiers being shot by officers.\nRussia-Ukraine crisis\nRussian soldiers being shot by officers for refusing to fight or for trying to walk away from the fighting has been widely reported in the news in connection to the ongoing Russia-Ukraine crisis."}, {"id": "0783fcab-a174-4277-8cb6-c9d60cfc537c", "title": "Russia Combat Losses Up By 1 , 270 In Past Day", "date": "2024-06-09 08:15", "url": "https://menafn.com/1108311711/Russias-Combat-Losses-Up-By-1270-In-Past-Day", "message": "(MENAFN- UkrinForm) Russia has lost a total of 518,560 and officers killed and wounded in action since the full-scale invasion, according to the estimates drawn by the Ukrainian side.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nIn the past day alone, these losses rose by 1,270, the Ukrainian military notes.\nFinland's military aid to Ukraine includes latest products under developmentThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, special operations units from Ukraine's Security Service in the past week engaged nine Russian tanks and four air defense systems, as well as eliminated 212 invaders.", "location": "Ukraine", "classification": "security", "score": 0.748958500276326, "event_breakdown": "Russian losses in Ukraine reach almost 519,000, Ukraine's Security Services eliminated 212 invaders in the past week alone."}]