[{"id": "db6fd5d7-389e-4123-8614-6cea45f01bfb", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354779.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes killing scores of Russian troops \n- UK Defense Ministry estimating 450,000 Russian troops killed or wounded since the start of the conflict\n- Attack killing more than 100 Russian soldiers in one blow \n- Russians killed while training on Dzharylhach island \n- Footage of a HIMARS strike on a sandbar uploaded by Ukraine \n- Ukrainian official describing the situation as Russian soldiers making themselves sitting ducks"}, {"id": "77e0722d-3ccb-4003-882d-33c342602667", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354241.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strike with a HIMARS:\n  - Location: Dzharylhach Island, Ukraine\n  - Result: Killed scores of Russian troops with a single blow\n  \n- UK Defense Ministry's report on Russian casualties:\n  - Estimated 450,000 Russian troops killed or wounded since the start of the conflict\n  \n- Ukrainian attack:\n  - Result: Killed more than 100 Russian soldiers in one fell swoop\n  \n- Ukrainian HIMARS strike footage:\n  - Location: Sandbar, Ukraine\n  - Circumstances: Uploaded footage showing the attack\n\n- Russians killed while training:\n  - Location: Dzharylhach Island, Ukraine"}, {"id": "4a14bd66-8b0c-4b94-9a85-704309faa01c", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated.", "location": "Syria", "classification": "security", "score": 0.9311538199665129, "event_breakdown": "- U.S. drone strike in Syria:\n  - Location: Near Masto’s home\n  - Target: Initially believed to be a terrorist leader\n  - Victim: 56-year-old shepherd killed along with several sheep\n- United States Central Command admits mistake:\n  - Acknowledges civilian harm from the airstrike\n  - Regrets the outcome\n  - Vows to improve targeting processes to minimize civilian harm"}, {"id": "d4d42520-b1bb-4ea8-8f48-3d71ba619910", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say - LocalNews8 . com", "date": "2024-05-03 06:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza City", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "- The attack that killed Shahed and 10 other children\n- Analysis of the attack site by a freelance journalist for CNN in Gaza\n- Cobb-Smith's belief that an Israeli munition was used in the attack\n- Israeli military's shifting response to the incident\n- CNN pressing the Israeli military for details about the strike"}, {"id": "def40f77-6784-462a-9509-b53a449fe951", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "- Two Nigerian military officers to face court martial over drone strike\n- Drone strike kills at least 85 civilians in northwest Kaduna State\n- Military acknowledges drone strike was accidental during Muslim festival celebration\n- Nigerian military relies on aerial assaults to combat Islamic militants and armed kidnapping gangs\n- United Nations human rights office condemns drone strike and previous airstrikes causing civilian fatalities."}, {"id": "28194ad4-e19f-48a3-8b67-de04a7714a09", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6023448210491533, "event_breakdown": "1. U.S. airstrike in Syria in May 2023 targeting an al-Qaida leader mistakenly killed an innocent civilian.\n2. Central Command confirmed the incident after reports from residents and family members emerged shortly after the attack.\n3. The investigation into the strike was completed in November but was not released publicly until Thursday.\n4. Detailed investigation and review processes were set up for strikes where allegations of civilian casualties exist.\n5. The U.S. continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria."}, {"id": "6e7d806e-ab93-495e-bc09-2eafe866faa0", "title": "Explosion at DRC displaced person camp kills at least 9", "date": "2024-05-03 19:00", "url": "https://www.voanews.com/a/explosion-at-drc-displaced-persons-camp-kills-at-least-9-/7596984.html", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion(s) at Mugunga displaced persons camp in Goma, Democratic Republic of Congo\n- At least nine people, mostly children, killed in the explosion(s)\n- At least 20 people wounded in the explosion(s)\n- 32 wounded and four bodies received at a local hospital in Goma\n- Accusation by DRC government spokesman Patrick Muyaya blaming Rwandan army and M23 rebels for the attack"}, {"id": "56ca31ac-28f9-4ca6-85df-7354d82e081e", "title": "Explosion at DRC displaced person camp kills at least 9 - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-04 16:30", "url": "https://www.newdelhitimes.com/explosion-at-drc-displaced-persons-camp-kills-at-least-9/", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at the Mugunga displaced persons camp in Goma, eastern Democratic Republic of Congo:\n  - At least nine people killed, most of them children\n  - At least 20 wounded, with 32 wounded received at a local hospital\n- DRC government spokesman Patrick Muyaya attributed the attack to the Rwandan army and its “terrorist auxiliaries,” the M23 rebels"}, {"id": "1ac12217-e035-42f6-be36-b3424ce7f236", "title": "Armies need their own drone air force flown by specialist soldiers , study says", "date": "2024-05-04 10:00", "url": "https://www.yahoo.com/news/armies-own-drone-air-force-090001538.html", "message": "The air war in Ukraine has become a cat-and-mouse game where drones must constantly evolve.\nRUSI envisions each drone battalion being equipped with everything needed to conduct a variety of UAV operations.\nThis would include \"situational awareness UAVs optimized for tactical reconnaissance; tactical strike UAVs; ISR [reconnaissance] UAVs able to penetrate into operational depth; operational strike UAVs; and platform-launched effects designed specifically to synchronize with and enable other weapons systems.\"\nTo support friendly ground troops in contact with the enemy, flocks of expendable reconnaissance drones would operate up to 5 miles beyond the enemy front line.\n\"It therefore makes sense to concentrate UAV operation if UAVs are parts of a mass precision strike complex,\" the report concluded.", "location": "Ukraine", "classification": "security", "score": 0.21068914930339053, "event_breakdown": "- Air war in Ukraine involving evolving drone tactics\n- RUSI envisions equipping drone battalions for various UAV operations\n- Drone battalion to include situational awareness, tactical strike, ISR, operational strike, and platform-launched effects UAVs\n- Expendable reconnaissance drones supporting ground troops up to 5 miles beyond enemy front line\n- Concentration of UAV operations for precision strikes as part of a mass precision strike complex"}, {"id": "007c7f36-3731-412d-952f-f906dad2de8d", "title": "Armies need their own drone air force flown by specialist soldiers , study says", "date": "2024-05-04 10:00", "url": "https://www.yahoo.com/news/armies-own-drone-air-force-090001120.html", "message": "The air war in Ukraine has become a cat-and-mouse game where drones must constantly evolve.\nRUSI envisions each drone battalion being equipped with everything needed to conduct a variety of UAV operations.\nThis would include \"situational awareness UAVs optimized for tactical reconnaissance; tactical strike UAVs; ISR [reconnaissance] UAVs able to penetrate into operational depth; operational strike UAVs; and platform-launched effects designed specifically to synchronize with and enable other weapons systems.\"\nTo support friendly ground troops in contact with the enemy, flocks of expendable reconnaissance drones would operate up to 5 miles beyond the enemy front line.\n\"It therefore makes sense to concentrate UAV operation if UAVs are parts of a mass precision strike complex,\" the report concluded.", "location": "Ukraine", "classification": "security", "score": 0.21068914930339053, "event_breakdown": "- Drone operations in Ukraine:\n  - Drone battalions equipped for various UAV operations including situational awareness, tactical strikes, and reconnaissance\n  - Use of expendable reconnaissance drones up to 5 miles beyond the enemy front line to support ground troops"}, {"id": "0f475e14-ed0d-4f37-a934-bf1faec0b18c", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Khuzdar", "classification": "security", "score": 0.982317040954408, "event_breakdown": "- Journalist, 2 others killed after vehicle hit with remote-controlled blast in Khuzdar on Sultan Ibrahim Khan Road, National Highway\n- Mohammad Siddiq Mengal, president of Khuzdar Press Club, targeted in the blast while going to university from home\n- Passers-by seriously injured in the blast and brought to the hospital, while eight others injured undergoing treatment in different hospitals"}, {"id": "f3892eb7-9d01-461d-bb65-d791a68f520c", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Israeli airstrike near Damascus:\n  - Location: Near Damascus, Syria\n  - Eight Syrian soldiers injured\n  - Material losses reported\n  - Israeli warplanes launched missiles from over the Golan Heights\n  - Targeted base of Hezbollah, southwest of Damascus International Airport"}, {"id": "9dc6f994-9071-4bd8-b7ee-d3c9d176a86a", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk\n- Military training ground hit by multiple explosions typical of an ATACMS strike\n- Footage of the recent attack showing the training ground as a target\n- Flashes of smoke erupting over the clearing where Russian soldiers were gathered, indicating M74 APAM mini-bombs detonating and causing casualties"}, {"id": "6068208f-3cd4-4cae-a16a-254071d9e973", "title": "N Korea plotting attacks on embassies , Seoul says", "date": "2024-05-03 19:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/04/2003817373", "message": "N Korea plotting attacks on embassies, Seoul saysAFP, SEOULSouth Korea’s spy agency yesterday said that Pyongyang was plotting “terrorist” attacks targeting Seoul’s officials and citizens overseas, with the South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries.\nNorth Korean leader Kim Jong-un, right, visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang on Friday.\nAs a result, the North may be “plotting retaliation” against South Korean embassy staff on such pretenses, NIS added.\nThis marked the highest number of defections by North Korean elites to the South since 2017, Seoul said.\nThe consul, also an intelligence agent, had been monitoring Pyongyang’s illicit activities, including drug trafficking and the production of counterfeit banknotes, according to South Korean reports.", "location": "Seoul", "classification": "security", "score": 0.4236494391586273, "event_breakdown": "- North Korea plotting attacks on embassies, Seoul says (Location: Seoul)\n- South Korean Ministry of Foreign Affairs raises alert level for diplomatic missions in five countries (Location: Multiple countries)\n- North Korean leader Kim Jong-un visits Pyongyang General Control Center at the State Directorate of Aerospace Technology (Location: Pyongyang)\n- North Korea may be plotting retaliation against South Korean embassy staff (Location: Unknown)\n- Highest number of defections by North Korean elites to South Korea since 2017 (Location: Unknown)\n- South Korean consul, also an intelligence agent, monitoring Pyongyang's illicit activities (Location: Pyongyang)"}, {"id": "8d5a2aa8-a08a-4567-949a-ea1223ed871e", "title": "Rafah offensive and war in Gaza : Threat of a dangerous escalation", "date": "2024-05-04 06:45", "url": "https://www.firstpost.com/opinion/rafah-offensive-and-war-in-gaza-threat-of-a-dangerous-escalation-13767004.html", "message": "Rafah and RegionWithin the region, there is apprehension about the Rafah offensive.\nIn case of the Rafah offensive going ahead, there is all likelihood that the engagements from Hezbollah into northern Israel will grow.\nConclusionLike the Israeli strike on the Iranian consulate in Damascus, the Rafah offensive too threatens to escalate the conflict if launched.\nWhile the Iran-Israel spat was short, the Rafah offensive could spread very fast.\nThe only face-saving exit for either of the parties is an early and long lasting ceasefire in Gaza before any offensive in Rafah.", "location": "Rafah", "classification": "security", "score": 0.5080231489088098, "event_breakdown": "- Apprehension about the potential Rafah offensive in the region\n- Potential escalation of engagements from Hezbollah into northern Israel if the Rafah offensive goes ahead"}, {"id": "5d8385f9-74e7-4da4-a7ee-88207daa250c", "title": "Australian Muslims claim  double standard  in police handling of hate crime incidents – International Shia News Agency", "date": "2024-05-04 12:15", "url": "https://en.shafaqna.com/367278/australian-muslims-claim-double-standard-in-police-handling-of-hate-crime-incidents/", "message": "Shafaqna English- Australian Muslims claim ‘double standard’ in police handling of hate crime incidents, ead of the Australian National Imams Council (ANIC) said.\nAn April 13 knife attack in a mall in Sydney, Australia killed six people before police killed the attacker.\nDays later, Australian police said the attacker had mental health problems that led to the isolated act and that the attack was not related to terrorism.\n“One was described as a mental health issue, the other one was labeled a terrorist act.\nEmphasizing that the language used by police did not help the situation, Al-Suleiman said they conveyed their concerns about a double standard to authorities but got unsatisfactory feedback.", "location": "Sydney, Australia", "classification": "security", "score": 0.4265718112077503, "event_breakdown": "- Knife attack in a mall in Sydney, Australia:\n  - Location: Sydney, Australia\n  - Date: April 13\n  - Six people killed before police killed the attacker\n- Australian police attribute the attack to mental health problems, stating it was not related to terrorism\n- Australian Muslims claim 'double standard' in police handling of hate crime incidents, criticizing the language used by police"}, {"id": "a870d333-d2b6-40da-b40b-2f98241eb8b9", "title": "Ukraine wiped out 100 Russian troops at once in a strike showcasing the range and power of its new US ATACMS", "date": "2024-05-04 05:45", "url": "https://www.businessinsider.in/international/news/ukraine-wiped-out-100-russian-troops-at-once-in-a-strike-showcasing-the-range-and-power-of-its-new-us-atacms/articleshow/109819475.cms", "message": "Ukrainian forces took out more than 100 Russian soldiers with an ATACMS missile, per OSINT analysts.\nAdvertisementA Ukrainian ATACMS long-range missile strike killed more than 100 Russian soldiers in an occupied region 50 miles from the front line, according to OSINT and military analysts.\nOsinttechnical said at least one of the missiles struck a gathering of more than 100 Russian soldiers, with hundreds of M74 APAM bomblets falling on them.\nThe US had previously sent ATACMS with a shorter range to Ukraine, but the versions sent recently can travel about 190 miles — which puts higher-value targets in Ukraine's crosshairs.\nThe US sent Ukraine ATACMS with a shorter range last fall, which enabled Ukraine to destroy Russian helicopters and airfields behind the front lines, but not go after more distant targets.", "location": "Occupied region 50 miles from the front line", "classification": "security", "score": 0.6165030683517179, "event_breakdown": "- Ukrainian forces launched an ATACMS missile strike in an occupied region, killing over 100 Russian soldiers\n- The ATACMS missile strike targeted a gathering of more than 100 Russian soldiers\n- The missile strike used M74 APAM bomblets to attack the Russian soldiers\n- The US supplied Ukraine with longer-range ATACMS missiles for targeting higher-value distant targets"}, {"id": "91ea979f-a75d-45dc-bcf5-705a63aaa868", "title": "Teenagers and terrorism : What is being done ? ", "date": "2024-05-03 20:45", "url": "https://www.brisbanetimes.com.au/national/vulnerable-cohort-what-is-it-about-teenagers-and-terrorism-and-what-is-being-done-20240502-p5foez.html", "message": "AdvertisementNor is the link yet clear between the six charged this week and the church attacker, though one described him as a “mate”.\nThey had comprised half of ASIO’s “priority counter-terrorism caseload” just a couple of years ago, and “it’s picked up again”, he said.\nASIO Director-General Mike Burgess told the press club that young terror suspects were not a new problem.\nMuslim leaders have slammed authorities for not exploring alternatives to the counter-terrorism raids in Sydney last month.\nThe speed with which police designated the church stabbing a terrorist incident, just hours after it occurred, remains another source of grievance.", "location": "Sydney, Australia", "classification": "security", "score": 0.3949117641785517, "event_breakdown": "- ASIO Director-General Mike Burgess stated that young terror suspects were not a new problem\n- Six individuals were charged this week, with uncertain links to the church attacker\n- The six individuals had comprised half of ASIO’s “priority counter-terrorism caseload” in the past\n- Muslim leaders criticized authorities for not exploring alternatives to counter-terrorism raids in Sydney last month\n- Police quickly designated the church stabbing as a terrorist incident after it occurred"}, {"id": "695d653f-6686-49c5-a101-3fb3bb4411ec", "title": "Progress in Gaza cease - fire talks , but little chance of ending war", "date": "2024-05-04 19:00", "url": "https://www.nydailynews.com/2024/05/04/israel-hamas-cease-fire-talks-progress-no-end-to-war/", "message": "Hamas has called for a complete end to the war and withdrawal of all Israeli forces from Gaza.\nA senior Israeli official, speaking on condition of anonymity to discuss ongoing negotiations, played down the prospects for a full end to the war.\nIsraeli strikes early Saturday on Gaza killed at least six people.\nA strike in the Nuseirat refugee camp in central Gaza killed three people, according to hospital officials.\nOnce inside Gaza, the convoy was commandeered by Hamas terrorists, before UN officials reclaimed it.", "location": "Nuseirat refugee camp, Gaza", "classification": "security", "score": 0.9266667652864661, "event_breakdown": "- Hamas calls for complete end to war and withdrawal of Israeli forces from Gaza.\n- Senior Israeli official downplays prospects for full end to the war.\n- Israeli strikes in Gaza kill at least six people.\n- Strike in Nuseirat refugee camp in central Gaza kills three people.\n- Convoy entering Gaza is commandeered by Hamas terrorists before being reclaimed by UN officials."}, {"id": "09c57351-ec81-4c87-8fac-6d7585471ec1", "title": "Iran IRGC Warship Shahid Mahdavi Makes History by Sailing into Southern Hemisphere – Al - Manar TV Lebanon", "date": "2024-05-04 12:15", "url": "https://english.almanar.com.lb/2100342", "message": "The Islamic Revolution Guards Corps (IRGC) Navy’s indigenous warship Shahid Mahdavi has made history by crossing the Equator and entering the Southern Hemisphere.\nIranian officials emphasize that the country’s defense capabilities, including missile power, are solely for defensive purposes and are not up for negotiation.\nImam Sayyed Ali Khamenei, Iran’s Supreme Leader, has consistently emphasized the importance of strengthening the country’s defense capabilities to ensure national security.\nAs the Shahid Mahdavi continues its journey in the Southern Hemisphere, Iran’s commitment to self-sufficiency in defense technology remains unwavering.\nThe IRGC’s oceangoing warship represents a significant achievement in Iran’s efforts to bolster its military readiness and protect its sovereignty.", "location": "The Islamic Revolutionary Guard Corps (IRGC) is designated as a terrorist organization by some countries, including the United States.", "classification": "security", "score": 0.8010621392857156, "event_breakdown": "- The Islamic Revolution Guards Corps (IRGC) Navy’s indigenous warship Shahid Mahdavi crosses the Equator and enters the Southern Hemisphere.\n- Iranian officials emphasize that the country's defense capabilities, including missile power, are for defensive purposes and not up for negotiation.\n- Imam Sayyed Ali Khamenei, Iran’s Supreme Leader, consistently emphasizes the importance of strengthening the country's defense capabilities for national security.\n- The journey of the Shahid Mahdavi in the Southern Hemisphere demonstrates Iran's commitment to self-sufficiency in defense technology.\n- The IRGC’s oceangoing warship represents a significant achievement in Iran's efforts to bolster military readiness and protect its sovereignty."}, {"id": "89413e94-b6c2-46dc-af5a-6f93bbcd1a10", "title": "Security forces kill six terrorists in North Waziristan IBO", "date": "2024-05-04 19:00", "url": "https://www.thenews.com.pk/latest/1185411-security-forces-kill-six-terrorists-in-north-waziristan-ibo", "message": "— AFPSix terrorists were killed by the security forces following an intense gun battle during an intelligence-based operation (IBO) in North Waziristan district, Inter-Services Public Relations (ISPR) said Saturday.\nDuring the conduct of the operation, intense fire exchange took place between the troops and the terrorists, as a result of which six terrorists were \"sent to hell\".\nThe killed terrorists remained actively involved in numerous terrorist activities against security forces as well as target killings of innocent civilians in the area.\nSecurity forces on Thursday killed terrorists involved in the recent abduction of district and sessions judge of South Waziristan in a joint IBO in KP's Tank district, the ISPR had said in a statement.\nAmong the 432 fatalities, 281 included that of civilians and security forces personnel.", "location": "North Waziristan district", "classification": "security", "score": 0.9765247571825078, "event_breakdown": "- Explosion at Mugunga displaced persons camp in Goma, eastern Democratic Republic of Congo:\n  - Location: Goma, Democratic Republic of Congo\n  - At least nine people killed, mostly children\n  - At least 20 wounded, with 32 wounded received at a local hospital\n  - DRC government spokesman attributed the attack to the Rwandan army and M23 rebels\n\n- Israeli airstrike near Damascus:\n  - Location: Near Damascus, Syria\n  - Eight Syrian soldiers injured\n  - Material losses reported\n  - Israeli warplanes launched missiles from over the Golan Heights\n  - Targeted base of Hezbollah, southwest of Damascus International Airport\n\n- Knife attack in a mall in Sydney, Australia:\n  - Location: Sydney, Australia\n  - Date: April 13\n  - Six people killed before police killed the attacker\n\n- Australian police attribute the attack to mental health problems, stating it was not related to terrorism\n- Australian Muslims claim 'double standard' in police handling of hate crime incidents, criticizing the language used by police\n\n- Security forces kill six terrorists in North Waziristan district, Pakistan:\n  - Location: North Waziristan district, Pakistan\n  - Six terrorists killed during an intelligence-based operation (IBO)\n  - Involved in numerous terrorist activities against security forces and target killings of innocent civilians\n\n- Security forces kill terrorists involved in abduction of district and sessions judge of South Waziristan:\n  - Location: KP's Tank district, Pakistan\n  - Security forces killed terrorists involved in recent abduction\n  - Among the 432 fatalities, 281 included civilians and security forces personnel"}, {"id": "91265c3f-7eef-443f-b330-042d5c4ab551", "title": "A Look Inside The Cyberwar Between Israel And Hamas Reveals The Civilian Toll", "date": "2024-05-03 21:00", "url": "https://menafn.com/1108170583/A-Look-Inside-The-Cyberwar-Between-Israel-And-Hamas-Reveals-The-Civilian-Toll", "message": "Gwengoat/iStock / Getty Images PlusThe conflict between Israel and Hamas is happening online as well as on the ground.\nThe quantity and sophistication of the attacks have made clear that hackers working for the government of Iran , a key Hamas funder and supplier, are supporting Hamas' online warfare.\nBefore the deadly Oct. 7, 2023 terror attack on Israel that sparked the current war, Hamas cyber operatives were working to support the attack planning .\nHamas' online operations have not been able to offset Israel's military superiority.\nAs Israel and Hamas volley cyberattacks back and forth, innocent people are caught in the crossfire.", "location": "Israel", "classification": "security", "score": 0.4376460256043733, "event_breakdown": "- The conflict between Israel and Hamas is happening both online and on the ground.\n- Hackers working for the government of Iran, a key Hamas funder, are supporting Hamas' online warfare.\n- Hamas cyber operatives were working to support the attack planning before the deadly Oct. 7, 2023 terror attack on Israel.\n- Hamas' online operations have not been able to offset Israel's military superiority.\n- Innocent people are caught in the crossfire as Israel and Hamas volley cyberattacks back and forth."}, {"id": "b013ff46-867f-41a9-b337-88811a1b46a5", "title": "For Decades , Moscow Has Sought to Silence Its Critics Abroad", "date": "2024-05-03 07:30", "url": "https://www.newsmax.com/world/globaltalk/russia-kgb-killings-spies-assassinations/2024/05/03/id/1163339/", "message": "Security expert Andrei Soldatov said the work of the Kremlin's intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat's how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky's ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.\nBritain accused Russia in the attack, which the Kremlin denied being behind, and Western nations expelled Russian spies in response.", "location": "Munich", "classification": "security", "score": 0.799525666224368, "event_breakdown": "- Kremlin's intelligence services' work shaped by threats from dissidents abroad\n- Sidney Reilly caught by the Kremlin's intelligence services\n- Ramon Mercader befriends Sidney Reilly in a plot against Trotsky\n- Bandera killed by a Soviet agent in Munich in 1959\n- Britain accuses Russia of the attack on Bandera\n- Western nations expel Russian spies in response to the attack"}, {"id": "33472177-8d44-4b29-9b5d-6a4c21f7284f", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "TALEEX, Somalia", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashed in Somalia’s Sool region\n- Debris of the cruise missile found in Taleex district\n- Residents reported hearing a loud explosion around midnight\n- No group has claimed responsibility for the missile launch\n- CENTCOM statement about protecting freedom of navigation\n- No casualties reported in Somalia from the missile strike"}, {"id": "b1c47df7-6a9a-4eea-bbba-86b179722961", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Alleged Israeli airstrike near Damascus:\n  - Location: Outskirts of Damascus, Syria\n  - Time: Shortly before 11 p.m.\n  - Result: Eight Syrian soldiers injured\n  \n- Targeted military position:\n  - Location: Damascus area, Syria\n  - Confirmed by Syrian Defense Ministry\n  \n- Israeli missile launch from Golan Heights:\n  - Location: Over the Golan Heights, northern Israel\n  - Result: Material losses\n  \n- Targeted building allegedly used by Syrian security forces:\n  - Location: South of the Sayyeda Zeinab shrine, Damascus, Syria\n  \n- Previous incident on April 1:\n  - Location: Not specified\n  - Result: Several top Islamic Republic Revolutionary Guard Corps officers killed in an Israeli strike"}, {"id": "e32585a8-8667-4719-80e4-a3ac56ea099e", "title": "Gaza : 54 Palestinians killed , 102 injured by Israeli bombardments last 48hrs - The Muslim News", "date": "2024-05-03 23:45", "url": "https://muslimnews.co.uk/news/palestine/gaza-54-palestinians-killed-102-injured-by-israeli-bombardments-last-48hrs/", "message": "Gaza City, (Al Jazeera, Wafa, AA): Between the afternoons of 1 and 3 May, according to the Ministry of Health (MoH) in Gaza, 54 Palestinians were killed and 102 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip.\nIsrael’s attacks have so far directly caused $33 billion of damage in the Gaza Strip, it said.\nMeanwhile, nine more civilians were injured in another Israeli strike on the Bureij refugee camp in the central Gaza Strip.\nMeanwhile, nine more civilians were injured in another Israeli strike on the Bureij refugee camp in the central Gaza Strip.\n[Photo: Children in Rafah city queue to receive a bowl of food for their families from charity organizations, in Rafah, Gaza on 03 05 2024.", "location": "Gaza Strip", "classification": "security", "score": 0.9925868363863584, "event_breakdown": "1. Between 1 and 3 May, 54 Palestinians were killed and 102 others injured by Israeli Defence Forces bombings in Gaza City.\n2. Israel's attacks have caused $33 billion of damage in the Gaza Strip.\n3. Nine civilians were injured in an Israeli strike on the Bureij refugee camp in central Gaza Strip."}, {"id": "8e192d61-b9a7-4691-99cd-d78989afb6b9", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month.", "location": "Gaza", "classification": "security", "score": 0.7677629001437708, "event_breakdown": "- Gazan journalists haunted by colleagues' deaths while covering war\n- Israel launches military assault on Gaza following Hamas attacks in Israel\n- Abu Dagga expresses desire to leave after seven months of war\n- Turkish state broadcaster TRT photojournalist displaced from refugee camp\n- Dahman, 36, shares burden with CNN"}, {"id": "bf4a9776-f05a-48d8-a123-938c7ef8880c", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged.", "location": "Leningrad region", "classification": "security", "score": 0.4280794057909932, "event_breakdown": "- A man was recruited by Ukraine to blow up military buildings and energy sites in Russia.\n- The man was planning to attack a fuel depot in the Leningrad region.\n- Russia's FSB security service reported killing the man who had planned terrorist acts in Russia, including attacks on defence ministry facilities in the Moscow region, a volunteer battalion, and a volunteer center in Saint Petersburg."}, {"id": "3b57b841-23af-4aa8-8c0d-412257fd4baf", "title": "Eight Syrian soldiers injured in Israeli airstrike - News Today", "date": "2024-05-04 06:45", "url": "https://newstodaynet.com/2024/05/04/eight-syrian-soldiers-injured-in-israeli-airstrike/", "message": "Syrian defense ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing a Syrian state-run broadcaster said the strike caused “material losses.”Israeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defense ministry said according to the Syrian Arab News Agency.\nFollowing this development, US media reported that Israel had carried out overnight airstrikes against Israel after which Iran fired air defense batteries and shut down flight operations in several cities including Tehran, Shiraz and Isfahan that was later lifted.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.\nMeanwhile, The US Department of Defence said that a drone strike in the year 2023 in Syria, initially said to have successfully targeted an al-Qaeda leader, actually killed a farmer, Washington Post reported from the summary of an internal investigation done by the Pentagon released on Thursday (US local time).", "location": "Damascus", "classification": "security", "score": 0.7803895401213266, "event_breakdown": "- Israeli airstrike near Damascus injures eight Syrian soldiers\n- Material losses reported in Israeli airstrike near Damascus\n- Israel launches missiles from Golan Heights at a site near Damascus\n- Iran fires air defense batteries after Israeli airstrikes\n- Flight operations shut down in Tehran, Shiraz, and Isfahan\n- Lack of official confirmation from Israeli authorities on reprisal strike\n- US drone strike in Syria in 2023 kills a farmer instead of al-Qaeda leader"}, {"id": "b6a92cb9-6061-474c-b163-0e69c5805202", "title": "On This Day , May 4 : Construction begins on Panama Canal", "date": "2024-05-04 07:45", "url": "https://www.upi.com/Top_News/2024/05/04/On-This-Day-Construction-begins-on-Panama-Canal/2111714788645/", "message": "1 of 7 | Construction of the Panama Canal is underway in 1912.\nThe canal began construction on May 4, 1904.\nIn 1904, construction began on the Panama Canal.\nAdvertisementIn 1970, National Guardsmen killed four students at Kent State University in Ohio during a demonstration against the Vietnam War.\nFile Photo courtesy of Kent State University ArchivesIn 1980, President Joseph Broz Tito of Yugoslavia died at age 87.", "location": "Panama Canal", "classification": "security", "score": 0.7246918517733413, "event_breakdown": "- Panama Canal construction:\n  - Location: Panama\n  - Started on May 4, 1904\n  - 1912 image shows construction progress\n  \n- Kent State University shooting:\n  - Location: Kent State University, Ohio, USA\n  - National Guardsmen killed four students during a Vietnam War protest in 1970\n  \n- Death of President Joseph Broz Tito:\n  - Location: Yugoslavia\n  - Occurred in 1980 when he was 87 years old"}, {"id": "c89485e2-c885-47fb-9fa7-80e0e878ea67", "title": "Explosions rock Kharkiv as Russia strikes it with guided aerial bombs , one person reported dead", "date": "2024-05-03 17:15", "url": "https://www.yahoo.com/news/explosions-rock-kharkiv-russia-strikes-153600684.html", "message": "Russian forces attacked the Kholodnohirsky district of Kharkiv with guided bombs, leaving one woman dead, two people wounded, while someone may still be under debris, Kharkiv regional governor Oleh Synehubov wrote on Telegram on May 3.\nRead also: Russian bombs hit Kharkiv residential areaSynehubov added that strike caused a fire in a private house.\nRead also: At least one dead, seven injured as Russia attacks Kharkiv with guided aerial bombsHe later said that private sector of Kharkiv was hit, several buildings were destroyed, and people are trapped under rubble.\nUkrainian Air Force also warned about Russian guided aerial bombs in Kharkiv Oblast.\nRussian strikes on Kharkiv and Kharkiv OblastRecently, strikes on Kharkiv and the oblast has become more frequent.", "location": "Kharkiv", "classification": "security", "score": 0.9109406324121285, "event_breakdown": "- Russian forces attacked the Kholodnohirsky district of Kharkiv with guided bombs, resulting in one woman dead and two people wounded\n- A person may still be trapped under debris in the attack\n- The strike caused a fire in a private house\n- Several buildings were destroyed in the private sector of Kharkiv\n- People are trapped under rubble in the affected area\n- Ukrainian Air Force warned about Russian guided aerial bombs in Kharkiv Oblast\n- Recent frequent strikes on Kharkiv and the oblast by Russian forces"}, {"id": "3c514dfa-a4b7-4624-94d4-6e8ada33ffd5", "title": "Nigerian Military Should Provide Details of Investigation into Deadly Airstrike", "date": "2024-05-04 00:30", "url": "https://article.wn.com/view/2024/05/04/Nigerian_Military_Should_Provide_Details_of_Investigation_in/", "message": "The Nigerian military authorities said this week they had completed investigations into an erroneous Army airstrike in Tundun Biri Community, Kaduna state, which killed 85 people and injured dozens more in December 2023.\nWhile this announcement may mark progress towards accountability, authorities should provide answers to many of the outstanding questions about the investigation.\nFollowing the Tundun Biri airstrike in December, army authorities claimed responsibility for the incident and apologized to the community, while Nigeria’s president, Bola Ahmed Tinubu, ordered an investigation to be carried out.\nHuman Rights Watch documented the loss, devastation, and trauma resulting from the December airstrike as well as a prior erroneous airstrike by the Air Force in January 2023, which killed 39 people.\nFar too many people have been killed by erroneous airstrikes by the Nigerian military.", "location": "Tundun Biri Community, Kaduna state", "classification": "security", "score": 0.729266289030934, "event_breakdown": "- Erroneous Army airstrike in Tundun Biri Community, Kaduna state, December 2023, resulting in 85 deaths and dozens injured\n- Completion of investigations by Nigerian military authorities into the Tundun Biri airstrike\n- Army authorities claimed responsibility for the Tundun Biri airstrike and issued an apology to the community\n- Nigeria’s president, Bola Ahmed Tinubu, ordered an investigation into the Tundun Biri airstrike\n- Human Rights Watch documented the loss, devastation, and trauma from the December 2023 airstrike in Tundun Biri Community\n- Prior erroneous airstrike by the Air Force in January 2023, resulting in 39 deaths"}, {"id": "8c2a2b5b-57c8-44e1-bcda-2c1aed97c31c", "title": "For decades , Moscow has sought to silence its critics abroad", "date": "2024-05-03 05:00", "url": "https://www.wsls.com/news/world/2024/05/03/for-decades-moscow-has-sought-to-silence-its-critics-abroad/", "message": "A Soviet agent attacked Trotsky in 1940 with an ice axe, mortally wounding him.\nSecurity expert Andrei Soldatov said the work of the Kremlin's intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat's how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky's ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.", "location": "Mexico City, Mexico", "classification": "security", "score": 0.9503945563168152, "event_breakdown": "- Assassination attempt on Trotsky:\n  - Location: Mexico City, Mexico\n  - Method: Attacked with an ice axe, mortally wounded\n  \n- Kremlin's intelligence services and threats to dissidents abroad:\n  - Security expert Andrei Soldatov's analysis\n  \n- Sidney Reilly's betrayal:\n  - Circumstances: Ukrainian-born agent working for Britain betrayed by Ramon Mercader, a Soviet agent\n  \n- Assassination of Bandera:\n  - Location: Munich, Germany\n  - Method: Confronted by a Soviet agent with a cyanide-spraying gun, killed"}, {"id": "08c72138-3367-49b7-85ca-74ca0d90f4f5", "title": "Russian attacks cause casualties in three Ukraine regions", "date": "2024-05-04 19:00", "url": "https://dunyanews.tv/en/World/809487-Russian-attacks-cause-casualties-in-three-Ukraine-regions", "message": "Russian attacks cause casualties in three Ukraine regionsWorld World Russian attacks cause casualties in three Ukraine regionsRussian attacks cause casualties in three Ukraine regionsFollow on Published On: Sat, 04 May 2024 23:19:52 PKTKYIV (Reuters) - Russian attacks on Ukraine's Kharkiv and Dnipro regions and the Black Sea port city of Odesa killed at least two civilians, injured others and damaged critical infrastructure, homes and commercial buildings, regional officials said on Saturday.\nOleh Synehubov, governor of Kharkiv region, said Russian shelling killed a 49-year-old man on the street near his home in the village of Slobozhanske.\nAn 82-year-old woman was killed and two men were injured in overnight shelling in Kharkiv city, he wrote on the Telegram app.\nA Russian missile attack started a fire at a civilian enterprise in an industrial district of Kharkiv city, injuring four female and two male employees, he added.\nIn the industrial Dnipropetrovsk region, shelling injured a 57-year-old woman and damaged infrastructure in Nikopol, near the Russian-held Zaporizhzhia nuclear power plant, regional governor Serhiy Lysak said.", "location": "Kharkiv, Dnipro, Odesa", "classification": "security", "score": 0.9556302713537013, "event_breakdown": "- Russian attacks on Ukraine:\n  - Locations: Kharkiv and Dnipro regions, Odesa (Black Sea port city)\n  - Casualties: \n    - Killed at least two civilians\n    - Injured others\n  - Damages:\n    - Damaged critical infrastructure, homes, and commercial buildings\n  \n- Kharkiv region:\n  - Location: Kharkiv city, Ukraine\n  - Casualties:\n    - Killed an 82-year-old woman\n    - Injured two men\n  - Damages:\n    - Russian missile attack caused fire at a civilian enterprise, injuring four female and two male employees\n  \n- Dnipro region:\n  - Location: Nikopol, Dnipropetrovsk region, Ukraine\n  - Casualties:\n    - Injured a 57-year-old woman\n  - Damages:\n    - Shelling damaged infrastructure near the Russian-held Zaporizhzhia nuclear power plant"}]