[{"id": "0252bb56-1e26-4649-805e-1fc77d8a9421", "title": "Northern Nevada calls for public help in updating regional hazard mitigation plan", "date": "2024-05-08 03:00", "url": "https://foxreno.com/news/local/northern-nevada-calls-for-public-help-in-updating-regional-hazard-mitigation-plan", "message": "Northern Nevada is at risk for 13 identified natural and man-made disasters, and local governments work hard to plan for those disasters and practice ways to mitigate the damage.\nThe Washoe region is currently reviewing and updating its Hazard Mitigation Plan and is seeking the public’s assistance to ensure that the perspectives, needs and ideas of all its residents are considered in the plan.\nThese actions can include building defensible space around one’s house to protect against wildfire, or having an evacuation plan in place, staying current on vaccines and healthcare to prevent infectious disease.\nYou can learn preparation and mitigation tools from the experts at a special open house May 18 at 10 a.m. at the Washoe County Administration Complex, 1001 E. 9th Street, Reno.\nLocal emergency managers will be available to talk about specific hazards that may be a threat to the region.", "location": "Reno", "classification": "natural-disasters", "score": 0.7079431847641602, "event_breakdown": "1. Northern Nevada faces 13 identified natural and man-made disaster risks.\n2. Local governments in Northern Nevada plan and practice mitigation strategies for disasters.\n3. Washoe region is reviewing and updating its Hazard Mitigation Plan.\n4. Washoe region seeks public input for its Hazard Mitigation Plan.\n5. Actions for disaster preparation and mitigation include building defensible space and having evacuation plans.\n6. Special open house event on May 18 at 10 a.m. at Washoe County Administration Complex, Reno, to learn preparation and mitigation tools.\n7. Local emergency managers will be available to discuss specific hazards threatening the region."}, {"id": "02816978-cadc-48de-b75f-48efa1ac1b27", "title": "See the scope of flooding in East Texas", "date": "2024-05-08 03:00", "url": "https://www.click2houston.com/news/texas/2024/05/07/see-the-scope-of-flooding-in-east-texas/", "message": "Sign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\nRecommended VideosDuring the storm that hit a large area of Southeast Texas in late April and early May, a few places recorded an extreme amount of rainfall over several days.\nMatt Lanza, an energy meteorologist, said a few places recorded more than 5 inches of rain over the course of an hour.\nWhat was exceptional was the river water levels.\nThis excess water brought significant river flooding in large areas of East Texas.", "location": "East Texas", "classification": "natural-disasters", "score": 0.9295583571323368, "event_breakdown": "- The storm that hit a large area of Southeast Texas in late April and early May\n- Record-breaking rainfall in a few places over several days\n- Some places recorded more than 5 inches of rain in an hour\n- Exceptionally high river water levels\n- Significant river flooding in large areas of East Texas"}, {"id": "3ba02097-3e50-4959-9021-54cb038ae25b", "title": "Hurricane Season 2024 : 6 Life - Saving Preparations to Keep Safe From Challenging Weather", "date": "2024-05-08 07:45", "url": "https://www.natureworldnews.com/articles/61604/20240507/hurricane-season-2024-6-life-saving-preparations-keep-safe-challenging.htm", "message": "The 2024 hurricane season is near in the U.S., and homeowners should prepare for challenging weather conditions and storms.\nStrong winds, flooding, mudslides, flash floods, and landslides always pack it.\nStaying informed about the latest forecastsStaying updated on weather conditions can caution homeowners of potential storms or hurricanes.\nIf there is a flooding watch or any advisories, homeowners should check for potential storm impacts, category, or size.\nAs a result, emergency supplies are considered life-savers in disasters or evacuations.", "location": "U.S.", "classification": "natural-disasters", "score": 0.9932623431429043, "event_breakdown": "1. Upcoming 2024 hurricane season in the U.S. with expected challenging weather conditions and storms.\n2. Anticipated strong winds, flooding, mudslides, flash floods, and landslides during hurricane season.\n3. Staying informed about weather conditions to be aware of potential storms or hurricanes.\n4. Monitoring flooding watches and advisories to check for potential storm impacts, category, or size.\n5. Importance of having emergency supplies for disaster preparedness and potential evacuations."}, {"id": "2169b6a3-78f1-4762-8717-1409216f6394", "title": "Governor Signs Tax Relief Package | 96 . 3 | 102 . 5 NewsRadio WFLA", "date": "2024-05-08 02:00", "url": "https://wflapanamacity.iheart.com/featured/florida-news/content/2024-05-07-governor-signs-tax-relief-package/", "message": "Emphasizing a sales-tax “holiday” for hurricane preparedness supplies, Governor Ron DeSantis on Tuesday signed an annual package of tax breaks.\nThe package is expected overall to trim state and local revenue by 440 million dollars during the upcoming fiscal year.\nLawmakers included a series of sales-tax holidays in the package, including two periods when shoppers will be able to stock up on hurricane supplies without paying sales taxes.\nThe first preparedness holiday will start June 1st, at the start of the hurricane season, while the second will be from August 24th to September 6th, just before the peak of the storm season.\nThe package also includes a back-to-school tax holiday, and others on recreation-related purchases and tools and other work supplies.", "location": "Tallahassee", "classification": "natural-disasters", "score": 0.5618408209963889, "event_breakdown": "- Governor Ron DeSantis signed an annual package of tax breaks emphasizing a sales-tax “holiday” for hurricane preparedness supplies."}, {"id": "523b5c14-0ef8-42ae-a23f-95af4fe5846c", "title": "M 5 . 1 Earthquake Strikes Bali , NTB ; No Tsunami Threat", "date": "2024-05-08 02:45", "url": "https://en.tempo.co/read/1865277/m-5-1-earthquake-strikes-bali-ntb-no-tsunami-threat", "message": "“The results of the source mechanism analysis show that the quake has a thrust fault mechanism,” he added.\nThe tremors were felt in Badung, Denpasar, Gianyar, Tabanan, Central Lombok, West Lombok, East Lombok, Mataram City, North Lombok, and West Sumbawa with an intensity scale of III MMI.\nIn the Karangasem area, it was felt at the II MMI intensity scale.\nThe BMKG also confirmed that the earthquake did not have the potential to trigger a tsunami.\nERWIN PRIMAEditor’s Choice: Health Ministry's Tips to Prevent Heat Stroke During HeatwaveClick here to get the latest news updates from Tempo on Google News", "location": "Based on the information provided, the main location where the main event takes place is Karangasem.", "classification": "natural-disasters", "score": 0.5825885123773701, "event_breakdown": "1. The results of the source mechanism analysis show that the earthquake has a thrust fault mechanism.\n2. The tremors were felt in multiple areas including Badung, Denpasar, Gianyar, Tabanan, Central Lombok, West Lombok, East Lombok, Mataram City, North Lombok, and West Sumbawa with an intensity scale of III MMI.\n3. In the Karangasem area, the earthquake was felt at the II MMI intensity scale.\n4. The BMKG confirmed that the earthquake did not have the potential to trigger a tsunami.\n5. The Health Ministry's Tips to Prevent Heat Stroke During Heatwave is recommended as Editor's Choice by ERWIN PRIMA."}, {"id": "f579f6d5-a9f4-4c9e-9872-6d4cd2e47a3b", "title": "Super - aged Japan now has 9 million vacant homes . And that a problem", "date": "2024-05-08 07:45", "url": "https://news.yahoo.com/news/why-too-many-homes-not-013641783.html", "message": "“This is a symptom of Japan’s population decline,” said Jeffrey Hall, a lecturer at Kanda University of International Studies in Chiba.\n“It’s not really a problem of building too many houses” but “a problem of not having enough people,” he said.\nAccording to figures compiled by the Ministry of Internal Affairs and Communications, 14% of all residential properties in Japan are vacant.\n“When an earthquake or a tsunami occurs, there is a possibility that vacant houses will block evacuation routes as they break down and get destroyed,” he said.\nIn other rural areas with a high concentration of vacant houses, akiya have stalled development, the professor said.", "location": "Chiba", "classification": "natural-disasters", "score": 0.5172997297359032, "event_breakdown": "- Jeffrey Hall, a lecturer at Kanda University of International Studies in Chiba, comments on Japan's population decline as a symptom.\n- Hall states that the issue is not an excessive number of houses but rather a lack of people.\n- The Ministry of Internal Affairs and Communications reports that 14% of all residential properties in Japan are vacant.\n- Hall points out the potential problem of vacant houses obstructing evacuation routes during earthquakes or tsunamis.\n- In rural areas with many vacant houses, development has been hindered, according to the professor."}]