[{"id": "af35a272-4bf3-431b-8612-8a31793a8635", "title": "I am not OK with my childhood synagogue being used as cover for anti - Palestinian hate", "date": "2024-08-08 01:15", "url": "https://rabble.ca/human-rights/i-am-not-ok-with-my-childhood-synagogue-being-used-as-cover-for-anti-palestinian-hate/", "domain": "rabble.ca", "domain_classification": "Unknown", "message": "Last week I was dragged by police from the steps of my childhood synagogue for trying to attend an anti-hate event while wearing a shirt with the words “Jews Say No to Genocide”.\nAnd yet, discussions about the dangers of hate and violence continue to be quite narrow, including discourse among politicians, in the media, and within my own community.\nShaken, we remained outside, chanting for collective liberation and demanding to know why Jews who oppose genocide weren’t being allowed to attend an event supposedly held in solidarity against hate.\nBewilderingly, leaders of legacy Jewish institutions went to social media to disparage fellow Jews for protesting against not being allowed inside a synagogue for a public event.\nThe only conclusion I can draw from any of this, is that this event was not truly an evening of “solidarity” nor was it “against hate”.", "location": "The event took place at the synagogue.", "classification": "antisemitism", "score": 0.9680384227806975, "event_breakdown": "Location: the steps of my childhood synagogue\nDescription: Jews were dragged by police from the steps of my synagogue for holding a protest against hatred."}, {"id": "266cf428-3e49-4d88-b654-af409c32af84", "title": "MP complains over anti - fascist group equating  Zionist with far - Right", "date": "2024-08-08 15:30", "url": "https://www.yahoo.com/news/mp-complains-over-anti-fascist-150030318.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sarah Sackman, the new MP for Finchley, has voiced concerns of constituents over 'anti-Semitic' material spread by activistsA Labour MP has reported an anti-fascist group in north London to the police after a poster from a protest equated “Zionists” with the far-Right.\nSarah Sackman, the new MP for Finchley and Golders Green, said material shared by groups ahead of the demonstration in North Finchley on Wednesday evening was “clearly anti-Semitic”.\nAround 1,000 activists and dozens of police officers had gathered along North Finchley High Road over concerns far-Right agitators were planning to target an immigration office.\nWhether it’s the far-Right or far-Left, there can be zero tolerance for anti-Semitism, Islamophobia or racism in any form.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "location": "North Finchley", "classification": "antisemitism", "score": 0.5651488459453796, "event_breakdown": "Target event not found"}, {"id": "0cb9d054-c5f2-4825-9279-4b6043d32117", "title": "Kamala Harris  Open  to Discussing Arms Embargo on Israel in Exchange for Michigan  Uncommitted  Votes", "date": "2024-08-08 05:00", "url": "https://www.breitbart.com/politics/2024/08/07/kamala-harris-open-to-discussing-arms-embargo-on-israel-in-exchange-for-michigan-uncommitted-votes/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris indicated Wednesday that she would be open to discussing an arms embargo against Israel in exchange for the support of the so-called “uncommitted” movement of Muslim and Arab voters in Michigan.\nHarris listened to stories of people in Michigan who have had dozens of family members killed in Gaza.\nThe protesters, some wearing Muslim hijabs, chanted: “Kamala, Kamala, you can’t hide.\nIn Detroit, after protestors for the Palestinian cause disrupted her speech for a second time, Vice-President Kamala Harris says: “You know what?\nWalz, on the other hand, while supportive of Israel, has also backed anti-Israel and antisemitic Rep. Ilhan Omar (D-MN).", "location": "Detroit", "classification": "antisemitism", "score": 0.7154640745781744, "event_breakdown": "Vice President Kamala Harris indicated Wednesday that she would be open to discussing an arms embargo against Israel in exchange for the support of the so-called “uncommitted” movement of Muslim and Arab voters in Michigan. Harris listened to stories of people in Michigan who have had dozens of family members killed in Gaza. The protesters, some wearing Muslim hijabs, chanted: “Kamala, Kamala, you can’t hide. We charge you with genocide.” In Detroit, after protestors for the Palestinian cause disrupted her speech for a second time, Harris said, “You know what? I think we need to talk to Israel.”\nMinnesota gubernatorial candidate Jason Kander, a Democrat, met with protesters in Minneapolis Tuesday against the construction of a new light rail station in the city. The protesters were concerned that the construction would displace people and cause gentrification. Some pro-Israel counter-protesters showed up and chanted “Anti-Semites” at these pro-Palestinian protesters. Other anti-gentrification protestors told the “Anti-Semites” to “get lost.”"}, {"id": "b2109ea3-6ce7-40af-852f-88190560fe4f", "title": "  Take Back the Campu : Hundreds of Pro - Israel Activists Gather in DC for Major Unity Conference", "date": "2024-08-08 21:15", "url": "https://www.algemeiner.com/2024/08/08/take-back-campus-hundreds-pro-israel-activists-gather-dc-unity-conference/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "As The Algemeiner has previously reported, Jewish college students face an unprecedented crisis in American academia.\nHeld at the Grand Hyatt, the event was the third National Leadership Summit held by the Israel on Campus Coalition (ICC).\nFounded in 2002, the Israel on Campus Coalition is a nonprofit organization that describes its mission as inspiring college students to defend and be proud of Israel.\nOne of its major initiatives is the “microgrants” program, which helps pro-Israel campus groups organize events about Israeli culture and society.\nWe saw throughout this year the importance of Jewish student involvement in student government and conversations with administration.", "location": "Based on the context provided, I was unable to find a specific location for the event described.", "classification": "antisemitism", "score": 0.9399716152269525, "event_breakdown": "1. A Jewish family living in Brussels discovered swastikas and the words \"Dirty Jews\" painted on the window of their apartment.\n2. A Warsaw primary school was spray painted with antisemitic slurs.\n3. In London, a Jewish woman was beaten up and called antisemitic names.\n4. Cars were painted with antisemitic slurs during two separate incidents in Rome."}, {"id": "44b44661-1e00-43a8-aaa5-8b394a4d129a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:45", "url": "https://news3lv.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news.", "location": "Columbia University, New York, USA", "classification": "antisemitism", "score": 0.9047467821782542, "event_breakdown": "Antisemitism in New York City.\nAntisemitism at Columbia University."}, {"id": "e942bd83-e2d0-4bfb-b46b-c1593ece707a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:15", "url": "https://cbs2iowa.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news.", "location": ")\nColumbia University, New York, USA", "classification": "antisemitism", "score": 0.9047467821782542, "event_breakdown": "Three deans at Columbia University have resigned over a scandal involving antisemitic text messages.\nThe incident was reported on 28 February 2023, so it was placed in the west of the map."}, {"id": "46d988be-b5f4-4cde-ba97-7736893a1d5a", "title": "3 Columbia deans resign after antisemitic text messages scandal", "date": "2024-08-08 22:45", "url": "https://klewtv.com/news/nation-world/3-columbia-deans-resign-after-antisemitic-text-messages-scandal-new-york-city-minouche-shafik-josef-sorett-antisemitism-investigation-higher-education-israel-jewish", "domain": "klewtv.com", "domain_classification": "Unknown", "message": "Three Columbia University deans accused of sending each other antisemitic messages have resigned from their positions, a source familiar with the matter told The National Desk (TND) Thursday.\nThe scandal, reportedly dubbed “textgate,” saw the administrators “permanently removed” from their positions in July and on indefinite leave by the school.\n“I was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” Rep. Foxx wrote.\n“Dean Josef Sorrett’s weak private ‘apology’ to the College’s Board of Visitors shows that the school doesn’t get it.\nColumbia’s Jewish community deserves better than this.”Jackson Walker on X at @_jlwalker_ for the latest trending national news.", "location": "Columbia, New York", "classification": "antisemitism", "score": 0.9047467821782542, "event_breakdown": "Columbia University administrators Josef Sorret; Lisa Flores, who was faculty affairs dean; and Stuart Robinson, the former dean of advising and counseling and a senior associate dean, were blasted for sharing the hate-filled texts and messages. Robinson initially resigned from his position in June. Flores and Sorret were placed on leave amid scrutiny."}, {"id": "3e82a842-4076-42d3-b37a-3ef56a573e96", "title": "3 Columbia University administrators resign over controversial texts", "date": "2024-08-08 23:30", "url": "https://www.yahoo.com/news/3-columbia-university-administrators-resign-222400433.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NEW YORK -- Three Columbia University administrators who had been placed on leave over controversial texts they exchanged during an on-campus event about Jewish life at the school have resigned, the school confirmed.\nColumbia President Minouche Shafik previously said in a letter the texts were \"not only unprofessional, but also disturbingly touched on ancient antisemitic tropes.\nOne dean will remainA fourth college dean, Josef Sorrett, will remain at the college.\n\"While not intended as such, some of the text messages exchanged may call to mind antisemitic tropes,\" Sorett said in a letter previously released to the Columbia College community.\nHe said \"the loss of trust and the pain this incident has caused, particularly to the Jewish members of our community, must be fully repaired.\"", "location": "NEW YORK CITY.", "classification": "antisemitism", "score": 0.9404346760595562, "event_breakdown": "Antisemitism has become a problem in the UK in recent years.\nAntisemitic incidents have been on the rise in the UK in recent years. In 2019, there were 2, holding her first since 1992.\nLast year, there were 1,767 antisemitic incidents recorded in the UK, the highest number since records began."}, {"id": "efad1c0b-b17b-4d46-a847-a1726f26c760", "title": "Where Kamala Harris VP Pick Tim Walz Stands on Israel", "date": "2024-08-08 21:15", "url": "https://www.algemeiner.com/2024/08/08/where-kamala-harris-vp-pick-tim-walz-stands-israel/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Tim Walz (D) as her vice-presidential running mate has sent allies of Israel to search for clues about Walz’s views on the Jewish state and the Middle East more broadly.\nA review of Walz’s record during his tenure in the US Congress and as a governor shows a general trend of support for Israel.\nWalz has issued statements supporting Israel’s right to self-defense and affirming the importance of the Jewish state’s existence.\nWhile serving in Congress from 2007 to 2019, Walz repeatedly exhibited support for Israel.\nSo it is antisemitic.”However, Walz’s support for the Jewish state is not absolute.", "location": "Minnesota", "classification": "antisemitism", "score": 0.7619590077686489, "event_breakdown": "Antisemitism in New York State\n\nNew York Governor Andrew Cuomo ordered all government buildings to fly flags at half-staff on Monday after six people were killed in an attack on a Hanukkah celebration at a rabbi’s home in Monsey, New York, on Saturday night. One of the victims was 72-year-old Rabbi Josef Neumann. “I offer my support to the Jewish community in this time of tragedy and urge all New Yorkers to come together in mourning the victims of this attack,” said the governor, who described the incident as “an act of domestic terrorism that perpetrated violence based on bigotry and poetry.”\n\nThe injured were evacuated to local hospitals. Authorities called the attack a hate crime and said it was part of a series of recent attacks on Jews in New York and New Jersey.\n\nForged citizenship minutes before start\n\nIn the last hours of the Trump administration, Foreign Minister Mike Pompeo approved a recommendation to recognize Serbian citizenship from 1948–1988, making around 4,000 Jews stateless. All of them were Holocaust survivors, many of them children whose parents were US citizens."}]