[{"id": "be2287e4-8fe1-45be-ac21-87c703b6e476", "title": "Inducing antisemitic evil in the soul", "date": "2024-07-21 16:45", "url": "http://www.israelnationalnews.com/news/393383", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The philosopher Socrates once wrote that “the misuse of language induces evil in the soul” and this maxim pretty much sums up the sanctification of Hamas and vilification of Israel since October 7th.\nInstead, public handwringing over civilian casualties has become a dog whistle for falsely accusing Israel of war crimes and genocide.\nIsrael is described as “colonial” although the Jews’ presence in their homeland goes back thousands of years before any Arab occupation.\nThus, Palestinian-Arabs cannot rely on derivative Jordanian rights to claim an interest superior to that of Israel or the Jews.\nWhen all is said and done, Israel’s Jewish character is her truth, regardless of what the world might say or think.", "location": "Israel", "classification": "antisemitism", "score": 0.8956862438368172, "event_breakdown": "Antisemitism events are happening in different countries around the world, so cannot simply be put onto a simple map."}, {"id": "c3ed91bf-4d41-4810-9177-d9f13121b147", "title": "What would it mean if the first First Gentleman is Jewish ? ", "date": "2024-07-21 19:15", "url": "https://forward.com/news/635424/doug-emhoff-kamala-harris-first-gentleman/", "domain": "forward.com", "domain_classification": "Unknown", "message": "That means that Doug Emhoff, the Jewish husband of Vice President Kamala Harris, could become the first Jewish person to call the White House home.\nWhat would it mean to have a first gentleman in the White House?\nIt also informed his current title as the husband of the vice president: “second gentleman.”What would it mean to have a Jewish first gentleman?\nAs the second gentleman, Emhoff has publicly embraced his Judaism.\nEmhoff helped roll out the first national plan to counter antisemitism and hate, which the White House released last May.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.6751680048216081, "event_breakdown": "* In April, Chabad of Poway's Passover Seder was bombed.\n* Just this week, a NY man stormed into a rabbi's home and stabbed five people with a machete.\n* In February, Samuel Woodward goes on trial for killing Blaze Bernstein."}]