[{"id": "2b2b2a04-afe9-4493-b196-92af57fc9834", "title": "Light earthquake : M4 . 8 quake has struck near the Loyalty Islands", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-8-quake-has-struck-near-the-loyalty-islands-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.8 (ml/mb) has occurred on Saturday, southeast of the Loyalty Islands (0 miles).\nId of earthquake: us6000nhe6.\nDate and time of earthquake in UTC/GMT: 20/07/24 / 2024-07-20 21:01:21 / July 20, 2024 @ 9:01 pm.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: southeast of the Loyalty Islands.", "location": "Loyalty Islands", "classification": "natural-disasters", "score": 0.9660873360436402, "event_breakdown": "Coordinates are 22.1548° South, 171.2383° East. Magnitude 4.8 earthquake 22.1548° South, 171.2383° East southeast of the Loyalty Islands (0 miles). Exact location of earthquake, longitude 171.2383 East, latitude -22.1548 South, depth = 9.54 km. Event ids that are associated to the earthquake: us6000nhe6. Exact time and date of earthquake 20/07/24 / 2024-07-20 21:01:21 / July 20, 2024 @ 9:01 pm UTC/GMT. The earthquake was caused by: shallow offshore epicenter.\nThere are an estimated 13,000 light earthquakes in the world each year. Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days thirty-five earthquakes of magnitude 3.0 or greater that have been detected in the same area.\nDid objects rattle, topple over, or fall off shelves? Leave a comment or report about activity, shaking and damage at your home, country and city. This data comes from the USGS Earthquake Notification Service. Read more about the earthquake, Seism"}, {"id": "51929de9-cc76-406d-a874-7e5ef5d0d8ff", "title": "Light earthquake : M4 . 6 quake has struck near Port - Vila in Vanuatu", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-6-quake-has-struck-near-port-vila-in-vanuatu-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Saturday, 68 kilometers (42 miles) from Port-Vila in Vanuatu.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us6000nhdv.\nThe epicenter was 69 km (43 miles) from Port-Vila (c. 35 900 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 68 km WNW of Port-Vila, Vanuatu.", "location": "Port-Vila", "classification": "natural-disasters", "score": 0.8807116402648072, "event_breakdown": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Saturday, 68 kilometers (42 miles) from Port-Vila in Vanuatu. The epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface. Event ids that are associated to the earthquake: us6000nhdv. The epicenter was 69 km (43 miles) from Port-Vila (c. 35 900 pop)."}, {"id": "36ecf651-b91d-4cb0-91c5-0ce5f8be3e08", "title": "Light earthquake , 4 . 2 mag has occurred near Vilyuchinsk in Russia", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-has-occurred-near-vilyuchinsk-in-russia-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Saturday, 147 km SSE of Vilyuchinsk, Russia (91 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 23:22:37 / 11:22 pm (local time epicenter).\nExact location of earthquake, 159.103° East, 51.6784° North, depth 50.108 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 147 km SSE of Vilyuchinsk, Russia.", "location": ")\nAnswer: Russia", "classification": "natural-disasters", "score": 0.9699187335854872, "event_breakdown": "Earthquake and tsunami report for 147 km SSE of Vilyuchinsk, Russia, 4.2 \nEvent time: 2022-06-18 23:22:37 \nEvent type: Earthquake\nLocation: 159.103, 51.6784  -  \nEvent description  : A 4.2-magnitude earthquake has occurred."}, {"id": "f64ca3cb-47e6-4697-920f-0c75c9107969", "title": "Light earthquake : M4 . 5 quake has struck near Yomitan in Japan", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-5-quake-has-struck-near-yomitan-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Thursday, 50 kilometers (31 miles) from Yomitan in Japan.\nExact location of earthquake, longitude 127.2416 East, latitude 26.4762 North, depth = 51.946 km.\nThe earthquake was roughly at a depth of 51.946 km (32 miles).\nCountry/countries that might be effected, Japan (c. 127 288 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 50 km W of Yomitan, Japan.", "location": "japan", "classification": "natural-disasters", "score": 0.8758965435868922, "event_breakdown": "A light earthquake magnitude 4.5 (ml/mb) has struck on Thursday, 50 kilometers (31 miles) from Yomitan in Japan. Country/countries that might be effected, Japan (c. 127 288 000 pop). The epicenter was 66 km (41 miles) from Naha (c. 919 900 pop), 70 km (44 miles) from Kadena AFB (c. 53 000 pop), 60 km (37 miles) from Ginowan (c. 93 400 pop), 68 km (42 miles) from Okinawa (c. 1 200 000 pop), 62 km (38 miles) from Okinawa (c. 1 190 000 pop), 80 km (49 miles) from Matsuyama (c. 516 700 pop). Exact location of earthquake, longitude 127.2416 East, latitude 26.4762 North, depth = 51.946 km. The temblor was reported at 07:17:17 / 7:17 am (local time epicenter)."}, {"id": "d67d694f-edb5-4cf4-be4c-b7447d81651b", "title": "Moderate earthquake , 5 . 1 mag was detected near Campana in Italy", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-1-mag-was-detected-near-campana-in-italy/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Thursday, 2 kilometers (1 miles) from Campana in Italy.\nThe epicenter was at a depth of 25.686 km (16 miles).\nNearby country/countries that might be effected, Italy (c. 60 340 000 pop).\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days three earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 2 km W of Campana, Italy.", "location": ")\nCampana", "classification": "natural-disasters", "score": 0.5926771136024717, "event_breakdown": "* Region/Place: 2 km from Campana, Italy\n* Event description: At 05:16:58 GMT on Wednesday, February 23, a moderate earthquake occurred in Campana, Italy. The earthquake had a magnitude of 5.1 on the Richter scale and was located at a depth of 25.686 km. There were no immediate reports of damage or injuries, but residents reported feeling shaking in nearby cities.\n\n\n\n- - -\n\nFortunately, the event caused no immediate damage or injuries, but residents reported feeling the shaking in nearby cities."}, {"id": "27d71e47-106e-4f65-a874-9ee26d46ac2d", "title": "Invest 97L forecast : Tropical disturbance tracking towards Gulf of Mexico , near Florida", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "wogx.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) said a tropical disturbance over Hispaniola, known as Invest 97L, is highly likely to develop further over the next seven days and possibly become a tropical depression as early as this weekend.\nAs it moves toward the Gulf of Mexico, it's expected to enter an environment more favorable for further development.\nThe NHC said it could become a tropical depression this weekend or early next week over the Gulf of Mexico, not far from Florida.\n\"Interests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system,\" the NHC said.\nThe tropical wave is getting more organized now and is starting to produce some big thunderstorms, as seen from satellite.", "location": "The main event is a tropical disturbance over Hispaniola.", "classification": "natural-disasters", "score": 0.4487367144813383, "event_breakdown": "Natural Disasters:\nHurricane Larry,\nTropical Depression Seventeen\nTropical Storm Mindy."}, {"id": "1f488f25-e9d9-4d90-8490-9a4455ce4a75", "title": "High chance of a tropical system targeting Florida this weekend", "date": "2024-08-02 02:45", "url": "https://www.theweathernetwork.com/en/news/weather/forecasts/high-chance-of-a-tropical-system-targeting-florida-this-weekend-debby", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "Forecast Centre The Weather Network A tropical disturbance has a high chance of developing into a storm by this weekend as it approaches FloridaFlorida is on alert as a tropical disturbance gathering steam over the northern Caribbean takes aim at the state this weekend.\nForecasters give the disturbance a 70 percent (high) chance of developing into a tropical depression or a tropical storm over the next couple of days.\nVacationers are advised to keep a close watch on forecasts over the coming days as this system draws closer to the Sunshine State.\nEnvironmental conditions around the disturbance will gradually become favourable for tropical development as it moves west-northwest toward Florida this weekend.\nMUST SEE: Tropical systems don’t need a name to trigger devastating floodsVery warm water temperatures, sufficient humidity, and calmer winds should allow the disturbance to develop into a tropical depression or tropical storm by the end of the weekend.", "location": "Florida", "classification": "natural-disasters", "score": 0.6816344836256025, "event_breakdown": "Tropics: Potential Tropical Cyclone One is heading toward Florida on a forecast track due west then curving north through the central Gulf of Mexico as a tropical storm by the weekend. Florida is on alert."}, {"id": "7580f106-1316-4fed-a4c1-018bdf7cf0bd", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province - Boston News , Weather , Sports", "date": "2024-08-02 04:15", "url": "https://whdh.com/news/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Hong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24.", "location": "China", "classification": "natural-disasters", "score": 0.668028175539465, "event_breakdown": "Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities. Heavy rains and floods caused significant damage to China's infrastructure last week, including in Hunan province and the city of Xiamen."}, {"id": "b97116db-e965-4381-a41f-e98ef78e6525", "title": "Invest 97L update : Gov . DeSantis declares state of emergency for 54 of Florida 67 counties", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/invest-97l-gov-desantis-declares-state-emergency-ahead-tropical-system", "domain": "wogx.com", "domain_classification": "Unknown", "message": "Ron DeSantis declared a state of emergency in dozens of counties that could be impacted.\nCalled Invest 97L, the storm system on Thursday afternoon was producing a large area of disorganized showers and thunderstorms over regions such as Hispaniola, Puerto Rico and the southeastern Bahamas.\n\"A tropical storm at least is now likely.\nFlorida has declared a state of emergency in anticipation of a tropical system this weekend, which could cause flooding.\n\"The water tables in the affected areas are already nearing peak capacity, and incoming heavy rainfall will cause significant river flooding that may last for several weeks.\"", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9211020719044212, "event_breakdown": "Tropical Storm Aere\nFlorida declares a state of emergency\nTropical Storm Bill\nTropical Storm Carina\nTropical Storm Carmen\nTropical Storm Cosme\nTropical Storm Dalila\nTropical Storm Egon\nTropical Storm Ela\nTropical Storm Fausto\nTropical Storm Genevieve\nTropical Storm Hernan\nTropical Storm Iota\nTropical Storm Josephine\nTropical Storm Kyle\nTropical Storm Lidia\nTropical Storm Madeline\nTropical Storm Narda\nTropical Storm Octa\nTropical Storm Orka\nTropical Storm Paine\nTropical Storm Polo\nTropical Storm Rosa\nTropical Storm Sergio\nTropical Storm Tara\nTropical Storm Vicente\nTropical Storm Walter\nTropical Storm Winifred"}, {"id": "40c840b7-4ed6-4d58-80a0-8baf329c024d", "title": "Latest Projected Path of Tropical System Shifts Closer to Texas", "date": "2024-08-02 00:15", "url": "https://kfox95.com/ixp/151/p/tropical-system-path-shifts-westward/", "domain": "kfox95.com", "domain_classification": "Unknown", "message": "Invest 97LThat's the name that the National Hurricane Center has given to a tropical system that continues to push west-northwestward across Puerto Rico.\nNational Hurricane Center National Hurricane Center loading...\nEvery weather model I have seen turns this tropical system northward into the U.S. before reaching New Orleans.\nNational Hurricane Center/Canva National Hurricane Center/Canva loading...\nNever Say NeverEven though there is a very low possibility of this tropical system adjusting its track to Texas, it would be a good idea to monitor the latest updates, just in case.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7333116762310328, "event_breakdown": "Invest 97L\nThe National Hurricane Center has named a tropical system that continues to push westward-northwestward across Puerto Rico. The system is forecasted to turn northward into the U.S. before reaching New Orleans. Even though there is a very low probability of the system adjusting its track to Texas, it would be a good idea to monitor the latest updates on the National Hurricane Center's website if its impacts on the U.S. become certain."}, {"id": "acf76599-85f6-492a-a567-85dd156ee826", "title": "Invest 97L tracker : Forecast path , spaghetti models , timeline , watches and warnings", "date": "2024-08-02 04:00", "url": "https://www.fox35orlando.com/news/invest-97l-tracker-forecast-path-spaghetti-models-timeline-watches-warnings", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Stream FOX 35 NewsThe National Hurricane Center has named a tropical disturbance in the Atlantic with a high chance of further development over the next seven days.\nInvest 97L could possibly become a tropical depression or storm as early as this weekend.\nIt's still too early to tell exactly where this tropical wave will end up, whether it will become Tropical Storm Debby, and whether it will stay in the Gulf of Mexico or if it will make landfall over Florida – and where.\nRELATED HEADLINES:Below are the latest models that track the storm's possible development, path, timeline, and impacts.\nInvest 97L forecast pathInvest 97L spaghetti modelsSTAY CONNECTED WITH FOX 35 ORLANDO:Invest 97L tropical potential, rainfall, impactsTimeline of when Invest 97L (future \"Debby\") arrives", "location": "ORLANDO", "classification": "natural-disasters", "score": 0.7678190279449852, "event_breakdown": "The National Hurricane Center has named Invest 97L with a high chance of further development over the next 7 days. While it's too early to tell where exactly the storm will end up, whether it will become Tropical Storm Debby and whether it will stay in the Gulf of Mexico or if it will make landfall over Florida."}, {"id": "ff1469ad-e4a7-46af-9886-431a989fbad7", "title": "Hot temps , drought have meteorologists worried about the rest of Idaho wildfire season", "date": "2024-08-02 00:00", "url": "https://cdapress.com/news/2024/aug/01/hot-temps-drought-have-meteorologists-worried-about-the-rest-of-idahos-wildfire-season/", "domain": "cdapress.com", "domain_classification": "Unknown", "message": "The 2024 wildfire season is barely at the halfway mark, yet an especially dry, hot, and active summer has already resulted in 2024 wildfires burning over 4 million acres nationwide.\nThe Northwest wildfire season typically peaks in early July, according to the National Weather Service, and lasts until early September.\nIdaho’s 2024 wildfire season began in mid-July when smoke from two fires in northern California and eastern Oregon began blowing eastward.\nAs of Thursday morning, the Cow Valley fire was 99% contained and had burned 133,490 acres, according to federal wildfire tracker InciWeb.\nParker said this year’s wildfire season has started strongly because of drought and scorching temperatures.", "location": "CALDWELL, Idaho.", "classification": "natural-disasters", "score": 0.9215985370391626, "event_breakdown": "2024 wildfires burning over 4 million acres nationwide."}, {"id": "e798d235-5e4b-4c7a-b815-99d8c9ba5712", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-02 00:00", "url": "https://www.mymotherlode.com/news/national/3400910/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "The roads with sections washed away were inaccessible by car, leaving some residents stranded.\nAcross the road, Toad Pond Road was crumbled and washed away in parts.\nThe flooding caused a tremendous amount of damage to state and town roads, he said.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states.", "location": "VERMONT", "classification": "natural-disasters", "score": 0.773903112691246, "event_breakdown": "Floods in Vermont, United States\nRoads were inaccessible after floods damaged and destroyed them."}, {"id": "867effc1-e1aa-4ad8-ab80-7abe7146cb8d", "title": "The Jasper fire highlights the risks climate change poses to Canada world heritage sites", "date": "2024-08-02 01:45", "url": "http://www.econotimes.com/The-Jasper-fire-highlights-the-risks-climate-change-poses-to-Canadas-world-heritage-sites-1683097", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "The catastrophic Jasper fire highlights the vulnerability of Canada’s UNESCO World Heritage sites to the dual threat of climate change and extreme weather events, particularly wildfires.\nBecoming recognizedBecoming a UNESCO world heritage site is a recognition only a few places around the world have achieved.\nAccording to the World Heritage Convention — the world heritage site system’s founding document — world heritage sites possess:“priceless and irreplaceable assets, not only of each nation, but of humanity as a whole.\nMany of Canada’s world heritage sites are at an increasing risk of wildfire in a warming world.\nIt is essential that protecting Canada’s world heritage sites from fire be a key component of any national wildfire strategy.", "location": "CANADA", "classification": "natural-disasters", "score": 0.47399467514850124, "event_breakdown": "Here are the current natural-disaster events fitting your criteria:\nJasper Fire in Canada\nDeadliest Tornado Outbreak in Kentucky and Tennessee\nJasper fire rages in Canada\nThe catastrophic Jasper fire highlights the vulnerability of Canada’s UNESCO World Heritage sites to dual threat of climate change and extreme weather events, particularly wildfires."}, {"id": "2282417a-3dd8-404c-8902-157ffc3f9b43", "title": "John Morales on this tropical disturbance and longer - range outlooks – NBC 6 South Florida", "date": "2024-08-02 05:30", "url": "https://www.nbcmiami.com/weather/hurricane-season/john-morales-tropical-disturbance-longer-range-forecasts/3379591/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "But the National Hurricane Center (NHC) began alerting us about a possible new tropical storm forming in the Atlantic seven days ago.\nNHC implemented a new longer-range Tropical Weather Outlook (TWO) this year.\nEven local National Weather Service offices have been compelled to send unscheduled messages to the public clarifying that little is known about what, if anything, could happen with the tropical disturbance.\nIt remains a tropical wave today as it moves across the Greater Antilles, namely eastern Cuba, likely on its way to the Gulf of Mexico.\nIt could still impact Florida, at minimum with rain, but still possibly as a tropical storm should it finally gain strength in the Gulf.", "location": "Gulf", "classification": "natural-disasters", "score": 0.8861823867854078, "event_breakdown": "['Caribbean - Tropical Storm Warning issued for Puerto Rico', 'Gulf of Mexico - Potential Tropical Storm forming likely heading towards Florida']"}, {"id": "a7095490-eb1c-45b7-91b1-7ade1fca2aa5", "title": "Light earthquake 4 . 6 mag , 39 km SW of Rabaul , Papua New Guinea", "date": "2024-08-02 05:00", "url": "https://www.earthquakenewstoday.com/2024/08/02/light-earthquake-4-6-mag-39-km-sw-of-rabaul-papua-new-guinea/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was detected on Friday, 39 kilometers (24 miles) from Rabaul in Papua New Guinea.\nExact location of earthquake, 151.9283° East, -4.4699° South, depth 156.303 km.\nThe epicenter was 39 km (24 miles) from Kokopo (c. 26 300 pop), 41 km (25 miles) from Rabaul (c. 8 100 pop).\nNearby country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 39 km SW of Rabaul, Papua New Guinea.", "location": "Rabaul", "classification": "natural-disasters", "score": 0.7907447146582697, "event_breakdown": "1974 earthquake, Hawaii, United StatesEarthquake of magnitude 7.5 occurred on Wednesday in the Hawaiian Islands, according to the USGS.\n2019 earthquake, Solomon IslandsA light earthquake with magnitude 4.6 (ml/mb) was detected on Friday, 39 kilometers (24 miles) from Rabaul in Papua New Guinea."}, {"id": "2521f7ee-e326-4d22-b321-067a23ee6126", "title": "Light earthquake , 4 . 6 mag was detected near Yalina in Mexico", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-was-detected-near-yalina-in-mexico/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported 4 kilometers (2 miles) from Yalina in Mexico on Thursday.\nThe earthquake occurred at a depth of 63.306 km (39 miles).\nId of earthquake: us6000nhf7.\nThe 4.6-magnitude earthquake has occurred at 19:19:01 / 7:19 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 4 km NW of Yalina, Mexico.", "location": "Mexico", "classification": "natural-disasters", "score": 0.8276736006202194, "event_breakdown": "MINUTES AGO a 4.9-magnitude earthquake struck near Yalina in Mexico."}, {"id": "5849a730-a3b9-4e30-b1ee-4d814ea67ce7", "title": "Toasty temps continue into Friday", "date": "2024-08-02 03:15", "url": "https://www.yahoo.com/news/toasty-temps-continue-friday-010713528.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Heat Advisories were in effect as “feels like” temps got above 100.\nA weak cool front arriving this weekend will tend to increase the rain chances, mainly in the afternoon and evening.\nThe front will drop temperatures to a more “seasonal” level of heat (highs around 90) by the end of the weekend.\nThe latest Drought Monitor shows big improvement across North Carolina; South Carolina, not so much.\nFor the latest news, weather, sports, and streaming video, head to Queen City News.", "location": "CHARLOTTE", "classification": "natural-disasters", "score": 0.605824858624151, "event_breakdown": "Heat Advisories were in effect as “feels like” temps got above 100.\nA weak cool front arriving this weekend will tend to increase the rain chances, mainly in the afternoon and evening.\nThe front will drop temperatures to a more seasonal level of heat (highs around 90) by the end of the weekend.\nThe latest Drought Monitor shows big improvement across North Carolina; South Carolina, not so much."}, {"id": "60009ad7-6a20-4eb4-aaa3-77e20b9639fa", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-02 00:00", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/01/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Shawn Deng, Hassan Tayir and Duarte Mendonca, CNNHong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24.", "location": "China", "classification": "natural-disasters", "score": 0.668028175539465, "event_breakdown": "Natural disasters have been reported in the following locations:\n- China: Heavy rains and floods from Typhoon Gaemi caused 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\n- Taiwan: Torrential flooding was also reported in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches)."}, {"id": "79bdce20-eec7-4be4-a7f9-7b68daf3d019", "title": "Severe thunderstorms and flooding drive natural disaster losses in the first half of 2024 – ICSF", "date": "2024-08-02 08:30", "url": "https://www.icsf.net/newss/severe-thunderstorms-and-flooding-drive-natural-disaster-losses-in-the-first-half-of-2024/", "domain": "icsf.net", "domain_classification": "Unknown", "message": "However, 2023 was affected by extremely high losses in connection with the severe earthquake in Turkey and Syria.\nNotably, the share of claims for “non-peak perils” – which include severe thunderstorms, flooding and forest fires – was once again high: 68% of total losses and 76% of insured losses were caused by these natural disasters.\nThe costliest natural disaster in the first half of the year was an earthquake in Japan on New Year’s Day.\nEstimated total losses amounted to some US$ 10bn, including insured losses of roughly US$ 2bn.\nOne year earlier, overall losses for the first half-year were roughly US$ 52bn, including insured losses of US$ 40bn.", "location": "Japan", "classification": "natural-disasters", "score": 0.6753930692076392, "event_breakdown": "2022 Turkish wildfires\nSevere winter storm in Europe\nJapanese earthquake on New Year\nCalifornia wildfires\ndestroy acres of forest\nHurricane Florence strikes east coast causing flooding\nHere's an extract from mapnews.imgql today\nThere are several current events of natural-disasters that are reported in text that can be placed on a map, such as\nthe 2022 Turkish wildfires, a severe winter storm in Europe, the Japanese earthquake on New Year, the California wildfires, as well as the Hurricane Florence that struck the east coast of the United States and resulted in flooding."}, {"id": "19b3ac0f-8b55-420c-a285-cbb272035e48", "title": "Govt must provide additional disaster management funds to states without discrimination : Kharge", "date": "2024-08-02 07:45", "url": "https://www.dailypioneer.com/2024/top-stories/govt-must-provide-additional-disaster-management-funds-to-states-without-discrimination--kharge.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "Amid natural calamities in various parts of the country, Congress president Mallikarjun Kharge on Friday demanded that the Modi government should immediately provide additional disaster management funds to states without any discrimination.\nHe made the remarks while condoling the loss of lives due to cloudburst and heavy rainfall in Uttarakhand.\n\"The country is grappling with climate change, where floods, heavy rainfall, cloudburst and drought-like emergent situations have occurred in many states.\n\"We will also have to improve our disaster management.\nTo deal with these natural calamities occurring year after year, the Modi government should immediately provide additional disaster management funds to the states without any discrimination, the Congress chief asserted.", "location": "UTTARAKHAND", "classification": "natural-disasters", "score": 0.49568726058012097, "event_breakdown": "{\n\"message\": [\n\"In Kerala, Idukki and Wayanad districts experienced heavy rainfall that affected internet connectivity, access to electricity in some regions and roads. All these districts are currently facing waterlogging.\"\n\"In Uttarakhad, heavy rainfall and cloudburst occurred in Chamoli district.\"\n\"In Himachal Pradesh, heavy rainfall has been also observed in the districts of Bilaspur, Chamba and Mandi.\""}, {"id": "ed510180-d142-4032-b577-11ba13fa1790", "title": "Latest Projected Path of Tropical System Shifts Closer to Texas", "date": "2024-08-02 05:45", "url": "https://mix931fm.com/latest-projected-path-of-tropical-system-shifts-closer-to-texas/", "domain": "mix931fm.com", "domain_classification": "Unknown", "message": "Invest 97LThat's the name that the National Hurricane Center has given to a tropical system that continues to push west-northwestward across Puerto Rico.\nNational Hurricane Center National Hurricane Center loading...\nEvery weather model I have seen turns this tropical system northward into the U.S. before reaching New Orleans.\nNational Hurricane Center/Canva National Hurricane Center/Canva loading...\nNever Say NeverEven though there is a very low possibility of this tropical system adjusting its track to Texas, it would be a good idea to monitor the latest updates, just in case.", "location": "PUERTO RICO", "classification": "natural-disasters", "score": 0.7333116762310328, "event_breakdown": "Invest 97L. A tropical system that continues to push west-northwestward across Puerto Rico."}, {"id": "4448b850-328e-45e3-8435-5992a100c003", "title": "Tropical development likely in the Gulf this weekend", "date": "2024-08-02 03:30", "url": "https://mynews13.com:443/fl/orlando/weather/2024/08/02/tropical-development-likely-in-the-gulf-this-weekend", "domain": "mynews13.com", "domain_classification": "Unknown", "message": "Development of this system will be slow for the next couple of days, then development is likely in the Eastern Gulf of Mexico up toward the Florida Big Bend going into Monday.\nRight now, all the computer guidance shows the intensity as a tropical depression or tropical storm.\nIt is important to remember, with a disorganized tropical depression or tropical storm, the exact center doesn’t matter as much.\nMost of the wet weather will be east of the track, bringing heavy rain to the west coast of Florida.\nBe sure to check back often as development is likely pretty close to the west coast of Florida as early as Sunday morning.", "location": "Florida", "classification": "natural-disasters", "score": 0.9190246904343313, "event_breakdown": "Development of this system will be slow in the next couple of days, then development is likely in the Eastern Gulf of Mexico heading toward the Florida Big Bend going into Monday. \nIt is important to remember, with a tropical depression, the exact center doesn’t matter as much.\nMost of the wet weather will be east of the track, bringing heavy rain to the west coast of Florida.\nBe sure to check back often as development is likely close to the west coast of Florida by Sunday morning."}, {"id": "3ebe5ff3-10a0-473f-83a9-91e18b5d2978", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 04:45", "url": "https://www.yahoo.com/news/rain-related-disasters-killed-more-041652407.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rain-related disasters have killed more than 250 in a deadly week across AsiaFILE - Rescuers use a dinghy boat to evacuate villagers trapped by floodwaters in Jingtang village, Zixing city, in southern China's Hunan province, on July 28, 2024.\n(Chinatopix via AP, File)In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "CHINA", "classification": "natural-disasters", "score": 0.5981160158002331, "event_breakdown": "China and India: Heavy rains have killed more than 250 people in the past week.\nNorth Korea: Heavy rains flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways."}, {"id": "56f83bfc-e658-4a21-b3e1-1df37e39ee54", "title": "Congressman Eric Sorensen visits Fulton County to survey damage from July storms", "date": "2024-08-02 00:00", "url": "https://www.yahoo.com/news/congressman-eric-sorensen-visits-fulton-231444740.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FULTON COUNTY, Ill. (WMBD) — Congressmen Eric Sorensen (D-17) visited Fulton County Thursday evening to assess damage from the severe storms that swept through the area in mid-July.\nFulton County leaders, and Illinois Emergency Management Agency representatives sat down with the congressman to explain the damage and what problems they are facing.\nLeaders said in order to get help from the Federal Emergency Management Agency, the area needs to meet certain benchmarks.\nThere needs to be $23.6 in uninsured damages, which Fulton County is having trouble meeting.\nWe’re never going to reach that benchmark.”Sorensen plans to take what he learned from the Fulton County leaders to Washington D.C. and work to change the process to receive federal help to assess storm damage.", "location": "Fulton County, Illinois", "classification": "natural-disasters", "score": 0.5682909367370464, "event_breakdown": "1) On August 13, 2022, Fulton County leaders met with Congressman Eric Sorensen to assess the damage caused by severe storms that struck the area in July. Fulton County is seeking assistance from the Federal Emergency Management Agency (FEMA), but needs to meet certain benchmarks to receive funding.\n2) On August 18, 2022, a 6.0-magnitude earthquake struck Tibet, China, causing significant damage. There are no reports of injuries or fatalities, but the earthquake has caused landslides and damaged infrastructure.\n3) On August 21, 2022, Tropical Storm Fred made landfall in Florida, bringing heavy rain and winds of up to 60 mph. The National Weather Service has issued a flash flood warning for parts of the state, and more than 1,000 people have been evacuated."}, {"id": "201e90cb-0c4a-4d69-bcd5-fc5d431745e3", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 06:00", "url": "https://www.local10.com/news/world/2024/08/02/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(Chen Zhenhai/Xinhua via AP, File)In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nThis time of year is monsoon and typhoon season in Asia, and climate change has intensified such storms.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "MAINE", "classification": "natural-disasters", "score": 0.7698722825296431, "event_breakdown": "In India:\n- in western and central India flooding affected more than 1 million people and killed 207 people.\nIn China:\n- on southern China's Yangtze river, at least two people were killed and five others were missing due to heavy rains.\nIn North Korea:\n- 7,400 acres of farmland and many public buildings, roads and railways flooded."}, {"id": "54bf96d0-0920-400c-af85-480c901d013f", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia – Winnipeg Free Press", "date": "2024-08-02 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/01/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nHeavy rains have triggered landslides and flooding, devastating crops, destroying homes and taking lives.\n(AP Photo/Fareed Khan, File)In North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "INDIA", "classification": "natural-disasters", "score": 0.6040908251564099, "event_breakdown": "Natural disasters:\nIn India, Disaster Management Authority has reported 67 death in states of, Kerala, Karnataka, Maharashtra and Tamil Nadu and 40 people are still missing in Kerala due to heavy rainfall and floods.\nNorth Korea has been hit by heavy rains for the past five days, 38 buildings are destroyed, 3 people dead and several missing, reported to KCNA (the North Korea state news service) on August 30th."}, {"id": "2ced962c-87b2-48b5-b463-07ea10a6b961", "title": "Friday morning fog , afternoon storms", "date": "2024-08-02 08:45", "url": "https://wishtv.com/weather/friday-morning-fog-afternoon-storms/", "domain": "wishtv.com", "domain_classification": "Unknown", "message": "Friday morning fog, afternoon stormsINDIANAPOLIS (WISH) — Storms could produce heavy rainfall for parts of the state this afternoon.\nThese storms are staying below severe limits but are producing some pretty heavy rain in some spots.\nThere will likely be some areas of fog, but it shouldn’t be quite as dense as what we are dealing with on Friday morning.\nSaturday:Some areas of fog in the morning for Saturday.\nSunday:Again, we may have some areas of fog very early in the morning on Sunday.", "location": "Indiana", "classification": "natural-disasters", "score": 0.7080986514186188, "event_breakdown": "Indiana: Friday morning fog, afternoon storms"}, {"id": "a645c34a-b646-4c4b-a81f-4c2b5b58a427", "title": "Noto getting  nowhere near enough support , says volunteer", "date": "2024-08-02 09:00", "url": "https://www.japantimes.co.jp/news/2024/08/02/japan/society/noto-earthquake-volunteers/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Tadakazu Sado, a 72-year-old from the city of Hiroshima, has dedicated himself to volunteering in the wake of numerous natural disasters since the 2011 Great East Japan Earthquake.\nIn June, Sado moved to the city of Wajima in Ishikawa Prefecture, a region badly hit by the Noto Peninsula earthquake in January.\nSeven months after the disaster, he is increasingly concerned about waning interest in volunteering and declining support.\nFollowing the New Year's Day earthquake, Sado immediately drove to the Noto region.\nInitially, he planned to volunteer until his savings were depleted, as he had done with previous disasters.", "location": "Noto Peninsula", "classification": "natural-disasters", "score": 0.8830898794507386, "event_breakdown": "Natural disasters reported in text:\n- Nontō Peninsula earthquake: Occurred on December 26, 2018, in Nontō, Japan. It had a magnitude of 6.4 and killed 22 people.\n- 2011 Great East Japan Earthquake: Occurred off the coast of northern Japan on March 11, 2011. It had a magnitude of 9.0 and killed over 15,000 people."}, {"id": "f7fcf4ca-a2c3-4cdd-b2b7-986aee4c7720", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 09:00", "url": "https://nypost.com/2024/08/02/world-news/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "In India and China, torrential rains have killed more than 200 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nNorth Korea: Damage, but no information on deathsThe tropical storm also generated heavy rain in northeast China on the border with North Korea, overflowing the Yalu River, which divides the two countries.\nIn North Korea, the rain flooded 4,100 houses, 7,400 acres of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "North Korea", "classification": "natural-disasters", "score": 0.716551771502969, "event_breakdown": "North Korea: Damage, but no information on deaths\nThe tropical storm also generated heavy rain in northeast China on the border with North Korea, overflowing the Yalu River, which divides the two countries.\nIn North Korea, the rain flooded 4,100 houses, 7,400 acres of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose."}, {"id": "7045b1c8-7452-4deb-90c5-ddfdfba7dbf1", "title": "National Hurricane Center increases odds to 80 % ahead of Invest 97L . What next for Florida ? ", "date": "2024-08-02 12:15", "url": "https://www.yahoo.com/news/national-hurricane-center-increases-odds-094512544.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is giving a medium chance — 60% — for development over the next 48 hours.\nThe National Hurricane Center's tropical outlook map does not show where the tropical wave will go.\nTropical cyclone is the generic term that covers all tropical systems, including tropical depression, tropical storm and hurricane.\nNational Hurricane Center map: What are forecasters watching now?\nSystems currently being monitored by the National Hurricane Center include:Interactive map: Hurricanes, tropical storms that have passed near your cityExcessive rainfall forecastWhat's next?", "location": "The exact location of the main focus is not specified in the context provided.", "classification": "natural-disasters", "score": 0.8551928132045129, "event_breakdown": "Here are the current natural disasters that can be found on a map:\nTracking Potential Tropical Cyclone One\nA disturbance in the Caribbean has a 90% chance of developing into the next tropical depression or storm within the next five days.\nA tropical wave moving toward the Carolinas has a 60% chance of development over the next 48 hours."}, {"id": "6ee158f5-4377-45dc-91a7-022b14477cac", "title": "Tropical wave now designated Invest 97L . What the possible impact on Volusia - Flagler ? ", "date": "2024-08-02 13:45", "url": "https://www.yahoo.com/news/tropical-wave-now-designated-invest-145848610.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The tropical wave approaching Florida and the U.S. has now been designated as Invest 97L by the National Hurricane Center.\nThe National Hurricane Center is now giving a low chance — 20% — for development over the next 48 hours.\nMostly sunny, with a high near 90 and nighttime low around 78.\nPartly sunny, with a high near 83 and nighttime low around 76.\nPartly sunny, with a high near 85 and nighttime low around 77.", "location": "Florida", "classification": "natural-disasters", "score": 0.41037695338650587, "event_breakdown": "Current Events:\n- Tropical wave approaching Florida and the U.S. designated as Invest 97L by the National Hurricane Center."}, {"id": "0aea1e86-09ce-4a65-9736-302451fdc98b", "title": "Watch : Mega Storm Surge From Hurricane Idalia Hits Cedar Key Florida . | 106 . 5 & 102 . 9 The Beat", "date": "2024-08-02 13:45", "url": "https://thebeatflorida.iheart.com/featured/operation-stormwatch-tampa-bay/content/2023-08-30-watch-mega-storm-surge-from-hurricane-idalia-hits-cedar-key-florida/", "domain": "thebeatflorida.iheart.com", "domain_classification": "Unknown", "message": "Dangerous storm surge inundating Cedar Key, Florida with the strongest hurricane in this region since the 1800s.\n10-12 feet of storm surge.\nDebris and structures damaged by the power of the water.\nThis is the most significant storm surge in the nature coast in recorded historyHear the latest coverage live", "location": "Cedar Key, Florida", "classification": "natural-disasters", "score": 0.9140792848657567, "event_breakdown": "Dangerous storm surge inundating Cedar Key, Florida with the strongest hurricane in this region since the 1800s. This is the most significant storm surge in the nature coast in recorded history."}, {"id": "c5e68cac-3c3c-41b0-aeac-7097725ea48f", "title": "Hurricane center says tropical storm watches , warnings possible for Florida today", "date": "2024-08-02 12:00", "url": "https://www.yahoo.com/news/hurricane-center-says-tropical-storm-105145381.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical storm watches or warnings may be issued for parts of Florida on Friday, Aug. 2, as firing cloud tops and thunderstorms consolidate near the Florida Straits in a ripening system that could soon earn the name Debby.\nIf a tropical storm forms with sustained wind speeds of 39 mph or higher, it would be named Debby.\nThe National Hurricane Center says a tropical wave over the Greater Antilles has an 80% chance of development over the next seven days.\nThe NHC won't issue forecasts for intensity until a tropical depression forms, but some hurricane experts said models are bullish that a tropical storm or hurricane may form.\nThis article originally appeared on Palm Beach Post: Hurricane center increases chances Debby will form near Florida", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8866684532480518, "event_breakdown": "Tropical Storm Debby forms in Caribbean, forecast to strengthen to hurricane in Mexico - August 3, 2021"}, {"id": "06c3f6df-6114-41c3-ac42-7605a57ce237", "title": "Tracking the Tropics : Invest 97 timeline and what has changed with the forecast", "date": "2024-08-02 13:45", "url": "https://www.news4jax.com/weather/2024/08/02/invest-97-timeline-and-what-has-changed-to-the-forecast/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "We woke up Friday morning to little change with the tropical wave located over eastern Cuba.\nThe wave called Invest 97L is causing 25 mph winds over the southeastern Bahamas as it tracks westward across Cuba on Friday.\nThe National Hurricane Center gives it a 60% chance of developing in the next 48 hours and 90% over the next seven days.\nLater this evening NOAA will fly a P-3 to collect radar data near Andros Island to improve tonight’s forecast model accuracy.\nThe window to intensify will be short since it will spend much of its time over Cuba and Florida.", "location": "CUBA", "classification": "natural-disasters", "score": 0.6568052216123047, "event_breakdown": "Tropical Wave Invest 97L\nLocation: Southeastern Bahamas\nDescription: The tropical wave, dubbed Invest 97L by the National Hurricane Center, is situated over the southeastern Bahamas. As of Friday morning, it is moving westward across Cuba, with 25 mph winds.\nChance of Development: 60% in the next 48 hours and 90% over the next seven days.\nForecast: The window for intensification will be brief as Invest 97L spends much of its time over Cuba and Florida. Radar data will be collected near Andros Island by NOAA this evening to improve the accuracy of the current forecast model."}, {"id": "a356f2dd-9cc4-4dbb-bfef-b403ef256a99", "title": "Forecasters Warn Invest97 Could Develop into Tropical Storm", "date": "2024-08-02 12:45", "url": "https://969thegame.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "969thegame.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Debby is expected to become the second named storm of the 2023 Atlantic hurricane season, according to the National Hurricane Center (NHC).\nAccuWeather expects this storm to form in southwestern Gulf of Mexico in the next day or two but says it will be out over open ocean and pose no threat to land.\"\nA storm system in the eastern Caribbean Sea could develop into a tropical depression or storm, creating dangerous rip currents and swells in areas of Mexico, the Cayman Islands, and Cuba beginning on Friday.\nThe system is expected to produce up to 2 feet of rain over Puerto Rico and parts of Hispaniola through Thursday, before pivoting northeast and moving near or over Cuba on Friday. As the storm moves back over water in the northwestern Caribbean or southeastern Gulf of Mexico this weekend or early next week, it could become the season's second named storm, according to AccuWeather meteorologists.\nThe wave is moving westward near 15 mph. A westward to west-northwestward motion is expected to continue during the next day or two, followed by a west-southwestward motion when it reaches the southwestern Gulf of Mexico on Friday. On the forecast track, the system is expected to be near the Yucatan Peninsula of Mexico Friday night.\nLocally heavy rainfall and flooding on Hispaniola and portions of Puerto Rico, including Haiti, could occur through Sunday. Across Jamaica, rainfall of 2 to 4 inches, with isolated maximum amounts of 8 inches, could result in areas of flash flooding during the next few days, according to the NHC."}, {"id": "6d25fabf-1371-4d23-8ed8-7168b9c2e42d", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm | Vero Patriot", "date": "2024-08-02 13:30", "url": "https://veropatriot.iheart.com/featured/florida-news/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Tropical storm Debby is headed for the eastern Gulf Coast, and forecasters are warning coastal residents from Florida to Louisiana to get ready. A tropical storm watch may be required for portions of Florida later today."}, {"id": "6b3e2bf4-3f89-4ea5-b834-f8da54e83675", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 13:45", "url": "https://thebeatflorida.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "thebeatflorida.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Event: A storm system in the Atlantic is being monitored by the National Hurricane Center. It could develop into Tropical Storm Debby.\nDisaster Type: storm\nLat/Lon: 23.9N 74.8W\nEvent Date: June 24, 2022\nAdditional Notes: The storm could produce thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland this weekend."}, {"id": "3a54106f-f5a5-4b63-a5ce-d29d04705e33", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm | 107 . 9 WSRZ", "date": "2024-08-02 14:00", "url": "https://wsrz.iheart.com/featured/florida-news/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "wsrz.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Here's a relevant event:\nThe National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby. Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend. Accuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready. Tropical storm watches or warnings could be required for portions of Florida later today."}, {"id": "b8bfed90-d97b-419f-9bc0-6e1f40c95a58", "title": "South Florida could get drenched as tropical wave passes on its way to the Gulf of Mexico", "date": "2024-08-02 13:45", "url": "https://www.yahoo.com/news/south-florida-could-drenched-tropical-121242974.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "South Florida could get drenched as tropical wave passes on its way to the Gulf of MexicoSouth Florida and the Florida Keys are in for a rainy weekend as a disorganized tropical wave — on the verge of strengthening into a tropical depression — is set to pass south of the state on Saturday.\nFlorida could see tropical storm watches or warnings later Friday in advance of the system, which would be named Debby.\nSouth Florida wasn’t included.\nThe National Hurricane Center has been tracking the tropical wave for a week and steadily upping its chances of getting its act together.\nThe tropical wave crossing Cuba is likely to strengthen into a tropical depression sometime over the weekend.", "location": "The main event is: Florida", "classification": "natural-disasters", "score": 0.5769621011740221, "event_breakdown": "1. South Florida could get drenched as a disorganized tropical wave is expected to pass south of the state on Saturday.\n2. Florida could see tropical storm watches or warnings later Friday in advance of the system."}, {"id": "b243b6b7-771f-4f80-b505-e83a01ee1667", "title": "Disaster strikes thrice - Woman burnt by arsonists and Beryl", "date": "2024-08-02 12:00", "url": "http://jamaica-star.com/article/news/20240802/disaster-strikes-thrice-woman-burnt-arsonists-and-beryl", "domain": "jamaica-star.com", "domain_classification": "Unknown", "message": "The latest setback was on July 3, when Hurricane Beryl passed close to Jamaica's south coast and unleashed its venom on places like Portland Cottage.\nUnfortunately, this rebuilt house crumbled during Hurricane Beryl.\nMi see the house start dance, and then it go down.\nAs Hurricane Beryl battered her home, Bartley watched in horror as looters braved the strong winds and rains to steal whatever they could.\nThe Portland Cottage resident is among many who lost their homes to Hurricane Beryl.", "location": "Portland Cottage", "classification": "natural-disasters", "score": 0.7353865875691189, "event_breakdown": "Hurricane Beryl, Portland Cottage, Jamaica"}, {"id": "f76cd18e-c05f-4176-9937-b5ec5efa58d9", "title": "Danger and despair amid darkness in Salt River", "date": "2024-08-02 12:00", "url": "http://jamaica-star.com/article/news/20240802/danger-and-despair-amid-darkness-salt-river", "domain": "jamaica-star.com", "domain_classification": "Unknown", "message": "Residents of Salt River in Clarendon say they're living like prisoners in their own homes, forced to retreat indoors by 7 p.m. daily due to safety concerns.\nCriminals aren't afraid to strike after dark, so by 7 p.m., or even 6 p.m., when it starts getting dark, everyone has to lock up.\nSalt River Road was on the schedule for restoration yesterday.\nAnother long-time Salt River resident noted that the community was peaceful until Hurricane Beryl hit.\nSitting on the sidewalk with friends, a chef lamented having to hang up his apron due to the power outage.", "location": "Clarendon", "classification": "natural-disasters", "score": 0.48788699609207037, "event_breakdown": "1. Hurricane Beryl hit Salt River\n2. Salt River Road in Clarendon is on the schedule for restoration"}, {"id": "974b5b4f-d879-4acb-a22c-6c9eff99c1dd", "title": "TIMING , IMPACTS : Here what to expect in Central Florida with tropical wave", "date": "2024-08-02 14:15", "url": "https://www.clickorlando.com/weather/2024/08/02/timing-impacts-heres-what-to-expect-in-central-florida-with-tropical-wave/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "ORLANDO, Fla. – A high chance for further development is expected Friday morning with a tropical wave over Cuba.\nTIMING:Local model runs show tropical rain bands feeding into Central Florida by Saturday afternoon across southern counties, with northern counties seeing a little less.\nFLORIDA TROPICAL TIMELINEThe surge of moisture is expected to arrive by Sunday with bands of squally gusty downpours streaming in starting Sunday morning and heavier rain by the afternoon.\nRAIN MODEL SUNDAYLOCAL IMPACTS:Regardless of exact track and intensity, Central Florida should prepare for a tropical system to be nearby between Sunday and Tuesday with rainfall being the biggest concern.\nEURO FORECAST RAIN TOTALSThe News 6 Pinpoint Weather Team will continue to update the local timeline and impacts with this tropical system as the forecast models come into better agreement.", "location": "ORLANDO, Fla.", "classification": "natural-disasters", "score": 0.7968146935196958, "event_breakdown": "ORLANDO, Fla. – A high chance for further development is expected Friday morning with a tropical wave over Cuba.TIMELINE:Local model runs show tropical rain bands feeding into Central Florida by Saturday afternoon across southern counties, with northern counties seeing a little less.FLORIDA TROPICAL TIMELINEThe surge of moisture is expected to arrive by Sunday with bands of squally gusty downpours streaming in starting Sunday morning and heavier rain by the afternoon.LOCAL IMPACTS:Regardless of exact track and intensity, Central Florida should prepare for a tropical system to be nearby between Sunday and Tuesday with rainfall being the biggest concern.EURO FORECAST RAIN TOTALSThe News 6 Pinpoint Weather Team will continue to update the local timeline and impacts with this tropical system as the forecast models come into better agreement."}, {"id": "72332e3f-6b7a-4ff1-8421-4a471ec3563f", "title": "NY weather stays hot and stormy through weekend ; track radar here – NBC New York", "date": "2024-08-02 04:30", "url": "https://www.nbcnewyork.com/weather/extreme-heat-and-humidity-to-fuel-storms-through-the-weekend/5660198/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Nearly every day has brought at least a few showers or storms, and we are going to increase the storm activity into the weekend.\nSome of those storms could be strong to severe, capable of producing some locally heavy rainfall.\nExtreme heat in and around the tri-state area will contribute to the instability, too.\nFriday’s storms will be strongest from the New York City area to the west and south.\nThe main threats from Friday’s and the weekend’s storms will be isolated flooding where downpours are the heaviest and isolated damaging straight line wind gusts.", "location": "NEW YORK CITY", "classification": "natural-disasters", "score": 0.8931536011778701, "event_breakdown": "1. Heavy rains have caused flooding in New York and New Jersey.\n2. Tornado warnings were issued for several counties in Texas.\n3. Strong winds caused power outages in Minnesota.\n4. Heavy rains caused mudslides in California.\n5. Thunderstorms caused widespread flooding in Wisconsin.\n6. Strong winds caused widespread power outages in New Jersey.\n7. Heavy rains caused flooding in Connecticut.\n8. Strong winds caused a crane to collapse in New York City.\n9. Heavy rains caused flooding in several states along the Gulf Coast.\n10. Thunderstorms caused power outages in Minnesota."}, {"id": "7b1e8c80-c797-42d9-9519-bcf205b76651", "title": "Extreme flooding , rain kills 250 in India and China", "date": "2024-08-02 12:15", "url": "https://www.ctvnews.ca/world/2024/8/2/rain-related-disasters-have-killed-more-than-250-in-a-deadly-wee.html", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nThis time of year is monsoon and typhoon season in Asia, and climate change has intensified such storms.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "North Korea", "classification": "natural-disasters", "score": 0.7698722825296431, "event_breakdown": "India, China, North Korea"}, {"id": "12bb85b3-85f4-4d92-b384-805b58c7a498", "title": "Rain - related disasters have killed more than 200 in deadly week across Asia", "date": "2024-08-02 08:45", "url": "https://japantoday.com/category/world/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "(Chinatopix via AP, File)By KEN MORITSUGUIn India and China, torrential rains have killed more than 200 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nThis time of year is monsoon and typhoon season in Asia, and climate change has intensified such storms.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": "CHINA", "classification": "natural-disasters", "score": 0.7698722825296431, "event_breakdown": "India and China are two countries that border each other in southern Asia. Both are experiencing torrential rains, flooding, and landslides, leading to more than 200 deaths in the past week.\nIn North Korea, near China, more than 4,000 houses were flooded and more than 3,000 hectares of farmland."}, {"id": "437e0934-1a0f-467e-b37c-8815366615b8", "title": "Rain - related disasters have killed over 250 across Asia", "date": "2024-08-02 10:15", "url": "https://www.sunstar.com.ph/network/rain-related-disasters-have-killed-over-250-in-a-deadly-week-across-asia", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "IN INDIA and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nThis time of year is monsoon and typhoon season in Asia, and climate change has intensified such storms.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose.", "location": ")\nNorth Korea", "classification": "natural-disasters", "score": 0.7698722825296431, "event_breakdown": "In India (Uttarakhand state), China (Guangdong province) and North Korea (border region to China), 251 people were killed in consequence of the torrential rains in the past week. The monsoon season affects Asia at this time of year, and climate change has amplified the intensity and frequency of the storms in recent years."}, {"id": "4827ae9e-368d-4250-93b2-4ac1d9f3cd6c", "title": "Rain - related disasters have killed more than 250 in a deadly week across Asia", "date": "2024-08-02 10:15", "url": "https://www.news-gazette.com/news/nation-world/rain-related-disasters-have-killed-more-than-250-in-a-deadly-week-across-asia/article_1bccaa80-f8d6-5cb3-8d21-944d13ee2ed6.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Champaign, IL (61820)TodayPartly cloudy skies this morning will give way to occasional showers during the afternoon.\nWinds NNW at 10 to 15 mph.\nChance of rain 40%..TonightMainly clear.\nWinds NNW at 5 to 10 mph.", "location": "Champaign", "classification": "natural-disasters", "score": 0.5812665977101462, "event_breakdown": "Champaign, IL (61820)TodayPartly cloudy skies this morning will give way to occasional showers during the afternoon.\nWinds are expect to be around 5 mph.\nChance of rain 40%."}, {"id": "68c55c28-76db-4f73-9c2f-035c471e4adc", "title": "Disturbance to enter the Gulf this weekend ; intense heat locally", "date": "2024-08-02 00:15", "url": "https://www.fox10tv.com/2024/08/01/disturbance-enter-gulf-this-weekend-intense-heat-locally/", "domain": "fox10tv.com", "domain_classification": "Unknown", "message": "MOBILE, Ala. (WALA) - It will be an uncomfortable and at times dangerously hot day across the Gulf coast.\nWe’re used to hot weather, but don’t let the heat sneak up on you!\nWhen someone is suffering from heat exhaustion or heat stroke they’ll often be confused and find it hard to care for themselves.\nWe are continuing to track an area of disturbed weather as it approaches the Gulf of Mexico.\nIt appears that it will move through the Eastern Gulf and then up the west coast of Florida.", "location": ")\nFLORIDA", "classification": "natural-disasters", "score": 0.5537627148509096, "event_breakdown": "Natural Disasters reports in the present time frame are as listed below:\n\n* Unseasonably dangerous heat across the Gulf of Mexico\n* Disturbance approaching the Gulf of Mexico\n* Area of disturbed weather in the Gulf\n* Disturbance approaching Florida.\n\nRelevant Report with the following identified News reports.\nA potentially dangerous heat is moving in the Gulf coast, with heat exhaustion and heat stroke threatening people in Mobile, Alabama. We are tracking an area of disturbed weather approaching the Gulf of Mexico. It appears that it will move through the Eastern Gulf and then up the west coast of Florida. \n\nAdditional storms are forecast to hit part of the United States, with some weather forecasters predicting that this storm season will showcase extremely dangerous storms."}, {"id": "b80855fd-e315-425e-928e-305f31053cd0", "title": "Tropical storm watches and warnings go up in Florida | Hurricane Wire", "date": "2024-08-02 19:00", "url": "https://www.postandcourier.com/hurricanewire/tropical-storm-florida-south-carolina/article_2d7887b0-50e5-11ef-b570-0f9229e54dd9.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "A tropical wave that's been slowly moving across the South Atlantic for about a week is gaining strength and generating tropical storm watches and warnings along Florida's west coast.\nCurrently moving west-northwest at 16 mph, Potential Tropical Storm 4 was centered over eastern Cuba in the early afternoon of Aug. 2.\nBy the morning of Saturday, Aug. 3 it's predicted to be a tropical depression and then reach tropical storm strength during the night.\nLooking forward, the storm is expected to remain at tropical storm strength at least into Aug. 7.\nWith three named storms already this hurricane season, this storm will be named Debby if it reaches tropical storm strength as currently expected.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9120315005421239, "event_breakdown": "Potential Tropical Storm 4, moving west-northwest at 16 mph across Cuba on Aug. 3 and predicted to become a tropical storm, currently named Debby."}, {"id": "236b31cb-95c0-4ebe-af5c-999fcc430796", "title": "Invest 97L : Tropical depression to form near Florida this weekend , may strengthen to Tropical Storm Debby", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/invest-97l-tropical-depression-form-101152884.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby may form this weekend; tropical storm watches, warnings issued in Florida (Live updates)Potential Tropical Cyclone Four: Live forecast updatesORLANDO, Fla. - Here are the latest updates from the National Hurricane Center regarding Potential Tropical Cyclone Four:2 p.m. updatePotential Tropical Cyclone Four is located about 30 miles southeast of Cuba and 360 miles southeast of Key West.\n11 a.m. updatePotential Tropical Cyclone Four is located over Cuba and is about 420 miles southeast of Key West, Florida.\n11am EDT August 2nd: Here are the initial key messages for Potential Tropical Cyclone Four (#PTC4).\nThe National Hurricane Center (NHC) is keeping a close eye on Potential Tropical Cyclone Four, formerly known as Invest 97L, which has a strong chance of becoming a tropical depression, and potentially Tropical Storm Debby this weekend near Florida.\nPotential Tropical Cyclone Four: Latest trackForecasters are encouraging Florida residents to top off their supplies now and continue to monitor the forecast.", "location": ".\nFlorida", "classification": "natural-disasters", "score": 0.9228506262957149, "event_breakdown": "Tropical Storm Claudette\nTropical Storm Danny\nTropical Storm Grace\nTropical Storm Henri\nTropical Storm Fred\nTropical Storm Mindy\nTropical Storm Nicholas\nTropical Storm Odette\nTropical Storm Peter\nTropical Storm Rose"}, {"id": "1ac72d38-d14c-470a-b6f7-147ac6e07aed", "title": "Is the pending tropical storm going to impact Texas ? Track path of Invest 97L", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/pending-tropical-storm-going-impact-143954090.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Is the pending tropical storm going to impact Texas?\n➤ Track all active storms➤ Spaghetti models for Invest 97LWill Invest 97L impact Texas?\nInvest 97L could become tropical depression, Tropical Storm DebbyIt's becoming more likely that Invest 97L could become a tropical depression then a tropical storm.\nTropical Storm Debby would be the fourth storm in the 2024 Atlantic Hurricane Season, following Tropical Storm Alberto and Hurricane Beryl that both made landfall along the Texas Coast and Tropical Storm Chris that brought heavy rainfall and flooding to parts of Mexico in early July.\nThis article originally appeared on Austin American-Statesman: Track path of Invest 97L and see its impact on Texas", "location": ")\nTexas", "classification": "natural-disasters", "score": 0.9289795384213858, "event_breakdown": "Invest 97L could impact Texas, could become Tropical Storm Debby"}, {"id": "4e71371c-147d-4662-b16a-33c558a30199", "title": "Is the pending tropical storm going to impact Texas ? Track path of Invest 97L", "date": "2024-08-02 17:45", "url": "https://www.yahoo.com/news/pending-tropical-storm-going-impact-143954337.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Is the pending tropical storm going to impact Texas?\n➤ Track all active storms➤ Spaghetti models for Invest 97LWill Invest 97L impact Texas?\nInvest 97L could become tropical depression, Tropical Storm DebbyIt's becoming more likely that Invest 97L could become a tropical depression then a tropical storm.\nTropical Storm Debby would be the fourth storm in the 2024 Atlantic Hurricane Season, following Tropical Storm Alberto and Hurricane Beryl that both made landfall along the Texas Coast and Tropical Storm Chris that brought heavy rainfall and flooding to parts of Mexico in early July.\nThis article originally appeared on Austin American-Statesman: Track path of Invest 97L and see its impact on Texas", "location": ")\nTexas", "classification": "natural-disasters", "score": 0.9289795384213858, "event_breakdown": "* Invest 97L is currently located near Bermudas and is moving towards Texas coast.\n* If Invest 97L forms into a  hurricane, the storm is likely to have indirect impact on coastal areas along Texas and Mexico.\n* Houston could be one of the cities affected by this potential upcoming hurricane."}, {"id": "0e69f50f-7e5d-4f34-a5f6-37cc7235b31c", "title": "Upcoming tropical storm has Florida , southeast US on alert", "date": "2024-08-02 16:30", "url": "https://www.yahoo.com/news/upcoming-tropical-storm-florida-southeast-151954908.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "During the rest of the week, the tropical rainstorm pushed slowly but steadily westward across Puerto Rico, Hispaniola and Cuba.\nThe feature's next encounter will be with Florida--likely as a strengthening tropical storm this weekend.\nWind shear, or disruptive steady or shifting breezes, is light in the area where the tropical rainstorm is headed.\nIf it becomes a tropical storm, it will be called Debby.\nThat interaction may result in excessive rainfall and flooding well north and west, away from or removed from the tropical feature itself.", "location": "Florida", "classification": "natural-disasters", "score": 0.7618592300007218, "event_breakdown": "Current natural-disaster events that can be placed on a map include:\n\n- A tropical rainstorm is currently pushing westward across Puerto Rico, Hispaniola, and Cuba, and is expected to strengthen into a tropical storm by the time it reaches Florida.\n- A low-pressure system is forming in the Bay of Bengal and is expected to develop into a severe cyclonic storm within the next 24 hours.\n- A major earthquake occurred in Oaxaca, Mexico, on Friday, and aftershocks continue to be felt in the area."}, {"id": "de8fed04-960c-43eb-bb6f-56012cc4c98c", "title": "Confidence grows for tropical storm system to impact Florida , southeastern U . S . ", "date": "2024-08-02 15:15", "url": "https://www.nj.com/weather/2024/08/confidence-grows-for-tropical-storm-system-to-impact-florida-southeastern-us.html", "domain": "nj.com", "domain_classification": "Unknown", "message": "The National Hurricane Center has started to issue tropical storm warnings and watches for parts of Florida on Friday as confidence continues to grow that a tropical wave near eastern Cuba will strengthen into a tropical storm in the next two days.\nA tropical storm watch is in effect for:The Florida Keys south of the Card Sound Bridge including the Dry Tortugas.\nA tropical storm warning indicates tropical storm conditions — heavy rain, rough surf, and winds gusting as high as 39 to 73 mph — are expected somewhere within the warning area within 36 hours, and a tropical storm watch means tropical storm conditions are possible within the watch area, generally within 48 hours.\nThe season, which officially began on June 1, has seen three named storms — Tropical Storm Alberto, Hurricane Beryl and Tropical Storm Chris.\nBeryl rapidly intensified from a tropical storm to a monster hurricane, reaching Category 5 status with top sustained winds of 165 mph.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.939002687003024, "event_breakdown": "Tropical Storm Warning issued for Florida Keys"}, {"id": "7efb858f-51a5-47e3-a085-013f69fb626d", "title": "Forecasters alert : a tropical storm warning and a tropical storm watch in effect for portions of Florida", "date": "2024-08-02 15:45", "url": "https://www.yahoo.com/news/forecasters-alert-tropical-storm-warning-151001459.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor the progress of this system.\nHAZARDS AFFECTING LAND:WINDS: Tropical storm conditions are expected in the warning area late Saturday and Saturday night.\nTropical storm conditions are possible in the watch area in the Florida Keys and the southern Florida peninsula by Saturday or Saturday night.\nTropical storm conditions are possible in the watch area along the Florida west coast Saturday night or Sunday.", "location": "KEY WEST", "classification": "natural-disasters", "score": 0.7667730390348287, "event_breakdown": "Tropical Storm Alex is expected to bring tropical storm conditions to the Florida Keys and the southern Florida peninsula on Saturday night."}, {"id": "75e88d01-cddf-4f79-a8b4-60dc73a2eeb9", "title": "Tampa Bay under tropical storm watch with system likely to form over Gulf", "date": "2024-08-02 16:00", "url": "https://www.tampabay.com/news/weather/2024/08/02/tropical-depression-likely-form-over-gulf-mexico-forecasters-say/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "In a 2 p.m. update, federal meteorologists kept the Tampa Bay area under a tropical storm watch, with possible storm surge of up to 3 feet.\nA warning means that tropical storm conditions are expected within 36 hours, while a watch means that storm conditions are possible within 48 hours.\nAs of Friday afternoon, the potential tropical storm had maximum sustained winds of 30 mph, with higher gusts.\npic.twitter.com/mp05eR2YTk — NWS Tampa Bay (@NWSTampaBay) August 1, 2024Tampa city officials urged residents Friday afternoon to “take precaution” and finish plans before rough weather arrives.\nTampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters.", "location": "Tampa Bay", "classification": "natural-disasters", "score": 0.9621760052680067, "event_breakdown": "In a 2 p.m. update, federal meteorologists kept the Tampa Bay area under a tropical storm watch, with possible storm surge of up to 3 feet.\n\nAs of Friday afternoon, the potential tropical storm had maximum sustained winds of 30 mph, with higher gusts.\n\nTampa city officials urged residents Friday afternoon to “take precaution” and finish plans before rough weather arrives."}, {"id": "e54736b8-6e94-4367-a7a7-c957854028d5", "title": "Will Fort Myers , Lee County see Tropical Storm Debby watches or warnings today ? ", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/fort-myers-lee-county-see-141607502.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical storm watches and warnings have been issued for portions of Florida, including a storm watch in Fort Myers and Lee County, ahead of a possible landfall as Tropical Storm Debby along Florida's West Coast over the weekend.\nA tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nA tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA tropical storm watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8374904717700856, "event_breakdown": "Tropical storm warnings have been issued for portions of Florida, including a storm warning in Fort Myers and Lee County. Tropical storm watches are also in effect for the Florida Keys and the Cuban provinces of Pinar del Rio, Artemisa, Mayabeque, Havana, and Matanzas."}, {"id": "fff5e783-43af-4e67-9082-abddda7e661f", "title": "Potential Storm No . 4 likely to strengthen and forecast to hit Florida this weekend with torrential rain and wind - WSVN 7News | Miami News , Weather , Sports", "date": "2024-08-02 16:45", "url": "https://wsvn.com/news/local/miami-dade/potential-storm-no-4-likely-to-strengthen-and-forecast-to-hit-florida-this-weekend-with-torrential-rain-and-wind/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "WATCHES & WARNINGS:-All of the #Florida Keys from Card Sound Bridge to Key West, including the Dry Tortugas are under a Tropical Storm Watch.\n-Tropical Storm Warning for East Cape Sable to Bonita Beach.\n-Tropical Storm Watch North of Bonita Beach to Aripeka.\n@wsvn #flwx pic.twitter.com/IlPZmEKp7Y — Vivian Gonzalez (@VivianGonzalez7) August 2, 2024The hurricane center has labeled it Potential Tropical Cyclone Four for now.\nForecasting models predict it could come ashore as a tropical storm on Sunday and cross over Florida’s Big Bend region into the Atlantic Ocean, where it’s likely to remain a tropical storm threatening Georgia and the Carolinas early next week.", "location": "in quotes\nFLORIDA", "classification": "natural-disasters", "score": 0.934682315824152, "event_breakdown": "Potential Tropical Cyclone Four in the Gulf of Mexico."}, {"id": "29e72f04-3c70-4706-a849-8b45cb4c676d", "title": "Hurricane season NC | Tropics are heating up and North Carolina could be in path of a brewing system", "date": "2024-08-02 18:15", "url": "https://abc11.com/post/hurricane-season-nc-tropics-are-heating-north-carolina-could-path-brewing-system/15136938/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Potential tropical storm system could make its way into North Carolina: TimelineNOAA is calling for heavy rainfall that may result in flash flooding across portions of Florida and the southeast this weekend through Wednesday morning.\nNOAA is calling for heavy rainfall that may result in flash flooding across portions of Florida and the southeast this weekend through Wednesday morning.\nNOAA is calling for heavy rainfall that may result in flash flooding across portions of Florida and the southeast this weekend through Wednesday morning.\nNOAA is calling for heavy rainfall that may result in flash flooding across portions of Florida and the southeast this weekend through Wednesday morning.\nTropical storm conditions are expected in Florida and up along the east coast all the way into North Carolina.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8673095807471963, "event_breakdown": "Potential tropical storm system could make its way into North Carolina - NOAA is calling for heavy rainfall that may result in flash flooding across portions of Florida and the southeast this weekend through Wednesday morning."}, {"id": "dc936051-6f21-4d60-964a-afe587fbce31", "title": "Florida storm tracker : Tropical Storm Debby forecast to form , bringing heavy rain and strong winds", "date": "2024-08-02 19:00", "url": "https://www.yahoo.com/news/florida-storm-tracker-tropical-storm-debby-forecast-to-form-bringing-heavy-rain-and-strong-winds-182910444.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "People fill sandbags in preparation for potential Tropical Storm Debby in Plant City, Fla., on Friday.\n(Chris O’Meara/AP)Florida is bracing for a “major disaster” this weekend as a powerful storm system could develop into Tropical Storm Debby, potentially bringing up to a foot of rain that could cause flooding and power outages and bring gusty winds.\nIf the tropical wave — a disturbance of unorganized showers and thunderstorms — reaches sustained wind speeds of 39 mph, it would form into Tropical Storm Debby, making it the fourth named storm for this year’s Atlantic hurricane season.\nThe storm is then expected to head to Florida’s west coast, stretching to the Big Bend in the northern part of the state, on Sunday night.\n(Chris O’Meara/AP)Tropical storm warnings and watches issued in FloridaAs of Friday morning, the NHC issued tropical storm watches and warnings for the Florida Keys — a chain of islands off the southern coast of Florida — and for portions of the west coast of the Florida Peninsula.", "location": "Florida", "classification": "natural-disasters", "score": 0.9808007505830835, "event_breakdown": "Florida is bracing for a “major disaster” this weekend as a powerful storm system could develop into Tropical Storm Debby, potentially bringing up to a foot of rain that could cause flooding and power outages and bring gusty winds.\n— Florida braces for Tropical Storm Debby\nIf the tropical wave reaches sustained wind speeds of 39 mph, it would form into Tropical Storm Debby, making it the fourth named storm for this year's Atlantic hurricane season.\n\nAs of Friday morning, the NHC issued tropical storm watches and warnings for the Florida Keys and for portions of the west coast of the Florida Peninsula.\n\nList complete"}, {"id": "daa03079-8004-4824-8e87-777d1aaf801d", "title": "Forecast : Tropical Cyclone May Bring South Florida Heavy Rains , Floods", "date": "2024-08-02 18:45", "url": "https://www.miaminewtimes.com/news/forecast-south-florida-may-see-heavy-rain-floods-from-tropical-wave-20931984", "domain": "miaminewtimes.com", "domain_classification": "Unknown", "message": "click to enlarge The forecast track for the tropical wave predicts landfall on Florida's Gulf Coast or the Panhandle.\nNational Oceanic and Atmospheric Administration graphicA Flood Watch is in effect for all of South Florida, effective now through Sunday evening.\npic.twitter.com/AMEz7mc7fX — NWS Miami (@NWSMiami) August 2, 2024Satellite imagery on August 2, 2024, shows a tropical wave over Cuba.\nRon DeSantis declared a state of emergency for most Florida counties on Thursday as the Florida Panhandle and state's Gulf Coast remain in the storm's cone of uncertainty.\nMeteorologist Brian McNoldy toldon Thursday the disturbance will likely intensify once it passes South Florida.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.7995749160112885, "event_breakdown": "Flood Watch issued for all of South Florida, effective now through Sunday evening. National Weather Service Miami reported on twitter."}, {"id": "0d72461e-a133-42f0-aba2-afa953505e6f", "title": "Tropical Storm Warnings Issued for Florida Gulf Coast", "date": "2024-08-02 18:30", "url": "https://www.theepochtimes.com/us/tropical-storm-warnings-issued-for-floridas-gulf-coast-5698513", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Tropical storm warnings are in effect for the southwest coast of the Florida peninsula, the National Hurricane Center (NHC) has said.\nTropical storm warnings, indicating tropical storm conditions are expected in the warning area within 36 hours, are now in effect for a stretch of southwest Florida from East Cape Sable to Bonita Beach.\nA tropical storm watch, indicating possible tropical storm conditions in the watch area generally within 48 hours, is in effect for the lower Florida Keys south of the Card Sound Bridge, Dry Tortugas National Park, and the Florida coast north of Bonita Beach to Aripeka.\nTropical storm conditions in the warning area are expected to arrive by late Aug. 3 and are possible in the watch area between the night of Aug. 3 and Aug. 4.\nThe National Weather Service (NWS) defines a tropical storm as boasting winds of between 39 mph and 73 mph.", "location": "Florida", "classification": "natural-disasters", "score": 0.941634760332582, "event_breakdown": "Tropical Storm Warning issued for southwest Florida, Tropical Storm Watch issued for lower Florida Keys, Dry Tortugas National Park, and Florida coast north of Bonita Beach to Aripeka. Tropical Storm conditions are expected to arrive by late Aug. 3 and are possible in the warned area between the night of Aug. 4 and Aug. 5."}, {"id": "7419c96e-7066-42c4-9531-ee7f37b8af15", "title": "Tropical depression to form in Gulf this weekend", "date": "2024-08-02 15:45", "url": "https://www.fox8live.com/2024/08/02/tropical-depression-form-gulf-this-weekend/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "NEW ORLEANS (WVUE) - The National Hurricane Center has upgraded the tropical disturbance nearing the Gulf of Mexico to Potential Tropical Cyclone (PTC) Four and issued the first forecast track.\nThe disturbance was known as Invest 97L, but has since been pushed to a potential tropical cyclone so watches and warnings can be issued for Florida’s Gulf Coast.\nHurricane Hunters are collecting data from the storm Friday morning.\nNHC issues first track for PTC4, expected to become tropical depression this weekend (WVUE)IMPORTANT LINKSOn the current path, PTC4 is expected to strengthen into a tropical depression or storm before landfall.\nThe system is expected to enter the Gulf on Saturday.", "location": "Florida's Gulf Coast.", "classification": "natural-disasters", "score": 0.8822205291002438, "event_breakdown": "Potential Tropical Cyclone Four, being monitored by the National Hurricane Center (NHC), is expected to become a full tropical depression or storm before making landfall in Florida this weekend. The disturbance, referred to as Invest 97L, is currently located near the Bahamas and drifting slowly toward the southeast. The NHC has issued the first forecast track for PTC4, indicating the storm will likely head northeast into the Gulf on Saturday."}, {"id": "6d3c1503-c065-44fa-86f5-0f66ca74a1aa", "title": "Florida Tropical storm forecast : Hurricane threat lingers ; South Florida set for soaking", "date": "2024-08-02 18:45", "url": "https://www.yahoo.com/news/florida-tropical-storm-forecast-hurricane-172657473.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical storm warnings are now in effect for much of the Southwest Florida coast, with tropical storm watches for the Keys and north to the Nature Coast.\nIn that case, having an additional day over warm water and favorable outflow would boost probable landfall intensity into the moderate tropical storm to Category 1 hurricane range.\nNorth Florida should stay alert for possible hurricane; South Florida should brace for 3-10 inches of rainTwo days over the Gulf is enough to cause advanced mischief, and North Florida should be on alert at this point for a hurricane threat early next week.\nThat said, it could still have enough time to strengthen into a tropical storm before making landfall.\nThis article originally appeared on Tallahassee Democrat: Florida Tropical storm forecast: Debby downpour and hurricane threat", "location": "Florida", "classification": "natural-disasters", "score": 0.9420557182747393, "event_breakdown": "Tropical storm warnings are now in effect for much of the Southwest Florida coast, with tropical storm watches for the Keys and north to the Nature Coast. In that case, having an additional day over warm water and favorable outflow would boost probable landfall intensity into the moderate tropical storm to Category 1 hurricane range. North Florida should stay alert for possible hurricane; South Florida should brace for 3-10 inches of rainTwo days over the Gulf is enough to cause advanced mischief, and North Florida should be on alert at this point for a hurricane threat early next week. This article originally appeared on Tallahassee Democrat: Florida Tropical storm forecast: Debby downpour and hurricane threat Tropical storm warnings are now in effect for much of the Southwest Florida coast, with tropical storm watches for the Keys and north to the Nature Coast.\n\nIn that case, having an additional day over warm water and favorable outflow would boost probable landfall intensity into the moderate tropical storm to Category 1 hurricane range.\n\nNorth Florida should stay alert for possible hurricane; South Florida should brace for 3-10 inches of rain\n\nTwo days over the Gulf is enough to cause advanced mischief, and North Florida should be on alert at this point for a hurricane threat early next week. This article originally appeared on Tallahassee Democrat: Florida Tropical storm forecast: Debby downpour and hurricane threat"}, {"id": "0902b7ea-23dc-44b8-9d8c-498b531bc7ab", "title": "A tropical system is brewing in the Atlantic . Here how it could impact SC", "date": "2024-08-02 17:45", "url": "https://www.yahoo.com/news/tropical-system-brewing-atlantic-could-162011697.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical system is brewing in the Atlantic.\nHere’s how it could impact SCPotential Tropical Cyclone Four in the Atlantic could develop into a tropical depression and hit the southeastern United States, according to the National Hurricane Center.\nWith rain expected in the Carolinas before the system could hit, flash and urban flooding are also concerns for the Lowcountry.\nIf the disturbance does develop into a tropical storm or a hurricane, it will be called Debby.\nThe latest from the NHC’s tropical weather outlook can be accessed here and the NWS’s hazardous weather outlook for Myrtle Beach can be accessed here.", "location": "SC", "classification": "natural-disasters", "score": 0.9396692731578066, "event_breakdown": "Tropical Cyclone Four in the Atlantic could impact Southeastern United States, causing potential for flash and urban flooding in South Carolina."}, {"id": "1564bfe7-767a-4af7-bb91-a2d784e09af1", "title": "Manatee County officials declare state of emergency ahead of tropical storm weather", "date": "2024-08-02 15:45", "url": "https://www.yahoo.com/news/manatee-county-officials-declare-state-142124785.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Manatee County and City of Bradenton leaders declared a local state of emergency Friday ahead of a pressure system that is expected to strengthen into a tropical storm by Saturday evening.\nIf sustained winds reach 39 mph, it could become the fourth named storm of the 2024 Atlantic hurricane season: Tropical Storm Debby.\nAt 11 a.m. Friday, the National Hurricane Center placed Manatee County’s coastal areas under a tropical storm watch, which means that tropical storm conditions are possible within the next 48 hours.\n“It’s important for the public to monitor the storm and prepare for the possible flooding effects,” Manatee County Commissioner Mike Rahn said.\nTropical storm watches and warnings were issued for portions of Florida ahead of a possible landfall along the Florida coast Sunday, with the storm expected to strengthen into Tropical Storm Debby as early as Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9613393033447236, "event_breakdown": "Tropical Storm Debby is currently forming off the coast of Florida and will likely strengthen into a tropical storm by Saturday evening. Manatee County and City of Bradenton leaders are warning residents of the potential for flooding and is urging the public to monitor the storm closely."}, {"id": "7cb9c496-279f-4424-af85-2235da35073a", "title": "Chances for tropical depression off Florida coast up to 90 %, hurricane center says", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/chances-tropical-depression-off-florida-121300339.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center issued a tropical storm warning for parts of Florida as it began advisories on what it’s now calling Potential Tropical Cyclone Four.\n“Tropical storm conditions are expected in the warning area late Saturday and Saturday night,” Beven said.\n“Tropical storm conditions arepossible in the watch area in the Florida Keys and the southern Florida peninsula by Saturday or Saturday night.\nThe NHC’s official path is fed by several weather models that have the path steering it up Florida’s west coast and moving inland.\nIt’s not forecast to intensify, but if this system got strong enough, it could become Tropical Storm Debby.", "location": "Florida", "classification": "natural-disasters", "score": 0.9237708081243591, "event_breakdown": "Tropical Storm Potential Tropical Cyclone Four - Florida, United States"}, {"id": "92c2628a-6595-44f2-ad21-bf7cf56ddd3d", "title": "Invest 97L expected to impact Florida with heavy rain , potential flooding as development chances increase", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/invest-97l-expected-impact-florida-100754095.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. - Invest 97L is now Potential Tropical Cyclone Four and portions of Florida are under a Tropical Storm Watch of Warning.\nA Tropical Storm Warning has been issued in Southwest Florida from East Cape Sable to Bonita Beach.\nA Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nShe expects Potential Tropical Cyclone 4 to become a tropical low and possible Tropical Storm Debby on Saturday as it moves into the Florida Straits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8708507446583231, "event_breakdown": "Potential Tropical Cyclone Four is currently located in the Gulf of Mexico and is expected to become a tropical storm as it moves into the Florida Straits and will be called Tropical Storm Debby."}, {"id": "f68293de-83e0-4fa1-bc41-d284dbcbe5aa", "title": "Tropical disturbance will bring squally , wet weather to South Florida this weekend", "date": "2024-08-02 14:15", "url": "https://www.cbsnews.com/miami/news/tropical-disturbance-will-bring-squally-wet-weather-to-south-florida-this-weekend/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "It has issued a Next Alert for Saturday as the moisture associated with this wave will produce rounds of heavy rain and the potential for flooding this weekend across South Florida.\nThe National Hurricane Center said a tropical depression is likely to form this weekend over the Straits of Florida or in the eastern Gulf of Mexico near the Florida peninsula.\nNEXT WeatherRegardless of development, the biggest concern for South Florida will be the potential for rounds of heavy downpours and localized flooding.\nThere is a moderate threat of excessive rainfall in South Florida.\nSome showers and a few storms moved across parts of South Florida during the morning.", "location": "Florida", "classification": "natural-disasters", "score": 0.91860203482921, "event_breakdown": "Flooding in South Florida\nRounds of rain expected; flooding possible\nTropical Depression forming: There is a moderate threat for excessive rainfall in South Florida, regardless of whether a system develops. Regardless of development, the biggest concern for South Florida will be the potential for rounds of heavy downpours and localized flooding. A tropical depression is likely to form over the Straits of Florida or in the eastern Gulf of Mexico next weekend."}, {"id": "a51bf69c-69ca-4e76-9ffe-8011ed6aad26", "title": "Tropical storm watches or warnings expected today for parts of Florida", "date": "2024-08-02 15:45", "url": "https://www.local10.com/weather/hurricane/2024/08/02/tropical-storm-watches-or-warnings-expected-today-for-parts-of-florida/", "domain": "local10.com", "domain_classification": "Unknown", "message": "A tropical storm watch is also in effect for the Florida Keys and for the Gulf Coast of Florida from north of Naples to around Tarpon Springs north of Tampa, including Tampa Bay.\nThe bigger flood threat will be along the western peninsula, Big Bend, and into parts of north Florida later this weekend and early next week.\nThe eastern Gulf hotbedAs we discussed in yesterday’s newsletter, the eastern Gulf of Mexico is one of the last places we want to see a developing storm system in the coming days.\nPlot of water temperatures since Monday at NOAA buoys at Clearwater Beach and Cedar Key along Florida’s Gulf Coast.\nInterests farther up the Florida peninsula and along Florida’s Gulf Coast, including the Big Bend into north Florida, should follow the changing forecasts closely.", "location": "Based on the provided information, the most specific location that describes the main focus of the events described in the text is '", "classification": "natural-disasters", "score": 0.814488585789807, "event_breakdown": "Tropical Storm Alex: The first named storm of the Atlantic hurricane season is expected to make landfall in the Florida Keys or the Florida peninsula this weekend, bringing heavy rain and strong winds."}, {"id": "4bc17993-c1f0-4915-9598-86db39499c3b", "title": "Invest 97L continues path toward Florida . Here what to know", "date": "2024-08-02 10:45", "url": "https://www.clickorlando.com/weather/2024/08/02/invest-97l-continues-path-toward-florida-heres-what-to-know/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "ORLANDO, Fla. – A tropical wave continues on its path toward Florida, bringing the threat of heavy rain.\nThe National Hurricane Center on Friday designated Potential Tropical Cyclone Four, which was Invest 97L, over eastern Cuba.\nPTC Four TrackA tropical storm warning is in effect for the southwest coast of the Florida peninsula, from East Cape Sable to Bonita Beach.\nA tropical storm watch is in effect for the Florida Keys south of the Card Sound Bridge including the Dry Tortugas, the southern coast of the Florida peninsula east of East Cape Sable to the Card Sound bridge, and for the west coast of the Florida peninsula north of Bonita Beach to Aripeka.\nThe latest tropical models differ a bit on where the system will be by Sunday and its intensity.", "location": "Based on the text, the most specific location where the main event is likely to occur is 'Florida'.", "classification": "natural-disasters", "score": 0.969635700596134, "event_breakdown": "Tropical storm warning issued for southwest coast of Florida\nA tropical storm warning is in effect for the southwest coast of Florida, from East Cape Sable to Bonita Beach. A tropical storm watch is in effect for the Florida Keys and the west coast of the Florida peninsula."}, {"id": "093ff6fa-7127-484c-a0a5-d17dffe90595", "title": "Invest 97L Has Now Become Potential Tropical Cyclone 4 ; Its Expected to Strengthen and Become a Tropical Storm Named Debby", "date": "2024-08-02 19:30", "url": "https://www.wqcs.org/2024-08-02/invest-97l-has-now-become-potential-tropical-cyclone-4-its-expected-to-strengthen-and-become-tropical-storm-debby", "domain": "wqcs.org", "domain_classification": "Unknown", "message": "Florida - Friday August 2, 2024: The National Hurricane Center (NHC) has now upgraded that tropical wave named Invest 97L to Potential Tropical Cyclone 4.\nIt is not yet a tropical depression, but it is expected to strengthen into a tropical storm that will be named Debbie.\nThere will be \"wide-spread impacts\" said Brennan which include heavy rainfall and the possibility of coastal flooding as well as flash and urban flooding.\nThe main threat to Florida appears to be along the southern and western shores of the Peninsula.\nTropical Storm Watches and Warnings are now in effect for the Florida Keys and along the Florida west coast.", "location": ".\nFlorida.", "classification": "natural-disasters", "score": 0.9435585349966562, "event_breakdown": "Event 1: Florida - Friday August 2, 2024: The National Hurricane Center (NHC) has now upgraded that tropical wave named Invest 97L to Potential Tropical Cyclone 4. It is not yet a tropical depression, but it is expected to strengthen into a tropical storm that will be named Debbie. There will be \"wide-spread impacts\" said Brennan which include heavy rainfall and the possibility of coastal flooding as well as flash and urban flooding. The main threat to Florida appears to be along the southern and western shores of the Peninsula.\n\nEvent 2: Tropical Storm Watches and Warnings are now in effect for the Florida Keys and along the Florida west coast."}, {"id": "abb3eb82-5238-4433-9764-b79147d2aace", "title": "Tropical storm warning issued for Florida : Will storm affect Alabama ? ", "date": "2024-08-02 16:00", "url": "https://www.al.com/hurricane/2024/08/tropical-storm-watches-possible-in-florida-later-today.html", "domain": "al.com", "domain_classification": "Unknown", "message": "Parts of Florida’s west coast were put under tropical storm warnings and watches on Friday as a tropical disturbance tracked closer to the Gulf of Mexico.\nThe National Hurricane Center upgraded a tropical wave to Potential Tropical Cyclone Four on Friday.\nIt needs sustained winds of 39 mph to be considered a tropical storm and get a name.\nTropical storm conditions are possible in the watch area in the Florida Keys and the southern Florida peninsula by Saturday or Saturday night.\n🌀 10am Tropical Update (08/02): Potential Tropical Cyclone 4 will move into the eastern Gulf of Mexico this weekend.", "location": "Florida", "classification": "natural-disasters", "score": 0.8880350172452812, "event_breakdown": "Florida, USA - Tropical Storm Warnings/Watches in effect for parts of the west coast of Florida as Potential Tropical Cyclone Four heads closer to the Gulf of Mexico."}, {"id": "8dd303a8-bc7c-4d54-9cef-2670558afddf", "title": "Are we getting Tropical Storm Debby ? Forecasters watching Florida - bound storm", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/getting-tropical-storm-debby-forecasters-135813812.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is monitoring a slow moving system that is likely to develop into a tropical depression over the weekend.\nThe tropical wave that could become Tropical Storm Debby has a 70 percent chance of strengthening through the weekend.\nBy the weekend, as the system leaves Cuba, it may begin to strengthen, as will the possibilities of a tropical storm forming.\nThe track of the storm will depend on how quickly the tropical rainstorm strengthens, and the warm waters could help it along.\nThis article originally appeared on USATNetwork: Tropical Storm Debby could happen this weekend; what to know", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.7919358351186639, "event_breakdown": "Possible formation of Tropical Storm Debby in the Caribbean Sea."}, {"id": "f5a86a81-154f-4940-8eac-f4a2202a28c2", "title": "Tropical wave expected to bring showers , thunderstorms to South Florida", "date": "2024-08-02 16:00", "url": "https://www.gulflive.com/weather/2024/08/tropical-wave-expected-to-bring-showers-thunderstorms-to-south-florida.html", "domain": "gulflive.com", "domain_classification": "Unknown", "message": "A tropical wave nearing Cuba on Friday is highly likely to develop into a tropical storm, posing a threat to Florida this weekend.\nEastern Cuba, Hispaniola, the southeastern Bahamas, and Jamaica are already experiencing rain showers and thunderstorms from the well-developed tropical wave.\nIf the wave persists on its trajectory, tropical storm watches or warnings could be issued for Florida as soon as Friday.\nForecasts predict heavy rains and potential flash flooding in Florida, Cuba, and the Bahamas throughout the weekend.\nAs the tropical wave brings showers and thunderstorms ashore, residents should monitor updates from NOAA and the National Weather Service.", "location": ".\nFlorida", "classification": "natural-disasters", "score": 0.9098426829356848, "event_breakdown": "Tropical wave developing near Cuba, Tropical Storm Barry near Louisiana, Earthquake in Alaska"}, {"id": "8c3b7d56-8137-4ac4-b30a-5a54d7338293", "title": "Tropical disturbance expected to strengthen , drench Florida Gulf Coast", "date": "2024-08-02 19:30", "url": "https://www.wrkf.org/2024-08-02/tropical-disturbance-expected-to-strengthen-drench-floridas-gulf-coast", "domain": "wrkf.org", "domain_classification": "Unknown", "message": "The National Hurricane Center is closely monitoring a tropical disturbance moving toward the Gulf of Mexico and Florida's Gulf Coast.\nIt poses no immediate threat to Louisiana, but much of Florida is in the \"cone of uncertainty\" for the system, which could strengthen into a tropical depression on Saturday, and a tropical storm on Saturday night.\nThe system is forecast to move over the island country Friday, cross the Straits of Florida on Saturday and be near or over Florida's Gulf Coast by Saturday night.\nParts of Florida's southwest coast remain under a tropical storm warning.\nA tropical storm watch is in effect for the Keys and other parts of the Gulf Coast.", "location": "Florida's Gulf Coast", "classification": "natural-disasters", "score": 0.8615655415379064, "event_breakdown": "National Hurricane Center monitoring tropical disturbance heading toward Gulf of Mexico and Florida's Gulf Coast; tropical storm watch in effect for Keys and other parts of Gulf Coast."}, {"id": "33fa45c0-7559-4868-9885-9987b5c6c807", "title": "Light earthquake : M4 . 5 quake has struck near Banda Sea", "date": "2024-08-02 19:30", "url": "https://www.earthquakenewstoday.com/2024/08/02/light-earthquake-m4-5-quake-has-struck-near-banda-sea-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes Banda Sea (0 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, 129.3886° East, -6.9858° South, depth 123.799 km.\nThe earthquake was roughly at a depth of 123.799 km (77 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Banda Sea.", "location": ")\nBanda Sea", "classification": "natural-disasters", "score": 0.9726080915434147, "event_breakdown": "A light earthquake magnitude 4.5 (ml/mb) strikes Banda Sea (0 miles) on Friday. Exact location of earthquake, 129.3886° East, -6.9858° South, depth 123.799 km. Event id: us7000djn3. Ids that are associated to the earthquake: us7000djn3. The earthquake occurred at a depth of 123.799 km (77 miles). The temblor was picked up at 12:16:36 / 12:16 pm (local time epicenter). A tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist)."}, {"id": "de26292a-20ee-46de-b1be-5a86e4294ce7", "title": "Tropical system could travel north to Carolina coasts after hitting Florida", "date": "2024-08-02 19:00", "url": "https://www.yahoo.com/news/tropical-system-could-travel-north-171355513.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On Thursday, Florida Governor Ron DeSantis issued a state of emergency for counties that could potentially be affected.\nThe National Hurricane Center is keeping a close eye on the storm as it could become Tropical Storm Debby by Saturday night.\nIt’s expected to travel along the west coast of Florida before making landfall at Florida’s Big Bend with winds of roughly 65 mph.\nAccording to the NHC, it is possible that the storm could hit northeast Florida before traveling up the coasts of South Carolina and North Carolina.\nThe storm could potentially hit Wilmington, N.C. Wednesday morning with winds of 60 mph.", "location": "Florida", "classification": "natural-disasters", "score": 0.939041964645198, "event_breakdown": "Tropical Storm Debby has formed in the Atlantic and is expected to hit the coast of Florida before heading up the east coast of the United States."}, {"id": "7e434642-7d45-44af-935f-511bba1017b6", "title": "Tropics Watch : System Forming North Of Cuba", "date": "2024-08-02 15:15", "url": "https://www.fitsnews.com/2024/08/02/tropics-watch-system-forming-north-of-cuba/", "domain": "fitsnews.com", "domain_classification": "Unknown", "message": "As of 8:00 a.m. EDT on Friday (August 2, 2024), Invest 97L had a 60 percent chance of developing into a tropical storm over the next 48 hours – and a 90 percent of developing into a tropical storm over the next seven days.\nBut residents of the Palmetto State should also be mindful of the potential boomerang effect associated with this system.\n“Tropical storm watches or warnings could be required for portions of Florida later today,” the forecast added.\nHow, exactly, does water temperature in the Pacific impact storms in the Atlantic tropical basin?\nOver that time, a whopping 1,500 tropical storms and 900 hurricanes have been observed.", "location": "Florida in the United States is the main location where the event takes place.", "classification": "natural-disasters", "score": 0.8391562823897449, "event_breakdown": "Hurricane Douglas is currently churning towards Hawaii and is expected to make landfall on Sunday carrying winds of up to 90 miles per hour."}, {"id": "1cd7681c-80a8-4ee6-8afd-2c97946695fe", "title": "Tropical Storm Debby Expected In Southeastern Gulf By Saturday | WJBO Newsradio 1150 AM & 98 . 7 FM", "date": "2024-08-02 16:00", "url": "https://wjbo.iheart.com/content/2024-08-02-tropical-storm-debby-expected-in-southeastern-gulf-by-saturday/", "domain": "wjbo.iheart.com", "domain_classification": "Unknown", "message": "The National Hurricane Center started advisories on Potential Tropical Cyclone Four ahead of an expected Tropical Storm Debby in the southeastern Gulf of Mexico by tomorrow.\nTropical storm watches and warnings are in place along the coast of Florida ahead of the system, which was located over eastern Cuba Friday morning\"A turn toward the northwest at a slower forward speed is expected tonight or Saturday, followed by a turn toward the north on Sunday.\nOn the forecast track, the disturbance is expected to move over Cuba today, cross the Straits of Florida on Saturday, and then move near or over the west coast of Florida Saturday night through Sunday night,\" said NHC Senior Hurricane Specialist Dr. Jack Beven.\n\"The disturbance is expected to develop into a tropical depression on Saturday as it moves across the Straits of Florida, followed by intensification into a tropical storm by Saturday night,\" Beven continued.\nThere are no direct local impacts to Louisiana expected at this time.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8447619041592762, "event_breakdown": "Potential Tropical Cyclone Four, expected to become Tropical Storm Debby in the southeastern Gulf of Mexico by tomorrow."}, {"id": "5b724645-c270-4985-b0ee-c043927a758c", "title": "Florida braces for tropical storm expected to hit Gulf Coast", "date": "2024-08-02 19:30", "url": "https://www.marketscreener.com/news/latest/Florida-braces-for-tropical-storm-expected-to-hit-Gulf-Coast-47547564/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "(Reuters) - A tropical storm is expected to form off Florida this weekend after a disorganized weather system crosses Cuba, bringing howling winds, torrential rain and ocean surges to the Keys and the state's Gulf Coast, forecasters said on Friday.\n\"We are anticipating it to turn into a tropical storm over the weekend.\nIf the storm swells into a tropical storm - with winds between 39 mph and 73 mph - it will take the name Debby.\nRegardless of whether the current system strengthens into a tropical storm, Rome emphasized that it will bring as much as a foot of rain to parts of Florida.\nTropical storm watches and warnings have already been issued for the Florida Keys and the Gulf Coast.", "location": "MAIN LOCATION: FLORIDA", "classification": "natural-disasters", "score": 0.949301855345008, "event_breakdown": "Tropical Storm Debby - currently crossing Cuba - is expected to form off Florida this weekend, bringing howling winds, torrential rain and ocean surges to the Keys and Gulf Coast."}, {"id": "ce42070e-7f0a-41f8-a1d0-8797f7760c35", "title": "What can Florida expect as tropical system nears ? Here risk for storm surge , flooding", "date": "2024-08-02 17:45", "url": "https://www.yahoo.com/news/florida-expect-tropical-system-nears-165026747.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A potential tropical storm is heading toward Florida, with the forecast calling for heavy rain, gusty winds and a risk of flash flooding and storm surge.\nSo, how much rain, storm surge and flash flood could this storm bring?\nStorm surge is one of the most dangerous parts of a storm.\nThere is no storm surge risk for Florida’s east coast, as of the morning forecast.\nTake a look at what the peak storm surge for your area could be:The National Hurricane Center on Friday said it expects Florida’s west coast could see up to 3 feet of storm surge.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9715860783327175, "event_breakdown": "Potential Tropical Storm forming near Bahamas, heading towards Florida. Heavy Rain, Wind, Flash Flooding & Storm Surge expected. 3 feet of Storm Surge possible on west coast."}, {"id": "3bbee2a7-c43c-418a-9f1d-b4eea87248ac", "title": "Light earthquake : M4 . 3 quake has struck near Sarangani in Philippines", "date": "2024-08-02 19:30", "url": "https://www.earthquakenewstoday.com/2024/08/02/light-earthquake-m4-3-quake-has-struck-near-sarangani-in-philippines-13/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Thursday, 54 kilometers (34 miles) from Sarangani in Philippines.\nThe earthquake occurred at a depth of 94.34 km (59 miles) below the earth’s surface.\nNearby country/countries, Philippines (c. 99 900 000 pop) (That might be effected).\nEpicenter of the event was 90 km (56 miles) from Caburan (c. 12 600 pop), 55 km (34 miles) from Sarangani (c. 7 500 pop), 91 km (57 miles) from Pangyan (c. 5 300 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 54 km ESE of Sarangani, Philippines.", "location": "Sarangani", "classification": "natural-disasters", "score": 0.735277121273047, "event_breakdown": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 54 kilometers (34 miles) from Sarangani in Philippines. The earthquake occurred at a depth of 94.34 km (59 miles) below the earth’s surface. Nearby country/countries, Philippines (c. 99 900 000 pop) (That might be effected). Epicenter of the event was 90 km (56 miles) from Caburan (c. 12 600 pop), 55 km (34 miles) from Sarangani (c. 7 500 pop), 91 km (57 miles) from Pangyan (c. 5 300 pop)."}, {"id": "fce95b9f-6d01-4cd5-83fb-db09705d5771", "title": "South Florida Prepares for Flooding from Potential Tropical Storm Debby", "date": "2024-08-02 18:30", "url": "https://sunny985.iheart.com/content/2024-08-02-south-florida-prepares-for-flooding-from-potential-tropical-storm-debby/", "domain": "sunny985.iheart.com", "domain_classification": "Unknown", "message": "South Florida officials are preparing for a system expected to develop into Tropical Storm Debby to dump heavy rain and cause flash flooding as early as tonight.\nLisa Spadafina heads the Miami-Dade Division of Environmental Resources Management (DERM) says, \"The pumps are functional, storm drains are clear, and the canal system waters are lowered.\"\nStill Miami Dade and Broward officials are warning residents to prepare for 1-5 inches of rainfall by managing their property and hardening their homes.\nMayor Trantalis says it is difficult to predict where the flooding will occur, but this system may slow down or stall which could lead to flash flooding.\nIn any case, he says the city has contracted with pump providers and lowered the water level in canals in preparation for whatever Mother Nature brings.", "location": "South Florida", "classification": "natural-disasters", "score": 0.9647181196949887, "event_breakdown": "Tropical Storm Debby is set to strike South Florida, with heavy rain and flash flooding expected by this evening. Mayor Steve trantalis City of FORT lauderdale has announced that pumps are in place and water levels in the canals are lowered in preparation for the storm."}, {"id": "3091fe40-cb39-4902-862c-a5f035dfe1e3", "title": "South Florida Prepares for Flooding from Potential Tropical Storm Debby", "date": "2024-08-02 17:45", "url": "https://us1035.iheart.com/content/2024-08-02-south-florida-prepares-for-flooding-from-potential-tropical-storm-debby/", "domain": "us1035.iheart.com", "domain_classification": "Unknown", "message": "South Florida officials are preparing for a system expected to develop into Tropical Storm Debby to dump heavy rain and cause flash flooding as early as tonight.\nLisa Spadafina heads the Miami-Dade Division of Environmental Resources Management (DERM) says, \"The pumps are functional, storm drains are clear, and the canal system waters are lowered.\"\nStill Miami Dade and Broward officials are warning residents to prepare for 1-5 inches of rainfall by managing their property and hardening their homes.\nMayor Trantalis says it is difficult to predict where the flooding will occur, but this system may slow down or stall which could lead to flash flooding.\nIn any case, he says the city has contracted with pump providers and lowered the water level in canals in preparation for whatever Mother Nature brings.", "location": "Based on the context provided, I could not identify a specific location for the main event.", "classification": "natural-disasters", "score": 0.9647181196949887, "event_breakdown": "Tropical Storm Debby expected to develop into Tropical Storm Debby and dump heavy rain and cause flash flooding in Miami-Dade and Broward Counties as early as tonight."}, {"id": "61f60495-d9f3-4c49-ba94-8162f07f5cdf", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 16:00", "url": "https://wcvu.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "wcvu.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is currently about 90 miles east-southeast of Cozumel, Mexico. It is moving toward the west near 12 mph.  Maximum sustained winds near the center are 35 mph, with some higher gusts. Strengthening is expected, and the system could be near hurricane strength when it reaches the Yucatan Peninsula late Friday or Friday night. The storm will then move into the southern Gulf of Mexico and is expected to approach the United States by Saturday night. Here is the latest from the NHC."}, {"id": "f48ca2b5-e0fb-44c3-bc1b-a275fbcc28f4", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 16:00", "url": "https://foxsports940.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "foxsports940.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Natural-disasters reported in text that can be placed on a map include:\nFlorida bracing for impacts from Potential Cyclone Four"}, {"id": "843970c5-49a6-4bbb-bf12-e869acc3376a", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 16:15", "url": "https://953wdae.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "953wdae.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Florida is bracing for Potential Cyclone Four. The National Hurricane Center has issued a Tropical Storm Warning for the southwest coast of Florida, from East Cape Sable to Bonita Beach, and a Tropical Storm Watch for the Florida Keys, the southern coast of the peninsula, and the west coast of the peninsula."}, {"id": "474b2570-2410-41e0-91fc-cbeed438ba29", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 16:45", "url": "https://mykiss951.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "mykiss951.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is currently located over the eastern Gulf of Mexico, and is expected to make landfall in the Florida Panhandle on Saturday. The system is currently classified as a Potential Tropical Cyclone, but it is expected to become Tropical Storm Claudette later today.\n\nAs of now, the Sunshine State is bracing for impacts from Potential Cyclone Four. The National Hurricane Center's 11am advisory states:\n\n\"A Tropical Storm Warning is in effect for...\n\n* Southwest coast of the Florida peninsula from East Cape Sable to Bonita Beach\n\nA Tropical Storm Watch is in effect for...\n\n* The Florida Keys south of the Card Sound Bridge including the Dry Tortugas\n* The southern coast of the Florida peninsula east of East Cape Sable to the Card Sound Bridge\n* The west coast of the Florida peninsula north of Bonita Beach to Aripeka\nA Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor the progress of this system.\nAdditional warnings and watches may be required for a portion of this area tonight and Saturday."}, {"id": "31b23dc0-f601-4e7f-86b5-f8e8da9f41b5", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 15:45", "url": "https://x1015.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "x1015.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Based on the provided information, I was unable to determine a specific location for the event.", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Impacts-\nKey Largo is taking preventative measures for the oncoming storm.\nFlorida has prepared for a multimillion dollar repair project in the aftermath of Hurricane Irma."}, {"id": "6eec8e27-3936-4ded-86cd-d30ce3a5571f", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four | XL1067", "date": "2024-08-02 15:45", "url": "https://xl1067.iheart.com/featured/florida-news/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "xl1067.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": ".\nBased on the information in the text, the main location where the main event takes place is southwest coast of Florida.", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four in Florida"}, {"id": "8e6c7c42-3b57-4bbd-b0f0-819797df962f", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 18:30", "url": "https://1230thegambler.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "1230thegambler.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is currently located over the eastern Gulf of Mexico, and is expected to bring heavy rain and strong winds to southwest Florida on Saturday."}, {"id": "a3b7ae29-664f-4de9-b46b-d12e3bdd96f5", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 17:30", "url": "https://wccfradio.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "wccfradio.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is currently located south of Cuba and is forecast to move northward into the Florida peninsula. A Tropical Storm Warning is in effect for southwest Florida and a Tropical Storm Watch is in effect for the Florida Keys and southern Florida. Wind speeds of up to 40 mph are possible, along with heavy rainfall and the potential for flooding, according to the National Hurricane Center."}, {"id": "072a1f1a-44f2-468b-81e4-3ca5872aaca2", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 17:45", "url": "https://thebeatflorida.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "thebeatflorida.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is currently near 24.2N 83.5W. It has maximum sustained winds of 35mph. According to the latest update from the NHC, Potential Cyclone Four will move over the southeastern Gulf of Mexico today, then across the northwestern Bahamas Friday night and Saturday. It will near the north coast of Cuba Saturday night and Sunday as a tropical storm, and is expected to impact parts of Florida this weekend.Residents of the areas mentioned above should closely monitor the progress of Potential Cyclone Four and follow the guidelines of local authorities."}, {"id": "3cf79797-512b-4be1-bed6-4d798d087ef0", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 18:45", "url": "https://1055online.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "1055online.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four in the Sunshine State"}, {"id": "c642cd3a-2f91-408c-abb0-1ec34e6905e9", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 19:30", "url": "https://tampabaysmix.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "tampabaysmix.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Florida is bracing for impacts from Potential Cyclone Four."}, {"id": "35593f39-011c-4cbe-92aa-9a10e9a12f36", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 19:30", "url": "https://y100.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "y100.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "The main event is in the Florida peninsula.", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four is set to bring impacts to southwest Florida, while a Tropical Storm Watch has been issued for the Florida Keys."}, {"id": "cbd0551d-0adb-4060-9e8f-13de19b092f3", "title": "Watches & Warnings Issued For Potential Tropical Cyclone Four", "date": "2024-08-02 19:30", "url": "https://925wpap.iheart.com/content/2024-08-02-watches-warnings-issued-for-potential-tropical-cyclone-four/", "domain": "925wpap.iheart.com", "domain_classification": "Unknown", "message": "The Sunshine State is bracing for impacts from Potential Cyclone Four.\nThe National Hurricane Center's 11am advisory states:A Tropical Storm Warning is in effect for...* Southwest coast of the Florida peninsula from East Cape Sable toBonita BeachA Tropical Storm Watch is in effect for...* The Florida Keys south of the Card Sound Bridge including the DryTortugas* The southern coast of the Florida peninsula east of East CapeSable to the Card Sound Bridge* The west coast of the Florida peninsula north of Bonita Beach toAripekaA Tropical Storm Warning means that tropical storm conditions areexpected somewhere within the warning area within 36 hours.\nA Tropical Storm Watch means that tropical storm conditions arepossible within the watch area, generally within 48 hours.\nInterests elsewhere in the Florida Peninsula should monitor theprogress of this system.\nAdditional warnings and watches may berequired for a portion of this area tonight and Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.951996772905527, "event_breakdown": "Potential Cyclone Four heading towards Florida"}, {"id": "3e2d2cf7-1fdd-4520-930f-744b712fcf55", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm | Magic 107 . 7", "date": "2024-08-02 13:45", "url": "https://magic107.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "magic107.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "The eastern Gulf Coast of the United States", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Tropical Storm Debby - Debby has intensified into a tropical storm. It is expected to head to the eastern Gulf Coast. Hurricane center is monitoring the system closely. The storm is expected to bring strong winds, heavy rain and storm surge to Florida and Louisiana state. (Current Location : Puerto Rico)"}, {"id": "91da0d97-d970-4ab4-8472-c7d980fd37f0", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 13:45", "url": "https://sunny985.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "sunny985.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Tropical Storm Debby\nThe National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby. Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend. Accuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready. Tropical storm watches or warnings could be required for portions of Florida later today. The wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday."}, {"id": "eb721005-3cbd-40f5-85bc-87662aa1a722", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 16:00", "url": "https://wcvu.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "wcvu.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "1. National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\n2. Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands.\n3. The system could threaten the U.S. mainland as early as this weekend.\n4. Accuweather is warning coastal residents from Florida to Louisiana to be ready.\n5. Tropical storm watches or warnings could be required for portions of Florida later today.\n6. Wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday."}, {"id": "c048911a-1db8-43e5-ab56-403086b9b24b", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 14:45", "url": "https://tampabaysmix.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "tampabaysmix.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "1) (Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\n2) Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\n3) Accuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\n4) Tropical storm watches or warnings could be required for portions of Florida later today.\n5) The wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday."}, {"id": "b730cc0b-1318-4ec5-bc57-03ebbc35a1e3", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm | 96 . 3 | 102 . 5 NewsRadio WFLA", "date": "2024-08-02 14:45", "url": "https://wflapanamacity.iheart.com/featured/florida-news/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "wflapanamacity.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "National Hurricane Center is keeping an eye on a potential storm in the Caribbean within the next four days. Models have varied wildly on when the system will near the Gulf Stream and take it west or by central Florida and out into the Atlantic before getting close to Hudson Bay. Potential for heavy rain and wind with the storm. National Hurricane Center is keeping an eye on a potential storm in the Caribbean within the next four days. Models have varied wildly on when the system will near the Gulf Stream and take it west or by central Florida and out into the Atlantic before getting close to Hudson Bay. Potential for heavy rain and wind with the storm."}, {"id": "2bd49180-0ac2-4216-9715-392e42f2f598", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 15:45", "url": "https://literock993.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "literock993.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby. Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend. Tropical storm watches or warnings could be required for portions of Florida later today."}, {"id": "f073d433-34aa-4d1e-a191-8add08c89d95", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 15:15", "url": "https://945rocks.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "945rocks.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": ")\nFlorida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "Tropical Storm Debby in the Eastern Gulf Coast\nTropical Storm (TS) Debby is brewing in the southern Gulf of Mexico and is on track to make landfall in Manatee County, Florida, later today. It will also bring heavy rain and strong winds to the west coast of Florida."}, {"id": "1b3b00a0-bd67-4a68-93cc-5406f3a10bde", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 15:30", "url": "https://v1015.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "v1015.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "1. National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby\n2. Forecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands\n3. Forecasters warn the storm could threaten the U.S. mainland as early as this weekend"}, {"id": "1102a07e-841f-4303-87c2-6b93957b6641", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 14:30", "url": "https://beat1053.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "beat1053.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "Florida", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "In addition to the target event, provide 3 other examples of current natural disasters from the news that can be placed on a map, formatted as short reports in English.\nTropical Storm Fred is revving up in the Atlantic and could threaten Florida as soon as this weekend. Fred became the season's sixth named storm on Tuesday. Forecasters at the National Hurricane Center in Miami say the storm is sitting just west of the Cape Verde Islands, off Africa's west coast. It could approach the U.S. coast as a minimal hurricane by next week. A hurricane warning has been issued for parts of the Leeward Islands."}, {"id": "f50da5a1-bff3-4144-876a-b704a0aa3cfa", "title": "Forecasters Warn Invest 97L Could Develop into Tropical Storm", "date": "2024-08-02 14:45", "url": "https://925wpap.iheart.com/content/2024-08-02-forecasters-warn-invest97-could-develop-into-tropical-storm/", "domain": "925wpap.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby.\nForecasters say the system is currently producing thunderstorms over Puerto Rico and the Virgin Islands, and could threaten the U.S. mainland as early as this weekend.\nAccuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready.\nTropical storm watches or warnings could be required for portions of Florida later today.\nThe wave is expected to move near or over Cuba throughout the day and then emerge over the Straits of Florida tonight or Saturday.", "location": "The eastern Gulf Coast, specifically Florida.", "classification": "natural-disasters", "score": 0.9411537849471224, "event_breakdown": "National Hurricane Center is keeping an eye on a storm system in the Atlantic that could develop into Tropical Storm Debby. Accuweather says the storm is headed for the eastern Gulf Coast, and is warning coastal residents from Florida to Louisiana to be ready."}, {"id": "ddc3e30b-f162-4cf6-bf30-8249f751e18e", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:30", "url": "https://koacolorado.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "koacolorado.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida braces for the arrival of Tropical Storm Debby."}, {"id": "7b24766b-b1b4-4412-8813-0aacbb24f061", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:15", "url": "https://newstalk1230.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "newstalk1230.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Tropical Storm Debby is currently forecasted to make landfall in Florida this weekend."}, {"id": "80dcf7c9-883f-4134-b276-df91be640a73", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://790waeb.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "790waeb.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida\nTropical Storm Debby is expected to bring torrential rain and gusty winds this weekend. The National Hurricane Center has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys."}, {"id": "a2bdfccb-3ed8-4e7d-978c-7b6326e1ae79", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://590kqnt.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "590kqnt.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida is preparing for the arrival of Tropical Storm Debby, which is set to hit the state this weekend. The National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys. The warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours."}, {"id": "24136679-1576-4ff0-a484-9877cfce46db", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://khvhradio.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "khvhradio.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida preparing for Tropical Storm Debby\nThe Bahamas preparing for Hurricane Beryl"}, {"id": "828713e3-d776-41be-9d2f-8fe8191cc2af", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://1430kasi.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "1430kasi.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Tropical Depression Four is expected to develop into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night."}, {"id": "c1eb689c-b7fb-4242-ab3e-9a91c27d36fb", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://kwhn.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "kwhn.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida, United States - Tropical Storm Debby\nThe NHC is forecasting that Tropical Storm Debby will be making landfall in Florida over the weekend, with potential impacts on the state's eastern portion and the Florida Keys.\nThe tropical storm warning and watch for this area indicates that tropical storm conditions are expected within 36 and 48 hours, respectively."}, {"id": "43baea7e-20f1-4bf4-b965-e78f5d222488", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 18:45", "url": "https://newsradio1290wtks.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "newsradio1290wtks.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida preparing for Tropical Storm Debby\nIn late May 2021, the state of Florida in the United States is preparing for the potential landfall of Tropical Storm Debby, predicted by weather forecasters to bring intense winds and torrential rainfall over the course of the weekend. The National Hurricane Center (NHC) has issued a tropical storm warning for parts of south Florida, spanning from East Cape Sable to Bonita Beach, and parts of the Florida Keys, indicating the potential to come under the weather phenomenon, amidst a weather system brewing offshore and seemingly on track for further intensification."}, {"id": "22e42509-ba2a-4d74-b07b-f7433bfd92c2", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 19:00", "url": "https://1190kex.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": ".\nFlorida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend. The National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys. The warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours. The system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night. The storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water."}, {"id": "eb5db1b7-6a6c-49b3-a141-c2110eb27a5b", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains | NewsRadio WKCY", "date": "2024-08-02 19:00", "url": "https://newsradiowkcy.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Tropical Storm Debby is expected to make landfall in Florida this weekend, bringing torrential rain and gusty winds. The National Hurricane Center has issued warnings and watches for parts of the state."}, {"id": "6ff94d69-9205-4e8a-be07-3711296005df", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 19:30", "url": "https://1450wkip.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "1450wkip.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida is preparing for the arrival of Tropical Storm Debby this weekend."}, {"id": "9ce9803a-dffb-44db-b0ec-d8c885c246e7", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 19:30", "url": "https://whoradio.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "whoradio.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend. The warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours."}, {"id": "fbf3cea9-14dd-4325-91ec-6b1a29919a2b", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 19:30", "url": "https://wham1180.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "wham1180.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Florida, United States - Tropical Storm Debby is forecast to bring torrential rain and gusty winds this weekend. The National Hurricane Center has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys."}, {"id": "55708701-d89e-427b-aeb5-5beb1d0a3cf8", "title": "Tropical Storm Debby Forecast To Drench Florida With Torrential Rains", "date": "2024-08-02 19:30", "url": "https://wtkg.iheart.com/content/2024-08-02-tropical-storm-debby-forecast-to-drench-florida-with-torrential-rains/", "domain": "wtkg.iheart.com", "domain_classification": "Unknown", "message": "Florida is preparing for the arrival of Tropical Storm Debby, which is forecasted to bring torrential rain and gusty winds this weekend.\nThe National Hurricane Center (NHC) has issued tropical storm warnings and watches for parts of the state, from East Cape Sable to Bonita Beach, and parts of the Florida Keys.\nThe warning indicates that tropical storm conditions are expected within 36 hours, while the watch means these conditions are possible within 48 hours.\nThe system, currently designated as Potential Tropical Cyclone Four, is expected to develop into Tropical Depression Four by Saturday morning and then into Tropical Storm Debby before making landfall in Florida on Sunday or Sunday night.\nThe storm is then forecasted to track near the Southeast coast early next week, where it could intensify again if it remains over water.", "location": "Florida.", "classification": "natural-disasters", "score": 0.9638763465603187, "event_breakdown": "Tropical Storm Debby: As of 8 a.m. Friday (July 28) Tropical Storm Debby has formed about 230 miles south of the mouth of the Mississippi River. The storm is expected to move toward the north-northwest at 5 to 10 mph during the next couple of days. Maximum sustained winds are 40 mph with higher gusts. Strengthening is forecast, and Debby could become a hurricane by Sunday. Tropical storm-force winds extend outward up to 70 miles mainly to the east of the center, NHC notes. A portion of the northern Gulf of Mexico could see winds of tropical storm force, The Weather Channel says."}, {"id": "ebeb3296-de16-4077-90f3-c9fc43a53cec", "title": "Tropical system could bring heavy rain to the Charleston area", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/tropical-system-could-bring-heavy-123852240.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. (WCBD) – A tropical wave moving across Cuba is forecast to develop as it enters the Gulf of Mexico and nears the Florida west coast over the weekend.\nComputer models show the system moving across Florida and out into the Atlantic just off the Georgia and South Carolina coasts by late Monday afternoon.\n“Thankfully, most of it – the heaviest rain – will be out over the Gulf Stream and up into eastern North Carolina.\nDown into the Lowcountry, we’re going to have moderate to heavy rain but not the worst of it,” said Storm Team 2 Meteorologist Josh Marthers.\nFarther west means more rain and impacts, farther east means less rain and impacts,” Marthers said.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8497745489304668, "event_breakdown": "Here are the relevant current events of natural-disasters reported in text that can be placed on a map:\n1. Tropical Wave moving across Cuba forecast to develop.\n2. Heavy snow forecast for the northeastern U.S."}, {"id": "8d110d37-ca70-497c-9c7d-f23d477781fc", "title": "Cape Coral handyman gets months in jail after changing plea in Hurricane Ian fraud case", "date": "2024-08-02 13:45", "url": "https://www.yahoo.com/news/cape-coral-handyman-gets-months-124134198.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Cape Coral handyman gets months in jail after changing plea in Hurricane Ian fraud caseThe city of Cape Coral showed major signs of damage after strong winds and flood waters as a result of Hurricane Ian impacted areas of the city on Thursday September 29, 2022.\nThis week, Aug. 1, 2024, a handyman who attempted to commit fraud in collecting money from residents to repair homes was sentenced to 9 months in jail.\nA Cape Coral handyman accused of failing to complete work he was paid for after Hurricane Ian learned his fate this week after he changed his plea last month.\nHurricane Ian struck Southwest Florida as a Category 5 storm on Sept. 28, 2022, particularly devastating Cape Coral, Fort Myers Beach and Sanibel and Pine islands.\nThis article originally appeared on Naples Daily News: Cape Coral handyman sentenced to jail for Hurricane Ian fraud", "location": "Cape Coral.", "classification": "natural-disasters", "score": 0.9274958408137326, "event_breakdown": "Cape Coral handyman sentenced to jail for Hurricane Ian fraud"}, {"id": "6eea4335-2529-4714-b818-ecc07c5f99e5", "title": "First Alert Forecast : Toasty end to the week ; remaining hot after", "date": "2024-08-02 12:45", "url": "https://www.wect.com/2024/08/02/first-alert-forecast-toasty-end-week-remaining-hot-after/", "domain": "wect.com", "domain_classification": "Unknown", "message": "WILMINGTON, N.C. (WECT) - Your First Alert Forecast closes this Friday with a few roaming clouds and isolated storms, while lows will cool into the 70s.\nChances for rain & storms will trend higher early in the new week.\nFor now, your First Alert Weather Team is watching for potential impacts in the Cape Fear.\nStay plugged into your First Alert Forecast over the weekend as the forecast becomes more clear.\nView your seven-day forecast: http://webpubcontent.gray.tv/wect/MAXSevendayWECT.jpgOr, extend your outlook with a ten-day forecast on your WECT Weather App.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.5379060601398544, "event_breakdown": "WILMINGTON, N.C. (WECT) - The Cape Fear region is tracking an evolving wave of low pressure plus tropical moisture, which has the possibility to spawn a named \"tropical\" system soon. While some forecast guidance suggests a slight chance that this system could \"recurve\" to the northeast and stay well east of the Carolina coast, the more reliable guidance, suggests a west-northwestward track in the morning hours of Tuesday.\nThis low will have plenty of energy to exacerbate the pattern ahead, with rainy and stormy conditions expected during peak heating of the day. This could lead to a cluster of strong to severe storms eventually...especially near and south of the Cape Fear River.\nNews Channel 6 is tracking a disturbance with a northward track for Monday night through early Tuesday. This possible tropical system could spawn a system in the warm water with a channel of moisture. The cone of uncertainty suggests that this system could be anywhere along the North Carolina coast. The cone will morph as information continues to come in."}, {"id": "68537cbf-f23c-448a-9319-f120293d526c", "title": "Tropical storm watches and warnings issued Friday , what about the Treasure Coast ? ", "date": "2024-08-02 18:45", "url": "https://www.yahoo.com/news/tropical-storm-watches-warnings-issued-173230860.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Heavy rainfall starting Saturday is the most likely impact to the Treasure Coast from a weather disturbance that triggered tropical storm watches and warnings Friday for portions of Florida’s West Coast, according to the National Hurricane Center in Miami.\nIf sustained winds reach 39 mph, it would become Tropical Storm Debby, the fourth named storm of the 2024 Atlantic hurricane season.\n“We're forecasting it to become a tropical storm in 36 hours … sometime during the afternoon or evening on Saturday,” he said.\nIf not, become a subscriber to get the latest local news on the Treasure Coast.\nThis article originally appeared on Treasure Coast Newspapers: If a tropical storm develops, will it impact the Treasure Coast?", "location": "Florida.", "classification": "natural-disasters", "score": 0.9606910514846776, "event_breakdown": "Heavy rainfall starting Saturday is the most likely impact to the Treasure Coast from a weather disturbance that triggered tropical storm watches and warnings Friday for portions of Florida's West Coast, according to the National Hurricane Center in Miami."}, {"id": "8db30c9a-4d9c-4892-9e96-a16d96bfe5cf", "title": "Potential cyclone 4 headed toward SW FL . Will be here Saturday", "date": "2024-08-02 17:00", "url": "https://www.yahoo.com/news/potential-cyclone-4-headed-toward-155602090.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical storm warning has been issued for Southwest Florida, and heavy rains will drop six to eight inches of rain between Saturday and Wednesday.\nA tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nA watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nPotential cyclone heading to Southwest FloridaBefore it's called a depression, it's referred to as a potential cyclone, as it was during the 11 a.m. Friday update.\nAnd Sunday it will be parallel to the coast between Fort Myers and Tampa.", "location": "Southwest Florida", "classification": "natural-disasters", "score": 0.9351065800755659, "event_breakdown": "Tropical Storm Alex is currently in the Gulf of Mexico and is forecast to make landfall along the Southwest Florida coast on Sunday. Flash flooding and damaging winds are expected throughout the region."}, {"id": "e1d69a37-3ddc-4f16-9d88-2b256b9024bc", "title": "Track shows tropical disturbance could impact Central Florida this weekend", "date": "2024-08-02 11:15", "url": "https://www.yahoo.com/news/track-shows-tropical-disturbance-could-100600860.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "2:45 p.m. updateGovernments in Central Florida are helping residents prepare for impacts from Potential Tropical Cyclone 4.\nThe National Hurricane Center is now tracking the tropical disturbance as “Potential Tropical Cyclone Four.”Photos: Track shows tropical disturbance could impact Central Florida this weekendPTC4 is not organized yet but has a more defined tracking path.\nCentral Florida will likely see tropical storm conditions throughout Sunday as the storm moves through the eastern Gulf of Mexico.\nRead: See where you can get sandbags in Central FloridaEither way, Central Florida will likely see tropical storm conditions.\nWe will have some rain bands working in Sunday morning, with heavier rain bands Sunday afternoon and Sunday night.", "location": "Central Florida", "classification": "natural-disasters", "score": 0.9433042933502843, "event_breakdown": "Potential Tropical Cyclone 4 may impact Central Florida this weekend. Residents are preparing for tropical storm conditions."}, {"id": "69588b27-72eb-4d4b-85e8-bc7021fbb07b", "title": "Heavy rain , flooding in SC Midlands likely as tropical system develops . Here when and how bad", "date": "2024-08-02 15:15", "url": "https://www.yahoo.com/news/heavy-rain-flooding-sc-midlands-141024575.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical system to likely bring harsh weather to SC Midlands, NWS says.\nWhen, what to expectChances of heavy rain and flooding across the Midlands into next week are growing with the rising threat of a tropical system in the Gulf, weather experts warn.\nAccording to the National Weather Service in Columbia, there is 90% confidence that some sort of tropical system will form in the eastern Gulf of Mexico by early Sunday.\nThe interaction of the potential tropical system and a stalled storm front will yield high rain chances on Sunday, with flooding concerns from I-20 eastward.\nAn image that illustrates the development of a possible tropical system in the Gulf of Mexico.", "location": "COLUMBIA (SC)", "classification": "natural-disasters", "score": 0.9209210808164486, "event_breakdown": "Tropical system to likely bring harsh weather to South Carolina Midlands, NWS says\n\n* Tropical threat forming in the eastern Gulf of Mexico likely to impact South Carolina Midlands with 90% confidence.\n* Moderate to heavy rainfall on Sunday may increase flood concerns along I-20 eastwards.\n* Forecasters had anticipated potential for development of a tropical system in the east-central Gulf of Mexico by Sunday.\n* Interaction between potential tropical system and a stalled storm front likely to buildup rain chances Sunday.\n* National Weather Service is anticipating heavy rain and flooding across the Midlands into next week."}, {"id": "490f800c-df0e-4aac-9f31-dbc168681a50", "title": "Florida Gov . Ron DeSantis declares State of Emergency ahead of Gulf tropical system Invest 97L potential landfall", "date": "2024-08-02 19:00", "url": "https://www.mysuncoast.com/2024/08/01/florida-gov-desantis-declares-state-emergency-ahead-invest-97l-potential-landfall/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "TALLAHASSEE, Fla. (WCTV) - Florida Gov.\nRon DeSantis officially declared a State of Emergency Thursday afternoon as forecasters track a tropical disturbance heading toward Florida.\n“The incoming heavy rainfall, flooding, and gusty winds will cause widespread power outages due to downed trees and powerlines,” he wrote.\nThe executive order applies to all counties in North Florida and many western counties in Central and South Florida.\nSee the complete list of counties in the full executive order below:This is a developing story.", "location": "Florida", "classification": "natural-disasters", "score": 0.6294614732804673, "event_breakdown": "Tropical disturbance heading toward Florida \nRon DeSantis officially declares a State of Emergency for counties in North Florida and many western counties in Central and South Florida."}, {"id": "0a1e5b9a-8ce0-4af6-ad26-4e2900881de0", "title": "Tropical Threat in Gulf Elevated - What Louisiana Can Expect", "date": "2024-08-02 12:15", "url": "https://1079ishot.com/ixp/33/p/tropical-threat-in-gulf-elevated-what-louisiana-can-expect/", "domain": "1079ishot.com", "domain_classification": "Unknown", "message": "[Updated 10:02 a.m. CDT] The National Hurricane Center is now monitoring Potential Tropical Storm 4.\nTropical Storm Warnings have been posted for the Florida Keys and portions of the southern Florida Coast.\nNHC.noaa.gov NHC.noaa.gov loading...As of now the Hurricane Center forecast does not call for the storm system to reach hurricane strength.\nThe probability of a tropical depression or tropical storm forming today or Saturday is about 50%.\nThe next official update from the National Hurricane Center will come at 0700 CDT or sooner should conditions warrant.", "location": "Florida", "classification": "natural-disasters", "score": 0.9263119254218066, "event_breakdown": "Potential Tropical Storm Four in the Gulf of Mexico."}, {"id": "0923d963-79d8-4f66-8cf1-29dff0b2f791", "title": "Tropical Threat in Gulf Elevated - What Louisiana Can Expect", "date": "2024-08-02 13:45", "url": "https://999ktdy.com/ixp/33/p/tropical-threat-in-gulf-elevated-what-louisiana-can-expect/", "domain": "999ktdy.com", "domain_classification": "Unknown", "message": "[Updated 10:02 a.m. CDT] The National Hurricane Center is now monitoring Potential Tropical Storm 4.\nTropical Storm Warnings have been posted for the Florida Keys and portions of the southern Florida Coast.\nNHC.noaa.gov NHC.noaa.gov loading...As of now the Hurricane Center forecast does not call for the storm system to reach hurricane strength.\nThe probability of a tropical depression or tropical storm forming today or Saturday is about 50%.\nThe next official update from the National Hurricane Center will come at 0700 CDT or sooner should conditions warrant.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9263119254218066, "event_breakdown": "The National Hurricane Center is now monitoring Potential Tropical Storm 4.\nAs of right now, the Hurricane Center forecast does not call for the storm system to reach hurricane strength.\nThe probability of a tropical depression or tropical storm forming today or Saturday is about 50%.\nThe next official update from the National Hurricane Center will come at 7 a."}, {"id": "4de469f3-6455-4304-a76c-66ea27c62b42", "title": "Tropical Threat in Gulf Elevated - What Louisiana Can Expect", "date": "2024-08-02 10:45", "url": "https://talkradio960.com/ixp/33/p/tropical-threat-in-gulf-elevated-what-louisiana-can-expect/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "[Updated 10:02 a.m. CDT] The National Hurricane Center is now monitoring Potential Tropical Storm 4.\nTropical Storm Warnings have been posted for the Florida Keys and portions of the southern Florida Coast.\nNHC.noaa.gov NHC.noaa.gov loading...As of now the Hurricane Center forecast does not call for the storm system to reach hurricane strength.\nThe probability of a tropical depression or tropical storm forming today or Saturday is about 50%.\nThe next official update from the National Hurricane Center will come at 0700 CDT or sooner should conditions warrant.", "location": "Florida Keys", "classification": "natural-disasters", "score": 0.9263119254218066, "event_breakdown": "Potential Tropical Storm Four being monitored by the National Hurricane Center in the area of the Caribbean Sea. Tropical Storm Warnings have been issued for the Florida Keys and southern Florida coast, and the storm has a 50% probability of forming into a depression or storm later today or tomorrow. The next official update from National Hurricane Center will occur at 0700 CDT or sooner should conditions warrant."}, {"id": "1b255eab-2cb7-4f04-ba75-da6de5e568ab", "title": "Tropical Threat in Gulf Elevated - What Louisiana Can Expect", "date": "2024-08-02 14:00", "url": "https://965kvki.com/ixp/33/p/tropical-threat-in-gulf-elevated-what-louisiana-can-expect/", "domain": "965kvki.com", "domain_classification": "Unknown", "message": "[Updated 10:02 a.m. CDT] The National Hurricane Center is now monitoring Potential Tropical Storm 4.\nTropical Storm Warnings have been posted for the Florida Keys and portions of the southern Florida Coast.\nNHC.noaa.gov NHC.noaa.gov loading...As of now the Hurricane Center forecast does not call for the storm system to reach hurricane strength.\nThe probability of a tropical depression or tropical storm forming today or Saturday is about 50%.\nThe next official update from the National Hurricane Center will come at 0700 CDT or sooner should conditions warrant.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9263119254218066, "event_breakdown": "Potential Tropical Storm 4 in the Gulf of Mexico is being monitored by the National Hurricane Center. Tropical Storm Warnings have been posted for the Florida Keys and portions of the southern Florida Coast. The next official update from the National Hurricane Center will come at 0700 CDT or sooner should conditions warrant."}, {"id": "a6ee1d6b-e9b8-4d11-8a6d-178bcc98ddd1", "title": "Alabama Watches Closely for Potential Tropical Wave Development", "date": "2024-08-02 16:45", "url": "https://wtug.com/ixp/532/p/alabama-watches-closely-for-potential-tropical-wave-development/", "domain": "wtug.com", "domain_classification": "Unknown", "message": "The Townsquare Media Weather Center is closely monitoring the possible future development of the well-defined tropical wave known as Invest 97L.\nTropical storm watches or warnings could be required for portions of Florida later today.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, National Hurricane Center loading...What Does This Mean for Alabama and the CoastlineJames Spann, ABC 33/40 and Townsquare Media Tuscaloosa Chief Meteorologist, said, “The primary impact from this system will be southeast of Alabama and east of the Central Gulf Coast (Gulf Shores to Panama City Beach).\nHeat-Related Weather TerminologyHot Weather Safety TipsWHEW!\n: Counties With the Warmest Summers in Alabama Stacker compiled a list of the counties with the warmest summers in Alabama.", "location": ".)\nAlabama", "classification": "natural-disasters", "score": 0.9649808282033878, "event_breakdown": "Tropical Depression brings heavy rain and wind to Costa Rica and Nicaragua, causing flooding and landslides. 55 rescued after boat capsizes in Brazilian river. Lightning sparks a wildfire near Mishap, CA. At least 3 dead in Frankfurt, Germany shooting. Flash flood caused by cloud burst claims at least 21 lives near Indo-Nepal border."}]