[{"id": "822e9583-72ee-47e2-93da-badfc79de945", "title": "President Biden condemns antisemitism in Holocaust remembrance speech amid college protests and Gaza war", "date": "2024-05-07 11:30", "url": "https://abc11.com/president-biden-condemns-antisemitism-in-holocaust-remembrance-speech-amid-college-campus-protests-and-gaza-war/14778077/", "message": "LIVE: Biden condemns antisemitism in Holocaust remembrance amid college protests and Gaza warWATCH LIVE: Breaking news and other events from ABC Watch breaking news and other live events from ABC.\nWATCH LIVE: Breaking news and other events from ABC Watch breaking news and other live events from ABC.\nWATCH LIVE: Breaking news and other events from ABC Watch breaking news and other live events from ABC.\nJean-Pierre said Biden would speak to the \"horrors\" of the Hamas attack, and how antisemitism is on the rise globally and at home.\nBiden campaign spokesman James Singer said in response that \"President Biden stands against antisemitism and is committed to the safety of the Jewish community, and security of Israel - Donald Trump does not.\"", "location": "", "classification": "antisemitism", "score": 0.8508536518970051, "event_breakdown": ""}, {"id": "b11e311b-6225-4505-9e31-bcc0dad418b2", "title": "Biden to condemn current antisemitism in Holocaust remembrance amid college protests and Gaza war", "date": "2024-05-07 12:30", "url": "https://www.ksat.com/news/politics/2024/05/07/biden-to-condemn-current-antisemitism-in-holocaust-remembrance-amid-college-protests-and-gaza-war/", "message": "Never again.”Jean-Pierre said Biden would speak to the “horrors” of the Hamas attack, and how antisemitism is on the rise globally and at home.\nHolocaust Memorial Museum, will also feature remarks from House Speaker Mike Johnson and House Democratic Leader Hakeem Jeffries.\nAnd the State Department’s special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nHe heard students describe their own experiences with hatred, including threats of violence and hate speech, his office said.\nTrump’s campaign on Monday released a video on Yom Hashoah, Israel’s Holocaust remembrance day, that aimed to contrast the 2024 presidential candidates’ responses on antisemitism.", "location": "Holocaust Memorial Museum", "classification": "antisemitism", "score": 0.9579814661872019, "event_breakdown": ""}, {"id": "af2c5707-c5ef-4b9c-8601-be7009f92225", "title": "Biden to give remarks at US Holocaust Memorial Museum amid concerns of antisemitism", "date": "2024-05-07 15:00", "url": "https://cbs12.com/news/nation-world/president-joe-biden-to-give-remarks-at-us-holocaust-memorial-museum-amid-concerns-of-antisemitism-at-college-campuses-protests-threats-toward-jewish-students-pro-palestinian-protests-october-7-attack-israel-hamas-war", "message": "Jean-Pierre said Biden would speak to the \"horrors\" of the Hamas attack, and how antisemitism is on the rise globally and at home.\nHolocaust Memorial Museum, will also feature remarks from House Speaker Mike Johnson and House Democratic Leader Hakeem Jeffries.\nIn conjunction with Biden's speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nAnd the State Department's special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nBiden campaign spokesman James Singer said in response that \"President Biden stands against antisemitism and is committed to the safety of the Jewish community, and security of Israel — Donald Trump does not.\"", "location": "The main location where the main event takes place is not explicitly mentioned in the text. Therefore, the answer would be 'null'.", "classification": "antisemitism", "score": 0.902887957978181, "event_breakdown": "null"}, {"id": "ace7e6f8-88c9-4627-bce6-da3d49dbaf84", "title": "Biden to call for a fight against antisemitism at a precarious moment in Israel war in Gaza and amid protests on campus", "date": "2024-05-07 11:00", "url": "https://edition.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/", "message": "Washington CNN —President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism amid a precarious moment in Israel’s war against Hamas and as protests have swept American college campuses, laying bare Biden’s trouble with some young voters.\nBiden’s longtime and stalwart support for Israel has come under intense pressure as the humanitarian crisis in Gaza grows.\nThe protests are not expected to be a major part of the speech, the official added.\nHowever, Biden did not intend to use his speech on Tuesday to delve into Middle East policy or the current situation in Israel or Gaza.\nBiden worked with his core speech writing team and senior advisers on Tuesday’s speech, offering direct input and language as the draft has come together.", "location": "", "classification": "antisemitism", "score": 0.623846936266159, "event_breakdown": ""}, {"id": "f718276a-0397-444d-b223-3a9d8b3464a5", "title": "Biden to condemn current antisemitism in Holocaust remembrance amid college protests and Gaza war", "date": "2024-05-07 11:00", "url": "http://www.middletownpress.com/news/politics/article/biden-to-condemn-current-antisemitism-in-19443354.php", "message": "President Joe Biden arrives at Andrews Air Force Base, Md., from a weekend trip to his Delaware home, Monday, May 6, 2024.\nAdvertisement Article continues below this adThe Capitol event, hosted by the U.S.\nAdvertisement Article continues below this adThe Department of Homeland Security was moving to educate schools and community groups about resources and funding available to promote campus safety and address threats.\nAnd the State Department’s special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nTrump’s campaign on Monday released a video on Yom Hashoah, Israel’s Holocaust remembrance day, that aimed to contrast the 2024 presidential candidates’ responses on antisemitism.", "location": "Andrews Air Force Base, Md.", "classification": "antisemitism", "score": 0.7649558369435923, "event_breakdown": "1. President Joe Biden arrives at Andrews Air Force Base, Md., from a weekend trip to his Delaware home.\n   - Location: Andrews Air Force Base, Maryland, United States\n\n2. The Department of Homeland Security initiates efforts to educate schools and community groups about resources and funding for campus safety.\n   - Location: Not specified\n\n3. The State Department's special envoy to monitor and combat antisemitism meets with technology companies to address the rise in hateful conflict online.\n   - Location: Not specified\n\n4. Trump's campaign releases a video on Yom Hashoah, Israel's Holocaust remembrance day, contrasting the 2024 presidential candidates' responses on antisemitism.\n   - Location: Not specified"}, {"id": "358e2952-a52a-4f80-b41c-cae7c600a419", "title": "Watch Live : Biden to speak out against antisemitism at Holocaust remembrance ceremony", "date": "2024-05-07 15:30", "url": "https://www.cbsnews.com/news/biden-holocaust-remembrance-ceremony-antisemitism/", "message": "Washington — President Biden is delivering the keynote address at the U.S.\nPresident Biden delivers a speech at the Commander-In-Chief's Trophy Event at the White House in Washington D.C., United States on May 6, 2024.\nSome of the demonstrations have featured antisemitic rhetoric that has prompted concerns about the safety of Jewish students on campuses.\n\"We must protect our Jewish students and we must give our full-throated unequivocal support to the nation of Israel,\" Johnson said.\nIn his remarks on Tuesday, Mr. Biden is expected to focus on the administration's efforts to protect Jewish Americans from antisemitism.", "location": "White House, Washington D.C., United States", "classification": "antisemitism", "score": 0.9482406961616775, "event_breakdown": "1. President Biden delivers keynote address at the U.S. President Biden delivers a speech at the Commander-In-Chief's Trophy Event at the White House in Washington D.C., United States on May 6, 2024.\n   - Location: White House, Washington D.C., United States\n\n2. Concerns raised about antisemitic rhetoric at demonstrations, particularly on college campuses.\n   - Location: Not specified\n\n3. Call to protect Jewish students and express unequivocal support for Israel.\n   - Location: Not specified\n\n4. President Biden expected to address administration's efforts to protect Jewish Americans from antisemitism.\n   - Location: Not specified"}, {"id": "3a18a2a2-db55-491a-8ae5-76145cd7a408", "title": "UNLV  tolerating hate speech , protester says at antisemitism rally", "date": "2024-05-07 03:15", "url": "https://www.yahoo.com/news/unlv-tolerating-hate-speech-protester-012850792.html", "message": "They don’t want to irritate anybody, but they’re tolerating hate speech,” Miriam Borvick, a first-year medical student at UNLV, said.\nProtesters wrapped in Israeli flags rally against antisemitism on Monday at UNLV.\nThe biggest message from Monday’s rally was that the Jewish community won’t stand for antisemitism on college campuses.\nPosters prepared for Monday’s anti-semitism rally at UNLV.\nWhile no counter-protesters showed up Monday, David said there was a difference between Monday’s rally and the one on May 1.", "location": "", "classification": "antisemitism", "score": 0.8023800335028024, "event_breakdown": ""}, {"id": "b4f884e2-c20c-4783-b7bf-e85392fb36b2", "title": "Austria hit with a wave of antisemitic attacks since 7 October", "date": "2024-05-07 07:45", "url": "https://www.euronews.com/my-europe/2024/05/07/austria-hit-with-a-wave-of-antisemitic-attacks-since-7-october", "message": "By Euronews with ATORFSince the start of the Israel-Hamas war, Austria has seen a rise in antisemitic incidents.\nThe president of the lower house of the Austrian Parliament, Wolfgang Sobotka, is attempting to counter them in ViennaADVERTISEMENTThe Jewish Community in Austria has reported a rise in antisemitic incidents across the country.\nIn response, National Council President Wolfgang Sobotka, along with Israel's Ambassador to Austria David Roet and President of the Israelite Religious Society Austria Oskar Deutsch, took action by painting over the graffiti in Vienna-Leopoldstadt, the heart of Jewish life in Austria.\nUnder the leadership of Austrian Constitutional Minister Karoline Edtstadler, the third European Conference on Antisemitism is taking place in Vienna on 6 and 7 May.\nThe opening session features remarks from President of the Austrian Academy of Sciences Heinz Faßmann and Federal Minister Edtstadler.", "location": "Vienna", "classification": "antisemitism", "score": 0.9131523583546196, "event_breakdown": "1. Austria\n   - Location: Austria\n   - Event: Rise in antisemitic incidents since the start of the Israel-Hamas war.\n\n2. Vienna\n   - Location: Vienna\n   - Event: Wolfgang Sobotka, President of the Austrian Parliament's lower house, and Jewish community leaders took action to counter antisemitic incidents by painting over graffiti in Vienna-Leopoldstadt, the heart of Jewish life in Austria.\n\n3. Vienna\n   - Location: Vienna\n   - Event: Third European Conference on Antisemitism taking place on 6 and 7 May, led by Austrian Constitutional Minister Karoline Edtstadler.\n   - Opening session features remarks from President of the Austrian Academy of Sciences Heinz Faßmann and Federal Minister Edtstadler."}, {"id": "af225c27-46d7-4ca8-8f39-542805e96361", "title": "University of Chicago protest : Campus police begin clearing encampment – NBC Chicago", "date": "2024-05-07 14:45", "url": "https://www.nbcchicago.com/news/local/u-of-chicago-police-begin-clearing-pro-palestinian-encampment/3430517/", "message": "The University of Chicago campus police department early Tuesday began ordering students to leave an encampment that had been the site of Pro-Palestinian protests since last week.\nAround 6 a.m., Fazio reported Cook County Sherriff's Deputies were present on city streets.\nEncampment raided by campus police at University of Chicago.\nThe Tuesday response from university police comes a day after officials at the University of Chicago said talks between protesters and the school were \"suspended.\"\n\"In particular, the Scholars at Risk program is an existing initiative at the University of Chicago and other leading universities and colleges.", "location": "The main location mentioned in the text is the \"University of Chicago campus.\"", "classification": "antisemitism", "score": 0.42388217170459447, "event_breakdown": "1. Location: University of Chicago campus\n   - Campus police ordered students to leave a Pro-Palestinian protest encampment.\n   - The encampment had been active since last week.\n   - Raid by campus police reported.\n\n2. Location: City streets near University of Chicago\n   - Cook County Sheriff's Deputies were present around 6 a.m.\n   \n3. Talks between protesters and the University of Chicago were \"suspended\" the day before the police response.\n   - Location: University of Chicago campus\n\n4. The Scholars at Risk program is highlighted as an existing initiative at the University of Chicago and other leading universities and colleges.\n   - Location: University of Chicago campus"}, {"id": "6379194d-2d6e-4360-949f-3180012a1946", "title": "Knesset Christian Allies Caucus MK Kahana commemorates the Holocaust - Israel News", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/israel-news/article-800189", "message": "Knesset Christian Allies Caucus, MK Matan Kahana, in collaboration with the Israel Allies Foundation, joined the March of Life movement in Stuttgart on Holocaust Remembrance Day on May 6.\nThis year’s Remembrance Day fell just over half a year after over 1200 people were killed by Hamas, the largest numbers of Jews to be killed on a single day since the Holocaust.\nThe Israel Allies Foundation, founded in 2007, works to educate and empower pro-Israel, faith-based legislators worldwide.\nThe IAF coordinates the work of 53 Israel Allies Caucuses internationally.\nThis network includes the Knesset Christian Allies Caucus, the Congressional Israel Allies Caucus, and the European Union Parliamentary Israel Allies Caucus.", "location": "", "classification": "antisemitism", "score": 0.628524712034518, "event_breakdown": ""}, {"id": "1ad2f3d4-d550-4817-a9aa-2b7578fb8b61", "title": "Guidance for Holocaust education in school curriculum promised for next school year : province", "date": "2024-05-07 04:15", "url": "https://www.cbc.ca/news/canada/manitoba/holocaust-education-in-schools-ndp-announce-1.7196093", "message": "New curriculum guidance on Holocaust education for kindergarten to Grade 11 students will be rolled out during the next school year, following up on the premier's pledge to make learning about the atrocities of World War II mandatory in the province.\n\"The Jewish community has been asking for mandated Holocaust education for more than half a century,\" said Belle Jarniewski, executive director of the Jewish Heritage Centre of Western Canada.\nJarniewski also said having mandatory Holocaust education is important, especially with a rise in antisemitism since the start of the ongoing war between Israel and Hamas.\nJewish Federation CEO Jeff Lieberman said in Monday's new release Holocaust education in Manitoba will empower young people in the province to \"stand up against antisemitism and hatred in all its forms.\"\nHuman Rights education bus begins tour in WinnipegA human rights education bus is also touring through Winnipeg this week and made a stop at Shaftesbury High School Monday.", "location": "Winnipeg", "classification": "antisemitism", "score": 0.9531834312025472, "event_breakdown": ""}, {"id": "8a41e9ad-eb1f-4443-9aef-ed168c15eee2", "title": "UW - Madison suspends student groups for alleged antisemitism", "date": "2024-05-07 02:15", "url": "https://madison.com/news/local/education/local_schools/uw-madison-student-groups-suspended-mecha-anticolonial-scientists/article_69457912-0bf1-11ef-a978-a3514f8c8013.html", "message": "Two UW–Madison student groups have been suspended on an interim basis while the university investigates allegations of sidewalk chalkings by the groups that endorsed violence, supported terrorist organizations and were antisemitic, the university announced Monday.\nMecha de UW Madison and Anticolonial Scientists were suspended after UW’s Committee on Student Organizations received complaints and media reports Sunday and Monday about the chalking event at the Dane County Farmers’ Market in Downtown Madison on Saturday.\nThe suspension also bars them from using university-owned office space, hosting or co-hosting events, travel and reserving university facilities.\nOther chalkings said “Power to Hezbollah,” “Down with ‘Israel’ down with ‘USA’” and “All cops are Zionists,” the newspaper reported.\n“Our only goal and the only goal of the event is to support Palestine and Palestinian liberation,” he said.", "location": "Dane County Farmers’ Market in Downtown Madison", "classification": "antisemitism", "score": 0.8311986997801544, "event_breakdown": ""}, {"id": "e93b02e5-1252-4f45-931f-42739860f49d", "title": "Christian Family Radio Hosts 2nd Annual March of Remembrance", "date": "2024-05-07 04:15", "url": "https://www.wbko.com/2024/05/07/christian-family-radio-hosts-2nd-annual-march-remembrance/", "message": "Christian Family Radio (CFR) invited members of the community to stand in solidarity with the Jewish Community against antisemitism.\nThe protestors marched up and down Scottsville Road three times, symbolizing the six million lost during the Holocaust.\nAs the protestors marched the lengths of the roadside, cars passing by shared their support through a string of honks.\nI hope that there is no need for a march next year, because world peace will have come.\nMay the Messiah have come and brought world peace, and may there be no more antisemitism,” said Upton.", "location": "Scottsville Road", "classification": "antisemitism", "score": 0.671570113402208, "event_breakdown": "1. CFR invites community members to stand in solidarity with the Jewish Community against antisemitism.\n   - Location: Not specified\n\n2. Protestors march along Scottsville Road three times, symbolizing the six million lost during the Holocaust.\n   - Location: Scottsville Road\n\n3. Passing cars show support through honking as protestors march.\n   - Location: Scottsville Road\n\n4. Expression of hope for world peace and an end to antisemitism by Upton.\n   - Location: Not specified"}, {"id": "ddc2dcef-353c-4057-a5f3-3c4509656af6", "title": "With a Sense of Urgency : Holocaust course brings the past into the present", "date": "2024-05-07 11:30", "url": "https://nypost.com/2024/05/07/lifestyle/with-a-sense-of-urgency-holocaust-course-brings-the-past-into-the-present/", "message": "New York’s Xavier High School is seeking to tackle this problem through their innovative new Holocaust studies program, a voluntary, non-class program spanning an entire semester.\nXavier’s Holocaust Studies program has the power to help prevent people from developing these hateful and ill-informed views towards other human beings, in part by driving home the pain such groups went through.\nThe entire reason history is taught is so students can learn from the past to forge a better future.\nThe algorithms behind these social media sites have one goal: to keep the user’s attention.\nThis situation is the core of what Xavier’s new Holocaust studies program aims to address.", "location": "New York’s Xavier High School", "classification": "antisemitism", "score": 0.6429845983206932, "event_breakdown": "1. Xavier High School introduces innovative Holocaust studies program spanning an entire semester.\n   - Location: Xavier High School, New York\n\n2. Program aims to prevent development of hateful and ill-informed views towards other human beings by highlighting the pain endured by affected groups.\n   - Location: Xavier High School, New York\n\n3. Emphasis on learning from history to create a better future.\n   - Location: Not specified\n\n4. Focus on addressing the impact of social media algorithms on shaping perceptions and attention.\n   - Location: Not specified"}, {"id": "98e43fd2-e62e-4de5-8e48-c99c72960a34", "title": "Live coverage : Ducks for Israel , Oregon Hillel condemn encampment on eighth day", "date": "2024-05-07 00:30", "url": "https://www.dailyemerald.com/news/live-coverage-ducks-for-israel-oregon-hillel-condemn-encampment-on-eighth-day/article_90d3dc88-0bb7-11ef-bb8e-174dff50c0d0.html", "message": "Rain falls on the encampment on May 3, 2024.\nThis is the fifth day of the growing pro-Palestine encampment demonstration, which now fills most of space between Lillis Business Complex and Knight Library; the protest is one of many across college campuses nationwide.\n(Alex Hernandez/Emerald)", "location": "Lillis Business Complex and Knight Library", "classification": "antisemitism", "score": 0.19418138463857748, "event_breakdown": ""}, {"id": "d94a12ac-b81e-4f5e-b4d9-299c5760804a", "title": "UW - Madison suspends student groups for alleged antisemitism", "date": "2024-05-07 03:30", "url": "https://wiscnews.com/news/state-regional/uw-madison-student-groups-suspended-mecha-anticolonial-scientists/article_c99c3834-65c1-5954-bc2a-0b78fa8f41a7.html", "message": "Two UW–Madison student groups have been suspended on an interim basis while the university investigates allegations of sidewalk chalkings by the groups that endorsed violence, supported terrorist organizations and were antisemitic, the university announced Monday.\nMecha de UW Madison and Anticolonial Scientists were suspended after UW's Committee on Student Organizations received complaints and media reports Sunday and Monday about the chalking event at the Dane County Farmers' Market in Downtown Madison on Saturday.\nThe suspension also bars them from using university-owned office space, hosting or co-hosting events, travel and reserving university facilities.\nOther chalkings said “Power to Hezbollah,” “Down with ‘Israel’ down with ‘USA’” and “All cops are Zionists,\" the newspaper reported.\nMecha de UW Madison did not immediately respond to an email seeking comment and the person who answered the group's phone number said she was no longer part of the group.", "location": "Downtown Madison", "classification": "antisemitism", "score": 0.6197806276598871, "event_breakdown": "1. UW–Madison student groups Mecha de UW Madison and Anticolonial Scientists suspended on an interim basis.\n   - Location: UW–Madison campus, Madison, Wisconsin, United States\n\n2. Suspension follows allegations of sidewalk chalkings endorsing violence, supporting terrorist organizations, and being antisemitic.\n   - Location: Dane County Farmers' Market, Downtown Madison, Wisconsin, United States\n\n3. Complaints and media reports prompted the investigation by UW's Committee on Student Organizations.\n   - Location: UW–Madison campus, Madison, Wisconsin, United States\n\n4. Suspension includes prohibition on using university-owned office space, hosting or co-hosting events, travel, and reserving university facilities.\n   - Location: UW–Madison campus, Madison, Wisconsin, United States\n\n5. Chalkings included messages such as \"Power to Hezbollah,\" \"Down with ‘Israel’ down with ‘USA’,\" and \"All cops are Zionists.\"\n   - Location: Dane County Farmers' Market, Downtown Madison, Wisconsin, United States\n\n6. Mecha de UW Madison did not immediately respond to requests for comment.\n   - Location: Not specified"}, {"id": "51b89b3e-45b7-4595-977e-c93dd374d7db", "title": "BUZO organizes Display of Remembrance on Peace Quad", "date": "2024-05-07 06:15", "url": "https://www.bupipedream.com/news/buzo-organizes-display-of-remembrance-on-peace-quad/153800/", "message": "In honor of Yom HaShoah, Holocaust Memorial Day, 1,200 Israeli flags were planted, representing the Israeli lives lost on Oct. 7.\nOn Yom HaShoah, Holocaust Memorial Day, Binghamton University’s Zionist Organization (BUZO) created a Display of Remembrance on the Peace Quad.\nThe rally was held during the second day of the Peace Quad encampment organized by the Divest from Death coalition, which was disassembled before 5 p.m. last Friday.\nHakim said they chose to put the memorial on the Peace Quad partly because of the encampment’s presence there.\n“It’s important that all of us want peace,” Hakim said.", "location": "Based on the information provided, the main location where the main event takes place is the \"Peace Quad\" at Binghamton University.", "classification": "antisemitism", "score": 0.4954408646947938, "event_breakdown": "1. 1,200 Israeli flags planted in honor of Yom HaShoah, Holocaust Memorial Day, representing Israeli lives lost on Oct. 7.\n   - Location: Not specified\n\n2. Binghamton University’s Zionist Organization (BUZO) creates a Display of Remembrance on the Peace Quad for Yom HaShoah, Holocaust Memorial Day.\n   - Location: Peace Quad, Binghamton University\n\n3. Rally held during the second day of the Peace Quad encampment organized by the Divest from Death coalition.\n   - Location: Peace Quad, Binghamton University\n\n4. The Peace Quad encampment was disassembled before 5 p.m. last Friday.\n   - Location: Peace Quad, Binghamton University\n\n5. Reason for placing the memorial on the Peace Quad partly due to the encampment’s presence there.\n   - Location: Peace Quad, Binghamton University"}, {"id": "b98505ca-7d5f-413f-aeea-b205462aea0c", "title": "College protests updates : Police begin dismantling University of Chicago encampment – KTBB News , Weather , Talk", "date": "2024-05-07 12:45", "url": "https://ktbb.com/post/?p=1319893", "message": "Students at schools including Yale University, New York University, Harvard University, University of Texas at Austin, University of Southern California and more have launched protests.\nAll times Eastern:May 07, 6:59 AMPolice begin dismantling encampment at University of ChicagoPolice entered an encampment at the University of Chicago early Tuesday and began dismantling it, according to WLS-TV, ABC News’ Chicago station.\nShafik said it pushed the university \"to the brink,\" according to a letter sent to the Columbia University community Wednesday.\nPolice moved onto the Columbia University campus a little before 9 p.m.\nApr 30, 11:14 PMNYPD moves in at Columbia, begins making arrestsNew York Police Department officers have moved onto the Columbia University campus and have begun making arrests.", "location": "", "classification": "antisemitism", "score": 0.377109506087523, "event_breakdown": "1. Protests are launched at various universities in the United States.\n   - Locations: Yale University, New York University, Harvard University, University of Texas at Austin, University of Southern California, and others.\n\n2. Police begin dismantling an encampment at the University of Chicago.\n   - Location: University of Chicago\n   - Date and Time: May 7, 6:59 AM (Eastern)\n\n3. Police enter the Columbia University campus and begin making arrests.\n   - Location: Columbia University\n   - Date and Time: Apr 30, 11:14 PM (Eastern)\n\n4. Columbia University community receives a letter mentioning the university being pushed \"to the brink.\"\n   - Location: Columbia University\n   - Date and Time: May 7 (no specific time mentioned)\n\n5. Police moved onto the Columbia University campus a little before 9 p.m.\n   - Location: Columbia University\n   - Date and Time: No specific date mentioned."}, {"id": "22329e2d-061a-4c07-a51d-e6fbc54dfc13", "title": "College protests updates : Police begin dismantling University of Chicago encampment – Connect FM | Local News Radio", "date": "2024-05-07 13:15", "url": "https://www.connectradio.fm/abc-national/college-protests-updates-police-begin-dismantling-university-of-chicago-encampment", "message": "Students at schools including Yale University, New York University, Harvard University, University of Texas at Austin, University of Southern California and more have launched protests.\nAll times Eastern:May 07, 6:59 AMPolice begin dismantling encampment at University of ChicagoPolice entered an encampment at the University of Chicago early Tuesday and began dismantling it, according to WLS-TV, ABC News’ Chicago station.\nRick Braziel, the former Sacramento chief of police, will head the new Office of Campus Safety, Block said.\nShafik said it pushed the university “to the brink,” according to a letter sent to the Columbia University community Wednesday.\nApr 30, 11:14 PMNYPD moves in at Columbia, begins making arrestsNew York Police Department officers have moved onto the Columbia University campus and have begun making arrests.", "location": "", "classification": "antisemitism", "score": 0.4191941987964494, "event_breakdown": ""}, {"id": "f8a7e6f6-73e1-4173-a6d8-5f25834806fa", "title": "College protests updates : UCLA launching investigation into violent attacks on protesters", "date": "2024-05-07 12:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1562805", "message": "Students at schools including Yale University, New York University, Harvard University, University of Texas at Austin, University of Southern California and more have launched protests.\nBlock said the newly created Office of Campus Safety will oversee the management of the UCLA Police Department and the Office of Emergency Management.\nRick Braziel, the former Sacramento chief of police, will head the new Office of Campus Safety, Block said.\nShafik said it pushed the university “to the brink,” according to a letter sent to the Columbia University community Wednesday.\nApr 30, 11:14 PMNYPD moves in at Columbia, begins making arrestsNew York Police Department officers have moved onto the Columbia University campus and have begun making arrests.", "location": "", "classification": "antisemitism", "score": 0.48217867824978794, "event_breakdown": ""}, {"id": "1f0a89a0-ee0d-4323-919d-566ba524ac15", "title": "President Biden condemns antisemitism in Holocaust remembrance speech amid college protests and Gaza war", "date": "2024-05-07 11:30", "url": "https://abc11.com/president-biden-condemns-antisemitism-in-holocaust-remembrance-speech-amid-college-campus-protests-and-gaza-war/14778077/", "message": "Biden condemns antisemitism in Holocaust remembrance speech amid college protests and Gaza warWASHINGTON -- President Joe Biden condemned the \"ferocious surge of antisemitism in America and around the world\" during a Tuesday ceremony to remember victims of the Holocaust at a time when the Hamas attack on Israel and controversy over the war in Gaza have sparked new waves of violence and hateful rhetoric toward Jews.\nBiden said \"There's no place on any campus in America\" or any place in America for antisemitism or threats of violence.\nHe added, \"We're not a lawless country - we are a civil society\"In conjunction with Biden's speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nAnd the State Department's special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nTrump's campaign on Monday released a video on Yom Hashoah, Israel's Holocaust remembrance day, that aimed to contrast the 2024 presidential candidates' responses on antisemitism.", "location": "Washington", "classification": "antisemitism", "score": 0.9818022204650159, "event_breakdown": "- President Joe Biden condemns antisemitism in Holocaust remembrance speech\n- College protests and Gaza war spark new waves of violence and hateful rhetoric toward Jews\n- Biden's administration announces new steps to combat antisemitism on college campuses and beyond\n- State Department's special envoy to combat antisemitism meets with technology companies\n- Trump's campaign releases video on Yom Hashoah, Israel's Holocaust remembrance day"}, {"id": "5cc7ef10-5196-453c-955c-eb414fd60b83", "title": "Biden to condemn current antisemitism in Holocaust remembrance amid college protests and Gaza war", "date": "2024-05-07 12:30", "url": "https://www.ksat.com/news/politics/2024/05/07/biden-to-condemn-current-antisemitism-in-holocaust-remembrance-amid-college-protests-and-gaza-war/", "message": "Holocaust Memorial Museum's Annual Days of Remembrance ceremony at the U.S. Capitol, Tuesday, May 7, 2024 in Washington.\nBiden said “There’s no place on any campus in America” or any place in America for antisemitism or threats of violence.\nHe added, “We’re not a lawless country — we are a civil society”In conjunction with Biden’s speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nAnd the State Department’s special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nTrump’s campaign on Monday released a video on Yom Hashoah, Israel’s Holocaust remembrance day, that aimed to contrast the 2024 presidential candidates’ responses on antisemitism.", "location": "", "classification": "antisemitism", "score": 0.9197066278180368, "event_breakdown": "- Location: Washington, D.C., United States\n  Event: Holocaust Memorial Museum's Annual Days of Remembrance ceremony at the U.S. Capitol.\n  Additional Information: President Biden condemns antisemitism and violence, stating there's no place for it in America, emphasizing civil society.\n- Location: United States (nationwide)\n  Event: Biden administration announces new measures to combat antisemitism, especially on college campuses.\n- Location: United States (nationwide)\n  Event: State Department's special envoy to monitor and combat antisemitism holds meetings with technology companies to address online hateful content.\n- Location: United States (nationwide)\n  Event: Trump's campaign releases a video on Yom Hashoah contrasting presidential candidates' responses to antisemitism."}, {"id": "bbad8901-3637-4543-b7bd-d6051ddd02fd", "title": "Biden to condemn current antisemitism in Holocaust remembrance amid college protests and Gaza war – Winnipeg Free Press", "date": "2024-05-07 12:30", "url": "https://www.winnipegfreepress.com/breakingnews/2024/05/07/biden-to-condemn-current-antisemitism-in-holocaust-remembrance-amid-college-protests-and-gaza-war", "message": "President Joe Biden arrives at Andrews Air Force Base, Md., from a weekend trip to his Delaware home, Monday, May 6, 2024.\n(AP Photo/Evan Vucci)Biden said “There’s no place on any campus in America” or any place in America for antisemitism or threats of violence.\nHe added, “We’re not a lawless country — we are a civil society”In conjunction with Biden’s speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nAnd the State Department’s special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nHolocaust Memorial Museum's Annual Days of Remembrance ceremony at the U.S. Capitol, Tuesday, May 7, 2024 in Washington.", "location": "Andrews Air Force Base, Md.", "classification": "antisemitism", "score": 0.7262112979769679, "event_breakdown": ""}, {"id": "6c0875ad-d41f-45e5-bc03-1b6c942afe1c", "title": "Biden to condemn antisemitism in Holocaust remembrance amid college protests , Gaza war", "date": "2024-05-07 13:15", "url": "https://www.13abc.com/2024/05/07/biden-condemn-antisemitism-holocaust-remembrance-amid-college-protests-gaza-war/", "message": "Biden has struggled to balance his support for Israel after the Oct. 7 Hamas attack — the deadliest day for Jews worldwide since the Holocaust — with his efforts to constrain its war on the militant group in Gaza.\nBiden said “There’s no place on any campus in America” or any place in America for antisemitism or threats of violence.\nHe added, “We’re not a lawless country — we are a civil society”In conjunction with Biden’s speech, his administration was announcing new steps to combat antisemitism on colleges campuses and beyond.\nAnd the State Department’s special envoy to monitor and combat antisemitism was meeting with technology companies on how to combat the rise in hateful conflict online.\nTrump’s campaign on Monday released a video on Yom Hashoah, Israel’s Holocaust remembrance day, that aimed to contrast the 2024 presidential candidates’ responses on antisemitism.", "location": "", "classification": "antisemitism", "score": 0.9861393852815404, "event_breakdown": "- Location: United States (nationwide)\n  Event: President Biden's ongoing struggle to balance support for Israel and his efforts to constrain its war on the militant group in Gaza following the Oct. 7 Hamas attack.\n- Location: United States (nationwide)\n  Event: Biden announced new steps to combat antisemitism on college campuses and beyond.\n- Location: United States (nationwide)\n  Event: The State Department’s special envoy to monitor and combat antisemitism met with technology companies to discuss combating the rise in hateful conflict online.\n- Location: United States (nationwide)\n  Event: Trump’s campaign released a video on Yom Hashoah (Israel’s Holocaust remembrance day) contrasting the 2024 presidential candidates' responses on antisemitism."}, {"id": "70b34d71-3aff-4d78-a0ae-4f3cd771f545", "title": "Biden to call for a fight against antisemitism at a precarious moment in Israel war in Gaza and amid protests on campus", "date": "2024-05-07 11:00", "url": "https://edition.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/", "message": "Washington CNN —President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas’ attack on Israel.\nBiden’s speech was a somber moment of reflection amid a tense and pivotal time in his reelection push.\n“This ancient hatred of Jews didn’t begin with the Holocaust – it didn’t end with the Holocaust, either, or even after our victory in World War II.\nAnd on Monday, a day ahead of Biden’s speech, second gentleman Doug Emhoff hosted a number of Jewish students at the White House for a roundtable.\nBiden’s speech came one day after Yom HaShoah, or Holocaust Remembrance Day.", "location": "White House", "classification": "antisemitism", "score": 0.9551123411805261, "event_breakdown": ""}, {"id": "feac88bc-7f7d-45c1-bd79-29ed417deb61", "title": "Watch Live : Biden to speak out against antisemitism at Holocaust remembrance ceremony", "date": "2024-05-07 15:30", "url": "https://www.cbsnews.com/news/biden-holocaust-remembrance-ceremony-antisemitism/", "message": "Washington — President Biden delivered the keynote address at the U.S.\nSince the attack, there's been a \"ferocious surge of antisemitism in America and around the world,\" Mr. Biden said.\nThat ire has also shifted to the president himself more recently, as House Speaker Mike Johnson has put political pressure on Mr. Biden.\nIn his remarks on Tuesday, Mr. Biden highlighted the administration's efforts to protect Jewish Americans from antisemitism.\n\"In America, we respect and protect the fundamental right to free speech,\" Mr. Biden said.", "location": "", "classification": "antisemitism", "score": 0.5561299956174731, "event_breakdown": "1. President Biden delivers keynote address at the U.S.\n2. Surge of antisemitism in America and around the world following the attack.\n3. Political pressure on Mr. Biden by House Speaker Mike Johnson.\n4. Mr. Biden highlights administration's efforts to protect Jewish Americans from antisemitism.\n5. Emphasis on respecting and protecting the fundamental right to free speech in America."}, {"id": "ca645993-e93c-45b9-9d06-1181f29d2bdb", "title": "LAPD , DPS clear  Gaza Solidarity Occupation  at USC as it happened", "date": "2024-05-07 04:15", "url": "https://dailytrojan.com/2024/05/01/lapd-dps-clear-gaza-solidarity-occupation-at-usc-as-it-happened/", "message": "All spoke on condition of anonymity for fear of their safety.\nThe film they are showing is body cam footage filmed Oct. 7 by Hamas militants, the counterprotester said.\n“We’re so tired of hearing, ‘Intifada, Intifada,’ because we know people who died on buses in the intifada,” they said.\nWe support the betterment of all people, Israelis and Palestinians,” another counterprotester said.\n“What we don’t support is harassment of students.”", "location": "", "classification": "antisemitism", "score": 0.39682694588554746, "event_breakdown": ""}, {"id": "a8ddbfa3-f01d-42ae-bd75-3fe64e249c0b", "title": "Biden faces widening partisan split over Israel", "date": "2024-05-07 04:30", "url": "https://us.cnn.com/2024/05/06/politics/biden-israel-partisan-split-analysis/", "message": "CNN —President Joe Biden is facing more critical moments this week that will test his fraught relationship with his base over Israel’s war in Gaza and potentially widen the partisan split about the Jewish state that has been building for years.\nAgainst this backdrop, partisan polarization about Israel among American voters was already widening years before the brutal Hamas attack last October and the devastating Israeli response it triggered.\nAn array of polls this spring show how the war in Gaza has hardened this partisan split.\nNearly half of Democrats, but only a little over one-fifth of Republicans in the CBS poll, said the US should pressure Israel to stop the fighting.\n“Biden has a Democratic caucus that is putting a lot of faith in this process,” she said.", "location": "Gaza", "classification": "antisemitism", "score": 0.6206599091924859, "event_breakdown": ""}]