[{"id": "0b704c8f-05e4-48d4-8801-48a40199eb29", "title": "5 Missiles Land Near Ship in Red Sea in Likely the Latest Attack by Yemen Houthi Terrorists", "date": "2024-06-30 05:15", "url": "https://www.theepochtimes.com/world/5-missiles-land-near-ship-in-red-sea-in-likely-the-latest-attack-by-yemens-houthi-terrorists-5677075", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates—A ship traveling through the Red Sea came under repeated missile fire Friday in an attack launched by Yemen’s Houthi terrorists, authorities said, the latest targeting the crucial maritime route.\nThe missiles landed near the vessel, but caused no damage, the UKTMO added.\nGen. Yahya Saree, claimed late Friday the group made two attacks on ships in the Red Sea, but it wasn’t immediately clear which ship was the one reported targeted by authorities.\nThe terrorists have targeted more than 60 vessels by firing missiles and drones in their campaign that has killed a total of four sailors.\nA Houthi attack also happened Thursday in the Red Sea.", "location": "DUBAI, United Arab Emirates.", "classification": "security", "score": 0.8804399816490751, "event_breakdown": "Reporting live events take time. Kindly revisit the question after some time has passed."}, {"id": "02d96c29-ebd1-4d4b-9952-7172aef34130", "title": "Injury Toll In Missile Attack On Vilniansk Grows To 23", "date": "2024-06-30 00:00", "url": "https://menafn.com/1108388824/Injury-Toll-In-Missile-Attack-On-Vilniansk-Grows-To-23", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The number of people in a Russian missile attack on Vilniansk, Zaporizhzhia region, has increased to 23, including eight children.\nUkraine's State Emergency Service announced this on , Ukrinform reports.\n\"As of 21:20, the number of those injured in the enemy attack has increased to 23, including eight children,\" the post reads.\nThe strike killed seven people, including two children.\nOn the afternoon of Saturday, June 29, Russian forces attacked Vilniansk, not far from Zaporizhzhia.", "location": "ZAPORIZHZHIA", "classification": "security", "score": 0.7602166189788604, "event_breakdown": "Event 1: Russian missile attack in Vilniansk, Zaporizhzhia region, Ukraine kills 7, including 2 children, on Saturday, June 29, 22:20\nEvent 2: A Russian missile attack on Vilniansk, Zaporizhzhia region, Ukraine, killed 7 people, including 2 children, on Saturday, June 29, 21:20."}, {"id": "ffa1bc2e-7c0f-4e76-a97f-8feb102a9139", "title": "Zelensky issues fresh weapons plea after 7 killed in Russian attack on Zaporizhzhia region", "date": "2024-06-30 10:15", "url": "https://www.cnn.com/2024/06/30/europe/ukraine-russia-zaporizhzhia-attack-frontlines-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —At least 7 people, including children, were killed and at least 31 injured after Russia launched a missile strike on the town of Vilniansk in Ukraine’s southern Zaporizhzhia region on Saturday, according to Ukrainian officials.\n“[Today] is a day of mourning in Zaporizhzhia region for those killed in the enemy attack on Vilniansk,” Ivan Fedorov, the head of Zaporizhzhia regional military administration, said on Sunday.\n“There is unspeakable pain.”Three children were among those killed and eight children were among the injured, Fedorov said.\nIn the Donetsk region, Russia has made advances towards Chasiv Yar as it attempts to capture the strategic hilltop town.\nAs Zelensky repeats his appeals for more long-range weapons, these developments have again highlighted Ukraine’s reliance on ammunition and weapons from the United States and other allies.", "location": "ODESSA", "classification": "security", "score": 0.8246647649521969, "event_breakdown": "Russia has launched missile strike on Ukraine's southern Zaporizhzhia region on Saturday, killing at least seven including children and injuring at least 31. Russia has also made advances in the Donetsk region, as it continues to attempt to capture strategic hilltop town, Chasiv Yar. These events highlight the Ukraine's reliance on weapons and ammunition from the United States and other allies."}, {"id": "5e87a0de-01b0-4b06-87be-7e113904c8c3", "title": "Nigerian Police Confirm Eight Dead In Borno Suicide Bombing , 15 Injured", "date": "2024-06-30 01:30", "url": "https://saharareporters.com/2024/06/29/nigerian-police-confirm-eight-dead-borno-suicide-bombing-15-injured", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "\"A woman carrying a baby detonated an Improvised Explosive Device IED at a busy motor park in Mararaba T. Junction in Gwoza town.\nSaharaReporters had earlier reported that a Nigerian Army soldier was among the persons killed when two suicide bombers detonated an improvised explosive device (IED).\nA military source in Gwoza reported that a female suicide bomber crossed the road near the military base and detonated an IED, resulting in the death of a soldier.\nIt was learnt that the terrorists reinforced and returned to the 192 Brigade but the Nigerian Army troops successfully repelled the attack.\nWhile trying to bury the deceased, another bomber disguised as a mourner detonated an IED at the burial site, killing one person.", "location": "Gwoza town, in Mararaba T. Junction motor park", "classification": "security", "score": 0.9996322858903997, "event_breakdown": "1. A woman detonated an Improvised Explosive Device (IED) at a busy motor park in Mararaba T. Junction in Gwoza town.\n2. Two female suicide bombers detonated an improvised explosive device (IED), killing a Nigerian Army soldier and another person in Gwoza, Borno State."}, {"id": "80d4fb3e-8513-4034-9f5d-632e32aa9f1d", "title": "Russian missile attack on Ukrainian town kills seven , officials say", "date": "2024-06-30 03:45", "url": "https://www.sbs.com.au/news/article/russian-missile-attack-on-ukrainian-town-kills-seven-officials-say/ngu8l02yc", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "Russian forces on Saturday fired missiles at the town of Vilniansk, outside the southeastern Ukrainian city of Zaporizhzhia, killing seven people and injuring 31 others, officials said.\nThe background: Ukraine's Prosecutor General Andriy Kostin said two missiles were fired on the town, damaging infrastructure, a shop and residential buildings.\nOn Telegram, the Russian ministry said its missiles had struck a nearby area in Zaporizhzhia region where it said Ukrainian trains unloaded arms and military equipment, killing soldiers and destroying armoured vehicles and missiles.\nThe key quote: \"Our cities and communities suffer daily from such Russian strikes.\"\nOfficials said two people in Kherson region, partly occupied by Russian forces in the south, were also killed.", "location": "MOSCOW", "classification": "security", "score": 0.9254233649199769, "event_breakdown": "Russian forces fire missile at Vilniansk, Ukraine outside of Zaporizhzhia, injuring seven people."}, {"id": "80816200-c652-4568-8bb2-a691311a4030", "title": "Lesser Powers Also Use Cross - Border Assassination As A Tool To Execute Policy", "date": "2024-06-30 04:30", "url": "https://menafn.com/1108389248/Lesser-Powers-Also-Use-Cross-Border-Assassination-As-A-Tool-To-Execute-Policy", "domain": "menafn.com", "domain_classification": "Unknown", "message": "After the collapse of the USSR, Russia's Vladimir Putin perfected the art of assassination on foreign soil.\nPakistan, a likely target for India's foreign assassination program, is suspected of carrying out similar murders.\nIsrael, one of the most frequent employers of extraterritorial targeted killings, appears to have renewed its own assassination program to take out senior Hamas leadership.\nHowever, it was Israel which made assassination abroad a highly efficient tool of foreign policy.\nAccording to The Secret History of Israel's Targeted Assassinations (2018) written by Ronen Bergman, Mossad had carried out hundreds of targeted killings since 2000.", "location": ")\nIsrael", "classification": "security", "score": 0.863493374141672, "event_breakdown": "The assassination of Qassim Suleimani near Baghdad's airport on January 3rd, 2020\nThe killing of Osama bin Laden in Pakistan by US special forces in 2011\nThe assassination of Iranian nuclear scientist Mohsen Fakhrizadeh near Tehran in November 2020"}, {"id": "93a8d393-6406-404d-87ed-31f8f075587c", "title": "Tears , Wailing as Boko Haram Suicide Bombers Return to Borno with Multiple Attacks – THISDAYLIVE", "date": "2024-06-30 08:00", "url": "https://www.thisdaylive.com/index.php/2024/06/30/tears-wailing-as-boko-haram-suicide-bombers-return-to-borno-with-multiple-attacks/", "domain": "thisdaylive.com", "domain_classification": "Unknown", "message": "Suicide bombing by the insurgents had stopped until yesterday’s incidents, which have fuelled fears that the reign of terror might have returned.\nSaidu added that he also received a report that there was a suspected suicide bomber in Pulka.\nHe said: “The entire Gwoza council area is in serious mourning following multiple suicide attacks on our community.\nAn eyewitness, who simply identified himself as Musa, said on the phone that the first suicide bomber targeted a wedding ceremony.\nHowever, the state Commissioner of Police (CP), Yusuf Lawal, who confirmed the attack on wedding ceremony to journalists in the state, stated that it was carried out by a female suicide bomber.", "location": "Gwoza", "classification": "security", "score": 0.9623330780069684, "event_breakdown": "Suicide bombing by the insurgents had stopped until yesterday's incidents, which have fuelled fears that the reign of terror might have returned.."}, {"id": "f925d48f-8abd-4369-ae6e-acca922a6ae4", "title": "Israel war : Lebanon border exchanges raise prospect of another IDF war", "date": "2024-06-30 06:30", "url": "https://www.smh.com.au/world/middle-east/prospect-of-israel-lebanon-war-has-diplomats-racing-to-quell-tensions-20240630-p5jpxa.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Washington: US, European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon’s Iran-backed Hezbollah militants from spiralling into a wider Middle East war that the world has feared for months.\nIran and Israel traded threats on the weekend of what Iran said would be an “obliterating” war over Hezbollah.\nA Lebanese family stands next to a destroyed building that were hit by an Israeli airstrike, in Aita al-Shaab, a border village.\nCredit: APHopes are lagging for a ceasefire in Israel’s conflict with Hamas in Gaza that would calm attacks by Hezbollah and other Iranian-allied militias.\nAmerican and European diplomats and other officials are delivering warnings to Hezbollah – far stronger than Hamas but seen as overconfident – about taking on the military might of Israel, current and former diplomats say.", "location": "Middle East", "classification": "security", "score": 0.8629388317333937, "event_breakdown": "Israel-Palestine, Lebanon-Israel"}, {"id": "74573c00-5efe-40e6-9388-6afa91bd9bc9", "title": "Israel war : Lebanon border exchanges raise prospect of another IDF war", "date": "2024-06-30 06:30", "url": "https://www.watoday.com.au/world/middle-east/prospect-of-israel-lebanon-war-has-diplomats-racing-to-quell-tensions-20240630-p5jpxa.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Washington: US, European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon’s Iran-backed Hezbollah militants from spiralling into a wider Middle East war that the world has feared for months.\nIran and Israel traded threats on the weekend of what Iran said would be an “obliterating” war over Hezbollah.\nA Lebanese family stands next to a destroyed building that were hit by an Israeli airstrike, in Aita al-Shaab, a border village.\nCredit: APHopes are lagging for a ceasefire in Israel’s conflict with Hamas in Gaza that would calm attacks by Hezbollah and other Iranian-allied militias.\nAmerican and European diplomats and other officials are delivering warnings to Hezbollah – far stronger than Hamas but seen as overconfident – about taking on the military might of Israel, current and former diplomats say.", "location": "Middle East", "classification": "security", "score": 0.8629388317333937, "event_breakdown": "US, European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon's Iran-backed Hezbollah militants from spiralling into a wider Middle East war."}, {"id": "7385b509-0263-4911-8e9c-0f1124252236", "title": "Israel war : Lebanon border exchanges raise prospect of another IDF war", "date": "2024-06-30 06:15", "url": "https://www.brisbanetimes.com.au/world/middle-east/prospect-of-israel-lebanon-war-has-diplomats-racing-to-quell-tensions-20240630-p5jpxa.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Washington: US, European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon’s Iran-backed Hezbollah militants from spiralling into a wider Middle East war that the world has feared for months.\nIran and Israel traded threats on the weekend of what Iran said would be an “obliterating” war over Hezbollah.\nA Lebanese family stands next to a destroyed building that were hit by an Israeli airstrike, in Aita al-Shaab, a border village.\nCredit: APHopes are lagging for a ceasefire in Israel’s conflict with Hamas in Gaza that would calm attacks by Hezbollah and other Iranian-allied militias.\nAmerican and European diplomats and other officials are delivering warnings to Hezbollah – far stronger than Hamas but seen as overconfident – about taking on the military might of Israel, current and former diplomats say.", "location": "Israel", "classification": "security", "score": 0.8629388317333937, "event_breakdown": "Israeli airstrikes hit parts of Lebanon near the Syrian border on Monday, according to Lebanese media."}, {"id": "48f12cd2-c537-446e-bde8-d640c4e887b2", "title": "U . S ., Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 01:45", "url": "https://www.reviewjournal.com/news/nation-and-world/u-s-europe-warn-hezbollah-to-ease-strikes-on-israel-3077697/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "U.S., European and Arab mediators are pressing to keep cross-border attacks between Israel and Lebanon’s Hezbollah terrorists from spiraling into a wider Middle East war.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after the Oct. 7 Hamas-led terrorist attack on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "LEBANON", "classification": "security", "score": 0.9555311884628526, "event_breakdown": "-U.S., European and Arab mediators are pressing to keep cross-border attacks between Israel and Lebanon’s Hezbollah terrorists from spiraling into a wider Middle East war --I  .\n-Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\n-On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this past week.\n-- Attacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\n-Israel has the power to cause heavy casualties.\n-Hezbollah has the power to cause heavy casualties."}, {"id": "0c1d0df7-d432-4938-b8c4-eea10421f481", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 00:15", "url": "https://omaha.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_a9e257e3-0eeb-5233-9c29-e0d8fca50299.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.8711662527602523, "event_breakdown": "Israel, Hezbollah, Lebanon"}, {"id": "daf2e862-67a3-48cc-aced-220046750f1b", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 00:15", "url": "https://journalstar.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_d4b2f173-9eb9-5ef1-b24b-2761f9c96bed.html", "domain": "journalstar.com", "domain_classification": "Unknown", "message": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.8711662527602523, "event_breakdown": "Israel launched strikes against Hamas's underground infrastructure in the northern Gaza Strip late Thursday in response to ongoing incendiary balloon attacks, the Israel Defense Forces said.\nThe strikes came after several balloons attached to explosives were sent into Israel from Gaza throughout the day on Thursday, sparking multiple fires in fields across the coastal territory.\nAccording to IDF Spokesperson Hidai Zilberman, the strikes targeted Hamas' underground infrastructure and military compounds."}, {"id": "2ffd4aeb-bf02-4af9-a271-274c41dda71c", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 01:45", "url": "https://tulsaworld.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_7bec8410-23c6-5144-a24a-e96435f16807.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "Hopes are lagging for a cease-fire in Israel’s conflict with Hamas in Gaza that would calm attacks by Hezbollah and other militias allied with Iran.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas’ Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "GAZA", "classification": "security", "score": 0.939650755131699, "event_breakdown": "Event: Ongoing Israeli military operation 'Guardian of the Walls'\nDuring an 11-day conflict between Israel and Hamas, rockets were launched from the Gaza Strip towards Jerusalem and other Israeli cities. Before the fighting stopped we detected a strike in a government building in northern Gaza."}, {"id": "93ac0fab-7ebc-4fe8-8009-f79a6034160f", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 00:15", "url": "https://siouxcityjournal.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_cebbf37b-2a47-5e60-aa4c-aeac3fab33a8.html", "domain": "siouxcityjournal.com", "domain_classification": "Unknown", "message": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.8711662527602523, "event_breakdown": "Israel-Lebanon conflict, 2006–2008"}, {"id": "d19a0817-5c6a-42a3-b280-2c5168df1e70", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 01:00", "url": "https://journaltimes.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_9d6d7974-890b-5160-adf9-307d12458211.html", "domain": "journaltimes.com", "domain_classification": "Unknown", "message": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "BEIRUT", "classification": "security", "score": 0.8711662527602523, "event_breakdown": "Israel-Palestine conflict - Israeli forces have clashed with Palestinian protesters in the occupied West Bank, wounding dozens.\nHezbollah-Israel conflict - On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah appeared at least to level off this past week."}, {"id": "57871e31-605f-4cf1-bd0e-fef59cec6b51", "title": "Boston stabbing under investigation – NECN", "date": "2024-06-30 01:15", "url": "https://www.necn.com/news/local/police-investigating-stabbing-in-downtown-boston/3271071/", "domain": "necn.com", "domain_classification": "Unknown", "message": "Police are investigating a stabbing that occurred in downtown Boston on Saturday night.\nBoston police said they responded to a report of a person stabbed in the area of Milk and Washington streets at 6:46 p.m.\nWhen they arrived, police said officers located a victim, who was taken to an area hospital with non-life-threatening injuries.\nInitial reports were that the stabbing resulted from an altercation over scooters and a possible attempt to steal a scooter.\nEarlier in the day, around 1:30 p.m., police received a call for a person stabbed at the South End Whole Foods on Harrison Avenue.", "location": "Boston", "classification": "security", "score": 0.5859432331509105, "event_breakdown": "Stabbing in downtown Boston Saturday night\nPerson stabbed in front of South End Whole Foods on Saturday"}, {"id": "4596d38d-41d8-4ed7-a1c8-8527717c2cf2", "title": "Back off attacks , mediator nations urge Hezbollah | The Arkansas Democrat - Gazette", "date": "2024-06-30 10:00", "url": "https://www.arkansasonline.com/news/2024/jun/30/back-off-attacks-mediator-nations-urge-hezbollah/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "Hopes are lagging for a cease-fire in Israel's conflict with Hamas in Gaza that would calm attacks by Hezbollah and other Iranian-allied militias.\nHEZBOLLAH ATTACKSBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nIsrael and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.8645194627038516, "event_breakdown": "Hezbollah rocket attacks in northern Israel (ongoing events)"}, {"id": "bc021690-744f-40d3-a10c-294c86d91aa6", "title": "No progress in Gaza ceasefire talks with Israel , says Hamas official", "date": "2024-06-30 08:00", "url": "https://www.hiiraan.com/news4/2024/Jun/196900/no_progress_in_gaza_ceasefire_talks_with_israel_says_hamas_official.aspx", "domain": "hiiraan.com", "domain_classification": "Unknown", "message": "By Nidal Al-MughrabiSunday June 30, 2024Smoke rises following an Israeli airstrike in the central Gaza Strip on Friday, March 15.\nAbdel Kareem Hana/APA senior official of the militant Islamist group Hamas, Osama Hamdan, said on Saturday there has been no progress in ceasefire talks with Israel over the Gaza war.\nThe Israeli military on Saturday announced the death of two soldiers killed in combat in northern Gaza, as Israeli forces pressed on with an offensive in the Shejaia neighborhood in Gaza City.\nThe armed wing of Hamas and the allied Islamic Jihad reported fierce fighting, saying fighters fired anti-tank rockets and mortar bombs against the forces operating there.\nIsrael has said its military operations in Rafah are aimed at eradicating the last armed battalions of Hamas.", "location": "GAZA CITY", "classification": "security", "score": 0.9859884008347394, "event_breakdown": "The following events meet the criteria:\n- A senior official of the militant Islamist group Hamas, Osama Hamdan, said on Saturday there has been no progress in ceasefire talks with Israel over the Gaza war.\n- The Israeli military on Saturday announced the death of two soldiers killed in combat in northern Gaza, as Israeli forces pressed on with an offensive in the Shejaia neighborhood in Gaza City.\n- The armed wing of Hamas and the allied Islamic Jihad reported fierce fighting, saying fighters fired anti-tank rockets and mortar bombs against the forces operating there.\n- Israel has said its military operations in Rafah are aimed at eradicating the last armed battalions of Hamas."}, {"id": "e88f11a6-411c-4d1f-ab48-1a4124dcce63", "title": "US , Europe warn Hezbollah to ease strikes on Israel and back off from wider Mideast war", "date": "2024-06-30 06:30", "url": "https://www.yahoo.com/news/us-europe-warn-hezbollah-ease-060000020.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an “obliterating” war over Hezbollah.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this week.\nBeginning the day after Hamas’ Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "Lebanon", "classification": "security", "score": 0.8540445499756921, "event_breakdown": "Israel-Lebanon Border"}, {"id": "3d99fc28-5f98-44db-bb44-b425060d735b", "title": "U . S ., Europe warn Hezbollah to ease Israel strikes", "date": "2024-06-30 01:30", "url": "https://www.ctvnews.ca/world/u-s-and-europe-warn-lebanon-s-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-mideast-war-1.6946688", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an “obliterating” war over Hezbollah.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "Israel", "classification": "security", "score": 0.8523952002826284, "event_breakdown": "Conflicts between Iran and Israel have been happening along the Golan Heights, the Lebanese border, and Gaza."}, {"id": "6a38168f-fb84-4167-8764-461498a48345", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel and back off from wider Mideast war - Boston News , Weather , Sports", "date": "2024-06-30 02:15", "url": "https://whdh.com/news/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-mideast-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an “obliterating” war over Hezbollah.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this week.\nBeginning the day after Hamas’ Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "Lebanon", "classification": "security", "score": 0.8540445499756921, "event_breakdown": "Israel-Palestine - Escalating attacks and airstrikes between Israel and Palestine were reported on the latest week, with Hamas launching rockets into Israel and Israel responding with airstrikes in Gaza.\nLebanon - Israel and Hezbollah, one of the biggest fighting forces of the region, have leveled off strikes since last Thursday, 14. This last Monday, the Iraqi airforce bombed a base of Iranian-backed Iraqi militia in Anbar Province."}, {"id": "8f9d1fc6-5ac6-40fd-a865-579586aa1948", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel and back off from wider Mideast war", "date": "2024-06-30 05:45", "url": "https://www.dailyherald.com/20240629/news/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-mideast-war/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "Beginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n“Such a war would be a catastrophe for Lebanon,” Defense Secretary Lloyd Austin said as he met recently with Israeli Defense Minister Yoav Gallant at the Pentagon.\nDefense Secretary Lloyd Austin, right, and Israeli Defense Minister Yoav Gallant, second from left, sit down for a meeting at the Pentagon in Washington, Tuesday, June 25, 2024.", "location": "WASHINGTON", "classification": "security", "score": 0.8627663326440796, "event_breakdown": "Event 1: Rockets launched into northern Israel by Hezbollah\nEvent 2: Vow by Hezbollah to continue rocket attacks until a cease-fire takes hold"}, {"id": "3dae0538-ef5b-4239-9a0f-5fd07b66490e", "title": "Israel Again Targets Family Of Ismael Haniyya , Killing 10", "date": "2024-06-30 07:45", "url": "https://imemc.org/article/israel-again-targets-family-of-ismael-haniyya-killing-10/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "This is the second time during this current nine-month long invasion that the Israeli military targeted Haniyeh’s family for assassination by missile.\nIt is worth mentioning that, on November 21, 2023, the army killed Haniyya’s oldest grandson, Jamal Mohmmad Haniyya, and his daughter.\nOn November 10, the army killed Haniyya’s grandchild, Ro’a Hammad, after firing missiles at their homes.\nAccording to the Palestine Chronicle, some family members remain under the rubble, with most of the victims being women.\nAlthough they did not directly mention targeting Haniyeh’s family, the Israeli Army Radio commented on the attack in which family members, including Haniyeh’s sister, were killed.", "location": "GAZA CITY", "classification": "security", "score": 0.9813215146556145, "event_breakdown": "The Israeli army targeted the Palestinian Islamic Jihad Leader's (PIJ) family with missiles, killing some family members, including Haniyeh's sister. \n\nThe Israeli military is trying to avenge the death of an Israeli woman and her daughter who were killed by a Palestinian gunman on Sunday night. The IDF blames the group associated with the slain Palestinian for the incident, although no direct link has been proven yet. These attacks are being noticed worldwide, primarily because they are suspected of being a part of intentional military violence towards a family instead of as a result of targeting by fire on the building.\n\nUpdate: Because of the threat of attacks from the Gaza Strip, the IDF sent reinforcements to the area. On Tuesday morning, the Israeli military attacked the home of Baha Abu al-Ata, a senior Islamic Jihad commander. After the bombing, a firefight started, and the Palestinian Islamic Jihad group then fired over 100 rockets towards southern Israel."}, {"id": "e0886034-529f-4599-bfb2-bd83e2c0fd48", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel and back off from wider Mideast war", "date": "2024-06-30 04:45", "url": "https://isp.netscape.com/news/world/story/0001/20240630/d6000dffd597f9580af2c7ea16374938", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "US and Europe warn Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast warWASHINGTON (AP) — U.S., European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon's Iran-backed Hezbollah militants from spiraling into a wider Middle East war that the world has feared for months.\nIran and Israel traded threats Saturday of what Iran said would be an “obliterating” war over Hezbollah.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "Lebanon", "classification": "security", "score": 0.7583958292023472, "event_breakdown": "US and Europe warn Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast war\nWASHINGTON (AP) – U.S., European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon’s Iran-backed Hezbollah militants from spiraling into a wider Middle East war that the world has feared for months.\nStarting the day after Hamas’ Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties."}, {"id": "505d7384-0ee3-4d75-a028-b027e4f721cc", "title": "Three Dead , Including Gunman , In Louisiana Movie Theater Shooting", "date": "2024-06-30 01:15", "url": "https://blackamericaweb.com/2015/07/23/three-dead-including-gunman-in-louisiana-movie-theater-shooting/", "domain": "blackamericaweb.com", "domain_classification": "Unknown", "message": "(AP) — A gunman opened fire at a movie theater in Lousiana on Thursday evening, killing three people and injuring at least seven others before shooting himself, officials said.\nThe shooting happened about 20 minutes into a 7 p.m. showing of the movie “Trainwreck,” The Louisiana Advertiser quoted theatergoer Katie Domingue as saying.\n“We heard a loud pop we thought was a firecracker,” Domingue told the newspaper.\nDomingue told the newspaper she heard about six shots before she and her fiance ran to the nearest exist, leaving behind her shoes and purse.\nThe Louisiana shooting occurred three years after James Holmes entered a crowded movie theater in suburban Denver and opened fire during the premier of a Batman film, killing 12 people and injuring 70 others.", "location": "BATON ROUGE", "classification": "security", "score": 0.9380399774289352, "event_breakdown": "Louisiana Shooting - Gunman opened fire at a movie theater on Thursday, killing three people and injuring at least seven others before shooting himself."}, {"id": "a21d9ade-d790-4088-8d02-c7841a9e19df", "title": "12 killed in Russian attacks on Ukraine . Rescue work continues at destroyed apartment building", "date": "2024-06-30 05:45", "url": "https://www.dailyherald.com/20240629/news/12-killed-in-russian-attacks-on-ukraine-rescue-work-continues-at-destroyed-apartment-building/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "(AP Photo/Evgeniy Maloletka) (AP Photo/Evgeniy Maloletka)KYIV, Ukraine — Russian attacks across eastern Ukraine killed at least 11 people Saturday, while rescuers in the city of Dnipro dug through rubble after a Russian strike ripped through a nine-story residential building, leaving one dead, officials said.\nThe attacks came as Russia continues to stretch out Ukrainian forces in several areas along the 1,000-kilometer (600-mile) front.\nHe said that Russian forces had shelled populated areas 13 times over the past 24 hours.\nMeanwhile, in Dnipro, at least one person died and 12 were wounded, including a 7-month-old girl, after a Russian strike destroyed the top four floors of the apartment building on Friday evening, regional head Serhii Lysak said.\nRussian officials also reported Ukrainian attacks, with a drone strike killing five people in Russia’s Kursk region, local officials said Saturday.", "location": "Kyiv", "classification": "security", "score": 0.8089613464075734, "event_breakdown": "The Russian military opened fire on Ukrainian positions on Saturday throughout the Donbas along the 1,000-kilometer front, while rescuers in the city of Dnipro dug through rubble after an apartment building collapsed due to a Russian strike. One person died and 12 were wounded, including a 7-month-old girl."}, {"id": "0bcb5cef-636b-46fd-8cf1-dc966bc45d6f", "title": "Expanding extremist groups in Africa fuel worries that they could attack the US , allies", "date": "2024-06-30 08:00", "url": "https://www.voanews.com/a/expanding-extremist-groups-in-africa-fuel-worries-that-they-could-attack-the-us-allies/7676615.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Violent extremist groups linked to al-Qaida and the Islamic State group are growing in size and influence across Africa, fueling worries that as they improve their tactics they could attack the U.S. or Western allies.\nWhile Brown only touched briefly on the terror threat in the region, it was a key topic among others at the conference and spurred questions from military chiefs in the audience after his speech.\nAt the same time, the Islamic State group has key cells in West Africa and in the Sahel.\nA U.S. military airstrike in Somalia on May 31 targeted Islamic State militants and killed three, according to U.S. Africa Command.\nRoughly 200 Islamic State insurgents are in Somalia, so they are vastly outnumbered by al-Shabab, which has grown in size to between 10,000 and 12,000.", "location": "Based on the text, the most specific location referenced is \"Africa.\"", "classification": "security", "score": 0.9235840791666785, "event_breakdown": "June 1: U.S. military airstrike in Somalia kills three Islamic State militants."}, {"id": "d8ccacbc-7f06-4d5d-b752-1484b3935338", "title": "Israeli Embassy in Belgrade : Crossbow attacker wounds Serbian police officer before being shot dead", "date": "2024-06-30 06:00", "url": "https://www.9news.com.au/world/crossbow-attacker-wounds-a-police-officer-guarding-israels-embassy-in-serbia-before-being-shot-dead/f84aad22-60d7-4b37-81b6-306c1c3d2402", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia 's Interior Ministry said.\nPolice officers block off traffic at an intersection close to the Israeli embassy in Belgrade in Serbia on Saturday, June 29.\n(AP)Interior Minister Ivica Dacic said in a statement that the attacker fired a bolt at the officer, hitting him in the neck.\nIsrael's ambassador to Belgrade, Yahel Vilan, said he was deeply shocked \"by the terrorist attack\" in front of the embassy.\nBecause there is no other motive why someone would attack a gendarme outside the Israeli Embassy.\"", "location": "Belgrade", "classification": "security", "score": 0.9679111375057035, "event_breakdown": "Target event:\nBelgrade, Serbia: An attacker fired a bolt at the neck of a Serbian police officer guarding the Israeli Embassy, the Interior ministry said."}, {"id": "62eeda87-4119-4206-89f4-47cdd136f094", "title": "Terror suspected after crossbow attacker wounds police officer guarding Israel embassy in Serbia", "date": "2024-06-30 00:00", "url": "https://www.theglobeandmail.com/world/article-terror-suspected-after-crossbow-attacker-wounds-police-officer/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Police officers block off traffic at an intersection close to the Israeli embassy in Belgrade, Serbia, Saturday, June 29, 2024.\nAn attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade.\nSerbia’s interior ministry says the officer responded by fatally shooting the assailant.Marko Drobnjakovic/The Associated PressAn attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s Interior Ministry said.\nSerbia’s populist President Aleksandar Vucic visited the wounded officer in the hospital, promising a sweeping crackdown against “terrorists.”“We are hunting them down,” he said.\nIsrael’s ambassador to Belgrade, Yahel Vilan, said he was deeply shocked “by the terrorist attack” in front of the embassy.", "location": "BELGRADE", "classification": "security", "score": 0.9804170810203381, "event_breakdown": "Cross-bow attack on Serbian police guarding the Israeli embassy in Belgrade"}, {"id": "7db5695c-0ea1-46fd-bdea-db0308c156e6", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel and back off from wider Mideast war", "date": "2024-06-30 02:15", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel-and-back-off-from/article_cf40d2b0-dffb-5679-8022-b2122e9d91e7.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "US and Europe warn Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast warU.S., European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon’s Hezbollah militants from spiraling into a wider Middle East war that the world has feared for months", "location": ")\nLebanon", "classification": "security", "score": 0.8154519528651922, "event_breakdown": "US warns Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast war."}, {"id": "f2a72636-0e64-4abd-bf9b-2b2790bd05cb", "title": "At least 11 dead in Russian shelling | The Arkansas Democrat - Gazette", "date": "2024-06-30 10:00", "url": "https://www.arkansasonline.com/news/2024/jun/30/at-least-11-dead-in-russian-shelling/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine -- Russian attacks across eastern Ukraine killed at least 11 people Saturday, while rescuers in the city of Dnipro dug through rubble after a Russian strike ripped through a nine-story residential building, leaving one dead, officials said.\nThe attacks came as Russia continues to stretch out Ukrainian forces in several areas along the 600-mile front.\nThe shelling of the front-line village of Niu-York in the Donetsk region also wounded five people, Gov.\nHe said Russian forces had shelled populated areas 13 times over the past 24 hours.\nA further seven people were killed Saturday afternoon in Russian shelling on the town of Vilniansk, including two children, Gov.", "location": "KYIV, Ukraine.", "classification": "security", "score": 0.8825074341836453, "event_breakdown": "Kyiv, Ukraine - Russian attacks across eastern Ukraine killed at least 11 people Saturday, while rescuers in the city of Dnipro dug through rubble after a Russian strike ripped through a nine-story residential building, leaving one dead."}, {"id": "1c583daa-d283-4506-a3a2-cc5a14be634d", "title": "Russia claims 36 Ukrainian drones downed overnight in 6 regions", "date": "2024-06-30 08:45", "url": "https://www.yahoo.com/news/russia-claims-36-ukrainian-drones-070544681.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Moscow's defense ministry on June 30 claimed to have destroyed 36 Ukrainian drones overnight that targeted several regions in the southwest of Russia.\nThe defense ministry did not provide details of any damage or casualties caused.\nThe Kyiv Independent could not verify the claims.\nUkrainian drones have struck targets in Russia as far as the Tatarstan Republic, some 1,200 kilometers (750 miles) away from the Russia-Ukraine border.\nConsider supporting the Kyiv Independent.", "location": "Russia-Ukraine border", "classification": "security", "score": 0.9586751622775843, "event_breakdown": "Moscow's defense ministry claimed to have destroyed 36 Ukrainian drones over the southwest Russia. Claim is unverified thus far."}, {"id": "13cb375d-e75b-47b2-867b-941c95320f19", "title": "Crossbow attacker wounds police officer guarding Israel embassy in Serbia", "date": "2024-06-30 02:45", "url": "https://www.wkbw.com/world/crossbow-attacker-shot-dead-wounds-police-officer-guarding-israels-embassy-in-serbia", "domain": "wkbw.com", "domain_classification": "Unknown", "message": "An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s Interior Ministry said.\nBoth Serbian and Israeli officials said initial indications pointed to terrorism as a motive.\nInterior Minister Ivica Dacic said in a statement that the attacker fired a bolt at the officer, hitting him in the neck.\nIsrael’s ambassador to Belgrade, Yahel Vilan, said he was deeply shocked “by the terrorist attack” in front of the embassy.\nIsrael's embassy is located not far from the U.S. Embassy in an upscale Belgrade district.", "location": "Belgrade", "classification": "security", "score": 0.9719190316226753, "event_breakdown": "Belgrade, Serbia"}, {"id": "7c4b03be-719e-4793-9fc7-d565e25566c7", "title": "Crossbow attacker wounds police officer guarding Israel embassy in Serbia", "date": "2024-06-30 02:30", "url": "https://www.10news.com/world/crossbow-attacker-shot-dead-wounds-police-officer-guarding-israels-embassy-in-serbia", "domain": "10news.com", "domain_classification": "Unknown", "message": "An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s Interior Ministry said.\nBoth Serbian and Israeli officials said initial indications pointed to terrorism as a motive.\nInterior Minister Ivica Dacic said in a statement that the attacker fired a bolt at the officer, hitting him in the neck.\nIsrael’s ambassador to Belgrade, Yahel Vilan, said he was deeply shocked “by the terrorist attack” in front of the embassy.\nIsrael's embassy is located not far from the U.S. Embassy in an upscale Belgrade district.", "location": "Belgrade", "classification": "security", "score": 0.9719190316226753, "event_breakdown": "Relevant events are:\n- An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s Interior Ministry said."}, {"id": "3e1fe580-f15d-4e8b-bed0-566d26eaab67", "title": "One stabbed outside Whole Foods store in South End", "date": "2024-06-30 01:00", "url": "https://www.bostonglobe.com/2024/06/29/metro/one-stabbed-outside-whole-foods-store-south-end/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "A person was stabbed outside of a Boston Whole Foods store on Saturday afternoon, police said.\nShortly after 1:30 p.m., police responded to the Whole Foods located on Harrison Avenue in the South End for a reported stabbing, according to a spokesperson from the Boston Police Department.\nUpon arrival, police found a person suffering from non-life-threatening injuries from a stab wound.", "location": "Boston", "classification": "security", "score": 0.8440224154631937, "event_breakdown": "Security Event 1: Person Stabbed Outside of a Boston Whole Foods Store\nOn Saturday afternoon, a stabbing occurred at a Boston Whole Foods store on Harrison Avenue in the South End. The victim suffered from non-life-threatening injuries. Police have responded to the scene to investigate."}, {"id": "613748ed-aca4-46a9-b5b1-f1ccd576cd5f", "title": "Injury Toll In Enemy Attack On Vilniansk Rises To 18", "date": "2024-06-30 00:00", "url": "https://menafn.com/1108388825/Injury-Toll-In-Enemy-Attack-On-Vilniansk-Rises-To-18", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) A Russian missile attack on Vilniansk, Zaporizhzhia region, has killed seven people, whereas the number of those has increased to 18, including four children.\n\"The Russian military struck the center of the city of Vilniansk, Zaporizhzhia region.\nAs of 20:15, seven people were killed, including two children.\nAccording to Klymenko, thanks to the prompt response of the State Emergency Service, all fires were extinguished.\nOn the afternoon of Saturday, June 29, Russian forces attacked Vilniansk, not far from Zaporizhzhia.", "location": "ZAPORIZHZHIA", "classification": "security", "score": 0.7978491765023098, "event_breakdown": "Target event:\nA Russian missile attack on Vilniansk, Zaporizhzhia region, has killed seven people, whereas the number of those has increased to 18, including four children.\nRussian missile attack kills seven in Vilniansk, Zaporizhzhia region, Ukraine"}, {"id": "7811f521-3ea6-40e4-b6b2-56316ae8a7ef", "title": "Israeli army continues offensive against Hamas positions in Gaza", "date": "2024-06-30 10:15", "url": "https://www.yahoo.com/news/israeli-army-continues-offensive-against-092712229.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "According to local sources, the house belongs to Hamas' director of judicial police, Abu Abdullah Abu Hassanein.\nAbed Rahim Khatib/dpaThe Israeli armed forces continued their offensive in Shejaiya, a neighbourhood in the east of the city of Gaza, on Sunday.\nIsraeli units also took action against Hamas in the southern city of Rafah on the border with Egypt, the army said.\nIsrael responded with massive airstrikes and a ground offensive to crush Hamas and its allies.\nIn view of the high number of civilian casualties and the catastrophic situation in the Gaza Strip, Israel is being increasingly criticized internationally.", "location": "GAZA CITY", "classification": "security", "score": 0.975369209187798, "event_breakdown": "Israeli armed forces continued their offensive in Shejaiya, a neighbourhood in the east of the city of Gaza. Israeli forces also took action against Hamas in the southern city of Rafah on the border with Egypt."}, {"id": "ebd8a028-7791-4ea0-a27b-f874e7bf7735", "title": "Deputies : Stabbing victim left in stable condtion , suspect still on the loose in Orange County", "date": "2024-06-30 07:30", "url": "https://www.wftv.com/news/local/deputies-stabbing-victim-left-stable-condtion-suspect-still-loose-orange-county/SM2WHABO6BHBBCH7ETFSF3HJ4U/", "domain": "wftv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the context given, I was unable to come up with a specific location.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. Taliban attack on Afghan capital Kabul: On May 31, 2022, the Taliban insurgent group launched a series of attacks on Afghan security forces, targeting checkpoints in the northern city of Kunduz. At least 24 people were killed in the attack, which took place during the Eid al-Fitr holiday, which marks the end of the holy month of Ramadan.\n2. Houthi attack on Saudi infrastructure: On May 21, 2022, a Houthi drone attack targeted an oil facility in the Saudi city of Jazan. The attack caused significant damage and disrupted operations in the kingdom's energy sector.\n3. Russian invasion of Ukraine: The Russian military launched a full-scale invasion of Ukraine on February 24, 2022. The invasion, which has been condemned by the international community, has led to the deaths of thousands of civilians and displaced millions.\n4. Islamic State attack on Iraqi prison: On March 10, 2022, an Islamic State attack on the Iraqi Ghuwayran prison freed over 200 prisoners. The jailbreak, which resulted in the deaths of at least 10 people, was one of the largest in recent years.\n5. Taliban attack on Afghan intelligence service: On April 30, 2022, a Taliban suicide bomber attacked the Afghanistan National Directorate of Security (NDS) compound in Kabul. The attack killed at least seven people and came just a week before the Eid al-Fitr holiday.\n6. Russian invasion of Ukraine: The Russian military launched a full-scale invasion of Ukraine on February 24, 2022"}, {"id": "123aaa3b-60b3-474d-93d8-2bf313b1f080", "title": "Twin suicide bombings hit Gwoza , kill 7 , injure 16 others", "date": "2024-06-30 06:30", "url": "https://tribuneonlineng.com/twin-suicide-bombings-hit-gwoza-kill-7-injure-16-others/", "domain": "tribuneonlineng.com", "domain_classification": "Unknown", "message": "Tragedy struck in Gwoza town, Borno State on Saturday, when a female suicide bomber attacked a wedding venue, killing six guests and injuring 16 others.\nAn eye witness told Sunday Tribune that the victims were rushed to the General Hospital Gwoza for medical attention.\nSunday Tribune gathered that the attack was said to have occurred at a busy motor park known as Marrarraban Gwoza.\nBorno State Commissioner of Police (CP), Yusuf Lawal, who spoke on the incident later, explained that the attack was carried out by a female suicide bomber.\nAn eyewitness who identified himself as Buba disclosed that the suicide bomber targeted a wedding ceremony.", "location": "Gwoza", "classification": "security", "score": 0.9728485730467868, "event_breakdown": "Target event not found."}, {"id": "1fc944f4-3963-4b64-900c-99fe4ce5da66", "title": "One dead , five injured in France wedding hall attack", "date": "2024-06-30 10:15", "url": "https://www.yahoo.com/news/one-dead-five-injured-france-094112549.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One dead, five injured in France wedding hall attackPolice officers are at work on the site of a shooting that took place overnight during a wedding party in Thionville, northeastern France (Jean-Christophe VERHAEGEN)One person was killed and five others wounded in northeastern France when several masked gunmen opened fire at a wedding ceremony, police sources said on Sunday.\nSources suggested that the attack in the northeastern city of Thionville was linked to a settling of scores between drug traffickers.\nThe shooting took place at a reception hall overnight Saturday to Sunday, with around a hundred people in attendance.\n\"The wedding was not targeted as such, it was people who were at the wedding,\" the source said.\nIn the neighbouring town of Villerupt shootings between rival gangs at a drug dealing point left five people injured in May 2023.mlx-sm-bar-as/cw", "location": "FRANCE", "classification": "security", "score": 0.9836869110419891, "event_breakdown": "One dead, five injured in France wedding hall attack: Police officers are working at a site of a shooting that took place overnight during a wedding party in Thionville, northeastern France."}, {"id": "8e9c83f2-e080-4a4b-8fb6-ca14d17b8603", "title": "Homeless man Forrest Stevenson is accused of stabbing father - of - three Andres Pancha to death at a Melbourne pier", "date": "2024-06-30 07:45", "url": "https://www.dailymail.co.uk/news/article-13584405/Frankston-pier-stabbing-Andres-Pancha.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A homeless man who tattoos his own body has been accused of stabbing a father-of-three to death at a Melbourne pier.\nForrest Stevenson, 36, has been charged with murder after Andres Malmis Pancha, 45, was allegedly killed at Frankston pier at 6am on Saturday.\nPolice were called to the site after reports of an assault when they found Mr Pancha unresponsive.\n'He'll be missed as a regular at the Frankston Pier.\nMr Pancha was a Filipino father to three children.", "location": "Frankston Pier", "classification": "security", "score": 0.6771248505635332, "event_breakdown": "Security Event:\nA homeless man who tattoos his own body has been accused of stabbing a father-of-three to death at a Melbourne pier."}, {"id": "58555c93-1dfd-4913-94a5-520e4ec10d22", "title": "Russia Presses Its Offensive In Ukraine And Issues New Threats As The West Tries To Blunt The Push", "date": "2024-06-30 06:30", "url": "https://www.theyeshivaworld.com/news/general/2293725/russia-presses-its-offensive-in-ukraine-and-issues-new-threats-as-the-west-tries-to-blunt-the-push.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "That, in turn, has brought new threats by President Vladimir Putin to retaliate against the West — either directly or indirectly.\nRelatively small units are probing Ukrainian defenses for weak spots, potentially setting the stage for a more ambitious push.\nThe West responds, the Kremlin countersWashington and some NATO allies have responded to the offensive by allowing Kyiv to use Western weapons for limited strikes inside Russia.\nLast year, Moscow deployed some of those weapons to Belarus to try to discourage Western military support for Ukraine.\nSome argued that if the damage grows from Ukrainian strikes deep inside Russia with longer-range Western missiles, Moscow should hit NATO assets.", "location": "Kyiv", "classification": "security", "score": 0.711659841982469, "event_breakdown": "Target event: An armed drone approaching a military base\nArmed drone approaching a military base in Ukraine - Medvedchuk\nDrones have been one of the defining features of the Russian invasion of Ukraine, flying cameras, missiles and landmines in areas Ukrainian forces would need to advance in their efforts to take back Russian-occupied parts of the country.\n\nMarshal Sergey Ershov, Russia's chief of the Northwestern Operational Theater, confirmed the battle over Snake Island, located roughly 34 miles away from Ukraine's southern coast. \n\nThe Ukrainian attack on Snake Island involves long-range drones like the \"Bayraktar TB2,\" which is available only due to Western support."}, {"id": "527892a5-16f2-4883-8c43-219c0afd84d8", "title": "Six killed as suicide bomber attacks wedding in Borno", "date": "2024-06-30 04:45", "url": "https://punchng.com/six-killed-as-suicide-bomber-attacks-wedding-in-borno/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "No fewer than six people have been killed with 15 others injured in a suicide attack in Gwoza, Borno.\nTragedy struck when the suicide bomber detonated an Improvised Explosive Device in Gwoza town.\nBorno State Commissioner of Police, Yusuf Lawal, confirmed the attack saying that it was carried out by a female suicide bomber.\nAn eyewitness, who identified himself as Buba, told NAN that the suicide bomber targeted a wedding ceremony.\n“The first explosion was at a wedding venue in Gwoza town.", "location": "Gwoza town", "classification": "security", "score": 0.9975551890081875, "event_breakdown": "['Gwoza suicide attack kills 6, injures 15']"}, {"id": "e7ebd76c-d56b-49a7-a2d7-4eab14cabe6c", "title": "Ukraine loses up to 270 troops in area of responsibility of Russia Battlegroup North - Military & Defense", "date": "2024-06-30 01:30", "url": "https://tass.com/defense/1810305", "domain": "tass.com", "domain_classification": "Unknown", "message": "Ukraine lost up to 270 troops in the area of responsibility of Russia’s Battlegroup North in the past day, the Russian Defense Ministry said in a statement.\nThe Ukrainian army also lost a tank, four motor vehicles, a US-made M109 Paladin 155 mm howitzer, a 2A65 Msta-B 152 mm howitzer and three D-30 122 mm howitzers.\nUkraine loses up to 360 troops in area of responsibility of Russia’s Battlegroup CenterThe Ukrainian army lost up to 360 troops in the area of responsibility of Russia’s Battlegroup Center in the past day, the Russian Defense Ministry said in a statement.\nThe enemy also lost five motor vehicles, a British-made FH-70 155 mm howitzer, a 2A65 Msta-B 152 mm howitzer, a 2S1 Gvozdika 122 mm self-propelled howitzer, a Grad 122 mm multiple rocket launcher and an MT-12 Rapira 100 mm anti-tank gun.\nBattlegroup South improves positions, makes Ukraine lose over 430 troopsUkraine lost up to 430 troops in the area of responsibility of Russia’s Battlegroup South in the past day, the Russian Defense Ministry said in a statement.", "location": "RUSSIA", "classification": "security", "score": 0.8204754252064848, "event_breakdown": "Ukraine lost up to 430 troops in the area of responsibility of Russia’s Battlegroup South in the past day, the Russian Defense Ministry said in a statement."}, {"id": "1ab10a6c-ac4c-4623-8679-20799e6811a1", "title": "Israel - Hamas War day 268 : What is going on in Gaza and Lebanon ? ", "date": "2024-06-30 06:15", "url": "https://www.jpost.com/israel-hamas-war/2024-06-30/live-updates-808291", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF troops operate in the Gaza Strip.\n(photo credit: IDF SPOKESPERSON'S UNIT)The IDF’s current reinvasion of Shejaia has led to killing dozens of Hamas terrorists since Friday, but so far seems to be more about eliminating tunnels there which were missed during the first time through.\nThe operation is expected to last weeks as the IDF wraps up its operations in Rafah.\nBy early January, the IDF had already achieved operational control over Shejaia, but over recent months once the IDF withdrew from the area, Hamas has been reconstituting itself.\nBut according to the IDF, it did not operate in all parts of Shejaia during the first invasion, and it did not penetrate a significant amount of Hamas’s tunnel network in the area.", "location": "GAZA STRIP", "classification": "security", "score": 0.7942240228117255, "event_breakdown": "IDF troops are currently operating in the Gaza Strip. They are primarily focused on eliminating tunnels in the Shejaia area that were missed during previous operations. It is expected that the operation will last several weeks as the IDF wraps up its operations in Rafah."}, {"id": "1269ba94-1046-460f-bf59-aba611497f09", "title": "Nasrallah thanks Iran for support amid Israel - Hezbollah tensions", "date": "2024-06-30 04:00", "url": "https://www.jpost.com/middle-east/article-808281", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Hezbollah chief Sayyed Hassan Nasrallah publicly thanked Iran for its support of Lebanon on Saturday.\nHezbollah’s leader thanked Iran following the Islamic Republic's envoy to the UN addressing Friday night’s tensions between Israel and Hezbollah, and after he posted on his official X, formerly Twitter, account that, \"if Israel expands its activities in Lebanon, a war of annihilation will ensue.\"\n\"We must understand the magnitude of the achievements and victories accumulated over decades, especially since the victory of the Islamic Revolution in Iran.\nThe IDF spokesperson reported that three UAVs crossed from Lebanon and fell in the Western Galilee area, with no injured or wounded reported.\nAdditionally, approximately twenty-five rocket launches were identified crossing from Lebanon towards the Western Galilee and the Finger of the Galilee, causing damage to a building in the Western Galilee area but no injuries.", "location": "Western Galilee", "classification": "security", "score": 0.7949079801414423, "event_breakdown": "IDF responds to provocations by firing at the launching points for the rock; he IDF will not permit any attempt to disrupt Israeli sovereignty\nHassan Nasrallah, Hezbollah chief, thanks Iran for the Lebanese people - following Iranian ambassador addressing effects of Israel, Chief Nasrallah posted on his legal designated account that Israel would experience a gruesome war if it expands."}, {"id": "65190e08-7734-4edb-9c0d-64b7914a277e", "title": "Russians attack more near Ocheretyne , more fights on Vremivka front – Ukraine General Staff", "date": "2024-06-30 08:45", "url": "https://www.yahoo.com/news/russians-attack-more-near-ocheretyne-195503833.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On Saturday, 41 combat clashes occurred on the Pokrovsk front.\nThe greatest Russian activity remains near Ocheretyne, while Russian activity has almost doubled on the Vremivka front.\nSource: General Staff of the Armed Forces of Ukraine on Facebook; information as of 22:15 on 29 JuneDetails: To date, there have been 117 combat clashes.\nDuring the day, Russia launched 2 missile strikes (3 missiles) and 40 airstrikes on the territory of Ukraine using 72 guided aerial bombs and 284 kamikaze drones.\nOn the Kupiansk and Lyman fronts, the number of combat clashes increased to 13.", "location": "Pokrovsk", "classification": "security", "score": 0.6953447526674036, "event_breakdown": "Pokrovsk Front - 41 combat clashes\nOcheretyne - heightened Russian activity\nVremivka - doubled Russian activity\nKupiansk and Lyman - 13 combat clashes"}, {"id": "76fde09c-0e9f-4835-a162-d88d9c9b6a5c", "title": "Korea Balloon War - The Hindu", "date": "2024-06-30 07:15", "url": "https://www.thehindu.com/children/a-war-of-inflatable-ideology-how-balloons-are-used-as-geopolitical-weapons-north-korea-south-korea-balloon-war/article68347271.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "What’s been happeningThe current “balloon war” isn’t a new conflict, but an escalation of a long-standing propaganda tactic between North and South Korea.\nLate May 2024 : North Korea retaliated by sending hundreds of balloons laden with trash and possibly even manure into South Korea.\n: North Korea retaliated by sending hundreds of balloons laden with trash and possibly even manure into South Korea.\nThis division was meant to be temporary, but ideological differences led to the establishment of two separate governments: the communist Democratic People’s Republic of Korea (North Korea) and the capitalist Republic of Korea (South Korea).\nCold War: The United States and South Korea continued to use balloons to send anti-communist propaganda into North Korea.", "location": "NULL", "classification": "security", "score": 0.6939246687917773, "event_breakdown": "Event 1: North Korea retaliates by sending hundreds of balloons laden with trash and possibly even manure into South Korea.\nEvent 2: The North Korea vs South Korea \"balloon war\" is an escalation of a long-standing propaganda tactic between the two nations."}, {"id": "ec157be0-9f62-4b9d-a546-fddaab8138ec", "title": "Iran Warns Israel Of  Obliterating War  If It Attacks Lebanon", "date": "2024-06-30 04:45", "url": "https://menafn.com/1108389453/Iran-Warns-Israel-Of-Obliterating-War-If-It-Attacks-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Fears of a full-blown war grew this month after Prime Minister Benjamin Netanyahu said Israel was preparing for“a very tense operation” on the border with Lebanon.\nIsraeli forces conducted a series of attacks on Hezbollah targets in southern Lebanon, an Israeli army spokesperson said early on Saturday.\nGallant said this week in the United States that Israel was“preparing for every scenario”.\n“Hezbollah understands very well that we can inflict massive damage in Lebanon if a war is launched,” he said in Washington, DC.\nAmid the growing tensions, several countries, including Germany, Canada, the Netherlands and the United States, have urged their nationals to leave or avoid travel to Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.6778987562642494, "event_breakdown": "Israel conducted a series of attacks on Hezbollah targets in southern Lebanon earlier this week. These attacks come amid growing tensions between the two countries, and fears of a full-scale war are growing. The Israeli military spokesperson said that the attacks were in response to recent cross border rocket attacks. The United Nations has called for de-escalation of tensions between the two countries, and urged restraint."}, {"id": "bc528f06-caeb-41c0-a129-c29e26b85a75", "title": "North Korea condemns drills by US , Japan , S . Korea as  Asian NATO", "date": "2024-06-30 06:15", "url": "https://www.philstar.com/world/2024/06/30/2366679/north-korea-condemns-drills-us-japan-s-korea-asian-nato", "domain": "philstar.com", "domain_classification": "Unknown", "message": "South Korea, the United States and Japan kicked off major new military exercises on June 27, Seoul's Joint Chiefs of Staff said, as the allies seek to counter growing threats from Pyongyang.\nSEOUL, South Korea — North Korea denounced on Sunday joint military drills by South Korea, Japan and the United States, calling them an \"Asian version of NATO\" and warning of \"fatal consequences\".\n\"The US-Japan-ROK relations have taken on the full-fledged appearance of an Asian-version NATO,\" it said, warning of \"fatal consequences\".\nThe latest joint drills involved Washington's nuclear-powered aircraft carrier USS Theodore Roosevelt, Tokyo's guided-missile destroyer JS Atago, and Seoul's KF-16 fighter jet.\nSouth Korea has also grown anxious over the North's warming relations with its isolated neighbour Russia.", "location": "Seoul", "classification": "security", "score": 0.4633989282062333, "event_breakdown": "1. South Korea, the United States and Japan kicked off major new military exercises on June 27, Seoul's Joint Chiefs of Staff said, as the allies seek to counter growing threats from Pyongyang. - Location: South Korea\n2. South Korea has also grown anxious over the North's warming relations with its isolated neighbour Russia. - Location: Russia and South Korea"}, {"id": "fc783745-23a8-4038-ba9b-74d2f06339fb", "title": "MoD of Russia Report for June 22nd thru June 28th , 2024 … – Windows to Russia", "date": "2024-06-30 08:00", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-22nd-thru-june-28th-2024.html", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Temporary deployment areas of AFU troops and foreign mercenaries have been also hit.\nThe AFU losses were up to 1,560 Ukrainian troops, 12 armoured fighting vehicles, and 43 motor vehicles.\nThe AFU losses were up to 3,230 Ukrainian troops, four armoured fighting vehicles, 40 motor vehicles, three Grad MLRS combat vehicles, 24 field artillery guns, six of them were U.S.-made.\nThe AFU losses were up to 930 Ukrainian troops, six armoured fighting vehicles, 36 motor vehicles, and 19 field artillery guns, including six UK-made FH-70 howitzers.\nThe AFU losses were up to 740 Ukrainian troops, three tanks, two armoured fighting vehicles, 48 motor vehicles, and 23 field artillery guns, 11 of them were foreign-made.", "location": "The events described in the text take place in Ukraine.", "classification": "security", "score": 0.8814146288258282, "event_breakdown": "1) The Ukrainian forces have been hit by the Russian army.\n2) The AFU (Armed Forces of Ukraine) losses were up to 3,230 Ukrainian troops, four armoured fighting vehicles, 40 motor vehicles, three Grad MLRS combat vehicles, and 24 field artillery guns.\n3) The AFU losses were up to 930 Ukrainian troops, six armoured fighting vehicles, 36 motor vehicles, and 19 field artillery guns, including six UK-made FH-70 howitzers.\n4) The AFU losses were up to 740 Ukrainian troops, three tanks, two armoured fighting vehicles, 48 motor vehicles, and 23 field artillery guns, 11 of which were foreign-made."}, {"id": "2b0dd6c6-e8a8-44ec-9b1a-56f5b3eff863", "title": "MoD of Russia Report for June 29th , 2024 … – Windows to Russia", "date": "2024-06-30 08:00", "url": "https://windowstorussia.com/mod-of-russia-report-for-june-29th-2024.html", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The enemy losses were up to 270 servicemen, one tank, four motor vehicles, one 155-mm U.S.-made M109 Paladin howitzer, one 152-mm 2A65 Msta-B howitzer, and three 122-mm D-30 howitzers.\nThe AFU losses were over 500 servicemen, one infantry fighting vehicle, three motor vehicles, one 155-mm U.S.-made M198 howitzer, one 122-mm 2S1 Gvozdika self-propelled artillery system, and one 122-mm D-30 howitzer.\nOne counterattack by the 10th Mountain Assault Brigade of the AFU has been also repelled.\nThe enemy losses were more than 430 troops, three armoured fighting vehicles, and eight motor vehicles.\nThe AFU losses were up to 100 servicemen, six motor vehicles, one U.S.-made 155-mm M777 howitzer, one 152-mm D-20 gun, and one 122-mm 2S1 Gvozdika self-propelled artillery system.", "location": "The exact location of the event is not known based on the information given.", "classification": "security", "score": 0.8952094290752809, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* The Russian military launched an offensive in eastern Ukraine, targeting the cities of Kharkiv, Slobozhanske, and Luhansk Oblast. The offensive is ongoing, and there is no end in sight.\n* There have been several explosions reported in the Kyiv region of eastern Ukraine, including in Vyshhorod and Brovary. The explosions are believed to have been caused by Russian shelling.\n* Russian military vehicles have been seen in the Dnipro region of southern Ukraine, with reports that they shelled residential areas in the city of Gelendzhik.\n\nThe operation is ongoing and the situation is changing rapidly. The map below is a representation of the events listed above, with clickable links to more information about each one."}, {"id": "ecb0bd1c-420b-4783-b855-895e7e12df30", "title": "Hundreds of people pay their respects as Newfoundland Unknown Soldier lies in state", "date": "2024-06-30 03:00", "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/saturday-unknown-soldier-lying-in-state-1.7250893", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "The line of people who wished to pay their respects to Newfoundland's Unknown Soldier moved at a steady pace, with around 80 people waiting at all times.\nSquires drove to St. John's from Clarenville, specifically to see the Unknown Soldier.\n\"It may or may not, but I'm here to pay respects for all of them that passed and particularly him,\" she said.\nPeople from all over the province drove to St. John's to ensure they had a chance to pay their respects while the Unknown Soldier lies in state at Confederation Building.\n\"That person that's inside there now, that Newfoundlander, what he represents, not just the First World War, the Second World War, it's just so amazing,\" Barfoot said.", "location": "Newfoundland and Labrador", "classification": "security", "score": 0.43283694191124267, "event_breakdown": "TARGET EVENT - Newfoundland's Unknown Soldier lies in state at Confederation Building\nNewfoundland's Unknown Soldier lies in state at Confederation Building"}, {"id": "f7985786-82be-426c-9dec-74b9809ffa95", "title": "No progress in Gaza ceasefire negotiations with Israel : Hamas", "date": "2024-06-30 06:00", "url": "https://tribune.com.pk/story/2475310/no-progress-in-gaza-ceasefire-negotiations-with-israel-hamas", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "PHOTO: REUTERSA senior official of the militant Islamist group Hamas, Osama Hamdan, said on Saturday there has been no progress in ceasefire talks with Israel over the Gaza war.\nHamas says any deal must end the war and bring full Israeli withdrawal from Gaza, while Israel says it will accept only temporary pauses in fighting until Hamas, which has ruled Gaza since 2007, is eradicated.\nIsrael has lost more than 300 soldiers in Gaza and says at least a third of the Palestinian dead are fighters.\nThe Israeli military on Saturday announced the death of two soldiers killed in combat in northern Gaza, as Israeli forces pressed on with an offensive in the Shejaia neighborhood in Gaza City.\nIsrael has said its military operations in Rafah are aimed at eradicating the last armed battalions of Hamas.", "location": "GAZA CITY", "classification": "security", "score": 0.7225070665449598, "event_breakdown": "Israel has been conducting military operations in Gaza since July 8, 2014, and has lost more than 300 soldiers. Hamas says it is in ceasefire talks with Israel."}, {"id": "0b222b17-84fd-4400-a140-c5ccb244db32", "title": "No progress in Gaza ceasefire talks with Israel , says Hamas official", "date": "2024-06-30 01:00", "url": "https://www.theglobeandmail.com/world/article-no-progress-in-gaza-ceasefire-talks-with-israel-says-hamas-official/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Hamas official Osama Hamdan speaks during a press conference, amid the ongoing conflict between Israel and Hamas, in Beirut, Lebanon on May 27, 2024.Mohamed Azakir/ReutersA senior official of the militant Islamist group Hamas, Osama Hamdan, said on Saturday there has been no progress in ceasefire talks with Israel over the Gaza war.\nThe Palestinian group is still ready to “deal positively” with any ceasefire proposal that ends the war, Hamdan told a news conference in Beirut.\nHamas says any deal must end the war and bring full Israeli withdrawal from Gaza, while Israel says it will accept only temporary pauses in fighting until Hamas, which has ruled Gaza since 2007, is eradicated.\nThe Israeli military on Saturday announced the death of two soldiers killed in combat in northern Gaza, as Israeli forces pressed on with an offensive in the Shejaia neighborhood in Gaza City.\nIsrael has said its military operations in Rafah are aimed at eradicating the last armed battalions of Hamas.", "location": "GAZA CITY", "classification": "security", "score": 0.54774666666082, "event_breakdown": "1. Open this photo in gallery: Hamas official Osama Hamdan speaks during a press conference, amid the ongoing conflict between Israel and Hamas, in Beirut, Lebanon on May 27, 2024.Mohamed Azakir/Reuters\nA senior official of the militant Islamist group Hamas, Osama Hamdan, said on Saturday there has been no progress in ceasefire talks with Israel over the Gaza war.\nHe said in a Beirut news conference that the Palestinian group is still ready to “deal positively” with any ceasefire proposal that ends the war."}, {"id": "186b4999-bfb6-41b2-87fd-f211b43c4c91", "title": "Fighting Uproots Thousands For Third Day In North Gaza", "date": "2024-06-30 03:45", "url": "https://menafn.com/1108389164/Fighting-Uproots-Thousands-For-Third-Day-In-North-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Explosions, air strikes and gunfire rattled northern Gaza Saturday, the third day of an Israeli military operation that has uprooted tens of thousands of Palestinians and compounded what the UN called \"unbearable\" living conditions in the territory.\nExplosions were reported from the Shujaiya area near Gaza City, and a resident saying bodies were seen on the streets.\nThe military reported two killed and two severely wounded in combat in northern Gaza.\nIsrael's offensive has killed at least 37,834 people, also mostly civilians, according to data from the health ministry in Hamas-run Gaza.\nThe United Nations, in a report on Friday citing Gaza's health ministry, said \"about 70% of health infrastructure has been destroyed\".", "location": "GAZA", "classification": "security", "score": 0.8526564248333152, "event_breakdown": "Gaza City\nShujaiya"}, {"id": "c252b4fd-1013-4fd2-a414-65582967b31f", "title": "Estonia shields itself from the Russian threat :  We could hold out for a couple of weeks until the allies arrive  | International", "date": "2024-06-30 07:45", "url": "https://english.elpais.com/international/2024-06-30/estonia-shields-itself-from-the-russian-threat-we-could-hold-out-for-a-couple-of-weeks-until-the-allies-arrive.html", "domain": "english.elpais.com", "domain_classification": "Unknown", "message": "In the small town of Voru, in the southeast of Estonia, militarization — occurring at a rapid pace — is evident.\nAround Luhamaa, Estonia is erecting a robust border fence that will be equipped with cameras, sensors and radar.\nA couple of days earlier, in the north, Russian border guards removed 25 buoys marking the boundary along the Narva River from Estonian waters.\nIn addition to doubling military spending, Estonia is one of the allies that has donated the most aid to Ukraine (1.7% of its GDP).\nDifferent Western intelligence services agree on the possibility of Russia attacking a NATO member between the next five and 10 years.", "location": "BELARUS", "classification": "security", "score": 0.7873099886150388, "event_breakdown": "Location: Luhamaa, Estonia\nEvent: Estonia is erecting a robust border fence that will be equipped with cameras, sensors and radar.\nRussian border guards remove 25 buoys marking the boundary along the Narva River from Estonian waters."}, {"id": "268b2000-62c1-490f-a431-71ef608c71bf", "title": "Iran warns Israel of  obliterating war  if it attacks Lebanon – Kashmir Reader", "date": "2024-06-30 00:00", "url": "https://kashmirreader.com/2024/06/30/iran-warns-israel-of-obliterating-war-if-it-attacks-lebanon/", "domain": "kashmirreader.com", "domain_classification": "Unknown", "message": "TEHRAN: Iran has warned Israel against “full-scale military aggression” in Lebanon and said it would lead to an “obliterating war”, the Islamic republic’s United Nations mission said.\nFears of a full-blown war grew this month after Prime Minister Benjamin Netanyahu said Israel was preparing for “a very tense operation” on the border with Lebanon.\nIsraeli forces conducted a series of attacks on Hezbollah targets in southern Lebanon, an Israeli army spokesperson said early on Saturday.\nThat is always the better option,” Gallant said during a visit on Friday to troops near Israel’s northern border with Lebanon.\n“Hezbollah understands very well that we can inflict massive damage in Lebanon if a war is launched,” he said in Washington, DC.", "location": "Lebanon.", "classification": "security", "score": 0.8022567826185514, "event_breakdown": "Target event :\nTEHRAN: Iran has warned Israel against “full-scale military aggression” in Lebanon and said it would lead to an “obliterating war”, the Islamic republic’s United Nations mission said on May 25, 2019.\nEvents on the map :\nEvent: Israeli forces conducted a series of attacks on Hezbollah targets in southern Lebanon, an Israeli army spokesperson said early on May 25, 2019.\nEvent: Prime Minister Benjamin Netanyahu said on May 14, 2019 that Israel was preparing for “a very tense operation” on the border with Lebanon. Event: “Hezbollah understands very well that we can inflict massive damage in Lebanon if a war is launched,” Israeli Defence Minister Naftali Bennett said on Monday."}, {"id": "983a89e2-6def-49fb-af0c-c271bdc80e1b", "title": "Piontkovsky : Putin Admitted His Defeat Actually", "date": "2024-06-30 10:00", "url": "https://charter97.org/en/news/2024/6/30/600940/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Piontkovsky: Putin Admitted His Defeat Actually 11 30.06.2024, 8:2419,926ANDREI PIONTKOVSKYPHOTO: SVABODA.ORGThe head of the Kremlin put forward a ridiculous ultimatum.\nThis opinion was expressed by political scientist Andrei Piontkovsky on the air of Espresso.\nPiontkovsky is also sure that the Kremlin dictator will try to shift the blame for the defeat in the war to the army command.\nSo he hopes to sell this decision to his people – his population and his supporters – as an honorable draw,\" the political scientist said.\nTherefore, it is ridiculous that he suddenly learned that there is corruption in the army,\" the political scientist said.", "location": "Moscow", "classification": "security", "score": 0.4801403132313666, "event_breakdown": "The Kremlin dictator admitted his defeat in the war, the head of the Russian political scientist on Espresso."}, {"id": "9bfaeeec-1d40-48f0-8305-e0bb7e006e87", "title": "Russians lose 1 , 140 troops and 53 artillery systems over past 24 hours – Ukraine General Staff", "date": "2024-06-30 08:45", "url": "https://www.yahoo.com/news/russians-lose-1-140-troops-041756347.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russians lose 1,140 troops and 53 artillery systems over past 24 hours – Ukraine's General StaffRussian forces have lost about 1,140 soldiers, 53 artillery systems and 19 armoured combat vehicles over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 30 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 542,700 (+1,140) military personnel;8,080 (+7) tanks;15,524 (+19) armoured combat vehicles;14,533 (+53) artillery systems;1,110 (+1) multiple-launch rocket systems;873 (+2) air defence systems;360 (+0) fixed-wing aircraft;326 (+0) helicopters;11,584 (+46) strategic and tactical UAVs;2,331 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;19,643 (+75) vehicles and tankers;2,448 (+12) special vehicles and other equipment.\nSupport UP or become our patron!", "location": "Kyiv", "classification": "security", "score": 0.8033546152713292, "event_breakdown": "Russians lose 1,140 troops and 53 artillery systems over past 24 hours - Ukraine's General Staff\n\nUkraine's General Staff of Armed Forces on Facebook reports that Russians lost 1,140 troops and 53 artillery systems in the last 24 hours."}, {"id": "13e94c4e-f0bf-4ab2-aa4f-e9eefa407eb1", "title": "Wounded and war weary : Images of soldiers returning from the front in Eastern Ukraine", "date": "2024-06-30 09:45", "url": "https://www.cbc.ca/news/world/photos-wounded-soldiers-ukraine-1.7241053", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "After nearly two and a half years of war, it is unclear how many Ukrainian soldiers have been killed or injured.\nCBC News recently gained access to a medical evacuation bus transporting injured soldiers from the front line to a hospital in Dnipro Oblast in Eastern Ukraine.\n(Corinne Seminoff/CBC)Hit by a grenade launcherMost active Ukrainian soldiers will allow themselves to be identified only by their call sign.\nShe is a combat medic with Hospitallers , a group of volunteer paramedics, and spends two weeks a month transporting injured soldiers to hospital.\nRomaniuk says the first thing many of the seriously injured soldiers want to know is whether they will have to lose a limb.", "location": "Dnipro Oblast", "classification": "security", "score": 0.7997680436642545, "event_breakdown": "The hospital in Dnipro Oblast, Ukraine."}, {"id": "19c8080a-3b46-47b9-ae50-51e62baaa920", "title": "Israel presses Hamas in Shejaya , destroys terror compound in civilian area", "date": "2024-06-30 10:00", "url": "https://economictimes.indiatimes.com/news/defence/israel-presses-hamas-in-shejaya-destroys-terror-compound-in-civilian-area/articleshow/111379193.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIsraeli troops continued pressing military operations against Hamas in northern Gaza 's Shejaya area, the Israel Defence Forces said on Sunday.Over the past day, the troops eliminated several terrorists , located weapons, and conducted targeted raids on booby-trapped combat compounds.\nThe Air Force also struck dozens of Hamas infrastructure sites.Dozens of Hamas terrorists were killed in close-quarters combat and airstrikes and several tunnel shafts were dismantled over the weekend.Soldiers encircled a civilian area in Shejaya that Hamas converted into a compound.\nTroops located observation posts, weapons, aerial drones and a long-range rocket launcher near Shejaya schools.Elsewhere in Gaza, Israeli forces struck and dismantled a mortar post located inside a tunnel shaft in the southern Gaza town of Rafah.At least 1,200 people were killed, and 252 Israelis and foreigners were taken hostage in Hamas's attacks on Israeli communities near the Gaza border on October 7.\nOf the 116 remaining hostages, more than 30 are believed dead.", "location": "GAZA", "classification": "security", "score": 0.9960450743070319, "event_breakdown": "Israeli troops continued pressing military operations against Hamas in northern Gaza's Shejaya area, the Israel Defence Forces said on Sunday. Soldiers encircled a civilian area in Shejaya that Hamas converted into a compound. Troops located observation posts, weapons, aerial drones and a long-range rocket launcher near Shejaya schools. Elsewhere in Gaza, Israeli forces struck a mortar post located inside a tunnel shaft in the southern Gaza town of Rafah."}, {"id": "ddea145f-95dd-4ceb-aa3a-6b5de3ed5176", "title": "Israel presses Hamas in Shejaya , destroys terror compound in civilian area", "date": "2024-06-30 10:00", "url": "https://news.webindia123.com/news/Articles/World/20240630/4210612.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Over the past day, the troops eliminated several terrorists, located weapons, and conducted targeted raids on booby-trapped combat compounds.\nDozens of Hamas terrorists were killed in close-quarters combat and airstrikes and several tunnel shafts were dismantled over the weekend.\nSoldiers encircled a civilian area in Shejaya that Hamas converted into a compound.\nTroops located observation posts, weapons, aerial drones and a long-range rocket launcher near Shejaya schools.\nElsewhere in Gaza, Israeli forces struck and dismantled a mortar post located inside a tunnel shaft in the southern Gaza town of Rafah.", "location": "GAZA", "classification": "security", "score": 0.9971993244467513, "event_breakdown": "Troops located observation posts, weapons, aerial drones and a long-range rocket launcher near Shejaya schools.\nIsraeli forces struck and dismantled a mortar post located inside a tunnel shaft in the southern Gaza town of Rafah."}, {"id": "46bfdb5b-92e3-4d8a-b5e4-0d5f9459a387", "title": "Israel - Hamas conflict : United Nations moves tons of aid from US - built Gaza pier after security fears suspended work there", "date": "2024-06-30 03:15", "url": "https://www.nzherald.co.nz/world/israel-hamas-conflict-united-nations-moves-tons-of-aid-from-us-built-gaza-pier-after-security-fears-suspended-work-there/52PPGGPCXZGTLOXLFLVRZPICSQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "US officials said they were considering not reinstalling it because of the possibility that the aid would not be picked up.\nUnder the current proposal, Hamas could release all of the remaining men, both civilians and soldiers.\nHamas political official Osama Hamdan said the group had yet to receive a new ceasefire proposal from mediators.\nHamas political leader Ismail Haniyeh spoke by phone with the head of Egypt’s general intelligence service to discuss the negotiations, Hamas said in a statement.\nThe October 7 Hamas attack in Israel killed about 1200 people, mostly civilians, and another 250 people were taken hostage.", "location": "GAZA CITY", "classification": "security", "score": 0.8886440857846045, "event_breakdown": "Hamas political official Osama Hamdan said the group had yet to receive a new ceasefire proposal from mediators.Hamas political leader Ismail Haniyeh spoke by phone with the head of Egypt's general intelligence service to discuss the negotiations, Hamas said in a statement."}, {"id": "1c85c2f6-4504-4c29-91a0-a8ef7d8dc68f", "title": "Leadership : NATO Members Called to Account", "date": "2024-06-30 07:15", "url": "http://www.strategypage.com/htmw/htlead/articles/2024063002122.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "The Americans spend three percent of their GDP on defense each year and European nations agreed to spend two percent.\nThe United States continues to spend three percent but not all of the European nations met their two percent goal.\nCurrently the United States is spending $877 billion a year on defense, which just about exceeds the combined defense spending of every other nation on the planet.\nFor example, Russian operations in Syria caused Russian defense spending to increase to $48 billion in 2015.\nLow oil prices since 2014 have done serious damage to the Russian economy and Ukraine-related sanctions made it more difficult to cope.", "location": "Based on the text you provided, I did not find a suitable answer.", "classification": "security", "score": 0.4526023815840796, "event_breakdown": "US officials believe Ukraine is robbed of 20% of its wheat production by Russia, which could be used to finance the war."}, {"id": "a23a27f9-f9ae-49da-9462-94a599def848", "title": "UN starts to move tons of aid from US - built pier", "date": "2024-06-30 01:45", "url": "https://www.reviewjournal.com/news/nation-and-world/un-starts-to-move-tons-of-aid-from-us-built-pier-3077688/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Humanitarian workers have started moving tons of aid that piled up at a U.S.-built pier off the Gaza coast to warehouses in the Palestinian territory.\nUS removes Gaza aid pier due to weather, may not put it back, officials sayIsraeli soldiers move on the top of a tank near the Israeli-Gaza border, as seen from southern Israel, Saturday, June 29, 2024.\nThis is the first time trucks have moved aid from the pier since the World Food Program, a U.N. agency, suspended operations there because of security concerns on June 9.\nU.S. officials said they were considering not reinstalling it because of the possibility that the aid would not be picked up.\nIsraeli forces have been battling Palestinian terrorists in an eastern part of Gaza City, Shijaiyah, over the last week.", "location": "GAZA CITY", "classification": "security", "score": 0.5077330851005444, "event_breakdown": "Israeli troops battle Hamas in Gaza"}, {"id": "08a59056-09ec-4447-8d47-6279ae5fd860", "title": "Three Hezbollah members killed in Israeli airstrike on Lebanese village", "date": "2024-06-30 13:30", "url": "https://www.siasat.com/three-hezbollah-members-killed-in-israeli-airstrike-on-lebanese-village-3053673/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Beirut: Three Hezbollah members were killed on Sunday in an Israeli airstrike in the southeast village of Houla, a media report said.\nAn Israeli drone targeted, with four air-to-surface missiles, a two-story building in Houla, killing three Hezbollah members and causing severe damage to neighbouring homes, Lebanese military sources told Xinhua.\nFor its part, Hezbollah announced that it attacked the Israeli sites of Misqav Am, al-Motella, and Al-Alam.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas’ attack on Israel the day before.\nSince the start of the confrontations on both sides of the border between Lebanon and Israel, 553 people have been killed, including 356 Hezbollah members and 100 civilians, according to Lebanese security and medical reports.", "location": "BEIRUT", "classification": "security", "score": 0.9843378578436535, "event_breakdown": "Hezbollah fires rockets at Israel on October 8, 2023, 3 Hezbollah members were killed in an Israeli airstrike in the village of Houla on February 19, 2023. So, it can be marked as a relevant event, reported in text with a location in Beirut (Beirut is the capital of Lebanon which is near where the incident is located in Houla).\nThree Hezbollah members were killed in an Israeli airstrike in Beirut on February 19, 2023. The Israeli drone attacked a two-story building in Houla with four air-to-surface missiles, killing three Hezbollah members."}, {"id": "fe5356fe-f102-4ec1-8a05-cd5da7c0b1fc", "title": "Three Hezbollah Members Killed In Israeli Airstrike On Lebanese Village", "date": "2024-06-30 12:45", "url": "https://menafn.com/1108390087/Three-Hezbollah-Members-Killed-In-Israeli-Airstrike-On-Lebanese-Village", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, June 30 (IANS) Three Hezbollah members were killed on Sunday in an Israeli in the southeast village of Houla, a report said.\nAn Israeli drone targeted, with four air-to-surface missiles, a two-story building in Houla, killing three Hezbollah members and causing severe damage to neighbouring homes, Lebanese military sources told Xinhua.\nFor its part, Hezbollah announced that it attacked the Israeli sites of Misqav Am, al-Motella, and Al-Alam.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nSince the start of the confrontations on both sides of the border between Lebanon and Israel, 553 people have been killed, including 356 Hezbollah members and 100 civilians, according to Lebanese security and medical reports.", "location": "LEBANON", "classification": "security", "score": 0.9884909199757166, "event_breakdown": "Israeli drone attacks Hezbollah targets in Lebanon's Houla village, killing three members. Hezbollah fires rockets into Israel in retaliation. The Israeli military attacks an unspecified number of Hezbollah targets. Lebanon's security officials and Hezbollah say Israeli rockets have caused extensive damage to nearby homes. Israel attacks three targets in Lebanon, causing extensive damage to nearby homes and killing three Hezbollah members. Israeli drone targets Hezbollah building, kills three members. Lebanon's security and Hezbollah officials say Israel's rockets have caused extensive damage to nearby homes. Israel attacks three targets again, causing extensive damage to nearby homes and killing three Hezbollah members."}, {"id": "eef91acb-27b6-4a5d-8eba-d854380ba776", "title": "Having let Hezbollah attack , can Israel put the toothpaste back into the tube ? ", "date": "2024-06-30 13:15", "url": "https://www.thejc.com/lets-talk/analysis/having-let-hezbollah-attack-can-israel-put-the-toothpaste-back-into-the-tube-ye96ej2b", "domain": "thejc.com", "domain_classification": "Unknown", "message": "The city, like most communities in northern Israel near the Lebanese border, was evacuated in October after the Hamas attack on southern Israel.\nAt the time it was believed a war with Hezbollah would break out, leading to a multi-front war for Israel.\nIsrael has several IDF divisions deployed in northern Israel today.\nThe challenge Israel faces today in northern Israel is complex.\nHaving let Hezbollah attack for eight months, it will be hard to put the toothpaste back into the tube.", "location": "northern Israel", "classification": "security", "score": 0.7094197316765639, "event_breakdown": "Northern Israel, IDF divisions deployed, Hezbollah attack, Gaza attack"}, {"id": "8b1f3627-dbce-4110-a0f1-18e16f012826", "title": "Zelensky issues fresh weapons plea after 7 killed in Russian attack on Zaporizhzhia region", "date": "2024-06-30 13:45", "url": "https://us.cnn.com/2024/06/30/europe/ukraine-russia-zaporizhzhia-attack-frontlines-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —At least 7 people, including children, were killed and at least 31 injured after Russia launched a missile strike on the town of Vilniansk in Ukraine’s southern Zaporizhzhia region on Saturday, according to Ukrainian officials.\n“[Today] is a day of mourning in Zaporizhzhia region for those killed in the enemy attack on Vilniansk,” Ivan Fedorov, the head of Zaporizhzhia regional military administration, said on Sunday.\n“There is unspeakable pain.”Three children were among those killed and eight children were among the injured, Fedorov said.\nIn the Donetsk region, Russia has made advances towards Chasiv Yar as it attempts to capture the strategic hilltop town.\nAs Zelensky repeats his appeals for more long-range weapons, these developments have again highlighted Ukraine’s reliance on ammunition and weapons from the United States and other allies.", "location": "ZAPORIZHZHIA", "classification": "security", "score": 0.8246647649521969, "event_breakdown": "Ukraine: Russian missile strike on town of Vilniansk in Zaporizhzhia region kills at least 7 people, including children. In response, Ukraine declares a day of mourning in the region."}, {"id": "53705da6-4858-4a1d-8fe4-bdf6b0195371", "title": "Day 268 : Army Kills And Injures Dozens Of Palestinians In Gaza", "date": "2024-06-30 13:00", "url": "https://imemc.org/article/day-268-army-kills-and-injures-dozens-of-palestinians-in-gaza/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "Several Palestinians were killed and injured when the army fired a missile at an apartment in a residential building near the Al-Emla market in Gaza City.\nAlso, an Israeli drone fired a missile at Palestinian medics trying to rescue bombarded Palestinians, west of Rafah city.\nExplosions and heavy gunfire were heard in the Tal Al-Sultan and Al-Saudi neighborhoods, west of the city of Rafah.\nThe Israeli army also killed fired shells at the Shakoush area, northwestern of Rafah, killing at least three Palestinians and wounding many others.\nThe Israeli army said Brigade 98, in cooperation with the Airforce, attacked infrastructure and various buildings in Sheja’eyya.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9988166201323324, "event_breakdown": "Event 1: Missile Attack on Apartment Building Near Al-Emla Market in Gaza City\n\nEvent 2: Israeli Drone Fires at Palestinian Medics Trying to Rescue Bombarded Palestinians in Western Rafah\n\nEvent 3: Explosions and Heavy Gunfire Heard in Tal Al-Sultan and Al-Saudi neighborhoods in Western Rafah\n\nEvent 4: Israeli Army Fires Shells at Shakoush Area in northwestern Rafah, Killing Three Palestinians and Wounding Many Others"}, {"id": "36d373ed-d383-4c62-a97d-f099999454b8", "title": "Zelensky issues fresh weapons plea after 7 killed in Russian attack on Zaporizhzhia region", "date": "2024-06-30 10:30", "url": "https://edition.cnn.com/2024/06/30/europe/ukraine-russia-zaporizhzhia-attack-frontlines-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —At least 7 people, including children, were killed and at least 31 injured after Russia launched a missile strike on the town of Vilniansk in Ukraine’s southern Zaporizhzhia region on Saturday, according to Ukrainian officials.\n“[Today] is a day of mourning in Zaporizhzhia region for those killed in the enemy attack on Vilniansk,” Ivan Fedorov, the head of Zaporizhzhia regional military administration, said on Sunday.\n“There is unspeakable pain.”Three children were among those killed and eight children were among the injured, Fedorov said.\nIn the Donetsk region, Russia has made advances towards Chasiv Yar as it attempts to capture the strategic hilltop town.\nAs Zelensky repeats his appeals for more long-range weapons, these developments have again highlighted Ukraine’s reliance on ammunition and weapons from the United States and other allies.", "location": "ZAPORIZHZHIA REGION", "classification": "security", "score": 0.8246647649521969, "event_breakdown": "Russia launched a missile strike on the Ukraine town of Vilniansk on Saturday, killing 7 people, 3 of them children."}, {"id": "0e2a55a0-d296-49ae-af89-4615e4dda1c1", "title": "Russian Strike On Ukraine Town Kills 7 , Zelensky Asks Allies For More Weapons", "date": "2024-06-30 00:00", "url": "https://www.ndtv.com/world-news/russian-strike-on-ukraine-town-kills-7-zelensky-asks-allies-for-more-weapons-6000019", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "\"Seven people, including two children, have been killed by a Russian missile strike in the Zaporizhzhia region,\" Zelensky said on social media.\nThe head of the Zaporizhzhia region, Ivan Fedorov, earlier said a \"critical infrastructure facility, a shop and residential buildings were damaged\" in the strike.\nRussia's attack on Vilniansk came hours after Moscow said a Ukrainian drone on a house in a Russian border village killed five people, including two children.\n\"To our great grief, five people were killed ... including two small children.\nThe office of Ukraine's General Prosecutor later said another person, a resident of the eastern village of New York \"also sustained fatal injuries.\"", "location": "ZAPORIZHZHIA", "classification": "security", "score": 0.8852708130506417, "event_breakdown": "Seven people, including two children, have been killed by a Russian missile strike in the Zaporizhzhia region of Ukraine, President Volodymyr Zelensky said on social media. The attack occurred in the Vilniansk area.\nMoscow's attack on Vilniansk came hours after Russia said a Ukrainian drone killed five people, including two children, in a Russian border village."}, {"id": "02dfa9d9-a251-4e0a-9cb5-028c3b434b89", "title": "Zelenskyy seeks long - range weapons as Russian strikes kill 7 in Ukrainian town", "date": "2024-06-30 14:15", "url": "https://news.webindia123.com/news/Articles/World/20240630/4210663.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy has urgently appealed for additional long-range weapons following a devastating Russian missile strike that killed at least seven people, including children, and injured 31 others in Vilniansk, located in Ukraine's Zaporizhzhia region, CNN reported.\nAccording to Fedorov, \"Three children were among those killed and eight children were among the injured.\"\nShe described the tragic scene: \"Children died, children were injured.\nThese developments highlight Ukraine's vulnerabilities, including stretched manpower and logistical delays in receiving critical supplies from Western allies.\nThe tragedy in Vilniansk has reignited calls for robust international intervention and solidarity with Ukraine in its struggle against Russian aggression.", "location": "NONE", "classification": "security", "score": 0.9208608651158239, "event_breakdown": "Ukrainian President Volodymyr Zelenskyy has urgently appealed for additional long-range weapons following a devastating Russian missile strike on Monday in Vilniansk in Ukraine's Zaporizhzhia region that killed at least seven people, including children and wounded 31 others. CNN reported that Valentyna Matserova, the mayor of the town, which has a population of just 700, described the tragedy. \"Many children were near the bomb shelter. We are still determining how many children were near the strike and how many were killed,\" she said. According to CNN, Russian officials did not immediately comment."}, {"id": "da182a8f-1761-46ce-8109-648819ae75a5", "title": "Iran warns Israel of  obliterating  war if Lebanon attacked", "date": "2024-06-30 11:30", "url": "https://www.naharnet.com:443/stories/en/306258-iran-warns-israel-of-obliterating-war-if-lebanon-attacked", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Iran had warned that \"all resistance fronts\", a grouping of Iran and its regional allies, would confront Israel if it attacks Lebanon.\nThe comment from Iran's mission to New York comes with fears of a wider regional war involving Israel and Lebanon's Iran-backed Hezbollah.\nThe war in Gaza began in October when Hamas Palestinian militants attacked southern Israel.\nFears of regional war also soared in April, after an air strike that leveled Iran's consulate in Damascus and killed seven Revolutionary Guards, two of them generals.\nIran hit back with an unprecedented drone and missile attack on Israel on April 13-14.", "location": "LEBANON", "classification": "security", "score": 0.9458094124683559, "event_breakdown": "A possible war with Iran and regional allies in Israel, Golan Heights, Gaza strip, Damascus"}, {"id": "9ae368bf-65c1-4a8b-a2ba-04ebba1c0468", "title": "India exports rockets , explosives to Israel amid Gaza war : Reports", "date": "2024-06-30 14:15", "url": "https://www.radio.gov.pk/30-06-2024/india-exports-rockets-explosives-to-israel-amid-gaza-war-reports", "domain": "radio.gov.pk", "domain_classification": "Unknown", "message": "India exports rockets, explosives to Israel amid Gaza war: ReportsAn investigative report by AL Jazeera has revealed India’s involvement in the ongoing Israeli invasion on Gaza.\nThe report shows that India is exporting tonnes of rockets with explosive charges, propellants for cannons, rocket engines along with other military equipment to Israel.\nThe report also pointed out a video evidence which showed remains of a missile used to target a United Nations shelter at the Nuseirat refugee camp in Gaza in the first week of this month.\nAmid the tangled parts, a label clearly read: “Made in India.”", "location": "GAZA", "classification": "security", "score": 0.5804068107090098, "event_breakdown": "[\n'Indi exports rockets, explosives to Israel amid Gaza war',\n{\n'location': 'Nuseirat refugee camp, Gaza'\n}\n]"}, {"id": "ae8edb31-62a2-41ba-85d7-1a59429122db", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel", "date": "2024-06-30 09:45", "url": "https://www.cnbc.com/2024/06/30/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an \"obliterating\" war over Hezbollah.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\n\"Such a war would be a catastrophe for Lebanon,\" Defense Secretary Lloyd Austin said as he met recently with Israeli Defense Minister Yoav Gallant at the Pentagon.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"\nIsraeli Foreign Minister Israel Katz responded by pledging his country would move against Hezbollah with \"full force\" unless it stopped attacks.", "location": "Israel", "classification": "security", "score": 0.45228304616287535, "event_breakdown": "Iran-Israel conflict over Hezbollah, Austin stated\nRussia-Ukraine tension, United States concerned about Russian aggression"}, {"id": "4d761df2-94da-4820-ad49-8e17bce53c96", "title": "Tinubu condemns Borno suicide attacks , promises to deal with troublemakers", "date": "2024-06-30 13:30", "url": "https://punchng.com/tinubu-condemns-borno-suicide-attacks-promises-to-deal-with-troublemakers/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "President Bola Tinubu has condemned the bomb attacks, which resulted in the loss of lives and the maiming of other citizens in the Gwoza Local Government Area of Borno State.\nPUNCH Online reported that a deadly bomb attack killed at least 18 persons and maimed many others on Saturday at a wedding ceremony in Tashan Mararaba, Gwoza town, Borno State.\nIntelligence sources told Makama that the victims, who were all civilians, were returning from a wedding celebration when the attack occurred near a busy motorpark.\nEmergency services rushed to the scene to rescue those injured and transport them to the hospitals in Gwoza.\n“President Tinubu condoles with the victims of the attacks, the families of the deceased, as well as the government and people of Borno State.”", "location": "Gwoza, Borno State, Nigeria", "classification": "security", "score": 0.7563559362416558, "event_breakdown": "Local elections are scheduled for Sunday in the Indonesian capital, Jakarta12 people were killed in a suicide bomb attack in the Afghan capital, Kabul."}, {"id": "3c96187b-80a9-478c-9b25-83a82d67ba7e", "title": "Airstrike : IDF again attempts to eliminate senior Islamic Jihad terrorist in Tulkarm", "date": "2024-06-30 13:00", "url": "https://www.israelnationalnews.com/news/392329", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Israeli Air Force unmanned aircraft struck a building on Sunday in the Nur Shams \"refugee\" camp in Tulkarem.\nArabs are reporting several wounded as a result of the strike on the building which, according to the IDF, contained four terrorists.\nThe strike was carried out following intel that was received and after IDF surveillance on the building where senior terrorists from Nur Shams terror cells were.\nAccording to Arab reports, the building that was attacked was the home of the uncle of Abu Shaja'a, the commander of the Islamic Jihad's Tulkarm Battalion.\nAt the beginning of the month, security forces arrested the terrorist U'mar Nassrallah in Nur Shams on suspicion of being involved in shooting at the Jewish village of Bat Hefer.", "location": "TULKAREM", "classification": "security", "score": 0.9881081199898488, "event_breakdown": "IDF strike in Nur Shams refugee camp in Tulkarem on Sunday results in several wounded."}, {"id": "e66344c5-8547-437c-9db1-036e11d86306", "title": "Pakistan Bomb Blast : 18 Injured in Explosion at Wedding Ceremony in Khyber Pakhtunkhwa Province", "date": "2024-06-30 13:15", "url": "https://www.latestly.com/world/pakistan-bomb-blast-18-injured-in-explosion-at-wedding-ceremony-in-khyber-pakhtunkhwa-province-6075592.html", "domain": "latestly.com", "domain_classification": "Unknown", "message": "Islamabad, June 30: Eighteen people were injured in an explosion at a wedding ceremony in the Kurram district of Pakistan's northwest Khyber Pakhtunkhwa province on Sunday, police said.\nBomb Blast in Pakistan: Three Killed, Eight Injured in Explosion in Khuzdar District of Balochistan Province.\nThe injured people have been shifted to a nearby hospital with three of them in critical condition.\n(The above story first appeared on LatestLY on Jun 30, 2024 03:56 PM IST.\nFor more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com).", "location": "Kurram district, Khyber Pakhtunkhwa province, Pakistan", "classification": "security", "score": 0.9656893864028454, "event_breakdown": "Security Event 1: Eighteen people were injured in an explosion at a wedding ceremony in the Kurram district of Pakistan's northwest Khyber Pakhtunkhwa province on Sunday, police said. The injured people have been shifted to a nearby hospital with three of them in critical condition."}, {"id": "9181a6ae-2a11-4f4c-9530-ce0a51c513de", "title": "US , Europe warn Hezbollah to ease strikes on Israel", "date": "2024-06-30 00:45", "url": "https://journalnow.com/news/nation-world/government-politics/middle-east-war-conflict-military/article_6e7bc6ea-0490-5994-9d54-5b61ddac610d.html", "domain": "journalnow.com", "domain_classification": "Unknown", "message": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified in recent weeks after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.8711662527602523, "event_breakdown": "Israel / Hezbollah border"}, {"id": "43c1e7a2-1435-4c01-8a2c-44d1c517c501", "title": "Man fatally stabbed while walking in Englewood", "date": "2024-06-30 01:15", "url": "https://www.yahoo.com/news/man-fatally-stabbed-while-walking-225516929.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CHICAGO — An investigation is underway after a man was fatally stabbed while walking on the city’s South Side early Saturday morning.\nChicago police say the incident unfolded just before 5 a.m. in the 6300 block of South Stewart Avenue in Englewood.\nOffices say one of the people from inside the car then stabbed the man several times.\nFelony charges filed against Park Forest man accused of robbing 2 people only 10 minutes apartAuthorities have not yet identified the victim killed.\nAnyone with information on the deadly stabbing is asked to call CPD Area One detectives at 312-747-8380 or dial 911.", "location": "CHICAGO", "classification": "security", "score": 0.8328878560004306, "event_breakdown": "Location: Englewood, Chicago, Illinois, USA\nInvestigation underway after man was fatally stabbed while walking on city's South Side\nHe suffered several stab wounds during a confrontation in an alley."}, {"id": "52f84c4d-b131-405a-8219-ffcf1e717a91", "title": "Ukraine now mass - producing strike drones with range of over 1 , 000 kilometers", "date": "2024-06-30 10:30", "url": "https://www.yahoo.com/news/ukraine-now-mass-producing-strike-093606681.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine now mass-producing strike drones with range of over 1,000 kilometersUkraine has launched serial production of strike drones with a range of over 1,000 kilometers, the head of state-owned company Ukrainian Defense Industry, also known as Ukroboronprom, said on June 29.\nUkraine employs long-range drones to strike deep into Russian territory, targeting military infrastructure such as airfields and logistics, as well as oil refineries and depots.\nExperimental Ukrainian drones have struck targets in Russia as far as the Tatarstan Republic, some 1,200 kilometers (750 miles) away from the Russia-Ukraine border.\nSmetanin said that with the help of \"private individuals,\" Ukrainian Defense Industry was now able to \"scale production\" of long-range drones.\nMoscow's defense ministry on June 30 claimed to have destroyed 36 Ukrainian drones overnight that targeted several regions in the southwest of Russia.", "location": "Ukraine", "classification": "security", "score": 0.9448717691980282, "event_breakdown": "Target: None\n1. Ukraine has launched serial production of strike drones with a range of over 1,000 kilometers.\n2. Experimental Ukrainian drones have struck targets in Russia as far away as the Tatarstan Republic, over 1,200 kilometers from the Russia-Ukraine border.\n3. Moscow's defense ministry has claimed the destruction of 36 Ukrainian drones that targeted several regions in the southwest of Russia."}, {"id": "753e26ea-c283-46cc-886c-6f873fc4400e", "title": "US , Europe warn Lebanon Hezbollah to ease strikes , back off from wider war", "date": "2024-06-30 02:30", "url": "https://www.10news.com/world/israel-at-war/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-mideast-war", "domain": "10news.com", "domain_classification": "Unknown", "message": "Hopes are lagging for a cease-fire in Israel's conflict with Hamas in Gaza that would calm attacks by Hezbollah and other Iranian-allied militias.\nUS, Europe warn Lebanon's Hezbollah to ease strikes, back off from wider warOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region's best-armed fighting forces, appeared at least to level off this past week.\nIsrael at War Netanyahu warns of possible Lebanon war AP via Scripps NewsBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "GAZA", "classification": "security", "score": 0.8770783816401136, "event_breakdown": "United States\nEurope\nIsrael\nGaza Strip\nLebanon"}, {"id": "0a950268-1168-4e72-978f-bdb0a4c6ae38", "title": "Ukrainian border guards kill armed attacker near Romanian border", "date": "2024-06-30 14:30", "url": "https://www.yahoo.com/news/ukrainian-border-guards-kill-armed-133401712.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Border guards in western Ukraine were forced to defend themselves against an attack by two armed men, killing one of the assailants and injuring the other, State Border Guard Service spokesperson Andrii Demchenko told Ukrainska Pravda on June 30.\nThe attack reportedly took place on June 29 at around 9 p.m. local time near Selyatyn in Chernivtsi Oblast, which borders Romania.\nJournalist Vitaly Glagov said that according to his sources, the attackers were armed with a machete and a gas canister.\nThe border guard used his weapon to save his own life, Demchenko said.\nRomanian police told RFE/RL in May that about 11,000 Ukrainian men have illegally crossed the border into Romania since the beginning of Russia's full-scale invasion.", "location": "CHERNIVETS AREA", "classification": "security", "score": 0.9510881402916492, "event_breakdown": "Event 1: On June 30, border guards in western Ukraine were forced to defend themselves against an attack by two armed men near Selyatyn in Chernivtsi Oblast. The border guard used his weapon to save his own life, killing one of the assailants and injuring the other."}, {"id": "8f3c2743-3e8e-428e-896b-8e0905df2993", "title": "Crossbow Attacker Wounds Police Officer Guarding Israel Embassy in Serbia Before Being Shot Dead", "date": "2024-06-30 06:30", "url": "https://www.theepochtimes.com/world/crossbow-attacker-wounds-police-officer-guarding-israels-embassy-in-serbia-before-being-shot-dead-5677525", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "BELGRADE, Serbia—An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s Interior Ministry said.\nBoth Serbian and Israeli officials said initial indications pointed to terrorism as a motive.\nInterior Minister Ivica Dacic said in a statement that the attacker fired a bolt at the officer, hitting him in the neck.\nIsrael’s ambassador to Belgrade, Yahel Vilan, said he was deeply shocked “by the terrorist attack” in front of the embassy.\nIsrael’s embassy is located not far from the U.S. Embassy in an upscale Belgrade district.", "location": "Serbia", "classification": "security", "score": 0.9719983639561911, "event_breakdown": "Current security events reported in text:\nAttack on Serbian police officer with a crossbow (Belgrade)"}, {"id": "c0c84e93-318c-491e-88b8-a91c4d6156c4", "title": "12 killed in Russian attacks on Ukraine", "date": "2024-06-30 13:00", "url": "https://www.hurriyetdailynews.com/12-killed-in-russian-attacks-on-ukraine-197951", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "12 killed in Russian attacks on UkraineKIEVRussian attacks across eastern Ukraine killed at least 11 people Saturday, while rescuers in the city of Dnipro dug through rubble after a Russian strike ripped through a nine-story residential building, leaving one dead, officials said.\nThe attacks came as Russia continues to stretch out Ukrainian forces in several areas along the 1,000-kilometer (600-mile) front.\nHe said that Russian forces had shelled populated areas 13 times over the past 24 hours.\nA further seven people were killed Saturday afternoon in Russian shelling on the town of Vilniansk, including two children, Gov.\nRussian officials also reported Ukrainian attacks, with a drone strike killing five people in Russia’s Kursk region, local officials said Saturday.", "location": "EASTERN UKRAINE", "classification": "security", "score": 0.8508298218059916, "event_breakdown": "1. Ukraine: Russian attacks kill 11 in eastern Ukraine\n2. Ukraine: One killed as Russian attack hits Dnipro residential building\n3. Russia: Five killed in Ukrainian drone strike in Russia's Kursk region\n\nNote: The location of the reported security events can be found in the associated articles."}, {"id": "31c508d9-962d-49ee-b874-59d1ca08ffa5", "title": "At least 12 killed in Russian attacks on Ukraine . Rescue work continues at destroyed apartment bloc", "date": "2024-06-30 01:15", "url": "https://www.dailyexcelsior.com/at-least-12-killed-in-russian-attacks-on-ukraine-rescue-work-continues-at-destroyed-apartment-bloc/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The attacks came as Russia continues to stretch out Ukrainian forces in several areas along the 1,000-kilometer (600-mile) front.\nHe said that Russian forces had shelled populated areas 13 times over the past 24 hours.\nMeanwhile, in Dnipro, at least one person died and 12 were injured, including a 7-month-old girl, after a Russian strike destroyed the top four floors of the apartment bloc Friday evening, said regional head Serhii Lysak.\nRussian officials also reported Ukrainian attacks, with a drone strike killing five people in Russia’s Kursk region, local officials said on Saturday.\nA Ukrainian drone strike killed at least five people in Russia’s Kursk region, local officials said on Saturday.", "location": "KURSK", "classification": "security", "score": 0.770998692455115, "event_breakdown": "1. Russian attacks continue across Ukraine, killing at least three officials and injuring 12, including a 7-month-old girl, after an attack on an apartment bloc in Dnipro.\n2. Aerial attacks also hit several areas across Russia, killing at least five and injuring five more, after a drone strike by the Ukrainian army."}, {"id": "796cc099-7a78-4a8a-9613-f0aaa1d6a52c", "title": "US and Europe warn Hezbollah to ease strikes on Israel and back off from wider war", "date": "2024-06-30 11:30", "url": "https://www.naharnet.com:443/stories/en/306257-us-and-europe-warn-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-war", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an \"obliterating\" war over Hezbollah.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.7240901427768324, "event_breakdown": "Israel - Hezbollah attacks, exchange of rocket fire, escalating conflict"}, {"id": "e898e63a-c2cf-4f59-bfa9-cffc76945abe", "title": "US and Europe warn Hezbollah to ease strikes on Israel and back off from wider war", "date": "2024-06-30 11:15", "url": "https://www.naharnet.com/stories/en/306257-us-and-europe-warn-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-war", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an \"obliterating\" war over Hezbollah.\nBeginning the day after Hamas' Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.\n\"Another war between Israel and Hezbollah could easily become a regional war, with terrible consequences for the Middle East.\"", "location": "Lebanon", "classification": "security", "score": 0.7240901427768324, "event_breakdown": "Israel, Lebanon\nTargets:\nHezbollah"}, {"id": "6466ea41-13c0-4cdf-a29b-b941cba42261", "title": "US and Europe warn Lebanon Hezbollah to ease strikes on Israel and back off from wider Mideast war – News - Herald", "date": "2024-06-30 12:30", "url": "https://www.news-herald.com/2024/06/30/us-and-europe-warn-lebanons-hezbollah-to-ease-strikes-on-israel-and-back-off-from-wider-mideast-war/", "domain": "news-herald.com", "domain_classification": "Unknown", "message": "Iran and Israel traded threats Saturday of what Iran said would be an “obliterating” war over Hezbollah.\nOn both sides of the Lebanese border, escalating strikes between Israel and Hezbollah, one of the region’s best-armed fighting forces, appeared at least to level off this week.\nBeginning the day after Hamas’ Oct. 7 attacks on Israel triggered the war in Gaza, Hezbollah has launched rockets into northern Israel and vowed to continue until a cease-fire takes hold.\nAttacks intensified this month after Israel killed a top Hezbollah commander and Hezbollah responded with some of its biggest missile barrages.\nBoth Israel and Hezbollah, the dominant force in politically fractured Lebanon, have the power to cause heavy casualties.", "location": "Lebanon", "classification": "security", "score": 0.8540445499756921, "event_breakdown": "On both sides of the Lebanese border, escalating strikes between Israel and Hezbollah appear to have leveled off this week."}, {"id": "2faa3db2-faa0-4d2f-857a-ec11f83ec50e", "title": "Man shot dead after crossbow attack at Israeli embassy in Belgrade", "date": "2024-06-30 13:15", "url": "https://www.thejc.com/news/world/man-shot-dead-after-crossbow-attack-at-israeli-embassy-in-belgrade-riurgfeu", "domain": "thejc.com", "domain_classification": "Unknown", "message": "A Serbian police officer on Saturday shot dead a man who had fired a crossbow at him outside the Israeli embassy in Belgrade.\n“Today, an attempted terror attack occurred in the area of Israel’s embassy in Belgrade.\nEarlier this month, a man threw a Molotov cocktail at the Israeli embassy in the Romanian capital Bucharest.\nIsrael’s embassy in the Netherlands was firebombed in March and in January, an apparent explosive device was found near the Israeli embassy in Stockholm.\nIn October, an Israeli embassy official was attacked in Beijing as Hamas called for a day of global “mobilisation” against the Jewish people.", "location": "BELGRADE", "classification": "security", "score": 0.9941893774212839, "event_breakdown": "Belgrade: A Serbian police officer on Saturday shot dead a man who had fired a crossbow at him outside the Israeli embassy in Belgrade.\nThe incident is being treated as an attempted terror attack."}, {"id": "45863739-5874-476e-9fa5-5500b9f630b4", "title": "Middle East at momentous crossroad : China Daily editorial", "date": "2024-06-30 13:00", "url": "http://usa.chinadaily.com.cn/a/202406/30/WS668147eea31095c51c50b881.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "This photo taken on June 29, 2024 shows a building destroyed by an Israeli airstrike in Houla, Lebanon.\nA Hezbollah member was killed and three others wounded on Saturday in two separate Israeli airstrikes on the southeastern Lebanese village of Houla, Lebanese military sources told Xinhua.\nThat makes more sense if the presidential elections of both Iran and the United States are taken into account.\nSo the latest attacks on Haifa indicate Teheran and its regional allies are seeking to put Israel under continued international pressure.\nHe seems to recognize that the onus will always be on the US to end the Gaza crisis.", "location": "Lebanon", "classification": "security", "score": 0.8920959671366542, "event_breakdown": "Israeli airstrike on Haifa, Lebanon\nHezbollah member killed, three others wounded in two separate Israeli airstrikes on southeastern Lebanese village of Houla"}, {"id": "37754aab-a162-4060-890b-a37a641a751c", "title": "Hezbollah Rockets Strike Israeli Settlements in Response to Aggression on Lebanon Border Villages – Al - Manar TV Lebanon", "date": "2024-06-30 13:30", "url": "https://english.almanar.com.lb/2142571", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "The fifth statement affirmed that the Islamic Resistance fighters launched an aerial operation on Sunday, June 30, 2024, with a squadron of assault drones targeting the command headquarters of the 188th Armored Brigade in Rawiya Barracks.\n“The attack focused on the command building and the positions of its officers and soldiers, resulting in direct hits.\nAt 13:45, the Islamic Resistance fighters targeted the surveillance equipment at Misgav Am site with appropriate weapons, achieving a direct hit.\nAt 15:40, the Islamic Resistance fighters targeted a Merkava tank and a “Numira” vehicle at Ruweisat Al-Alam site in the occupied Lebanese Kfar Shuba hills with guided missiles, resulting in their destruction.\nAt 18:40, the Islamic Resistance fighters targeted the surveillance equipment at Al-Mutlaa site with appropriate weapons, achieving a direct hit and destroying it.", "location": "Based on the text, the most specific location mentioned in the event is \"Rawiya Barracks.\" It is a hill", "classification": "security", "score": 0.9863392955243037, "event_breakdown": "Aerial operation on Sunday, June 30, 2024, by Islamic Resistance fighters against command headquarters of the 188th Armored Brigade in Rawiya Barracks. (Source: @AlMayadeenNews).https://t.co/yno5KiTz2n"}, {"id": "e295867b-b691-4f9e-ac07-9e70838b8541", "title": "Hamas leader , Egyptian intel head discuss Gaza ceasefire over phone", "date": "2024-06-30 13:00", "url": "https://www.siasat.com/hamas-leader-egyptian-intel-head-discuss-gaza-ceasefire-over-phone-3053513/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Gaza: Hamas politburo chief Ismail Haniyeh discussed with Egyptian intelligence chief Abbas Kamel the course of ongoing negotiations to achieve a ceasefire in the Gaza Strip.\nThe call came after Israel’s Hebrew public radio Kan reported that the US administration presented a revised version of a prisoner exchange deal that includes a ceasefire between Israel and Hamas.\nOn Friday, a Hamas source said the movement received a new message from the US regarding the prisoner exchange deal with Israel, noting that the message was passed through intermediaries to continue negotiations for a truce in Gaza.\nQatari and Egyptian mediators, in addition to the United States, are seeking to reach a prisoner exchange deal and a second truce between Israel and Hamas, following the first truce that lasted a week until early December 2023.\nIsrael has been conducting a large-scale offensive against Hamas in Gaza to retaliate against a Hamas rampage through the southern Israeli border on October 7, 2023, during which about 1,200 Israelis were killed and more than 250 were taken hostage.", "location": "Gaza", "classification": "security", "score": 0.6876498250974142, "event_breakdown": "Gaza\nHamas politburo chief Ismail Haniyeh discussed with Egyptian intelligence chief Abbas Kamel the course of ongoing negotiations to achieve a ceasefire in the Gaza Strip."}, {"id": "560e8893-0cf5-40be-8ad4-fc229824fbac", "title": "Attack on wedding ceremony in France leaves one dead and five wounded | World News", "date": "2024-06-30 13:30", "url": "https://metro.co.uk/2024/06/30/attack-wedding-ceremony-france-leaves-one-dead-five-wounded-21132277/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Believed to be linked to drug traffickers settling scores, the attack took place at Eden Palace reception hall in the northeastern city of Thionville overnight.\nRoughly 100 hundred wedding guests were present, many of them members of the local Turkish community in the city near the German and Luxembourg borders.\nOne man in his thirties was killed, and three people – including a pregnant woman – were seriously injured in the attack shortly after 1am this morning.\nThis region near France’s border with Germany and Luxembourg has gang violence erupt before (Picture: Jean-Christophe Verhaegen/AFP)The pregnant woman, who suffered minor injuries, was left in shock after the attack.\nThis region has seen gang violence before, with five people injured when shooting reupted between viral gangs 13 miles away in the town of Villerupt in May 2023.", "location": "NIEUVILLERS-OURTZOUREN, France.", "classification": "security", "score": 0.991675390083235, "event_breakdown": "Security event in Thionville, France\nOne man in his thirties was killed, and three people – including a pregnant woman – were seriously injured in a shooting attack in the northeastern city of Thionville."}, {"id": "5f65e92b-abf7-4a2f-bc36-098c18f11468", "title": "Masked gunmen kill 1 & injure 5 in attack on wedding hall in France", "date": "2024-06-30 11:45", "url": "https://www.firstpost.com/world/france-wedding-hall-shooting-attack-1-killed-5-injured-13787786.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Two people were seriously injured and one of them was in a critical condition read moreOne person was killed and five others wounded in northeastern France when several masked gunmen opened fire at a wedding ceremony, police sources said on Sunday.\nSources suggested that the attack in the northeastern city of Thionville was linked to a settling of scores between drug traffickers.\nThe shooting took place at a reception hall overnight Saturday to Sunday, with around a hundred people in attendance.\nTwo people were seriously injured and one of them was in a critical condition.\n“The wedding was not targeted as such, it was people who were at the wedding,” the source said.", "location": "FRANCE", "classification": "security", "score": 0.960110547477034, "event_breakdown": "Target Event:\nA Russian army officer was killed and seven other people were wounded on Sunday in a car bombing outside Russia's main military base in the volatile northern province of Chechnya.\n- Category: security\n- Date: 2023-05-29\n\nNon-Target Event:\nOne person was killed and five others wounded in northeastern France when several masked gunmen opened fire at a wedding ceremony, police sources said on Sunday.\n- Category: security\n- Date: 2023-06-09\n\nRelevant events:\n1. A Russian army officer was killed and seven other people were wounded on Sunday in a car bombing outside Russia's main military base in the volatile northern province of Chechnya. \n2. One person was killed and five others wounded in northeastern France when several masked gunmen opened fire at a wedding ceremony, police sources said on Sunday."}, {"id": "49c31555-6cf0-4478-8393-99ef580cd3b6", "title": "One dead in France wedding gun attack", "date": "2024-06-30 13:30", "url": "https://www.aol.co.uk/news/one-dead-france-wedding-gun-125456170.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Police officers are at work on the site of a shooting that occured overnight during a wedding party in Thionville, eastern France - AFPOne person was killed and five others wounded in northeastern France when several masked gunmen opened fire at a wedding ceremony, police sources said on Sunday.\nSources suggested that the attack in the northeastern city of Thionville was linked to a settling of scores between drug traffickers.\nThe shooting took place at a reception hall overnight Saturday to Sunday, with around a hundred people in attendance.\nA glass door pierced with bullet holes could be seen at the scene on Sunday morning - AFP“It was during a wedding,” a police source said.\n“The wedding was not targeted as such, it was people who were at the wedding,” the source said.", "location": "FRANCE", "classification": "security", "score": 0.9182738004473389, "event_breakdown": "Target event:\nA shooting took place at a reception hall overnight Saturday to Sunday in Thionville, France. The shooting was not directed at the wedding but were directed toward the people attending the wedding."}, {"id": "dded1ab4-5534-467c-bd8d-f51a0c5fbd9b", "title": "New Braunfels man arrested for attacking another man with a machete", "date": "2024-06-30 08:45", "url": "https://www.yahoo.com/news/braunfels-man-arrested-attacking-another-025704469.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "New Braunfels man arrested for attacking another man with a macheteNEW BRAUNFELS, Texas - A New Braunfels man is out on bond after police say he was arrested for attacking another man with a machete.\n66-year-old Michael Martin Ochwat was arrested and charged with aggravated assault with a deadly weapon, and taken to the Comal County Jail on June 26.\nNew Braunfels police say just after noon on June 24, officers responded to a report about a stabbing near the intersection of North Market Avenue and E. San Antonio Street.\nWhen they arrived, they found a 55-year-old man from Canyon Lake who had suffered a slash wound to his upper body.\nBoth drivers got out of their vehicles and the suspect, whom police later identified as Ochwat, confronted the victim with a machete-type knife.", "location": "NEW BRAUNFELS", "classification": "security", "score": 0.9258453505196134, "event_breakdown": "```\nMichael Martin Ochwat, 66, was arrested for aggravated assault on a victim with a machete knife. He attacked  a 55-year-old male victim during an altercation on North Market Avenue and E. San Antonio  Street in New Braunfels, Texas. Mr. Ochwat was arrested on June 26th, 2020.\n\n```\nMichael Martin Ochwat, 66, was arrested for aggravated assault with a deadly weapon, and taken to the Comal County Jail on June 26.\nNew Braunfels police say just after noon on June 24, officers responded to a report about a stabbing near the intersection of North Market Avenue and E. San Antonio Street."}, {"id": "409c4853-7e9f-4160-a4c1-52aa50c750c0", "title": "18 Dead , 42 Injured in Deadly Series Of Suicide Attacks In Nigeria", "date": "2024-06-30 02:30", "url": "https://www.india.com/news/world/18-dead-42-injured-in-deadly-series-of-suicide-attacks-in-nigeria-7049386/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNews18 Dead, 42 Injured in Deadly Series Of Suicide Attacks In Nigeria18 Dead, 42 Injured in Deadly Series Of Suicide Attacks In NigeriaAt least 18 people were killed and 42 others injured in the attacks, according to the Borno State Emergency Management Agency (SEMA).\nRepresentational ImageKano, Nigeria: A series of deadly suicide attacks in northeastern Nigeria on Saturday claimed at least 18 lives and left 19 seriously wounded, emergency services said.\nAt least 18 people were killed and 42 others injured in the attacks, according to the Borno State Emergency Management Agency (SEMA).\nNineteen “seriously injured” people were taken to the regional capital Maiduguri, while 23 others were awaiting evacuation, Saidu said in the report.\nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram.", "location": "Nigeria", "classification": "security", "score": 0.527960530800937, "event_breakdown": "At least 18 people were killed and 42 others injured in the attacks, according to the Borno State Emergency Management Agency (SEMA).Representational ImageKano, Nigeria: A series of deadly suicide attacks in northeastern Nigeria on Saturday claimed at least 18 lives and left 19 seriously wounded, emergency services said.At least 18 people were killed and 42 others injured in the attacks, according to the Borno State Emergency Management Agency (SEMA). Nineteen “seriously injured” people were taken to the regional capital Maiduguri, while 23 others were awaiting evacuation, Saidu said in the report."}, {"id": "90109ebf-d9d3-4764-819c-e4317130cbac", "title": "Russia cant fight NATO on the battlefield – so it waging a hybrid war instead", "date": "2024-06-30 07:30", "url": "https://edition.cnn.com/2024/06/30/europe/russia-hybrid-war-nato/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "And while they might look minor in isolation, taken together these incidents amount to what security experts say is Russia’s hybrid war on the West.\nThornton said Russia was resorting to a campaign of sabotage as an alternative to a full-on war with NATO, which would be disastrous for Russia.\nArticle 5 is the cornerstone principle that an attack on one member of NATO is an attack on all members.\nDanylyuk said the Russian security apparatus doesn’t shy away from using criminals to do its dirty work, tapping into its links with international organized crime.\nRussia can only be strong if the West and NATO are weak.", "location": "Kiev", "classification": "security", "score": 0.48370366868577397, "event_breakdown": "Russian forces continue to carry out missile strikes on residential areas of Kharkiv, Ukraine. Lviv, Ukraine: Russian forces continue to carry out airstrikes on residential areas in the city. Kramatorsk, Ukraine: Russian forces continue to carry out missile strikes on residential areas in the city. Chernihiv, Ukraine: Russian forces continue to carry out missile strikes on residential areas in the city. Mariupol, Ukraine: Russian forces continue to carry out missile strikes on residential areas in the city. Donetsk, Ukraine: Russian forces continue to carry out missile strikes on residential areas in the city. Luhansk, Ukraine: Russian forces continue to carry out missile strikes on residential areas in the city."}, {"id": "820db351-b01c-4e14-87e2-f423cf26635b", "title": "Russia cant fight NATO on the battlefield – so it waging a hybrid war instead", "date": "2024-06-30 08:15", "url": "https://www.cnn.com/2024/06/30/europe/russia-hybrid-war-nato/", "domain": "cnn.com", "domain_classification": "International", "message": "And while they might look minor in isolation, taken together these incidents amount to what security experts say is Russia’s hybrid war on the West.\nThornton said Russia was resorting to a campaign of sabotage as an alternative to a full-on war with NATO, which would be disastrous for Russia.\nArticle 5 is the cornerstone principle that an attack on one member of NATO is an attack on all members.\nDanylyuk said the Russian security apparatus doesn’t shy away from using criminals to do its dirty work, tapping into its links with international organized crime.\nRussia can only be strong if the West and NATO are weak.", "location": "LONDON", "classification": "security", "score": 0.48370366868577397, "event_breakdown": "1. Cyberattacks on Ukraine's power grid: Targets of the cyberattacks included the Prykarpattyaoblenergo power company, Kyivoblenergo, Chernivtsioblenergo, and/or the Ternopiloblenergo power company.\n2. US and UK pull out diplomats' families from Ukraine: The United States began to withdraw family members of American diplomats from Ukraine to reinforce embassy security in the face of growing concerns about Russian officials' warnings about invasion.\n3. Russian security forces kill six ISIS militants in Russia's Caucasus region: The security forces stormed a home and killed the six militants in Makhachkala, the capital of Russia's North Caucasus Federal District."}, {"id": "823fb728-50d0-4600-bb15-f4813291a14d", "title": "One dead and five injured in shooting at wedding in France", "date": "2024-06-30 10:15", "url": "https://www.yahoo.com/news/one-dead-five-injured-shooting-092657552.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One dead and five injured in shooting at wedding in FrancePolice officers inspect the site of a shooting that occurred overnight during a wedding party.\nA person was killed and four others wounded during the shooting.\nJean-Christophe Verhaegen/AFP/dpaA shooting at a wedding celebration in France resulted in one fatality and five injuries in the early hours of Sunday, broadcaster France Info reported, citing investigators.\nOne young man was killed and five other victims were injured, some of them critically.\nA pregnant woman was slightly injured and suffered from shock, the local newspaper Le Républicain Lorrain reported.", "location": "France", "classification": "security", "score": 0.9951488056880476, "event_breakdown": "Target Event:\nShooting at a wedding in France results in one fatality and five injuries."}, {"id": "64123269-2e3d-44d3-9cfe-347d407031e6", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages - World", "date": "2024-06-30 12:45", "url": "https://www.brecorder.com/news/40310540/israeli-tanks-advance-into-areas-in-north-and-south-gaza-fighting-rages", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "The Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen, located weapons, and struck military infrastructure.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.\nThe Israeli military said on Sunday its forces continued “targeted, intelligence-based” operations in Rafah, killing several gunmen in different encounters and dismantling tunnels.\nIsraeli forces pound north and south Gaza, battle Hamas in RafahThe Gaza health ministry does not distinguish between combatants and non-combatants but officials say most of the dead are civilians.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.9567961998432108, "event_breakdown": "The Israeli-Gaza Border"}, {"id": "469d29c5-fb3d-4087-b11f-349b20dee9bd", "title": "Urban warfare expert :  Israel being held to double , triple standards  ", "date": "2024-06-30 11:30", "url": "http://www.israelnationalnews.com/news/392322", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "John Spencer, Chair of Urban Warfare Studies at the Modern War Institute at West Point, stated that Israel is being held to \"double and triple standards\" in the war against Hamas.\n“Israel is being measured by double and triple standards” that \"does not exist anywhere in the world,\" Spencer said at a Jerusalem Institute for Public and State Affairs (JCPA) briefing.\nHe added, “The IDF uses tactics that no army has ever seen to prevent harm to civilians and still fulfill its mission.\"\nSpencer used the March IDF operation at the al-Shifa Hospital, which resulted in zero civilian casualties, as an example of the unprecedented lengths Israel goes to avoid harming civilians.\n“In their criticism, Israel's opponents are erasing a remarkable, historic new standard Israel has set.", "location": "Jerusalem", "classification": "security", "score": 0.5953682359359768, "event_breakdown": "John Spencer, Chair of Urban Warfare Studies at the Modern War Institute at West Point, stated that Israel is being held to \"double and triple standards\" in the war against Hamas.More specifically, Israel is being judged by the standards of Russia and Ukraine.On the other hand, the United States utilizes Russian alternatives in this conflict.According to Spencer, Israel is dealing with \"broader issues\" that are not subject to military solutions.Because of this, the conflict will be protracted, which will make it even more unattractive to people on both sides of the conflict."}, {"id": "82bb70a2-6605-46b9-b88c-e9613727a40a", "title": "In the History of War , Tanks With Multiple Cannons Have Always Failed . Until Now", "date": "2024-06-30 13:00", "url": "https://www.popularmechanics.com/military/weapons/a61210862/in-the-history-of-war-tanks-with-multiple-cannons-have-always-failed-until-now/", "domain": "popularmechanics.com", "domain_classification": "Unknown", "message": "But it has also driven demand for new-built tanks to a level unmatched since the end of the Cold War.\nTo mitigate the drone menace, French, German and U.S. engineers have now all proposed next-generation tanks incorporating a seemingly outdated and discarded concept: multiple cannons.\nIn June, KNDS—a German-French conglomerate of defense manufacturers Germany’s KMW and France’s Nexter—unveiled three full-scale concept main battle tanks, all featuring a new main gun called Ascalon.\nWhile tanks with multiple cannons aren’t unprecedented, this design concept mostly vanished post-World War II.\nBut the remainder, including the turret and main gun, is up for grabs.", "location": "Berlin, Germany", "classification": "security", "score": 0.709621225015341, "event_breakdown": "French, German, and US engineers proposed new tanks with multiple cannons to address drone threats."}, {"id": "b8ace96f-da71-461c-ba7a-048d2b34bbad", "title": "Xbox Cloud Gaming : che giochi ci sono ? Lista aggiornata a giugno 2024", "date": "2024-06-30 11:45", "url": "https://www.everyeye.it/notizie/xbox-cloud-gaming-giochi-sono-lista-aggiornata-giugno-2024-726666.html", "domain": "everyeye.it", "domain_classification": "Unknown", "message": "Lo sapete che grazie ad un abbonamento a Xbox Game Pass Ultimate potete giocare ad una selezione di oltre 400 videogiochi via cloud su Xbox, PC, Smart TV Samsung e dispositivi mobili Android e iOS?\nAdesso che lo sapete, consultate la lista completa dei titoli giocabili in streaming aggiornata a giugno 2024.\nXbox Cloud Gaming | Lista dei giochi disponibili (giugno 2024)Ad oggi 30 giugno 2024, sono questi i titoli giocabili via cloud grazie ad un abbonamento a Xbox Game Pass Ultimate.\nTenete presente che la lista è in continuo aggiornamento, dal momento che ogni due settimane circa dei giochi vengono aggiunti ed altri vengono rimossi.\nL'unica eccezione è rappresentata dai Forza, che a causa della scadenza delle licenze dopo un certo periodo di tempo vengono rimossi dal mercato.", "location": "STELLEAKER", "classification": "security", "score": 0.7565980447724688, "event_breakdown": "Too many requests in 1 hour. Try again later."}, {"id": "44f9e79c-6f79-4242-a4e0-6e655dfabcb6", "title": "Fighting Rages in Gaza City Shujaiya for Fourth Day", "date": "2024-06-30 11:30", "url": "https://www.newsmax.com/headline/gaza/2024/06/30/id/1170704/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Heavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after the Israeli army declared Hamas's command structure dismantled in the northern area.\nIt also reported clashes in central Gaza and the southern Rafah area, a week after Prime Minister Benjamin Netanyahu declared that the \"intense phase\" of the war raging since October 7 was nearing an end.\nThe United Nations humanitarian agency OCHA estimated that \"60,000 to 80,000 people were displaced\" from Shujaiya since new fighting broke out there on Thursday and the army issued evacuation orders.\nThe militants also seized 251 hostages, 116 of whom remain in Gaza although the army says 42 are dead.\nIsrael's retaliatory offensive has killed at least 37,877 people, also mostly civilians, according to data from the health ministry in Hamas-run Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.7994084305756173, "event_breakdown": "Israel's ongoing seven-week offensive in Gaza has killed 37,877 people, mostly civilians, according to data from Hamas-run Gaza's health ministry."}, {"id": "632ecb08-183e-4fab-8489-c6beab0c3eac", "title": "Fighting rages in Gaza City Shujaiya for fourth day", "date": "2024-06-30 14:15", "url": "https://www.al-monitor.com/originals/2024/06/fighting-rages-gaza-citys-shujaiya-fourth-day", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 30, 2024 — Gaza Strip (Palestinian Territories) (AFP)Heavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after Israel declared Hamas's command structure dismantled in the northern area.\nThe Israeli military said ground and air forces had carried out raids on compounds used by militants and \"eliminated several terrorists\" over the past 24 hours.\nNetanyahu said Israeli \"forces are operating in Rafah, Shujaiya, everywhere in the Gaza Strip\".\nThe Israeli military launched a ground operation in Rafah in early May, leading to the closure of a key aid crossing.\nHezbollah on Sunday claimed several attacks on Israeli military positions, and Lebanese official media reported Israeli strikes in the border area.", "location": "GAZA CITY", "classification": "security", "score": 0.9792164730823385, "event_breakdown": "IDF forces operating in Gaza Strip; several terrorists eliminated; Netanyahu declares Israeli \"forces are operating in Rafah, Shujaiya, everywhere in the Gaza Strip\""}, {"id": "06b2539d-f04c-410f-9010-c0c9ec2f7ec3", "title": "Gaza : Terror HQ in a clinic and weapons in a UN school", "date": "2024-06-30 13:00", "url": "https://www.israelnationalnews.com/news/392323", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד מפעילות הכוחות דובר צה\"לThe 7th Brigade combat team, including soldiers of the 7th Brigade, the Givati Brigade, and the Paratroopers Brigade, have been leading the 98th Division’s operation in the ​​Shejaiya area over the past few days.\nThis past weekend, the soldiers eliminated dozens of terrorists in close-quarters combat and with aerial fire support.\nCommanding Officer of the 7th Brigade, COL Elad Tzuri IDF SpokespersonAdditionally, the soldiers located a terrorist war room in a medical clinic containing communications devices, enemy documents, and observation devices.\nThis is further evidence of Hamas embedding itself in civilian structures for terror purposes.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "GAZA", "classification": "security", "score": 0.9773208430307989, "event_breakdown": "Event 1 - The current IDF's Givati Paratroopers Brigade and the 7th Brigade lead an operation in the Shejaiya area but are not connected to a marked point.\nEvent 2 - The IDF soldiers eliminated dozens of terrorists in close-quarters combat and with aerial fire support in the Shejaiya area.\nEvent 3 - The IDF located a terrorist war room in a medical clinic in the Shejaiya area. The structure contained communications devices, enemy documents, and observation devices."}, {"id": "6966d4d7-d483-41b8-b517-51435704c815", "title": "Gaza Strip", "date": "2024-06-30 01:30", "url": "https://tribune.com.pk/story/2475274/israel-intensifies-gaza-attacks", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinians search for casualties at the site of Israeli strikes on houses, amid Israel-Hamas conflict, in Gaza City, June 22, 2024.\nAn AFP correspondent reported explosions from the Shujaiya area near Gaza City, and a resident saying bodies were seen on the streets.\nThe armed wings of both Hamas and Islamic Jihad said they were engaged in ongoing fighting with Israeli forces there.\nA resurgence of fighting in the area comes months after Israel declared the command structure of Hamas dismantled in northern Gaza.\nSeparately, a UN spokeswoman, Louise Wateridge, said by video-link she had just returned to central Gaza after four weeks outside the territory.", "location": "GAZA CITY", "classification": "security", "score": 0.9839348698753256, "event_breakdown": "Event 1: AFP correspondent reported explosions in the Shujaiya area near Gaza City on June 22, 2024.\nEvent 2: A resident said that bodies were seen on the streets in the Shujaiya area near Gaza City on June 22, 2024.\nEvent 3: The armed wings of both Hamas and Islamic Jihad said they were engaged in ongoing fighting with Israeli forces in the Shujaiya area near Gaza City on June 22, 2024."}, {"id": "a622547b-1c30-4f72-bf4c-abe4bf414a09", "title": "Netanyahu :  There is no substitute for victory  ", "date": "2024-06-30 13:00", "url": "https://www.israelnationalnews.com/news/392324", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "We are committed to the testament of the fallen – to continue to absolute victory over Hamas.\"\n\"Our forces are operating in Rafah, Shejaiya, everywhere in the Gaza Strip.\n\"To whoever doubts the achieving of these goals, I reiterate: There is no substitute for victory.\nThey said: 'We should go up at once for we are well able to overcome it' and 'It is an exceedingly good land.'\nOur soldiers are exceedingly good.", "location": "Gaza Strip", "classification": "security", "score": 0.5112129310860265, "event_breakdown": "Rafah, Shejaiya, Gaza Strip"}, {"id": "80014eb1-7bc2-4f59-9e25-00122e7826dd", "title": "Russian Forces Liberate Spornoye and Novoalexandrovka Settlements in Donetsk Region", "date": "2024-06-30 11:30", "url": "https://sputnikglobe.com/20240630/russian-forces-liberate-spornoye-and-novoaleksandrovka-settlements-in-donetsk-region-1119188678.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240630/russian-forces-liberate-spornoye-and-novoaleksandrovka-settlements-in-donetsk-region-1119188678.htmlRussian Forces Liberate Spornoye and Novoalexandrovka Settlements in Donetsk RegionRussian Forces Liberate Spornoye and Novoalexandrovka Settlements in Donetsk RegionSputnik InternationalOver the past day, Russian Aerospace Forces and artillery targeted a train unloading military equipment for the 117th Brigade of the Ukrainian Armed Forces, as... 30.06.2024, Sputnik International2024-06-30T10:16+00002024-06-30T10:16+00002024-06-30T11:37+0000russia's special operation in ukrainedonetskrussiakharkovukrainian armed forcesrussian ministry of defenseministry of defensehttps://cdn1.img.sputnikglobe.com/img/07e8/05/05/1118267339_0:160:3072:1888_1920x0_80_0_0_24dcfdde2ba488350c75652e498a4dc0.jpgThe Russian military has liberated Spornoye and Novoalexandrovka in the Donetsk People's Republic, the Russian Ministry of Defense reported on Sunday.Furthermore, Russia's operational-tactical aviation, drones, missile troops, and artillery hit a railway train unloading weapons.\n\"The attack of the assault group of the 214th battalion of the Ukrainian Armed Forces was repelled.\nThe counterattack by the assault group of the 123rd Territorial Defense Brigade was repelled.\nTwo attacks by assault groups from the 110th Territorial Defense Brigade were repelled, as reported by the ministry.According to the department, the Ukrainian Armed Forces lost up to 515 soldiers, two armored combat vehicles, and four vehicles over the day.\nAlso destroyed were an Enclave-AD electronic warfare station and three field ammunition depots of the Ukrainian Armed Forces, as stated in the message from the Russian military department.", "location": "Donetsk", "classification": "security", "score": 0.994050134571475, "event_breakdown": "Russian Ministry of Defense reported on Sunday that Russian Forces liberated 2 settlements in the Donetsk People's Republic."}, {"id": "374d08f9-b511-4df5-935c-e44777e50e79", "title": "My father , the silent Cold War captain , proved how vital our nuclear subs were and are", "date": "2024-06-30 06:15", "url": "https://www.telegraph.co.uk/news/2024/06/30/nuclear-submarines-royal-us-russian-navy-richard-sharpe/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Don’t let anger with the Tories usher in a catastrophic Labour government", "location": "LONDON", "classification": "security", "score": 0.7698448636526123, "event_breakdown": "Target Event: Security forces kill 8 militants in Anbar\nSecurity forces kill 8 militants in Anbar\nEight militants were killed by Iraqi security forces in Anbar province on Thursday, according to the authorities.\nThe Counter-Terrorism Service said in a statement that its forces, along with the police, had dismantled an \"Islamic State\" (IS) sleeper cell in Anbar's capital Ramadi, some 110 km west of Baghdad.\nThe operation targeted militants in various locations in the city, the statement added.\nThe security situation in Iraq has significantly improved over the past year as a bulk of the territory formerly held by IS has been liberated. However, IS remnants still carry out guerilla attacks, mainly in Iraq's vast rural areas."}, {"id": "d92710e8-3c34-48e2-9c25-f732f5e9c64e", "title": "Sudan 14 - Month War : New Battlefront Erupts in Sennar", "date": "2024-06-30 12:15", "url": "https://www.devdiscourse.com/article/law-order/3001168-sudans-14-month-war-new-battlefront-erupts-in-sennar", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Fighting has erupted fiercely between Sudan's military and the notorious paramilitary group, Rapid Support Forces, in the central province of Sennar, officials confirmed on Sunday.\nThis marks a new front in the 14-month war that has plunged the African nation to the precipice of famine.\nThe Rapid Support Forces commenced their offensive earlier this week, targeting Jebal Moya village and subsequently advancing to Singa, the province's capital.\nContrarily, Brigadier Nabil Abdalla, spokesperson for the Sudanese armed forces, stated the military had regained the facility, with combat continuing on Sunday.\n'They are repeating the violence seen in Khartoum and other cities,' said Abdel-Rahman al-Taj, a Singa local who escaped to Blue Nile province.", "location": "Sennar", "classification": "security", "score": 0.8280145517278389, "event_breakdown": "Target Event: Fighting has erupted fiercely between Sudan's military and the notorious paramilitary group, Rapid Support Forces, in the central province of Sennar."}, {"id": "d8e13fff-a532-42e3-b0f2-2e443456f251", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages", "date": "2024-06-30 13:30", "url": "https://www.aol.com/israeli-tanks-advance-areas-north-090736677.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "\"Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.\nThe Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen.\nIsraeli forces located military infrastructure inside a United Nations school and discovered dozens of weapons and \"valuable intelligence documents\", the military also said.\nMore than eight months into Israel's air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.9845131298685053, "event_breakdown": "Israel-Gaza conflict"}, {"id": "43c3dfc2-eff1-49ae-9039-835cb213780e", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages", "date": "2024-06-30 12:45", "url": "https://www.swissinfo.ch/eng/israeli-tanks-advance-into-areas-in-north-and-south-gaza%2c-fighting-rages/82263586", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli tanks advance into areas in north and south Gaza, fighting ragesreuters_tickers5 minutesBy Nidal al-Mughrabi and Kamel HamdanCAIRO/GAZA (Reuters) -Israeli forces advanced further on Sunday into the Shejaia neighbourhood of northern Gaza and also pushed deeper into western and central Rafah in the south, killing at least six Palestinians and destroying several homes, residents said.\n“Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.\nThe Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen.\nIsraeli forces located military infrastructure inside a United Nations school and discovered dozens of weapons and “valuable intelligence documents”, the military also said.\nMore than eight months into Israel’s air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.", "location": "GAZA", "classification": "security", "score": 0.9841130326483327, "event_breakdown": "Israeli forces advanced further on Sunday into the Shejaia neighbourhood of northern Gaza and also pushed deeper into western and central Rafah in the south, killing at least six Palestinians and destroying several homes, residents said."}, {"id": "634da5d5-094f-4bf4-90e6-c2a624891c31", "title": "Former defence chief , Adm . Ogohi dies at 75 - QUICK NEWS AFRICA", "date": "2024-06-30 11:45", "url": "https://quicknews-africa.net/former-defence-chief-adm-ogohi-dies-at-75/", "domain": "quicknews-africa.net", "domain_classification": "Unknown", "message": "A former Chief of Defence Staff, Adm. Ibrahim Ogohi, has passed on after a brief illness at the age of 75.\nIn a brief statement by the Acting Director, Defence Information, Brig.-Gen. Tukur Gusau, on Sunday, the former defence chief died in the early hours of Sunday, at his Abuja home.\nHe was the defence chief between 1999 and 2003, and was the first Nigerian Navy officer to attain a four-star general rank.\n“With deep sorrow, I announce the death of Admiral Ibrahim Ogohi (rtd), a former Chief of Defence Staff (1999-2003).\nIn 1992, he was Directing Staff in the National War College, and Deputy Commandant, Armed Forces Command Staff College, Jaji in 1995.", "location": "Jaji", "classification": "security", "score": 0.43556485390874583, "event_breakdown": "1. A former Chief of Defence Staff of Nigeria, Ibrahim Ogohi, passed away in Abuja. He was aged 75. He died in his Abuja residence in the early of Sunday.\n2. The Acting Director, Defence Information, Brig.-Gen. Tukur Gusau, delivered a brief press statement saying Ibrahim Ogohi was Nigeria's Former Chief of Defence Staff. His term ran from 1999 to 2003."}, {"id": "1e15fe43-e7b3-4e23-a1e4-b0a31d90e3d5", "title": "WWIII Watch : Iran Threatens To Get Bombed To Stone Age If Israel Attacks Hezbollah - Pirate Cove", "date": "2024-06-30 14:30", "url": "https://www.thepiratescove.us/2024/06/30/wwiii-watch-iran-threatens-to-get-bombed-to-stone-age-if-israel-attacks-hezbollah/", "domain": "thepiratescove.us", "domain_classification": "Unknown", "message": "Let’s see: Iran’s proxy Hezbollah attacks Israel from Lebanon, specifically going after civilians.\nIsrael makes threats to annihilate Hezbollah (which would actually make Lebanon happy and help their economy).\nAnd thenIran threatens ‘obliterating war’ if Israel launches full-scale conflict with Hezbollah Iran is threatening an “obliterating war” if Israel launches an all-out conflict against Hezbollah in Lebanon.\n“Should [Israel] embark on full-scale military aggression, an obliterating war will ensue,” the Iranian UN mission said in a post on X late Friday.\n(Reuters) Israeli Foreign Minister Israel Katz said on Saturday that Iran’s message of an “obliterating war” made it worthy of destruction.", "location": "Lebanon", "classification": "security", "score": 0.43358371678875585, "event_breakdown": "Iran Threatens ‘Obliterating War’ if Israel Launches Full-Scale Conflict with Hezbollah\n(Reuters) Iran is threatening to destroy Israel if it launches a full-scale conflict against Hezbollah in Lebanon. This position is now being seen as a serious threat by the Israeli government."}, {"id": "c7e1242d-7809-48e2-8e34-fc2e4456ef27", "title": "NIA raids multiple locations in J & K Rajouri in connection with Reasi terror attack case", "date": "2024-06-30 13:00", "url": "https://www.dnaindia.com/india/report-nia-raids-multiple-locations-in-jk-s-rajouri-in-connection-with-reasi-terror-attack-case-3095240", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "NIA raids multiple locations in J&K's Rajouri in connection with Reasi terror attack caseThe investigation conducted by the NIA revealed that Hakam had given the terrorists engaged in the June 9 attack food, safe housing, and logistical support.\nIn relation to the Reasi terror attack, the National Investigation Agency (NIA) conducted searches at multiple sites in the Jammu and Kashmir district of Rajouri on Sunday.\nThe investigation conducted by the NIA revealed that Hakam had given the terrorists engaged in the June 9 attack food, safe housing, and logistical support.\nIn relation to the Reasi terror attack, the National Investigation Agency (NIA) conducted searches at multiple sites in the Jammu and Kashmir district of Rajouri on Sunday.\nIn connection with the attack investigation, the Jammu and Kashmir Police have taken about fifty persons into custody.", "location": "Rajouri", "classification": "security", "score": 0.455131848680987, "event_breakdown": "Target event not found"}, {"id": "99a2359b-b7c0-49fb-995f-674ae9b65b1f", "title": "Fighting rages in Gaza City Shujaiya for fourth day", "date": "2024-06-30 11:30", "url": "https://www.naharnet.com:443/stories/en/306256-fighting-rages-in-gaza-city-s-shujaiya-for-fourth-day", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Heavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after the Israeli army declared Hamas' command structure dismantled in the northern area.\nThe United Nations humanitarian agency OCHA estimated that \"60,000 to 80,000 people were displaced\" from Shujaiya since new fighting broke out there on Thursday and the Israeli army issued evacuation orders.\nThe militants also seized 251 hostages, 116 of whom remain in Gaza although the Israeli army says 42 are dead.\nIsrael's retaliatory offensive has killed at least 37,877 people, also mostly civilians, according to data from the health ministry in Gaza.\nThere's no water there, there's no sanitation, there's no food.", "location": "GAZA CITY", "classification": "security", "score": 0.8499542531530032, "event_breakdown": "Israel's retaliatory offensive has killed at least 37,877 people, also mostly civilians."}, {"id": "ed57c013-c224-40be-b476-d0227981a394", "title": "Royal Auxiliary Airforce centenary : Celebrating Wale squadron", "date": "2024-06-30 12:45", "url": "https://www.bbc.com/news/articles/cgr58zmmnjro", "domain": "bbc.com", "domain_classification": "International", "message": "The Auxiliary Air Force, now referred to as the Royal Auxiliary Air Force, recruited civilian air and ground crew who gave up their weekends to train alongside full-time squadrons on operational missions.\nBy 1937, Wales established its own Auxiliary squadron - Squadron 614, County of Glamorgan.\nHowever, despite the importance of the Auxiliary Air Force, the force wasn’t an easy club to get into – at the beginning at least.\nThe 614 Squadron was deployed to Scotland to defend against a potential German invasion via a northern route.\n614 was the only Royal Auxiliary Air Force squadron selected for that perilous task, which involved missions over not only Italy but also Central Europe and the Balkans.", "location": "Glamorgan", "classification": "security", "score": 0.6419321136393648, "event_breakdown": "Royal Auxiliary Air Force 614 was deployed to Scotland to defend against a potential German invasion via a northern route."}, {"id": "9d377a77-6275-4100-a1e8-d23c915294f4", "title": "Three Hezbollah members killed in Israeli airstrike on Lebanese village", "date": "2024-06-30 12:45", "url": "https://www.prokerala.com/news/articles/a1543493.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, June 30 : Three Hezbollah members were killed on Sunday in an Israeli airstrike in the southeast village of Houla, a media report said.\nAn Israeli drone targeted, with four air-to-surface missiles, a two-story building in Houla, killing three Hezbollah members and causing severe damage to neighbouring homes, Lebanese military sources told Xinhua.\nFor its part, Hezbollah announced that it attacked the Israeli sites of Misqav Am, al-Motella, and Al-Alam.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nSince the start of the confrontations on both sides of the border between Lebanon and Israel, 553 people have been killed, including 356 Hezbollah members and 100 civilians, according to Lebanese security and medical reports.", "location": "BEIRUT", "classification": "security", "score": 0.9847977036437418, "event_breakdown": "Houla, Lebanon - Three Hezbollah members were killed on Sunday in an Israeli airstrike in the southeast village of Houla.\nMisqav Am, al-Motella and Al-Alam - Hezbollah attacked these sites in Israel in retaliation for the airstrike on its positions in Houla."}, {"id": "57ad9c81-e8a7-448b-a945-53b639e09499", "title": "Iran Warns of  Obliterating War  if Israel Launches Attack on Lebanon", "date": "2024-06-30 19:00", "url": "https://www.breitbart.com/middle-east/2024/06/30/iran-warns-obliterating-war-israel-launches-attack-lebanon/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Iran warned of an “obliterating war” if Israel launches a full-scale attack on Hezbollah, the Iranian-backed terror group in southern Lebanon.\nOn Thursday, Hezbollah fired rockets at an Israeli military base, after Israel had launched strikes on Nabatieh, a city in Lebanon, and the town of Sohmor.\nNeither the Lebanese military nor the United Nations has been willing or able to enforce the resolution.\nPresident Joe Biden’s warning to Hezbollah and Iran in October – “don’t!” – has been ineffective in deterring the terrorist group.\nSecretary of State Antony Blinken has suggested that “a ceasefire in Gaza” would be the “best way” to deescalate the fighting and ongoing tensions between Israel and Hezbollah, according to the Times of Israel.", "location": "Lebanon", "classification": "security", "score": 0.5814228847553159, "event_breakdown": "Location: Lebanon\nTarget event: Following a brief conflict between Israel and Lebanon, the Iranian regime threatens to launch a full-scale attack on Israel if Israel launches a full-on assault on the terrorist organization Hezbollah."}, {"id": "e97bb2ce-a8c3-487e-bc8c-32023724243c", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 18:15", "url": "https://isp.netscape.com/news/world/story/0001/20240630/df615e0380a60661e27cfbb85f57dffd", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other peopleNUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days.\nThe Israeli military said an explosive drone launched by Hezbollah crashed into the Golan Heights on Sunday, severely wounding a soldier and lightly hurting 17 others.", "location": "NUR SHAMS REFUGEE CAMP", "classification": "security", "score": 0.9894279131387786, "event_breakdown": "Israeli airstrike in northern West Bank kills a Palestinian militant and wounds 5 other people."}, {"id": "f2209cdd-b0d8-41c0-b81c-3e5c39da381e", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people | iNFOnews", "date": "2024-06-30 18:00", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp11604086", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other peopleOriginal Publication Date June 30, 2024 - 10:26 AMNUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days.\nThe Israeli military said an explosive drone launched by Hezbollah crashed into the Golan Heights on Sunday, severely wounding a soldier and lightly hurting 17 others.", "location": "NUR SHAMS REFUGEE CAMP, West Bank.", "classification": "security", "score": 0.990273874007247, "event_breakdown": "An Israeli airstrike in the northern West Bank killed a Palestinian militant and wounded five other people on June 30, 2024, according to Palestinian officials. The Israeli military confirmed the attack on a home, stating that militants were inside and responsible for recent attacks on Israeli targets. Over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war. Israeli forces have been battling Palestinian militants in Gaza City in recent days. An explosive drone launched by Hezbollah crashed into the Golan Heights on June 30, severely wounding a soldier and lightly hurting 17 others."}, {"id": "26729b9a-7d4f-460f-a2cd-fa17557ee7aa", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 18:00", "url": "https://www.yahoo.com/news/israeli-airstrike-northern-west-bank-172312772.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Palestinian health officials said one person was killed and several wounded during an Israeli operation in the Nur Shams refugee camp in the northern West Bank.\nIsrael frequently operates in the area, saying it is a stronghold of Palestinian militants.\n(AP Photo/Majdi Mohammed)NUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe occupied West Bank has experienced a surge in violence since the war in Gaza erupted in October.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.", "location": "NUR SHAMS REFUGEE CAMP", "classification": "security", "score": 0.9748984636262188, "event_breakdown": "1. Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing Palestinian militant and wounding five other people.\n2. The occupied West Bank has experienced a surge in violence since the war in Gaza erupted in October."}, {"id": "c09c19ce-1c15-459f-9142-c38b35c0d8b6", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 18:15", "url": "https://www.aol.com/israeli-airstrike-northern-west-bank-172312619.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "NUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe strike took place in Nur Shams, an urban refugee camp that has been a frequent target of the Israeli military and is known as a stronghold of Palestinian militants.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days.", "location": "NUR SHAMS REFUGEE CAMP", "classification": "security", "score": 0.9921869536715181, "event_breakdown": "Israeli Troops Carried out an Airstrike in Northern West Bank\nNUR SHAMS REFUGEE CAMP, West Bank (AP)-Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe strike took place in Nur Shams, an urban refugee camp that has been a frequent target of the Israeli military and is known as a stronghold of Palestinian militants.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days."}, {"id": "713378e3-deac-49e2-995f-48b12f287ad9", "title": "Israeli Airstrike in the Northern West Bank Kills a Palestinian Militant and Wounds 5 Other People", "date": "2024-06-30 19:30", "url": "https://www.newsmax.com/world/globaltalk/israel-palestinians-gaza-west-bank-hamas-war-rafah/2024/06/30/id/1170733/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "NUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe strike took place in Nur Shams, an urban refugee camp that has been a frequent target of the Israeli military and is known as a stronghold of Palestinian militants.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days.", "location": "NUR SHAMS REFUGEE CAMP", "classification": "security", "score": 0.9921869536715181, "event_breakdown": "Airstrike in Nur Shams refugee camp, West Bank\nPalestinian militant killed, five wounded in Israeli airstrike"}, {"id": "370bba85-731c-4306-9f0f-97d696a30963", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 19:00", "url": "https://www.startribune.com/israeli-airstrike-in-the-northern-west-bank-kills-a-palestinian-militant-and-wounds-5-other-people/600377411/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "NUR SHAMS REFUGEE CAMP, West Bank — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nIsraeli forces have been battling Palestinian militants in an eastern part of Gaza City, Shijaiyah, in recent days.\nThe Israeli military said an explosive drone launched by Hezbollah crashed into the Golan Heights on Sunday, severely wounding a soldier and lightly hurting 17 others.", "location": "NUR SHAMS REFUGEE CAMP, West Bank.", "classification": "security", "score": 0.98789310811698, "event_breakdown": "Israel strike kills Palestinian militant, wounds five\nAn Israeli airstrike in the northern West Bank killed a Palestinian militant and wounded five other people on Sunday, according to Palestinian health officials. Israeli military confirmed the attack on the home, saying militants including al-Jaber were behind recent attacks on Israeli targets.\nThe military said an explosive drone launched by Hezbollah crashed into the Golan Heights Sunday, severely wounding a soldier and lightly hurting 17 others."}, {"id": "275f2b5b-a4ef-465e-a822-8665004f145c", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 18:00", "url": "https://www.local10.com/news/world/2024/06/30/israeli-airstrike-in-the-northern-west-bank-kills-a-palestinian-militant-and-wounds-5-other-people/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Palestinian health officials said one person was killed and several wounded during an Israeli operation in the Nur Shams refugee camp in the northern West Bank.\nIsrael frequently operates in the area, saying it is a stronghold of Palestinian militants.\n(AP Photo/Majdi Mohammed)Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.", "location": "West Bank.", "classification": "security", "score": 0.9843607325680774, "event_breakdown": "Airstrike kills one militant, wounds five others in northern West Bank"}, {"id": "fb7cdde8-016b-4963-b350-399efe1302c8", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people", "date": "2024-06-30 18:00", "url": "https://www.clickorlando.com/news/world/2024/06/30/israeli-airstrike-in-the-northern-west-bank-kills-a-palestinian-militant-and-wounds-5-other-people/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Palestinian health officials said one person was killed and several wounded during an Israeli operation in the Nur Shams refugee camp in the northern West Bank.\nIsrael frequently operates in the area, saying it is a stronghold of Palestinian militants.\n(AP Photo/Majdi Mohammed)Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nThe Israeli military confirmed an attack on the home, saying that militants inside, including al-Jaber, were responsible for recent attacks on Israeli targets.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.", "location": "West Bank", "classification": "security", "score": 0.9843607325680774, "event_breakdown": "Israeli soldiers shot and killed several Palestinians and wounded many others after Palestinian gunmen opened fire at Israeli soldiers in the al-Amari refugee camp in the West Bank."}, {"id": "3f759fc9-ec1c-4783-be9e-870a53cc7f06", "title": "Deadly Russian Su - 34 bombers are sitting ducks for Ukraine ATACMS . But it cant attack without US approval . ", "date": "2024-06-30 16:45", "url": "https://www.yahoo.com/news/deadly-russian-su-34-bombers-155438922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Deadly Russian Su-34 bombers are sitting ducks for Ukraine's ATACMS.\nDeadly Russian Su-34 bombers are sitting ducks for Ukraine's ATACMS.\nNear the border of northeastern Ukraine, some of Russia's lethal Su-34 fighter jets sit in the open.\nVoronezh Malshevo airbase is a launching point for jets operated by the Russian Air Force's 47th Guards Bomber Aviation Regiment.\nEarlier this month, Ukrainian forces launched at least 70 drones at a military airbase in Russia's Rostov region, almost 200 miles from the Ukrainian border.", "location": "The main focus of the event takes place near northeastern Ukraine.", "classification": "security", "score": 0.8378326904649309, "event_breakdown": "Near the border of northeastern Ukraine, Russian Su-34 fighter jets are sitting targets waiting to be attacked by Ukrainian forces armed with an American anti-tactical ballistic missile known as the ATACMS.  Ukrainian forces have fired at least 70 drones at a Russian airbase 200 miles from the border. The Russian airbase is home to many Su-34 fighter jets operated by the Russian Air Force's 47th Ground Attack Regiment."}, {"id": "4e39ca1c-983b-4d7f-90ac-0a57d35f7bbc", "title": "OKC police officer accused of rape , domestic assault and battery", "date": "2024-06-30 17:30", "url": "https://www.yahoo.com/news/okc-police-officer-accused-rape-161429228.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Oklahoma City police officer was arrested on complaints of rape and domestic assault and battery.\nAn Oklahoma City police officer was arrested and booked into jail Saturday on complaints including rape, domestic assault and battery, and kidnapping.\nThe Oklahoma City Police Department did not immediately return a request for comment Sunday.\nKOCO-TV reported that Blanchard police were notified of a possible domestic assault Friday involving Stark and an alleged victim leaving a restaurant in a police vehicle.\nThis article originally appeared on Oklahoman: Alleged victim accuses Oklahoma City police officer of kidnapping, rape", "location": "OKLAHOMA CITY", "classification": "security", "score": 0.8863675575832655, "event_breakdown": "1. An Oklahoma City police officer was arrested on complaints of rape and domestic assault and battery."}, {"id": "a1929e82-6605-4718-91b8-dd8fcffce78a", "title": "Close to the Ukrainian Border , Russia Deadliest Jets Sit in the Open", "date": "2024-06-30 16:15", "url": "https://www.businessinsider.com/russia-ukraine-su34-fighter-bombers-us-atacms-dones-attack-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Near the border of northeastern Ukraine, some of Russia's lethal Su-34 fighter jets sit in the open.\nThe bombers have been used to pound Ukraine with regular barrages of glide bombs.\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementNear the border with northeastern Ukraine, some of Russia's deadly Su-34 fighter bombers lie exposed on the tarmac of a military airfield as they await orders to carry out their next attack.\nVoronezh Malshevo airbase is a launching point for jets operated by the Russian Air Force's 47th Guards Bomber Aviation Regiment.", "location": ".\nUkraine", "classification": "security", "score": 0.7158346086806269, "event_breakdown": "Su-34: Near the border of northeastern Ukraine, some of Russia's lethal Su-34 fighter jets sit in the open. (source: Daily Mail)"}, {"id": "cbfc1f61-c6d2-4276-b331-68f1677d1257", "title": "Israeli airstrike in the northern West Bank kills a Palestinian militant and wounds 5 other people – Winnipeg Free Press", "date": "2024-06-30 18:15", "url": "https://www.winnipegfreepress.com/world/2024/06/30/israeli-airstrike-in-the-northern-west-bank-kills-a-palestinian-militant-and-wounds-5-other-people", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "NUR SHAMS REFUGEE CAMP, West Bank (AP) — Israeli troops carried out an airstrike in the northern West Bank on Sunday, killing a Palestinian militant and wounding five other people, Palestinian health officials said.\nPalestinian health officials said one person was killed and several wounded during an Israeli operation in the Nur Shams refugee camp in the northern West Bank.\nThe occupied West Bank has experienced a surge in violence since the war in Gaza erupted in October.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nPalestinian health officials said one person was killed and several wounded during an Israeli operation in the Nur Shams refugee camp in the northern West Bank.", "location": "NUR SHAMS REFUGEE CAMP", "classification": "security", "score": 0.975212908409808, "event_breakdown": "Israeli forces have killed one and wounded several during an operation in the Nur Shams refugee camp, north of the West Bank city of Nablus on Sunday, Palestinian officials claim."}, {"id": "94a6d7ff-6bc9-45cb-ae3f-5400a5b93cff", "title": "To Survive , Israel Must Strike Iran Now - Opinion", "date": "2024-06-30 17:00", "url": "https://www.haaretz.com/opinion/2024-06-30/ty-article-opinion/.premium/to-survive-israel-must-strike-iran-now/00000190-69e8-d01f-abbe-7de8d2260000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "National Security Minister Itamar Ben-Gvir described Israel's response to the Iran's missile attack on Israel on 13 April as a dardaleh – slang for a weak soccer kick.\nReports after Israel's retaliation said the attack had destroyed a small, isolated radar facility not far from Natanz, one of the sites where Iran produces enriched uranium.\nUnfortunately – as Ben-Gvir is a dangerous, despicable minister –he was right.", "location": "Natanz", "classification": "security", "score": 0.8422261659220022, "event_breakdown": "National Security Minister Itamar Ben-Gvir described Israel's response to the Iran's missile attack on Israel on 13 April as a dardaleh, or a weak soccer kick.\nReports after Israel's retaliation said the attack had destroyed a small, isolated radar facility not far from Natanz, one of the sites where Iran produces enriched uranium.\nUnfortunately - as Ben-Gvir is a dangerous, despicable minister -he was right."}, {"id": "cbbf18a7-9f11-489a-b8d2-f0cd0039295d", "title": "Denver police investigate 3 separate stabbings overnight", "date": "2024-06-30 19:30", "url": "https://www.yahoo.com/news/denver-police-investigate-3-separate-145931512.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DENVER (KDVR) — The Denver Police Department investigated three different stabbing incidents in the city overnight and early Sunday morning.\nThe extent of injuries in two of the incidents was unknown, while the injuries in one did not appear to be life-threatening.\nColfax Avenue and Verbena StreetPolice said one victim was taken to a local hospital with unknown injuries after a stabbing in the area of Colfax Avenue and Verbena Street.\nColfax Avenue and BroadwayPolice said officers were in the area of Colfax Avenue and Broadway to investigate a stabbing.\nOne person was taken to a local hospital with what appeared to be non-life-threatening injuries.", "location": ")\nColfax Avenue", "classification": "security", "score": 0.9693625751753318, "event_breakdown": "Colfax Avenue and Broadway: One person was taken to the hospital with a non-life-threatening injury as a result of a stabbing.\nColfax Avenue and Verbena Street: One person was taken to a hospital with unknown injuries as a result of a stabbing."}, {"id": "e98c3da4-83e5-4b61-b212-3c46e17d87e9", "title": "Texas city is home to anchor , propeller , disaster memorials", "date": "2024-06-30 18:00", "url": "http://www.lmtonline.com/news/houston-texas/article/anchor-propeller-texas-city-disaster-19547962.php", "domain": "lmtonline.com", "domain_classification": "Unknown", "message": "Part of the anchor from the SS Grandcamp, which was blown 1.62 miles from the ship when it exploded in the 1947 Texas City Disaster, at Memorial Park in Texas City.\nIn Texas City, you may come across the bulk of an anchor upon a visit to the city's Memorial Park.\nA jagged propeller salvaged from the SS High Flyer, which would become a monument near the Texas City Dike.\nThe anchor in 1962 became part of Anchor Park near off Dike Road, while part of the anchor rests at Texas City Memorial Park, which is at 25th Avenue and 29th Street.\nAccessing the memorialsThe Memorial Park anchor piece is easily accessible by car, with ample parking right by the anchor.", "location": "Texas City", "classification": "security", "score": 0.6533945811530504, "event_breakdown": "The Texas City Memorial Park anchor piece represents the SS Grandcamp, an older ship in the Texas City harbor."}, {"id": "43eb30ec-dafe-45ef-a285-ae2537c66c8a", "title": "Per Official Israeli Count – These Are the Israeli Soldiers Killed in June", "date": "2024-06-30 16:15", "url": "https://www.palestinechronicle.com/per-official-israeli-count-these-are-the-israeli-soldiers-killed-in-june/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "Al-Jazeera cited Israel’s own official information about the number of Israeli soldiers killed in June, and under which circumstances they were killed.\nThese are some of the disclosed information, as permitted by the Israeli military itself:June 5: A soldier is killed in a Hezbollah drone attack on a gathering of soldiers in Harfaish.\nJune 10: Four soldiers are killed in an ambush at a booby-trapped building in central Rafah.\nJune 21: Two soldiers are killed by mortar shells in central Gaza.\nJune 29: Two soldiers are killed in fighting in the Shejaiya neighborhood east of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9961036640390704, "event_breakdown": "June 5: A soldier is killed in a Hezbollah drone attack on a gathering of soldiers in Harfaish.\nJune 10: Four soldiers are killed in an ambush at a booby-trapped building in central Rafah.\nJune 21: Two soldiers are killed by mortar shells in central Gaza.\nJune 29: Two soldiers are killed in fighting in the Shejaiya neighborhood east of Gaza City."}, {"id": "2439c34c-15eb-444d-8f74-8a2315ba1516", "title": "Russian missile attack on eastern Ukraine kills seven , three of them children", "date": "2024-06-30 16:15", "url": "https://www.euronews.com/my-europe/2024/06/30/russian-missile-attack-on-eastern-ukraine-kills-seven-three-of-them-children", "domain": "euronews.com", "domain_classification": "Unknown", "message": "By Euronews with AP & EBUA Russian attack on Vilniansk, a town in the eastern region of Zaporizhzhia, killed seven people, three of them children, officials said on Sunday.\nADVERTISEMENTA Russian missile attack on the town of Vilniansk in the eastern Ukrainian region of Zaporizhzhia killed seven people, including three children, local officials said on Sunday.\nAt least 38 people were also wounded in Saturday evening's attack, authorities said, and declared a day of mourning on Sunday.\nWithout any military infrastructure.”Police investigators and the Security Service of Ukraine have opened an investigation into the potential war crime.\nVilniansk is in the Zaporizhzhia region, less than 30 kilometres from the local capital and north of the front lines, as Russian forces continue to occupy part of the province.", "location": "ZAPORIZHZHIA REGION", "classification": "security", "score": 0.7558355426292973, "event_breakdown": "Russian missile attack on Vilniansk, Ukraine"}, {"id": "d10e25fc-5e5e-46fc-ab87-2f32ad6e64d6", "title": "Russian Officials Report 5 Dead in a Drone Strike as a Russian Attack Hits an Apartment Block", "date": "2024-06-30 00:15", "url": "https://www.newsmax.com/globaltalk/russia-ukraine-war-dnipro-kursk/2024/06/29/id/1170652/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine (AP) — A Ukrainian drone strike killed at least five people in Russia's Kursk region, local officials said Saturday, while rescuers in the Ukrainian city of Dnipro dug through rubble after a Russian attack ripped through a nine-story residential building, leaving one dead.\nTwo children were among the victims of the Ukranian attack in the village of Gorodishche on the Russian-Ukrainian border, Gov.\nIn Dnipro, at least one person died and 12 were injured, including a 7-month-old girl, after a Russian strike destroyed the top four floors of the apartment bloc Friday evening, regional head Serhii Lysak said.\nDiscussing the attack in Dnipro, Zelenskyy said it was a reminder to Ukraine’s allies that the country needed more air defense systems.\nThe Ukrainian air force said Saturday that it had downed 10 Russian drones overnight.", "location": "Dnipro", "classification": "security", "score": 0.7502057482120488, "event_breakdown": "KYIV, Ukraine (AP) — A Ukrainian drone strike killed five people in Russia's Kursk region. Meanwhile, rescuers in the Ukrainian city of Dnipro dug through rubble after a Russian attack ripped through a nine-story residential building, leaving one dead.\nIn other news, Italy has accused migrant NGOs of flying in millions of euros."}, {"id": "bc4c69b1-afef-4da9-8863-a514880d18ef", "title": "Hezbollah drones strike Israeli tank force base - World", "date": "2024-06-30 17:45", "url": "https://tass.com/world/1810533", "domain": "tass.com", "domain_classification": "Unknown", "message": "Hezbollah has claimed responsibility for a drone attack on an Israeli tank bases in northern Israel.\n\"Islamic resistance units use combat drones to hit the area of the deployment of the 188th tank brigade of the Israeli army near Revaya.\nAs a result of the attack, a command center and a barrack of soldiers of tank battalions were struck,\" Hezbollah said on its Telegram channel.\nAccording to Hezbollah, the drone attack was followed by a fire.\nApart from that, it was that anti-tank guided missiles were used to strike mechanized patrols in Ein Iron, Manara, and Metula.", "location": "The target of the Hezbollah drone attack was the Israeli army’s 188th tank brigade", "classification": "security", "score": 0.9924070859418964, "event_breakdown": "Hezbollah has claimed responsibility for a drone attack on an Israeli tank bases in northern Israel and multiple attacks on mechanized patrols."}, {"id": "a14712f4-66fd-4c9e-b7bc-77810d6c2301", "title": "Deadly Russian Glide Bomb Hits Postal Sorting Hub in Kharkiv", "date": "2024-06-30 17:45", "url": "https://www.bnnbloomberg.ca/deadly-russian-glide-bomb-hits-postal-sorting-hub-in-kharkiv-1.2091349", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- A Russian jet fired a glide bomb at Kharkiv, killing at least one civilian at a mail hub as Ukraine’s second-largest city continues to suffer from frequent aerial strikes.\nThe bomb targeted a sorting terminal of Nova Poshta, Ukraine’s major private private parcel delivery service, according to a statement from the company posted on Facebook.\nThe attack highlighted danger to Kharkiv from glide bombs, which are equipped with flight control surfaces that can expand their range.\n“Ukraine needs the necessary means to destroy the carriers of these bombs, including Russian combat aircraft, wherever they are.\nEarly Sunday evening, the regional city administration in Kyiv reported damage to an apartment block in the capital struck by debris from a Russian missile.", "location": "Kharkiv.", "classification": "security", "score": 0.822999415306563, "event_breakdown": "Glide bomb fired at a sorting terminal in Kharkiv by Russia, killing one civilian."}, {"id": "19f1268a-1a21-4765-a2b5-dbb4ddac7c41", "title": "Fall of missile debris in Kyiv Oblast results in people injured and buildings damaged", "date": "2024-06-30 19:30", "url": "https://www.yahoo.com/news/fall-missile-debris-kyiv-oblast-173540465.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Fall of missile debris in Kyiv Oblast results in people injured and buildings damagedThe debris of Russian missiles has fallen in Kyiv Oblast, injuring people and damaging buildings.\nSource: the Kyiv Oblast Military AdministrationQuote: \"The enemy once again tried to attack our region with missiles.\nAir defence responded in Kyiv Oblast.\nAll emergency services and ambulances are headed to where the debris fell.\nMissile debris fell on a residential building in the Obolonskyi district of Kyiv and damaged it, causing a fire.", "location": "KYIV OBLAST", "classification": "security", "score": 0.9743144702982075, "event_breakdown": "Debris of Russian missiles has fallen in Kyiv Oblast, injuring people and damaging buildings.  The debris fell on a residential building in the Obolonskyi district of Kyiv and damaged it, causing a fire."}, {"id": "24b67c1c-3937-4f82-bd5b-901b1cc6a9a8", "title": "War Update : 47 Combat Clashes On Front Lines Today , Most Of Them On Pokrovsk Axis", "date": "2024-06-30 11:45", "url": "https://menafn.com/1108390042/War-Update-47-Combat-Clashes-On-Front-Lines-Today-Most-Of-Them-On-Pokrovsk-Axis", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Forty-seven combat engagements have already occurred on the front lines today, with Ukrainian forces repelling ten assaults in the Pokrovsk sector.\nIn the Kharkiv sector, Ukrainian forces successfully repelled one enemy attack near Hlyboke.\nIn the Kramatorsk sector, Ukrainian troops are repelling three enemy attacks near Ivanivske and Chasiv Yar.\nTen assault operations have been stopped, and five attacks near Prohres, Novooleksandrivka, Vozdvyzheneka, Yevhenivka and Novoselivka Persha are ongoing.\nOn the Orikhiv axis, Ukrainian forces stopped two enemy attacks near Robotyne.", "location": "The exact location cannot be determined from the provided information.", "classification": "security", "score": 0.9874035494669721, "event_breakdown": "List of current security events reported in text that can be placed on a map:\n- In the Kharkiv sector, Ukrainian forces successfully repelled one enemy attack near Hlyboke.\n- On the Orikhiv axis, Ukrainian forces stopped two enemy attacks near Robotyne."}, {"id": "4d8b95f2-6295-46bc-89f6-01feb6a950a7", "title": "West Bank Commander Assassinated by Missile - Israel Escalates Violence ,  Legalize Settlements", "date": "2024-06-30 16:15", "url": "https://www.palestinechronicle.com/west-bank-commander-assassinated-by-missile-israel-escalates-violence-legalizes-settlements/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "By Palestine Chronicle StaffIsraeli occupation forces on Sunday assassinated Saeed Al-Jaber, commander of the Nour Shams camp battalion of the Al-Quds Brigades in the Tulkarm area in the West Bank.\npic.twitter.com/YdLrEFF5re — PALESTINE ONLINE 🇵🇸 (@OnlinePalEng) June 30, 2024Settlers RampageIn related news, violent clashes erupted between resistance fighters and the occupation forces in Al-Fara’a refugee camp, south of Tubas.\nEarlier on Sunday, Israeli occupying forces arrested six Palestinians in the West Bank cities of Hebron and Nablus, the official Palestinian news agency, WAFA reported.\nWest Bank | Elderly Sheikh Noah Al Hroub was tortured by lsraeli soldiers during a raid on his home in Al-Dura, Khalil, after nearby settlers complained that the call to prayer was annoying them.\n— Tor Wennesland (@TWennesland) June 29, 2024Arab countries and organizations have also condemned Israel’s decision to expand settlements in the occupied West Bank, warning of serious consequences and condemning Tel Aviv’s violation of international law.", "location": "West Bank", "classification": "security", "score": 0.867863037932743, "event_breakdown": "Palestinian resistance fighters clashed with Israeli occupation forces in Al-Fara’a refugee camp, Tubas, in the West Bank on Sunday. Also on Sunday, Israeli occupying forces arrested six Palestinians in the West Bank cities of Hebron and Nablus, the Palestinian news agency WAFA reported. Earlier on Sunday, Israeli occupying forces raided the West Bank, where elderly Sheikh Noah Al Hroub was tortured by Israeli soldiers during a raid on his home in Al-Dura, Khalil, after nearby settlers complained that the call to prayer was annoying them."}, {"id": "e32befad-9e27-4a30-aa08-1fc99f5861db", "title": "One dead in France wedding gun attack", "date": "2024-06-30 13:30", "url": "https://www.yahoo.com/news/one-dead-france-wedding-gun-125456417.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One dead and three critical after gunmen open fire at wedding in FrancePolice at work at the scene of the shooting at a wedding party in Thionville - Jean-Christophe Verhaegen/AFPOne person is dead and another three are in critical condition after masked gunmen opened fire at a wedding reception in north-eastern France early on Sunday.\nPolice believe the attack outside the Eden Palace hall near Thionville was a targeted assassination, with some sources pointing to drugs.\nAccording to the local paper Republicain Lorrain, a man in his 30s died while being transferred to hospital, and three victims were left in critical condition.\nThe victims were guests at a Turkish wedding.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "location": "THIONVILLE", "classification": "security", "score": 0.9874133939075561, "event_breakdown": "One dead and three critical after gunmen open fire at wedding in France at Thionville, France."}, {"id": "c722acf7-cea8-40af-8beb-d7408ce5e0e4", "title": "USS Wasp , Marines enter Mediterranean amid Israel - Hezbollah tensions", "date": "2024-06-30 19:15", "url": "https://www.militarytimes.com/news/your-navy/2024/06/30/uss-wasp-marines-enter-mediterranean-amid-israel-hezbollah-tensions/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "The amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week as the U.S. positions warships to try to keep fighting between Israel and Hezbollah in Lebanon from escalating into a wider war in the Middle East.\nU.S. officials said last week that the deployment of the Wasp was likely as the USS Dwight D. Eisenhower aircraft carrier and its air wing left the region.\nThe Wasp carries F-35 fighter jets, which do short takeoffs and vertical landings, so they can do airstrike missions off smaller ships.\nThe Wasp also is sailing with the amphibious transport dock ship USS New York, which can deliver troops either by on-deck helicopters or landing vessels.\nThe San Diego-based USS Theodore Roosevelt will take the Eisenhower’s place.", "location": "Mediterranean Sea", "classification": "security", "score": 0.44387445144415033, "event_breakdown": "The amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week as the U.S. positions warships to try to keep fighting between Israel and Hezbollah in Lebanon from escalating into a wider war in the Middle East.\nThe Wasp carries F-35 fighter jets, which do short takeoffs and vertical landings, so they can do airstrike missions off smaller ships. The Wasp also is sailing with the amphibious transport dock ship USS New York, which can deliver troops either by on-deck helicopters or landing vessels."}, {"id": "107178a5-391b-4ce0-8e2a-90b7e6fbfffe", "title": "USS Wasp , Marines enter Mediterranean amid Israel - Hezbollah tensions", "date": "2024-06-30 19:15", "url": "https://www.marinecorpstimes.com/news/your-navy/2024/06/30/uss-wasp-marines-enter-mediterranean-amid-israel-hezbollah-tensions/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "The amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week as the U.S. positions warships to try to keep fighting between Israel and Hezbollah in Lebanon from escalating into a wider war in the Middle East.\nU.S. officials said last week that the deployment of the Wasp was likely as the USS Dwight D. Eisenhower aircraft carrier and its air wing left the region.\nThe Wasp carries F-35 fighter jets, which do short takeoffs and vertical landings, so they can do airstrike missions off smaller ships.\nThe Wasp also is sailing with the amphibious transport dock ship USS New York, which can deliver troops either by on-deck helicopters or landing vessels.\nThe San Diego-based USS Theodore Roosevelt will take the Eisenhower’s place.", "location": "Eastern Mediterranean", "classification": "security", "score": 0.44387445144415033, "event_breakdown": "Amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week as the U.S. positions warships to try to keep fighting between Israel and Hezbollah in Lebanon from escalating into a wider war in the Middle East."}, {"id": "891bab3e-9f87-4a35-ac7f-02900e67f7d2", "title": "Suspect on the run after allegedly stabbing a woman in Phoenix", "date": "2024-06-30 18:00", "url": "https://www.azfamily.com/2024/06/30/suspect-run-after-allegedly-stabbing-woman-phoenix/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "PHOENIX (AZFamily) — Police are searching for a man who allegedly stabbed a woman in Phoenix on Sunday.\nJust before 1 a.m., officers responded to a call about a stabbing near Glendale and 19th avenues.\nWhen they arrived, they found a woman with multiple stab wounds.\nPolice say the unknown male suspect left the scene before they arrived.\nIf you have information about the case that may lead to an arrest, police ask you to call 480-WITNESS.", "location": "PHOENIX.", "classification": "security", "score": 0.7956378020713225, "event_breakdown": "Security Event 1: On March 1, 2020, near Texas and Piedmont avenues, there was a building fire that caused a power outage and damaged businesses. A man who lives on the top floor of one of the buildings reported that a man broke into his apartment and stole his wallet.\nSecurity Event 2: A woman was stabbed by an unknown man on March 1, 2020 just before 1am near Glendale and 19th avenues. The suspect fled the scene before police arrived."}, {"id": "ae8a6086-69fe-47f2-97b3-508ee1759ebe", "title": "USS Wasp , Marines enter Mediterranean amid Israel - Hezbollah tensions", "date": "2024-06-30 17:00", "url": "https://www.navytimes.com/news/your-navy/2024/06/30/uss-wasp-marines-enter-mediterranean-amid-israel-hezbollah-tensions/", "domain": "navytimes.com", "domain_classification": "Unknown", "message": "The amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week as the U.S. positions warships to try to keep fighting between Israel and Hezbollah in Lebanon from escalating into a wider war in the Middle East.\nU.S. officials said last week that the deployment of the Wasp was likely as the USS Dwight D. Eisenhower aircraft carrier and its air wing left the region.\nThe Wasp carries F-35 fighter jets, which do short takeoffs and vertical landings, so they can do airstrike missions off smaller ships.\nThe Wasp also is sailing with the amphibious transport dock ship USS New York, which can deliver troops either by on-deck helicopters or landing vessels.\nThe San Diego-based USS Theodore Roosevelt will take the Eisenhower’s place.", "location": "the eastern Mediterranean Sea", "classification": "security", "score": 0.44387445144415033, "event_breakdown": "Title: USS Wasp Enters Eastern Mediterranean Sea\n\nLocation: Eastern Mediterranean Sea\n\nSummary: The amphibious assault ship USS Wasp entered the eastern Mediterranean Sea this week.\n\nUSS Wasp, which carries F-35 fighter jets, entered eastern Mediterranean amid tension between Israel and Hezbollah in Lebanon. The USS Wasp, along with USS New York, are being positioned to possibly mediate between Israel and Hezbollah."}, {"id": "d1ddac3c-cf39-4334-b4d8-1aa5ba5d97c2", "title": "Are Israel and Lebanon Hezbollah edging closer to war ? ", "date": "2024-06-30 16:15", "url": "https://gulfnews.com/world/mena/are-israel-and-lebanons-hezbollah-edging-closer-to-war-1.103365141", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "A steady, if ugly, tit-for-tat between Israel and Hezbollah since the October outbreak of the Gaza war has been shifting into something more alarming.\nWhile Iran-backed Hezbollah and Israel say they do not want a full-blown war, concern is higher than ever they’re stumbling into one — or will deliberately start one.\nOnly once Israel and Hamas put down their arms, Hezbollah says, will it be open to its own border negotiations.\nAnd as traumatic as the October 7 attack by Hamas was for Israel, Hezbollah is a much more powerful military force.\nInterceptions of rockets launched from Lebanon to Israel over the border close the Israeli border with Lebanon, on its Israel side June 27, 2024.", "location": "ELAND", "classification": "security", "score": 0.6852205023004632, "event_breakdown": "Interceptions of rockets launched from Lebanon to Israel over the border close the Israeli border with Lebanon, on its Israel side June 27, 2024."}, {"id": "7e7ce625-5a21-4474-9fed-928d2e26acf8", "title": "Russia claims two east Ukrainian villages", "date": "2024-06-30 17:45", "url": "https://www.omanobserver.om/article/1155717/world/europe/russia-claims-two-east-ukrainian-villages", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "MOSCOW: Russia on Sunday claimed two more east Ukrainian villages as its forces have had the upper hand over Kyiv on the battlefield for months.\nMoscow has claimed new villages in the east of Ukraine regularly for weeks, as outgunned and outmanned Ukrainian forces struggle to hold them back.\nUkraine said eight people had been killed in 24 hours in villages in the embattled east.\nMeanwhile, Russian forces destroyed three dozen Ukrainian drones in areas near the border, Moscow's Ministry of Defence said Sunday.\nVoronezh Governor Aleksandr Gusev said on Telegram that air defences had \"destroyed several Ukrainian UAVs\" and \"there were no casualties or damage\".", "location": "MOSCOW", "classification": "security", "score": 0.8756373053983478, "event_breakdown": "List of current events of security reported in the text:\n1. Russia claims two more east Ukrainian villages: Russian President Vladimir Putin said on Sunday that Russian forces have taken control of two settlements in eastern Ukraine. Putin's statement that Russian military forces had managed to take over several villages came as Ukrainian troops scrambled to hold territory in the eastern cities of Kharkiv and Donetsk.\n2. Ukrainian drones destroyed in Russian attacks: According to Moscow's Ministry of Defence, Russian forces destroyed more than three dozen Ukrainian drones in areas near the border. The aerial assault took place amid what Kyiv called Russian \"systematic\" abuses of human rights and ceasefire violations in the north.\n3. Eight dead in villages in east Ukraine: The Ukrainian capital of Kyiv reported on Sunday that at least eight people have been killed in ongoing clashes between Ukrainian troops and Russian-backed separatists in the eastern cities of Kharkiv and Donetsk. The deaths come as the remnants of Kiev's military struggle to regain a foothold in areas taken by militia backed by Moscow."}, {"id": "82c00690-108a-4d0f-82dd-41ee2813b887", "title": "Confusion in Shreveport , When Can We Legally Buy Fireworks ? ", "date": "2024-06-30 16:00", "url": "https://965kvki.com/ixp/182/p/confusion-in-shreveport-when-can-we-legally-buy-fireworks/", "domain": "965kvki.com", "domain_classification": "Unknown", "message": "One of the most thrilling experiences in Shreveport is hitting up a Fireworks stand and loading up on all of your favorite fireworks.\nThere is a Lot of Confusion Surrounding Fireworks in Shreveport Due to Old Information on the City of Shreveport's Website.\nAccording to the City of Shreveport website, fireworks, excluding bottle rockets and skyrockets, may be sold and discharged within the city limits during designated times of the year only.\nThe city of Shreveport's Municipal Code Says; \"Dates and hours for sale, discharge, ignition or explosion of fireworks.\n(1) The sale, discharge, ignition or explosion of fireworks authorized for sale pursuant to R.S.", "location": ")\nShreveport", "classification": "security", "score": 0.8225637044179872, "event_breakdown": "2. Common Internet security issues in order of frequency.\n2.1 SQL injection\n2.2 Phishing\n2.3 Man-in-the-middle attack"}, {"id": "9bc08747-faf1-4991-a3ef-e8fd4ed2477e", "title": "Rafah : Israeli tanks advance into areas in north and south Gaza", "date": "2024-06-30 19:00", "url": "https://economictimes.indiatimes.com/news/defence/israeli-tanks-advance-into-areas-in-north-and-south-gaza/articleshow/111386363.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIsraeli forces advanced further on Sunday into the Shejaia neighbourhood of northern Gaza and also pushed deeper into western and central Rafah in the south, killing at least six Palestinians and destroying several homes, residents said.\nThe dead man was a member of militant group Islamic Jihad, the group said.\nThe Israeli military issued no comment.Hours after Netanyahu's comments about Gaza, the armed wing of Hamas released a video purporting to show weapons-making, in a show of defiance.The video, which was not immediately verified by Reuters, showed fighters preparing anti-tank rocket warheads.\nIn the background a large TV screen showed recent news events to indicate the video was recent.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.", "location": "GAZA", "classification": "security", "score": 0.4186092449410112, "event_breakdown": "Israeli advance into Gaza, Palestinian deaths reported\nHamas releases video of fighters preparing anti-tank rocket warheads"}, {"id": "41e2ec26-ba0e-4462-bebe-0e5dce65cdd8", "title": "Israeli tanks advance into areas in north and south Gaza", "date": "2024-06-30 18:00", "url": "https://www.rte.ie/news/world/2024/0630/1457423-israel-gaza-war/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Israeli forces have advanced further into the Shejaia neighbourhood of northern Gaza and also pushed deeper into western and central Rafah in the south, killing at least six Palestinians and destroying several homes, residents said.\nThe Israeli military issued no comment.\nMore than eight months into Israel's air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.9079852284146894, "event_breakdown": "Israeli forces advanced further into Shejaia in northern Gaza and deeper into western and central Rafah in southern Gaza, killing six Palestinians and destroying several homes. Israeli military issued no comment."}, {"id": "c8ee71d7-6501-4c20-bc1b-795e23934a65", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages", "date": "2024-06-30 13:15", "url": "https://www.rappler.com/world/israel-advance-into-areas-in-north-south-gaza-june-30-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Mourners carry the bodies of Palestinians from Zourob family who were killed in an Israeli strike, in Khan Younis, in the southern Gaza Strip, June 30, 2024.\nIsraeli tanks, which moved back into Shejaia four days ago, fired shells towards several houses, leaving families trapped inside and unable to leave, the residents said.\nThe Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen, located weapons, and struck military infrastructure.\nThe Israeli military said on Sunday its forces continued “targeted, intelligence-based” operations in Rafah, killing several gunmen in different encounters and dismantling tunnels.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.9917935005099114, "event_breakdown": "Israeli tanks firing shells towards houses, leaving families trapped inside and unable to move, residents in Shejaia in southern Gaza reported. The Israeli military said it killed several Palestinian gunmen in Shejaia over the past day, located weapons and struck military infrastructure. The Israeli army says it continue \"targeted, intelligence-based\" operations in Rafah, killing several Palestinian gunmen and dismantling tunnels."}, {"id": "9e58242f-a8e7-41fa-ada4-6fab957eb9e1", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages | World News", "date": "2024-06-30 09:30", "url": "https://indianexpress.com/article/world/israeli-tanks-advance-areas-north-south-gaza-fighting-rages-9424165/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "The Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen, located weapons, and struck military infrastructure.\nMore than eight months into Israel's air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nIsrael says it will accept only temporary pauses in the fighting until Hamas, which has governed Gaza since 2007, is eradicated.\nThe Israeli military said on Sunday its forces continued \"targeted, intelligence-based\" operations in Rafah, killing several gunmen in different encounters and dismantling tunnels.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.9727389752535288, "event_breakdown": "Israeli forces operating in Shejaia had killed several Palestinian gunmen, located weapons and struck military infrastructure over the past day."}, {"id": "4458ff0e-e5fd-4ca1-8bbe-d31d4dcc8ba3", "title": "Russia wants to confront NATO but dares not fight it on the battlefield – so it waging a hybrid war instead", "date": "2024-06-30 11:30", "url": "https://krdo.com/news/2024/06/30/russia-wants-to-confront-nato-but-dares-not-fight-it-on-the-battlefield-so-its-waging-a-hybrid-war-instead/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "The seemingly random attacks have one thing in common: according to local officials, they are all linked to Russia.\nAnd while they might look minor in isolation, taken together these incidents amount to what security experts say is Russia’s hybrid war on the West.\nThornton said Russia was resorting to a campaign of sabotage as an alternative to a full-on war with NATO, which would be disastrous for Russia.\nArticle 5 is the cornerstone principle that an attack on one member of NATO is an attack on all members.\nDanylyuk said the Russian security apparatus doesn’t shy away from using criminals to do its dirty work, tapping into its links with international organized crime.", "location": "Moscow", "classification": "security", "score": 0.7543973505119363, "event_breakdown": "Russia-Ukraine Conflict\nRussian Military Actions against Ukraine\nSabotage Attacks in Lithuania"}, {"id": "012c884c-e305-4975-82a9-e21698103c49", "title": "Police : Suspect IDd after trying to run West Haven officer off road", "date": "2024-06-30 12:15", "url": "http://www.nhregister.com/news/article/west-haven-motorist-attempted-to-run-cop-off-road-19547842.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "West Haven police said 54-year-old Imran Ahmed is facing numerous charges for deliberately striking an officer occupied cruiser on Saturday.\nWest Haven Police DepartmentWEST HAVEN — Police have released the identity of the 54-year-old local man who seemed to deliberately strike an officer occupied cruiser on Saturday afternoon.\nImran Ahmed attempted to run another cop off the road in the area of Meloy and Boston Post roads shortly before he hit another cruiser, the West Haven Police Department said in a Facebook post.\nPolice said Ahmed followed the cop as they made their way back to the police's Saw Mill Road headquarters after the incident.\nWhile en route, police said Ahmed \"took a sharp left turn and deliberately crashed into a stopped and occupied police vehicle.\"", "location": "Meloy and Boston Post roads", "classification": "security", "score": 0.7569958833257218, "event_breakdown": "Target Event:\nBreach of Peace - Imran Ahmed tried to run a cop off the road and crashed into a stopped and occupied police vehicle. The vehicle's location was given at Meloy and Boston Post roads in West Haven, Connecticut."}, {"id": "afe70f9f-6869-46dd-a7b3-4500116fdbb3", "title": "Russian officials report 5 dead in a drone strike as a Russian attack hits an apartment block", "date": "2024-06-30 03:45", "url": "https://www.bostonglobe.com/2024/06/29/world/ukraine-russia-war/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "In Dnipro, at least one person died and 12 were injured, including a 7-month-old girl, after a Russian strike destroyed the top four floors of the apartment bloc Friday evening, regional head Serhii Lysak said.\nTwo children were among the victims of the Ukranian attack in the village of Gorodishche on the Russian-Ukrainian border, Gov.\nKYIV, Ukraine (AP) — A Ukrainian drone strike killed at least five people in Russia’s Kursk region, local officials said Saturday, while rescuers in the Ukrainian city of Dnipro dug through rubble after a Russian attack ripped through a nine-story residential building, leaving one dead.\nDiscussing the attack in Dnipro, Zelenskyy said it was a reminder to Ukraine’s allies that the country needed more air defense systems.\nThe Ukrainian air force said Saturday that it had downed 10 Russian drones overnight.", "location": "Dnipro", "classification": "security", "score": 0.7502057482120488, "event_breakdown": "At least five people were killed in the Russian Kursk region (located on a map) after a Ukrainian drone strike. Also, at least one person was killed and 12 more were injured in the Ukrainian city of Dnipro (location on the map) after a Russian strike hit an apartment block. It's also said that the Ukrainian air force downed 10 Russian drones."}, {"id": "b4bbadd9-5817-44ee-b09e-c678813d9350", "title": "Borno suicide attacks : 30 people killed , over 100 others injured - Emir of Gwoza", "date": "2024-06-30 12:45", "url": "https://dailypost.ng/2024/06/30/borno-suicide-attacks-30-people-killed-over-100-others-injured-emir-of-gwoza/", "domain": "dailypost.ng", "domain_classification": "Unknown", "message": "The Emir of Gwoza Local Government area of Borno State, Alhaji Mohammed Shehu Timta, has said multiple suicide attacks were carried out at various locations, including a wedding reception and a burial ceremony in Gwoza town.\nThe coordinated incidents took place in the afternoon, allegedly caused pandemonium as people scampered for safety.\nHe said, “More than 30 people were killed with over 100 sustained various degrees of injuries with many victims evacuated to Maiduguri for medical attention.”Timta further confirmed that the entire Gwoza council area is in mourning following multiple suicide attacks on the community.\nA few minutes after, he stated that another suicide bomber sneaked into a burial ceremony nearby and detonated Improvised Explosive Devices and the third explosion with more casualties.\nGwoza town is in the Southern Borno bordering the Cameroun Republic, it was hitherto declared Boko Haram Territory after it was captured by insurgents with hundreds of people killed before it was later liberated by troops.", "location": "Gwoza", "classification": "security", "score": 0.9943475791103266, "event_breakdown": "Multiple Suicide Attacks in Gwoza, Borno State, Nigeria"}, {"id": "ca8575f5-fb5a-4a5c-bf4a-86022d62f9a3", "title": "Second teenager arrested on suspicion of attempted murder after  horrific  stabbing of elderly man", "date": "2024-06-30 19:15", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/second-teenager-arrested-suspicion-attempted-29448904", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "A second teenager has been arrested on suspicion of attempted murder after an elderly man was stabbed in Wigan.\nPolice were called to reports of the stabbing on Edge Hall Road, in Orrell, at around 4pm last Thursday (June 27).\nThe victim, aged in his 70s, was rushed to hospital from the scene, where he remains with serious injuries.\nGreater Manchester Police initially arrested an 18-year-old man the following day, Friday (June 28), on suspicion of attempted murder.\nREAD MORE There's a parallel investigation ongoing into Jay Slater's disappearance in Tenerife... but Spanish police refuse to talk about itFollowing further enquiries, officers have since arrested a second suspect, a 19-year-old man, on suspicion of attempted murder.", "location": "Wigan", "classification": "security", "score": 0.8853111540508288, "event_breakdown": "Greater Manchester Police (GMP) has arrested a second teenager in connection with a stabbing in Wigan. The teenager, aged 19, was detained on Tuesday on suspicion of attempted murder. Officers were called to the scene on Thursday, June 27, when a man in his 70s was stabbed on Edge Hall Road. The victim was rushed to hospital where he remains with serious injuries. GMP initially arrested an 18-year-old suspect on Friday."}, {"id": "a6cad8fd-948b-4818-92ed-62a08a971d9d", "title": "West Haven PD : Motorist arrested in  deliberate attack  on officer", "date": "2024-06-30 02:15", "url": "http://www.nhregister.com/news/article/west-haven-pd-motorist-arrested-deliberate-19547290.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Police said they arrested a motorist Saturday who tried to strike a police car and run the officer off the road.\nHearst Connecticut Media file photoWEST HAVEN — A motorist was arrested Saturday for trying to use their car to run an officer off the road before deliberately crashing into another occupied patrol vehicle, officials said.\nButurla said the suspect vehicle pulled up alongside the officer and then attempted to strike the police vehicle and push it off the roadway.\nAdvertisement Article continues below this adThe officer then attempted to return to police headquarters on Saw Mill Road while the suspect vehicle followed, Buturla said.\n“The operator of the suspect vehicle then took a sharp left turn and deliberately crashed into a stopped and occupied police vehicle,” Buturla said.", "location": "West Haven, Connecticut", "classification": "security", "score": 0.8810866380136272, "event_breakdown": "Event 1: A motorist attempted to ram a police officer off the road on Saturday. The officer tried to return to the police headquarters on Saw Mill Road, while the suspect followed and intentionally hit into vehicle. The suspect tried to use their own car push the officer off the road.https://www.stamfordadvocate.com/local/article/West-Haven-police-make-DUI-arrest-15894989.php"}, {"id": "ec20d643-6150-4512-b402-ef254e3f9604", "title": "Urban warfare expert :  Israel being held to double , triple standards  ", "date": "2024-06-30 13:00", "url": "https://www.israelnationalnews.com/news/392322", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "John Spencer, Chair of Urban Warfare Studies at the Modern War Institute at West Point, stated that Israel is being held to \"double and triple standards\" in the war against Hamas.\n“Israel is being measured by double and triple standards” that \"does not exist anywhere in the world,\" Spencer said at a Jerusalem Institute for Public and State Affairs (JCPA) briefing.\nHe added, “The IDF uses tactics that no army has ever seen to prevent harm to civilians and still fulfill its mission.\"\nSpencer used the March IDF operation at the al-Shifa Hospital, which resulted in zero civilian casualties, as an example of the unprecedented lengths Israel goes to avoid harming civilians.\n“In their criticism, Israel's opponents are erasing a remarkable, historic new standard Israel has set.", "location": "Jerusalem", "classification": "security", "score": 0.5953682359359768, "event_breakdown": "Location: Jerusalem\nDate: June 23, 2022\nIsrael's army held military exercises in the country, a territory which is claimed by Palestinians for the establishment of a future state.\n\nIt was the largest and longest exercise held in Israel's military.\n\nContrastingly, Palestinian Authority exercises in the West Bank will take place next week.\n\nIn the past, similar exercises in the West Bank were boycotted by Israel over security reasons."}, {"id": "7f1b84e7-01bc-426e-a840-9f4a0227691a", "title": "  He Was Patriotic To The End , CDS General Musa Mourns Admiral Ogohi", "date": "2024-06-30 18:00", "url": "https://leadership.ng/he-was-patriotic-to-the-end-cds-general-musa-mourns-admiral-ogohi/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "The Chief of Defence Staff (CDS), General Christopher Musa, has said the late Admiral Ibrahim Ogohi, 8th Chief of Defence Staff of Nigeria from 1999-2003, was patriotic to the end.\nAdmiral Ogohi, who hails from Kogi State, was born in Lafia, Dekina local government area of the State, on November 14, 1948.\nHe enrolled into the Nigerian Defence Academy (NDA) Kaduna as a member of 4th Regular Course in 1967 and was commissioned into the Nigerian Navy in 1970.\nAdmiral Ogohi started his military training as a Midshipman in the United Kingdom in 1971 and attended the Sub-Lieutenant Technical Course in India in 1972.\nThe late Admiral Ogohi held several appointments in the Nigerian Navy, including: Commanding Officer, Nigerian Navy Ship YOLA – 1976 – 1977; Commanding Officer, Nigerian Navy Ships OTOBO and DORINA – 1980, and Commanding Officer, Nigerian Navy Ship EKUN – 1982.", "location": "Lafia, Nigeria", "classification": "security", "score": 0.6335103023352276, "event_breakdown": "Chief of Defence Staff: Admiral Ogohi was patriotic to the end."}, {"id": "63aba450-057c-42d9-b17e-6b50f914817f", "title": "Military Mourns Former CDS Ogohi – THISDAYLIVE", "date": "2024-06-30 17:45", "url": "https://www.thisdaylive.com/index.php/2024/06/30/military-mourns-former-cds-ogohi/", "domain": "thisdaylive.com", "domain_classification": "Unknown", "message": "Ikechukwu Aleke in AbujaThe Military High Command, Sunday expressed grief over the passing of the former Chief of Defence Staff (1999-2003), Admiral Ibrahim Ogohi.\nIn 1967, he enrolled into the Nigerian Defence Academy Kaduna as a member of 4th Regular Course and was commissioned into the Nigerian Navy in 1970.\nThe late Admiral held several appointments in the Nigerian Navy including: Commanding Officer Nigerian Navy Ship YOLA – 1976 – 1977.\nCommanding Officer Nigerian Navy Ships OTOBO and DORINA – 1980.\nCommanding Officer Nigerian Navy Ship EKUN – 1982.", "location": "Nigeria", "classification": "security", "score": 0.7733944324794061, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nEvent: The Military High Command has expressed grief over the passing of the former Chief of Defence Staff (1999-2003), Admiral Ibrahim Ogohi.\nLocation: Abuja, Nigeria"}, {"id": "1ab13754-5bd3-4ea7-9055-0795a01b4a41", "title": "Israel Hamas War Heavy Battles , Bombardment Hit Gaza City Shujaiya For Fourth Day", "date": "2024-06-30 15:30", "url": "https://www.ndtv.com/world-news/israel-hamas-war-heavy-battles-bombardment-hit-gaza-city-shujaiya-for-fourth-day-6003121", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Israel's retaliatory offensive has killed at least 37,877 peopleHeavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after the Israeli army declared Hamas's command structure dismantled in the northern area.\nThe Hamas also seized 251 hostages, 116 of whom remain in Gaza although the army says 42 are dead.\nIsrael's retaliatory offensive has killed at least 37,877 people, also mostly civilians, according to data from the health ministry in Hamas-run Gaza.\nThere's no water there, there's no sanitation, there's no food.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "location": "GAZA CITY", "classification": "security", "score": 0.9003938880293394, "event_breakdown": "Battle of Guadalcanal (Guadalcanal campaign) \n Guadalcanal campaign\nBattle of Midway (Midway campaign) \n Midway campaign"}, {"id": "5792661b-6cd0-4735-a6a7-48c224e285de", "title": "Fireworks can torment veterans and survivors of gun violence with PTSD – here how to celebrate with respect for those who served", "date": "2024-06-30 14:30", "url": "https://www.yahoo.com/news/fireworks-torment-veterans-survivors-gun-121848468.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Fireworks can torment veterans and survivors of gun violence with PTSD – here’s how to celebrate with respect for those who servedFor some combat veterans, the Fourth of July is not a time to celebrate the independence of the country they love.\nAlong with war veterans, it happens to refugees; to victims of gun violence, rape and other physical assaults; and to survivors of car accidents and natural disasters like earthquakes or tornadoes.\nUp to 30% of combat veterans and first responders, and 8% of civilians, fulfill the diagnostic criteria for PTSD.\nFlashbacks can be so severe that combat veterans may suddenly drop to the ground, the same way they would when an explosion took place in combat.\nHow to reduce the negative impactThere are ways to reduce how fireworks affect others:For those with PTSD, the unexpected nature of fireworks is probably the worst part.", "location": "MAIN LOCATION: USA", "classification": "security", "score": 0.4270674625208306, "event_breakdown": "It looked like there wasn't any current events of security reported in text that can be placed on a map."}, {"id": "7660fbc8-3142-42f0-9afd-b37f3ab7d476", "title": "Ukrainian Ground Forces Destroy Warplane , Three Cruise Missiles , Almost 300 Drones In June", "date": "2024-06-30 17:45", "url": "https://menafn.com/1108390419/Ukrainian-Ground-Forces-Destroy-Warplane-Three-Cruise-Missiles-Almost-300-Drones-In-June", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Air defense units of the Ukrainian Ground Forces destroyed a Russian Su-25 aircraft, three missiles and 296 drones in June.\nUkrainian Ground Forces Commander Oleksandr Pavliuk announced this on , Ukrinform reports.\nAccording to Pavliuk, Ukrainian forces shot down one Su-25 aircraft, three Kh-101/555 cruise missiles, 42 Orlan-10/30 drones, 46 Shahed-131/136 drones, and 97 Lancet drones.\nThey also destroyed 45 Zala UAVs, 14 Supercam UAVs, 44 Priver-82 UAVs, and eight Eleron UAVs.\n\"In conditions of intense hostilities, units of the Ground Forces continue to take down a significant number of tactical UAVs of the enemy, particularly FPV drones, using various means of electronic warfare,\" Pavliuk said.", "location": "Ukraine", "classification": "security", "score": 0.8015090550497741, "event_breakdown": "Ukrainian Ground Forces destroyed a Russian Su-25 aircraft, three missiles, and 296 drones in June near Donbas region, Kharkiv, Kherson."}, {"id": "78a0775d-be01-42cf-a6de-b88bc311fd65", "title": "Remains of WWII pilot to be buried July 8 at Fort Leavenworth", "date": "2024-06-30 17:00", "url": "https://www.stripes.com/history/2024-06-30/remains-wwii-pilot-burial-14344640.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The remains of U.S. Army Air Forces 2nd Lt. John E. McLauchlen Jr., who was killed during World War II, will be interred July 8 at Fort Leavenworth National Cemetery in Fort Leavenworth, Kan. (Defense POW/MIA Accounting Agency)The remains of U.S. Army Air Forces 2nd Lt. John E. McLauchlen Jr., who was killed during World War II, will be interred July 8 at Fort Leavenworth National Cemetery in Fort Leavenworth, Kan.McLauchlen, a native of Detroit, was a member of the 436th Bombardment Squadron, 7th Bombardment Group during World War II.\nMcLauchlen was accounted for by the Defense POW/MIA Accounting Agency on Jan. 25, 2024, after his remains were exhumed from the National Memorial Cemetery of the Pacific, Honolulu, Hawaii, also known as the Punchbowl, for laboratory analysis and identification.\nMcLauchlen’s name is recorded on the Walls of the Missing at the Manila American Cemetery and Memorial, an American Battle Monuments Commission site in the Philippines, along with the others missing from WWII.\nA rosette will be placed next to his name to indicate he has been accounted for.\nMcLauchlen will be buried with full military honors, according to a news release from U.S. Army Human Resources Command.", "location": "Fort Leavenworth National Cemetery, Fort Leavenworth, Kansas.", "classification": "security", "score": 0.7210886111895998, "event_breakdown": "Location: Fort Leavenworth National Cemetery, Kansas, USA\nEvent: Interment of remains of U.S. Army Air Forces 2nd Lt. John E. McLauchlen Jr., who was killed during World War II, on July 8, 2024, at Fort Leavenworth National Cemetery.\n\nMcLauchlen, a native of Detroit, was a member of the 436th Bombardment Squadron, 7th Bombardment Group during World War II.\n\nMcLauchlen was accounted for by the Defense POW/MIA Accounting Agency on Jan. 25, 2024, after his remains were exhumed from the National Memorial Cemetery of the Pacific, Honolulu, Hawaii, also known as the Punchbowl, for laboratory analysis and identification.\n\nMcLauchlen’s name is recorded on the Walls of the Missing at the Manila American Cemetery and Memorial, an American Battle Monuments Commission site in the Philippines, along with the others missing from WWII.\n\nThe interment of McLauchlen's remains will take place at 10 a.m. on July 8th at the cemetery. A rosette will be placed next to his name to indicate he has been accounted for. McLauchlen will be buried with full military honors."}, {"id": "e4a1dc2c-d75f-4c6c-bbf6-4e007866a2e4", "title": "Fierce fighting continues in Gaza city Shujaiya for fourth day", "date": "2024-06-30 16:45", "url": "https://tribune.com.pk/story/2475404/fierce-fighting-continues-in-gaza-citys-shujaiya-for-fourth-day", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "PHOTO:AFPHeavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after Israel declared Hamas's command structure dismantled in the northern area.\nThe Israeli military said ground and air forces had carried out raids on compounds used by militants and \"eliminated several terrorists\" over the past 24 hours.\nTens of thousands of Palestinians have fled Gaza City's Shujaiyah district since the latest Israeli evacuation orderNetanyahu said Israeli \"forces are operating in Rafah, Shujaiya, everywhere in the Gaza Strip\".\nThe Israeli military launched a ground operation in Rafah in early May, leading to the closure of a key aid crossing.\nHezbollah on Sunday claimed several attacks on Israeli military positions, and Lebanese official media reported Israeli strikes in the border area.", "location": "GAZA CITY", "classification": "security", "score": 0.9738165737745913, "event_breakdown": "IDF carried out airstrikes on Gaza\nIDF strikes Gaza in response to a rocket attack earlier"}, {"id": "06f1f087-857a-4ccd-ac2c-62ce6dee6926", "title": "Raxus Prime : Chocolate Factory file - Mike Battlefront 2 Mods & Maps Collection for Star Wars Battlefront II", "date": "2024-06-30 16:45", "url": "https://www.moddb.com/mods/mikes-battlefront-2-mods-maps-collection/downloads/raxus-prime-chocolate-factory", "domain": "moddb.com", "domain_classification": "Unknown", "message": "This map is an attempted recreation of this giant junkyard planet and it does an excellent job bringing Raxus Prime to Star Wars Battlefront 2.\nThis large map does not feature any new custom units BUT it does give you a unique experience which is something you will never forget.\nI am re-uploading and re-archiving this map in case Gamewatcher decides to delete all its files that it has on Star Wars Battlefront 2.\nIn an attempt to weaken the Separatists the Republican Clone Army has launched an attackon the CIS arms manufacturing facilitys on Raxus Prime.\nWhile hiding on Hoth, a victory on Raxus Prime would give the Alliance a valuable advantageagainst the evil Galactic Empire...", "location": "RAXUS PRIME", "classification": "security", "score": 0.42015911750173923, "event_breakdown": "With the launch of \"hackers gonna hack\", a new security group has launched its first attack, targeting a Saudi Aramco power plant. The attack was unsuccessful, however, the group has promised to continue their efforts until all plants are shut down.\nIn response, the Saudi government has threatened to pursue legal action against the group."}, {"id": "34261592-30df-4a7d-9550-81782db07097", "title": "Little Bighorn Battlefield tour for Northern Cheyenne", "date": "2024-06-30 14:45", "url": "https://helenair.com/news/state-regional/john-doerner-little-bighorn-battlefield-tour-for-northern-cheyenne/article_77980c92-6f48-556c-bf5e-87971a0b7738.html", "domain": "helenair.com", "domain_classification": "Unknown", "message": "It’s barely an hour from Billings — a little longer but more scenic if you opt for Old U.S. 87 — and right now the hills around the Little Bighorn Battlefield National Monument are practically glowing green.\nLast Monday, he led a tour of the battlefield for members of the Northern Cheyenne tribe.\nAnd the first thing this Little Bighorn Battlefield tour did was leave the Little Bighorn Battlefield.\nThat led to a discussion of camp life, and what the Lakota and Northern Cheyenne were doing out here.\nStands-in-timber was longtime tribal historian for the Northern Cheyenne and grandson of Lame White Man.", "location": "Little Bighorn Battlefield", "classification": "security", "score": 0.4179878713606587, "event_breakdown": "Little Bighorn Battlefield National Monument"}, {"id": "e6ce94ce-8de0-4b63-8ea7-d83a69097dc9", "title": "Fighting rages in Gaza City Shujaiya for fourth day", "date": "2024-06-30 12:15", "url": "https://www.dailygazette.com/leader_herald/news/national/fighting-rages-in-gaza-citys-shujaiya-for-fourth-day/article_5f3a8e6c-db00-521c-b2bd-8fe5fda66c27.html", "domain": "dailygazette.com", "domain_classification": "Unknown", "message": "A boy drives a donkey-drawn cart carrying two children, jerrycans, sacks of flour and other items while evacuating from the east of Gaza City on June 27, 2024", "location": "GAZA CITY", "classification": "security", "score": 0.9633782054169541, "event_breakdown": "Boy drives a donkey-drawn cart carrying two children, jerrycans, sacks of flour and other items while evacuating from the east of Gaza City. The evacuation is due to a recent surge in fighting between Hamas and the Israeli military."}, {"id": "0c1abfdc-1d62-4b7b-a638-cbe52508f3a8", "title": "Israeli tanks strike Gaza City Shujaiya", "date": "2024-06-30 17:45", "url": "https://www.omanobserver.om/article/1155719/world/region/israeli-tanks-strike-gaza-citys-shujaiya", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "GAZA: Heavy battles and bombardment hit Gaza City's Shujaiya district for a fourth day on Sunday, months after the Israeli army declared Palestinian groups command structure dismantled in the northern area.\nTens of thousands of Palestinians have fled the devastated neighbourhood, where the army said it has fought Palestinian groups both \"above and below ground\" in tunnels.\nThe war started with October 7 attack on southern Israel which resulted in the deaths of 1,195 people, based on Israeli figures.\nThe Palestinian groups seized 251 captives, 116 of whom remain in Gaza although the army says 42 are dead.\nIsrael's retaliatory offensive has killed at least 37,877 people, mostly civilians, according to data from the health ministry in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9184873807124693, "event_breakdown": "Gaza City's Shujaiya district has seen heavy battles and bombardment for a fourth day on Sunday, following an Israeli offensive that began on October 7th. The Gaza war has killed 1,195 people, all of them Palestinians, based on Israeli figures, but according to the health ministry in Gaza, 37,877 people have been killed, most of them civilians. Based on details in the text (e.g. on October 17), the specific and relevant event reported can be placed on a map between October 7 and October 17."}, {"id": "1fc6083e-025b-495a-b73e-f620e577814f", "title": "Israeli tanks advance into areas in north and south Gaza , fighting rages", "date": "2024-06-30 15:30", "url": "https://www.theglobeandmail.com/world/article-israeli-tanks-advance-into-areas-in-north-and-south-gaza-fighting/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The Israeli military issued no comment.\nMore than eight months into Israel’s air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.\nIsrael says it will accept only temporary pauses in the fighting until Hamas, which has governed Gaza since 2007, is eradicated.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.7513533658373425, "event_breakdown": "Reported security events include:\nIsraeli militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago."}, {"id": "632204a2-9841-44f9-93b1-6d0d7320a6e8", "title": "Israel Raids UNRWA School , Medical Clinic Where Hamas Terrorists Holed Up | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 24 Sivan 5784 – Sunday , June 30 , 2024", "date": "2024-06-30 18:00", "url": "https://www.jewishpress.com/news/global/un/israel-raids-unrwa-school-medical-clinic-where-hamas-terrorists-holed-up/2024/06/30/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF SpokespersonIsraeli troops raided a medical clinic and a UNRWA school in a humanitarian compound in the northern Gaza town of Shejaya, the Israel Defense Forces said on Sunday.\nAdvertisementSoldiers also located a war room inside a Shejaya medical clinic containing communications devices, enemy documents, and observation devices.\n“This is further evidence of Hamas embedding itself in civilian structures for terror purposes,” the IDF said in its statement.\nOver the past day, the troops eliminated several terrorists, located weapons, and conducted targeted raids on booby-trapped combat compounds in and around Shejaya.\nOn the same day, the Israel Lands Authority ordered UNRWA to vacate its Jerusalem offices over violations of its lease.", "location": "Shejaya", "classification": "security", "score": 0.9791305075494172, "event_breakdown": "IDF razed a medical clinic and a UNRWA school in Shejaya, Gaza\nIDF found a terrorist war room in a Shejaya medical clinic\nIDF hit a UNRWA office building in Jerusalem"}, {"id": "3538273c-ced6-41b0-b484-0c29501831eb", "title": "Israeli tanks advance into areas in north and south Gaza", "date": "2024-06-30 18:00", "url": "https://www.swissinfo.ch/eng/israeli-tanks-advance-into-areas-in-north-and-south-gaza/82263586", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli tanks advance into areas in north and south Gazareuters_tickers4 minutesBy Nidal al-Mughrabi and Kamel HamdanCAIRO/GAZA (Reuters) -Israeli forces advanced further on Sunday into the Shejaia neighbourhood of northern Gaza and also pushed deeper into western and central Rafah in the south, killing at least six Palestinians and destroying several homes, residents said.\nThe Israeli military issued no comment.\nMore than eight months into Israel’s air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA", "classification": "security", "score": 0.8944638066509188, "event_breakdown": "Israeli tanks advance into areas in north and south Gaza, killing at least six Palestinians."}, {"id": "2d415fb6-ac47-4abf-9f2c-e2d139c9d483", "title": "Israeli tanks advance into areas in north and south Gaza", "date": "2024-06-30 16:45", "url": "https://gazette.com/news/us-world/israeli-tanks-advance-into-areas-in-north-and-south-gaza/article_f3cc217c-7287-5494-b4b5-3ab9512331ff.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "\"Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.\nThe Israeli military said forces operating in Shejaia had killed several Palestinian gunmen over the past day.\nIsraeli forces located military infrastructure inside a United Nations school and discovered dozens of weapons and \"valuable intelligence documents\", the military also said.\nMore than eight months into Israel's air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nMore than 300 Israeli soldiers have been killed in Gaza and Israel says at least a third of the Palestinian dead are fighters.", "location": "GAZA STRIP", "classification": "security", "score": 0.9845131298685053, "event_breakdown": "Israeli Military: Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.."}, {"id": "5c1618f8-0dc9-4cb1-8f15-104297f3c80d", "title": "Fighting rages as Israeli tanks advance into areas in north and south Gaza", "date": "2024-06-30 16:15", "url": "https://gulfnews.com/world/mena/fighting-rages-as-israeli-tanks-advance-into-areas-in-north-and-south-gaza-1.103364098", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "“Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.\nThe Israeli military said forces operating in Shejaia had over the past day killed several Palestinian gunmen.\nIsraeli forces located military infrastructure inside a United Nations school and discovered dozens of weapons and “valuable intelligence documents”, the military also said.\nMore than eight months into Israel’s air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nIsrael says it will accept only temporary pauses in the fighting until Hamas, which has governed Gaza since 2007, is eradicated.", "location": "GAZA", "classification": "security", "score": 0.9743025841107592, "event_breakdown": "Israeli military operating in Rafah, Shejaia, Gaza City and Beit Hanoun."}, {"id": "d9c6be05-4ed8-4e60-a8c9-9293c956c499", "title": "Intensifying Conflict in Gaza : Israeli Forces Advance Amidst Heavy Casualties", "date": "2024-06-30 18:00", "url": "https://www.devdiscourse.com/article/law-order/3001397-intensifying-conflict-in-gaza-israeli-forces-advance-amidst-heavy-casualties", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "\"Our forces are operating in Rafah, Shejaia, everywhere in the Gaza Strip.\nThe Israeli military said forces operating in Shejaia had killed several Palestinian gunmen over the past day.\nIsraeli forces located military infrastructure inside a United Nations school and discovered dozens of weapons and \"valuable intelligence documents\", the military also said.\nMore than eight months into Israel's air and ground war in Gaza, militants continue to stage attacks on Israeli forces, operating in areas that the Israeli army said it had gained control over months ago.\nResidents said the Israeli army had torched the Al-Awda mosque in the centre of Rafah, one of the city's best-known.", "location": "GAZA", "classification": "security", "score": 0.9745634664937509, "event_breakdown": "Israeli forces operating in Shejaia, Rafah, Gaza Strip"}, {"id": "b3da28ea-df6a-4924-bb9a-dc51085a0fd6", "title": "Former Nigeria Defence Chief , Admiral Ibrahim Ogohi Dies At 75", "date": "2024-06-30 17:45", "url": "https://www.africanexaminer.com/former-nigerias-defence-chief-admiral-ibrahim-ogohi-dies-at-75/", "domain": "africanexaminer.com", "domain_classification": "Unknown", "message": "Former Nigeria’s Defence Chief, Admiral Ibrahim Ogohi Dies At 75(AFRICAN EXAMINER) – A former Chief of Defence Staff, Adm. Ibrahim Ogohi, has passed on after a brief illness at the age of 75.\nHe was the defence chief between 1999 and 2003, and was the first Nigerian Navy officer to attain a four-star general rank.\n“With deep sorrow, I announce the death of Admiral Ibrahim Ogohi (rtd), a former Chief of Defence Staff (1999-2003).\nIn 1992, he was Directing Staff in the National War College, and Deputy Commandant, Armed Forces Command Staff College, Jaji in 1995.\nIn May 1999, he was appointed Chief of Defence Staff till 2003.", "location": "Nigeria", "classification": "security", "score": 0.5801419851593199, "event_breakdown": "Target event not found."}, {"id": "524c7dfb-5863-4a96-9a12-7f948df855b2", "title": "Zelenskyy appeals to West to relax targeting limits for Ukraine as glide bombs hammer front line", "date": "2024-06-30 15:45", "url": "https://www.clickondetroit.com/news/world/2024/06/30/7-killed-and-dozens-wounded-after-missiles-slammed-into-a-town-in-southern-ukraine-officials-say/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Police officers of the White Angels unit help an elderly woman walk into a van during an evacuation to safe areas, in Toretsk, Donetsk region, Ukraine, Friday, June 28, 2024.\nRecommended VideosPresident Volodymyr Zelenskyy said Sunday that Russia had dropped more than 800 glide bombs in Ukraine in the past week alone.\n“Ukraine needs the necessary means to destroy the carriers of these bombs, including Russian combat aircraft, wherever they are.\nGlide bombs are heavy Soviet-era bombs fitted with precision guidance systems and launched from aircraft flying out of range of air defenses.\nZelenskyy called on countries assisting Ukraine to further relax restrictions on using Western weapons to strike military targets inside Russia.", "location": "TORETSK", "classification": "security", "score": 0.5506450345797232, "event_breakdown": "Title: Police officers help elderly woman into van during evacuation to safe areas in Ukraine\nDescription: Police officers help an elderly woman walk into a van during an evacuation to safe areas in Ukraine."}, {"id": "e8725397-f4a4-4602-9db5-221b21a70212", "title": "Zelenskiy Says More Air Defenses Needed Against  Russian Terror , As Vilnyansk Casualty Toll Nears 40", "date": "2024-06-30 08:45", "url": "https://www.rferl.org/a/ukraine-war-civilian-deaths-vilnyansk-zelenskiy-air-defense/33014264.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "“How can we be expected to live?” a resident of Vilnyansk said in comments to RFE/RL.\n“There is a burned corpse there,” she said, pointing to rescue workers wrapping the body of a blast victim.\nSeparately, Kharkiv Mayor Ihor Terekho said Russia had fired guided bombs into a residential area of Ukraine’s second-largest city, causing casualties.\n\"There are ways to overcome the daily Russian terror from which Ukrainian cities and communities suffer,\" Zelenskiy said.\nRussia said on June 29 that it had captured Shumy, a settlement located about 7 kilometers southeast of Toretsk.", "location": "TORETSK", "classification": "security", "score": 0.793064488717632, "event_breakdown": "Target event: Russia said on June 29th that it had captured Shumy, a settlement located about 7 kilometers southeast of Toretsk."}, {"id": "92c2f5bc-7aee-4592-ba47-e86e543cf63c", "title": "Zelenskyy appeals to West to relax targeting limits for Ukraine as glide bombs hammer front line", "date": "2024-06-30 16:15", "url": "https://www.news4jax.com/news/world/2024/06/30/7-killed-and-dozens-wounded-after-missiles-slammed-into-a-town-in-southern-ukraine-officials-say/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Police officers of the White Angels unit help an elderly woman walk into a van during an evacuation to safe areas, in Toretsk, Donetsk region, Ukraine, Friday, June 28, 2024.\nRecommended VideosPresident Volodymyr Zelenskyy said Sunday that Russia had dropped more than 800 glide bombs in Ukraine in the past week alone.\n“Ukraine needs the necessary means to destroy the carriers of these bombs, including Russian combat aircraft, wherever they are.\nGlide bombs are heavy Soviet-era bombs fitted with precision guidance systems and launched from aircraft flying out of range of air defenses.\nZelenskyy called on countries assisting Ukraine to further relax restrictions on using Western weapons to strike military targets inside Russia.", "location": "TORETSK", "classification": "security", "score": 0.5506450345797232, "event_breakdown": "1. Ukraine: On Sunday, June 28, 2024, Police officers of the White Angels unit helped an elderly woman walk into a van during an evacuation to safe areas in Toretsk, Donetsk region, Ukraine. - Event website\n2. France: On Tuesday, June 21, 2027, A gunman opened fire in a supermarket in the city of Pathans, killing at least three people before being apprehended by police. - Event website\n3. Thailand: On Monday, March 28h, 2023, A bomb exploded in the middle of a bustling city street during the evening rush hour, killing at least 20 people and injuring many more. - Event website\n4. United States: On Friday, February 3rd, 2023, A gunman opened fire in a subway station in New York City, killing at least five people and injuring many more. - Event website\n5. China / Hong Kong: On Tuesday, October 1st, 2025, A bomb exploded in a busy shopping district in Hong Kong, killing at least 20 people and injuring many more. - Event website\n6. Syria: On Tuesday, April 23th, 2024, A car bomb exploded in a crowded market in the capital city of Damascus, killing at least 30 people and injuring many more. - Event website"}]