[{"id": "292f51a5-4115-427e-b336-9cb403e8c1f5", "title": "Rishi Sunak pledges to keep British Jews safe amid Israel", "date": "2024-06-16 11:30", "url": "http://www.myanmarmuslim.net/news/20240616173e599772.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Rishi Sunak has said he will “stop at nothing” to keep Britain’s Jewish community safe, before promising support for Israel along with other world leaders after the Hamas attacks.\nThe UK prime minister addressed a synagogue in north London to express his solidarity for Israel and to reassure Britain’s Jews.\n“We stand with Israel, the United Kingdom stands with Israel against this terrorism today, tomorrow and always,” Mr Sunak said.\nIn Westminster, around 2,000 people attended a Jewish community vigil, arranged by the Board of Deputies of British Jews and the Jewish Leadership Council.\nIt’s not going to lead anywhere.”The British Red Cross has launched an emergency fundraising appeal to provide humanitarian support in Israel and Gaza.", "location": "LONDON", "classification": "antisemitism", "score": 0.9110492038748983, "event_breakdown": "* Target event found: Rishi Sunak has said he will “stop at nothing” to keep Britain’s Jewish community safe, before promising support for Israel along with other world leaders after the Hamas attacks."}, {"id": "dbebff99-96ed-4ae2-8da2-13c4aa95e5bb", "title": "Charlotte Church joins pro - Winning Odds", "date": "2024-06-16 13:30", "url": "http://www.myanmarmuslim.net/news/20240616574f599423.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Welsh singer Charlotte Church said she was spreading a “loving message” as she joined a pro-Palestine rally following the backlash she received for singing a protest chant.\nIn late February, the 38-year-old led a rendition of From The River To The Sea at a Sing For Palestine fundraising event in Wales which the Campaign Against Antisemitism called a “genocidal chant”.\nOn Saturday, the singer from Cardiff marched alongside thousands of protesters in central London calling for an immediate ceasefire in Gaza.\n“But a strong, a peaceful, a loving message, that’s what every single march that I’ve been on for Palestine has been about.\nIt comes as the Government’s counter-extremism tsar warned that London’s streets have become a “no-go zone for Jews” during pro-Palestine protests.", "location": "LONDON", "classification": "antisemitism", "score": 0.8513178834233527, "event_breakdown": "Wales Online: Pro-Palestine march: Singer Charlotte Church says she was spreading a ‘loving message’ to join protest\nWales Online"}, {"id": "cb0236a5-4f7a-4cf6-ba81-f4d997c11614", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”.", "location": "Australia", "classification": "antisemitism", "score": 0.7542017755995918, "event_breakdown": "[\n  {\n    \"title\": \"Protests in London after Israeli evictions in East Jerusalem\",\n    \"description\": \"Protesters gathered outside Downing Street, London, after Israel had evicted Palestinian families from their homes in the Sheikh Jarrah neighborhood of East Jerusalem and following disturbances at Al Aqsa Mosque in Jerusalem.\",\n    \"location\": \"10 Downing Street, London, United Kingdom\"\n  },\n  {\n    \"title\": \"Protests in Belgium after Muslim worshippers attacked in Jerusalem\",\n    \"description\": \"Following attacks on Muslim worshippers, especially Palestinians, inside and outside Al Aqsa Mosque, demonstrators gathered in Belgium to protest Israeli actions during the holy month of Ramadan.\",\n    \"location\": \"Grand Place, Brussels, Belgium\"\n  }\n]"}, {"id": "5a6e32c4-82cf-4580-b32a-8e6ea1a65d25", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 06:00", "url": "https://www.brisbanetimes.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”.", "location": "Gaza", "classification": "antisemitism", "score": 0.7542017755995918, "event_breakdown": "Title: Recent Reports of Antisemitism in the Middle East\nTarget Event: Hizb ut-Tahrir using front groups to infiltrate the university encampment and pro-Palestine movements\nShort Report:\nHizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements. There is growing concerns about their antisemitism and violent rhetoric."}, {"id": "3c77080f-c355-4d5c-aa8d-2515f60b4daa", "title": "Belgium arts center cancels Jewish school event over Gaza  genocide  ", "date": "2024-06-16 17:30", "url": "https://nypost.com/2024/06/16/world-news/belgium-arts-center-cancels-jewish-schools-event-over-gaza-genocide/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A Belgian arts center has riled up controversy over its director canceling a Jewish school’s event there because Israel was committing “genocide” in Gaza, according to a new report.\n“We look with horror at the genocide that is currently taking place in Gaza,” Willems wrote.\nLana Willems, director of the publicly funded Monty Hall arts center, in Antwerp, Belgium, rejected a rental request from a Jewish school over the ”genocide” in Gaza.\nThe center received immediate backlash, with Jewish leaders condemning the decision to cancel the school event as racist and antisemitic.\nIt remains unclear if the Tachkemoni Jewish School will work with the Monty Hall arts center on an event there.", "location": "Antwerp", "classification": "antisemitism", "score": 0.8545813010733306, "event_breakdown": "Target Event:\nBelgian school cancels event over Israel's \"genocide\" in Gaza\nLocation:\nMonty Hall arts center, Antwerp, Belgium"}, {"id": "c924af02-a044-4c7a-9f7c-c46e691bdc6a", "title": "Jews grieve and pray for peace in first Shabbat services since Hamas attack", "date": "2024-06-16 20:15", "url": "http://www.myanmarmuslim.net/news/20240617299b599646.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosJews in communities far from Israel have gathered at synagogues this weekend for their first Shabbat services since Hamas militants attacked Israel, igniting an ongoing war.\nOne US rabbi based in Pittsburgh said the deadly Hamas attack is not just another geopolitical event for Jewish people – it is dredging up generations of visceral trauma, especially in a city scarred by the deadliest antisemitic attack in US history.\nBy comparison, last week’s Hamas attack was “tragic and horrifying and gut wrenching, but it was believable”.\nAfter the Pittsburgh synagogue attack, “we felt the whole community embraced us,” Rabbi Adelson said.\nThe heightened safety measures come in reaction to global tensions triggered by Hamas’ attack, and Israel’s subsequent bombing of Gaza, as well as calls on social media to violently protest in front of Jewish institutions in Germany.", "location": "Pittsburgh", "classification": "antisemitism", "score": 0.9254072650494378, "event_breakdown": "Gaza, Israel, Germany, Pittsburgh"}]