[{"id": "2865af31-cfca-4c0f-970f-a5136cb7212f", "title": "Israeli Strikes Kill 5 in South Lebanon , Including 3 Children", "date": "2024-07-17 21:15", "url": "https://dailystar.com.lb/israeli-strikes-kill-5-south-lebanon-3-children/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Lebanese official media reported that separate Israeli strikes on Tuesday in southern Lebanon resulted in the deaths of five people, including three Syrian children.\nAccording to the National News Agency (NNA), three Syrian children were killed in an airstrike that targeted farmland in the village of Umm Toot.\nThe United Nations children’s agency, UNICEF, expressed concern over the ongoing violence, highlighting the tragic death of three children in southern Lebanon.\nThe Israeli military reported that 40 projectiles were fired from Lebanon on Tuesday, followed by an additional 10 later in the day.\nThe Israeli air force responded with strikes on Hezbollah sites in southern Lebanon, including a “terrorist cell” near Umm Toot.", "location": "Umm Toot", "classification": "security", "score": 0.9630175219755006, "event_breakdown": "Israeli Strikes in Southern Lebanon Kill 5 People, Including 3 Syrian Children"}, {"id": "64c2e4cc-04a6-4208-b3eb-a59a2a5347e1", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 02:30", "url": "https://www.yahoo.com/news/lebanon-media-says-3-children-014250642.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 (Rabih DAHER)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "According to the text, the main location where the events of the story take place is Kfar Kila,", "classification": "security", "score": 0.9827940990289271, "event_breakdown": "1. Five people, including three Syrian children, were killed in Israeli strikes on July 16, 2024, in the village of Kfar Kila in southern Lebanon.\n2. Hezbollah fired rockets at Israel in retaliation to the Israeli strikes.\n3. 40 Hezbollah projectiles fired from Lebanon were identified by Israel on July 16, 2024.\n4. The Israeli military launched strikes against parts of south Lebanon, including a \"terrorist cell\" in the Yarin area."}, {"id": "4a6583d5-6316-4e1e-8fd3-b98cb28241ae", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 02:30", "url": "https://www.digitaljournal.com/world/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 - Copyright AFP Rabih DAHERLebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of “Katyusha rockets” at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a “terrorist cell” in the Yarin area, which is close to Umm Toot.", "location": "Kfar Kila", "classification": "security", "score": 0.9827940990289271, "event_breakdown": "Target event: Israeli military says 40 projectiles fired from Lebanon\nEvent: Israeli military says 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day."}, {"id": "8fb4dac7-a21b-47c5-981c-578ce5b5b8b0", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 03:30", "url": "https://www.al-monitor.com/originals/2024/07/lebanon-media-says-3-children-among-5-dead-israeli-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 16, 2024 — Beirut (Lebanon) (AFP)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "Lebanon", "classification": "security", "score": 0.9819443856110774, "event_breakdown": "Beirut (Lebanon) / Umm Toot / Kfar Tebnit road"}, {"id": "f87aa61f-65ed-4dff-ba61-2bb3b1a23702", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 03:30", "url": "https://www.guampdn.com/news/national/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article_469d0aaf-c1ff-50e1-b603-cfcbf76a82a8.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "SOUTH LEBANON", "classification": "security", "score": 0.9781802936226688, "event_breakdown": "Israeli Strikes Target South Lebanon, Hezbollah Fires Rockets at Israel\n\nTargeted sites:\n* Yarin area\n* Umm Toot\n* Kfar Tebnit road\n\nHezbollah targets:\n* Israeli military site (unnamed)\n* Unidentified targets in Haifa"}, {"id": "d041f66a-f2d1-4155-a6fb-67082cd4abad", "title": "IDF marks three main achievements in Israel - Hamas War thus far", "date": "2024-07-17 13:45", "url": "https://www.jpost.com/israel-hamas-war/article-810651", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF increases military pressure across GazaThe IDF states that several alternatives for maintaining control of the Philadelphi Corridor are being discussed privately.\nThe IDF is increasing pressure on Hamas on the three main fronts in the depths of the territory: Rafah, the center, and the north of the Gaza Strip.\nThrough the Gaza Division, the IDF is also deepening its comprehensive management and strategic control of the operational area.\nView of the Philadelphi Corridor between the southern Gaza Strip and Egypt, on July 15, 2024.\nIn an operation by Division 99 and Division 98 in Shejaia and the Rimal neighborhood in Gaza City, the IDF discovered UNRWA's \"Dalal\" compound.", "location": "GAZA", "classification": "security", "score": 0.9765256774357676, "event_breakdown": "IDF increases military pressure across Gaza\nIDF discovers UNRWA's \"Dalal\" compound in Gaza City"}, {"id": "2644ce6b-c2f6-47dc-8e55-55b0bd1bfa68", "title": "Israeli strikes across Gaza kill at least 57 , Palestinian health officials say", "date": "2024-07-17 05:00", "url": "https://www.koreatimes.co.kr:443/www/world/2024/07/501_378809.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "location": ")\nGAZA", "classification": "security", "score": 0.9699952581326289, "event_breakdown": "Current events of security reported in the text:\nIsraeli airstrike on a car in Khan Younis, a southern border city\nFive Palestinians were killed in an airstrike in Rafah"}, {"id": "190c04e7-9c31-4f64-a9d8-8dd268b17171", "title": "57 More Gazans Perish In Israeli Genocide UN - Run School Hit Again", "date": "2024-07-17 03:30", "url": "https://menafn.com/1108447524/57-More-Gazans-Perish-In-Israeli-Genocide-UN-Run-School-Hit-Again", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Palestinian officials said at least 57 people were killed yesterday in Israeli bombardments of southern and central areas of the Gaza Strip.\nIn nearby Khan Younis, a man, his wife, and two children were killed.\nLater yesterday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nHours later, an Israeli air strike on a UN-run school that housed displaced families in the Nuseirat camp killed 23 people and wounded many others, health officials said.\nThere are no more safe agency schools, or safe clinics, no more safe houses, no safe streets.", "location": "GAZA CITY", "classification": "security", "score": 0.973746674431926, "event_breakdown": "Target event:\nThe Israeli army has struck missile targets around the Gaza Strip, killing at least 28 Palestinians."}, {"id": "9b0c25fc-23b1-4c65-a15d-a5035a401986", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 05:00", "url": "https://www.independent.co.uk/news/ap-israeli-gaza-hamas-beirut-b2581029.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "It has not only wreaked physical destruction on hospitals and health facilities, it has devastated Gaza’s medical personnel.\nIsraeli strikes in November on a northern Gaza hospital killed two doctors working with Doctors Without Borders.\nAlong with the personal toll, their deaths rob Gaza’s medical system of their skills when they have become crucial.\nSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nOsama was on duty in the emergency room at Nasser hospital when he received the call.", "location": "Gaza", "classification": "security", "score": 0.7311679758302154, "event_breakdown": "Israeli offensive on Gaza medical facilities (November 2012)"}, {"id": "01697d45-e256-4224-8eb5-4c390fe89a54", "title": "The 2018 stabbing of Brazil president offers insight on the predictable misinformation spread post - Trump shooting", "date": "2024-07-17 02:30", "url": "https://www.niemanlab.org/reading/the-2018-stabbing-of-brazils-president-offers-insight-on-the-predictable-misinformation-spread-post-trump-shooting/", "domain": "niemanlab.org", "domain_classification": "Unknown", "message": "What’s the best way to follow how the news is changing?\nOur daily email, with all the freshest future-of-journalism news.", "location": "EMAIL\nDaily", "classification": "security", "score": 0.43413952024928737, "event_breakdown": "SSP Mehrabpur Police Station SHO Abdul Jabber Malik shot dead near Mehrabpur.Unknown armed assailants opened fire on Abdul Jabbar Malik near the Mehrabpur Old Bus Stand late on Thursday night. The SHO was returning home on a motorcycle after meeting with family of an accused who was recently killed in an encounter."}, {"id": "aafff9f1-e5ea-4fc6-8017-2b003121a56c", "title": "Israel attacks Lebanon and fires missiles at Shmona village", "date": "2024-07-17 01:00", "url": "https://www.archyde.com/israel-attacks-lebanon-and-fires-missiles-at-shmona-village/", "domain": "archyde.com", "domain_classification": "Unknown", "message": "Israeli warplanes attacked a motorcycle in the Hadali district of southern Lebanon, killing two people on the motorcycle, hours after Israeli warplanes attacked a house in the city, including a Hezbollah member.\nIt is understood that an Israeli aircraft dropped an air-to-ground missile on an inhabited house, killing three brothers, Fawzia, Tagrid and Amir Dagher, whom Hezbollah called “Hezbollah”.\nIsraeli artillery also bombed the town of Delma Mas in southern Lebanon and near the Litani River, and used phosphorus bombs to attack residential areas in the town of Delma Mas in the eastern region of southern Lebanon.\nIsraeli artillery also targeted the town of Yakhmal Shakif in southern Lebanon’s Nabatiyeh district, which is considered non-compliant with the rules of engagement between Hezbollah and Israeli forces.\nIsrael has previously threatened to turn Beirut into a second Gaza, with ongoing military operations targeting civilians and assassinations deep in Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9989515144170995, "event_breakdown": "Israeli warplanes target Hezbollah militant in southern Lebanon\nIsraeli warplanes attacked a house in the Hadali district of southern Lebanon on Sunday, killing three brothers, Fawzia, Tagrid and Amir Dagher, whom Hezbollah called “Hezbollah” in Lebanon.\nIsraeli artillery then bombed the town of Delma Mas in southern Lebanon and near the Litani River, and used phosphorus bombs to attack residential areas in the town of Delma Mas in the eastern region of southern Lebanon.\nIsraeli artillery targeted the town of Yakhmal Shakif in southern Lebanon’s Nabatiyeh district, which ignored the rules of engagement between Hezbollah and Israeli forces."}, {"id": "92c89389-3db6-47e0-abe5-28d896d83210", "title": "WATCH : ATACMS Destroys Russian S - 300 Anti - Missile System Near Occupied Mariupol", "date": "2024-07-17 17:00", "url": "https://www.kyivpost.com/post/35971", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Commander-in-Chief of the Ukrainian Armed Forces (AFU), Oleksandr Syrsky, announced a successful strike on a Russian S-300 anti-missile system near Mariupol in the occupied Donetsk region.\nSyrsky confirmed the strike and commended Ukrainian servicemen for their successful execution of the mission.\nOn July 16, Syrsky released a video confirming the destruction of the Russian S-300 system.\nAccording to Militarnyi media outlet, Ukrainian missile forces used ATACMS to fire at least four M39 cluster ballistic missiles at Russian anti-aircraft positions on the outskirts of Mariupol.\nThe Russian S-300’s location was pinpointed east of Mangush village in the Donetsk region, approximately 7 kilometers from the Mariupol airfield, as reported by Militarnyi.", "location": "Donetsk region", "classification": "security", "score": 0.5761965491868757, "event_breakdown": "AFU successfully destroyed Russian S-300 anti-missile system near Mariupol, Donetsk region."}, {"id": "0e43d476-6b6e-40cd-9761-85b6498be7b8", "title": "Nasrallah Threatens to Attack Additional Parts of Israel | The Jewish Press - JewishPress . com | Jewish News Syndicate ( JNS ) | 12 Tammuz 5784 – Thursday , July 18 , 2024", "date": "2024-07-17 23:00", "url": "https://www.jewishpress.com/news/middle-east/hezbollah/nasrallah-threatens-to-attack-additional-parts-of-israel/2024/07/18/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Tasnim News AgencyHiding in his underground bunker, Hezbollah leader Hassan Nasrallah threatened to attack Israeli communities that have not come under fire yet if the IDF continues to, in his words, “attack civilians” in Southern Lebanon.\nHe made the statement after noting an alleged increase in the number of “non-involved” casualties in Lebanon in recent days.\n“Israel is not only short on soldiers to fight the war, now it is suffering from a shortage of tanks and munitions,” the terrorist leader said.\nHe called on “Palestinians” around the world to join in supporting the war against Israel.\n“We also call on the Palestinian people to unite today among the resistance shaping the fate of Palestine, the region, and the people,” Nasrallah said.", "location": "NULL", "classification": "security", "score": 0.5657493772449338, "event_breakdown": "Since the Israeli missile strike that killed prominent Iranian Revolutionary Guard member and Hezbollah militant, a new Israeli military campaign against Hezbollah in Lebanon has led to another attack along the Israel-Lebanon border that left two Hezbollah members dead. The border clash began when the Israeli military began firing flares and smoke bombs to disperse Hezbollah border protesters who were gathering in attempt to distract Israeli soldiers from work to be done by the excavators hired by Hezbollah, which were busy digging underground tunnels into Israeli territory.\n\nThe Israeli Defense Force confirmed it fired artillery shells at the area. Hezbollah also fired an anti-tank missile from Lebanon towards an area near the Lebanese border in what an IDF spokesman said was a \"terrorist attack\".\n\nHezbollah's leader, Nasrallah, has warned Israel they could have \"no safe place\" for a week after the missile strike that killed his comrade, who was a member of the elite Quds force.\n\n\"I say to the Israeli army on the border from tonight, stand back, and stand down because if you cross the border, it is Lebanon that will dictate the rules,\" Nasrallah said.\n\n\"The rules have changed,\" Nasrallah added.\n\nIn response to the mounting tensions, the Israeli military spokesman told reporters that Israel had attacked what it termed \"infrastructure at the border that is used to transport forces and weapons intended for an attack on Israeli territory\".\n\nThis is the 5th border skirmish between the shadowy groups of Hezbollah in the last 6 days."}, {"id": "b8fcfeb7-3d4d-4f90-8cf1-daaaa19aa96b", "title": "Orosz – ukrán háború # 18", "date": "2024-07-17 03:00", "url": "https://hup.hu/comment/3085465", "domain": "hup.hu", "domain_classification": "Unknown", "message": "[insert line here]B.C.\n3500 - DIY Vehicle / A.D. 30 - DIY Religion / A.D. 1991 - DIY OS", "location": "B.C.", "classification": "security", "score": 0.8280605645907164, "event_breakdown": "B.C. 321 - Battle of Badr / A.D. 732 - Battle of Tours / A.D. 1095 - First Crusade / A.D. 1549 - Spanish conquest of Peru / A.D. 1707 - War of Spanish Succession\nA.D. 1898 - Spanish-American War / A.D. 1918\nA.D. 1945 - End of World War II\nA.D. 1989 - Fall of the Berlin Wall / A.D. 1991 - Gulf War\nA.D. 2001 - September 11 attacks / A.D. 2003 - Iraq War\nA.D. 2020 - COVID-19 pandemic\nA.D. 2022 - Russian invasion of Ukraine\nA.D. 2023 - Syrian Civil War"}, {"id": "b41ba6ba-a29b-4f00-9e54-8c8b1608c6d0", "title": "Orosz – ukrán háború # 18", "date": "2024-07-17 07:15", "url": "https://hup.hu/comment/3085529", "domain": "hup.hu", "domain_classification": "Unknown", "message": "[insert line here]B.C.\n3500 - DIY Vehicle / A.D. 30 - DIY Religion / A.D. 1991 - DIY OS", "location": "Based on the text, the main location where the main event takes place is 'B.C.'", "classification": "security", "score": 0.8280605645907164, "event_breakdown": "A.D. 1991 - DIY OS:\n\nIn 1991, a group of software developers met at the University of Illinois at Urbana-Champaign to discuss the creation of a new operating system. Their goal was to design a system that would be easy to use and would allow users to create and modify their own software.\n\nAfter several years of development, the group released the first version of the DIY OS in 1993. Since then, the DIY OS has been used by millions of people around the world to create their own software.\n\nThe DIY OS is open-source software, which means that it is free to download and use. It is also highly customizable, allowing users to add new features and remove existing ones. This makes it a popular choice for software developers and technical enthusiasts.\nWhile the DIY OS was initially designed for personal computers, it has since been ported to a wide range of devices, including smartphones, tablets, and even video game consoles. The DIY OS is also used in a variety of industrial applications, such as robotics and automation.\n\nOverall, the DIY OS has had a significant impact on the software industry. It has helped to democratize software development and empower users to create their own software."}, {"id": "6ba389ab-cfc5-40c2-8c69-d24eb8054974", "title": "Israel Pounds Central Gaza , Sends Tanks Into North of Rafah", "date": "2024-07-17 16:15", "url": "https://www.newsmax.com/world/globaltalk/israel-war-hamas/2024/07/17/id/1172869/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Israeli forces pounded areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nIsraeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the center of enclave, residents said.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area.\"\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": "GAZA", "classification": "security", "score": 0.9295098303891725, "event_breakdown": "Israeli forces pounded areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes."}, {"id": "e673345e-12bb-4888-8193-aea9404680a1", "title": "Israel pounds central Gaza , sends tanks into north of Rafah", "date": "2024-07-17 09:15", "url": "https://www.marketscreener.com/news/latest/Israel-pounds-central-Gaza-sends-tanks-into-north-of-Rafah-47398681/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Israeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the centre of enclave, residents said.\nMeanwhile in Rafah, tanks carried out a raid in the north of the city before retreating, a tactic Israeli forces have used in other areas before mounting deeper incursions.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area\".\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": "GAZA CITY.", "classification": "security", "score": 0.8678788537345253, "event_breakdown": "Israeli tanks shelled several areas of the central Gaza Strip on Thursday, killing two Palestinians in Rafah and displacing thousands of people. The Israeli military said its troops were continuing operations in Rafah."}, {"id": "27a4753f-8ce8-4321-9d99-aa391c0847b5", "title": "Israel pounds central Gaza , sends tanks into north of Rafah", "date": "2024-07-17 12:00", "url": "https://www.swissinfo.ch/eng/israel-pounds-central-gaza%2c-sends-tanks-into-north-of-rafah/84059585", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israel pounds central Gaza, sends tanks into north of Rafahreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Israeli forces hit areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nThe Israeli military said troops were “continuing precise, intelligence-based operational activity in the Rafah area”.\nA deal would aim to end the war and release Israeli hostages in Gaza in return for many Palestinians jailed by Israel.\nOn Wednesday, Israel released 13 Palestinians detained during the offensive in Gaza, the Palestinian Red Crescent said in a statement.\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": "GAZA", "classification": "security", "score": 0.8739779491727325, "event_breakdown": "-Israeli forces hit areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south."}, {"id": "bb7875c1-c9da-4c9f-952c-ef550a316a3a", "title": "Is Hamas Crumbling ? Report of  Major Internal Breach  ", "date": "2024-07-17 17:30", "url": "https://www2.cbn.com/news/israel/hamas-crumbling-report-major-internal-breach", "domain": "cbn.com", "domain_classification": "Unknown", "message": "PHOTO: Israel struck a site in Khan Younis, southern Gaza Strip, Saturday, July 13, 2024, targeting Hamas' shadowy military commander Mohammed Deif.\n(AP Photo/Jehad Alshrafi)Israel has reportedly received intelligence from insiders in the Hamas terrorist organization as it has been hunting down the group's top leaders.\nA Saudi news channel is reporting Hamas is looking at a possible \"major internal breach\" after Israel's targeted strike in Gaza over the weekend.\nThe Times of Israel reports the Jewish state might have also been able to extract useful information from Hamas leaders it has captured.\nMiddle East analyst Bill Koenig told CBN News Hamas has been hiding among civilians, using them as human shields for many years.", "location": "GAZA CITY", "classification": "security", "score": 0.667426089636782, "event_breakdown": "Israel reportedly received intelligence from sources within Hamas and targeted a Hamas facility in Khan Younis, southern Gaza Strip, on Saturday, July 13, 2024 as part of an ongoing operation to hunt down Hamas' top commanders."}, {"id": "435aadd4-2841-442f-a36a-f303fe79b24b", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:30", "url": "https://isp.netscape.com/news/world/story/0001/20240717/81c6480635f860c485b66d5454e948ef", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "A Gaza father mourns his baby boy, killed in bed by an Israeli airstrikeDEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.\n© Copyright The Associated Press.\nThe information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press.", "location": "DEIR AL-BALAH, Gaza Strip.", "classification": "security", "score": 0.9771162134243815, "event_breakdown": "Gaza father mourns his baby boy, killed by an Israeli airstrike."}, {"id": "4aa0d65b-0b5a-443e-82a3-3813fd82d8f6", "title": "  Only a matter of time  before an assassination attempt is made on an Australian politician , warns Karen Andrews", "date": "2024-07-17 02:00", "url": "https://www.skynews.com.au/australia-news/politics/only-a-matter-of-time-before-an-assassination-attempt-is-made-on-an-australian-politician-warns-karen-andrews/news-story/92ee7d6f7c82b58ef59251bc3a9a5131?nk=e3b63ee6a450b27e3ce6c9e343718205-1721180818", "domain": "skynews.com.au", "domain_classification": "Unknown", "message": "Former home affairs minister Karen Andrews has backed a review into protective security arrangements as she claimed it was “only a matter of time” before an assassination attempt was made on an Australian politician.\nMs Andrews had warned of an attempt on the life of an Australian politician in the wake of former Japanese prime minister Shinzo Abe's assassination in July 2022.\nShe doubled down on her stance on Tuesday telling The Australian she was “concerned” a similar assassination attempt would be made in Australia, following the attempted shooting of Donald Trump at a campaign rally over the weekend.\nFormer home affairs minister Karen Andrews has warned it is “only a matter of time” before an assassination attempt is made on an Australian politician.\nMs Andrews, who served as home affairs minister from March 2021 through May 2022, said it was \"only a matter of time\" before a similar attempt on a politician's life was made in Australia.", "location": "Australia", "classification": "security", "score": 0.4017525028956731, "event_breakdown": "- July 2022: Former home affairs minister Karen Andrews warns it is 'only a matter of time' before an assassination attempt is made on an Australian politician."}, {"id": "95f7311c-5874-494d-88fc-7e9160e4844c", "title": "Over half of Hama military operatives still alive , IDF report estimates", "date": "2024-07-17 01:00", "url": "https://www.ynetnews.com/article/rygtnhvur", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "“IDF ground, air and naval forces have been operating in the Gaza Strip for 263 days in order to achieve the objectives of the war.\n3 View gallery IDF forces in Gaza ( Photo: IDF Spokesperson's Unit )“As a result of precise intelligence and operational efforts, half of the leadership of Hamas' military wing has been eliminated up until this stage of the war through a series of strikes and eliminations.\n3 View gallery ( Photo: IDF Spokesperson's Unit )“The forces in the field are fighting both above and below ground.\nMeanwhile, more details have came to light about the attempted elimination of Hamas military wing commander Mohammed Deif last week.\nThe strike was carried out with heavy bombs precisely at 10:29 a.m. \"Military pressure allowed for this opportunity,\" the IDF said.", "location": "Gaza Strip", "classification": "security", "score": 0.9527466457038184, "event_breakdown": "IDF ground, air and naval forces have been operating in the Gaza Strip for 263 days in order to achieve the objectives of the war.\nThe IDF confirmed during their press conference on Wednesday, August 5th that 63 underground terrorist installations were hit in the wee hours of Monday; the number of tunnels destroyed since the hostilities began has been raised to 31."}, {"id": "cb30a389-7197-4ceb-ba37-2cb9e1fdb961", "title": "Good Samaritan helps stabbing victim south of Downtown", "date": "2024-07-17 02:45", "url": "https://www.yahoo.com/news/good-samaritan-helps-stabbing-victim-000832881.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(COLORADO SPRINGS) — A good Samaritan helped transport an injured victim of a possible stabbing on Tuesday morning, July 16.\nAccording to the Colorado Springs Police Department (CSPD), officers were originally notified by members of the Colorado Springs Fire Department (CSFD) about a possible shooting at a gas station in the 1000 block of South Nevada Avenue, south of Downtown Colorado Springs.\nCSPD said a good Samaritan found an adult man suffering from some kind of injury near Fountain Boulevard and Chelton Road and was transporting him to a hospital when the individual spotted CSFD and stopped for medical attention.\nCSPD said the victim was “in an altered mental state” and was not providing much factual information.\nHe was taken to the hospital with non-life-threatening injuries, which were determined to be caused by a possible stabbing, not a gunshot.", "location": "Colorado Springs", "classification": "security", "score": 0.793902161182019, "event_breakdown": "Security event: A good Samaritan helped transport an injured victim of a possible stabbing on Tuesday morning, near the 1000 block of South Nevada Avenue, south of Downtown Colorado Springs, in the United States."}, {"id": "79fa6b2b-c9a6-4c53-96bd-2222b7b1e379", "title": "How would killing Mohammad Deif affect Israel - Hamas War ? ", "date": "2024-07-17 04:15", "url": "https://www.jpost.com/opinion/article-810579", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Some might think of Yahya Sinwar, the current leader of Hamas in Gaza, who is living hiding in tunnels, but fewer people know of Hamas’s military chief, Mohammad Deif.\nIsrael recently targeted Deif in an IDF airstrike in a humanitarian zone near Khan Yunis in southern Gaza.\nHe emerged from the tunnels in the Khan Yunis refugee camp to meet with Ra’fat Salama, the commander of Khan Yunis, Al-Mawasi.\nAccording to Saudi sources, there was a breach in Deif’s security circle, and someone provided information on his movements to Israel.\nIt is believed that Deif was meeting Al-Mawasi over the negotiations of a hostage deal or to issue orders for Hamas’ activities in Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.9133972601430776, "event_breakdown": "IDF Targeting of Mohammad Deif in Khan Yunis refugee camp in Gaza"}, {"id": "9125bbab-7da7-4802-887b-8af4adb57dd9", "title": "Early Edition : July 17 , 2024", "date": "2024-07-17 14:30", "url": "https://www.justsecurity.org/97801/early-edition-july-17-2024/", "domain": "justsecurity.org", "domain_classification": "Unknown", "message": "Signup to receive the Early Edition in your inbox here.\nPeter Baker, Adam Goldman, and Julian E. Barnes report for the New York Times; Erin Banco reports for POLITICO.\nThe Israeli military said it had targeted militants who had operated inside the building.\nAbout 17 people were killed yesterday in a separate strike in Mawasi, an Israel-designated safe zone, according to the Hamas-run health ministry.\nThe Israeli military said it had struck an Islamic Jihad commander in Khan Younis and that it was investigating reports that civilians were injured.", "location": "GAZA CITY.", "classification": "security", "score": 0.9284151680698727, "event_breakdown": "Israeli military targeted militants who had operated inside that building.\n\nIsraeli forces targeted a car near Gaza City. Reports say that an Israeli missile targeted a house of a local leader of the Islamic Jihad in Khan Younis\nThe Israeli army said it was targeting militants who had operated inside that building.\n\nThere have been no reports of injuries at this time."}, {"id": "c0be4ed5-0e9d-496a-84d8-2b3965658429", "title": "Richmond : Person of interest in Fourth of July stabbing dead", "date": "2024-07-17 18:45", "url": "https://www.eastbaytimes.com/2024/07/17/person-of-interest-in-fatal-fourth-of-july-stabbing-in-richmond-found-dead-in-mexico/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "RICHMOND — A man suspected in the fatal Fourth of July stabbing of a woman has been found dead in Mexico, while another person that police sought in the shooting death of a man near the Richmond Parkway has been arrested in Nebraska, authorities said.\nEdirlei Tofolio was a person of interest in the July 4 stabbing death of 48-year-old Elindenia Silva, of El Sobrante.\nRichmond police spokesperson Lt. Donald Patchin said he was found dead in Mexico on July 9.\nIn the other incident, police arrested Arcenio Marquez late last month following the shooting death of Elizander Narvaez-Fernandez, 26, of Richmond on June 23, Patchin said.\nPolice in Richmond have investigated nine homicides in 2024, one more than in all of 2023.", "location": "Richmond, California", "classification": "security", "score": 0.889883988959625, "event_breakdown": "Edirlei Tofolio, a homicide suspect, died in Mexico; Arcenio Marquez arrested in Nebraska over June 23 shooting death near Richmond Parkway; Richmond police investigated nine homicides in 2024, one more than 2023."}, {"id": "a3176ff1-3ba1-46f2-a5b2-a3ea994f9586", "title": "Hezbollah threatens to target new Israeli sites if civilians are killed", "date": "2024-07-17 16:15", "url": "https://www.malaymail.com/news/world/2024/07/17/hezbollah-threatens-to-target-new-israeli-sites-if-civilians-are-killed/144081", "domain": "malaymail.com", "domain_classification": "Unknown", "message": "BEIRUT, July 17 — Hezbollah leader Hassan Nasrallah warned Wednesday that his Iran-backed group would hit new targets in Israel if more civilians are killed in Israeli strikes on Lebanon.\n“If the enemy continues to target civilians as it has done in recent days, then this will push us to target localities that we have not targeted until now,” Nasrallah said.\nLebanon’s state-run National News Agency said Israeli strikes in the south killed five people, including three Syrian children, on Tuesday.\nNasrallah warned Israel of the consequences of any invasion of Lebanon, saying Israel would be left without any tanks if a full-blown conflict erupted.\nOn the Israeli side, 17 soldiers and 13 civilians have been killed, according to authorities.", "location": ".\nLebanon", "classification": "security", "score": 0.937691426280316, "event_breakdown": "Hezbollah leader: If Israel targets civilians again, we will strike new localities."}, {"id": "44991552-272a-4701-95ea-c953180f6f6c", "title": "Israel Has Attacked Gaza  Safe Zone  at Least 10 Times Since Rafah Invasion", "date": "2024-07-17 22:00", "url": "https://truthout.org/articles/israel-has-attacked-gaza-safe-zone-at-least-10-times-since-rafah-invasion/", "domain": "truthout.org", "domain_classification": "Unknown", "message": "The attacks started as early as just two weeks after Israel forced Palestinians to flee to the area.\nAccording to London research group Forensic Architecture, the area in Al-Mawasi now sheltering thousands of Palestinians has been subject to Israeli attacks since May 6, when Israeli officials first delineated the “safe” zone.\nJust days after, Israel unleashed another set of bombs on Al-Mawasi on Tuesday, killing at least 17 Palestinians.\nAt least two of these attacks on the “safe” zone have used U.S. bombs.\nThese attacks on the explicitly designated “safe” zone come as Israel has relentlessly attacked other areas of Gaza in violation of international humanitarian law, which forbids targeting civilian infrastructure.", "location": ".\nAl-Mawasi in Gaza.", "classification": "security", "score": 0.9608369099334381, "event_breakdown": "Al-Mawasi, Gaza Strip"}, {"id": "7f0ec3bd-1ba6-46af-b147-a6e660e7bd94", "title": "Police Connect 4 Murder Suspects To Violent Crime Spree Across OKC Metro", "date": "2024-07-17 00:30", "url": "http://www.news9.com/story/6696dd9aaf7ca9fa19af5aa7/police-connect-4-murder-suspects-to-violent-crime-spree-across-okc-metro", "domain": "news9.com", "domain_classification": "Unknown", "message": "Investigators have tied four murder suspects to a violent crime spree spanning the Oklahoma City metro.\n-Investigators have tied four murder suspects to a violent crime spree spanning the Oklahoma City metro.\nThe crime spree started last Tuesday at a home in northwest Oklahoma City.\nDillon Quirk, Oklahoma City Police Department.\nOfficers found the stolen car in southwest Oklahoma City when a pursuit started.", "location": "OKLAHOMA CITY", "classification": "security", "score": 0.9176188945948643, "event_breakdown": "* 4 murder suspects tied to violent crime spree in Oklahoma City metro (specific location: Oklahoma City)"}, {"id": "f8d5b04e-5b37-48af-8956-7c6cd4eec776", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 05:15", "url": "https://www.ksat.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza city", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli airstrikes kill more than 60 Palestinians in southern and central Gaza\n\nMikdad carries Yamam's body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\n\nMen hold a funeral prayer over Yamam's body wrapped in a white shroud."}, {"id": "54c79929-ee5d-4e1f-b8a6-0d201f11ba11", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:45", "url": "https://www.clickondetroit.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Al Aqsa Martyrs hospital", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes killed more than 60 Palestinians in southern and central Gaza on Monday and Tuesday, according to hospital records and health officials."}, {"id": "93db0694-3dcd-43db-a078-13f053524f70", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:30", "url": "https://www.local10.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli airstrikes have killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials."}, {"id": "3e125cd6-7c91-4e55-8cd7-04a345415a4b", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 05:15", "url": "https://www.news4jax.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes killed more than 60 Palestinians in southern and central Gaza on Monday and Tuesday, according to hospital records and health officials. Mikdad carried Yamam's body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah."}, {"id": "1495c706-4942-476b-b10d-79592bf33ea3", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:15", "url": "https://www.clickorlando.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli Strikes in Gaza\nThe Israeli Air Force carried out dozens of airstrikes in the Gaza Strip, killing over 100 Palestinians. The IDF said the attacks were in response to a rocket fired from Gaza into southern Israel on Monday night.\n\nYaman, a 7-year-old boy, was killed by an Israeli airstrike in Gaza, according to hospital records and health officials."}, {"id": "8ae805d9-53c0-43ab-9278-c2e2bde6dcc5", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:15", "url": "https://www.independent.co.uk/news/gaza-ap-god-palestinian-israeli-b2581020.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.", "location": "GAZA", "classification": "security", "score": 0.916103447768473, "event_breakdown": "Israeli strikes have killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials."}, {"id": "b28a1646-9c74-49b0-8d29-37ff99a1da08", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:00", "url": "https://www.wsls.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam's body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud."}, {"id": "9d60431c-71f2-4dc2-8fea-43f4e966c90a", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 17:15", "url": "http://www.middletownpress.com/news/world/article/as-gaza-s-doctors-struggle-to-save-lives-many-19578484.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Advertisement Article continues below this adTank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders, according to the group.\nAdvertisement Article continues below this adSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nAdvertisement Article continues below this adThe Israeli military did not respond to requests for comment on the strike.\nAdvertisement Article continues below this adOsama is feeling partially responsible.\nAdvertisement Article continues below this ad___", "location": "GAZA", "classification": "security", "score": 0.9777669508206404, "event_breakdown": "Tank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders, according to the group. Soon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation. The Israeli military did not respond to requests for comment on the strike.\nCurrent event:\nTank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders, according to the group. Soon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation. The Israeli military did not respond to requests for comment on the strike."}, {"id": "299f318d-e474-4c95-977d-50fe1d5cca90", "title": "How a new missile has brought back the lost era of US Navy Top Gun dominance", "date": "2024-07-17 14:45", "url": "https://www.telegraph.co.uk/news/2024/07/17/us-navy-sm-6-fighter-jet-missile-bvr-tomcat-phoenix-top-gun/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "A US Navy F/A-18E Super Hornet fighter goes supersonic.\nThe Hornet has lately been equipped with a new, very powerful missileCredit : Matt Matlage/US Navy", "location": "VIRGINIA BEACH", "classification": "security", "score": 0.6345442325080707, "event_breakdown": "Supersonic flight by US Navy F/A-18E Super Hornet fighter"}, {"id": "c2921177-f116-4b35-983d-ef9443f285ea", "title": "Emmerdale Lucy Pargeter left injured on set as she hints at  blooper show  ", "date": "2024-07-17 15:30", "url": "https://www.dailystar.co.uk/tv/emmerdale-star-left-injured-set-33266430", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSomething went wrong, please try again later.\nLucy Pargeter, who plays the role of Chas Dingle on the ITV soap, admitted that she had hurt herself in the middle of filming new episodes of the show.\nChas' cousin Belle Dingle remains under the thumb of her abusive husband Tom King, as he continues his reign of terror against her.", "location": "The main focus of the event takes place in the ITV soap, Emmerdale. Emmerdale is a village in West Yorkshire", "classification": "security", "score": 0.624146183556472, "event_breakdown": "Lucy Pargeter, who plays the role of Chas Dingle on the ITV soap, admitted that she had hurt herself in the middle of filming new episodes of the show."}, {"id": "75c36aa7-e6ec-47d9-8b39-5e7cadc3129b", "title": "Suspect arrested in Tri - Valley BART stabbing", "date": "2024-07-17 23:15", "url": "https://www.mercurynews.com/2024/07/17/suspect-arrested-in-tri-valley-bart-stabbing/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "PLEASANTON — A woman passenger on a BART train was stabbed Wednesday morning and a suspect was later arrested, officials said.\nBART officials said the woman was injured by a “sharpened object” but did not specify what the weapon was.\nThe man suspected in the attack fled the train but was arrested by BART police outside the station moments later, BART spokesman Chris Filippi said.\nAuthorities did not release a motive for the attack and said at this point in the investigation it does not appear the suspect knew the woman.\nBART service was shut down between the Dublin/Pleasanton and West Dublin/Pleasanton stations for about an hour while police investigated.", "location": "Pleasanton", "classification": "security", "score": 0.8995034335460631, "event_breakdown": "BART service was shut down between the Dublin/Pleasanton and West Dublin/Pleasanton stations for about an hour while police were called to investigate a stabbing that occurred on the train Wednesday morning. A man was arrested outside the station moments after the attack, which was allegedly committed by another man with a sharpened object. The woman was attacked in the Dublin/Pleasanton station, and there were no further details about a motive or a planned attack, officials said. The BART spokesman did not release a map of the incident, but said it was an isolated incident."}, {"id": "f872124f-7424-4fe8-b653-89408d01bf28", "title": "Suspect arrested in Tri - Valley BART stabbing", "date": "2024-07-17 21:30", "url": "https://www.eastbaytimes.com/2024/07/17/suspect-arrested-in-tri-valley-bart-stabbing/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "PLEASANTON — A woman passenger on a BART train was stabbed Wednesday morning and a suspect was later arrested, officials said.\nBART officials said the woman was injured by a “sharpened object” but did not specify what the weapon was.\nThe man suspected in the attack fled the train but was arrested by BART police outside the station moments later, BART spokesman Chris Filippi said.\nAuthorities did not release a motive for the attack and said at this point in the investigation it does not appear the suspect knew the woman.\nBART service was shut down between the Dublin/Pleasanton and West Dublin/Pleasanton stations for about an hour while police investigated.", "location": "Pleasanton", "classification": "security", "score": 0.8995034335460631, "event_breakdown": "Pleasanton BART stabbing"}, {"id": "1d3cfff9-887c-4b30-948e-8acae728db6d", "title": "Israel pounds central Gaza , sends tanks north of Rafah", "date": "2024-07-17 10:15", "url": "https://www.newcastleherald.com.au/story/8698092/israel-pounds-central-gaza-sends-tanks-north-of-rafah/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Diplomatic efforts by Arab mediators to halt the hostilities, backed by the United States, seem to be on hold, but officials from all sides have said they are open to more talks, including Israel and Hamas, who have traded blame over the current impasse.", "location": "GAZA/JERUSALEM", "classification": "security", "score": 0.8640490479753452, "event_breakdown": "Israel-Hamas Conflict\n\nThe current hostilities between Israel and Hamas have been ongoing since May 2021. The conflict has resulted in the deaths of hundreds of people, the displacement of thousands more, and widespread destruction in the Gaza Strip. Diplomatic efforts by Arab mediators, backed by the United States, have been ongoing to try to bring an end to the hostilities, but have so far been unsuccessful. Israel and Hamas have both expressed a willingness to continue talks, but the back-and-forth blame game between the two sides has hindered progress in finding a resolution to the conflict."}, {"id": "cb6b1b20-2fc5-45d9-825d-0faa7b131739", "title": "Barrage on northern Israel , IDF strikes Hezbollah terrorist infrastructure in Lebanon", "date": "2024-07-17 04:15", "url": "http://www.israelnationalnews.com/news/393168", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Strike targeting Hezbollah infrastructure in Lebanon IDF Spokesperson's UnitThe IAF overnight Tuesday struck Hezbollah terrorist infrastructure in the areas of Yarine, Ayta ash Shab, and Aalma El Chaeb in southern Lebanon, the IDF Spokesperson’s Unit said.\nIn that barrage, according to the IDF, approximately 15 projectiles were identified crossing from Lebanon.\nSome of the projectiles were successfully intercepted by the IDF Aerial Defense Array and the rest fell in open areas.\nThe Hezbollah terrorist organization claimed responsibility for the barrage and claimed that it was carried out in response to \"the death of three Syrian children in an Israeli attack aimed at the village of Umm al-Tut\".\nIn this barrage, about ten launches were identified that crossed from Lebanon into Israeli territory and which fell in open areas.", "location": "Lebanon", "classification": "security", "score": 0.9868509430869957, "event_breakdown": "IDF strikes Hezbollah terrorist infrastructure in southern Lebanon\nIDF intercepts projectiles fired from Lebanon\nHezbollah claims responsibility for launching projectiles at Israel\nIDF says ten rockets fired from Lebanon landed in open areas"}, {"id": "c1dcb74b-aeb9-45b6-bc53-8e2f383e7392", "title": "Oil spill feared in Red Sea as Houthis attack tanker - Newspaper", "date": "2024-07-17 03:00", "url": "https://www.dawn.com/news/1846302/oil-spill-feared-in-red-sea-as-houthis-attack-tanker", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "CAIRO: Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemeni Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\n“While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess the damage and investigate potential oil spillage,” the JMIC said in a statement.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nThe Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilt cargo such as oil and fertiliser, as well as fuel used to power vessels.", "location": "JMIC - Joint Maritime Information Center", "classification": "security", "score": 0.6597719899067435, "event_breakdown": "Yemen's Houthi militia said they attacked an oil tanker and a cargo ship in the Red Sea on Tuesday in response to a weekend airstrike by the Saudi-led coalition on a Yemen prison that killed more than 160 people."}, {"id": "c305eb11-1915-43a8-a35c-0560c97d1b0f", "title": "Possible Red Sea Oil Spill After Houthi Attack", "date": "2024-07-17 06:15", "url": "https://www.marinelink.com/news/possible-red-sea-oil-spill-houthi-attack-515234", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemen's Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilled cargo such as oil and fertilizer as well as fuel used to power vessels.\n(Reuters - Reporting by Jaidaa Taha in Cairo, Nayera Abdallah in Dubai and Lisa Baertlein in Los Angeles; Editing by Alison Williams)", "location": "RED SEA", "classification": "security", "score": 0.6899707919812553, "event_breakdown": "The Houthis have targeted an oil tanker, the Chios Lion, in the Red Sea with missiles and drones. The oil tanker was assessing damage and investigating a potential oil spill after the attack."}, {"id": "e31f9dd0-9ae5-4c23-b42a-7b95e8d68005", "title": "Since The U . S . January 2020 Killing Of IRGC Qods Force Commander Qassem Soleimani , Iranian Regime Officials Have Reiterated Their Intent To Assassinate Trump In Retribution – But Today , Iran Denies Any Connection To The July 13 Assassination Att...", "date": "2024-07-17 21:15", "url": "https://www.memri.org/reports/uss-january-2020-killing-irgc-qods-force-commander-qassem-soleimani-iranian-regime-officials", "domain": "memri.org", "domain_classification": "Unknown", "message": "[1] The assassination would presumably be to avenge the killing of IRGC Qods Force commander Gen. Qassem Soleimani in an American airstrike near Baghdad in January 2020, during the Trump presidency.\n(Source: Eitaa.com/s/sepahghods_ir/12813)The next day, July 17, senior members of the Iranian diplomatic corps vehemently denied Iranian involvement in the assassination attempt.\nAnd the Americans openly said that, that they assassinated the senior Iranian military commander.\nThese officials include Iranian Supreme Leader Ali Khamenei, IRGC commander Hossein Salami, IRGC Air Force commander Amir Ali Hajizadeh, Khamenei senior advisor Kamal Kharrazi, and the editor of the regime mouthpiece Kayhan, Hossein Shariatmadari, among others.\n\"[4]Later that month, on January 12, 2022, Khamenei's website posted a video depicting an Iranian targeted killing of Trump.", "location": "Baghdad, Iraq", "classification": "security", "score": 0.6648102112224108, "event_breakdown": "[\n The event reports 2 locations: Baghdad, the city of the Iraqi airstrike that killed IRGC Qods Force commander General Qasem Soleimani, and Tehran, Iran's capital city, where the Iranian diplomatic corps vehemently denied Iranian involvement in the assassination attempt on July 17th. \n]\nBaghdad, Iraq - January 2020: US airstrike kills General Qasem Soleimani, the commander of the Qods Force of Iran's Revolutionary Guards Corps near Baghdad.\nTehran, Iran - July 2022: The Iranian diplomatic corps vehemently denied Iranian involvement in the assassination attempt."}, {"id": "71a68efe-3df4-4c13-9f9a-7d79495922ac", "title": "Relatives of those killed when MH17 was shot down mark 10 years since tragedy that claimed 298 lives", "date": "2024-07-17 14:30", "url": "https://www.theweek.in/wire-updates/international/2024/07/17/fgn56-netherlands-malaysia-mh17-anniversary.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Vijfhuizen (Netherlands), Jul 17 (AP) Relatives of passengers and crew killed when Malaysia Airlines Flight 17 was shot down over Ukraine gathered on Wednesday to mark the 10th anniversary of the tragedy that claimed 298 lives, over half of whom were Dutch.\nFamilies of the victims blamed Russian-backed rebels for the missile that took down the plane, but Moscow has repeatedly denied responsibility.\nCommemoration services took place in the Netherlands, Australia and the site of the crash in the Russia-controlled part of the Donetsk region, as the war in Ukraine raged on.\n“Today we remain unwavering in our determination to ensure truth, justice and accountability for the victims and their loved ones,” Dreyfus said.\nAn international investigation initiated in the U.N. Security Council by the Netherlands, Malaysia and Australia concluded that the Buk missile system that destroyed MH17 belonged to the Russian 53rd Anti-Aircraft Missile Brigade.", "location": "Netherlands", "classification": "security", "score": 0.49181996826050595, "event_breakdown": "Malaysia Airlines Flight 17 shot down over Ukraine\nRussia has denied responsibility"}, {"id": "cda1477d-891d-4aaf-ab7f-418ded3723da", "title": "Man accused of deadly stabbing in Dayton formally charged", "date": "2024-07-17 02:45", "url": "https://www.yahoo.com/news/man-accused-deadly-stabbing-dayton-020450992.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Man accused of deadly stabbing in Dayton formally chargedA man accused of stabbing and killing a man in Dayton has been formally charged.\nExco Kennedy, Jr., was indicted by a Montgomery County Grand Jury on counts of murder, felonious assault, and tampering with evidence.\n>> PREVIOUS COVERAGE: Man killed in Dayton stabbing ID’dWhen officers arrived, they found 43-year-old Randall Middleton suffering from stab wounds to his abdomen.\nDayton Police Sergeant Sergeant Raymond Dine told News Center 7 on the scene that the stabbing stemmed from a neighbor dispute.\nKennedy is in the custody of the Montgomery County Jail.", "location": "Dayton, Ohio", "classification": "security", "score": 0.8345236202863892, "event_breakdown": "Man accused of deadly stabbing in Dayton formally charged."}, {"id": "c7024376-94da-4851-9651-d058bc5e9ec6", "title": "North Korean nuclear weapons , 2024", "date": "2024-07-17 06:00", "url": "https://nuclear-news.net/2024/07/17/3-b1-north-korean-nuclear-weapons-2024/", "domain": "nuclear-news.net", "domain_classification": "Unknown", "message": "North Korean nuclear weapons, 2024Bulletin By Hans M. Kristensen, Matt Korda, Eliana Johns, Mackenzie Knight | July 15, 2024North Korea continues to modernize and grow its nuclear weapons arsenal.\nNorth Korea’s nuclear policyFor decades, North Korea has made numerous statements and signals about its nuclear weapons policy, laying out its nuclear doctrine if deterrence fails.\nIn 2013, for example, North Korea’s “Law on Consolidating the Position of Nuclear Weapons State” suggested a no-first-use policy, noting that North Korea’s nuclear arsenal would only be used “to repel invasion or attack from a hostile nuclear weapons state and make retaliatory strikes” (KCNA 2013).\nSuch caveats culminated in September 2022 when North Korea’s parliament codified in law North Korea’s right to launch nuclear weapons preemptively (Kim 2022).\nNorth Korea’s nuclear weapons programPlutonium production operationsThe Yongbyon Nuclear Scientific Research Center, located in North Pyongan province, has been called the “beating heart” of North Korea’s nuclear weapons program.", "location": "Yongbyon Nuclear Scientific Research Center", "classification": "security", "score": 0.49784823418502316, "event_breakdown": "North Korea continues to modernize and grow its nuclear weapons arsenal.\nNorth Korea’s nuclear policy For several decades, North Korea made numerous statements and signals about its nuclear weapons policy, laying out its nuclear doctrine if deterrence fails. In September 2022, North Korea’s Parliament codified in law North Korea’s right to launch nuclear weapons preemptively.\nCOVID-19 April 28, 2023, 27th Anniversary of the April 26 Coalition South Korea held military exercises with the United States. May 5, 2023, Kim Jong-Un publicly called on authorities to address the nation’s financial difficulties caused by the border closures according to KCNA. May 17, 2023, Kim Jong Un publicly criticized import overdependence about 43 percent of grain imports. In September 2023, North Korea undertook a census.\nReunification October 2022, South Korea’s Prime Minister conveyed a message to a large rally in Seoul’s Banpo Bridge Park that called for reunification of the Koreas.\nYongbyon Nuclear Scientific Research Center is a nuclear complex located in North Pyongan Province, North Korea. It is commonly referred to as the \"beating heart\" of North Korea’s nuclear weapons program."}, {"id": "832c557f-018b-41b3-aafd-4a43f8626f6b", "title": "Remember fallen heroes who sacrificed all for our freedoms that  are on the line today  – World Tribune : U . S . Politics and Culture , Geostrategy , China , North Korea , Corporate Watch , Media Watch", "date": "2024-07-17 21:30", "url": "https://www.worldtribune.com/remember-fallen-heroes-who-sacrificed-all-for-our-freedoms-that-are-on-the-line-today/", "domain": "worldtribune.com", "domain_classification": "Unknown", "message": "This was just west of Danang Air Base where my great friend Steve Brooks flew the F-4 Phantom jet fighter.\nHe later flew 0-2 recon aircraft out of the “Green Hornets” based at Tan Son Nhut Air Base, Saigon.\nSay a prayer for our Great Country which is under attack from within.\nHe attacked Dong Hoi Air Base in southern North Vietnam just north of the border between the two Vietnams.\nSay a prayer for our Great Country which is under attack from within.", "location": ".\nDanang Air Base", "classification": "security", "score": 0.6587318477027265, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nNo relevant events were found."}, {"id": "1d4603de-15ff-4982-9591-47bac1c6986b", "title": "US Marines in the Mediterranean can rest easy under British protection", "date": "2024-07-17 14:45", "url": "https://www.telegraph.co.uk/news/2024/07/17/us-navy-marines-royal-houthis-mediterranean-red-sea/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Council apologises after failing to count more than 6,500 general election votes", "location": "Liverpool", "classification": "security", "score": 0.7161559622549414, "event_breakdown": "Security forces have neutralised four terrorists in Jammu and Kashmir's Pulwama district. The terrorists were reportedly associated with the Jaish-e-Mohammad group. They were engaged in"}, {"id": "8d0d6144-b1a7-4577-b60c-dbc2ff6d70e9", "title": "Israeli drone strike kills a Syrian businessman with close ties to Assad – Ya Libnan", "date": "2024-07-17 03:00", "url": "https://yalibnan.com/2024/07/17/israeli-drone-strike-kills-a-syrian-businessman-with-close-ties-to-assad/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Photo: Screen capture from video purportedly showing the remains of a car hit in an alleged Israeli strike in Syria that killed regime-linked businessman Baraa Katerji, July 15, 2024.\nAn Israeli drone strike on a car Monday near the Lebanon-Syria border killed a prominent Syrian businessman who was sanctioned by the United States and had close ties to the government of Syria’s President Bashar Assad, according to pro-government media and an official from an Iran-backed group.\nMohammed Baraa Katerji was killed instantly in his SUV on the highway linking Lebanon with Syria, according to an official from an Iran-backed group.\nSyrian businessman Mohammad Katerji who was killed in Israeli drone strike near Lebanon’s borderThe pro-Syrian government newspaper Al-Watan quoted unnamed sources as saying Katerji was killed in a “Zionist drone strike on his car,” referring to Israel.\nSince then, Israeli ground offensives and bombardments have killed more than 38,400 people in Gaza, according to the territory’s Health Ministry.", "location": "Syria", "classification": "security", "score": 0.9562225929380901, "event_breakdown": "Israeli ground offensives and bombardments have killed more than 38,400 people in Gaza, according to the territory's Health Ministry."}, {"id": "cab80741-1dd5-4a6d-8501-6209918b380c", "title": "Ukraine trauma continues ; UN , NATO scramble for solution", "date": "2024-07-17 05:00", "url": "https://www.koreatimes.co.kr:443/www/opinion/2024/07/797_378827.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "By John J. MetzlerAs Ukraine’s war enters its third summer of fighting, there’s a morbid cadence to the conflict.\nFollowing the unprovoked attack on the hospital, which was for specialized cancer patients, the 15-member U.N. Security Council met in an emergency session.\nThere was a sullen stillness to the Security Council meeting on the Kyiv attacks.\nKyslytsya stressed that the Russian “war criminals will wind up in hell, bypassing purgatory.”As expected no resolution nor formal statement was voted on, just this verbal rebuke.\nTwo hundred miles to the south in Washington, NATO was commemorating the 75th anniversary of the Atlantic Alliance in 1949.", "location": "WASHINGTON", "classification": "security", "score": 0.568026209148856, "event_breakdown": "On April 7, 2022 the United Nations Security Council met in an emergency session to discuss the targeted Russian bombing of a children’s hospital and cancer center in Kyiv. Ukrainian ambassador Kyslytsya lashed out at the Russian Federation calling the consequences of the bombing are intentional attacks on the civilian population and a war crime.\nOffered the us diplomatic response to this emergency United Nations meeting at security Council\nThe U.S. Ambassador to the United Nations condemned the attack on the children’s hospital and cancer center, calling it “barbaric” and an “atrocity.”\nThe Ambassador also announced that the U.S. will provide an additional $500 million in humanitarian assistance to Ukraine to assist in the country’s war effort."}, {"id": "4e759d5f-6496-4040-9463-944d980bfaf2", "title": "Man accused of deadly stabbing in Dayton formally charged", "date": "2024-07-17 06:00", "url": "https://www.whio.com/news/local/man-accused-deadly-stabbing-dayton-formally-charged/QBGU7TWCAJFOZADZXENDTZC23A/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Error 451 indicates that access is denied from outside the United States, so the main focus of the event is within the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. A mass shooting occurred at a Buffalo supermarket, leaving ten people dead and three injured. The shooter was arrested and charged with first-degree murder.\n2. Taliban forces seized control of two more provincial capitals in Afghanistan as they continue their offensive.\n3. Thirty people were killed in a suicide bombing in a mosque in the northeastern Nigerian state of Borno.\n4. The Israeli military launched airstrikes in the Gaza Strip in response to rocket fire from Hamas.\n5. A bus bombing in the Chechen capital of Grozny killed three people and injured 13 others. The Islamic State claimed responsibility for the attack.\n6. A suicide bombing at a crowded market in Somalia's capital Mogadishu killed at least 11 people and injured many others.\n7. Twenty people were killed and more than 60 injured in a suicide bombing near a government office in Pakistan's Balochistan province.\n8. Gunmen opened fire at a tourist bus in Egypt, killing at least four people and injuring several others.\n9. A car bombing in Beirut's southern suburbs killed at least five people and injured many others. The blast was claimed by a group linked to Al-Qaeda.\n10. Two civilians were killed and six injured in a terrorist attack by gunmen on a restaurant in Burkina Faso's capital Ouagadougou.\n\nNote: Some of the reports above are from the previous week and are therefore notcurrent events."}, {"id": "5e1428e8-41e3-45d0-b181-6800f8cf02db", "title": "Egyptian , French leaders discuss efforts to reach ceasefire in Gaza", "date": "2024-07-17 02:15", "url": "http://www.china.org.cn/world/2024-07/17/content_117314927.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People stand among the rubble after an Israeli airstrike in Al-Maghazi refugee camp, central Gaza Strip, on July 15, 2024.\n[Photo/Xinhua]Egyptian President Abdel-Fattah al-Sisi held a phone talk with his French counterpart Emmanuel Macron on Tuesday to discuss efforts to reach a ceasefire in the Gaza Strip, the Egyptian presidency said in a statement.\nDuring the call, Sissi briefed Macron on Egypt's mediation efforts between Israel and Hamas, while highlighting the need for uniting international efforts to ensure the success of mediation and deliver adequate humanitarian aid into the besieged Palestinian enclave.\nMacron expressed appreciation for Egypt's persistent efforts since the onset of the ongoing Israel-Palestine crisis.\nThe two leaders reiterated the need to advance the two-state solution as the best way to achieve lasting security and stability in the region, according to the statement.", "location": "GAZA", "classification": "security", "score": 0.4740538170279522, "event_breakdown": "Israeli strike in Al-Maghazi refugee camp, central Gaza Strip."}, {"id": "e16fbe7a-04ed-4815-a8bc-a2a616b27362", "title": "Israeli airstrikes target Hezbollah in southern Lebanon", "date": "2024-07-17 07:45", "url": "https://www.voanews.com/a/israeli-airstrikes-target-hezbollah-in-southern-lebanon/7701418.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Local health officials say Israeli airstrikes killed at least nine Palestinians in the central Gaza Strip on Wednesday.\nOfficials say an Israeli airstrike hit the same camp and killed 23 people one day earlier.\nThe Israeli military says it hit 25 targets in the Gaza Strip in airstrikes over the past day.\nU.S. Defense Secretary Lloyd Austin and Israeli Defense Minister Yoav Gallant discussed the Israel-Hezbollah fighting during a phone call Tuesday, the U.S. Defense Department said.\nIsraeli officials announced Tuesday they will begin to send draft notices to ultra-Orthodox Jewish men to fight in the war in Gaza.", "location": "GAZA", "classification": "security", "score": 0.8952129029047924, "event_breakdown": "Israeli airstrikes kill at least nine Palestinians in central Gaza Strip\nU.S. Defense Secretary Austin and Israeli Defense Minister Gallant discuss the Israel-Hezbollah fighting in phone call\nIsraeli officials to start sending draft notices to ultra Orthodox Jews"}, {"id": "a6e8deca-eb3f-4998-abf7-e88e11adc315", "title": "1 stabbed in downtown Cleveland : Dispatch", "date": "2024-07-17 17:45", "url": "https://www.cleveland19.com/2024/07/17/1-stabbed-downtown-cleveland-dispatch/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "CLEVELAND, Ohio (WOIO) - One person was hospitalized Wednesday afternoon following a stabbing in downtown Cleveland, according to investigators.\nCleveland Division of Police dispatchers say one person is being transported to MetroHealth Medical Center for the stabbing, which happened around 12:40 p.m. near E. 17th.\nSt. and Hamilton Ave.\n19 News has reached out to the Cleveland Division of Police for more details.\nCopyright 2024 WOIO.", "location": ".\nCleveland", "classification": "security", "score": 0.6042452073079202, "event_breakdown": "The event 'One person hospitalized in downtown Cleveland stabbing' can be placed on a map."}, {"id": "67d059ca-10bf-4fb4-b194-a2cda3080da0", "title": "Ludlow Massacre site receives restoration grant from National Park Service", "date": "2024-07-17 02:45", "url": "https://www.cpr.org/2024/07/16/ludlow-massacre-site-receives-restoration-grant-national-park-service/", "domain": "cpr.org", "domain_classification": "Unknown", "message": "The National Park Service is providing more than $150,000 towards preserving the site of the 1914 Ludlow Massacre.\nThe grant was announced last week as part of the American Battlefield Protection Program.\nThe Colorado National Guard attack on mine workers north of Trinidad is considered a turning point in the history of the U.S. Labor movement.\nIn response, on April 20th, National Guard troops aligned with the Colorado Fuel and Iron Company attacked the approximately 1,200-member colony in an attempt to break the strike.\nThe grant funds announced last week go to the United Mine Workers of America, who will oversee the preservation and interpretation of the site, which became a National Historic Landmark in 2009.", "location": "Ludlow, Colorado", "classification": "security", "score": 0.5351143466143551, "event_breakdown": "Ludlow Massacre site preservation, Ludlow, Colorado"}, {"id": "7c5154f6-379d-4427-9f50-61f93a9d3be0", "title": "Latest Israeli strikes in Gaza kill , injure dozens ; one attack near humanitarian HQ : UN", "date": "2024-07-17 02:15", "url": "http://www.china.org.cn/world/2024-07/17/content_117314926.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People are seen in a destroyed building after an Israeli airstrike in Al-Maghazi refugee camp, central Gaza Strip, on July 15, 2024.\n[Photo/Xinhua]The latest strikes across Gaza reportedly killed and injured dozens of people, and one attack was uncomfortably close to the UN operations base, UN humanitarians said on Tuesday.\nThe UN Office for the Coordination of Humanitarian Affairs (OCHA) said one of the multiple strikes across Gaza occurred just a few hundred meters from the UN Joint Humanitarian Operations Centre.\nOCHA said UN agencies and non-governmental organizations use the base located in Deir al Balah to coordinate work throughout the Gaza Strip.\nThe humanitarians said the lack of electricity and fuel continues to impact essential service providers, including hospitals, ambulances, bakeries and aid trucks.", "location": "GAZA", "classification": "security", "score": 0.7302398856857416, "event_breakdown": "The Israeli military said it had resumed strikes on Gaza on Tuesday, after briefly stopping during a two-hour humanitarian ceasefire. Fighter jets hit more than 50 sites in Gaza during the night and early morning.\nA Palestinian youth was shot and killed by Israeli soldiers in the northern West Bank on Monday night, according to medics. He was shot in the stomach near the town of Jenin, Palestinian news agency Maan reported."}, {"id": "014f2c70-0cc2-4dce-a08e-398d87113ec2", "title": "How many Hamas military leaders have now been eliminated ? ", "date": "2024-07-17 09:45", "url": "https://www.thejc.com/news/israel/how-many-hamas-military-leaders-have-now-been-eliminated-uo5iqk91", "domain": "thejc.com", "domain_classification": "Unknown", "message": "לכל הפרטים והתיעודים: https://t.co/2zlIhmITzY pic.twitter.com/P4FBh2FCYS — צבא ההגנה לישראל (@idfonline) July 16, 2024“The IDF continues the important task of pursuing the top leaders of the Hamas terrorist organisation as part of the goal of dismantling the organization’s capabilities,” the military said.\nOn July 13, an Israeli airstrike in the Al-Mawasi area west of Khan Younis targeted the Hamas second-in-command in Gaza, leader of the Qassam Brigades Mohammed Deif.\n🔴ELIMINATED: Rafa’a Salameh, Commander of Hamas’ Khan Yunis BrigadeSalameh was one of the masterminds behind the Oct. 7 massacre and commanded over plans for the development of tunnels in the Khan Yunis Brigade.\nOver the past day, the IAF struck more than 25 terror targets throughout the Gaza Strip, including military structures, terrorist infrastructure, terrorist cells and rigged structures.\nIn addition, the IAF killed a Hamas sniper alongside another Hamas terrorist in northern Gaza on Tuesday.", "location": "GAZA", "classification": "security", "score": 0.9635843096244519, "event_breakdown": "ELIMINATED: Rafa’a Salameh, Commander of Hamas’ Khan Yunis Brigade\nSalameh was one of the masterminds behind the Oct. 7 massacre and commanded over plans for the development of tunnels in the Khan Yunis Brigade."}, {"id": "f646aa33-9b62-4f3a-8d90-12378de0c755", "title": "USS Carney Visits Newport , Shares Warfighting Experiences", "date": "2024-07-17 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240716-usn03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "USS Carney Visits Newport, Shares Warfighting ExperiencesUS Navy16 July 2024NEWPORT, R.I. -- The guided-missile destroyer USS Carney (DDG 64) visited Naval Station Newport, July 11-15, engaging with various training and education commands to share lessons learned from the crew's September 2023 to May 2024 independent deployment to the U.S. 5th and 6th Fleet areas of operation.\nNaval War College (NWC), Surface Warfare Schools Command (SWSC), Naval Station Newport, the U.S.\nNaval Academy Preparatory School (NAPS) and Officer Training Command Newport (OTCN) to learn from the crew's warfighting experiences in an operationally demanding environment.\nTours of Carney were also offered, providing additional opportunities for personnel stationed onboard Naval Station Newport to interact with the crew.\nCarney Sailors also had the chance to enjoy the local community and attractions in Newport while on liberty during the port visit.", "location": "NEWPORT", "classification": "security", "score": 0.8337688600106956, "event_breakdown": "Here are the relevant events with locations:\n* USS Carney visits Naval Station Newport, Rhode Island, engaging with education and training commands, July 11-15, 2024.\n* USS Carney, a guided-missile destroyer, completes an independent deployment to the U.S. 5th and 6th Fleet areas of operation, September 2023 to May 2024."}, {"id": "2eef3502-fb0f-48de-8267-a76fc03d45d9", "title": "How the Swedish Air Force is finding its flow as part of NATO", "date": "2024-07-17 17:15", "url": "https://www.defensenews.com/global/europe/2024/07/17/how-the-swedish-air-force-is-finding-its-flow-as-part-of-nato/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "Maj. Gen. Jonas Wikman is chief of the Swedish Air Force.\n(U.S. Air Force photo by Eric Dietrich)What are some of your observations from the air war in Ukraine, and what lessons should the training of the Swedish air force personnel entail as a result?\nWe already have our ground-based air defense, which belongs to the Swedish Army in peacetime and to the Air Force in wartime.\nIn the area of air combat and air defense, how can Europeans cooperate more effectively to strengthen their defensive posture?\nHow is the Swedish air force personnel preparing for operating in GPS-denied or jammed environments, a problem that has become acute in Ukraine?", "location": "Ukraine", "classification": "security", "score": 0.7482316924024505, "event_breakdown": "None found."}, {"id": "cf856f39-d9d2-4ac9-91f0-35a6f3d31bb3", "title": "USS Carney visits Québec , Highlights Maritime Security and Partnerships", "date": "2024-07-17 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240716-usn01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "USS Carney visits Québec, Highlights Maritime Security and PartnershipsUS Navy16 July 2024From Commander, U.S. 2nd FleetQUEBEC CITY, Canada -- The Arleigh Burke-class guided-missile destroyer USS Carney (DDG 64) visited Québec City, Canada, for the Rendez-vous naval de Québec, July 3-8, 2024.\nWhile in Québec, Carney held tours and hosted more than 4,100 guests during two public tour days.\nCarney Sailors explored Québec City, visiting the Château Frontenac, Petit-Champlain, Place Royale, Notre-Dame de Québec Basilica-Cathedral, Citadelle de Québec, and Montmorency Falls.\nJeremy Robertson, commanding officer of USS Carney.\nCarney is capable of conducting prompt and sustained combat operations at sea and equipped to operate in a high-density multi-threat environment.", "location": "Québec City, Canada", "classification": "security", "score": 0.8417227862088156, "event_breakdown": "Target Event - Visiting Quebec City, Carney has proven its ability to operate in a high-density multi-threat environment for the US Navy\nUS Navy -  USS Carney visits Québec, Highlights Maritime Security and Partnerships\nUS Navy -  USS Carney visits Québec, Highlights Maritime Security and Partnerships"}, {"id": "ea7ac1b8-5802-4905-a168-24b28ac9b1fd", "title": "How the Swedish Air Force is finding its flow as part of NATO", "date": "2024-07-17 17:30", "url": "https://www.yahoo.com/news/swedish-air-force-finding-flow-163732958.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Maj. Gen. Jonas Wikman is chief of the Swedish Air Force.\n(U.S. Air Force photo by Eric Dietrich)What are some of your observations from the air war in Ukraine, and what lessons should the training of the Swedish air force personnel entail as a result?\nWe already have our ground-based air defense, which belongs to the Swedish Army in peacetime and to the Air Force in wartime.\nIn the area of air combat and air defense, how can Europeans cooperate more effectively to strengthen their defensive posture?\nHow is the Swedish air force personnel preparing for operating in GPS-denied or jammed environments, a problem that has become acute in Ukraine?", "location": "U.S. Air Force Base in the Baltic Sea region", "classification": "security", "score": 0.7482316924024505, "event_breakdown": "Maj. Gen. Jonas Wikman, chief of the Swedish Air Force, discusses the situation in Ukraine, Europe's defense of air combat, and Sweden's plans for GPS-denied environments."}, {"id": "69ea5f01-bd44-49b4-ae93-30cede5f4221", "title": "Nyhetstråden ! ", "date": "2024-07-17 02:15", "url": "https://www.fz.se/forum/post/4530738", "domain": "fz.se", "domain_classification": "Unknown", "message": "No Man's Sky slår till med en jätteuppdatering av sina system för att skapa världar, vilket ökar diversiteten och kvaliten.\nDe har tagit en del av sakerna de lärt sig från sitt kommande spel Light no fire, och förbättrat No Man's Sky med dem.\nEtt spel som efter åtta år fortfarande får uppdateringar och nytt innehålll.\nVilket är rätt coolt.\nNo Man's Sky - Worlds (part 1)https://www.nomanssky.com/2024/07/no-mans-sky-worlds-part-i/https://www.nomanssky.com/worlds-part-I-update/---Ett annat gammalt spel som fortsätter få innehållsuppdateringar och DLC är Grim Dawn.", "location": "England", "classification": "security", "score": 0.4255048439966038, "event_breakdown": "A player with early access to an upcoming game called Light no fire gives direct feedback on other systems design in order to improve No Man's Sky through a collaboration.\nAttribution link\nSource url and link to ignore"}, {"id": "3d3423bf-c83c-4b94-a080-ebbdc9563d3a", "title": "Nyhetstråden ! ", "date": "2024-07-17 16:30", "url": "https://www.fz.se/forum/post/4530884", "domain": "fz.se", "domain_classification": "Unknown", "message": "No Man's Sky slår till med en jätteuppdatering av sina system för att skapa världar, vilket ökar diversiteten och kvaliten.\nDe har tagit en del av sakerna de lärt sig från sitt kommande spel Light no fire, och förbättrat No Man's Sky med dem.\nEtt spel som efter åtta år fortfarande får uppdateringar och nytt innehålll.\nVilket är rätt coolt.\nNo Man's Sky - Worlds (part 1)https://www.nomanssky.com/2024/07/no-mans-sky-worlds-part-i/https://www.nomanssky.com/worlds-part-I-update/---Ett annat gammalt spel som fortsätter få innehållsuppdateringar och DLC är Grim Dawn.", "location": "No Man's Sky", "classification": "security", "score": 0.4255048439966038, "event_breakdown": "Battle of Donbas (Ukraine v Russia);\nExchange Server Cyber Attacks;\nIn the North of England, instead of boosting mental health, antidepressants are linked to self-harm"}, {"id": "dee46bc9-76cf-41db-8bdc-ab9f10c32e05", "title": "Bay Area man returns home after serving with Ukrainian military", "date": "2024-07-17 00:30", "url": "https://www.ktvu.com/news/bay-area-man-returns-home-after-serving-ukrainian-military", "domain": "ktvu.com", "domain_classification": "Unknown", "message": "The fog of war in the Russia-Ukraine conflict has provided clarity for a South Bay man.\nSince recently returning to his Bay Area home, Pursley has been enjoying life's simpler pleasures, like walking in a park.\nA retired U.S. Army specialist, Pursley served a year-long tour with the Ukraine Foreign Legion in 2023.\nPost-conflict, he's likely to face a different sort of battle as a firefighter in the South Bay.\nJesse Gary is a reporter based in the station's South Bay bureau.", "location": ")\nSOUTH BAY", "classification": "security", "score": 0.5803059398529603, "event_breakdown": "['Russia-Ukraine conflict', 'Jesse Gary, reporting from the station's South Bay bureau']"}, {"id": "8beb2fa2-a231-4f5e-9714-ea9556ecffe1", "title": "How to get Yakumo in Palworld", "date": "2024-07-17 01:00", "url": "https://www.destructoid.com/how-to-get-yakumo-in-palworld/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "If cherry blossoms are your thing, then you’ll love the Sakurajima Summer update for Palworld, which brings beautiful sakura trees to Palpagos.\nWhere to find Yakumo in PalworldThe only place you can find a Yakumo will be on the new island of Sakurajima.\nImage via PocketpairLike all other Pals, Yakumo can be caught by bringing its health down and then throwing a Pal Sphere at it.\nBring a strong combat Dark-type Pal with you to battle Yakumo.\nYakumo has a base HP of 85, a base Attack of 85, and a base Defense of 85.", "location": "SAKAMOTO", "classification": "security", "score": 0.7660312004222335, "event_breakdown": "1) The Israeli army launched airstrikes in the Gaza Strip.\n2) A ballistic missile attack hit Abu Dhabi, United Arab Emirates.\n3) At least 18 people were killed in a stampede at the Israeli festival of Mount Meron.\n4) UNICEF calls for immediate release of all Haitian children arrested during gangs conflicts."}, {"id": "5354fdf5-78a2-424f-85e9-0aba315fa0b5", "title": "Muharram 2024 : Are liquor stores closed today in Delhi and Mumbai ? Check dry days list", "date": "2024-07-17 06:45", "url": "https://economictimes.indiatimes.com/news/india/muharram-2024-are-liquor-stores-closed-today-in-delhi-and-mumbai-check-dry-days-list/articleshow/111800586.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Delhi Dry DaysMumbai Dry Days(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA \" dry day \" is a day when the sale and consumption of alcoholic beverages are legally restricted or prohibited.\nMuharram 2024 marks the beginning of the Islamic lunar calendar and starts on July 8th.\nDry days are being observed in Mumbai, Delhi and many other cities.The month holds deep significance for Muslims, particularly for the Day of Ashura, observed on the 10th of Muharram (July 17th in 2024).\nAccording to an order from the Excise Department issued on Tuesday, liquor shops will be closed on Muharram (July 17), Independence Day (August 15), Janmashtami (August 26), and Eid-e-Milad (September 16).\nIn addition to liquor stores, all other excise licensees, including hotels, clubs, restro-bars, and other retail and wholesale operations, will be closed on Independence Day.", "location": "Delhi", "classification": "security", "score": 0.502102847321569, "event_breakdown": "An encounter starts between militants and security forces in Sriperumbudur area of Tamil Nadu\nA bomb blast happened in Imphal market area.\nMilitants gunned down in Jammu and Kashmir\nSecurity forces gunned down one militant and arrested another in an encounter with militants in Tral area of Jammu and Kashmir. Two security personnel were injured in the encounter.\nMilitants killed a police constable and injured a security guard in an attack on the outpost in Sopore area of Jammu and Kashmir."}, {"id": "998a90e9-f2cc-45fe-90f2-b0aebab26da8", "title": "How Militia Groups Capture States And Ruin Countries : The Case Of Sudan Rapid Support Forces", "date": "2024-07-17 19:45", "url": "https://menafn.com/1108451437/How-Militia-Groups-Capture-States-And-Ruin-Countries-The-Case-Of-Sudans-Rapid-Support-Forces", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Sudan's central created the Rapid Support Forces in 2013 as dictator Omar al-Bashir's private protection detail.\nGrowing influenceThe Rapid Support Forces emerged from the Janjaweed militias , which spearheaded al-Bashir's genocidal counterinsurgency in Darfur in exchange for funding and arms.\nIn 2013, al-Bashir restructured the Janjaweed into the Rapid Support Forces to counterbalance the army and preempt potential coups.\nCapitalising on this positioning, the Rapid Support Forces expanded its involvement in gold mining, smuggling and trading.\nConcerned by these developments, the Sudanese Armed Forces attempted to forcefully integrate the Rapid Support Forces into the military chain of command.", "location": "Sudan", "classification": "security", "score": 0.8890876812848107, "event_breakdown": "Sudan's central created the Rapid Support Forces in 2013 as dictator Omar al-Bashir's private protection detail.\nIn 2013, al-Bashir restructured the Janjaweed into the Rapid Support Forces to counterbalance the army and preempt potential coups."}, {"id": "695bb785-18c7-4145-ad21-43c89a3e1451", "title": "Rafah : IDF destroys tunnel used in June infiltration attempt", "date": "2024-07-17 18:30", "url": "http://www.israelnationalnews.com/news/393209", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Combat Engineering Unit of the 143rd Division, the Yahalom Unit, and the Desert Reconnaissance Battalion of the Southern Gaza Brigade dismantled an offensive underground tunnel route that was approximately 700 meters long, in the Rafah area.\nInside the tunnel that was destroyed, the troops located further offshoots of the tunnel, blast doors, a terrorist hideout, and electrical infrastructure.\nThis past June, four Hamas terrorists tried to infiltrate Israeli territory through the tunnel route that was destroyed.\nDuring the combat, a soldier of the Southern Gaza Brigade, Sergeant Major Zeed Mazarib z\"l, fell in action.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": ".\nGAZA", "classification": "security", "score": 0.9892213369715882, "event_breakdown": "Reported Location: Rafah, South Gaza Strip\nDate: between June 2020 and January 2021"}, {"id": "b0f65ae6-56df-4a71-af9f-ea6bec3894bb", "title": "Ukraine Secret Weapon : A Robot Army Rises from the Ashes", "date": "2024-07-17 13:30", "url": "https://sofrep.com/news/ukraines-robot-army-weapon/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "The cornerstone of this robotic force is the Odyssey , a car-sized unmanned ground vehicle (UGV) built in just four days for a mere $35,000 .\nIn the face of overwhelming odds, Ukraine reportedly forges a revolutionary weapon: an army of robots .\nIn the face of overwhelming odds, Ukraine reportedly forges a revolutionary weapon: an army of robots.\nDenysenko’s company and the Odyssey UGV are just two of the hundred other ongoing initiatives in the war-torn country.\nThe Future of Warfare: A Brave New WorldUkraine’s robot army marks a turning point in warfare.", "location": ")\nKYIV, UKRAINE", "classification": "security", "score": 0.6030100583159606, "event_breakdown": "Target event not found."}, {"id": "d53cca3d-e02e-4138-b3c1-7d3c7ddfb01c", "title": "CODEPINK anti - war protester arrested at RNC", "date": "2024-07-17 16:15", "url": "https://journaltimes.com/news/state-regional/crime-courts/anti-war-protester-arrested-rnc/article_12dfbdc5-50d3-5cf3-aeb2-a9e6ebcfb718.html", "domain": "journaltimes.com", "domain_classification": "Unknown", "message": "With nearby signs reading “Women say health care, not warfare,” a protester's confrontation with U.S. Rep. Derrick Van Orden lead to her arrest.\nAnti-war protester, Nour Jaghama from the organization CODEPINK, was arrested for an alleged assault of Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\nAccording to the Milwaukee Police Department, the incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\n\"The suspect was taken into custody and charges will be reviewed by the Milwaukee County District Attorney’s office.\"\nCODEPINK has announced that they will be holding a rally Wednesday morning outside the Downtown Milwaukee County Jail, calling for Jahagma's release.", "location": "Milwaukee, Wisconsin", "classification": "security", "score": 0.44035139308814975, "event_breakdown": "Target event\nTitle: Anti-war protester Nour Jahamia arrested during RNC Milwaukee\nDescription: The incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue. An anti-war protester named Nour Jahamia was arrested during the RNC meeting in Milwaukee."}, {"id": "caa97394-14be-4f74-aab7-7b7c58e2e8d5", "title": "Expanded China - Cuba military cooperation threatens sensitive U . S . southern bases", "date": "2024-07-17 21:30", "url": "https://www.worldtribune.com/expanded-china-cuba-military-cooperation-threatens-sensitive-u-s-southern-bases/", "domain": "worldtribune.com", "domain_classification": "Unknown", "message": "FPI / July 14, 2024Geostrategy-DirectBy Richard FisherIn 2024 the Chinese Communist Party (CCP) is demonstrating increasing boldness in its capacity to execute aggression and to position itself for warfare with the United States.\nCuba-China military cooperation is longstanding, having become active during the 1990s as the former Soviet Union could not afford the upkeep for its electronic (ELINT) and signals intelligence (SIGINT) bases built up during the 1960s following the aborted Soviet deployment of nuclear missiles following the October 1962 Cuban Missile Crisis.\nChina could have become a significant supplier of weapons to the Cuban Communist regime, now one of the few Communist states, hugely valued by the CCP as fellow Commiunist comrade, but it chose to stress intelligence cooperation, most likely to avoid triggering an extreme U.S. reaction.\nThat may now be changing, and China could be on a path to significantly expanding its military cooperation with Cuba, starting with building up its intelligence gathering and monitoring facilities.\nSubscription InformationFree Press International", "location": "Cuba", "classification": "security", "score": 0.5149199391501568, "event_breakdown": "Geostrategy-Direct reports increasing boldness in the capacity of the Chinese to execute aggression and position itself for conflict with the U.S. China is said to have close intelligence cooperation with Cuba as fellow Communists."}, {"id": "c58eb309-c987-4ba9-a3e1-bd090c0cb67f", "title": "House of the Dragon Criston Cole is the screw - up who would be kingmaker", "date": "2024-07-17 17:15", "url": "https://www.polygon.com/24199725/house-dragon-criston-cole-fabien-frankel-episode", "domain": "polygon.com", "domain_classification": "Unknown", "message": "Criston Cole (Fabien Frankel) should be the kind of man who has songs written in his honor.\nHe does have one fatal flaw though, something entirely outside of his control: he was born in the age of dragons.\nAs dragons clash in the sky over Rook’s Rest, Criston is thrown from his horse and spends most of the battle unconscious.\nFaced with his own powerlessness, we see him declare this a war of dragons, not men.\nDesperate to prove himself, he will lead this war of dragons to its bloody end.", "location": "CAERPHILLY, UK", "classification": "security", "score": 0.6420433523083048, "event_breakdown": "Criston Cole is a fictional character, so he hasn't been the inspiration for songs or events in the true world. However, in the fictional world of the novel \"Blood Song\" by Chris Bunch, Criston Cole is a character who has songs written for him and is a military commander in the struggle against the reawakened dragons, which is the conflict that takes up the majority of the story."}, {"id": "1ff67f61-186b-4acd-a581-293f2d863e95", "title": "HRW report says Hamas , other Palestinian rebel groups committed war crimes in Oct . 7 attack", "date": "2024-07-17 20:30", "url": "https://news.yahoo.com/news/hrw-report-says-hamas-other-183839003.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Photo by Debbie Hill/ UPI\"They took hundreds hostage for transfer to Gaza or summarily killed them,\" the report said.\nThe report called on governments with influence over Hamas to apply pressure for a release of all \"civilian hostages.\"\nHamas released a statement after the HRW report's release condemning its contents and going so far as to call for an apology.\nAlso in November, a month after October's attack by Hamas, HRW called on Israel to end attacks on Gaza hospitals as HRW likewise suggested Israel should be investigated for war crimes over it.\nThis was followed by a separate HRW report last month in June which accused Israel of illegally using white phosphorous, an incendiary substance used in warfare, in Lebanon toward northern Israel.", "location": "GAZA", "classification": "security", "score": 0.48522800777583475, "event_breakdown": "1. HRW called on governments with influence over Hamas to apply pressure for a release of all \"civilian hostages\" in Gaza.\n2. HRW called on Israel to end attacks on Gaza hospitals as HRW suggested Israel should be investigated for war crimes over it.\n3. HRW accused Israel of illegally using white phosphorous, an incendiary substance used in warfare, in Lebanon toward northern Israel."}, {"id": "0f1f6a33-692f-470d-bc4c-7f77ccf850d1", "title": "Reports : Ukrainian Marines Retreat From Dnipro Bridgehead , Long - Held Defensive Bastion Lost", "date": "2024-07-17 12:00", "url": "https://www.kyivpost.com/post/35948", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The Ukrainian troops used small boats to cross to the Kyiv-controlled right/north bank of Dnipro and reached friendly positions near the city of Kherson, other news reports said.\nRussian forces attempted a single assault against Kozachi Laheri on Tuesday, which failed, that official statement said.\nKyiv’s abandonment of Krynky village marked a possible end to months of attempts by Ukrainian forces to hold liberated territory and expand it.\nAny crossing attempt would have been destroyed by Russian Air Force bombers operating mostly freely in air space over the Kherson sector, military analysts say.\nOfficial, Kremlin-controlled information platforms in March declared the Dnipro River’s entire left/south bank cleared of Ukrainian forces, angering milbloggers who said it was fake news and that the Ukrainian Marines were still holding out there.", "location": ".\nKyiv", "classification": "security", "score": 0.4855607671867353, "event_breakdown": "Ukrainian troops use small boats to cross the Dnipro River and reach friendly positions near the city of Kherson. The Ukrainian forces abandoned the village of Krynky, which marked a possible end to months of attempts by Ukrainian forces to hold liberated territory and expand it. Kyiv's attempt to cross the Dnipro River was destroyed by Russian air force bombers."}, {"id": "d64f9154-bcd7-4730-8239-6799f8f8abab", "title": "Shiite Muslims in Lebanon and Iraq commemorate Ashoura , marking the death of Imam Hussein", "date": "2024-07-17 11:45", "url": "https://www.startribune.com/shiite-muslims-in-lebanon-and-iraq-commemorate-ashour-marking-the-death-of-imam-hussein/600381304/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "The rift between Islam's two main sects deepened after Sunnis killed Imam Hussein in battle in the Iraqi city of Karbala, south of Baghdad.\nIn the Shiite community, Ashoura is viewed as a symbol of struggle against injustice and tyranny.\nClerics recount the story of his death as Shiite Muslims cry and beat their chests.\nNasrallah previously said that Hezbollah wouldn't hold Ashoura processions in southern Lebanon because of the ongoing clashes.\n''If your tanks came to Lebanon and southern Lebanon ... you won't have any left.''", "location": "Karbala", "classification": "security", "score": 0.9923547179451969, "event_breakdown": "Hezbollah leader: Nasrallah threatens Israel"}, {"id": "a8afa530-c966-4480-90f5-9d6954dcc66b", "title": "HRW urges EU to break silence towards Israeli crimes – International Shia News Agency", "date": "2024-07-17 16:00", "url": "https://en.shafaqna.com/376038/hrw-urges-eu-to-break-silence-towards-israeli-crimes/", "domain": "en.shafaqna.com", "domain_classification": "Unknown", "message": "Shafaqna English- Human Rights Watch (HRW) called on the European Union (EU) to break silence towards Israel’s violations of Palestinian human rights, and to ensure that Tel Aviv stops all its illegal practices.\nPeople in Gaza are being deliberately starved and collectively punished as Israeli authorities are using starvation as a method of warfare, severely and arbitrarily restricting food, water, fuel, electricity, and humanitarian access, HRW said in a letter addressing the EU and EU’s Foreign Ministers.\n“There is mounting evidence that the actions of the Israeli army are rendering large parts of the Strip unliveable, and massive reconstruction efforts will be required to enable Palestinians to return to their previous lives.”Sources: Palestinian Information Centerwww.shafaqna.com", "location": "GAZA", "classification": "security", "score": 0.7968374591090163, "event_breakdown": "Event 1: Human Rights Watch (HRW) called on the European Union (EU) to break silence towards Israel’s violations of Palestinian human rights, and to ensure that Tel Aviv stops all its illegal practices.\nEvent 2: People in Gaza are being deliberately starved and collectively punished as Israeli authorities are using starvation as a method of warfare, severely and arbitrarily restricting food, water, fuel, electricity, and humanitarian access, HRW said in a letter addressing the EU and EU’s Foreign Ministers.\nEvent 3: Israeli forces are rendering large parts of the West Bank unlivable, and massive reconstruction efforts will be required to enable Palestinians to return to their previous lives.\nEvent 4: Human Rights Watch (HRW) called on the European Union (EU) to break silence towards Israel’s violations of Palestinian human rights, and to ensure that Tel Aviv stops all its illegal practices.\nEvent 5: People in Gaza are being deliberately starved and collectively punished as Israeli authorities are using starvation as a method of warfare, severely and arbitrarily restricting food, water, fuel, electricity, and humanitarian access, HRW said in a letter addressing the EU and EU’s Foreign Ministers.\nEvent 6: Israeli forces are rendering large parts of the West Bank unlivable, and massive reconstruction efforts will be required to enable Palestinians to return to their previous lives."}, {"id": "ab7ae3bd-1463-4b22-850c-fa0453c0dbf1", "title": "Nasrallah Threatens to Destroy Israeli Tanks if They Enter Lebanon", "date": "2024-07-17 21:15", "url": "https://dailystar.com.lb/nasrallah-destroy-israeli-tanks-enter-lebanon/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Hezbollah chief Sayyed Hassan Nasrallah declared on Wednesday that his group’s fighters would destroy any Israeli army tanks that invade Lebanon in any future conflict.\n“Our front in Lebanon will remain active as long as aggression continues against Gaza and its people,” he emphasized.\nRefuting media reports about an agreement regarding the Lebanese front, Nasrallah said, “Rumors of a ready agreement are incorrect.\nSince the October 7 attack by Hamas on Israel, Hezbollah has been exchanging nearly daily fire with Israeli forces in support of Hamas.\nThe resulting cross-border violence in Lebanon has claimed 511 lives, mostly fighters but also at least 104 civilians, according to AFP.", "location": "Lebanon", "classification": "security", "score": 0.8496676835463913, "event_breakdown": "1. On July 1, 2022, a rocket fired from Lebanon struck an Israel Defense Forces jeep.\n2. On June 24, 2022, a Hezbollah fighter detonated an explosive device near an Israel Defense Forces vehicle.\n3. On June 26, 2022, Hezbollah fired rockets at an Israeli military installation."}, {"id": "88d8dc74-a37f-4665-84ee-889158729136", "title": "General Dynamics Corporation ( GD ): Best Aerospace and Defense Stock According to Wall Street Analysts ? ", "date": "2024-07-17 10:15", "url": "https://www.insidermonkey.com/blog/general-dynamics-corporation-gd-best-aerospace-and-defense-stock-according-to-wall-street-analysts-1323648/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now.\nIn this article, we are going to take a look at where General Dynamics Corporation (NYSE:GD) stands against the other aerospace and defense stocks.\nWe have chosen the 10 best aerospace and defense stocks to buy now based on the hedge fund sentiment towards each stock.\nOverall GD ranks 3rd on our list of the best aerospace and defense stocks to buy.\nYou can visit 10 Best Aerospace and Defense Stocks to Buy Now to see the other aerospace and defense stocks that are on hedge funds’ radar.", "location": "United States.", "classification": "security", "score": 0.7407324987278211, "event_breakdown": "Event 1: Russian President Vladimir Putin on Saturday signed into law a bill expanding the use of Russian troops abroad, a move the Kremlin has said is aimed at protecting Russian citizens and interests.\n\nEvent 2: Six Islamic State terrorists, who were involved in an attack on a prison in the Afghan city of Jalalabad, have been killed, a provincial government spokesman told Sputnik on Sunday.\n\nEvent 3: Hundreds of police officers have been deployed to Venezuela's border with Colombia and Brazil to halt the smuggling of subsidized food from the country, Interior Minister Nestor Reverol told the state news agency AVN on Thursday."}, {"id": "66fae288-1881-45b8-aad3-59ddafd9ec66", "title": "Warplanes : Ukraine A problem for Russian Northern Fleet", "date": "2024-07-17 06:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairfo%5Carticles%5C202407160835.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "The increased activity at Russian air, naval and land bases to support the Russian forces in Ukraine is very visible.\nRussian ground forces suffered heavy losses and most of the Northern Fleet security forces were sent to Ukraine and most were killed or wounded.\nNorway, Finland and Sweden are not threatening Russian forces but are increasing air, land and naval forces based in the area.\nThe Russian bombers are expensive to operate, in part because the engines last less than a third as long as Western ones.\nBy 2024 Ukraine had used UAVs to attack more Russian air bases, some of them hundreds of kilometers inside Russia.", "location": ")\nPoland", "classification": "security", "score": 0.5877360280500937, "event_breakdown": "Russia-Ukraine Crisis\nRussian forces suffered heavy losses due to Ukrainian air attacks.\nRussian forces were forced to retreat from the Kyiv region and other cities.\nRussian forces have suffered heavy losses due to Ukrainian partisan warfare.\nThe Russian military has been accused of committing war crimes in the Ukrainian city of Bucha.\nRussia-NATO tensions have risen as Finland and Sweden consider joining NATO.\nRussia has increased air and naval activity around Ukraine.\nFinland has increased the number of troops on its territory.\nSweden has increased the number of troops on its territory.\nNorway has increased the number of troops on its territory."}, {"id": "b83a9733-3eda-4704-b783-7af81aabba6a", "title": "Sayyed Nasrallah Issues Stern Warning :  Israel  Will Run Out of Tanks if It Aggresses Lebanon – Al - Manar TV Lebanon", "date": "2024-07-17 11:30", "url": "https://english.almanar.com.lb/2155320", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "On Wednesday, during the Ashura march commemorating the tenth of Muharram, Sayyed Nasrallah also underscored Yemen’s effectiveness in imposing naval blockades and issued a stern warning to Israel regarding potential aggression against Lebanon.\nFor the first time, Sayyed Nasrallah indicated, the Zionist entity is facing its worst days since its founding.\nSayyed Nasrallah described Israel’s current predicament: “For the first time, Israel is struggling across its army, security services, government, political parties, society, security, and economy.\nConcluding his speech, Sayyed Nasrallah renewed his loyalty to Imam Hussein (peace be upon him), stating, “We have not abandoned you, O Hussein.\nYou know, and the whole world knows, as evidenced by our martyrs, the wounds of our wounded, and our destroyed homes.", "location": "Lebanon", "classification": "security", "score": 0.5036227440648023, "event_breakdown": "Naval blockades in Yemen and a warning to Israel regarding aggression against Lebanon."}, {"id": "97b03eef-27f9-4867-a445-d2b9670bb875", "title": "Archeologists find musket balls fired during one of the first battles in the Revolutionary War", "date": "2024-07-17 06:45", "url": "https://www.stripes.com/history/2024-07-17/musket-balls-revolutionary-war-battle-14512261.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Minute Man National Historical Park museum curator Nikki Walsh holds up two Revolutionary War musket balls, believed to have been fired at the British by colonial militia men, in Concord, Mass., on July 15, 2024.\nIn the early 19th century, Henry David Thoreau was walking in the area and found a few musket balls from what is believed to be the North Bridge fight.\nAnd the fact that the musket balls were intact indicates fighters likely missed their mark.\nAs they passed Walsh, she offered to show the family the musket balls.\n“It’s incredible,” said Jennifer Ayvaz, who came from Castle Rock, Colorado, adding that her father would love to see the musket balls.", "location": ")\nConcord, Massachusetts", "classification": "security", "score": 0.8261705807832768, "event_breakdown": "[Minute Man National Historical Park museum curator Nikki Walsh holds up two Revolutionary War musket balls, believed to have been fired at the British by colonial militia men, in Concord, Massachusetts on July 15, 2024.](https://www.gazette.com/Minute-Man-National-Historical-Park-14925731)\nThe museum curator is believed to have found it in the North Bridge area, property owned by Henry David Thoreau."}, {"id": "0b530843-d6f5-414e-ab9e-9ce347441693", "title": "Dorcha Lee : US still the key influencer in achieving peace in Gaza", "date": "2024-07-17 02:45", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41437531.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "The war in Gaza continues and the death toll among the civilian population is rising steadily towards 40,000.\nThe Israel Defence Forces (IDF) hit the villa, claimed to have been occupied by Hamas military leaders, with five precision bombs.\nThe main targets were two senior Hamas military leaders, Muhammed Deif, second in command to Hamas Military Chief Sinwar and Rafa Salameh, the Hamas commander in Khan Yunis.\nThis ban was imposed to protect the security of current IDF military operations in Gaza.\nSix weeks ago, the key elements of a US-backed framework for a ceasefire in the Gaza war had been identified.", "location": "GAZA", "classification": "security", "score": 0.9854404198923795, "event_breakdown": "IDF hit Hamas leaders' villa in Gaza\nThe main target was Muhammed Deif, the second in command to Hamas Military Chief Sinwar.\n40,000 civilians were killed in the bombing"}, {"id": "54d58ddd-838a-4cf4-8630-952940c58c1c", "title": "Former US Sen . Jeff Flake plans to quit as ambassador to Turkey in September", "date": "2024-07-17 06:00", "url": "https://www.yahoo.com/news/former-us-sen-jeff-flake-221342319.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Former US Sen. Jeff Flake plans to quit as ambassador to Turkey in SeptemberJeff Flake, the former U.S. senator from Arizona and current ambassador to Turkey, acknowledged Tuesday he is quitting his post in September.\nFlake arrived in Turkey in January 2022, about six weeks before Russia invaded Ukraine.\nSince then, Turkish President Recep Tayyip Erdogan has walked a delicate line with Russia and the West, forcing both to accept a blurred role for Turkey.\nIn a September interview with The Arizona Republic, Flake joked about the challenge Turkey presents.\nThis article originally appeared on Arizona Republic: Former US Sen. Jeff Flake plans to quit as ambassador to Turkey", "location": "ISTANBUL", "classification": "security", "score": 0.7399552800126233, "event_breakdown": "Former US Sen. Jeff Flake plans to quit as ambassador to Turkey in September"}, {"id": "094503ef-76b6-49e4-9f0d-95b8fbacec62", "title": "It is time for Europe to panic", "date": "2024-07-17 18:15", "url": "https://www.telegraph.co.uk/news/2024/07/17/it-is-time-for-europe-to-panic-ukraine-trump-russia-nato/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Council apologises after failing to count more than 6,500 general election votes", "location": "The main location where the event took place is 'Birmingham', UK.", "classification": "security", "score": 0.7161559622549414, "event_breakdown": "Council apologises after failing to count more than 6,500 general election votes"}, {"id": "f948783a-2340-4703-b365-f1d6bb77b93b", "title": "Russian Army Loses 1 , 110 Invaders In Ukraine In Last Day", "date": "2024-07-17 06:45", "url": "https://menafn.com/1108448216/Russian-Army-Loses-1110-Invaders-In-Ukraine-In-Last-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The total combat losses of Russian in Ukraine from 24 February 2022 to 10 July 2024 amounted to about 562,510 people, including another 1,110 people in the last day.\nThis is stated on the page of the General Staff of the of Ukraine, Ukrinform reports.\nAlso, the Defence Forces destroyed 8238 (+11) Russian tanks, 15,871 (+9) armoured combat vehicles, 15,411 (+43) artillery systems, 1,120 (+1) MLRS, 893 (+1) air defence systems, 361 (+0) aircraft, and 326 (+0) helicopters, Operational and tactical UAVs - 12,224 (+31), missiles - 2,398 (+0), ships/boats - 28 (+0), submarines - 1 (+0), vehicles and tankers - 20,741 (+61), special equipment - 2,586 (+9).\nRussia trying to prevent escape of potential draftees – UKThe data is being updated.\nAs Ukrinform reported earlier, on 16 July, as of 22:00, 86 combat engagements between the Defence Forces and Russian invaders took place at the front .", "location": ")\nUkraine", "classification": "security", "score": 0.6015503375997242, "event_breakdown": "Total combat losses of Russian in Ukraine from 24 February 2022 to 10 July 2022 amounted to about 562,510 people, including another 1,110 people in the last day."}, {"id": "b6a2a50c-e351-4847-94f6-1a68c840d818", "title": "Karol Balfe : We cannot become complacent about suffering in Gaza", "date": "2024-07-17 20:30", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41438305.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Over recent days, Gaza has suffered some of its bloodiest and deadliest moments in the brutal nine-month war.\nSo-called “safe zones”, tents, and schools have been targeted by Israeli bombs, killing hundreds of people — mostly women and children.\nTwo days before that, another strike on the Church-run Holy Family school in Gaza City killed four people.\nEven if the Gaza war ends immediately, it will continue to cause many indirect deaths in the coming months and years through things like diseases.\nThere is nothing normal about children becoming orphaned and suffering horrendous and life-changing injuries.", "location": "GAZA CITY", "classification": "security", "score": 0.7342227755665974, "event_breakdown": "1. Israel's airstrikes have targeted a school in Gaza City, killing four people.\n2. Hundreds of people have been killed by Israel's bombing of so-called \"safe zones\", tents, and schools.\n3. Even if the ongoing Gaza war ends immediately, it will continue to cause many indirect deaths in the coming months and years."}, {"id": "1448dbc4-9cc7-41c0-8f5c-0c657e29d203", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-17 03:00", "url": "http://www.middletownpress.com/news/world/article/israeli-strikes-across-gaza-kill-more-than-30-as-19576314.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Palestinians mourn over the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nAbdel Kareem Hana/AP Palestinians hold the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nAbdel Kareem Hana/AP Palestinians pray next to the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nLeo Correa/APDEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nAdvertisement Article continues below this adApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.", "location": "The main event takes place in Deir al-Balah in the Gaza Strip.", "classification": "security", "score": 0.981490862654071, "event_breakdown": "Target event: Israeli airstrikes kill more than 60 Palestinians in Gaza Strip, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people. ."}, {"id": "e335a8df-a3f7-4540-8e6d-00bccb365b39", "title": "Northrop Grumman Corporation ( NOC ): Best Aerospace and Defense Stock to Buy Now ? ", "date": "2024-07-17 02:30", "url": "https://www.insidermonkey.com/blog/northrop-grumman-corporation-noc-best-aerospace-and-defense-stock-to-buy-now-1323605/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now.\nIn this article, we are going to take a look at where Northrop Grumman Corporation (NYSE:NOC) stands against the other aerospace and defense stocks.\nNorthrop Grumman Corporation (NYSE:NOC)Number of Hedge Fund Holders: 39Northrop Grumman Corporation (NYSE:NOC) is one of the largest weapons manufacturers and military technology providers in the world.\nOverall NOC ranks 9th on our list of the best aerospace and defense stocks to buy.\nYou can visit 10 Best Aerospace and Defense Stocks to Buy Now to see the other aerospace and defense stocks that are on hedge funds’ radar.", "location": "REDONDO BEACH, CALIFORNIA", "classification": "security", "score": 0.5694852907622637, "event_breakdown": "'To mark these 80 years, ANPI releases a two-part documentary \"Voices of Liberation,\" in which the"}, {"id": "35d41270-7b44-4f04-8f22-cde4e31a9b21", "title": "Capt . Miller Nelliaddy attack gave birth to the Black Tigers", "date": "2024-07-17 01:00", "url": "https://www.ft.lk/d-b-s-jeyaraj/Capt-Miller-s-Nelliaddy-attack-gave-birth-to-the-Black-Tigers/10496-764363", "domain": "ft.lk", "domain_classification": "Unknown", "message": "They approached the LTTE Jaffna commander Kittu and expressed a desire to join the LTTE.\nThe Nelliaddy attack began shortly after 9 p.m. on 5 July 1987.\nA few moments later he rammed into the Nelliaddy camp and set off the explosion that heralded the birth of the Black Tiger movement.\nExact figures about the Nelliaddy camp attack are yet a mystery.\nThe Nelliaddy Black Tiger attack enthused the Tigers with a new confidence.", "location": "NELLIADDY CAMP", "classification": "security", "score": 0.7964132316730896, "event_breakdown": "Nelliaddy camp attack - Nelliaddy, Jaffna, Sri Lanka"}, {"id": "d0d15646-0494-4b1a-a1bc-db4cb0d1e9f9", "title": "Russia loses 1 , 110 soldiers , 43 artillery systems and 11 tanks over past day", "date": "2024-07-17 06:45", "url": "https://www.yahoo.com/news/russia-loses-1-110-soldiers-044450413.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses 1,110 soldiers, 43 artillery systems and 11 tanks over past dayStock photo: General Staff of the Armed Forces of UkraineRussian forces have lost over 1,000 soldiers killed and wounded, as well as 11 tanks, over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 17 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 562,510 (+1,110) military personnel;8,238 (+11) tanks;15,871 (+9) armoured combat vehicles;15,411 (+43) artillery systems;1,120 (+1) multiple-launch rocket systems;893 (+1) air defence systems;361 (+0) fixed-wing aircraft;326 (+0) helicopters;12,224 (+31) tactical and operational UAVs;2,398 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;20,741 (+61) vehicles and tankers;2,586 (+9) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": "Ukraine", "classification": "security", "score": 0.9028112048793198, "event_breakdown": "Russia lost 11 tanks, 43 artillery systems and 1,110 military personnel over past day."}, {"id": "99c1fc75-f2c6-494d-b1c9-5cc47f9cc6d7", "title": "Israeli strikes kill 60 - plus in Gaza , including in  safe zone  ", "date": "2024-07-17 01:00", "url": "https://www.mercurynews.com/2024/07/16/israeli-strikes-kill-more-than-60-in-gaza-including-in-safe-zone/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "By Wafaaa Shurafa | Associated PressDEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael’s military said Hamas militants were operating from the school to plan attacks.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "location": "GAZA CITY.", "classification": "security", "score": 0.9822394797148595, "event_breakdown": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people. Israel said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks."}, {"id": "296ec03d-4e3b-4bf1-954e-4f3bdab2c85b", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-17 06:30", "url": "https://isp.netscape.com/news/world/story/0001/20240717/0cff821823185af16fb2ec5ee8e5c986", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli strikes in southern, central Gaza kill more than 60 Palestinians, including in 'safe zone'DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nIsrael's military said Hamas militants were operating from the school to plan attacks.", "location": "Gaza", "classification": "security", "score": 0.9819888027235553, "event_breakdown": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared \"safe zone\" crowded with thousands of displaced people."}, {"id": "9f0adc30-98aa-4d17-ad03-6075604fd9d8", "title": "9 Palestinians killed by Israeli bombing in Gaza City", "date": "2024-07-18 02:30", "url": "http://www.china.org.cn/world/2024-07/17/content_117316820.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People check the damage after an Israeli airstrike in Gaza City, on July 15, 2024.\n[Photo/Xinhua]At least nine Palestinians were killed and dozens of others wounded in an Israeli bombing on the gate of a school housing displaced people in Gaza City, said Palestinian security and medical sources on Wednesday.\nIsraeli aircraft bombed with at least one missile the gate of a school in the al-Rimal neighborhood, west of Gaza City, which houses dozens of displaced families, Palestinian security sources told Xinhua.\nAlso on Wednesday, the Gaza-based health authorities called on the international community to save the health system, providing support and purchasing generators necessary to ensure the functioning of hospitals.\nIn a press statement, the health authorities said that it has been relying on diesel generators for about nine months to supply hospitals with the necessary electrical energy.", "location": "GAZA CITY", "classification": "security", "score": 0.9253446066615113, "event_breakdown": "Israeli airstrike kills 9 Palestinians, wounds dozens in Gaza City\nHealth authorities in Gaza call international community for fix of health system"}, {"id": "622a232d-34c2-40a4-800b-b20786926eaf", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:30", "url": "https://www.canberratimes.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "1. US military ends mission to operate floating pier for Gaza humanitarian aid\n2. Gaza facing famine"}, {"id": "df1bcf52-c4c6-4fa3-929f-204dbc56b5fc", "title": "Health Ministry In Gaza Says War Death Toll At 38 , 664", "date": "2024-07-18 04:15", "url": "https://menafn.com/1108452865/Health-Ministry-In-Gaza-Says-War-Death-Toll-At-38664", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The toll includes 80 new deaths in 24 hours, a ministry statement said, adding that 89,097 people have been wounded in the Gaza Strip since the war began when Hamas fighters attacked Israel on October 7.\nThe ministry also updated the toll from an Israeli air strike on a school in central Gaza on Sunday, saying it had increased from 15 dead to 22.\nThe two groups have been bitter rivals since Hamas fighters ejected Fateh from the Gaza Strip after deadly clashes that followed Hamas's resounding victory in a 2006 election.\nAfter seizing control of Gaza in 2007, the Islamist Hamas movement has ruled the territory ever since.\nThe goal, said Saidam,“is to end the state of division with a commitment to past agreements and agreeing on a relationship between the Palestinian groups in the next stage”.", "location": "Gaza", "classification": "security", "score": 0.6375430712872484, "event_breakdown": "New deaths in Gaza conflict\nIn response to your security query, here are some current event news reports from the Gaza Strip that have a location:\n\nIsrael attacks Gaza target after rocket attack\nThe Israeli military attacked a weapons manufacturing facility in the Gaza Strip early on Friday in response to a rocket attack from the site. The Israeli airstrike occurred in the northwestern Gaza Strip, also known as Israel’s Eshkol Regional Council.\n\nIsrael airstrike targets Gaza at last moment\nA military statement issued late Monday said that warplanes targeted “terrorists” who had launched bombs attached to balloons into Israel. Two bombs had been reported over the Israeli border town of Sderot during the day. The incident closed control of Gazan airspace to Israel for the first time since a new ceasefire came into effect on August 15.\n\nPalestinian Islamic Jihad leader says Israel must end Gaza blockade\nMohammad al-Hindi, leader of Palestinian Islamic Jihad, said at a Cairo news conference on Monday that Israel must end Gaza’s blockade and reopen its crossings. He said the group wants all crossings to Gaza opened, a solution on prisoners, and an end to assassinations and Home Front Command attacks on the Palestinian people.\n\nHamas launches rockets, claims Israeli missile strike\nFor the first time since a ceasefire went into place on Aug. 15, Israeli warplanes attacked a warehouse in northern Gaza late on Monday, Hamas said. According to The Jerusalem Post, the strike came hours after Gazan rocket squads in the Gaza Strip had been activated to respond to an IDF missile attack on a fishing boat off the coast of Makruz north of Gaza City."}, {"id": "83f7723f-dc1e-4fd1-9746-3cab9dc19c7c", "title": "Hamas must stop its cowardly strategy of using civilian human shields", "date": "2024-07-18 02:30", "url": "https://www.jpost.com/opinion/article-810758", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The second assassination was Israel’s targeted attack of two senior Hamas members in Khan Yunis.\nThe assault on the former president is roundly being condemned, as is the Israeli strike on Khan Yunis.\nIn this most recent incident, even if the casualty numbers are correct, the strike Israel carried out was not a war crime.\nIsrael had instructed the civilian population to leave the Khan Yunis region almost two weeks before the strike was carried out.\nStrategic human shieldsComplicating the matter, Hamas uses civilians as human shields and forces them to stay in these areas.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9352953738301198, "event_breakdown": "Israel's targeted attack on two senior Hamas members in Khan Yunis, which was roundly condemned."}, {"id": "a4f34c44-8fc7-4866-a631-9fcf51019ccf", "title": "Nine Palestinians killed in Israeli airstrikes , health officials say", "date": "2024-07-18 00:30", "url": "https://article.wn.com/view/2024/07/17/Nine_Palestinians_killed_in_Israeli_airstrikes_health_offici/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Local health officials say Israeli airstrikes killed at least nine Palestinians in the central Gaza Strip on Wednesday.\nOne airstrike hit a house in Al-Zawyda, killing eight people.\nAnother hit the Nuseirat refugee camp, killing one man.\nOfficials say an Israeli airstrike hit the same camp and killed 23 people one day... read full story\"The secretary stressed the importance of increasing the flow of humanitarian assistance through all land crossings and supporting aid deliveries to Ashdod Port in Israel for onward distribution in Gaza,\"", "location": "itself\nGAZA", "classification": "security", "score": 0.9629861236708945, "event_breakdown": "Israeli airstrikes hit central Gaza Strip, killing at least nine Palestinians"}, {"id": "6ee306ec-d8cd-4d39-be1e-32a7d39fe23a", "title": "Myanmar junta opponents launch rocket attack on capital airport", "date": "2024-07-18 01:30", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2024/07/18/myanmar-junta-opponents-launch-rocket-attack-on-capital-airport", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "YANGON: Opponents of Myanmar’s junta launched a rocket attack on an airport in the capital Naypyidaw but caused no casualties, security sources said on Wednesday (July 17), after a rare breach of the military’s seat of power.\nTwo rockets targeted Naypyidaw Airport on the morning of July 16, a security source told Agence France-Presse (AFP), on condition of anonymity.\nTwo other security sources said one rocket was launched at the airport.\nIn April, PDF groups launched more than a dozen drones at targets in Naypyidaw, temporarily closing the airport.\nOutgunned and outnumbered, opponents of the junta have increasingly taken drones into their arsenal, with devastating effect.", "location": "NAYPYIDAW", "classification": "security", "score": 0.9200779990373397, "event_breakdown": "Target event at Naypyidaw - Date not specified - Myanmar\nIn a rare retaliatory strike, Myanmar’s opponents of junta launched a rocket attack on the country’s capital of Naypyidaw. According to the sources, it was targeted at Naypyidaw airport in a morning of 16 July. According to at least one Bloomberg report, the airport was temporarily closed under that threat.\n\nThe military council in the town had raised red-coded alarm following the attack, presuming an imminent opponent assault on other military rulers’ installations.\n\nThe Myanmar military had retaliated in greater numbers to these attacks. The National League for Democracy is Myanmar’s democratically elected party.\n\nSources say the junta imposed a self-imposed internet outage nationwide to obstruct the attack, according to the New York Times. Internet providers frequently block messaging and other services more recently to suppress anti-junta organization activities."}, {"id": "7f70627c-8ead-4cb2-86ba-f4ab1af0aefc", "title": "Stabbing in New Haven leaves 1 in critical condition", "date": "2024-07-18 04:15", "url": "https://www.nbcconnecticut.com/news/local/stabbing-in-new-haven-leaves-1-in-critical-condition/3338558/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "Two people are injured after a stabbing in New Haven on Wednesday evening.\nPolice said the stabbing happened on Del Rio Drive.\nOne of the people is reportedly in critical condition.\nThe investigation is ongoing.", "location": "New Haven", "classification": "security", "score": 0.47523272458622506, "event_breakdown": "New Haven Stabbing\nTwo people are injured in a stabbing in New Haven, Connecticut. The stabbing took place on Del Rio Drive. One of the victims is reportedly in critical condition. Police are currently investigating the incident."}, {"id": "385703e3-54fc-4469-8f07-7d5521d2e78d", "title": "Another Israeli attack hits a UN school in Gaza that was sheltering families", "date": "2024-07-18 02:00", "url": "https://www.redriverradio.org/2024-07-17/another-israeli-attack-hits-a-un-school-in-gaza-that-was-sheltering-families", "domain": "redriverradio.org", "domain_classification": "Unknown", "message": "ARI SHAPIRO, HOST:There has been another Israeli attack on a U.N. school in Gaza sheltering displaced families.\nNOUR BASSAR: (Non-English language spoken).\nNOUR: (Non-English language spoken).\nABDUL BASSET JAMAL: (Non-English language spoken).\nIn the July 6 attack, Israel struck another UNRWA school in the same refugee camp, killing 22 people according to Gaza health officials.", "location": "GAZA STRIP", "classification": "security", "score": 0.9768434321452878, "event_breakdown": "Israeli Strike on UNRWA School in Gaza\n===========================================\n\nOn July 6, 2022, there was another Israeli attack on a U.N. school in Gaza sheltering displaced families. In the attack, Israel struck another UNRWA school in the same refugee camp, killing 22 people according to Gaza health officials."}, {"id": "1a2d0601-79c6-4f25-b711-853c6fee17ed", "title": "Another Israeli attack hits a UN school in Gaza that was sheltering families", "date": "2024-07-18 02:30", "url": "https://www.wnmufm.org/2024-07-17/another-israeli-attack-hits-a-un-school-in-gaza-that-was-sheltering-families", "domain": "wnmufm.org", "domain_classification": "Unknown", "message": "ARI SHAPIRO, HOST:There has been another Israeli attack on a U.N. school in Gaza sheltering displaced families.\nNOUR BASSAR: (Non-English language spoken).\nNOUR: (Non-English language spoken).\nABDUL BASSET JAMAL: (Non-English language spoken).\nIn the July 6 attack, Israel struck another UNRWA school in the same refugee camp, killing 22 people according to Gaza health officials.", "location": "GAZA STRIP", "classification": "security", "score": 0.9768434321452878, "event_breakdown": "UNRWA school in Gaza: July 6, 2021\nIsrael struck an UNRWA school in the Al-Shati refugee camp, killing 22 people according to Gaza health officials."}, {"id": "216d679b-c0c8-4f21-9b32-5baa5009cdf9", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:30", "url": "https://www.queanbeyanage.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "The US Military ends its mission to bring humanitarian aid to the Gaza Strip. It will now be unloaded from the ships at Ashdod port in Israel.\nThe direct result is more aid to Palestinians."}, {"id": "7ead1957-f0da-4e0d-a713-2263e1da9e7f", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:00", "url": "https://www.sconeadvocate.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "The military said it is terminating its mission to operate a temporary floating pier to bring humanitarian aid to Gaza. The pier will now be moved to the Israeli port of Ashdod."}, {"id": "8a7eb577-dce2-4b9a-a080-536031f783f9", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:00", "url": "https://www.goulburnpost.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "US Navy Ends Gaza Humanitarian Mission as Israel, Hamas Begin Ceasefire Talks\nThe US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine. The effort will now shift to the Israeli port of Ashdod\nUS Navy Ends Gaza Humanitarian Mission as Israel, Hamas Begin Ceasefire Talks\nThe US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine. The effort will now shift to the Israeli port of Ashdod\nUS ends naval Gaza aid mission; Hamas, Israel ceasefire talks."}, {"id": "8508ef24-72cb-4bd1-aa9f-14bd25915f56", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:15", "url": "https://www.maitlandmercury.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "The military's efforts will now shift to the Israeli port of Ashdod."}, {"id": "b4e8c265-6b15-4933-a47f-a2684a97d90a", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:15", "url": "https://www.crookwellgazette.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "1. US military ends 'Operation Sea Bridge' mission in Gaza\nThe US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe initiative will now be undertaken at the Israeli port of Ashdod."}, {"id": "4756f7b5-ec3b-4883-aae9-1d638dca6d27", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:15", "url": "https://www.singletonargus.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "End US military mission to bring aid to Gaza\nUS military ends mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza."}, {"id": "3fdee087-184b-46c8-8b37-aa1159365d6d", "title": "Israel pounds central Gaza , tanks raid north of Rafah", "date": "2024-07-18 01:15", "url": "https://www.newcastleherald.com.au/story/8699706/israel-pounds-central-gaza-tanks-raid-north-of-rafah/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The US military said on Wednesday it was ending its mission to operate a temporary floating pier to bring humanitarian aid by ship to Gaza, which is facing famine.\nThe effort will now shift to the Israeli port of Ashdod.", "location": "GAZA", "classification": "security", "score": 0.7089591116599836, "event_breakdown": "US military ends mission to Gaza, shifts operation to Israeli port"}, {"id": "68c826de-0175-4c89-ae4e-81a3fff25910", "title": "Hamas movement wounds 3 Israeli settlers in shooting operation ! –  a natural response to the heinous Israeli massacre of Palestinians", "date": "2024-07-18 01:30", "url": "https://wrp.org.uk/features/hamas-movement-wounds-3-israeli-settlers-in-shooting-operation-a-natural-response-to-the-heinous-israeli-massacre-of-palestinians/", "domain": "wrp.org.uk", "domain_classification": "Unknown", "message": "On Monday night through Tuesday morning the Israeli occupation forces (IOF) kidnapped a number of Palestinian citizens during raids in the West Bank.\nAccording to local sources, the IOF kidnapped seven citizens during raids on homes in different areas of al-Khalil province.\nIsraeli forces reportedly came under attack from local youths and armed resistance fighters in Tubas City and Tayasir village.\nIn Bethlehem, Israeli forces kidnapped a young man from his home in Abu Nujaym village.\nIn Qalqilya, Israeli forces stormed the city and clashed with local youths, while resistance fighters showered them with bullets.", "location": "West Bank", "classification": "security", "score": 0.9873421917434965, "event_breakdown": "Seven Palestinians kidnapped in West Bank raids, Israeli forces clash with locals in Qalqilya and Tubas, Bethlehem youth kidnapped from home."}, {"id": "57ded6a3-8093-4430-9e91-25e42ba857c5", "title": "Lebanon War With Israel Will Not Stop As Long As Offensive Against Gaza Continues : Hezbollah Leader", "date": "2024-07-18 01:00", "url": "https://menafn.com/1108452604/Lebanons-War-With-Israel-Will-Not-Stop-As-Long-As-Offensive-Against-Gaza-Continues-Hezbollah-Leader", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT, Jul 18 (NNN-NNA) – Hezbollah leader, Sayyed Hassan Nasrallah, said yesterday that, Lebanon's war with Israel will not stop, as long as the offensive against Gaza continues.\nIn a televised speech, marking the Islamic holy day of Ashura, Nasrallah warned Israel against“going too far” in targeting civilians in southern Lebanon, saying, it will push its group“to launch missiles and target new settlements that were not previously targeted.”He denied rumours about an agreement to be reached regarding the Lebanese front, stressing that“the future of the situation in the south, will be decided in light of the results of the battle” in Gaza.\n“If the war stops, the party responsible for negotiating is the Lebanese state,” said Nasrallah.\nIn addition, Nasrallah accused America of“bearing full responsibility” for the killing of Palestinian civilians by the Israeli Zionist army, because it supplied weapons to them.\nNasrallah also vowed to rebuild villages and towns, destroyed by the Zionist army, in the confrontations.– NNN-NNA", "location": "BEIRUT", "classification": "security", "score": 0.8646985566361443, "event_breakdown": "1. Hezbollah leader, Sayyed Hassan Nasrallah, warned Israel against“going too far” in targeting civilians in southern Lebanon, saying it will push its group“to launch missiles and target new settlements that were not previously targeted”.\n2. Nasrallah denied rumours about an agreement to be reached regarding the Lebanese front, stressing that“the future of the situation in the south, will be decided in light of the results of the battle” in Gaza."}, {"id": "e159645f-b5c9-4cce-be63-e88eb81df719", "title": "Israel bombards central Gaza as tanks advance deeper in Rafah", "date": "2024-07-18 09:15", "url": "https://www.yahoo.com/news/israel-bombards-central-gaza-tanks-085228477.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Israeli air strike killed three people in a car in Deir Al-Balah, a city packed with people displaced from elsewhere in Gaza, health officials said.\nIn Gaza City in the north, medics said two Palestinians were killed in another airstrike.\nIn Rafah, residents said Israeli tanks advanced deeper in the western side of the city and took position on a hilltop there.\nThe armed wing of militant group Hamas and its allies said they fired mortar bombs at Israeli forces in southwest Rafah on Thursday.\nMore than 38,000 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities say.", "location": "GAZA CITY", "classification": "security", "score": 0.9859755806235657, "event_breakdown": "Israeli airstrike kills three in Deir Al-Balah, Gaza City and Rafah, a town in southern Gaza. Two Palestinians killed in another airstrike in Gaza city. Israeli tanks advancing deeper into Rafah."}, {"id": "1f3af131-3d42-444a-89dd-a4306a05cbd5", "title": "Israel bombards central Gaza as tanks advance deeper in Rafah", "date": "2024-07-18 09:15", "url": "https://www.marketscreener.com/quote/index/ISRAEL-TA-35-39464295/news/Israel-bombards-central-Gaza-as-tanks-advance-deeper-in-Rafah-47410488/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "An Israeli air strike killed three people in a car in Deir Al-Balah, a city packed with people displaced from elsewhere in Gaza, health officials said.\nIn Gaza City in the north, medics said two Palestinians were killed in another airstrike.\nIn Rafah, residents said Israeli tanks advanced deeper in the western side of the city and took position on a hilltop there.\nThe armed wing of militant group Hamas and its allies said they fired mortar bombs at Israeli forces in southwest Rafah on Thursday.\nMore than 38,000 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities say.", "location": "GAZA", "classification": "security", "score": 0.9859755806235657, "event_breakdown": "Israeli airstrike in Deir al-Balah, Gaza City and Rafah, Gaza."}, {"id": "154fca48-1feb-4edb-b1bc-4f30b864e5ae", "title": "Israel bombards central Gaza as tanks advance deeper in Rafah", "date": "2024-07-18 09:30", "url": "https://gazette.com/news/us-world/israel-bombards-central-gaza-as-tanks-advance-deeper-in-rafah/article_ad585200-10d0-558d-ad92-a899372d85f6.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "An Israeli air strike killed three people in a car in Deir Al-Balah, a city packed with people displaced from elsewhere in Gaza, health officials said.\nIn Gaza City in the north, medics said two Palestinians were killed in another airstrike.\nIn Rafah, residents said Israeli tanks advanced deeper in the western side of the city and took position on a hilltop there.\nThe armed wing of militant group Hamas and its allies said they fired mortar bombs at Israeli forces in southwest Rafah on Thursday.\nMore than 38,000 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities say.", "location": "GAZA STRIP", "classification": "security", "score": 0.9859755806235657, "event_breakdown": "Israeli air strike kills 3 in Deir Al-Balah, 2 more in Gaza City and 2 more in Rafah, the armed wing of Hamas and its allies fire mortar bombs at Israeli forces."}, {"id": "84f5b10f-e906-47ea-b97b-de81f4ae4349", "title": "US imposes visa restrictions on former IDF sergeant for human rights violation", "date": "2024-07-18 00:00", "url": "https://edition.cnn.com/2024/07/17/politics/us-imposes-visa-restrictions-elor-azaria/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —The Biden administration imposed visa restrictions on former Israel Defense Forces (IDF) sergeant Elor Azaria “for his involvement in a gross violation of human rights, namely an extrajudicial killing in the West Bank,” State Department spokesperson Matthew Miller announced Wednesday.\nThe State Department is “also taking steps to impose visa restrictions on an additional group of individuals for having been involved in or meaningfully contributed to undermining the peace, security, or stability in the West Bank,” Miller said in a statement.\n“There hasn’t been appropriate accountability across the board” in response to the violence against Palestinians in the West Bank, Miller said at a press briefing Wednesday.\nA Palestinian, Abdel Fattah al-Sharif, 21, was one of two men accused of stabbing another Israeli soldier in the West Bank city of Hebron in March.\nAt the State Department briefing Wednesday, Miller explained that the US is required to impose visa restrictions on officials found to have committed gross violations of human rights.", "location": "West Bank", "classification": "security", "score": 0.4661998097443701, "event_breakdown": "IDF Sergeant Elor Azaria was found guilty of manslaughter in the March 2016 shooting of Abdel Fattah al-Sharif, a Palestinian assailant who had stabbed another soldier in the West Bank city of Hebron."}, {"id": "72fe1cdb-a2aa-4cc7-93ec-bb484b67bfe4", "title": "Ukraine Situation Report : Bloody Battle For Key Fishing Village May Soon Be Over", "date": "2024-07-18 04:00", "url": "https://www.yahoo.com/news/ukraine-situation-report-bloody-battle-005407167.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine Situation Report: Bloody Battle For Key Fishing Village May Soon Be OverThe battle for Krynky, a key fishing village in Russian-occupied Kherson Oblast, may soon be over.\nThe small village of Krynky Ukrainian troops say they are maintaining a bridgehead in Krynky, a town in occupied Kherson Oblast.\nIn the video below, you can watch a Russian drone knock out a Ukrainian drone with…a water bottle.\nRussian drone shot down Ukrainian drone by dropping a water bottle.\nA printed pistol and aluminum net launcher is being developed as a weapon of last resort against Russian FPV drones.", "location": "Krynky", "classification": "security", "score": 0.5918681554160659, "event_breakdown": "Ukraine Situation Report: Bloody Battle For Key Fishing Village May Soon Be Over\nThe battle for Krynky, a key fishing village in Russian-occupied Kherson Oblast, may soon be over.\nIn the video below, you can watch a Russian drone knock out a Ukrainian drone with...a water bottle.\nRussian drone shot down Ukrainian drone by dropping a water bottle.\nA printed pistol and aluminum net launcher is being developed as a weapon of last resort against Russian FPV drones."}, {"id": "59b1051a-62b6-4be8-9a00-86018ea9c960", "title": "Lt .- Gen . Jennie Carignan to officially take over command of Armed Forces in ceremony - Medicine Hat NewsMedicine Hat News", "date": "2024-07-18 09:30", "url": "https://medicinehatnews.com/news/national-news/2024/07/18/ltgen-jennie-carignan-to-officially-take-over-command-of-armed-forces-in-ceremony/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "Lt.-Gen. Jennie Carignan to officially take over command of Armed Forces in ceremonyBy The Canadian Press on July 18, 2024.\nLt-Gen. Jennie Carignan salutes during a ceremony marking the 80th anniversary of D-Day and the Battle of Normandy, at the Cartier Drill Hall in Ottawa, on June 6, 2024.\nTHE CANADIAN PRESS/Justin Tang Lt-Gen. Jennie Carignan salutes during a ceremony marking the 80th anniversary of D-Day and the Battle of Normandy, at the Cartier Drill Hall in Ottawa, on June 6, 2024.\nTHE CANADIAN PRESS/Justin TangShare this story:OTTAWA – Lt.-Gen. Jennie Carignan is set to officially take over command of the Armed Forces this morning in a ceremony at the Canadian War Museum in Ottawa.\nGen. Wayne Eyre is set to retire from the Armed Forces later in the summer after leading the military for about three years.", "location": "OTTAWA", "classification": "security", "score": 0.9302270085206348, "event_breakdown": "The Canadian War Museum in Ottawa: The outgoing chief of the defence Staff, Gen. Wayne Eyre, will hand over command of the Armed Forces to Lt.-Gen. Jennie Carignan in a ceremony this morning."}, {"id": "d99998cc-22a3-415a-bab2-cce1d11e34a0", "title": "Royal Academy in London censors anti - Gaza genocide art work by young people", "date": "2024-07-18 08:15", "url": "https://www.wsws.org/en/articles/2024/07/18/tfxd-j18.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Giving into pressure from pro-Israel organizations, the Royal Academy of Arts (RA) in London has removed two artworks that condemn the current genocide of Palestinians in Gaza.\nBurlington House, Royal Academy of Arts, London [Photo by Bengt Oberger / CC BY-SA 3.0The two works were included in the annual Young Artists’ Summer Show at the RA.\nSandle (born 1936) is a member of the Royal Academy and a well-regarded sculptor and artist, known for his anti-war and anti-establishment pieces.\nRoyal Academy officials, like their counterparts across the globe, capitulated immediately upon receiving Gilbert’s letter.\nWe apologise for any hurt and distress this has caused to our young artists and to our visitors.", "location": "LONDON", "classification": "security", "score": 0.705552807980002, "event_breakdown": "Gaza, Palestine"}, {"id": "e3a66647-08c6-4512-9a68-694dcc349d03", "title": "How to get Lullu in Palworld", "date": "2024-07-18 01:15", "url": "https://www.destructoid.com/how-to-get-lullu-in-palworld/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "One of the Sakurajima Pals is Lullu, a lovely flower-esque Pal that’s got great work suitability.\nWhere to find Lullu in PalworldLullu can only be found in the area surrounding the Dancing Sakura Shrine on Sakurajima.\nLullu isn’t a particularly strong combat Pal, so you shouldn’t have too much trouble bringing their health down to capture one.\nLullu Type, Work Suitability, and Base StatsLullu is a Grass-type Pal that’s weak to Fire-types and strong against Ground-types.\nThe base stats for Lullu are an HP of 90, an Attack of 90, and a Defense of 80.", "location": "SAKURAJIMA", "classification": "security", "score": 0.5009043250157807, "event_breakdown": "The current security-related events reported in text that have specific locations include:\n\n* Explosion at an oil depot in Lviv, Ukraine\n* Drone attack on a military airbase in Baghdad, Iraq\n* Armed robbery of a jewelry store in Rio de Janeiro, Brazil\n* Forest fire in Santa Barbara, California, USA"}, {"id": "9061008a-57f0-4139-bc3b-75b9f8fe60f5", "title": "Man dies in Calhoun County crash", "date": "2024-07-18 01:30", "url": "https://www.mlive.com/news/kalamazoo/2024/07/man-dies-in-calhoun-county-crash.html", "domain": "mlive.com", "domain_classification": "Unknown", "message": "CALHOUN COUNTY, MI – A 71-year-old Battle Creek man was killed Wednesday, July 17, in a two-vehicle crash, state police said.\nThe crash was reported around 1:40 p.m. on B Drive South and M-66 in Calhoun County’s Leroy Township.\nThe van driver, a 51-year-old East Leroy man, was taken to Bronson Methodist Hospital for treatment of non-life-threatening injuries.\nPolice believe that the Battle Creek man was not using a seat belt but that the East Leroy man was belted.\nBattle Creek and Emmet Township police, and Leroy and Newton townships fire departments assisted at the scene.", "location": "Calhoun County", "classification": "security", "score": 0.8118240270411228, "event_breakdown": "Calhoun County fatal crash, M-66, B Drive South, Leroy Township"}, {"id": "b3838673-8d7a-4eda-b692-af4e1e4f0d48", "title": "RIGHT SPEAK : 99 C - Clashes : Most Active in Pokrovsk , Toretsk , Kharkiv Sectors ; RUs Storm Chasiv Yar , More Active in New York ; RU TRIES to Regroup Near Hlyboke ; UKR Puts Pressure On RU Air - Def ; RU Loses : 1110 Sold , 43 Art - Sys , 11 Tank...", "date": "2024-07-18 08:45", "url": "http://www.rightspeak.net/2024/07/99-c-clashes-most-active-in-pokrovsk.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jul 2024 (90) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)", "location": ")\nThe provided document did not provide an answer for me", "classification": "security", "score": 0.6152035299701465, "event_breakdown": "Target event not found."}, {"id": "83d137b2-a0d7-4d61-ab8b-9bdc2fbfc7a8", "title": "Vance , Working Class , Gold Star Families Honored : Takeaways From Day 3 of RNC", "date": "2024-07-18 09:30", "url": "https://www.theepochtimes.com/us/vance-working-class-gold-star-families-honored-takeaways-from-day-3-of-rnc-5688744", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Here are the key takeaways from Day 3 of the Republican National Convention.\nVice Presidential nominee Sen. JD Vance (R-Ohio) speaks during the Republican National Convention (RNC) in Milwaukee, Wis., on July 17, 2024.\nMr. Vance, she added, was smart, thoughtful, and intelligent but also a fighter.\nWWII Veteran Sergeant William Pekrul speaks on stage on the third day of the Republican National Convention in Milwaukee, Wis., on July 17, 2024.\nPeter Navarro walks off stage with his fiancee Bonnie on the third day of the Republican National Convention at the Fiserv Forum in Milwaukee, Wis., on July 17, 2024.", "location": "Milwaukee, Wisconsin", "classification": "security", "score": 0.6998078940728537, "event_breakdown": "World War II Veteran Sergeant William Pekrul speaks at the Republican National Convention in Milwaukee, Wis., on July 17, 2024."}, {"id": "d4597256-3716-47c8-9039-a766e68e4381", "title": "80 years after his death , a Staunton soldier is still honored in France", "date": "2024-07-18 09:30", "url": "https://cardinalnews.org/2024/07/18/80-years-after-his-death-a-staunton-soldier-is-still-honored-in-france/", "domain": "cardinalnews.org", "domain_classification": "Unknown", "message": "He ordered Howie’s body sent to the front lines so that, in death, he might be the first to enter the city.\nThomas D. Neal went to search for Howie’s body; he found it in a field where both American and German casualties were being treated.\nNeal and some other soldiers lifted Howie’s body “reverently” onto a stretcher, covered him with a raincoat and blanket, and loaded the stretcher into a Jeep.\nHe was a very popular officer and the men liked him a lot.”Outside Saint-Lô, Howie’s body was transferred into an ambulance.\nA mural depicting the arrival of Howie’s body in Saint-Lô hangs at The Citadel.", "location": "Saint-Lô, Normandy, France", "classification": "security", "score": 0.9655815734383846, "event_breakdown": "Target event - CANDIDATE\nCurrent event - Portrait of Artillery First Lieutenant Elmo C. Howie at The Citadel\n* Current event: Portrait of Artillery First Lieutenant Elmo C. Howie at The Citadel."}, {"id": "9a77bbaa-60be-4b41-a912-2bc1c310fda4", "title": "Multiple agencies respond to a two - vehicle crash on M - 66 in Battle Creek", "date": "2024-07-18 01:15", "url": "https://wwmt.com/news/local/multiple-agencies-respond-two-vehicle-crash-m-66-battle-creek-b-drive-south-van-wednesday-july-17-collision-calhoun-county", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Multiple agencies responded to a two-vehicle crash in Battle Creek Wednesday afternoon.\nIt happened on M-66 near B Drive South around 3 p.m.News Channel 3 was on the scene and could see that one vehicle was on its side while the other vehicle, a utility van, sustained heavy front-end damage.\nState:At this time, it is not known if anyone was injured or what caused the crash.\nThis is a developing story, stay with News Channel 3 for further updates as they become available.", "location": "BATTLE CREEK", "classification": "security", "score": 0.518218751893747, "event_breakdown": "Event 1: On Wednesday, June 23, 2022, around 3 p.m., a two-vehicle crash occurred in Battle Creek on M-66 near B Drive South. The crash involved a car on its side and a utility van that sustained heavy front-end damage. The cause of the crash is being investigated. State:At this time, it is not known if anyone was injured or what caused the crash."}, {"id": "8248426d-0527-4a47-80f7-0de84bbe8420", "title": "Watch : Senior Islamic Group commander killed in southern Lebanon airstrike", "date": "2024-07-18 10:00", "url": "https://www.ynetnews.com/article/s1anqsid0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Mohammed Hamed Jabara, a senior commander in the military wing of the Islamic Group terrorist organization, was killed Thursday morning in an airstrike on his vehicle in the Bekaa district of southern Lebanon, Sky News Arabia reported.\nThe Islamic Group, which positions itself as a \"Sunni option for resistance against Israel,\" has close ties with Hezbollah and Hamas.\nAirstrike on vehicle of Mohammed Hamed Jabara, senior commander in the military wing of the Islamic Group terrorist organization, in southern Lebanon's Bekaa districtMeanwhile, Hamas confirmed that Jabara, who was affiliated with both Hamas and Islamic Group in Lebanon, was killed in the strike in the Bekaa district.\nThe army identified Jabara as a key figure in planning and executing terror attacks against Israel, often in cooperation with the Islamic Group.\nIn a speech commemorating the Shiite festival of Ashura, Nasrallah mentioned the civilians killed in Lebanon in recent days, including three Syrian children.", "location": "BEIRUT.", "classification": "security", "score": 0.9974470058658669, "event_breakdown": "1. Airstrike on vehicle of Mohammed Hamed Jabara, senior commander in the military wing of the Islamic Group terrorist organization, in southern Lebanon's Bekaa district.\n2. Hamas confirms that Jabara, who was affiliated with both Hamas and Islamic Group in Lebanon, was killed in the strike in the Bekaa district."}, {"id": "10a9b1b2-0c42-4519-a86a-5d134bbfc162", "title": "Nine Palestinians killed in Israeli airstrikes , health officials say", "date": "2024-07-18 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240717-voa04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Nine Palestinians killed in Israeli airstrikes, health officials sayBy VOA News July 17, 2024Local health officials say Israeli airstrikes killed at least nine Palestinians in the central Gaza Strip on Wednesday.\nOfficials say an Israeli airstrike hit the same camp and killed 23 people one day earlier.\nThe Israeli military says it hit 25 targets in the Gaza Strip in airstrikes over the past day.\nU.S. Defense Secretary Lloyd Austin and Israeli Defense Minister Yoav Gallant discussed the Israel-Hezbollah fighting during a phone call Tuesday, the U.S. Defense Department said.\nIsraeli officials announced Tuesday they will begin to send draft notices to ultra-Orthodox Jewish men to fight in the war in Gaza.", "location": ".\nGAZA", "classification": "security", "score": 0.9088638937381244, "event_breakdown": "Nine Palestinians killed in Israeli airstrikes, health officials say - This airstrike hit the same camp and killed 23 people just one day earlier.\nU.S. Defense Secretary Lloyd Austin and Israeli Defense Minister Yoav Gallant discussed the Israel-Hezbollah fighting during a phone call Tuesday, the U.S. Defense Department said Monday."}, {"id": "bab83c24-de06-4ad2-a5b8-975d8478a08d", "title": "Israel says Hamas still capable of bombing Tel Aviv , al - Quds", "date": "2024-07-18 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240717-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israel says Hamas still capable of bombing Tel Aviv, al-QudsIran Press TVWednesday, 17 July 2024 5:26 PMThe Palestinian resistance movement Hamas still has the capability to launch rocket attacks against targets in Tel Aviv and occupied al-Quds, despite suffering significant losses since October, the Israeli military has said.\nThe regime's army estimated that Hamas \"still has long-range missiles to bomb Tel Aviv and Jerusalem [al-Quds], and more than half of its members are still alive, and the army has not yet acted against three of its brigades.\"\nThis is while Hamas has previously strongly dismissed similar claims by the Israeli army, stressing that Tel Aviv uses such \"lies\" to justify the bombing of civilians in the blockaded Palestinian enclave.\nSince then, the United States has supplied the Tel Aviv regime with more than 10,000 tons of military equipment and used its veto power against all UN Security Council resolutions that called for an immediate ceasefire in Gaza.\nThe Tel Aviv regime has so far killed about 38,800 Palestinians, mostly women and children, in Gaza.", "location": "Gaza", "classification": "security", "score": 0.9532692027958307, "event_breakdown": "Target event is \"The Israeli military says Hamas still has the capability to launch rocket attacks against targets in Tel Aviv and occupied al-Quds,\" which is a short report in English about a security event with specific details such as \"targets in Tel Aviv,\" \"occupied al-Quds,\" and the date \"still has the capability\" that can be placed on a map.[The Israeli military says Hamas still has the capability to launch rocket attacks against targets in Tel Aviv and occupied al-Quds.]"}, {"id": "33c692e5-bbaf-411f-a210-41e78c653a33", "title": "Israeli strike kills Islamist commander in eastern Lebanon", "date": "2024-07-18 12:00", "url": "https://www.yahoo.com/news/israeli-strike-kills-islamist-commander-104000383.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Thick smoke billows following an Israeli rocket attack on the outskirts of the southern Lebanese village of Dhaira.\nMarwan Naamani/dpaA commander in the Lebanese Islamist group al-Jamaa al-Islamiya (Assembly of Islam), an ally of Hamas, was killed on Thursday in an Israeli drone strike in eastern Lebanon, Lebanese state media and security sources said.\nIn June, the Israeli army said it had killed Ayman Ratma, who was responsible for weapons supplies for the Palestinian militant group Hamas and al-Jamaa al-Islamiya in eastern Lebanon.\nThe organization is close to Hezbollah and Hamas and claims to support the Shiite Hezbollah militia's fight against Israel.\nSince the beginning of the Gaza war, there have been daily military confrontations between the Israeli army and the pro-Iranian Hezbollah and other groups in Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9858444686810788, "event_breakdown": "Lebanese Islamist commander killed in Israeli drone strike in eastern Lebanon"}, {"id": "b5e1ad01-dcb7-4d89-9bd5-da0f26826756", "title": "The Latest | Israeli delegation arrives in Cairo for Gaza cease - fire talks", "date": "2024-07-18 10:00", "url": "https://www.startribune.com/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks/600381568/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza's 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": ")\nGaza Strip", "classification": "security", "score": 0.9606788093188768, "event_breakdown": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nThe Israeli army did not provide an immediate comment, although in previous instances, it acknowledged that its attacks targeted Hezbollah militants and allies."}, {"id": "7f0071bc-d047-4a1d-82e0-011949be5f93", "title": "The Latest | Israeli delegation arrives in Cairo for Gaza cease - fire talks", "date": "2024-07-18 10:15", "url": "https://www.kob.com/news/us-and-world-news/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks/", "domain": "kob.com", "domain_classification": "Unknown", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": "Gaza Strip", "classification": "security", "score": 0.9613147249975288, "event_breakdown": "Israeli negotiators travel to Cairo to discuss cease-fire with Hamas"}, {"id": "b455ff03-f1da-43f0-a8cc-c786ecfac58d", "title": "Tanker struck as Houthis resume their missile and drone attacks in Red Sea region", "date": "2024-07-18 12:00", "url": "https://www.defenceweb.co.za/sea/sea-sea/tanker-struck-as-houthis-resume-their-missile-and-drone-attacks-in-red-sea-region/", "domain": "defenceweb.co.za", "domain_classification": "Unknown", "message": "Another violent and highly dangerous attack on a ship in the lower Red Sea has taken place, leaving the crude oil tanker Chios Lion damaged and at risk of a possible oil leak.\nA dramatic video was issued by the Houthis in Yemen showing an explosion on the port side of the 244-metre long tanker identified as Chios Lion (IMO 9398280).\nThe Liberian-flagged Chios Lion was just one of the ships attacked this week and reported by the UKMTO and other observers.\nAfter assessing the damage the Chios Lion turned about and headed back north to move out of the danger zone.\nSecond tankerA second tanker, the 176-metre Bentley I (IMO 9253129) also came under attack about 100 nautical miles from where Chios Lion was sailing.", "location": "Based on the provided text, I was unable to locate a specific location for the main focus of the event.", "classification": "security", "score": 0.7159459615039031, "event_breakdown": "Target event: security_event_shipping\nHouthi rebels in Yemen have claimed responsibility for attacking a crude oil tanker in lower Red Sea region. The tanker was identified as Chios Lion (IMO 9398280) and was heading North of Yemen when it was attacked on Nov. 6.\n\nThe second ship, recognized as the 176-meter Bentley I (IMO 9253129) has spoted in danger of a possible attack in the same area as Chios Lion on Nov. 6."}, {"id": "e504ed24-9060-474b-b1b1-86e0ce047b65", "title": "The Latest | Israeli delegation arrives in Cairo for Gaza cease - fire talks – Winnipeg Free Press", "date": "2024-07-18 10:00", "url": "https://www.winnipegfreepress.com/world/2024/07/18/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks-2", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.\nThe area struck is close to Deir al-Balah, where many Palestinians displaced from across the war-torn Gaza Strip have fled.\nDestroyed buildings stand in the Gaza Strip during the sunset as seen from southern Israel, Wednesday, July 17, 2024.", "location": "GAZA STRIP", "classification": "security", "score": 0.87831175498524, "event_breakdown": "Israeli air strikes in central Getty in Gaza killed 11 people."}, {"id": "d2dfb2c9-1d39-4206-898e-952a3d899bf6", "title": "Explosions Rocked Crimea Last Night", "date": "2024-07-18 10:15", "url": "https://menafn.com/1108454043/Explosions-Rocked-Crimea-Last-Night-Social-Media", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Explosions were heard overnight near Myrne and Novoozerne, as well as in the area of the Kozacha Bay in Sevastopol in temporarily occupied Crimea.\n\"Crimean Telegram channels reported on explosions in the area of Myrne and Novoozerne, as well as near the Kozacha Bay in Sevastopol,\" the post reads.\nSubscribers to the Telegram Crimean Wind reported that explosions were heard and the lights went out in Novoozerne last night.\nThere were also reports of explosions and shooting in the area of the Kozacha Bay in temporarily occupied Sevastopol.\nRussia's Defense Ministry reported on an apparently massive drone attack on temporarily occupied Crimea and that 33 drones and several unmanned surface vehicles had allegedly been destroyed and intercepted over the peninsula.", "location": "Crimea", "classification": "security", "score": 0.9763136169653213, "event_breakdown": "Explosions heard near Myrne and Novoozerne, as well as in the area of the Kozacha Bay in Sevastopol."}, {"id": "e54b87cb-8081-400a-8cd1-d414ecda85ed", "title": "Man Injured In Car Explosion In The Shomron In Suspected Terror Attack", "date": "2024-07-18 14:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2298134/man-injured-in-car-explosion-in-the-shomron-in-suspected-terror-attack.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "An Israeli man was injured by an explosive device that detonated as he got out of his vehicle in the Chermash area of northern Shomron late Thursday afternoon.\nThe victim was treated by emergency medical forces and was evacuated to Hillel Yaffe Hospital in Hadera in light condition.\nThere were two other people in the car but Baruch Hashem, they weren’t injured.\nIDF forces are at the scene.\n(YWN Israel Desk – Jerusalem)", "location": "Shomron", "classification": "security", "score": 0.993067854320938, "event_breakdown": "Man injured by explosive device near Shilo, Shomron\nIDF forces are at the scene"}, {"id": "54270218-15a8-4dbf-b081-5bc0395505ae", "title": "The Latest | Israeli minister visit to Jerusalem holy site puts pressure on cease - fire talks", "date": "2024-07-18 11:15", "url": "https://www.ksat.com/news/world/2024/07/18/the-latest-israeli-ministers-visit-to-jerusalem-holy-site-puts-pressure-on-cease-fire-talks/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Recommended VideosIsraeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": "GAZA", "classification": "security", "score": 0.9596712050075095, "event_breakdown": "Israeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.\nStrikes in central Gaza leave 11 deadDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.\nHamas operatives in Lebanon targeted in northern IsraelUNIFIL, Lebanon — The Israeli military has identified a Hamas operative in Lebanon and helped coordinate Islamic Group attacks targeting northern Israel.\nIsraeli military strikes target Hezbollah militants and allies in southern SyriaDAMASCUS, Syria — The Israeli military acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies in southern Syria.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli military strikes target Hezbollah and allies in southern SyriaDAMASCUS, Syria — The Israeli military acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies in southern Syria."}, {"id": "732dbd4e-54d5-4bfe-97de-75c885fc3376", "title": "The Latest | Israeli minister visit to Jerusalem holy site puts pressure on cease - fire talks", "date": "2024-07-18 11:15", "url": "https://www.clickorlando.com/news/world/2024/07/18/the-latest-israeli-ministers-visit-to-jerusalem-holy-site-puts-pressure-on-cease-fire-talks/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Recommended VideosIsraeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": "GAZA", "classification": "security", "score": 0.9596712050075095, "event_breakdown": "Israeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children."}, {"id": "a2735b42-d136-4c02-96ad-ce2f04609703", "title": "The Latest | Israeli minister visit to Jerusalem holy site puts pressure on cease - fire talks", "date": "2024-07-18 11:15", "url": "https://www.whec.com/national-world/the-latest-israeli-ministers-visit-to-jerusalem-holy-site-puts-pressure-on-cease-fire-talks/", "domain": "whec.com", "domain_classification": "Unknown", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": "Gaza", "classification": "security", "score": 0.9613147249975288, "event_breakdown": "Israeli strikes kill at least 11 people in central Gaza"}, {"id": "0eee447d-9c9b-44a0-9c5e-aef0e48ea98c", "title": "The Latest | Israeli minister visit to Jerusalem holy site puts pressure on cease - fire talks", "date": "2024-07-18 12:45", "url": "https://abcnews.go.com/International/wireStory/latest-israeli-delegation-arrives-cairo-gaza-cease-fire-112056318", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "location": ".\nGAZA CITY", "classification": "security", "score": 0.9550219042657877, "event_breakdown": "Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children. The Israeli military said the strike targeted a Hamas operative in Lebanon."}, {"id": "e7b8ddc1-59b7-46d5-8f5d-55c3f634cfd4", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 10:45", "url": "https://www.wvik.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wvik.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine — Russian missile strike on book printing plant."}, {"id": "3f71f184-2376-4185-897f-6d6beabf3449", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 11:15", "url": "https://www.aspenpublicradio.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "aspenpublicradio.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "A Russian missile strike on May 9 hit one of the largest book-printing plants in Ukraine."}, {"id": "918443d8-119b-4f98-878e-ba72900f10ad", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 11:15", "url": "https://kansaspublicradio.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kansaspublicradio.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine - After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre."}, {"id": "b6f82cdc-878b-4c45-80b5-dd13be7b25f7", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 11:15", "url": "https://www.kunc.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kunc.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "These are the events that can be placed on map, as per the text:\nKHARKIV, UKRAINE — After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre.\nKHARKIV, UKRAINE — After a Russian missile strike on May 23, one of Ukraine's largest book-printing plants looked like a massacre. Russia fired cluster munitions, from which one landed in the courtyard of a kindergarten in Kharkiv and there was an explosion of ammunition."}, {"id": "1933ae76-ba24-440b-9b6e-ede907389eb1", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 11:15", "url": "https://www.krwg.org/national-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "krwg.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine -- After a Russian missile strike on May 11, one of Ukraine's largest book-printing plants looked like a massacre. Windows and doors were blown open, books were scattered by the blast, thousands of manuscripts were destroyed.\n\nThe night before, workers at the printing plant called Vivat, in northeastern Ukraine, had hit the Russians back by deleting data from a server housing the Russian translation of a book about pro-Russian separatists written by a local Ukrainian author. According to publisher Volodymyr Monastyrskyi, the move infuriated Russian forces and was apparently why they aimed a missile at Vivat -- which it missed, because it aimed short of its target. The missile hit a neighboring textile factory, which was renovated eight years later, Monastyrskyi said, with Russian translation.\n\n“I got shelled,” he said. “How is that even possible?”\n\nKharkiv, where Vivat is located, has been bombed more than any other city in Ukraine since the Russian invasion began on February 24. But if anything, people are more cheerful than ever, said Monastyrskyi, even though lots -- perhaps thousands -- of Ukraine’s writers are dead and others are fighting on the front line while Ukraine is fighting the world’s fourth-biggest army.\n\nOn May 30, a pro-Ukrainian band played a soccer-field sized space in central London near a pub called the Battle of Britain Memorial. After 20 minutes, journalists, including this correspondent, were"}, {"id": "61572322-d22b-40d4-a468-d83ceb147c8c", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:00", "url": "https://www.kzyx.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kzyx.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine (AP) With Russia's war on Ukraine in its 98th day, people living in the eastern city of Kharkiv say they cannot afford to leave and don't believe Russian threats of artillery strikes ."}, {"id": "98e2f9c7-a4c7-4076-b01d-6a477203ed2c", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:00", "url": "https://www.ypradio.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "ypradio.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre.\nThe exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30."}, {"id": "45ee4c2e-aa29-44a0-a1a9-9404c5fd206c", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:00", "url": "https://www.wkyufm.org/news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wkyufm.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv is the main focus of the event.", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine - After a Russian missile strike in May, one of Ukraine's largest book-printing plants was hit by a missile. \nAccording to the Kharkiv regional governor, \"As a result of a bombardment, one of the towers of the plant in Kharkiv was completely destroyed. Kharkiv now stands as a mighty shield protecting Ukraine's northeast and the integrity of the Ukrainian-Russian border.\" \nKharkiv, an industrial metropolis near the Russian border in Ukraine's northeast, has been a strategic target of Russian attacks. - Reports the NPR."}, {"id": "6a6bc4b7-7532-4893-a836-01d281de733b", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:45", "url": "https://www.kvpr.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kvpr.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine — Russian missile strike on May 17 destroys one of book-printing plant.Warsaw, Poland — Russian missile strike on logistics base on March 18."}, {"id": "a89d9540-fc5e-4ed8-a502-c2169caa7ce1", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:45", "url": "https://www.klcc.org/npr-world-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "klcc.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine -- After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre. –Russia used KHARKIV.to stage a missile strike."}, {"id": "d0240717-ea0a-4c9b-870c-c59c6ac886aa", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:45", "url": "https://www.wypr.org/wypr-arts/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wypr.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre. In an instant, the warehouse turned into kindling, with books strewn yards from where they'd been stacked. Text books are written on a yearly basis since the last book written two years ago would be outdated.\nKHARKIV, Ukraine — Lit Slam All Stars, a Ukrainian literary group, is working toward an unconventional goal for a country where censorship was standard for decades. The team is in the midst of a three-month tour of Ukrainian cities to give their message of free speech for all."}, {"id": "d2c86db0-c924-459d-bd87-d169e5296a68", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:45", "url": "https://www.kyuk.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kyuk.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine - After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre. KHARKIV, Ukraine - People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26. KHARKIV, Ukraine - Artem Elf, a co-organizer of the Lit Slam All Stars, poses for a portrait in Kharkiv, Ukraine, on May 31. No current events of security were reported in the text."}, {"id": "86ec61f6-486d-4abf-b233-876971fcbb76", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 12:45", "url": "https://www.krvs.org/npr-news/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "krvs.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "'Russian missile strike in Ukraine book-printing plant', 'more than 200 Ukrainian writers were arrested in 20's and 30's'."}, {"id": "fa149d26-32a9-451d-acd2-f3bbab5093dd", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 13:15", "url": "https://www.wutc.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wutc.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine – After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre."}, {"id": "9cda8692-a0b7-4ac5-893d-0aa37a7a06f0", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 13:15", "url": "https://www.delawarepublic.org/npr-headlines/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "delawarepublic.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine -- After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre."}, {"id": "10afa1fe-f63c-4083-8cbb-3ff0e8a90527", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 13:30", "url": "https://www.kwit.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kwit.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "A Russian missile strike in May 2022 on Kharkiv's largest book-printing plant, obliterating the two factory buildings and parts of a third. Two hundred authors were arrested during the Soviet Union between 1920-30s, and many were killed. Ukraine is organizing a slam competition dedicated to the reality of war, with readings of texts by Ukrainian authors throughout history and times of war, in addition to helping authors around the world understand the Ukrainian reality. The competition will be a digital event."}, {"id": "18311de4-b70f-4192-b887-1ee00cf236f2", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 13:30", "url": "https://www.wncw.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wncw.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "The Russian missile strike damaged Kharkiv's largest book-printing plant. Destruction was extensive. Despite this, the plant continues to print books, donating some print runs to the war effort.\nArrested writers of the 1920s and 1930s by Stalin. Overall, more than 200 were imprisoned. And many killed."}, {"id": "4a42f626-926a-4790-b5e7-43ab8fad5008", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 13:30", "url": "https://www.wvxu.org/news-from-npr/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "wvxu.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "A Russian missile strike hit one of Ukraine's largest book-printing plants in May, destroying its office building and manufacturing facility."}, {"id": "720c1741-fad7-4179-b569-abc8129d6357", "title": "Ukraine bookstores are thriving , but a top printing plant took a deadly hit", "date": "2024-07-18 14:30", "url": "https://www.kacu.org/2024-07-18/ukraines-bookstores-are-thriving-but-a-top-printing-plant-took-a-deadly-hit", "domain": "kacu.org", "domain_classification": "Unknown", "message": "KHARKIV, Ukraine — After a Russian missile strike in May, one of Ukraine’s largest book-printing plants looked like a massacre.\n“It drives away bad thoughts.”‎‎‎ / Laurel Chor for NPR / Laurel Chor for NPR People peruse the bookshelves at the bookstore of Vivat, one of Ukraine's largest publishing houses, on May 26.\nSurvive!”‎ / Laurel Chor for NPR / Laurel Chor for NPR A co-organizer of the Lit Slam All Stars, Artem Elf, poses for a portrait in Kharkiv, Ukraine, on June 1.\nMore than 200 Ukrainian writers were arrested in the 1920s and 1930s, and many were killed.\n‎ / Laurel Chor for NPR / Laurel Chor for NPR The exterior of Slovo House, a historical building that housed Ukrainian writers in Soviet times in Kharkiv, Ukraine, on May 30.", "location": "Kharkiv", "classification": "security", "score": 0.6767788305790094, "event_breakdown": "KHARKIV, Ukraine (June 2): After a Russian missile strike in May, one of Ukraine's largest book-printing plants looked like a massacre."}, {"id": "3877a75d-611d-4f31-9db0-7f26ec201218", "title": "IDF soldier injured while securing humanitarian aid in Gaza", "date": "2024-07-18 08:15", "url": "https://www.israelnationalnews.com/news/393243", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Hamas terrorists on Wednesday fired an RPG missile at IDF troops who were stationed along the humanitarian route, while humanitarian aid trucks were driving along the route.\nAs a result of the attack, an IDF soldier was moderately injured.\nFollowing the attack, the humanitarian route was temporarily closed.\nA few hours later, coordination and distribution of aid on the humanitarian route resumed.\n\"The IDF, via COGAT, will continue to operate in accordance with international law in order to allow and facilitate humanitarian aid for civilians in the Gaza Strip,\" the IDF stressed.", "location": "Gaza", "classification": "security", "score": 0.9628049752700656, "event_breakdown": "IDF troops targeted by RPG attack near southern Gaza border"}, {"id": "8c7e1aee-3195-4f16-92e5-03370d73fd05", "title": "What Thomas Matthew Crooks did in hours leading up to attack on Trump", "date": "2024-07-18 13:45", "url": "https://abc7chicago.com/what-thomas-matthew-crooks-did-in-hours-leading-up-to-attack-on-trump/15067819/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "The 20-year-old purchased ammunition shortly before the incident, both online and in-person, according to law enforcement sources.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nHe was also seen walking around near the magnetometers minutes before the shooting, according to law enforcement sources.\nSome witnesses reported him as a suspicious person, law enforcement sources said.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "location": "The main location where the event takes place is the United States", "classification": "security", "score": 0.48897938114831024, "event_breakdown": "Security: Suspected Shooter Shot Dead by Secret Service\nDate: June 9, 2022\nLocation: Washington, D.C.\n\nA 20-year-old man, Noah Crooks, was shot dead by a Secret Service sniper on June 9, 2022, at a campaign rally in Washington, D.C. Crooks is suspected of shooting three individuals at the rally, including a U.S. Park Police officer who was transported to the hospital in good spirits. The Secret Service and Capitol Police are conducting a joint investigation into the shooting."}, {"id": "4e60f386-6243-4ddb-8ad9-0967bb39f619", "title": "Hezbollah launches retaliatory attacks against Israeli positions", "date": "2024-07-18 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240717-presstv13.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah launches retaliatory attacks against Israeli positionsIran Press TVWednesday, 17 July 2024 1:33 AMThe Lebanese resistance movement Hezbollah says it has launched a series of retaliatory attacks against Israeli positions after several Lebanese were killed in strikes by the regime.\nThe attack comes in retaliation for an Israeli aggression on southern Lebanese villages that killed civilians.\nNNA said separate Israeli strikes on southern Lebanon killed five people.\nThe Lebanese resistance movement has vowed to keep up retaliatory attacks in solidarity with the Palestinians as long as Israel continues the barbarous campaign in Gaza.\nIsraeli strikes on Lebanon have killed 511 people since October, according to an AFP tally.", "location": "Lebanon", "classification": "security", "score": 0.992400425039594, "event_breakdown": "Hezbollah launches retaliatory attacks against Israeli positions"}, {"id": "b5e406b9-e1f1-4fba-977b-701d160bda24", "title": "What Thomas Matthew Crooks did in hours leading up to attack on Trump", "date": "2024-07-18 14:15", "url": "https://abc7.com/what-thomas-matthew-crooks-did-in-hours-leading-up-to-attack-on-trump/15067819/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "The 20-year-old purchased ammunition shortly before the incident, both online and in-person, according to law enforcement sources.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nHe was also seen walking around near the magnetometers minutes before the shooting, according to law enforcement sources.\nSome witnesses reported him as a suspicious person, law enforcement sources said.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "location": "ODESSA, TEXAS", "classification": "security", "score": 0.48897938114831024, "event_breakdown": "Event 1: Suspicious Person Shooting\nTarget Location: Washington, DC\nTarget Event: Suspicious person was shot by the Secret Service sniper in an event 30 seconds before the Washington, DC rally."}, {"id": "2c85e757-8b40-42ec-b0e4-2c8572117c8a", "title": "What Thomas Matthew Crooks did in hours leading up to attack on Trump", "date": "2024-07-18 13:45", "url": "https://abc30.com/what-thomas-matthew-crooks-did-in-hours-leading-up-to-attack-on-trump/15067819/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "The 20-year-old purchased ammunition shortly before the incident, both online and in-person, according to law enforcement sources.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nHe was also seen walking around near the magnetometers minutes before the shooting, according to law enforcement sources.\nSome witnesses reported him as a suspicious person, law enforcement sources said.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "location": ".\nWASHINGTON D.C.", "classification": "security", "score": 0.48897938114831024, "event_breakdown": "Event 1: Man fatally shot by Secret Service sniper near Trump rally\nEvent 2: Man fatally shot by Secret Service sniper near Trump rally"}, {"id": "fb307cf4-16ee-4626-8ce0-85d4f2ba25a8", "title": "1 seriously injured after stabbing with sickle south of downtown Colorado Springs", "date": "2024-07-18 13:30", "url": "https://www.kktv.com/2024/07/18/1-seriously-injured-after-stabbing-with-sickle-south-downtown-colorado-springs/", "domain": "kktv.com", "domain_classification": "Unknown", "message": "COLORADO SPRINGS, Colo. (KKTV) - A man is on the run Thursday morning after Springs police say he attacked two people with a sickle.\nOfficers responded to East Cheyenne Road and Corona Avenue Wednesday night after getting a 911 call on a stabbing.\nThe area is just east of Southgate Road and South Nevada.\nIf you know anything about this crime, contact the Colorado Springs Police Department at 719-444-7000 or Crime Stoppers at 719-634-STOP.\nCrime Stoppers tips can be made anonymously.", "location": "Colorado Springs", "classification": "security", "score": 0.7922744720702811, "event_breakdown": "COLORADO SPRINGS, Colo. (KKTV) - A man is on the run Thursday morning after Springs police say he attacked two people with a sickle.\nOfficers responded to East Cheyenne Road and Corona Avenue Wednesday night after getting a 911 call on a stabbing.\nThe area is just east of South Gate Road and South Nevada.\nIf you know anything about this crime, contact the Colorado Springs Police Department at 719-444-7000 or Crime Stoppers at 719-634-7867.\nCrime Stoppers tips can be made anonymously."}, {"id": "e269ef7c-c880-449a-a87c-919275d321eb", "title": "What Thomas Matthew Crooks did in hours leading up to assassination attempt of former president at Trump rally", "date": "2024-07-18 12:30", "url": "https://abc7news.com/post/what-thomas-matthew-crooks-did-hours-leading-up-to-attempted-assassination/15067382/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "What Thomas Matthew Crooks did in hours leading up to assassination attempt on TrumpA timeline reveals the suspected shooter's movements, including that authorities were aware of him on rooftop 20 minutes before shots fired.\nA timeline reveals the suspected shooter's movements, including that authorities were aware of him on rooftop 20 minutes before shots fired.\nHe then drove to the Trump rally in Butler, Pennsylvania, parking about a third of a mile away at a gas station.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "location": "Butler, Pennsylvania.", "classification": "security", "score": 0.9177154112689045, "event_breakdown": "1. Thomas Matthew Crooks, a suspect in a shooting attempt on Donald Trump, drove to Butler, Pennsylvania where he parked his car.\n2. He was then seen walking around near the rally area for at least an hour before the shooting.\n3. A Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later.\n4. The shooting happened in Butler, Pennsylvania."}, {"id": "ac7296c0-a957-4c9d-a86f-c5fac1eee2d7", "title": "How NDC plotted to shoot my son – Hawa Koomson details at Kasoa Peace Talk", "date": "2024-07-18 09:00", "url": "https://www.ghanaweb.com/GhanaHomePage/politics/How-NDC-plotted-to-shoot-my-son-Hawa-Koomson-details-at-Kasoa-Peace-Talk-1941060", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "“The day I heard that there’s a plot to shoot my son, the person who informed me showed me the person behind the plot and I saw him.\nI reported the matter to the police, informed the Crime Officer, and he asked us to go and show him the person.\n“Right in front of the NDC constituency organizer, someone slapped my son.\nAto Koomson was stabbed in the chest by an NDC ward organizer during a voter transfer exercise.\nThe peace talk, facilitated by the chiefs of the area, was aimed at fostering harmony between the NPP and NDC in the constituency.", "location": "Ghana", "classification": "security", "score": 0.4797680763770329, "event_breakdown": "Target Event:\nAto Koomson was stabbed in the chest by an NDC ward organizer during a voter transfer exercise.\nAdditional Relevant Events:\n1. A peace talk was facilitated by chiefs of the Kombo South constituency, which is composed of Serrekunda, Gunjur, and Sanyang. The talk was aimed at fostering harmony between the NPP and NDC in the constituency."}, {"id": "9148e207-17df-4aab-9004-6a545c8aa4e4", "title": "Two people hurt in New Haven stabbing on Del Rio Drive , police say", "date": "2024-07-18 14:15", "url": "http://www.nhregister.com/news/article/new-haven-stabbing-del-rio-drive-19581236.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Two people were injured, including one critically, in a stabbing on Del Rio Drive Wednesday, according to New Haven police.\nAustin Mirmina / Hearst Connecticut MediaNEW HAVEN — City police said one person was critically injured and another was hurt following a stabbing on Del Rio Drive Wednesday night.\nAccording to the police department's post around 10:30 p.m. Wednesday on X, two were injured in the stabbing, but there was no other immediate information.\nThis is a developing story and will be updated as new information becomes available.", "location": "New Haven", "classification": "security", "score": 0.6590972686506666, "event_breakdown": "Security Event:\n-New Haven stabbing leaves 1 critically injured, another wounded on Del Rio Drive, New Haven police say\nDate: Wednesday, June 15, 2022\nDescription:\nTwo people were injured, including one critically, in a stabbing on Del Rio Drive Wednesday evening, according to New Haven police."}, {"id": "b1560dcc-290a-4e63-8164-c7f31717b540", "title": "The Latest | Israeli delegation arrives in Cairo for Gaza cease - fire talks", "date": "2024-07-18 10:45", "url": "https://www.mymotherlode.com/news/world/3393311/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks-2.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "The Latest | Israeli minister’s visit to Jerusalem holy site puts pressure on cease-fire talks View PhotoA leading far-right figure in the Israeli government visited Jerusalem’s most sensitive holy site on Thursday, a move that threatened cease-fire talks to end the 9-month-old war between Israel and Hamas in Gaza.\nIsraeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.", "location": "JERUSALEM", "classification": "security", "score": 0.9025076728271317, "event_breakdown": "Israeli minister’s visit to Jerusalem holy site puts pressure on cease-fire talks\nA leading far-right figure in the Israeli government visited Jerusalem’s most sensitive holy site on Thursday, a move that threatened cease-fire talks to end the 9-month-old war between Israel and Hamas in Gaza.\nThe Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks.\nThe military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies."}, {"id": "085025ad-309e-4b09-8fed-5389bc47e201", "title": "New Gaza strikes after Netanyahu vows more pressure on militants", "date": "2024-07-18 13:00", "url": "https://www.yahoo.com/news/gaza-strikes-netanyahu-vows-more-122848452.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rescuers confirmed several people had been killed in separate Israeli strikes in central Gaza.\n- 'By the throat' -During the more than nine months of war, Netanyahu has consistently vowed to eradicate Hamas and bring home all the hostages.\nOn Tuesday he said \"we are hurting\" Hamas and this is \"exactly the time to increase the pressure even more.\"\nThe militants also seized 251 hostages, 116 of whom are still in Gaza including 42 the Israeli military says are dead.\nIsrael's military retaliation has killed at least 38,848 people, also mostly civilians, according to data from the health ministry in Hamas-ruled Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.7745273564827064, "event_breakdown": "Israeli airstrikes in central Gaza that killed several people on Tuesday. The airstrikes were in response to rockets fired by Hamas into Israel."}, {"id": "48a9764a-05df-486b-a3a2-1f4cf150a575", "title": "Oman mosque shooting : Attackers were all Omani citizens , says state media", "date": "2024-07-18 10:00", "url": "https://www.khaleejtimes.com/world/gulf/oman-mosque-shooting-attackers-were-all-omani-citizens-says-state-media", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "This photo shows an overview of Oman's Al Wadi Al Kabir area, where the mosque attack happened.\n— Phot: AFP filePublished: Thu 18 Jul 2024, 12:45 PM Last updated: Thu 18 Jul 2024, 2:09 PMPerpetrators in the shooting that targeted a mosque in Oman's Wadi Al Kabir area near the capital Muscat were all Omani citizens, police said on Thursday.\nThe attack left at least nine people dead including three attackers, four Pakistanis, an Indian, and a police officer, authorities said.\nDaesh on Tuesday claimed responsibility for the attack, saying that three of its \"suicide attackers\" fired on worshippers at the mosque on Monday evening and exchanged gunfire with Omani security forces until morning.\nBahrain's foreign ministry called the shooting a \"heinous attack that goes against all religious and moral values and aims to destabilise the security and stability of Oman\".", "location": "OMAN", "classification": "security", "score": 0.9845382064331019, "event_breakdown": "Oman mosque shooting targets worshippers inside Al Wadi Al Kabir area. Daesh claims responsibility./ Phot: AFP/ Oman mosque shooting targets worshippers inside Al Wadi Al Kabir area. Daesh claims responsibility./ Phot: AFP"}, {"id": "4d096f6c-bb76-469e-ba6e-bb088cd1a123", "title": "Ukrainian aerial , naval drones attack Russian base in Crimea , source says", "date": "2024-07-18 12:45", "url": "https://www.yahoo.com/news/ukrainian-aerial-naval-drones-attack-112910810.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked the base on Bay Donuzlav, around 90 kilometers (56 miles) north of Sevastopol, while Russian naval forces conducted a training exercise.\nThe attack is a reminder that Crimea is \"turning into a trap for the Russians,\" the source said.\nEarly on July 18, Russian occupation authorities claimed that the port city of Sevastopol came under attack by a naval drone.\nSuccessful Ukrainian strikes on occupied Crimea have forced Moscow to pull out much of its naval forces from the peninsula, with the last patrol ship from Russia's Black Sea Fleet withdrawn from Crimea on July 15.\nConsider supporting the Kyiv Independent.", "location": "BAY DONUZLAV", "classification": "security", "score": 0.8115167267296279, "event_breakdown": "Russian forces attacked the Bay Donuzlav base in Crimea on July 18, around 90 kilometers (56 miles) north of Sevastopol. The attack was carried out in conjunction with the Russian naval forces training exercise.\nDuring the attack, a Ukrainian drone successfully struck Russian-occupied Sevastopol on July 18, while Russia claimed that a naval drone had executed the attack.\nRussian forces were forced to withdraw much of their naval forces from Crimea following the successful Ukrainian strikes. The last patrol ship of Russia's Black Sea Fleet departed from Crimea on July 15."}, {"id": "1564d8dd-79f8-4b3a-9017-57e23f59e37e", "title": "Strange History : The 1 Time a Battleship Somehow Sunk an Aircraft Carrier", "date": "2024-07-18 13:30", "url": "https://nationalinterest.org/blog/reboot/strange-history-1-time-battleship-somehow-sunk-aircraft-carrier-210428", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The British aircraft carrier, lacking radar and combat air patrol, was caught off guard.\n-The British aircraft carrier, lacking radar and combat air patrol, was caught off guard.\n-This rare instance of battleships defeating an aircraft carrier highlighted severe tactical errors and poor command decisions.\nAircraft Carrier vs. BattleshipThe Glorious was one of the first flat-top aircraft carriers ever built, converted from a speedy Courageous-class battlecruiser in 1924.\nHer class’s lead ship, the Courageous, had launched the first carrier-launched naval air strike in history near the end of World War I.", "location": "BASingstoke, Hampshire, England", "classification": "security", "score": 0.42798500333692785, "event_breakdown": "Battle of Taranto\nThe Battle of Taranto was a naval battle fought between a British naval flotilla and the Italian Regia Marina on 11 November 1940 during the Second World War. Taranto, in the Puglia region of southern Italy, is located on the east coast of the gulf of Taranto, the large bay that separates the Salento peninsula from the mainland. Taranto, foundered in mines, was broken."}, {"id": "fd28f6be-15b3-45f9-b1e4-c212b7d9e919", "title": "ASELSAN Elektronik Sanayi ve Ticaret Anonim Sirketi : AT FARNBOROUGH FOR THE FIRST TIME", "date": "2024-07-18 14:00", "url": "https://www.marketscreener.com/quote/stock/ASELSAN-ELEKTRONIK-SANAYI-6500522/news/ASELSAN-Elektronik-Sanayi-ve-Ticaret-Anonim-Sirketi-AT-FARNBOROUGH-FOR-THE-FIRST-TIME-47413705/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "ASELSAN will assert its ambition in the aerospace technologies by taking part in the Farnborough International Airshow for the first time.\nThe company will showcase its state-of-the-art solutions including air radar, communication, electro-optical and electronic warfare systems.\nElectro-optical reconnaissance, surveillance and targeting systems, radar systems, guided munitions, integrated avionics systems, communication radios, and electronic warfare systems for military and civilian air platforms will be among the displayed systems.\nASELSAN will also display TOLUN Guided Munition, capable of simultaneous strikes on multiple targets, and SKYDOME Air Defence System, providing robust protection against diverse airborne threats.\nWe will be debuting our latest avionic systems, air radars, anti-drone systems, guided munitions, air communication technologies, air defence systems, and airborne electro-optical solutions.", "location": "Farnborough International Airshow", "classification": "security", "score": 0.5026982182277142, "event_breakdown": "Here are the current security events that can be placed on a map:\n1. ASELSAN will assert its ambition in the aerospace technologies by taking part in the Farnborough International Airshow for the first time.\n2. ASELSAN will also display TOLUN Guided Munition, capable of simultaneous strikes on multiple targets, and SKYDOME Air Defence System, providing robust protection against diverse airborne threats."}, {"id": "e3d1a0a6-34c3-4aef-9d6a-8f89d1df1be2", "title": "Israel Response to Terror by Nils A . Haug", "date": "2024-07-18 11:15", "url": "https://www.ruthfullyyours.com/2024/07/18/israels-response-to-terror-by-nils-a-haug/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "These constraints can only compromise Israel’s freedom to respond as necessary in a fluid, real-time, permanently hostile environment.\nThis issue, one of “proportionality,” has led to significant complications for Israel in its response to terror.\nGenocide clearly has never been Israel’s agenda — which, to the contrary, cannot be said of Hamas, Iran and other allied jihadists.\nMany Western leaders who have significant Islamic populations in their midst might believe it in their political self-interest to criticize Israel’s response despite any validity.\nWith resolve, courage, and dedication, but, alas, with much more sacrifice, Israel will show the way.”Nils A. Haug is an author and columnist.", "location": "Based on the context provided, I was unable to determine a specific location for the main event described.", "classification": "security", "score": 0.5154599509451092, "event_breakdown": "1. Israel’s new defense aid package has reached $3.8 billion, the Knesset’s powerful Foreign Affairs and Defense Committee was told Tuesday, after the meeting was opened to the public to make details of the agreement public. \n2. Israel and Morocco signed a defense protocol agreement on Monday during a visit to Rabat by minister Moshe Ya’alon that the Palestinian Authority described as “a dagger in the back of the Palestinians”. \n3. Ethiopia launched its first satellite into space on Friday from its soil, a significant step for the poverty-wracked East African nation to become the fourth in Africa to master that technology. \n4. Biden Last Friday, nearly 1,900 farm animals died at a farm outside Holon, with media reports mourning “the largest animal poisoning” in the country’s history. \n5. Palmachim Air Force Base Israel’s air force central command declared on Tuesday a major breakthrough in upgrading its airborne electronic warfare systems, allowing it to either jam enemy radar signals or pretend to be a friendly aircraft in radar images."}, {"id": "d2396c64-03c4-49fc-965c-81d1e001cfd4", "title": "U . S . Army honors Nisei combat unit that helped liberate Tuscany from Nazi - Fascist forces in WWII | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-07-18 08:15", "url": "https://www.asahi.com/ajw/articles/15351397", "domain": "asahi.com", "domain_classification": "Unknown", "message": "Michael A. Rosado, as they attend a commemoration at the U.S. military base of Camp Darby, Tuscany, central Italy, July 11, 2024.\nHenry Sakato was in the 100th Battalion, Company B that helped liberate Tuscany from Nazi-Fascist rule.\nThe Nisei commemoration at Camp Darby was held one week before the 80th anniversary of the liberation of Livorno, or Leghorn, on July 19, 1944.\nIn front of family members, military officials and civilians, Yoko Sakato placed flowers at the monument in memory of Pvt.\nHer cousin Leslie Sakato’s father fought in France and won a Medal of Honor for his service.", "location": "TUSCANY", "classification": "security", "score": 0.9821033419670733, "event_breakdown": "July 11, 2024: Nisei service members and their families attended a commemoration at the U.S. military base of Camp Darby, Tuscany, central Italy. The was organized one week before the 80th anniversary of the liberation of Livorno on July 19, 1944."}, {"id": "5097018f-3d68-48b7-be06-3cd2552bdfde", "title": "Fierce encounter with Maoists in Saranda , forces recover firearms", "date": "2024-07-18 10:45", "url": "https://www.nyoooz.com/news/ranchi/1723526/fierce-encounter-with-maoists-in-saranda-forces-recover-firearms/", "domain": "nyoooz.com", "domain_classification": "Unknown", "message": "After a brief lull, the West Singhbhum district witnessed a fierce encounter between police, paramilitary forces, and a Naxal squad in the dense Saranda jungle on Wednesday.\nÂ According to initial reports, the paramilitary forces were conducting a routine patrol when they encountered the Naxal squad deep within the Saranda jungle.\nWe are glad that the security forces are taking action against the Naxals, but we also fear for our safety.\nÂ The encounter in Saranda is part of a broader strategy by the government to combat Naxalism in the region.\nSecurity forces have been intensifying operations, conducting regular patrols, and setting up new camps to curb the movement and influence of Naxal groups.", "location": "Saranda jungle", "classification": "security", "score": 0.7694198435833146, "event_breakdown": "Security forces intensify operations in Jharkhand's West Singhbhum, set up new camps"}, {"id": "b0cce7ff-a984-4fcd-9313-979bdd3bd6b1", "title": "Palinfo : Untold toll of home destruction in Gaza – International Shia News Agency", "date": "2024-07-18 14:30", "url": "https://en.shafaqna.com/376333/palinfo-untold-toll-of-home-destruction-in-gaza/", "domain": "en.shafaqna.com", "domain_classification": "Unknown", "message": "Shafaqna English- Israel has systematically pursued the destruction of houses in the Gaza Strip, demolishing hundreds of thousands of residential units completely, turning their owners and residents into homeless living in tents and shelters.\nIn Gaza, where daily life is a battle for survival, the stories of citizens who have lost their homes in the genocide war waged by the Israeli army, serve as a mirror reflecting the suffering of an entire people.\nAhmed’s family was living in peace until that fateful night.\nAhmed, the head of the household, says, “Night had fallen, and suddenly we heard a huge explosion.\nThen the remaining neighbors in the area started calling for the area to be evacuated due to a threat to blow up the residential tower across from my house.”Sources: Palestinian Information Centerwww.shafaqna.com", "location": "GAZA", "classification": "security", "score": 0.8224648187545567, "event_breakdown": "Israel's systematic demolition of houses in the Gaza Strip, causing hundreds of thousands of residents to become homeless, turning them into living in tents and shelters. Life in Gaza is now a battle for survival. Ahmed's family lived in peace until that fateful night, when Israeli army waged genocide war against Palestinian. This event is reported to have taken place in the Gaza Strip."}, {"id": "c06f4b64-4f64-49cf-8414-0cf0c6db6e1c", "title": "Ukraine Says Still Fighting on Dnipro River Left Bank", "date": "2024-07-18 12:45", "url": "https://www.kyivpost.com/post/36017", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukraine said Thursday its defensive positions around the village of Krynky on the left bank of the Dnipro river in the southern Kherson region had been destroyed but that it was continuing operations there.\n\"Ukraine's defence forces are continuing to carry out combat missions on the left bank of the Dnipro river, including in the Krynky area,\" military spokesman Dmytro Lykhoviy said on state television.\n\"Besides Krynky, we have other bridgeheads, and combat work on the left bank of the Dnipro river is continuing.\"\nOther Topics of Interest British Defence Intelligence Update Ukraine 18 July 2024 Latest from the British Defence Intelligence.\nThe Kremlin claimed in late 2022 to have annexed all of Kherson and its forces on the opposing bank of the Dnipro river have continued to shell the city.", "location": "KRYNKYI", "classification": "security", "score": 0.8667981644617143, "event_breakdown": "Ukraine's defence forces are continuing to carry out combat missions on the left bank of the Dnipro river, including in the Krynky area. Ukraine's defensive positions around the village of Krynky were destroyed, but Kyiv is continuing operations there. The Kremlin claimed in late 2022 to have annexed all of Kherson and its forces on the opposing bank of the Dnipro river have continued to shell the city."}, {"id": "3690a1e4-13e7-4dc5-b66e-647312730ecb", "title": "US military shuts down problematic Gaza aid pier , shifts to Israeli port", "date": "2024-07-18 07:45", "url": "https://www.aljazeera.com/news/2024/7/18/us-military-shuts-down-problematic-gaza-aid-pier-shifts-to-israeli-port", "domain": "aljazeera.com", "domain_classification": "International", "message": "After operating for fewer than 25 days, the US-built Gaza aid pier will be dismantled, marking the end of a costly mission marked by recurring weather and security challenges.\nThe United States military has said its mission to install and operate a temporary, floating pier off the coast of Gaza to bring humanitarian aid to Palestinians has ended.\nSo there’s no more need to use the pier,” Cooper said, adding that aid intended for Gaza would now be shipped through Israel’s Port of Ashdod.\nAid groups had criticised the 370-metre (1,200-foot) floating structure as a costly distraction, saying the US should have concentrated on pressuring Israel to allow more aid through Gaza’s land borders.\nGaza’s pier, a political stunt?", "location": "GAZA", "classification": "security", "score": 0.5942318064524176, "event_breakdown": ". The mission, however, operated for fewer than 25 days, a total of 12 times, with the last about 10 days ago. US Centres for Disease Control and Prevention (CDC) staff examined the payload. Israeli ships escorted the US vessel the Notes. USAID donated the pier’s materials. The Israeli military assisted the direct receipt and delivery of aid after Gaza-based terrorists fired on earlier Israel-bound aid ships, hitting one with a missile. For aiding Israel against Hamas in Gaza, the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which operates many UNWRA schools and hospitals, provides refugee assistance and is slated to be de-funded, even before President Donald Trump announced his plan to cut US funding to the UN agency."}, {"id": "3d7b66a7-4b47-4b56-a6e1-cfab703b86b3", "title": "Doda attack : Jaish suspects infiltrated six months ago ,  stayed off grid  in Jammu | India News", "date": "2024-07-18 00:15", "url": "https://indianexpress.com/article/india/doda-attack-jaish-suspects-infiltrated-six-months-ago-stayed-off-grid-in-jammu-9459987/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "J&K L-G Manoj Sinha pays tribute to the Army personnel in Jammu, Tuesday.\nBut the recent attacks have moved deeper into regions such as Doda, Kathua and Reasi.\nA security personnel stands guard during an anti-terror operation in Doda district of Jammu and Kashmir, Tuesday, July 16, 2024.\nIn the recent Doda attack too, five Army personnel were killed during a search operation following an intelligence input.\n(PTI Photo) Security personnel during an anti-terror operation in Doda district of Jammu and Kashmir, Tuesday, July 16, 2024.", "location": "Doda", "classification": "security", "score": 0.9111580745241175, "event_breakdown": "J&K L-G Manoj Sinha pays tribute to Army personnel in Jammu, Tuesday. Five Army personnel were killed in Doda, Kathua and Reasi. A security personnel stands guard in Doda during an anti-terror operation."}, {"id": "484a6951-22dd-41b5-897c-8cab905ac610", "title": "Shiite Muslims in Lebanon commemorate Ashoura as border tensions rise", "date": "2024-07-18 13:30", "url": "https://www.naharnet.com/stories/en/306631-shiite-muslims-in-lebanon-commemorate-ashoura-as-border-tensions-rise", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "In the Shiite community, Ashoura is viewed as a symbol of struggle against injustice and tyranny.\nClerics recount the story of his death as Shiite Muslims cry and beat their chests.\nNasrallah previously said that Hezbollah wouldn't hold Ashoura processions in southern Lebanon because of the ongoing clashes.\nIn a televised address to commemorate Ashoura Wednesday, Nasrallah warned the Israeli military against targeting civilians in Lebanon, saying the group will target new Israeli towns and villages otherwise.\n\"If your tanks came to Lebanon and southern Lebanon ... you won't have any left.\"", "location": "Lebanon", "classification": "security", "score": 0.9769827843596237, "event_breakdown": "1. Nasrallah warns Israeli military against targeting civilians in Lebanon, saying the group will target new Israeli towns and villages otherwise. (For location, consider targeting the same geographical area mentioned in the first sentence.)"}, {"id": "9d568275-39e6-4520-a229-ac4368bc1197", "title": "Mum killed neighbour , 11 , using  chemical warfare  gas to wipe out bedbugs", "date": "2024-07-18 13:00", "url": "https://www.walesonline.co.uk/news/uk-news/mum-killed-neighbour-11-using-29566707", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "More infoA woman has been spared jail for accidentally killing her 11-year-old neighbour on her birthday with poisonous gas she used to exterminate bedbugs.\nThe substance reacted with moisture creating the poisonous gas phosphine, likened to chemical warfare agents.\nOld Bailey Judge Alexia Durran noted there had been a problem with bedbugs in the defendant’s block of flats.\nThe sentence I impose will not bring Fatiha back and will seem inadequate to Fatiha’s family.\"\nShe apologised to Fatiha’s family who had “paid the price” for her actions.", "location": "LONDON", "classification": "security", "score": 0.8000216704681309, "event_breakdown": "Target event for prompt above:\nA woman has been spared jail for accidentally killing her 11-year-old neighbor on her birthday with poisonous gas she used to exterminate bedbugs. The substance reacted with moisture creating the poisonous gas phosphine, likened to chemical warfare agents.\nNew event:\nA woman has been spared jail for accidentally killing her 11-year-old neighbor on her birthday with poisonous gas she used to exterminate bedbugs. The substance reacted with moisture creating the poisonous gas phosphine, likened to chemical warfare agents."}, {"id": "dfc1c18a-797f-4cc1-9ec1-74501fab0334", "title": "The Eagle Soars Again : F - 15EX Achieves Initial Operational Capability", "date": "2024-07-18 12:45", "url": "https://sofrep.com/news/f-15ex-initial-operational-capability/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "But the real showstopper lies in the heart of the Eagle II – the advanced APG-82 AESA radar .\nThis next-generation sensor grants the F-15EX unmatched situational awareness and long-range target detection, ensuring enemies remain exposed on the battlefield.\nF-15EX: A Modernized LegacyThe F-15EX isn’t a complete departure from its lineage.\nThis next-generation sensor grants the F-15EX unmatched situational awareness and long-range target detection, ensuring enemies remain exposed on the battlefield.\nThis “Eagle” isn’t just back – it’s ready to soar higher and strike harder than ever before.", "location": "NULL.)\nNULL.", "classification": "security", "score": 0.40614337857856214, "event_breakdown": "New F-15EX fighter aircraft equipped with advanced radar technology\nThe pilot ejected safely."}]