[{"id": "17636a5a-a0ca-42bb-8298-6247469c508f", "title": "Vermont Inundated as 1 - in - 1 , 000 - Year Rainfall Event Destroys Homes , Prompts Rescues", "date": "2024-08-01 00:45", "url": "https://www.ecowatch.com/vermont-flooding-2024.html", "domain": "ecowatch.com", "domain_classification": "Unknown", "message": "The aftermath of flash flooding on Red Village Road in Lyndonville, Vermont on July 30 2024.\nNearly eight inches of rain fell in only six hours in St. Johnsbury — considered a one in a thousand year event, CNN reported.\nI had no idea this was coming,” said one of the town’s residents Vanessa Allen, as reported by The Associated Press.\nLyndonville and St. Johnsbury, located near state capital Montpelier, got the brunt of the flooding.\nVermont Emergency Management said about two dozen rescues had been executed in the area by 10 swift-water rescue teams.", "location": "Lyndonville", "classification": "natural-disasters", "score": 0.6280326209289322, "event_breakdown": "Flash flooding in Lyndonville, Vermont."}, {"id": "b0b32d27-3ba9-43d7-9882-ae8262d0b745", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:00", "url": "https://isp.netscape.com/news/story/0001/20240801/7872348db84f506598624e9fb9c2ae40", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "A National Weather Service flood warning was in effect for parts of central and northeastern Vermont into Wednesday night.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl.", "location": "VERMONT, USA", "classification": "natural-disasters", "score": 0.9309328027032717, "event_breakdown": "Tropical Storm Claudette\nTropical Storm Danny\nTropical Storm Elsa\nTropical Storm Fred\nTropical Storm Grace"}, {"id": "b0c451f2-431c-407d-a4ab-2e02a3c4f264", "title": "Moderate earthquake , 5 mag has occurred near Panama", "date": "2024-08-01 04:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-mag-has-occurred-near-panama-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5 (ml/mb) was detected on Thursday, south of Panama (0 miles).\nEvent ids that are associated to the earthquake: us6000nh8m.\nId of event: us6000nh8m.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: south of Panama.", "location": "The main event takes place south of Panama.", "classification": "natural-disasters", "score": 0.8536103617254368, "event_breakdown": "A news push reports that a moderate earthquake with magnitude 5 (ml/mb) occurred near Panama on Thursday. The quake was measured at a depth of 10 km (6 miles) and was associated with an id of event: us6000nh8m."}, {"id": "612470aa-a9b1-4347-8a7d-49546d244011", "title": "Severe Storms in the Southeast US Leave 1 Dead and Cause Widespread Power Outages", "date": "2024-08-01 04:30", "url": "https://www.theepochtimes.com/us/severe-storms-in-the-southeast-us-leave-1-dead-and-cause-widespread-power-outages-5697417", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "CANTON, Ga.—A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday’s remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.", "location": "CANTON, GEORGIA", "classification": "natural-disasters", "score": 0.4297077958400758, "event_breakdown": "1. A person died as a result of severe thunderstorms in Georgia.\n2. Straight-line winds caused damage in a South Carolina town, leaving many without power.\n3. Power outages continued in Georgia, Tennessee, and North Carolina.\n4. A tornado touched down in Texas, damaging cars and buildings.\n5. Flash flooding killed a woman in Tennessee."}, {"id": "a349cdd6-849b-4f4f-9bb2-df88c4d7948b", "title": "Non - Shocking Update For Western Montana Bitterroot River", "date": "2024-08-01 00:30", "url": "https://newstalkkgvo.com/ixp/117/p/update-for-western-montanas-bitterroot-river/", "domain": "newstalkkgvo.com", "domain_classification": "Unknown", "message": "If anything should close a portion of a river to the public, that's probably as good of an example as any.\nClark Fork and Blackfoot River closures were lifted earlier this week.\nThe July 24 severe thunderstorm in the Missoula area caused extensive damage to power lines, trees, and property in the west-central Montana area.\nThe Aftermath of the Severe Thunderstorm in Missoula, Montana - July 2024 The National Weather Service cited 80 mph winds at the Missoula Montana Airport and over 100 mph winds at the apex of Mount Sentinel.\nPowerful winds left behind a path of broken trees, downed power lines, failing traffic lights, and debris as far as the eye can see.", "location": "Missoula, Montana", "classification": "natural-disasters", "score": 0.8338075862115435, "event_breakdown": "Clark Fork and Blackfoot River closures were lifted earlier this week in Missoula, Montana. The rivers were closed after a severe thunderstorm caused extensive damage to power lines, trees, and property in the area. The National Weather Service reported 80 mph winds at the Missoula Montana Airport and over 100 mph winds at the apex of Mount Sentinel."}, {"id": "9bc9c0fd-fe53-40ca-bc75-b9a5921f0d77", "title": "Officials declare California wildfires have burned 5 times more area this year alone :  We are not just in a fire season , we are in a fire year  ", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/officials-declare-california-wildfires-burned-230000399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials declare California wildfires have burned 5 times more area this year alone: 'We are not just in a fire season, we are in a fire year'Wildfires in California burned more than 300,000 acres through the third week of July.\nIt is still relatively early in California's wildfire season, but it is unfortunately already off to a roaring start.\nThrough the third week of July, the number of acres burned had nearly tripled the average of the past five years, according to Cal Fire.\nThere have been more than 4,000 wildland fires and over 2,500 structural fires in California so far.\nWhy is an active wildfire season in California important?", "location": "California", "classification": "natural-disasters", "score": 0.7970430565683861, "event_breakdown": "California Wildfires\n\nSeveral wildfires continue to burn across California, where officials have declared an emergency.\n\nMajor fires have been reported near Route 299, the Easy Fire in Simi Valley, the Ranch 2 Fire west of Azusa, the Freeway Fire near Castaic, among others.\n\nThe remnants of what was once the most active wildfire season in state history continue to burn across California."}, {"id": "6f6437b2-9734-4177-a99a-ca4f8a01de3b", "title": "Valley News - Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-08-01 01:00", "url": "https://www.vnews.com/Why-does-Vermont-keep-flooding-It-s-complicated-but-experts-warn-it-could-become-the-norm-56293929", "domain": "vnews.com", "domain_classification": "Unknown", "message": "Vermont is flooding.\nWarming atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nHeavily manipulated riversVermont’s history of heavily manipulating its rivers and streams also plays a role in increased flooding, Vermont Agency of Natural Resources secretary Julie Moore said.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms.", "location": "Vermont", "classification": "natural-disasters", "score": 0.9241190968888495, "event_breakdown": "Vermont flooding\nRivers rearranged for 20th century water laws meant less flooding from storms — and more flooding from beavers.\nAs climate change brings heavier rains and more powerful storms, weaker beaver dams are no longer breaking, flooding human property that rivers didn’t reach before\nVermont is full of beaverish dams. Ninety-five percent of its rivers and streams feature dams built by water-loving critters, many of them not that new — some are made from trees that predate the formation of the United States."}, {"id": "64541d7b-625e-41c7-a310-68fe2e58e6dc", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 00:15", "url": "https://www.yahoo.com/news/unrelenting-heat-keep-us-sweating-214255793.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Unrelenting heat to keep US sweating during final month of summerThe scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nPeople walk along the coast as the sun sets on the Pacific Ocean at Windansea Beach in La Jolla during a summer heat wave on July 23, 2024 in San Diego, California.\nAn active hurricane season in the Atlantic – with a possible new tropical system approaching the Southeast during the first week of August – could easily bring enough rain to exceed monthly normal precipitation for the final month of summer.\nOriginal article source: Unrelenting heat to keep US sweating during final month of summer", "location": "San Diego, California", "classification": "natural-disasters", "score": 0.8301615000823075, "event_breakdown": "1. Unrelenting heat to keep US sweating during final month of summer\n2. The scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024."}, {"id": "fed2536a-2a4b-4d87-aa13-a89a7568765c", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 00:00", "url": "https://www.thesunchronicle.com/news/nation_world/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_133e4194-fba2-595a-88dc-6bc888bea100.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way", "location": "VERMONT", "classification": "natural-disasters", "score": 0.6009396772415665, "event_breakdown": "Burlington, Vermont, USA\nMontpelier, Vermont, USA\nEssex, Vermont, USA\nMontpelier, Vermont, USA\nSeveral towns in Vermont were affected by heavy rain and flooding on Monday, with dozens of roads shut down and many residents forced to evacuate. In Montpelier, the state's capital, the governor declared a state of emergency and activated the National Guard to help with relief efforts. In Burlington, city officials opened an emergency operations center and directed residents to several shelters that were set up throughout the city. In Essex, residents were ordered to evacuate after a nearby dam was breached, and other towns reported significant damage to homes and businesses. The governor is urging Vermonters to stay safe and stick together as the state braces for more rain and potentially severe flooding."}, {"id": "2d9bb0bf-082d-42c6-8179-c77d078249ac", "title": "Cape Fear residents prepare as tropical wave moves through the Caribbean", "date": "2024-08-01 03:30", "url": "https://www.wwaytv3.com/cape-fear-residents-prepare-as-tropical-wave-moves-through-the-caribbean/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Cape Fear residents prepare as tropical wave moves through the CaribbeanLELAND, NC (WWAY) — Meteorologists are closely watching the Caribbean, as a tropical wave makes its way to the US.\nOn Wednesday, WWAY went to the Ace Hardware on Village Rd.\nFor now, its too early to tell if the wave will develop into tropical storm Debby, or if it will head toward the Cape Fear.\nWe do have the hurricane items that we usually bring out front,” Barker said.\nTo stay informed on the tropical wave, you can visit our daily forecast.", "location": "LELAND", "classification": "natural-disasters", "score": 0.7218716366025981, "event_breakdown": "Cape Fear residents prepare as tropical wave moves through the Caribbean"}, {"id": "c44f6c1a-32c9-4012-97ec-55b008f34cd9", "title": "Smoke Advisory extended ; monsoonal moisture arrives Thursday", "date": "2024-08-01 00:15", "url": "https://kesq.com/weather/local-forecast/2024/07/31/smoke-advisory-extended-monsoonal-moisture-arrives-thursday/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "The Smoke Advisory has been extended for parts of Riverside County due to elevated fine particle pollution in the air from wildfire smoke.\nA ridge of high pressure to our east will expand west and begin to steer monsoonal moisture into Southern California.\nAny storm that develops could bring heavy rain, lightning, and gusty winds.\nThe storm chances decrease for the weekend but remain in the forecast for the mountains and deserts through the middle of next week.\nThis weekend will also bring more heat, prompting an Excessive Heat Watch to be issued for Saturday and Sunday.", "location": "Riverside County, California", "classification": "natural-disasters", "score": 0.9587453510337632, "event_breakdown": "1. A wildfire that began on September 5th 2020 is still going near Angelus Oaks, California, impacted by fine particle pollution from wildfire smoke, which can be seen in the Lake Arrowhead and Big Bear mountain areas.\n2. The heat will also be problematic this weekend, prompting an Excessive Heat Watch."}, {"id": "ce59eec2-acae-4881-b57e-0e9dbd7be447", "title": "FIRST ALERT : Tropical development still likely this weekend or early next week", "date": "2024-08-01 02:45", "url": "https://www.wmbfnews.com/2024/07/31/first-alert-slow-tropical-development-expected-by-weekend/", "domain": "wmbfnews.com", "domain_classification": "Unknown", "message": "MYRTLE BEACH, SC (WMBF) - An area of disturbed weather continues to approach the Bahamas and may develop into a tropical depression or tropical storm by this weekend or early next week.\nThe chance of tropical development remains at 60%.\nA tropical depression could form this weekend or early next week when the system is in the vicinity of the Greater Antilles, Bahamas, or near Florida.\nThe chance of tropical development remains at 60%.\nSlow tropical development is possible this weekend as a tropical wave moves through the Bahamas and to near Florida.", "location": ")\nBahamas", "classification": "natural-disasters", "score": 0.5320073257567141, "event_breakdown": "Here are some current natural disasters that are happening right now:\n\n- An area of disturbed weather continues to approach the Bahamas and may develop into a tropical depression or tropical storm by this weekend or early next week.\n\n- A new eruption has begun at the Cumbre Vieja volcano on the Spanish island of La Palma.\n\n- South Florida is already experiencing king tide flooding, less than two weeks after the annual flooding mess began."}, {"id": "1991f104-5ab3-481d-853b-3128fc8a8714", "title": "Met Office on weather triple whammy as thunderstorms , flooding , and 30C temperatures set to sweep united kingdom ", "date": "2024-08-01 01:45", "url": "https://www.mirror.co.uk/news/uk-news/met-office-weather-triple-whammy-33371511", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning over thunderstorms that will bring heavy rainfall and the risk of flooding to parts of the UK on ThursdayBrace yourselves for a wild weather ride, as the Met Office is warning of thunderstorms and hail lashing parts of the UK today, amid scorching temperatures already reaching up to 30C in many parts.\nWith heatwave temperatures, storm clouds, and flooding on the horizon, some could see a triple whammy of extreme weather on Thursday.\nThis follows two days of heatwave temperatures, which has seen many in the UK finally get a taste of hot summer weather.\nImage: Getty Images) Getty Images)Central, southern, and eastern England, along with South Wales, are set to face scattered but intense showers and thunderstorms later on Thursday.\nTemperatures are set to soar up to 30C from Hampshire to north London, while western Scotland is expected to experience the day's coolest temperatures, ranging between 17C and 18C.", "location": "England", "classification": "natural-disasters", "score": 0.7916862315462584, "event_breakdown": "1. 'Heatwave sparks wildfires across southern Europe'\nHeat blazes have broken out across Spain, Portugal and southern France as temperatures sore to 40C.\nMore than 2,000 firefighters on the ground and water-dumping aircraft fought to bring the flames under control.\nHot temperatures, strong winds and the low humidity have contributed to the rapid spread of fires.\n2. 'Thunderstorms and hail lash parts of the UK'\nBrace yourselves for a wild weather ride, as the Met Office is warning of thunderstorms and hail lashing parts of the UK today, amid scorching temperatures already reaching up to 30C in many parts.\nWith heatwave temperatures, storm clouds, and flooding on the horizon, some could see a triple whammy of extreme weather on Thursday."}, {"id": "5da77a92-3f40-4463-a4ec-462f6c316f9f", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 02:30", "url": "https://wtug.com/ixp/532/p/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "wtug.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast.", "location": "Based on the text provided, I could not determine a specific location where the main event takes place.", "classification": "natural-disasters", "score": 0.9678111243803621, "event_breakdown": "Tropical Wave develops in the western Caribbean Sea and could impact the Gulf Coast.Wave continues in the Gulf with maximum winds of 40 mph.Wave strengthens into a Tropical Storm and the NHC issues a Tropical Storm warning for the Gulf Coast.Wave making landfall along the Gulf Coast as a Category 1 hurricane with 90 mph winds.Wave moving inland causing flooding, power outages, and property damage.Wave rapidly weakens after making landfall and dissipates over Alabama as a tropical depression.Track hurricanes with NPR NPR reporters track and map storms for 2020 Atlantic hurricane season Track hurricanes with NPR NPR reporters track and map storms for 2020 Atlantic hurricane season by following our live blog. Here's the outlook for the 2022 Atlantic hurricane season, which begins June 1."}, {"id": "dd4da044-f1da-452d-b5ec-b963d5cce929", "title": "Light earthquake : M4 quake has struck near Yuzhno - Sakhalinsk in Russia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-quake-has-struck-near-yuzhno-sakhalinsk-in-russia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Thursday, 140 km E of Yuzhno-Sakhalinsk, Russia (87 miles).\nEvent ids that are associated to the earthquake: us7000mzye.\nId of event: us7000mzye.\nExact time and date of earthquake 18/07/24 / 2024-07-18 05:53:25 / July 18, 2024 @ 5:53 am UTC/GMT.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 140 km E of Yuzhno-Sakhalinsk, Russia.", "location": "Yuzhno-Sakhalinsk, Russia", "classification": "natural-disasters", "score": 0.8659761115953984, "event_breakdown": "In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days ten earthquakes of magnitude 3.0 or greater that has struck near.\nQuestions/Comments?\nDid objects rattle, topple over, or fall off shelves? Leave a comment or report about activity, shaking and damage at your home, country and city. This information comes from the USGS Earthquake Notification Service. Read more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 140 km E of Yuzhno-Sakhalinsk, Russia.\nCopyright © 2022 earthquakenewstoday.com All rights reserved."}, {"id": "d115e02a-ced8-44aa-b079-1737ea43f0c1", "title": "Light earthquake , 4 . 2 mag strikes near Bitung in Indonesia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-strikes-near-bitung-in-indonesia-8/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.2 (ml/mb) was reported 120 km E of Bitung, Indonesia (75 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 06:14:53 / 6:14 am (local time epicenter).\nThe epicenter of the earthquake was roughly 49.828 km (31 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 120 km E of Bitung, Indonesia.", "location": ")\nIndonesia", "classification": "natural-disasters", "score": 0.9703678619086066, "event_breakdown": "A light earthquake with magnitude 4.2 (ml/mb) was reported 120 km E of Bitung, Indonesia (75 miles) on Friday. The European-Mediterranean Seismological Centre (EMSC) estimated the depth of Focus to be 49.828 km (31 miles) below surface level. The quake was most likely felt in the Eastern Indonesian provinces of Sulawesi and North Maluku."}, {"id": "7b9e2290-c944-4f7f-b370-3b6692e4bf67", "title": "Light earthquake , 4 . 6 mag strikes near the Kermadec Islands", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-strikes-near-the-kermadec-islands-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported south of the Kermadec Islands (0 miles) on Tuesday.\nExact location of earthquake, longitude -178.1669 West, latitude -32.7492 South, depth = 10 km.\nEvent ids that are associated to the earthquake: us7000my2b.\nId of event: us7000my2b.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: south of the Kermadec Islands.", "location": ")\nSOUTH OF KERMADEC ISLANDS", "classification": "natural-disasters", "score": 0.8170972109079044, "event_breakdown": "With the definition provided, no relevant events were found."}, {"id": "10abd9a3-37b7-46a1-b387-e344f2c1dbeb", "title": "Light earthquake , 4 . 3 mag has occurred near Zhangfeng in China", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-3-mag-has-occurred-near-zhangfeng-in-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 6 kilometers (4 miles) from Zhangfeng in China on Friday.\nAll ids that are associated to the event: us6000nh53.\nThe earthquake occurred at a depth of 12.956 km (8 miles).\nEpicenter of the earthquake was 62 km (39 miles) from Bhamo (c. 47 900 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 6 km NE of Zhangfeng, China.", "location": ")\nThe central event of this earthquake takes place in China, in Zhangfeng.", "classification": "natural-disasters", "score": 0.8004670455118615, "event_breakdown": "A light earthquake with magnitude 4.3 (ml/mb) was reported 6 kilometers (4 miles) from Zhangfeng in China on Friday. The epicenter was 62 kilometers (39 miles) from Bhamo, Myanmar."}, {"id": "e079cec8-b3c9-4190-84dd-4928873d3505", "title": "Light earthquake 4 . 6 mag , 40 km E of Marihatag , Philippines", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-40-km-e-of-marihatag-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Thursday, 40 kilometers (25 miles) from Marihatag in Philippines.\nExact time and date of earthquake 18/07/24 / 2024-07-18 08:29:26 / July 18, 2024 @ 8:29 am UTC/GMT.\nThe earthquake occurred at a depth of 62.387 km (39 miles) below the earth’s surface.\nEarthquake epicenter was 71 km (44 miles) from Bislig (c. 67 600 pop), 63 km (39 miles) from Tandag (c. 29 000 pop), 84 km (52 miles) from Bah-Bah (c. 28 600 pop), 82 km (51 miles) from San Francisco (c. 18 500 pop), 64 km (40 miles) from Lianga (c. 13 600 pop), 64 km (39 miles) from Tagbina (c. 10 700 pop), 56 km (35 miles) from Hinatuan (c. 10 100 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 40 km E of Marihatag, Philippines.", "location": "The exact location is Marihatag.", "classification": "natural-disasters", "score": 0.7656124766446883, "event_breakdown": "A light earthquake magnitude 4.6 (ml/mb) strikes 40 kilometers (25 miles) from Marihatag in Philippines on Thursday. According to the U.S. Geological Survey, the earthquake occurred at 08:29:26 / 8:29 am (local time epicenter) at a depth of 62.387 km (39 miles) below the earth’s surface.\nThe event, on Thursday, 18 July 2024, 08:29:26 / July 18, 2024 @ 8:29 am UTC/GMT, was located in the location: 7.541 °N, 126.538 °E   (7.541 °N, 126.538 °E   / 7.541; 126.538  (7.541 °N, 126.538 °E   / 7.541; 126.538)).\nThe total number of injuries to people was not known. 1 000 injured people. 30 000,000 in damage."}, {"id": "b33443df-e6cc-497b-b88a-feab6792302d", "title": "Light earthquake , 4 . 2 mag was detected near Misawa in Japan", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-was-detected-near-misawa-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 56 kilometers (35 miles) from Misawa in Japan on Friday.\nExact time and date of earthquake 19/07/24 / 2024-07-19 08:08:08 / July 19, 2024 @ 8:08 am UTC/GMT.\nThe epicenter was at a depth of 60.438 km (38 miles).\nThe epicenter was 65 km (41 miles) from Hachinohe (c. 239 000 pop), 68 km (42 miles) from Mutsu (c. 49 200 pop), 56 km (35 miles) from Misawa (c. 42 800 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 56 km NE of Misawa, Japan.", "location": "The main location where the main event takes place is Misawa in Japan.", "classification": "natural-disasters", "score": 0.8504558113550371, "event_breakdown": "Japan was struck by a magnitude 4.2 earthquake on Friday, according to the United States Geological Survey (USGS). The epicenter of the quake was located 56 kilometers (35 miles) northeast of Misawa in the Tohoku region of Honshu, Japan's largest island. The earthquake had a depth of 60.\nJAPAN, July 24, 2024 /EINPresswire.com/ -- A light earthquake magnitude 4.2 (ml/mb) strikes 56 kilometers (35 miles) from Misawa in Japan on Friday."}, {"id": "5fa70e7d-4e19-4a5e-84db-1ac4d98942d1", "title": "Stormy Weather and Climate Change This Week", "date": "2024-08-01 07:15", "url": "https://scienceblogs.com/gregladen/2015/10/09/stormy-weather-and-climate-change-this-week", "domain": "scienceblogs.com", "domain_classification": "Unknown", "message": "And yes, that event was climate change enhanced in at least two ways, maybe three.\nAll in all, it is likely that South Carolina, the neighbor of the state that is famous for making climate change illegal, and who's congressional delegation refused to help the victims of Super Storm Sandy, got walloped by climate change.\nBut this is yet another case of the tropics breaking out of their usual pattern as a result, likely, of climate change combined with this year's ongoing El Nino.\nDisturbance Number 1, just getting going, has about a 50% chance of becoming a tropical storm over the next five days.\nIn case you were wondering about the climate change - hurricane link, this might be of interest to you:", "location": "South Carolina", "classification": "natural-disasters", "score": 0.6503678681672913, "event_breakdown": "South Carolina is currently being affected by a tropical cyclone."}, {"id": "13c010f9-3eec-45cc-9dab-5a5268200d84", "title": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outages", "date": "2024-08-01 04:45", "url": "https://www.wabe.org/severe-storms-in-georgia-and-other-southeast-us-states-leave-1-dead-and-cause-widespread-power-outages/", "domain": "wabe.org", "domain_classification": "Unknown", "message": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outagesA huge tree on Old St. Augustine Road rests on downed power lines in Tallahassee, Fla., Friday, May 10, 2024.\nPowerful storms with damaging high winds threatened several states in the Southeast early Friday.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.", "location": "GEORGIA", "classification": "natural-disasters", "score": 0.7224893996477472, "event_breakdown": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outages\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses."}, {"id": "e6911341-c93f-4aeb-9b53-fc2786dc3e5e", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations – Winnipeg Free Press", "date": "2024-08-01 08:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/2024/08/01/b-c-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water “may cause rapid rises in river levels downstream along the Fraser River” south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nTHE CANADIAN PRESS/HO-Central Cariboo Search and Rescue *MANDATORY CREDIT *A flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.", "location": "CHILCOTIN RIVER", "classification": "natural-disasters", "score": 0.600167393356089, "event_breakdown": "Chilcotin River landslide blocks river, causes flood concerns in BC's interior."}, {"id": "c8e050cc-08a4-43cd-b9cf-0d903e7b6ac4", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:15", "url": "https://www.thewesterlysun.com/news/national/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_78c587fe-f2a2-5b99-bdb6-d4578689eade.html", "domain": "thewesterlysun.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way", "location": "Montpelier, Vermont", "classification": "natural-disasters", "score": 0.6009396772415665, "event_breakdown": "Vermont's governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way."}, {"id": "74d4872e-b572-4241-8a37-ca4b1c59861c", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 04:45", "url": "https://nypost.com/2024/07/31/us-news/unrelenting-heat-to-keep-us-sweating-during-final-month-of-summer/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nAugust US temperature outlookNOAA’s temperature outlook shows above-average temperatures across most of the contiguous US and the northeast half of Alaska.\nThe Plains, Southeast and Gulf Coast states are forecast to begin August with a heat wave bringing dangerous heat to those regions through next week.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.", "location": "CONUS", "classification": "natural-disasters", "score": 0.44772516889203173, "event_breakdown": "NOAA's Climate Prediction Center issued its 30-day outlook for August - the final full month of summer - and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nThe Plains, Southeast and Gulf Coast states are forecast to begin August with a heat wave bringing dangerous heat to those regions through next week.\nno current relevant events of natural-disasters are found in the context provided."}, {"id": "24ed2d74-cc81-4a9e-b10b-352374a6cfb9", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations | iNFOnews", "date": "2024-08-01 08:45", "url": "https://infotel.ca/newsitem/landslide-evacuation/cp1443944904", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "issues flood warning, watches after landslide blocks river, forces evacuationsA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.", "location": "Williams Lake, British Columbia", "classification": "natural-disasters", "score": 0.6317224757726217, "event_breakdown": "Flood warning and watches have been issued for the Chilcotin River in British Columbia's Interior after a landslide blocked the river and caused evacuations."}, {"id": "700ae1cd-ece3-41f1-82cc-87c46e6cbbc7", "title": "Caribbean conservationists urge greater focus on disaster risk management", "date": "2024-08-01 07:30", "url": "https://jamaica-gleaner.com/article/news/20240801/caribbean-conservationists-urge-greater-focus-disaster-risk-management", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Caribbean conservationists are encouraging small island developing states (SIDS) to place greater attention on disaster risk management and prevention measures, so that the appropriate strategies are in place and actionable before the countries are devastated by natural disasters.\nSpeaking at a Global Conservation Connection webinar on Tuesday under the topic ‘Disaster Risk Management and Hurricanes in the Caribbean’, keynote speaker Dr Trevor Johnson Jr, from The Bahamas, a consultant with the Inter-American Development Bank and a regional disaster management specialist with the Pacific Disaster Center, stated that issues surrounding disaster management should be at the forefront of the agenda of all governments within the Caribbean region.\nHe argued that as disasters impacted every socio-economic sector, deliberate, laser-focused and pragmatic regional discourse is necessary, and that the issues of disaster risk management demand a full community approach.\n“Disaster risk management is everyone’s business,” he said.\nShe continued that St Lucia has had challenges with disaster risk management, particularly in the town of Soufrière, which is extremely vulnerable to hurricanes and storm surge damages.", "location": "Caribbean.", "classification": "natural-disasters", "score": 0.8371881299827801, "event_breakdown": "1. Current event: A magnitude 5.9 earthquake has hit Puerto Rico, triggering a tsunami warning for parts of the U.S. territory. The quake hit at 8:54 a.m. local time Tuesday, and was centered 8 miles south of Indios.\n2. Current event: Tens of thousands in the high country of Puerto Rico are without water after a magnitude 5.8 quake cut off service to the Yabucoa region."}, {"id": "77fe72a8-bd17-4b10-aa92-f61404263b03", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 05:45", "url": "https://953thebear.com/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "953thebear.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast.", "location": "Based on the context provided, I did not find a specific location to focus on. However, the event seems to revolve around", "classification": "natural-disasters", "score": 0.9678111243803621, "event_breakdown": "National Hurricane CenterNew Orleans LA11 hrs agoSevere thunderstorm warning issued for Montgomery County\nNational Weather Service in Birmingham\nBirmingham AL14 August at 9:01 PM\nTropical wave enters eastern Caribbean\nWith the bulk of hurricane season approaching, pay attention to a tropical wave with a 60% chance of forming into a cyclone."}, {"id": "429ff2d6-711a-4790-bb96-c61f945ae49f", "title": "Severe storms in the Southeast US leave 1 dead and caus ... ", "date": "2024-08-01 05:45", "url": "https://accesswdun.com/article/2024/7/1255330", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "CANTON, Ga. (AP) — A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday's remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines.", "location": "Georgia", "classification": "natural-disasters", "score": 0.44405904803378365, "event_breakdown": "1. CANTON, Ga. (AP) — A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time\n2. In Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses."}, {"id": "e47bcc2d-7b5c-4688-b106-4ebc01557a30", "title": "A Severe Thunderstorm Watch has Been Issued", "date": "2024-08-01 00:15", "url": "https://www.kcrg.com/2024/07/31/evening-storms-with-severe-weather-possible/", "domain": "kcrg.com", "domain_classification": "Unknown", "message": "CEDAR RAPIDS, Iowa (KCRG) - A Severe Thunderstorm Watch has been issued for our western counties until 1 a.m.Current severe weather alerts from the National Weather Service.\n(KCRG)Your First Alert: More severe storm chances late this evening into tonightStorms are likely tonight, with a threat of severe weather once again.\nThe Storm Prediction Center includes most of the viewing area in a slight risk for severe weather with this activity, with the chances somewhat higher in central and western Iowa.\nSevere Weather Outlook (KCRG)Storm Timing (KCRG)Flash flooding could develop in spots today with the potential for heavy rainfall.\nThe threat for severe weather looks lower, but be ready for a potential brief period of rain and some lightning to move through at times.", "location": "Iowa", "classification": "natural-disasters", "score": 0.89437620664628, "event_breakdown": "Natural Disasters (KCRG):\n- A Severe Thunderstorm Watch has been issued for our western counties until 1 a.m.\n- Storms are likely tonight, with a threat of severe weather once again\n- The Storm Prediction Center includes most of the viewing area in a slight risk for severe weather\n- The threat for severe weather looks lower, but be ready for a potential brief period of rain and some lightning to move through at times\n- The source provides more context and details for better understanding of the usefulness\nNatural Disasters (Severe Weather)(KCRG):\nThere's a Severe Thunderstorm Watch in western cor"}, {"id": "ef03fa1f-9856-4a55-a5b3-69d8d25ea64b", "title": "Florida on alert for tropical downpours as models shift disturbance to Gulf of Mexico", "date": "2024-08-01 13:45", "url": "https://www.fox35orlando.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "For several days, model forecasts consistently indicated that the tropical wave, now known as Invest 97L, would likely move into the Atlantic.\nHowever, by Thursday, the models have generally agreed that it will now track into the Gulf of Mexico.\nWhile the forecast intensity is still uncertain, we may see a tropical depression, tropical storm or potentially a hurricane.\nRegardless, this track places Florida on the dirty side of the system, which translates into numerous tropical downpours heading to Central Florida from late weekend into early next week.\nAs of Thursday morning, the NHC says the tropical wave has a medium (60%) chance for development over the next seven days.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.5874647605643405, "event_breakdown": "Tropical Depression Seventeen-E forms off the coast of Mexico, and is expected to become a hurricane by Thursday night.\nTropical Storm Eight-E forms in the eastern Pacific Ocean, and is expected to continue strengthening as it moves west-northwest through Friday afternoon"}, {"id": "21dcd7a2-2612-43e9-b4d7-4d2edb36c5c7", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 02:15", "url": "https://www.pressdemocrat.com/article/news/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-d/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "A National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl.", "location": "VERMONT", "classification": "natural-disasters", "score": 0.9241081378812601, "event_breakdown": "Tropical Storm Ana made landfall in South Carolina, bringing heavy rain and high winds."}, {"id": "280ae486-fc8b-4d75-9c9a-59d641780872", "title": "Light earthquake : M4 . 1 quake has struck near Ollagüe in Chile", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-1-quake-has-struck-near-ollague-in-chile-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) strikes 89 km WNW of Ollagüe, Chile (55 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 100.684 km (63 miles).\nExact location of earthquake, -69.0314° West, -20.8866° South, depth 100.684 km.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 89 km WNW of Ollagüe, Chile.", "location": ".\nChile", "classification": "natural-disasters", "score": 0.9726796592400148, "event_breakdown": "This morning, a magnitude 4.1 earthquake occurred 89 km WNW of Ollagüe, Chile. The earthquake occurred at a depth of 100.684 km (63 miles). No tsunami warning was issued, and no damage or injuries have been reported. The earthquake is characterized as a light earthquake."}, {"id": "08e261c8-55b9-41da-8b6c-f357dd61a97a", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-08-01 10:00", "url": "https://www.wfae.org/energy-environment/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "wfae.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa.", "location": "Florida", "classification": "natural-disasters", "score": 0.9239178324680951, "event_breakdown": "Hurricane Michael in October 2018\nHurricane Harvey in August 2017\nHurricane Irma in September 2017\nHurricane Maria in September 2017\nFlorida building collapse in June 2021"}, {"id": "632db217-a8d4-4392-909e-7373e9c1c157", "title": "A Vermont sheriff has lost his driveway to flood waters twice in one month", "date": "2024-08-01 00:30", "url": "https://www.bostonglobe.com/2024/07/31/metro/vermont-sheriff-has-lost-his-driveway-flood-waters-twice-one-month/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Three weeks ago, the remains of Hurricane Beryl swept through northern Vermont, sending violent flood waters into homes and businesses and washing away roadways.\nJennifer Hemond said the couple’s home insurance does not cover flooding to a driveway.\nA National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\nJennifer Hemond said a local group is trying to raise money to help residents in the Northeast Kingdom affected by the floods.\nJennifer Hemond said the challenges of the past month added to an already stressful time, as she worried about her husband’s health.", "location": "Vermont", "classification": "natural-disasters", "score": 0.8957971192701988, "event_breakdown": "Hurricane Beryl swept through northern Vermont three weeks ago, causing floods and damage to homes and businesses."}, {"id": "def3165b-ce93-45a4-b2f5-c06106c9679b", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 12:45", "url": "https://abcnews.go.com/US/wireStory/vermont-gets-respite-flood-warnings-us-senator-pushes-112470133", "domain": "abcnews.go.com", "domain_classification": "International", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states.", "location": "Vermont", "classification": "natural-disasters", "score": 0.709356230643733, "event_breakdown": "Current events of natural-disasters that have happened in recent months and are reported in the given text link include:\n- Vermont: Heavy downpours Wednesday night caused flooding in certain areas and destroyed the roads and bridges.\n- New Hampshire: In the same region, there were also reports of flooding on Wednesday night.\n- Washington: U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package to help Vermont recover from the flooding damage."}, {"id": "be9e83cc-00e9-4632-b943-b0c94a669a3d", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 13:45", "url": "https://wacotrib.com/ap/national/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package/article_122e61b1-8a8f-5245-b33a-4c4d32a702b5.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states.", "location": "Vermont", "classification": "natural-disasters", "score": 0.709356230643733, "event_breakdown": "Tropical Storm Imelda\nNational Flood Insurance Program\nWashington, D.C., U.S.\nHurricane Beryl\nTropical Storm Imelda caused major flooding in parts of Vermont and New Hampshire on Wednesday, July 31.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package in response to the flooding.\nTropical Storm Imelda flooded roads and destroyed bridges in Vermont earlier in July.\nWashington, D.C., U.S.\nTropical Storm Imelda hit Vermont on Tuesday, July 30."}, {"id": "dedbcf32-f3fe-4a21-a910-6c61ce55be07", "title": "Gulf Coast : Check your trees for storm readiness before the next storm hits", "date": "2024-08-01 01:15", "url": "https://www.yahoo.com/news/gulf-coast-check-trees-storm-225725306.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gulf Coast: Check your trees for storm readiness — before the next storm hitsBALDWIN COUNTY, Ala. (WKRG) — It’s not “if” a hurricane will hit our area, it’s “when”.\nBefore that happens, experts ask that people look up and check if their trees can weather the storm.\nOkaloosa County suspect in spider’s death arrested“Whole trees came down right from the roots,” that was during Hurricane Sally and since then Jack Ruck has been concerned about some of his trees.\nNorah O’Donnell leaving as anchor of CBS evening newscast after electionHe brought that concern to a workshop where Certified Arborist and Extension Agent Joel Potter said now is the time to check your trees.\nThe root system is also very important but so is what’s above the roots.", "location": "BALDWIN COUNTY, AL", "classification": "natural-disasters", "score": 0.9079903584091267, "event_breakdown": "Gulf Coast: Check your trees for storm readiness before the next storm hits\nOkaloosa County suspect in spider’s death arrested\nTrees fell during the storm\nNorah O’Donnell leaving as anchor of CBS evening newscast after election"}, {"id": "3d6bb0e4-e6f3-4cda-aa8b-4964f022b3d7", "title": "Powerful bow echo slams Omaha with hurricane - force winds", "date": "2024-08-01 06:30", "url": "https://www.yahoo.com/news/powerful-bow-echo-slams-omaha-033020443.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "– Severe thunderstorms rocked eastern Nebraska and southwestern Iowa on Wednesday, causing widespread power outages in the Omaha metro area.\nTree damage after storms rolled through Omaha, Nebraska on July 31, 2024Wind gusts around Omaha's Eppley Airfield, the region’s busiest airport, reached 90 mph.\n\"The windstorm that struck the OPPD service territory caused power outages to 220,545 customers,\" OPPD stated Wednesday night.\nDespite the flurry of severe weather, local authorities did not report any deaths associated with the event.\nOriginal article source: Powerful bow echo slams Omaha with hurricane-force winds", "location": "Omaha", "classification": "natural-disasters", "score": 0.8612491871314519, "event_breakdown": "Severe thunderstorms rocked eastern Nebraska and southwestern Iowa on Wednesday, causing widespread power outages in the Omaha metro area. Despite the arrival of more storms, local authorities did not report any deaths associated with the event."}, {"id": "b5ebd7d6-69f4-40d1-a437-6e8326ef64c5", "title": "Strong - to - severe storms could snarl rush hour in Chicago area – NBC Chicago", "date": "2024-08-01 01:30", "url": "https://www.nbcchicago.com/weather/severe-storms-could-bring-damaging-winds-heavy-rain-to-chicago-area/3507798/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area could wake up to strong-to-severe thunderstorms on Thursday, with the National Weather Service’s Storm Prediction Center upgrading the region to a “slight” risk of severe weather.\nAny storms that do develop could still produce rain and gusty winds, but may not reach severe limits.\nThe threat of rain in the Chicago area could stick around into Friday, as an area of low-pressure spins over Lake Michigan, shifting winds out of the north and bringing a few different waves of rain to the region.\nIt isn’t likely severe weather will develop from that system, but some embedded storms could form.\nThe next chance of rain doesn’t emerge until Tuesday, with temperatures cooling off after that system moves through.", "location": "CHICAGO", "classification": "natural-disasters", "score": 0.9539452701247947, "event_breakdown": "Tornado Risk for Thursday\nA slight risk of severe weather is forecast for north Texas on Friday.\nStorms to Develop This Week\nA threat of severe weather is expected to hit various regions of the United States this week.\nDrought Worsens\nDrought conditions are expected to intensify across parts of the Southwest.\nCalifornia Drought Forecast\nThe the worst drought conditions in over 1,200 years.\nThe threat of tornadoes is increasing across the Midwest today, with a line of thunderstorms moving through.\nDry conditions will continue to plague the West Coast, following this season's failed rainy season.\nSevere storms are forecast to move across the Midwest and East Coast later today."}, {"id": "36e3ebcd-3645-41e1-8dbc-bf155614e5fc", "title": "In the US , Disasters Strike All Over the Country", "date": "2024-08-01 00:45", "url": "https://learningenglish.voanews.com/a/in-the-us-disasters-strike-all-over-the-country/7712635.html", "domain": "learningenglish.voanews.com", "domain_classification": "Unknown", "message": "But a study from the nonprofit Rebuild by Design and New York University says disasters happen everywhere across the country.\nThe study looks at information on hundreds of federally declared disasters from 2011 to about 2021.\nThe study finds that eight of the nine counties with the most federally declared disasters since 2011 are in Kentucky.\nDisasters in unexpected placesIn July 2022, at least 40 people died, and 300 homes were damaged when a flood struck Floyd County in eastern Kentucky.\nSince 2011, FEMA has paid more than $41 billion in aid following hurricanes, the most of any kind of disaster.", "location": "Kentucky", "classification": "natural-disasters", "score": 0.7842392174757918, "event_breakdown": "Natural disasters are happening across the country. In New York, a flood on September 22, 2021, killed at least 22 people in the city. Arizona was hit by a series of wildfires in 2021, which killed at least 2 people and forced 2,000 people to flee their homes. In 2021, at least 600 people died in the Gulf Coast region when Hurricane Ida struck, and a heat wave killed 200 people and knocked out the power in 14 states."}, {"id": "c3e1d7d7-ecda-4a96-933f-a0b8a9a72aef", "title": "Live updates : Severe storms blast Omaha , leaving 216 , 000 without power", "date": "2024-08-01 00:45", "url": "https://omaha.com/news/local/weather/live-updates-severe-storms-blast-omaha-leaving-216-000-without-power/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The massive wind storm brought down trees and branches, knocked over power lines and lifted heavy objects.\nWeather service: 'Peaceful weekend ahead'5:11 a.m.| Storm recovery workers will have good weather in which to work, the National Weather Service in Valley said Thursday morning.\n7:20 p.m. | The current power outage figures rival previous, memorable widespread Omaha power outages.\nA flood advisory due to excessive rainfall is also in effect until 9:15 p.m., according to the weather service.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts.", "location": "Omaha", "classification": "natural-disasters", "score": 0.5870290860031213, "event_breakdown": "The massive wind storm is in the omaha area"}, {"id": "ac0bc8d3-ae3d-4845-a347-11af225d4549", "title": "Update : Damaging winds anticipated with thunderstorms in Dale and Houston counties Wednesday", "date": "2024-08-01 04:15", "url": "https://www.al.com/weather-alerts/2024/07/update-quarter-sized-hail-and-damaging-winds-anticipated-with-thunderstorms-in-southeast-alabama-wed.html", "domain": "al.com", "domain_classification": "Unknown", "message": "The National Weather Service issued an updated severe thunderstorm warning at 7:11 p.m. on Wednesday in effect until 7:30 p.m. for Dale and Houston counties.\nThe weather service adds, \"For your protection move to an interior room on the lowest floor of a building.\nUnfortunately, lightning is responsible for claiming the lives of approximately 20 people annually, as reported by the weather service.\nMastering wet roads: Safety tips for heavy rainfallWhen heavy rain pours, the risk of flooding and treacherous roads rises.\nAdvance Local Weather Alerts is a service provided by United Robots, which uses machine learning to compile the latest data from the National Weather Service.", "location": "DALE COUNTY", "classification": "natural-disasters", "score": 0.7956635860912884, "event_breakdown": "Severe Thunderstorm Warning issued June 22 at 7:11PM CDT until June 22 at 7:30PM CDT by NWS\nFor your protection move to an interior room on the lowest floor of a building.\nThe weather service adds, \"Unfortunately, lightning is responsible for claiming the lives of approximately 20 people annually."}, {"id": "e5ade835-aa06-449b-b1bd-2bd66fddf17a", "title": "2 . 2 magnitude earthquake shakes Hunterdon County in New Jersey", "date": "2024-08-01 00:45", "url": "https://www.yahoo.com/news/2-2-magnitude-earthquake-shakes-215747519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TEWKSBURY TOWNSHIP, N.J. (PIX11) – Maria Hadley has had enough earthquakes for a while.\n“I woke my husband and I’m like, ‘earthquake!’ and he’s like, ‘what?’ I’m like, ‘earthquake!’ He goes, ‘you’re dreaming, go back to sleep.\n'”More New Jersey NewsAccording to the USGS, another earthquake struck early Wednesday in Tewksbury Township, just a few minutes away from Hadley’s home, registering at 2.2 magnitude.\nWhen a 4.8 magnitude earthquake rocked the northeast on April 5, many of her plates and fine china crashed to the ground.\nMore Local NewsIf you live in or around Tewksbury Township, you may be curious when all this seismic activity will end.", "location": "TEWKSBURY TOWNSHIP", "classification": "natural-disasters", "score": 0.7660642988944982, "event_breakdown": "There have been no relevant current events of natural-disasters reported in text that can be placed on a map."}, {"id": "ba5b46c7-1e9a-49de-81ce-4825a8b0e3a9", "title": "Loudoun County farmers can apply for emergency drought aid", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/loudoun-county-farmers-apply-emergency-220216628.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LOUDOUN COUNTY, Va. (DC News Now) — Farmers in Loudoun County are eligible for emergency loan assistance from the federal government due to the drought during this year’s growing season.\nU.S. Department of Agriculture (USDA) Secretary Thomas Vilsack declared Loudoun and 14 other Virginia counties as “primary natural disaster areas,” allowing the Farm Service Agency (FSA) to offer emergency loans and other assistance to farmers impacted by the drought.\nFarmers have eight months to apply for the loans.\nFarmers in Loudoun County specifically can also receive support through the Loudoun County Department of Economic Development and Virginia Cooperative Extension.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC.", "location": "LOUDOUN COUNTY", "classification": "natural-disasters", "score": 0.7428354030186358, "event_breakdown": "Loudoun County farmers are eligible for emergency loans due to drought during the growing season."}, {"id": "345ca905-8e84-470d-a2b6-06db6128298e", "title": "National Hurricane Center tracking possible tropical storm formation near Bahamas , Florida – ICSF", "date": "2024-08-01 08:30", "url": "https://www.icsf.net/newss/national-hurricane-center-tracking-possible-tropical-storm-formation-near-bahamas-florida/", "domain": "icsf.net", "domain_classification": "Unknown", "message": "A​ disturbance in the Atlantic continues to be watched for possible formation into a tropical storm, but there are multiple scenarios in play when it comes to the track of this system as it nears the Bahamas and the southeastern United States by this weekend.\nThe tropical wave that might eventually grow into a tropical depression or storm is located over the Leeward Islands, or near the “X” in the graphic below, according to the National Hurricane Center.\nC​omputer models suggest wind shear may be relatively light, and there’s plenty of warm ocean water ahead of this system to fuel its development near the Bahamas or the Gulf of Mexico.\nHowever, this rather large tropical disturbance will likely have to interact with land along the way, particularly Hispaniola and Cuba, but also possibly Florida.\nSo, it may take some time for one area of thunderstorms to persist over water, lower surface pressure and begin the process of developing a tropical depression, if that happens at all.", "location": ")\nBahamas", "classification": "natural-disasters", "score": 0.8110242733846442, "event_breakdown": "1. Disturbance in the Atlantic: A  disturbance in the Atlantic continues to be watched for possible formation into a tropical storm, but there are multiple scenarios in play when it comes to the track of this system as it nears the Bahamas and the southeastern United States by this weekend.\n2. Tropical Wave in the Atlantic: The tropical wave that might eventually grow into a tropical depression or storm is located over the Leeward Islands, or near the \"X\" in the graphic below, according to the National Hurricane Center."}, {"id": "0dc8ce2b-2f0c-4202-9a45-559ac830aa92", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 08:45", "url": "https://www.squamishchief.com/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "A sudden release of water from the blocked Chilcotin River \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, the government says.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding.", "location": "Hope, British Columbia", "classification": "natural-disasters", "score": 0.5874117248874684, "event_breakdown": "Chilcotin River landslide triggers flood risk on Fraser River south of Quesnel\nUpdate:\nEvacuation orders are in place along 107 kilometres (66 miles) of the Chilcotin River after the Cariboo Regional District declared an immediate danger to life and safety due to flooding."}, {"id": "e10fdab6-2f94-4c10-a319-2de631d28e94", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "A sudden release of water from the blocked Chilcotin River \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, the government says.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding.", "location": "The main event is a landslide on the Chilcotin River. The most specific location that can be identified from the", "classification": "natural-disasters", "score": 0.5874117248874684, "event_breakdown": "Chilcotin River Landslide Causes Potential Flooding\nThe landslide on Wednesday has blocked the Chilcotin River, which feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C."}, {"id": "0299e001-ebbd-4504-8e57-547440567284", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding.", "location": "The main focus of the events mentioned in the text is the Chilcotin River in British Columbia, Canada.", "classification": "natural-disasters", "score": 0.6583646830891221, "event_breakdown": "British Columbia: Landslide blocks river, causes potential sudden rise in downstream river levels, evacuations issued"}, {"id": "9b524b09-a463-4bc8-a5b5-5e45d7439b99", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:00", "url": "https://www.fitzhugh.ca/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297540", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding.", "location": "The specific location of the landslide that blocked the Chilcotin River in British Columbia's Interior is Ty", "classification": "natural-disasters", "score": 0.6583646830891221, "event_breakdown": "British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior."}, {"id": "9b6df138-951b-4ae5-aeba-df4dca25b7dc", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:15", "url": "https://www.coastreporter.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding.", "location": "CHILCOTIN RIVER", "classification": "natural-disasters", "score": 0.6583646830891221, "event_breakdown": "British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}, {"id": "13a53b21-890b-4466-9ff5-321a62356955", "title": "A tropical wave has a chance of becoming a storm , but will it affect Panama City Beach ? ", "date": "2024-08-01 19:00", "url": "https://www.yahoo.com/news/tropical-wave-chance-becoming-storm-160035783.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical wave has a chance of becoming a storm, but will it affect Panama City Beach?\nThe National Hurricane Center is giving a low chance — 20% — for development over the next 48 hours.\nIf sustained winds reach 39 mph, it could become Tropical Storm Debby, the fourth named storm of the 2024 Atlantic hurricane season.\nTropical cyclone is the generic term that covers all tropical systems, including tropical depression, tropical storm and hurricane.\nThe striped areas on a tropical outlook map indicate \"areas where a tropical cyclone — which could be a tropical depression, tropical storm or hurricane — could develop,\" said National Hurricane Center Deputy Director Jamie Rhome.", "location": "PANAMA CITY BEACH", "classification": "natural-disasters", "score": 0.9327463973440251, "event_breakdown": "new tropical cyclone, current points in panama"}, {"id": "765603db-7d1f-4ba1-8d07-ac57164ec29a", "title": "August Weather Headlines", "date": "2024-08-01 18:00", "url": "https://www.whsv.com/2024/08/01/august-weather-headlines/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "HARRISONBURG, Va. (WHSV) - As July turns into August, the final month of summer has officially begun, but will the weather look any different from the last few dry months?\nWith late summer knocking on the doorsteps, tropical systems will start to become more common by the end of the month.\nActivity historically starts to climb late month into September.\nHowever, tropical systems become much more common from late August through October.\nThese types of systems often produce widespread, soaking rainfall, and is likely the sole way the region will break the drought.", "location": "Harrisonburg, Virginia", "classification": "natural-disasters", "score": 0.47264264209301, "event_breakdown": "Here are some current events of natural-disasters that have a specific location and can be placed on a map:\n\n* Tropical Storm Grace is pounding Haiti and Jamaica, causing flooding rains, mudslides, and power outages.\n* A severe drought is intensifying in the western U.S, where nearly all reservoirs are dropping to critically low levels.\n* The Caldor Fire is still raging in California, with nearly 200 structures destroyed since it ignited on August 14."}, {"id": "462bf0a5-b545-4a6e-b95c-111f644a0977", "title": "Hurricane preparedness : Tropical terms to get familiar with", "date": "2024-08-01 17:30", "url": "https://www.clickorlando.com/weather/hurricane/2024/08/01/hurricane-preparedness-tropical-terms-to-get-familiar-with/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Tropical Cyclone: Any tropical area of low pressure found anywhere around the world.\nPotential Tropical Cyclone: Designated by the National Hurricane Center when a disturbance that has not yet met all of the meteorological characteristics to become tropical but has the strong potential to become one.\nThe disturbance will receive this designation when it has a strong chance to bring tropical storm or hurricane conditions to land within 48 hours.\nTropical Outlook: Issued by the National Hurricane Center to highlight an area of disturbed weather that has a chance to develop into a tropical depression, storm or hurricane.\nTropical Advisory: Issued when a tropical depression develops.", "location": "Tropical Advisory: Issued when a tropical depression develops.", "classification": "natural-disasters", "score": 0.8661428462574828, "event_breakdown": "Tropical Depression Fourteen forms in the eastern Atlantic and is expected to strengthen into a tropical storm\n\nAlaska\n\nDuring the past couple of weeks, Alaska has seen a heatwave with temperatures well above average. As the result of a dome of high pressure over the region, the heatwave is being accompanied by a brand-new high-temperature mark: 90 degrees. Finally, on Friday, the high pressure mass should crack, and it will be followed by a cooldown by the end of Friday and possibly into next weekend.\n\n90 degrees was previously recorded in Kotzebue on July 27, 2009. The last summer to have a top temperature in the 90s was 2004, not 2012. Some spots in the eastern Alaska Panhandle saw top temperatures in the mid-80s throughout the day on Thursday.\n\nOther sources have reported all-time heat records in Alaska occurring in several other cities and towns even before the Kotzebue area broke the new wooden record.\n\nHeat in western Alaska has caused drought; burn restrictions are in place across the state.\n\nFire\n\nWildfires are raging worldwide. Over the last few days, firefighters in Siberia battled massive and old wildfires; Northern Ontario continues to fight a dependably slow wildfire known as Red Lake Fire 29.\n\nContacts and resources"}, {"id": "37217a2c-a926-444a-b55b-424289ce1ec2", "title": "Renter vulnerabities", "date": "2024-08-01 15:00", "url": "https://laist.com/brief/news/climate-environment/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "laist.com", "domain_classification": "Unknown", "message": "Read on: To learn about common vulnerabilities of renting as the climate crisis worsens, and what is being done to combat the issue...\nNearly two years later, James and her husband are still trying to recover from the financial gut-punch of the storm.\nRyan Kellerman / NPR )As a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\n“Disaster creates disaster,” James says.\n\"Disaster creates disaster,\" says hurricane survivor Venus James.", "location": "Miami", "classification": "natural-disasters", "score": 0.8151808535774008, "event_breakdown": "Venus James is a survivor of Hurricane Florence."}, {"id": "48d109f1-c568-459d-a0cf-7f0df910d797", "title": "Tropical depression possible soon in Gulf of Mexico : What will it mean for Alabama ? ", "date": "2024-08-01 18:00", "url": "https://www.al.com/hurricane/2024/08/tropical-depression-possible-in-the-gulf-soon.html", "domain": "al.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Thursday continued to watch a tropical disturbance near Hispaniola that could become a tropical depression soon.\nHurricane center forecasters raised the probability of development from medium (60 percent) to high (70 percent) on Thursday afternoon.\n🌀 1pm Tropical Update: It's too soon to say if this system will have any impacts across our local area.\nThe problem is, it could be in the Gulf of Mexico or near the Florida peninsula when that happens.\nTwo of them — Alberto and Chris — were tropical storms that hit Mexico’s Gulf Coast.", "location": "MEXICO", "classification": "natural-disasters", "score": 0.7750211851543919, "event_breakdown": "New york city, Usa - Hurricane\nRoma, Italia - Floods"}, {"id": "ea55ef2c-7d1c-405e-b10f-7a680f1c127c", "title": "Tropical Storm Carlotta strengthens over Pacific Ocean as it moves away from Mexico – Winnipeg Free Press", "date": "2024-08-01 15:00", "url": "https://www.winnipegfreepress.com/world/2024/08/01/tropical-storm-carlotta-strengthens-over-pacific-ocean-as-it-moves-away-from-mexico", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "MIAMI (AP) — Tropical Storm Carlotta is growing stronger over the Pacific Ocean as it moves away from Mexico and could become a hurricane by Thursday evening, forecasters said.\nThe National Hurricane Center in Miami said Thursday morning that Carlotta’s maximum sustained winds had grown to 60 mph (95 kph).\nThe system was centered about 345 miles (630 kilometers) southwest of Manzanilla, Mexico, moving northwest at 12 mph (19 kph).\nSwells generated by the storm will likely cause life-threatening surf and rip current conditions through the weekend along Mexico’s west-central mainland coast and the southern Baja California peninsula, the hurricane center warned.", "location": "MEXICO", "classification": "natural-disasters", "score": 0.9698262875723513, "event_breakdown": "Tropical Storm Carlotta."}, {"id": "c381e4f9-046b-45c0-8f7f-70e53845543a", "title": "Forecasters predict Tropical Storm Carlotta to grow into hurricane", "date": "2024-08-01 18:00", "url": "https://www.yahoo.com/news/forecasters-predict-tropical-storm-carlotta-170325708.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Carlotta off the western coast of Mexico is expected to grow into a hurricane, forecasters said.\nPhoto courtesy of NOAAAug. 1 (UPI) -- The National Hurricane Center said Thursday that Pacific Ocean Tropical Storm Carlotta is expected to become a hurricane late Thursday or Friday.\n\"This motion is expected to continue [Thursday], followed by a turn toward the west on Friday and a continued westward motion through the weekend,\" the National Hurricane Center said.\n\"Strengthening is forecast during the next couple of days and Carlotta is expected to become a hurricane today or [Friday].\"\nThe center said its tropical storm winds extend 60 miles from the eye.", "location": "Mexico", "classification": "natural-disasters", "score": 0.8668419089616984, "event_breakdown": "Tropical Storm Carlotta off the western coast of Mexico"}, {"id": "0e8dca4a-e483-42e0-abcc-8b434fee31e2", "title": "Heat builds again in B . C . after cool reprieve for wildfire crews", "date": "2024-08-01 19:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-aug-1-2024-1.7282111", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "The heat is building again in British Columbia after days of rainfall and cooler temperatures tempered fire behaviour across the province.\nwon't see the same prolonged heat wave as last month, temperatures will be a little higher at night.\nThe heat is renewing concerns for firefighting crews who gained some reprieve with the recent cool spell.\nCooke said higher temperatures overnight means there's less chance fire activity will slow down.\nare encouraged to be prepared for the continued higher risk of wildfire in the province,\" the ministries said.", "location": "British Columbia", "classification": "natural-disasters", "score": 0.501858551133519, "event_breakdown": "Event 1: Heat is building again in British Columbia after recent rainfall and cooler temperatures tempered fire behaviour across the province.\nEvent 2: After recent rainfall and cooler temperatures tempered fire behaviour across the province, the heat is building again in British Columbia."}, {"id": "2796b6bc-d893-440d-88bc-f88c388db6ae", "title": "In the Eye of the Storm - Discovery Channel HD", "date": "2024-08-01 15:30", "url": "https://www.tvguide.co.uk/schedule/3ed38262-a24b-5704-ba1b-f9728f0dfe9e/in-the-eye-of-the-storm", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "In the Eye of the StormDiscovery Channel HD 9:00 PM to 10:00 PM Thursday 1 August Share Add toCalendar +Hellfire in Hawaii Season 1 Episode 2 New S SubtitlesIn 2023, Maui faced the worst natural disaster in its history as hurricane-force winds fuelled wildfires.\nEyewitnesses film their attempts to escapeIn the Eye of the Storm airs on Discovery Channel HD at 9:00 PM, Thursday 1 August .\n(Subtitles, new.)", "location": "Maui", "classification": "natural-disasters", "score": 0.4510330706378991, "event_breakdown": "In the Eye of the Storm, a documentary about the 2023 Maui wildfires, aired on Discovery Channel HD on 1 August at 9:00 PM.\nHellfire in Hawaii, season 1, episode 2, a new series, with subtitles."}, {"id": "96e22265-12b2-49d7-af5d-78fe0c66ce08", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 15:00", "url": "https://www.clickondetroit.com/news/national/2024/08/01/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states.", "location": "Washington", "classification": "natural-disasters", "score": 0.709356230643733, "event_breakdown": "Vermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "29aa8c6d-f4d0-4497-8c6f-47a66f0b9028", "title": "Invest 97L Could Pose Threat To Florida | FM 96 . 9 The Game", "date": "2024-08-01 17:30", "url": "https://969thegame.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "969thegame.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Here are the current events of natural-disasters that can be placed on a map:\nStranded Vehicles in Floodwaters\n(Lake Charles, LA) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "026021f5-2c46-4d88-9dfd-7866865196ea", "title": "Invest 97L Could Pose Threat To Florida | NewsRadio WFLA", "date": "2024-08-01 17:30", "url": "https://wflanews.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wflanews.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Tornado Tears Through Downtown Nashville\nNews anchor report\nA tornado touched down around downtown Nashville, Tennessee this morning and caused widespread damage. The tornado left many buildings with broken glass and demolished roofs. A state of emergency has now been declared in the area. One local hospital said that it received more than 20 patients from the storm and that several of them were in critical condition.\nA waterspout appears in the Mediterranean Sea\nA water spout has been reported off the shore of Cyprus, where beaches have been closed as of Wednesday afternoon\nAs of Wednesday afternoon, the beaches of Cyprus have been closed in response to a water spout off of the coast. The spout was spotted off of the island's gymnasium beach and has since dissipated. According to KP Index, there has not been any marine activity associated with the spout as of yet, however, local beachgoers and fishermen have been advised to be cautious and to report any sightings to the authorities immediately.\nTropical storm off the coast of Florida\nTropical storm Claudette has formed off the coast of Florida, which will likely bring heavy rain and some strong winds to parts of the state this weekend into much of next week"}, {"id": "c3fd6872-5523-4e74-a5bd-1696d9bdf515", "title": "Invest 97L Could Pose Threat To Florida | NewsRadio WIOD", "date": "2024-08-01 17:30", "url": "https://wiod.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wiod.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Here are the recent natural disasters reported on:\n\n- California wildfires (USA)\n- Tornadoes (USA)\n- Earthquake (Mexico)\n- Typhoon (Philippines)"}, {"id": "a834cd2c-7ad1-41a2-8060-fe7e126bd488", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 17:15", "url": "https://991wqik.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "991wqik.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Tropical Wave near Florida, USA"}, {"id": "ee9dc4a8-490b-4bd7-ad51-6341e5f5d040", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:00", "url": "https://sunny985.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "sunny985.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Hurricane Irma becomes a deadly, costly reminder of federal flood failures\nResearchers have long since predicted that the South Florida Expressway in the Florida Keys would succumb to climate change. What the textbooks don't always show are the faces of Orange County soldiers such as Sgt. Dustin Annino, veterans of wars they might otherwise consider to be private. The US Army Corps - at least partially responsible for the disaster through its failure to build an adequate hurricane barrier and to complete erosion control - also likes to remember certain names associated with key landmarks nationally - the Rosenstiel School of Marine and Atmospheric Science, Sloppy Joe's - and the far Florida Key Road."}, {"id": "54c1cf69-6851-424e-af94-e753e109001e", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:00", "url": "https://993thebeat.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "993thebeat.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "1. Tropical Wave in the Caribbean and Southeastern United States, 2022\n2. According to forecasters from the National Hurricane Center, a large tropical wave is being monitored as it does approach to Florida. This system has gained a 60% chance of development in the next coming days, as it travels towards the Bahamas and most of it in Florida.\nThe state, expecting impacts from the system starting from this weekend until early next week, has been warned with precaution by state officials. Ensuring to have precautionary measures in place before the next disaster hits."}, {"id": "86bc878a-9439-4da3-a774-9174474a538a", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 18:15", "url": "https://kissfm1071.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "kissfm1071.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Floods in Uganda\nForecasters are tracking a large tropical wave as it gets closer to Florida\nA separate system is over western Africa, has a 20% chance of developing"}, {"id": "a5b5a0cd-0bc7-4ad3-9524-a2049db6c178", "title": "Invest 97L Could Pose Threat To Florida | Vero Patriot", "date": "2024-08-01 18:15", "url": "https://veropatriot.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "veropatriot.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Hurricane Irma, Storm, North Carolina, United States"}, {"id": "1b8f3fa5-6186-4c8c-aeaa-abd78278228d", "title": "Invest 97L Could Pose Threat To Florida | WMMB - AM", "date": "2024-08-01 19:00", "url": "https://wmmbam.iheart.com/featured/florida-news/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wmmbam.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Here is a specific disaster inquiry for the current time frame that may only apply to certain locations or simply requires a closer look?\n1. Storm in Miami, FL (US)\n2. Tropical storm in the Caribbean\nCurrent events are only found for locations, Miami, FL (US) and the Caribbean."}, {"id": "e03808fe-c60b-4f1a-95a5-fcc613494806", "title": "BC Issues Flood Warning , Watches After Landslide Blocks River , Forces Evacuations", "date": "2024-08-01 15:00", "url": "https://www.theepochtimes.com/world/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-5697836", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "A massive amount of debris from a landslide damming the Chilcotin River in British Columbia’s central Interior could give way within the next 24 to 48 hours.\nWagner told a news briefing that the riverbed below the slide is dry, and officials aren’t certain about the potential downstream impacts when the dam is breached.\nBut she says it’s clear there would be “a mass of water” coming down the Chilcotin, which flows south into the Fraser River.\nEvacuation orders span 107 square kilometres along the Chilcotin, with the regional officials saying the slide poses an “immediate danger to life and safety.”The district says 60 properties are covered by the orders, including 12 homes with an estimated 13 residents.\nWagner says the slide is “massive,” with material piled 30 metres high and stretching 600 metres in length, completely blocking the flow of the Chilcotin.", "location": "British Columbia", "classification": "natural-disasters", "score": 0.5024147999844903, "event_breakdown": "A massive amount of debris from a landslide damming the Chilcotin River in British Columbia's central Interior could give way within the next 24 to 48 hours.\nEvacuation orders span 107 square kilometres along the Chilcotin, with the regional officials saying the slide poses an \"immediate danger to life and safety.\" The district says 60 properties are covered by the orders, including 12 homes with an estimated 13 residents."}, {"id": "d7b7b9af-6d21-4989-b261-9c590ea37f89", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:15", "url": "https://www.recorderonline.com/news/national_news/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_74b3d0e2-8c17-5dc9-acdb-aaec5902f7da.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” as more heavy rains hit northeastern and central Vermont on Wednesday", "location": "Vermont", "classification": "natural-disasters", "score": 0.6484997426433671, "event_breakdown": "Vermont flooding"}, {"id": "33661862-f22c-451e-9788-3e236aa72ae5", "title": "A tropical depression could form in the Gulf this weekend . What the MS Coast forecast ? ", "date": "2024-08-01 15:00", "url": "https://news.yahoo.com/news/tropical-depression-could-form-gulf-135223752.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "A tropical depression could form in the Gulf this weekend.\nThe forecast for a disturbance in the Atlantic shifted west Wednesday evening and the system could now become a tropical depression in the eastern Gulf of Mexico by the weekend, the National Hurricane Center said.\nThe National Hurricane Center is tracking a disturbance that could become a tropical depression in the Gulf of Mexico this weekend.\nIt could become a tropical depression this weekend or early next week once it passes the islands, forecasters said.\nThe disturbance could either stall or become stronger in the Gulf of Mexico, Cantore said on CBS Mornings.", "location": "Gulf of Mexico", "classification": "natural-disasters", "score": 0.44033865043989995, "event_breakdown": "Tropical Depression in the Gulf of Mexico, Possible Tropical Depression in the Atlantic"}, {"id": "80e277a3-c209-402f-847a-04f3cd991a91", "title": "China flooding : Death toll jumps to 30 , 35 others missing in southeast", "date": "2024-08-01 15:00", "url": "https://www.ctvnews.ca/world/death-toll-jumps-to-30-with-35-others-missing-in-an-area-hit-by-heavy-rains-in-southeastern-china-1.6985631", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "BEIJING, China -At least 30 people have died and 35 others are missing in a city in southeastern China after days of heavy rains tied to a tropical storm, state media said Thursday.\nThe death toll rose sharply from a previously reported four deaths in villages in Zixing, a city in Hunan province.\nEarlier this week, state broadcaster CCTV showed helicopters being used to get relief supplies into severely flooded areas in Zixing.\nChinese Premier Li Qiang, visiting flood-hit villages in Zixing, urged all-out efforts to find the missing as search and rescue work continued.\nTropical Storm Gaemi also brought heavy rain to northeastern China and North Korea, swelling the Yalu River, which divides the two countries.", "location": "BEIJING, China", "classification": "natural-disasters", "score": 0.44247690580524485, "event_breakdown": "30 die in China as victims of Tropical Storm Gaemi"}, {"id": "bfc29aa1-fbf0-4013-ab1e-c10ba910d2ba", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:15", "url": "https://www.mix941.com/syndicated-article/?id=1577018", "domain": "mix941.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "SAN JUAN, PUERTO RICO", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The current National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nNone found"}, {"id": "836d6e97-efb3-4748-89a5-063d9b4878a0", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1577018", "domain": "exploreseiowa.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": ")\nPuerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "8e75dafe-514d-4020-a4f4-4f8b30924566", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 18:45", "url": "https://kjlhradio.com/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "kjlhradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "SAN JUAN, PUERTO RICO", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week. If this strengthens to a named storm, it would be called Debby."}, {"id": "579ee459-0a79-4955-bc8b-fd910682c5f5", "title": "National - Carroll Broadcasting Inc . ", "date": "2024-08-01 18:15", "url": "https://wkjc.com/national/1b6035bf0100e87c0b49a7f53a2a33ef", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Here are the relevant current events of natural-disasters reported in text that can be placed on a map:\nTropical Storm Bret\nSuomi NPP Satellite image of Tropical Storm Bret on June 28, 2019\nBret was a short-lived and relatively weak tropical cyclone that impacted the East Coast of the United States, Bermuda, and Atlantic Canada in June 2019.\nHere are few quick facts about the storm #s Bret:\nSmaller than tropical storm\nList of tropical cyclone names"}, {"id": "8a871d17-83ed-4bd8-86df-7c008b1f5d06", "title": "B . C . landslide prompts flood warning hundreds of kilometres down the Fraser River", "date": "2024-08-01 17:30", "url": "https://www.timescolonist.com/bc-news/bc-landslide-prompts-flood-warning-hundreds-of-kilometres-down-the-fraser-river-9297544", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\n— A massive amount of debris piled 30 metres high from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours.\nBut she said it's clear there would be \"a mass of water\" coming down the Chilcotin, which flows south into the Fraser River.\nThe province has warned people to stay away from the banks of the Chilcotin River below the slide all the way down to the Fraser River north of Hope, about 150 kilometres east of Vancouver.\nThe forecast centre says the eventual breach of the landslide debris could also lead to an \"outburst flood\" with a surge of water rapidly flowing downstream.", "location": "Based on the context provided, I was unable to come up with a specific location for the event.", "classification": "natural-disasters", "score": 0.5424515466899477, "event_breakdown": "Massive amount of debris from a landslide has dammed the Chilcotin River in British Columbia's central Interior, creating a lake that a regional official says could give way within the next 24 to 48 hours, and could lead to an \"outburst flood\" with a surge of water rapidly flowing downstream."}, {"id": "3fd99152-0f91-4658-a935-3c427b33f659", "title": "TROPICAL DEPRESSION : Hurricane Center Now Says Formation Likely Within Days", "date": "2024-08-01 19:00", "url": "https://bocanewsnow.com/2024/08/01/tropical-depression-hurricane-center-now-says-formation-likely-within-days/", "domain": "bocanewsnow.com", "domain_classification": "Unknown", "message": "National Hurricane Center update for Thursday afternoon.\nBY: WEATHER TEAM | BocaNewsNow.comBOCA RATON, FL (BocaNewsNow.com) (Copyright © 2024 MetroDesk Media, LLC) — The National Hurricane Center Thursday afternoon says there is a 70-percent chance that a tropical depression will form over the next several days.\nHere is the Thursday afternoon update from the National Hurricane Center.\nDevelopment of this system should be slow to occur during the next day or so while it moves west-northwestward over portions of the Greater Antilles.\nInterests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system.", "location": "Florida.", "classification": "natural-disasters", "score": 0.5924251891305315, "event_breakdown": "A new tropical depression that has a 70% chance of formation will occur in the next 3 days. The system will move west-northwest over portions of the Greater Antilles. Interests across the Greater Antilles, the Bahamas, and Florida should monitor the progress of this system."}, {"id": "25781a6b-9005-47bc-b50d-d221754f8d63", "title": "Drivers warned to brace for spray , sudden flooding and road closures", "date": "2024-08-01 16:30", "url": "https://www.oxfordmail.co.uk/news/national/24491971.drivers-warned-brace-spray-sudden-flooding-road-closures/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "The Met Office has warned the conditions could lead to road closures, cancellations to train and bus services, and power cuts.\nFlooding of homes and businesses could also happen quickly, the forecaster warned, with damage to some buildings from floodwater, lightning strikes, hail or strong winds.\nShe added that parts of the warning zone could see up to 50mm of rain in an hour or two.\nHeading into Friday, she said there was still a chance of thunderstorms in the east of England, with temperatures of up to 30C.\nWhile on Saturday, outbreaks of rain are expected in the south of England, with the highest temperatures around 25C-26C.", "location": "given\nThe main event takes place in England.", "classification": "natural-disasters", "score": 0.8035135835874397, "event_breakdown": "Floods in East Africa\nTropical Cyclone Batsirai\nSouth West England heatwave"}, {"id": "483978c2-20a9-49a1-b6a4-48f1ee49e690", "title": "Jasper wildfire : Officials to provide update from Hinton Thursday afternoon", "date": "2024-08-01 17:45", "url": "https://globalnews.ca/news/10675397/jasper-wildfire-update-thursday-august-1/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailFederal, provincial and municipal leaders are scheduled to provide an update on the Jasper wildfire situation Thursday afternoon.\n“Extreme fire behaviour may begin as soon as tomorrow,” Jasper National Park said in an update Wednesday night.\nHighway 16 through Jasper National Park reopened to commercial traffic at 5 a.m. Thursday.\nFor now, commercial trucks, tractors and trailers with a registered gross vehicle weight exceeding 11,794 kilograms can use the highway during the following time periods:5 a.m. – 7 a.m. MT10 a.m. – 5 p.m. MT8 p.m. – 9 p.m. MTThe Jasper wildfire — dubbed the Jasper wildfire complex — remains out of control at about 32,500 hectares in size.\nFor the latest information on the wildfire status and danger across the province, visit the Alberta Wildfire website.", "location": "Jasper National Park", "classification": "natural-disasters", "score": 0.46253687330708837, "event_breakdown": "Jasper wildfire, Jasper National Park, Alberta"}, {"id": "5d795d71-1f76-4e33-aa5d-4109a9999f14", "title": "Strong Winds and Heavy Rain Last Night - Brookings Radio", "date": "2024-08-01 18:00", "url": "https://www.brookingsradio.com/strong-winds-and-heavy-rain-last-night/", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "Volga was the first to report a 58 mph non-thunderstorm wind gust at 7:55 pm.\nA 60 mph thunderstorm wind gust was reported 7 miles SSW of Brookings from a personal weather gauge at 8:04 pm.\nA 53 mph thunderstorm wind gust was reported at the airport in Brookings at 8:17 pm.\nA Flash Flood warning was posted for Brookings County including Brookings, Volga, Sinai, Nunda, Bruce, Toronto and Elkton.\nBrookings saw 2.91 inches of rain in one hour with a storm total of 4.13 inches.", "location": "Brookings", "classification": "natural-disasters", "score": 0.7402020665450362, "event_breakdown": "Flash Flood in Brookings, SD"}, {"id": "7ff272bf-8723-43a3-afca-90c5f7c7e9a7", "title": "Report : CenterPoint Plans To Pass Beryl - Related Expenses Onto Customers", "date": "2024-08-01 17:15", "url": "https://houstonseagle.com/1375398/report-centerpoint-plans-to-pass-beryl-related-expenses-onto-customers/", "domain": "houstonseagle.com", "domain_classification": "Unknown", "message": "CenterPoint Energy Inc. plans to pass on to their customers an estimated $2 billion in costs related to the powerful storm that ravaged Houston and the surrounding area.\nDuring an earnings call Tuesday (July 30), Chief Financial Officer Christopher Foster told investors and analysts the company will issue bonds to recover expenses related to the storm.\nBeryl drenched Houston with a summer’s worth of rain and brought 75 mph winds with gusts even higher.\nThe Beryl-related death toll climbed to more than 20 people in Texas, many of which are due to heat-related illnesses.\nNearly half of the deaths in Harris County have been attributed to heat exposure, according to the Harris County Institute of Forensic Sciences.", "location": "Houston, Texas", "classification": "natural-disasters", "score": 0.7303494715525394, "event_breakdown": "Hurricane Harvey, Texas, United States\nSummer Heatwave, Texas, United States"}, {"id": "e1411de0-cd2c-4532-ba65-72948939a39d", "title": "Wildfires rage in Balkans and Greece", "date": "2024-08-01 03:30", "url": "https://global.chinadaily.com.cn/a/202408/01/WS66aaebc0a3104e74fddb7f3d.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "ANTONIO BRONIC/REUTERSFierce wildfires, propelled by strong winds, ravaged areas of Greece and the Balkans on Tuesday, destroying forests and homes and forcing the evacuation of an Albanian resort town, local officials reported.\nThe area has experienced higher-than-normal temperatures and arid conditions throughout the previous month, establishing perfect circumstances for the outbreak of wildfires, according to scientists.\nIn recent years, Greece has experienced an increase in wildfire occurrences during progressively hotter and drier summers, a trend that scientists attribute to climate change.\nThe country has been grappling with hundreds of wildfires since May, coinciding with its record-breaking hottest June and longest-ever heatwave.\nEurope is experiencing the most rapid warming of any continent globally, with Greece among nations most severely impacted by the consequences of anthropogenic climate change, reported Euronews.", "location": "GREECE", "classification": "natural-disasters", "score": 0.5392093572679874, "event_breakdown": "Greece, Balkans wildfires\nFierce wildfires, propelled by strong winds, ravaged areas of Greece and the Balkans on Tuesday, destroying forests and homes and forcing the evacuation of an Albanian resort town, local officials reported."}, {"id": "e64764d0-7720-4450-a461-42125b36ab0f", "title": "Why focusing on a hurricane category is downright dangerous", "date": "2024-08-01 21:45", "url": "https://www.theweathernetwork.com/en/news/weather/severe/why-focusing-on-a-hurricanes-saffir-simpson-scale-category-is-downright-dangerous", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "Dennis Mersereau Digital Journalist The wind scale doesn’t take into account all of a storm’s life-threatening hazardsThe streets in eastern Texas resembled rivers the week the downpours started.\nMonstrous hurricanes are often reduced to a single category as they swirl toward land.\n“The Category 4 storm will approach landfall…” is a simple and easy way to convey the maximum winds within a storm in the easiest way possible.\nBut reducing a storm to its category and focusing solely on the storm’s winds can have terrible consequences in the face of a multitude of other hazards.\nDON'T MISS: Tropical systems don’t need a name to trigger devastating floodsThe Saffir-Simpson scale focuses on windsMeteorologists use the Saffir-Simpson Hurricane Wind Scale (SSHWS) to categorize and communicate a hurricane’s maximum sustained winds in an easy-to-relate way.", "location": ")\nTexas", "classification": "natural-disasters", "score": 0.870769680205358, "event_breakdown": "1. Dennis Mersereau Digital Journalist writes, \"The streets in eastern Texas resembled rivers the week the downpours started. The Saffir-Simpson scale says a storm was not a hurricane at this point. But it seems the storm remains a Gulf tropical cyclone.\"\n2. The streets turned into rivers after the week downpours started, but the Saffir-Simpson scale did not categorize the storm as hurricane even though it was an important storm on the Gulf of Mexico.\"\n3. Monstrous hurricanes can be reduced to a single category, but focusing only on the storm’s winds can have terrible consequences in the face of other hazards.\n4. Dennis Mersereau Digital Journalist reports, \"The Category 4 storm will approach landfall somewhere between Cameron and Galveston overnight on Tuesday, with sustained maximum winds of 145 miles per hour.\n5. The Saffir-Simpson scale measures the hurricane’s winds but fails to report other important issues in the storm.\"\n1. Storm in South Louisiana damages buildings, causes floods, and leaves thousands of homes without power.\n2. Massive tornado rips through Chicago suburbs, causing damage, injuries and power outages.\n3. Ohio Valley severe weather outbreak kills multiple people, destroys structures; flood warnings issued in many locations.\n4. Major flooding forces hundreds to evacuate in British Columbia.\n5. Historical flooding on the Yukon River leaves business owners with uncertainty about their futures .\n6."}, {"id": "09fb6648-df75-4cb9-a4fc-e92472156fa0", "title": "Gov . DeSantis declares state of emergency as coming heavy rains might cause  major disaster  ", "date": "2024-08-01 23:30", "url": "https://www.yahoo.com/news/gov-desantis-declares-state-emergency-230545536.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DeSantis declares state of emergency as coming heavy rains might cause ‘major disaster’Gov.\nRon DeSantis declared a state of emergency for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\nAll South Florida counties, with the exception of Monroe County, are not under the emergency order.\nREAD MORE: South Florida’s rain chances rise as messy tropical wave moves toward the stateThe tropical wave in the Atlantic could start to form this weekend.\nThe region is also in store for heavy rains that could cause severe flooding, partly because of the tropical wave.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.8728715283045626, "event_breakdown": "1. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n2. Gov. Ron DeSantis declared a state of emergency for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n3. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n4. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n5. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n\nRelevant events of natural-disasters reported on June 21, 2023:\n1. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n2. Gov. Ron DeSantis declared a state of emergency for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n3. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n4. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression.\n5. A state of emergency was declared for much of the state, excluding South Florida, ahead of a disturbance that might strengthen into a tropical depression."}, {"id": "49099e2d-ee44-4204-a200-99fc38e78a09", "title": "Drought persists , but there are some much - needed rain chances ahead", "date": "2024-08-01 20:30", "url": "https://www.news5cleveland.com/weather/weather-news/drought-persists-across-neo-but-there-are-some-much-needed-rain-chances-ahead", "domain": "news5cleveland.com", "domain_classification": "Unknown", "message": "Drought has worsened slightly over the last week across Northeast Ohio, according to the U.S. Drought Monitor.\nThe U.S. Drought Monitor is a map released every Thursday (with data from Tuesday to Tuesday).\nLAST WEEKNews 5THIS WEEKNews 5As of July 30th, 72% of Ohio is experiencing drought conditions, including nearly 40% of Ohio dealing with moderate drought and about 14% experiencing severe drought.\nSoutheast Ohio has been in severe drought for a few weeks, and it has spread into more communities.\nNews 5News 5News 5News 5News 5News 5News 5Want the latest Power of 5 weather team updates wherever you go?", "location": "OHIO", "classification": "natural-disasters", "score": 0.6970048322195864, "event_breakdown": "Tornado in florida"}, {"id": "c7adc7db-9a1f-44ee-8c73-cff7b3e1a62e", "title": "National Hurricane Center tracking Invest 97L . See spaghetti models , Lee County impact", "date": "2024-08-01 20:30", "url": "https://news.yahoo.com/news/national-hurricane-center-tracking-invest-193255091.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "The tropical wave approaching the U.S. and Florida's West Coast, including Fort Myers and Lee County, has now been designated Invest 97L by the National Hurricane Center.\n➤ Track all active storms➤ Spaghetti models for Invest 97LChances are continuing to increase for when Invest 97L could approach Florida and the United States, according to the latest advisory from the National Hurricane Center.\nThe National Hurricane Center is giving the system a low chance – 30% – for development over the next 48 hours.\nTropical cyclone is the generic term that covers all tropical systems, including tropical depression, tropical storm and hurricane.\nWeather watches and warnings issued in Fort Myers, Lee CountyNational Hurricane Center map: What are forecasters watching now?", "location": ")\nFort Myers", "classification": "natural-disasters", "score": 0.9616550661083344, "event_breakdown": "The target event is a news push that reports an event that is happening in the current time frame and belongs to to the category \"natural-disasters,\" and not a past event. As for active events, there is an active tropical system that the National Hurricane Center is giving The system a low chance - 30% - for development over the next 48 hours."}, {"id": "4386fe17-038d-4589-8f7e-3cb047aea635", "title": "August 1 Tampa Bay Storm Update : Heavy Rain , But Hopefully That All", "date": "2024-08-01 19:45", "url": "https://wild941.com/2024/08/01/tampa-storm-debby/", "domain": "wild941.com", "domain_classification": "Unknown", "message": "August 1 Tampa Bay Storm Update: Heavy Rain, But Hopefully That’s AllTampa weather watchers continue to monitor that tropical system firing up.\nBut here’s the latest Tampa Bay storm update from the weather experts.\nThe National Hurricane Center says the storm has a 60% chance of development so this could become Tropical Storm Debby.\nOur next Tampa Bay storm updateNew information will become available at around 11 this morning when the next National Weather Service readings come in.\nGeno's passions include fat guy food, Tampa Bay and Boston sports, travel to Europe and South America, and old school party music.", "location": "Tampa Bay", "classification": "natural-disasters", "score": 0.9255721154650699, "event_breakdown": "Tropical Storm Debby has formed near the Bahamas and is expected to move north over the next two days. The storm is currently about 50 miles southwest of Nassau. The storm is expected to produce heavy rainfall and possible flash flooding over the Bahamas and Florida over the next several days."}, {"id": "2b641892-5ee7-4ce6-8cba-cdddc570e663", "title": "Potential tropical development brewing in the gulf", "date": "2024-08-01 23:00", "url": "https://www.yahoo.com/news/potential-tropical-development-brewing-gulf-204210396.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "AUSTIN (KXAN) — As the first of August arrives so too does tropical development.\nNewest development in the tropics08/01 tropical development in the AtlanticCurrently we are watching a well defined tropical wave that has been building over the last few days just north of Haiti and the Dominican Republic.\nSlowly, models have been pulling the storm farther towards the west side of Florida and into the Gulf of Mexico.\nDevelopment is expected to increase over the weekend with the storm becoming a tropical depression.\nA few stations in the gulf have recorded up to 89° which is just above the average for this time of year.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.5671002726861537, "event_breakdown": "Tropical development in the Atlantic: We are watching a well defined tropical wave just north of Haiti and the Dominican Republic."}, {"id": "ac2a1506-b06b-42eb-b9be-9eaf7e5ec725", "title": "See latest spaghetti models on where Invest 97L could go", "date": "2024-08-01 23:00", "url": "https://www.yahoo.com/news/see-latest-spaghetti-models-where-212230452.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "➤Track all active stormsTropical wave near Hispaniola has 70% chance of developmentNational Hurricane Center says a tropical wave near Hispaniola has a 70% chance of development over seven days.\nStorm tracker: Monitor tropical wave as it moves toward FloridaWhy did the forecast for Invest 97L change?\nTropical waves can be notoriously hard to forecast until they develop a closed center of circulation which is a key piece in it being designated a tropical cyclone.\nFOX Weather hurricane specialist Bryan Norcross said there is a potential for a hurricane to form, but said it could also remain a sloppy tropical wave.\nThis article originally appeared on Palm Beach Post: Tropical wave now Invest 97L is headed toward the Gulf.", "location": "The main event takes place near Hispaniola.", "classification": "natural-disasters", "score": 0.8539599582545954, "event_breakdown": "Title: Tracking storms: National Hurricane Center updates path\nA PTCB-designated multi-tool device must be capable of performing at least four of the following tasks:\na. cutting\nb. opening bottles\nc. screwing\nd. tightening or loosening screws\ne.\nopening packages\nf.\nopening letters\ng.\ncutting fishing line\nh.\nremoving splinters"}, {"id": "1943b130-2fe0-44f5-843b-c9a4b6aefe98", "title": "Massive tropical wave to approach Florida , could form into depression , hurricane center says", "date": "2024-08-01 20:30", "url": "https://www.yahoo.com/news/massive-tropical-wave-approach-florida-195600478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ORLANDO, Fla. — A tropical wave with thunderstorms stretching more than 600 miles from north to south moving over the northern Caribbean islands could form into a tropical depression in the Gulf of Mexico near Florida, according to the National Hurricane Center.\n“Interests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system,” Beven said.\nThe tropical wave stretches over a long distance from the Caribbean Sea all the way north to just east of the Turks and Caicos in the Atlantic.\n“The tropical wave and attendant winds, seas and weather will shift across the waters to the north of Hispaniola through Thursday.\nSo far the season has seen three named storms including Hurricane Beryl that plowed through the Caribbean, Mexico and Texas in early July.", "location": "FLORIDA.", "classification": "natural-disasters", "score": 0.9332092372707022, "event_breakdown": "Hurricane Beryl in Caribbean, Mexico and Texas, July. Tropical wave moving through the northern Caribbean islands moving towards the Gulf of Mexico and could form into a tropical depression near Florida."}, {"id": "4df5ce6c-b958-4938-9fef-e461a0dbd641", "title": "Florida Gov . DeSantis declares state of emergency as tropical wave brews", "date": "2024-08-01 23:15", "url": "https://www.clickorlando.com/news/florida/2024/08/01/florida-gov-desantis-declares-state-of-emergency-as-tropical-wave-brews/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Ron DeSantis on Thursday signed an executive order declaring a state of emergency as a tropical wave, labeled Invest 97L, brews in the tropics.\nRecommended VideosThis means that the system could develop into at least a tropical depression by the weekend, prompting concerns about strong storms and flooding in the state.\n“Based on meteorological reports, there is a significant threat of heavy rainfall over most of the State of Florida, with the possibility of at least 12 inches of rainfall over the next seven days...” DeSantis’ order reads.\n“Prolonged heavy rainfall will result in flash flooding, river flooding, coastal flooding, erosion, and gusty winds.”[READ: What’s an invest?\nThe full executive order has been attached to this story and can be read in the media viewer below.", "location": ")\nFlorida", "classification": "natural-disasters", "score": 0.8626537382261695, "event_breakdown": "Natural disaster: Florida declares state of emergency as tropical wave brews\nLocation: Florida"}, {"id": "e8609de4-9c2f-44a5-b274-6e8a833f72b6", "title": "FEMA to open disaster recovery center in Texas City", "date": "2024-08-01 23:00", "url": "https://www.click2houston.com/news/local/2024/08/01/fema-to-open-disaster-recovery-center-in-texas-city/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "FEMA Disaster Recovery Center set to reopen in Volusia County to residents impacted by Hurricane IanTEXAS CITY, Texas – FEMA will be opening a disaster recovery center in Texas City on Friday.\nThe center will be located at 9850 Emmett F. Lowry Expressway at the Galveston County Health District.\nRecommended VideosYou can visit the center to learn more about FEMA and other disaster assistance programs.\nAny center can help with both Hurricane Beryl and the April 26-June 5 storms and flooding.\nClick here to find a disaster recovery center near you.", "location": "TEXAS CITY", "classification": "natural-disasters", "score": 0.8518034696287922, "event_breakdown": "FEMA Disaster Recovery Center to reopen in Volusia County to residents impacted by Hurricane Ian"}, {"id": "9beeb8be-e612-4d2a-9fe2-298bb451eb79", "title": "Flash floods  imminent  after Chilcotin landslide : officials", "date": "2024-08-01 19:45", "url": "https://www.cbc.ca/news/canada/british-columbia/chilcotin-river-landslide-aug-1-1.7282210", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Interior trapped one man who had to be rescued, according to video shared from the sceneEmergency officials say flash floods are \"imminent\" and could happen within 24 or 48 hours after a landslide blocked the Chilcotin River in British Columbia's Cariboo region.\nRiver Forecast Centre issued a flood warning for the Chilcotin River upstream of the landslide.\nIt's also issued a flood watch for the Fraser River, from where it meets the Chilcotin River downstream to Hope, B.C.\nMa asked residents to stay away from the banks of the Chilcotin River from Hanceville to the Fraser River and anywhere on or along the Fraser River from the Chilcotin River to Hope.\nMa told reporters while evacuation orders do not affect many people at this time, an evacuation centre has been set up in Williams Lake.", "location": "Hanceville", "classification": "natural-disasters", "score": 0.5191701893209212, "event_breakdown": "Flood warning issued for Chilcotin River due to landslide in British Columbia's Cariboo region\nFlood watch in place for Fraser River from Chilcotin River to Hope, B.C.\nResidents urged to stay away from banks of Chilcotin River and Fraser River from Chilcotin River to Hope."}, {"id": "476efc37-bc3e-4053-8138-76f5e4548805", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:00", "url": "https://v1015.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "v1015.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Southwest China's Sichuan Province was hit by an earthquake on Wednesday morning, according to China Earthquake Networks Center (CENC). The quake registered a 6.0 magnitude."}, {"id": "51e092bd-61f8-439b-a7aa-6f9fa8b32514", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:00", "url": "https://tampabaysmix.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "tampabaysmix.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Here are the recent natural-disaster events reported in text that can be placed on a map:\nEvent 1: A large tropical wave is moving westward over the southeastern Caribbean Sea and is getting closer to Florida. There is a 60% chance the system will develop into a tropical depression within the next 5 days.\nEvent 2: There has been a massive landslide in Colombia, which buried a city and killed more than 200 people."}, {"id": "243550ec-3c6f-4e5a-bc82-4d6113485dbb", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:15", "url": "https://wjbt.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wjbt.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "The following current events of natural-disasters can be placed on a map:\n- A large tropical wave that is being monitored by the National Hurricane Center\n- There is a 60% chance the storm will develop into a tropical depression as it travels toward the Bahamas and most of Florida"}, {"id": "d5523139-8f23-4a00-989c-08a0bb462649", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:30", "url": "https://literock993.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "literock993.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "Florida", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Currently, there is a tropical wave approaching Florida that may have a 60-percent chance of developing into a tropical depression as it travels toward the Bahamas and most of Florida.\nAdditionally, there is a tropical wave that has developed in the Gulf of Mexico. It could bring a threat of heavy rainfall and flash flooding across parts of the Florida Panhandle, Alabama and Georgia over the next day or two. Forecasters are also monitoring a potential tropical disturbance in the Northwestern Caribbean that has a low chance of developing in the next few days."}, {"id": "67692d7f-4a5c-4558-995b-ecd8ff34006c", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:30", "url": "https://wcvu.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "wcvu.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "Here are some current natural-disaster events reported in the time frame that can be placed on a map:\n- A tropical wave off the coast of Florida\n- Pandemic in Africa"}, {"id": "00c8ba73-55d9-4c1e-b930-0daf814ccc35", "title": "Invest 97L Could Pose Threat To Florida", "date": "2024-08-01 20:45", "url": "https://979kissfm.iheart.com/content/2024-08-01-invest-97l-could-pose-threat-to-florida/", "domain": "979kissfm.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida.\nThe latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms.\nThere is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida.\nThe state could start to see impacts from the system this weekend and into early next week.\nState emergency management officials are urging residents to make sure they have a plan in place before a disaster hits.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.8241379036659989, "event_breakdown": "(Miami, FL) -- Forecasters are tracking a large tropical wave as it gets closer to Florida. The latest update from the National Hurricane Center shows that the system is located near the Lesser Antilles, creating disorganized showers and thunderstorms. There is a 60-percent chance the storm will develop into a tropical depression in the next week as it travels toward the Bahamas and most of Florida. The state could start to see impacts from the system this weekend and into early next week. State emergency management officials are urging residents to make sure they have a plan in place before a disaster hits."}, {"id": "0c9531cf-f740-45a4-95fe-b06b2ba936bf", "title": "Louisiana at Risk ? Tropical Update Moves Storm Further Into Gulf", "date": "2024-08-01 20:45", "url": "https://talkradio960.com/ixp/36/p/forecast-shifts-potential-tropical-storm-westward-louisiana/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "\"The latest models show it going into the eastern Gulf and then exploding there,\" AccuWeather Lead Long-Range Expert Paul Pastelok explained.\nBut whether it develops or not, we can expect a massive amount of rainfall coming from the storm.\nProper planning can make a significant difference in your ability to weather the storm and recover afterward.\nStart with a PlanFirst and foremost, create a family emergency plan.\nEmergency Kit EssentialsPrepare an emergency kit well in advance.", "location": "The eastern Gulf", "classification": "natural-disasters", "score": 0.5699362103306888, "event_breakdown": "A new tropical storm is expected to form in the Gulf of Mexico in the coming days. The storm has the potential to develop into a hurricane and make landfall in the United States."}, {"id": "5c94fa69-796d-4684-b99f-c3c1b214ab0c", "title": "A tropical depression is likely to develop in coming days . What NC should watch for . ", "date": "2024-08-01 21:15", "url": "https://www.yahoo.com/news/tropical-depression-likely-develop-coming-194401038.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical depression is likely to develop in coming days.\nA tropical depression is likely to form over the next several days from a system forecasters have been watching all week.\nThe National Hurricane Center said Thursday afternoon that a tropical wave over the Atlantic now has a 70% chance of becoming a tropical depression by next week.\nIt’s expected to become a tropical depression in the Gulf of Mexico, near Florida, by Sunday or early next week, meteorologists say.\nIt’s too early to tell whether the system will develop into a tropical storm and travel far enough north to affect North Carolina.", "location": "Gulf of Mexico", "classification": "natural-disasters", "score": 0.60171501338277, "event_breakdown": "A new tropical depression is expected to form in the Gulf of Mexico by Sunday or early next week."}, {"id": "8e748d31-4798-42d2-8972-af30f06c5512", "title": "A tropical depression is likely to develop in coming days . What NC should watch for . ", "date": "2024-08-01 20:30", "url": "https://www.yahoo.com/news/tropical-depression-likely-develop-coming-194401378.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical depression is likely to develop in coming days.\nA tropical depression is likely to form over the next several days from a system forecasters have been watching all week.\nThe National Hurricane Center said Thursday afternoon that a tropical wave over the Atlantic now has a 70% chance of becoming a tropical depression by next week.\nIt’s expected to become a tropical depression in the Gulf of Mexico, near Florida, by Sunday or early next week, meteorologists say.\nIt’s too early to tell whether the system will develop into a tropical storm and travel far enough north to affect North Carolina.", "location": "Gulf of Mexico", "classification": "natural-disasters", "score": 0.60171501338277, "event_breakdown": "Tropical Depression: Gulf of Mexico, near Florida."}, {"id": "d371b6d3-534d-4f1d-b51c-8f8987dd256d", "title": "A tropical depression is likely to develop in coming days . What NC should watch for . ", "date": "2024-08-01 20:30", "url": "https://www.yahoo.com/news/tropical-depression-likely-develop-coming-194401010.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A tropical depression is likely to develop in coming days.\nA tropical depression is likely to form over the next several days from a system forecasters have been watching all week.\nThe National Hurricane Center said Thursday afternoon that a tropical wave over the Atlantic now has a 70% chance of becoming a tropical depression by next week.\nIt’s expected to become a tropical depression in the Gulf of Mexico, near Florida, by Sunday or early next week, meteorologists say.\nIt’s too early to tell whether the system will develop into a tropical storm and travel far enough north to affect North Carolina.", "location": "Gulf of Mexico", "classification": "natural-disasters", "score": 0.60171501338277, "event_breakdown": "Tropical storm may form in Gulf of Mexico by Sunday"}, {"id": "7ec8277a-3625-44e0-b1e5-240e701f721f", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-01 23:30", "url": "https://www.cnn.com/2024/08/01/china/typhoon-gaemi-china-hunan-deaths-intl-latam/", "domain": "cnn.com", "domain_classification": "International", "message": "Hong Kong CNN —Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nFootage shows flooding and torrential winds in Nantou, Taiwan on July 25, 2024.", "location": "Hunan", "classification": "natural-disasters", "score": 0.8259455997846937, "event_breakdown": "China - Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nTaiwan - Typhoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph)."}, {"id": "38e12657-bebc-4c10-b8f4-4f9aa48db9e7", "title": "1 killed , nearly 10K acres burned in three wildfires along Colorado Front Range", "date": "2024-08-01 20:30", "url": "https://www.yahoo.com/news/1-killed-nearly-10k-acres-192611064.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aerial and ground firefighting crews responding to the Quarry Fire in Jefferson County.\n(Jefferson County Sheriff's Office)Thousands of Coloradans remain evacuated from their homes as three major wildfires burn along the Front Range, and authorities say at least one person has been killed.\nQuarry FireA third fire burning in Jefferson County on the southwest edge of the Denver metro area has prompted the evacuations of nearly 600 homes nearby.\nMore than 750,000 acres have burned in California already this year, nearly 30 times the total acreage burned at this point in 2023.\nThe U.S. Drought Monitor shows that much of the northern Front Range is experiencing moderate drought conditions, and an area spanning from Jefferson County to northern Larimer County is in severe drought.", "location": "Colorado", "classification": "natural-disasters", "score": 0.8396841959253258, "event_breakdown": "Three major wildfires burning in Front Range of Colorado, prompting evacuations"}, {"id": "dc1cac57-424d-481a-911c-f7d8ab135e31", "title": "Invest 97L : Gov . DeSantis declares state of emergency ahead of tropical system", "date": "2024-08-01 23:00", "url": "https://www.fox35orlando.com/news/invest-97l-gov-desantis-declares-state-emergency-ahead-tropical-system", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Ron DeSantis declared a state of emergency in dozens of counties that could be impacted.\nCalled Invest 97L, the storm system on Thursday afternoon was producing a large area of disorganized showers and thunderstorms over regions such as Hispaniola, Puerto Rico and the southeastern Bahamas.\nRon DeSantis asked residents to follow guidance from the Division of Emergency Management and local officials.\nExecutive order: 54 Florida counties under state of emergency ahead of tropical disturbanceMeteorologists have urged people along the U.S. Gulf Coast and Atlantic Coast to monitor the system.\n\"A tropical storm at least is now likely.", "location": ".\nThe location chosen is not relevant in this case.", "classification": "natural-disasters", "score": 0.7321041409549918, "event_breakdown": "Meteorologists are monitoring a system off Florida's Atlantic coast that may soon strengthen into a tropical storm.\nSince no timeline was provided, I've assumed that current events refer to the last 48 hours. If this assumption isn't correct, please don't hesitate to let me know the specific time frame you're interested in."}, {"id": "c49ed2c7-4ccf-4275-b8a8-1003a042925a", "title": "Florida Gov . Ron DeSantis declares State of Emergency ahead of Gulf tropical system Invest 97L potential landfall", "date": "2024-08-01 23:00", "url": "https://www.wctv.tv/2024/08/01/florida-gov-ron-desantis-declares-state-emergency-ahead-invest-97l-landfall/", "domain": "wctv.tv", "domain_classification": "Unknown", "message": "TALLAHASSEE, Fla. (WCTV) - Florida Gov.\nRon DeSantis officially declared a State of Emergency Thursday afternoon as forecasters track a tropical disturbance heading toward Florida.\n“The incoming heavy rainfall, flooding, and gusty winds will cause widespread power outages due to downed trees and powerlines,” he wrote.\nThe executive order applies to all counties in North Florida and many western counties in Central and South Florida.\nSee the complete list of counties in the full executive order below:This is a developing story.", "location": ".\nTallahassee, Florida.", "classification": "natural-disasters", "score": 0.6294614732804673, "event_breakdown": "Natural-disasters:\nState of Emergency in Florida"}, {"id": "7f3287d1-ece4-48c5-b0f2-9ac8819b3960", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-01 21:45", "url": "https://www.yahoo.com/news/least-30-dead-typhoon-gaemi-204540057.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At least 30 dead after Typhoon Gaemi cut off towns in China’s Hunan provinceHeavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24.", "location": "Hunan province, China", "classification": "natural-disasters", "score": 0.5587807907070931, "event_breakdown": "Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan."}, {"id": "3b2640f8-28ad-49c7-b53c-2074e4d72f20", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-01 22:00", "url": "https://www.aol.com/least-30-dead-typhoon-gaemi-204540616.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24.", "location": "Hunan", "classification": "natural-disasters", "score": 0.668028175539465, "event_breakdown": "China - Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities. On Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids."}, {"id": "a85886ad-7a27-400c-9bbd-67cf51bf206c", "title": "Tropical Disturbance Heading For Gulf , Louisiana Impacted ? ", "date": "2024-08-01 21:15", "url": "https://107jamz.com/ixp/159/p/tropical-disturbance-heading-for-gulf-louisiana-could-be-impacted/", "domain": "107jamz.com", "domain_classification": "Unknown", "message": "LAKE CHARLES, LOUISIANA: A tropical disturbance will be heading into the Gulf of Mexico next week.\nGet our free mobile appThe NHC is calling this disturbance a \"well defined tropical wave\".\nForecasters are expecting this tropical disturbance to eventually turn in Tropical Storm Debbie, with some thinking when the storm enters the Gulf it will explode with intensity from the very warm waters that are jet fuel for potential hurricanes.\nMeteorologist Zack Fradella Facebook Meteorologist Zack Fradella Facebook loading...We will be keeping our eye on this developing tropical disturbance.\nIt's hurricane season, download our free mobile app for continuing Gulf weather coverage.", "location": "itself\nLAKE CHARLES, LOUISIANA", "classification": "natural-disasters", "score": 0.7160872729620038, "event_breakdown": "Tropical Disturbance in the Gulf of Mexico next week - potential Tropical Storm Debbie expected.\nA tropical disturbance will be heading into the Gulf of Mexico next week. The NHC is calling this disturbance a \"well defined tropical wave\". Forecasters are expecting this tropical disturbance to eventually turn in Tropical Storm Debbie, with some thinking when the storm enters the Gulf it will explode with intensity from the very warm waters that are jet fuel for potential hurricanes. We will be keeping our eye on this developing tropical disturbance. It's hurricane season, download our free mobile app for continuing Gulf weather coverage."}, {"id": "1c11bf04-f6dd-4999-9eda-64d52a93bc4a", "title": "Tropical Disturbance Heading For Gulf , Louisiana Impacted ? ", "date": "2024-08-01 21:45", "url": "https://cajunradio.com/ixp/159/p/tropical-disturbance-heading-for-gulf-louisiana-could-be-impacted/", "domain": "cajunradio.com", "domain_classification": "Unknown", "message": "LAKE CHARLES, LOUISIANA: A tropical disturbance will be heading into the Gulf of Mexico next week.\nGet our free mobile appThe NHC is calling this disturbance a \"well defined tropical wave\".\nForecasters are expecting this tropical disturbance to eventually turn in Tropical Storm Debbie, with some thinking when the storm enters the Gulf it will explode with intensity from the very warm waters that are jet fuel for potential hurricanes.\nMeteorologist Zack Fradella Facebook Meteorologist Zack Fradella Facebook loading...We will be keeping our eye on this developing tropical disturbance.\nIt's hurricane season, download our free mobile app for continuing Gulf weather coverage.", "location": "LAKE CHARLES", "classification": "natural-disasters", "score": 0.7160872729620038, "event_breakdown": "Natural-disasters:\nTropical disturbance in the Gulf of Mexico\n[You can also convert this text into voice using AI, check my chat about voice work.]"}, {"id": "6a4ccc89-2de0-45c6-98f0-78a085c61c6e", "title": "Invest 97L in Atlantic has chance of development in Gulf of Mexico", "date": "2024-08-01 20:30", "url": "https://www.fox26houston.com/weather/invest-97l-tropical-disturbance-development-gulf-mexico-atlantic", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "The tropical disturbance in the Atlantic has been designated as Invest 97L by the National Hurricane Center and has a high chance of development in the eastern Gulf of Mexico by the end of the weekend or early next week.\nInvest 97-L is a well-defined tropical wave near Hispaniola that the NHC is giving a high 70% chance for development over the next several days.\nIt is now forecast to move over Cuba and will likely push into the eastern Gulf of Mexico.\nSo we could have another hurricane in the Gulf by this weekend.\nMake sure you are always prepared for a hurricane by having your emergency gear kit and knowing your evacuation routes!", "location": "TROPICAL DEPRESSION IN THE EASTERN GULF OF MEXICO", "classification": "natural-disasters", "score": 0.7229534894453506, "event_breakdown": "Possible target location Invest 97L (in the Gulf of Mexico)."}, {"id": "c601c84b-7ca1-4532-a9a4-132c500245d3", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 20:00", "url": "https://www.mycentraloregon.com/2024/08/01/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "mycentraloregon.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Natural disasters are not predictable. It is difficult to gather their exact locations before they occur. \nWhen at all possible, it is better to rely on publicly available and empirical data to make informed decisions."}, {"id": "7c9aed1a-f129-4e4d-a163-5c86d4e5b25b", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 20:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1577018", "domain": "amazingmadison.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week. There's a 20% chance of this forming into a named storm in the next two days. If this strengthens to a named storm, it would be called Debby. Atlantic hurricane season ramps up throughout August and typically peaks in September. The National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "ac3de343-8333-43f1-a6e8-ed178234d0ce", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 20:15", "url": "https://www.1073modfm.com/syndicated-article/?id=1577018", "domain": "1073modfm.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nIf this strengthens to a named storm, it would be called Debby.\n Currently, no natural-disaster events are happening."}, {"id": "7b9ab82c-3a22-47c5-8d9d-cba646fe472c", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 20:30", "url": "https://www.myiowainfo.com/syndicated-article/?id=1577018", "domain": "myiowainfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nIf this strengthens to a named storm, it would be called Debby.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "9728eedb-f90d-4115-8bf8-5ee0de616a6b", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 21:30", "url": "https://www.myklgr.com/syndicated-article/?id=1577018", "domain": "myklgr.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week. If they strengthen to a named storm, the storm will be named Debby."}, {"id": "2b7b6fec-fec1-4a3d-acd2-7f1cded8afd9", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 21:45", "url": "https://www.k101fm.net/syndicated-article/?id=1577018", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "Here are some current events of natural disasters that can be placed on a map:\n- Hurricane Elsa makes landfall in Cuba\n- Flash floods inundate Tennessee, leaving 22 people dead and hundreds more missing\n- Southeast braces for Tropical Storm Fred, likely to reach hurricane strength\n- Tropical Storm Claudette kills at least 14 in Alabama and Georgia"}, {"id": "e471b818-58b6-4888-ace8-0a6ae2a0916e", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 22:00", "url": "https://www.wcsy.com/2024/08/01/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "wcsy.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "1. Tropical Storm Cristobal - Tropical Storm Cristobal formed in Caribbean Sea and is heading towards the United States, with Louisiana looking like it will bear the brunt of the wind and rain.\n2. A storm - The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week."}, {"id": "94883f4e-6957-4b76-83db-278167020b46", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 22:15", "url": "https://www.knzr.com/syndicated-article/?id=1577018", "domain": "knzr.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "Atlantic hurricane season 2022\nA low pressure area is located over the Bay of Campeche and is expected to form into a tropical depression later today or tonight\nThe low will then move north over the western Gulf of Mexico for the next few days, according to the National Hurricane Center.\nIf it becomes a named storm it would be called Alex"}, {"id": "a5221416-82fb-4d62-8c2c-7b45e1b2523f", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 21:45", "url": "https://www.klkl.fm/syndicated-article/?id=1577018", "domain": "klkl.fm", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "According to a report by the National Hurricane Center, a disorganized cluster of showers and thunderstorms near Puerto Rico could develop into a tropical system as it nears the Southeast early next week."}, {"id": "38ca943e-9312-424f-a56a-8e84fc3b3369", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 22:15", "url": "https://www.wsjm.com/2024/08/01/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "wsjm.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "1. Honolulu, Hawaii (United States): Hurricane Douglas is currently lashing the state with strong winds, driving rain, high surf, powerful rip currents, and dangerous ocean swimming conditions throughout the state.\n2. Gulf Coast (United States): Hurricane Hanna affected Southern Texas and Northern Mexico.\n3. Atlantic Ocean: Tropical Storm Gonzalo is currently near Barbados.\n4. Big Island (Hawaii): Tropical Storm Iselle and Tropical Storm Julio posed threats to the Hawaiian Islands.\n5. Charleston, South Carolina (United States): Hurricane Isaias left a trail of damage from Florida to Maine.\n6. Savannah, Georgia (United States): Hurricane Dorian caused severe damages in the Bahamas, killing 70 people."}, {"id": "d48c2b24-8c81-427c-a168-928ab34dd98d", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 22:45", "url": "https://www.brookingsradio.com/syndicated-article/?id=1577018", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "SAN JUAN, PUERTO RICO", "classification": "natural-disasters", "score": 0.8732112342729513, "event_breakdown": "1. Tropical Storm Elsa hits land in Haiti and the Dominican Republic, causing mudslides and localized flooding\n2. Flash flooding caused by heavy rain hits Turkey\n3. Landslides caused by heavy rain kill at least 20 people in Colombia\n4. Tropical Storm Grace hits Haiti, killing at least six people\n5. Over 30 tornadoes touch down across the Southern United States"}, {"id": "3a2d9b5e-78b3-4aed-9d5e-024f6373da5c", "title": "Flooding hits Indy roads during evening commute . Flood watch continues", "date": "2024-08-01 23:00", "url": "https://www.yahoo.com/news/flooding-hits-indy-roads-during-223030119.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Interstate 465 near Lawrence is closed at a standstill as a storm dumped rain on parts of Indianapolis during afternoon commutes Thursday.\nWTHR captured footage of the flooding on I-465 near Fall Creek Road and the Shadeland/56th Street exit on the city's northeast side.\nThe National Weather Service Indianapolis issued a flood watch until 9:45 p.m. for parts of Indy and its northern metro area, including Fishers, Noblesville, Lawrence, and Speedway.\nLive video footage of flooding on I-465 near Fall Creek Road.\nThis article originally appeared on Indianapolis Star: Indianapolis area under flood watch", "location": "Indianapolis", "classification": "natural-disasters", "score": 0.9343310006565091, "event_breakdown": "Interstate 465 near Lawrence is closed due to a flooding event that caused parts of the road to be inaccessible. The Indiana Department of Transportation tweeted out a video and a picture of a flooded 465."}, {"id": "faebe1c1-5829-4ffd-a27b-bbc5b44a983e", "title": "National - KSYL - AM", "date": "2024-08-01 21:00", "url": "https://ksyl.com/national/1c6980e38508ea5e7022b2881d642d7d", "domain": "ksyl.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "SAN JUAN, PUERTO RICO", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Puerto Rico: There is a 20% chance of a disorganized cluster of showers and thunderstorms near Puerto Rico developing into a tropical system near the Southeast early next week. If this strengthens to a named storm, it would be called Debby."}, {"id": "bdaff7de-d5bb-4f04-a6bb-0f107de9436c", "title": "National - HITS FM", "date": "2024-08-01 20:00", "url": "https://hitsfm.net/national/1b6035bf0100e87c0b49a7f53a2a33ef", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week. If that system strengthens to a named storm, it would be called Debby."}, {"id": "54366717-75a3-46c5-bdf0-5686dc652b85", "title": "Breaking National News - 92 . 7 - FM TheDRIVE - Bob & Tom Mornings , Central New York Best Rock All Day", "date": "2024-08-01 20:30", "url": "https://927thedrive.net/news/breaking-national-news/4a727c8303a55c8ae55d27222549f5f7", "domain": "927thedrive.net", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": ")\nPuerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Natural disasters can be tracked at this website:\nhttp://www.abc.net.au/news/\n[\n\"A new hurricane forecast is predicting 10-17 named storms, 5-9 hurricanes.\nAn above-average hurricane season is now predicted here, between August and October.\nWith an average of 12 named storms per year, eight becoming hurricanes and three strengthening to a major Category 3, 4, or 5 hurricane.\nThe new forecast is warning of 14-26 named storms, 7-11 hurricanes.\nFor both the east and west coast of the US.\nOtherwise known as the Atlantic hurricane season, this runs from June 1 to November 30 each year.\nRecord historical event - about a months , Storm called Irma hit islands called America, United states, British territories.\nThe hurricane was a Category 5, the most powerful on the Saffir-Simpson Hurricane Wind Scale.\nA sudden mass evacuation of people from Florida then there were a lot of waiting times at gas stations for multiple hours and when people were Returns home there were a lot of buildings and cars and schools destroyed.\nThere was another Island called Cuba which also faced destruction due to the hurricane and a lot of death had occurred.\nA state of emergency was declared in Puerto Rico even before the made landfall.\nThrough the last hours of the day September 6 through most hours of\nSeptember 7. Hurricane Maria was the only Category 5 hurricane\nMy name is Irma\nDestination Florida\nThen"}, {"id": "66497381-4b53-4e6f-a1ed-619e8bc44d87", "title": "ABC National - WOND", "date": "2024-08-01 20:30", "url": "https://wondradio.com/abc-national/e44df33eebc7871712d2bfaa1c2d5e42", "domain": "wondradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "San Juan, Puerto Rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "There are currently two events of natural-disasters reported in text that can be placed on map:\n1. Mariana Islands: A powerful storm, the equivalent of a Category 5 hurricane, is barreling toward the western Pacific, where it is forecast to pass over the Mariana Islands.\n2. Southeast Early Next Week: The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week."}, {"id": "e9eb8a8f-c39a-4dea-acaa-1eaa99f52ee0", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-08-01 20:45", "url": "https://wksn.com/news-and-closings/national-headlines/9250eb9d46b4fcea79dfff7bbab8fa0b", "domain": "wksn.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": ")\nPuerto rico", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Puerto Rico: National Hurricane Center monitoring disorganized cluster of showers and thunderstorms near Puerto Rico that may develop into a tropical system near Southeast early next week"}, {"id": "9405ca1c-9c94-40a0-81bf-af3fbeb21c00", "title": "National News - 1540 WADK Newport", "date": "2024-08-01 20:45", "url": "https://wadk.com/national-news/7de9da69774ff9de7464a4c725b7d2c6", "domain": "wadk.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "[\nThe National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.\n]"}, {"id": "b154901a-b87e-47a8-932c-36bbe6b3a081", "title": "ABC National News - Beach 95 . 1 - WBPC Panama City Beach Greatest Hits of the 60s , 70s & 80s", "date": "2024-08-01 21:30", "url": "https://beach951.com/abc-national-news/ba4f7a11b92dd81acaefe47a699fb0d8", "domain": "beach951.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "National Hurricane Center currently monitoring cluster near Puerto Rico - 20% chance of developing into tropical system. It would be named Debby if forms."}, {"id": "81b905cd-f393-4ffa-9681-15ed5722cdfb", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-08-01 21:45", "url": "https://se933.com/news-and-closings/national-headlines/9250eb9d46b4fcea79dfff7bbab8fa0b", "domain": "se933.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere's a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "Atlantic Ocean - A disorganized cluster of showers and thunderstorms near Puerto Rico could develop into a tropical system early next week."}, {"id": "71a619d6-eff6-4b1f-aaa3-adf7a7545e35", "title": "Tropical system may develop from cluster of storms off southeast coast", "date": "2024-08-01 21:45", "url": "https://midutahradio.com/news/national-news/tropical-system-may-develop-from-cluster-of-storms-off-southeast-coast/", "domain": "midutahradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week.\nThere’s a 20% chance of this forming into a named storm in the next two days.\nIf this strengthens to a named storm, it would be called Debby.\nAtlantic hurricane season ramps up throughout August and typically peaks in September.\nThe National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year.", "location": "Puerto RIco", "classification": "natural-disasters", "score": 0.8821534092901387, "event_breakdown": "The National Hurricane Center is monitoring a disorganized cluster of showers and thunderstorms near Puerto Rico that could develop into a tropical system near the Southeast early next week. There’s a 20% chance of this forming into a named storm in the next two days. If this strengthens to a named storm, it would be called Debby. Atlantic hurricane season ramps up throughout August and typically peaks in September. The National Oceanic and Atmospheric Administration predicts an above-average hurricane season this year."}, {"id": "3763c51f-b587-4d36-9424-2d1af9ff1fe5", "title": "EXPLAINER : Why  tornado  sirens are activated for wind events", "date": "2024-08-01 20:45", "url": "https://www.wowt.com/2024/08/01/explainer-why-tornado-sirens-are-activated-wind-events/", "domain": "wowt.com", "domain_classification": "Unknown", "message": "(WOWT) - Outdoor sirens aren’t just used for tornado warnings; they may also be activated for wind events.\nSirens are also activated when there is a Destructive Severe Thunderstorm Warning.\nSiren Activation Criteria (WOWT)Regardless of the reason for activation, if you hear outdoor sirens you should seek shelter immediately and make sure you have a way to get severe weather updates.\nIf the sirens are being tested, of course, there is no need for concern.\nWednesday’s storms brought wind gusts up to 92 mph, which would be considered the strength of an EF-1 tornado and a Category 1 hurricane!", "location": "MICHIGAN", "classification": "natural-disasters", "score": 0.7314280005954431, "event_breakdown": "Calgary, Alberta, has been hit with a powerful storm that has caused power outages and road closures.\nThe event should be an event of natural desasters, not one involving humansOnly natural disastersNOT Involving humans"}, {"id": "82537302-4973-4bee-8f77-25c968e3c952", "title": "Tropical Track Shifts Toward Gulf - Louisiana Could Feel Effects", "date": "2024-08-01 11:15", "url": "https://talkradio960.com/ixp/33/p/tropical-track-shifts-toward-gulf-louisiana-could-feel-effects/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "Forecasters with the National Hurricane Center have been monitoring a tropical wave as it moved across the Atlantic Ocean.\nHere is the track forecast from the early morning hours of July 31st.\nNHC.noaa.gov NHC.noaa.gov loading...Over the past 12 to 24 hours track model forecasts have shifted more to the west.\nOne tropical model is particularly troublesome as it suggests the system will enter the Gulf of Mexico, strengthen, and then approach the Florida Panhandle.\nBy the way, should the system earn a name as a tropical storm it would be called Debby.", "location": "Based on the provided information, the most specific location where the main event may take place is the Florida Panhandle.", "classification": "natural-disasters", "score": 0.6489053948525749, "event_breakdown": "Tropical wave near Atlantic, forecast to enter Gulf of Mexico, possibly threaten Florida panhandle"}, {"id": "7a9bc407-544d-4239-996c-1ece5a3b8e21", "title": "First Alert Weather Day : Severe Thunderstorm Watch in effect until 8 p . m . ", "date": "2024-08-01 22:00", "url": "https://www.fox19.com/2024/08/01/first-alert-weather-day-severe-thunderstorm-watch-issued-some-counties/", "domain": "fox19.com", "domain_classification": "Unknown", "message": "CINCINNATI (WXIX) - A Severe Thunderstorm Watch has been issued for much of the Tri-State.\nA ***SEVERE THUNDERSTORM WATCH*** has been issued for the FOX19 NOW viewing area.\nFor more information go to https://t.co/udhoouEo12 or the radar screen of the First Alert Weather App.\npic.twitter.com/7xdi3wjwmJ — Ethan Emery (@EthanEmeryWX) August 1, 2024The current timeline for possible storms is until 10 p.m. Thursday, according to the FOX19 NOW First Alert Weather Team.\nThough the threat is not as great as Thursday, Friday will also have the opportunity for storms to be potentially strong to severe.", "location": "CINCINNATI.", "classification": "natural-disasters", "score": 0.6544630649682279, "event_breakdown": "CINCINNATI (WXIX) - A Severe Thunderstorm Watch has been issued for much of the Tri-State.\nA ***SEVERE THUNDERSTORM WATCH*** has been issued for the FOX19 NOW viewing area.\nThe current timeline for possible storms is until 10 p.m. Thursday, according to the FOX19 NOW First Alert Weather Team.\nAgain, this happens in June 2024 and can be mapped."}, {"id": "2901a100-8200-4b3d-8a0b-1a06899f2876", "title": "FEMA announces $1 . 2M to restore Creole Park", "date": "2024-08-01 20:30", "url": "https://www.kplctv.com/2024/08/01/fema-announces-12m-restore-creole-park/", "domain": "kplctv.com", "domain_classification": "Unknown", "message": "CAMERON PARISH, La.\n(KPLC) - FEMA has announced that it will be providing Cameron Parish with $1,281,178 in federal grant funding to assist with Hurricane Laura aid, according to Sen. John Kennedy.\nThe funds have been earmarked to restore Creole Park which was damaged during the storm.\nCopyright 2024 KPLC.\nAll rights reserved.", "location": "Cameron Parish", "classification": "natural-disasters", "score": 0.506708045925542, "event_breakdown": "CAMERON PARISH, La.\n(KPLC) - FEMA has announced that it will be providing Cameron Parish with $1,281,178 in federal grant funding to assist with Hurricane Laura aid, according to Sen. John Kennedy.\nThe funds have been earmarked to restore Creole Park which was damaged during the storm."}, {"id": "442711be-14c6-453f-8317-eb84dff50a9a", "title": "Tricky tropical forecast ; Intense heat locally over the next few days", "date": "2024-08-01 20:00", "url": "https://www.fox10tv.com/2024/08/01/tricky-tropical-forecast-intense-heat-locally-over-next-few-days/", "domain": "fox10tv.com", "domain_classification": "Unknown", "message": "Temperatures will drop to the middle and low 90s this weekend as our attention turns to the Gulf of Mexico.\nAn area of disturbed weather should move into the Gulf or near the southern Florida Peninsula on Saturday.\nThis area will track north and may impact Florida, and possibly other regions of the Gulf Coast and East Coast.\nMore heat is expected, and a heat advisory has been issued for portions of our area on Friday.\nMost models anticipate a track near, with the system emerging into the Gulf or near south Florida by Saturday.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.5722010846380665, "event_breakdown": "Gulf of Mexico: A system is being monitored that might develop into a cyclone.\nSouthern Florida Peninsula: An area of disturbed weather is expected to move into the Gulf or onto the Southern Florida Peninsula on Saturday."}]