[{"id": "2dcada3e-8051-4dc3-a076-24026bd9b809", "title": "SC legislators approve antisemitism bill amid national wave of Israel - Hamas war protests", "date": "2024-05-03 19:45", "url": "https://www.yahoo.com/news/sc-legislators-approve-antisemitism-bill-183503227.html", "message": "And no reports of insults, harassment or threats of violence aimed at Jewish students.\nStill, as students finish final exams and campuses empty for the summer, lawmakers point to a bill codifying a definition of antisemitism into state law.\nProtests in SCOut of South Carolina’s largest college campuses, only one — the University of South Carolina — has reported minor protest activity.\nApplying the definitionBernstein acknowledged that if her bill becomes state law, applications of what’s antisemitic would be limited to policies and regulations at state agencies, which include public universities.\nThe post SC legislators approve antisemitism bill amid national wave of Israel-Hamas war protests appeared first on SC Daily Gazette.", "location": "University of South Carolina", "classification": "antisemitism", "score": 0.9266057748858451, "event_breakdown": "- Protest activity at the University of South Carolina in South Carolina, USA.\n- State law bill codifying a definition of antisemitism in South Carolina, USA."}, {"id": "68adee21-f797-42fe-b2f8-8ee9452abf15", "title": "Antisemitism Report : Anti - Jewish hate goes from bad to worse in 2023", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-799850", "message": "“October 7 helped spread a fire that was already out of control,” the report stated.\nAustralia in particular recorded 622 antisemitic incidents in October and November 2023, in comparison to 79 during the same period in 2022.\n“Israel does not have a meaningful strategic plan for combating antisemitism that is based on the needs of Jewish communities.\nFighting antisemitism is failingTHE IMPOSSIBILITY of reliably tracking antisemitic incidents in Russia at present was discussed in the report as well.\n“Two years ago, this report stated that the fight against antisemitism was failing.", "location": "Australia", "classification": "antisemitism", "score": 0.909906376794986, "event_breakdown": "- October 7: Fire spreads out of control\n- October and November 2023: 622 antisemitic incidents recorded in Australia\n- Israel lacks meaningful strategic plan for combating antisemitism\n- Difficulty in tracking antisemitic incidents in Russia\n- Fight against antisemitism was reported as failing two years ago"}, {"id": "5e1ce0f1-77aa-4656-8965-5389d71682e4", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-04 04:15", "url": "https://www.pressherald.com/2024/05/03/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests-2/", "message": "As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni.", "location": "U.S. colleges", "classification": "antisemitism", "score": 0.9452010145600844, "event_breakdown": "- Strident pro-Palestinian protests dominating U.S. colleges\n- Few Jewish students responding with rallies in support of Israel or against perceived displays of antisemitism\n- Wide-ranging and nuanced views of Jewish students on the war in Gaza and the Israeli-Palestinian conflict\n- Groups planning dozens of rallies in support of Jewish students from coast to coast\n- Punctuations of hatred among antiwar protests rattling many Jewish students\n- Some Jewish students arguing to ignore the pro-Palestinian encampment on campus, as expressed by Eliana Halivni"}, {"id": "bae98bb8-3d02-44a7-a000-e36ebe05c922", "title": "SJP receive funds , resources from Hamas - linked groups - report", "date": "2024-05-03 18:45", "url": "https://www.jpost.com/israel-hamas-war/article-799733", "message": "The widely-banned campus protest groups Students for Justice in Palestine (SJP) and National Students for Justice in Palestine (NSJP) are receiving funds from a web of Hamas-linked organizations, according to new research by The Institute for the Study of Global Antisemitism and Policy (ISGAP) which was published on Friday.\nThe research, entitled ‘National Students for Justice in Palestine (NSJP): Antisemitism, Anti-Americanism, Violent Extremism and the Threat to American Universities,’ claimed that non-profit organizations with links to the Hamas terror group were funding the student groups.\nThe report named WESPAC, Tides, American Muslims for Palestine (AMP), Americans for Justice in Palestine (AJP), and Jewish Voice for Peace (JVP) as the Hamas-linked funders.\nAMP, which is reportedly a non-profit under investigation by the Virginia attorney general, has also been accused of directly funding Hamas.\nEnabling SJP actionsThe report also charged that legal advocacy organizations like Palestine Legal provided legal assistance to defend SJP chapters against criticism, while simultaneously launching legal attacks against opponents.", "location": "The main location where the main event takes place cannot be determined based on the given information.", "classification": "antisemitism", "score": 0.8751286701295522, "event_breakdown": "- The Institute for the Study of Global Antisemitism and Policy (ISGAP) published research revealing that campus protest groups SJP and NSJP are receiving funds from Hamas-linked organizations\n- Non-profit organizations like WESPAC, Tides, AMP, AJP, and JVP were named as the funders of SJP and NSJP with links to Hamas\n- AMP, also under investigation by the Virginia attorney general, has been accused of directly funding Hamas\n- Legal advocacy organizations like Palestine Legal are providing legal assistance to defend SJP chapters against criticism and launching legal attacks against opponents."}, {"id": "34d02fab-5639-418d-b79f-1bd1624262c5", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 18:45", "url": "https://dunyanews.tv/en/World/809260-Jewish-students-grapple-with-how-to-respond-to-pro-Palestinian-campus-pr", "message": "Jewish students grapple with how to respond to pro-Palestinian campus protestsWorld World Jewish students grapple with how to respond to pro-Palestinian campus protestsJewish students grapple with how to respond to pro-Palestinian campus protestsFollow on Published On: Fri, 03 May 2024 23:19:30 PKTNEW YORK (AP) As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni.", "location": "NEW YORK", "classification": "antisemitism", "score": 0.9549108417208033, "event_breakdown": "1. Strident pro-Palestinian protests dominate U.S. colleges\n2. Few Jewish students respond with rallies in support of Israel or against perceived displays of antisemitism\n3. Jewish students' views on the war in Gaza and the Israeli-Palestinian conflict are wide-ranging and nuanced\n4. Groups in solidarity with Jewish students plan dozens of rallies across the country\n5. Punctuations of hatred among the antiwar protests have rattled many Jewish students\n6. Some Jewish students argue to ignore the pro-Palestinian encampment on campus"}, {"id": "42e1c9ee-04e7-49ff-bc02-562310f272f4", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests – WABE", "date": "2024-05-03 19:30", "url": "https://www.wabe.org/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Jewish students grapple with how to respond to pro-Palestinian campus protestsAs strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni.", "location": "U.S. colleges", "classification": "antisemitism", "score": 0.9496492115161131, "event_breakdown": "- Pro-Palestinian protests dominate U.S. colleges\n- Few Jewish students respond with rallies in support of Israel or against perceived antisemitism\n- Jewish students' views on the Israeli-Palestinian conflict are wide-ranging\n- Groups plan rallies in solidarity with Jewish students from coast to coast\n- Punctuations of hatred among antiwar protests unsettle Jewish students\n- Some Jewish students argue to ignore the pro-Palestinian encampment on campus"}, {"id": "f89084e8-f05a-4baf-a850-29b6c9b2e297", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 19:45", "url": "https://www.news4jax.com/news/national/2024/05/03/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Recommended VideosLike many Americans, Jewish students’ views on the Israeli-Palestinian conflict are wide-ranging and often nuanced.\nTheir goals include standing in solidarity with Jewish students and showing there’s room for empathy for both Palestinians and Israelis affected by the war.\nAt George Washington University in Washington, D.C., about 150 people — including many Jewish students — gathered Thursday in a grassy courtyard.\nBut instances of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel's government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni.", "location": "WASHINGTON, D.C.", "classification": "antisemitism", "score": 0.8833307141734014, "event_breakdown": "1. Gathering of about 150 people, including many Jewish students, in a grassy courtyard at George Washington University in Washington, D.C.\n2. Instances of hatred among antiwar protests that have rattled many Jewish students.\n3. Some Jewish students arguing to ignore the pro-Palestinian encampment on campus as a means of showing resilience and lack of impact on them."}, {"id": "f6f5e885-1cd7-4ea1-b69a-3bb207a2620d", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 19:30", "url": "https://www.bangordailynews.com/2024/05/03/nation/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Like many Americans, Jewish students’ views on the Israeli-Palestinian conflict are wide-ranging and often nuanced.\nTheir goals include standing in solidarity with Jewish students and showing there’s room for empathy for both Palestinians and Israelis affected by the war.\nAt George Washington University in Washington, D.C., about 150 people — including many Jewish students — gathered Thursday in a grassy courtyard.\nBut instances of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni.", "location": "George Washington University in Washington, D.C.", "classification": "antisemitism", "score": 0.9121195810779488, "event_breakdown": "Events in the text:\n\n1. Gathering of approximately 150 people, including many Jewish students, at George Washington University in Washington, D.C.\n2. Instances of hatred among antiwar protests, causing concern among Jewish students.\n3. Some Jewish students arguing to ignore the pro-Palestinian encampment on campus as a way to show resilience and unaffectedness."}, {"id": "04310563-dc67-4843-bdb9-c178fcfb18a7", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 16:30", "url": "https://www.oxfordmail.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\"", "location": "Bonn Square", "classification": "antisemitism", "score": 0.9518249232346063, "event_breakdown": "- March of Life initiated in Germany in 2007 with the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\"\n- Public memorial event in Bonn Square following the procession\n- Annual processions provide a platform for Holocaust survivors, encourage reconciliation between descendants of victims and perpetrators, and rally against present-day antisemitism\n- Christian community in Oxford to start procession from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude at Bonn Square on May 6 at 3pm\n- First time the event will be held in Oxford, with hopes of it becoming an annual fixture\n- Participants choose to act in solidarity with the Jewish community against increasing hatred at home and abroad"}, {"id": "22f9400c-0007-47aa-8c1f-fa5a31ff5394", "title": "Louisa County suspends funding to PVCC over alleged  antisemitic  film screening", "date": "2024-05-04 13:15", "url": "https://dailyprogress.com/news/local/education/louisa-county-suspends-funding-to-pvcc-over-alleged-antisemitic-film-screening/article_6a271bf4-07f2-11ef-9479-1ffc71a6b6cd.html", "message": "The Louisa County Board of Supervisors found this to be “antisemitic” and unanimously passed a resolution Monday night suspending all of the locality’s funding to the community college, which comes to just under $6,000.\nThough the resolution cites the film as the grounds for its decision, the board’s chairman, Duane Adams, said he was unaware of any film or film screening when The Daily Progress first reached out.\n“I don’t think there was anything to do with a film screening,” Adams told The Daily Progress by phone.\nHowever, the decision could be reversed following “an in-person explanation by PVCC of the college’s stance on discrimination and antisemitism” to the Louisa County board of supervisors.\nThe total amount of funds from the localities, including Louisa County, reached $58,653 in 2022, which is over 10% of the school’s annual revenue.", "location": "Louisa County", "classification": "antisemitism", "score": 0.537377877809258, "event_breakdown": "- The Louisa County Board of Supervisors unanimously passed a resolution suspending all funding to the community college\n- The decision to suspend funding was made due to the board's belief that a film was \"antisemitic\"\n- The board's chairman, Duane Adams, expressed unawareness of any film or film screening related to the decision\n- The college has the opportunity to reverse the decision by providing an in-person explanation of its stance on discrimination and antisemitism to the board of supervisors\n- The total amount of funds from localities, including Louisa County, reached $58,653 in 2022, which is over 10% of the school’s annual revenue"}, {"id": "0deb807a-f6e3-43f4-9bd3-303a9d97c96d", "title": "Jewish students react to antisemitic vandalism on campus , President Perez responds", "date": "2024-05-04 05:45", "url": "https://theorion.com/100194/news/jewish-students-react-to-antisemitic-vandalism-on-campus-president-perez-responds/", "message": "“ “Let me state unequivocally—this cowardly and vile hatred has absolutely no place at Chico State.” — Chico State President Steve PerezChico State President Steve Perez sent an email to the campus community on Friday condemning recent acts of hate-based, antisemitic vandalism on campus.\nIn the email, Perez wrote that he was “angry and deeply upset” upon receiving multiple reports of graffiti and vandalism.\n“Reports included antisemitic messages in a bathroom, on light posts, and in stairwells on campus,” Perez said in the email.\nAmar also recognizes the activism on other campuses, and said she feels grateful that Chico State is not that extreme.\nChico Hillel shares their appreciation for Perez who checked in on Jewish students at a previous meeting and extended kindness and support to them, Collins said.", "location": "CHICO, CALIFORNIA", "classification": "antisemitism", "score": 0.8017084152589938, "event_breakdown": "- Antisemitic vandalism on the campus of Chico State University in Chico, California, USA.\n- Email sent by Chico State President Steve Perez condemning antisemitic graffiti and vandalism at Chico State University in Chico, California, USA."}, {"id": "222c8171-f70d-44f8-a609-ba847a04e68f", "title": "Holocaust scholar coming to Tulsa says antisemitism persists", "date": "2024-05-05 10:00", "url": "https://tulsaworld.com/news/local/holocaust-scholar-danny-m-cohen/article_937bd5e0-0639-11ef-ac8f-b7feb1131214.html", "message": "“We’ve done a really excellent job of collecting testimonies,” said Danny M. Cohen, a Chicago-based Holocaust scholar, educator and writer.\nThe grandson of a Holocaust survivor, Cohen has dedicated his career to Holocaust studies and human rights advocacy.\nOr we might call it ‘inherited trauma.’”Many have even compared Oct. 7 to the Holocaust, Cohen added.\nWe want the Palestinian people to be able to work toward self-determination.”“My stance is, I’m on the side to end suffering,” Cohen added.\nAdmission: Free, registration required Presented by: Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah and Temple Israel To register or for more information: Go to jewishtulsa.org/yomhashoah2024.", "location": "Chicago", "classification": "antisemitism", "score": 0.9048038057196574, "event_breakdown": "- Danny M. Cohen, a Holocaust scholar, educator, and writer, discusses the collection of testimonies related to the Holocaust.\n- Cohen, a grandson of a Holocaust survivor, has dedicated his career to studying the Holocaust and advocating for human rights.\n- Cohen mentions the concept of \"inherited trauma\" and compares Oct. 7 to the Holocaust.\n- Cohen expresses support for the Palestinian people's self-determination and an end to suffering.\n- The Tulsa Jewish Federation's Tulsa Council for Holocaust Education presents an event in collaboration with various organizations, including the Tulsa City-County Library, Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah, and Temple Israel. The event is free but requires registration."}, {"id": "dc0c25a8-789f-4329-833c-ebea2aefa367", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 21:15", "url": "https://www.smh.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”", "location": "University of Melbourne", "classification": "antisemitism", "score": 0.830386738260159, "event_breakdown": "- The University of Melbourne student encampment in protest against the war in Gaza.\n- A statement regarding freedom of speech and its limitations.\n- A tutor advising a student to skip class due to discomfort with the encampment.\n- Dutton arguing that the protests are \"racist\" and alleging targeting of Jews.\n- Emphasis on not pre-emptively shutting down free speech, debate, and the right to protest."}, {"id": "a357a9b8-af71-4004-9ee9-e62161ffb7df", "title": "Students to erect pro - Palestinian camp at U of M – Winnipeg Free Press", "date": "2024-05-04 00:15", "url": "https://www.winnipegfreepress.com/breakingnews/2024/05/03/students-to-erect-pro-palestinian-camp-at-u-of-m", "message": "The wave of university encampment protests that have been set up in solidarity with the Palestinian people in Gaza as they endure a months-long Israeli offensive has reached Winnipeg.\nStudents for Justice in Palestine, a group at the University of Manitoba, plans to set up an encampment to advocate “for justice in Palestine” next week.\nPro-Palestinian protests have popped up at several Canadian campuses in recent days, including at McGill University.\nThe group also warns that, if they go to the encampment, “international students may face heightened risks, and non-U of M students risk trespassing charges.”Zangana said they expect 200 students to pitch their tents in solidarity with the protest.\nThe University of Manitoba said in a statement “we are aware of a protest encampment next week on UM’s Fort Garry campus.", "location": "The main location where the main event takes place is: 'WINNIPEG'", "classification": "antisemitism", "score": 0.6460049602560511, "event_breakdown": "- Wave of university encampment protests in solidarity with Palestinians reaches Winnipeg\n- Students for Justice in Palestine plans to set up an encampment at the University of Manitoba\n- Pro-Palestinian protests at Canadian campuses, including McGill University\n- Warning of potential risks for international students and non-U of M students at the encampment\n- Expectation of 200 students pitching tents in solidarity at the University of Manitoba's Fort Garry campus"}, {"id": "fdfe2e2e-ab3c-4519-b2ea-a3c06d34d9fe", "title": "In lead - up to Yom HaShoah , Oporto Jewish community teaches the evolution of Antisemitism to schoolchildren", "date": "2024-05-05 00:30", "url": "https://ejpress.org/in-lead-up-to-yom-hashoah-oporto-jewish-community-teaches-the-evolution-of-antisemitism-to-schoolchildren/", "message": "800 Portuguese schoolchildren visited the Holocaust Museum of Oporto on Friday to learn about the Holocaust and the evolution of Antisemitism throughout the centuries that led to the annihilation of Six Million Jews and continues today.\n“In this museum, we press the importance of having the children and teenagers asking how it was possible for this unspeakable tragedy to take place,” said Gabriel Senderowicz, the President of the Oporto Jewish community that built and runs the museum.\nIt focuses on the general public, especially youths and schoolchildren, and invests in education, professional training for educators, promoting exhibitions, and supporting research.\nDavid Garrett, a jurist who is a board member of the Jewish community of Oporto, highlighted that “a genocide can be national or local and kill millions, thousands or even dozens of people.\nCredit: Jewish Community of Oporto", "location": "ODESA", "classification": "antisemitism", "score": 0.9717489477710876, "event_breakdown": ""}, {"id": "28e78682-6364-419f-867e-98c0770ff8b5", "title": "Yom Hashoah amid Israel - Hamas war : Commemorating October 7 significanc - Israel News", "date": "2024-05-04 04:30", "url": "https://www.jpost.com/israel-news/article-799772", "message": "(JTA) - Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nMarch of the Living with survivorsA Holocaust survivor and family member light the torch during a ceremony held at the Yad Vashem Holocaust Memorial Museum in Jerusalem, as Israel marks annual Holocaust Remembrance Day.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers.", "location": "Jerusalem", "classification": "antisemitism", "score": 0.9212517215382826, "event_breakdown": "- Yom HaShoah (Holocaust Remembrance Day) observed in Israel, commemorating the anniversary of the Warsaw Ghetto Uprising and honoring the 6 million Jews murdered by the Nazis.\n- Ceremony at the Yad Vashem Holocaust Memorial Museum in Jerusalem, Israel, featuring a Holocaust survivor and family member lighting a torch to mark Holocaust Remembrance Day.\n- Antisemitism concerns leading to large turnouts expected at Yom HaShoah initiatives and gatherings worldwide."}, {"id": "c069fbb9-0dab-405e-a24e-7f6eb8e293b1", "title": "How Jews plan to mark Yom HaShoah – The Forward", "date": "2024-05-04 01:45", "url": "https://forward.com/fast-forward/609733/how-jews-plan-to-mark-yom-hashoah-7-months-after-the-deadliest-day-for-jews-since-the-holocaust/", "message": "By Jacob Gurvis May 3, 2024(JTA) — Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThis year, as the Israel-Hamas war enters its seventh month, the day takes on added symbolism: It is the first Yom HaShoah since Hamas’ Oct. 7 attack, which was the deadliest day for Jews since the Holocaust.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers.", "location": "WARSAW Ghetto", "classification": "antisemitism", "score": 0.9513343626217766, "event_breakdown": "- Yom HaShoah (Israel's Holocaust Remembrance Day) begins\n- Anniversary of the Warsaw Ghetto Uprising\n- Memorial day for the 6 million Jews murdered by the Nazis\n- Israel-Hamas war entering its seventh month\n- First Yom HaShoah since Hamas' Oct. 7 attack\n- United Nations' International Holocaust Remembrance Day on Jan. 27\n- Yom HaShoah initiatives and gatherings expecting large turnouts\n- Reported rise in antisemitism\n- Email from the band expressing deeper emotions for this Yom HaShoah"}, {"id": "b10cb308-5395-4b4e-8510-f5ffff66a9af", "title": "Rutgers forces Jewish BBQ off campus , gives into anti - Israel encampment demands", "date": "2024-05-04 14:15", "url": "https://nypost.com/2024/05/04/us-news/rutgers-forces-jewish-bbq-off-campus-gives-into-anti-israel-encampments-demands/", "message": "Rutgers University refused to let a Jewish group hold a pro-Israel barbecue on the campus’ Vorhees Mall, despite allowing pro-terror protesters to camp there for days, emails obtained by The Post claim.\nRutgers ChabadThe encampments finally ended after administrators caved into protester demands, including blanket amnesty for demonstrators.\nDespite being forced off campus in the middle of finals, about 100 to 150 people turned out for the barbecue.\n“They can try to intimidate us but we’re not afraid to be pro-Israel on campus,” said Students Supporting Israel co-president Michael Batushansky.\n3 Kelly Shapiro, co-founder of Students Supporting Israel, which organized the barbecue, called the university’s response a clear “antisemitic double standard.” Rutgers Chabad“Our pride won’t be squashed,” added Vaynberg.", "location": "Rutgers University", "classification": "antisemitism", "score": 0.9301916789175958, "event_breakdown": ""}, {"id": "731ff8f0-b506-4e8e-94c4-9484f8672441", "title": "Beyond bullets and bombs : Lessons of faith , pragmatism , and survival from the vilna g", "date": "2024-05-04 23:45", "url": "https://www.ynetnews.com/article/rj78izvfc", "message": "The diaries of Zelig Kalmanovich, a prominent Jewish scholar in the Vilna Ghetto, offer a glimpse into the agonizing choices faced by individuals trapped within Nazi tyranny.\n3 View gallery Jews in the Vilna Ghetto ( Photo: The Association of Jews from Vilna and Vicinity in Israel )Vilna was once a vibrant center of Jewish life and learning.\nVilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\nHe championed the ghetto's schools, synagogues, and libraries, viewing them as battlegrounds for the preservation of Jewish identity and a continuation of Jewish history.\nThe perspective of the long Jewish history is essential in analyzing the current events.", "location": "VILNA", "classification": "antisemitism", "score": 0.8974516408212561, "event_breakdown": "- Establishment of the Vilna Ghetto in Vilnius, Lithuania, during German occupation.\n- Zelig Kalmanovich's diaries documenting life and agonizing choices in the Vilna Ghetto in Vilnius, Lithuania."}, {"id": "9b5ef102-3d96-4471-bfa4-03a6852c035d", "title": "Stewart Weiss on Holocaust Remembrance Day amid student protests", "date": "2024-05-05 02:00", "url": "https://www.jpost.com/opinion/article-799536", "message": "The week(s) ahead offer both tears and cheers as they lead us once again into the modern “Yom” holidays: Yom Hashoah, Yom Hazikaron, and Yom Ha’atzmaut (and later, Yom Yerushalayim).\nDangerous times: Antisemitism and anti-Israel protestsWe live in a dangerous world at a dangerous time, with equal parts ignorance and evil surrounding us.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City on Tuesday.\nTragically, there is no shortage of un-Jewish Jews who have joined together with the antisemitic mob, helping to add credence to their crusade.\nThis, he said, was an attempt of the prisoners to gain a false sense of empowerment by “joining” with their persecutors.", "location": "New York City", "classification": "antisemitism", "score": 0.9250844478775154, "event_breakdown": ""}, {"id": "4fcc8ac5-b00f-466c-94d9-da620c7a212d", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-mark-history-differently-after-horrors-oct-109936441", "message": "KIBBUTZ MEFALSIM, Israel -- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM, Israel", "classification": "antisemitism", "score": 0.9866395318761043, "event_breakdown": "- Attack by Hamas fighters in southern Israel, originating from Gaza Strip, with Kibbutz Mefalsim as one of the affected locations.\n- Holocaust Remembrance Day in Israel, beginning on Sunday evening."}, {"id": "3d6bfcda-2344-48ca-ae7d-c8bc2e23abdf", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 07:15", "url": "https://www.clickondetroit.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "Kibbutz Meflasim, southern Israel", "classification": "antisemitism", "score": 0.9289982583346631, "event_breakdown": "- Judith Tzamir poses for a portrait in her family home in Kibbutz Meflasim, southern Israel\n- Judith Tzamir will join 55 other Holocaust survivors from Israel and around the world for the March of the Living memorial march in Poland\n- Tzamir, along with other Holocaust survivors, will participate in the event in its 36th year, which usually draws thousands of participants including Jewish students, leaders, and politicians\n- The March of the Living event is expected to include about 10,000 participants, with around 55 Holocaust survivors from different parts of the world joining in \n- The ministry estimates that 132,000 Holocaust survivors currently live in Israel."}, {"id": "fd28575f-9073-4f4c-bc84-40ba31bfab57", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7 – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "The main location where the main event takes place is: 'KIBBUTZ MEFALSIM'", "classification": "antisemitism", "score": 0.9612619689091397, "event_breakdown": "- Portrait of Judith Tzamir, a Holocaust survivor, in her family home in Kibbutz Meflasim, southern Israel, on May 3, 2024.\n- Judith Tzamir and 55 other Holocaust survivors from Israel and around the world will participate in a memorial march in Poland called March of the Living.\n- March of the Living, held in Poland, is an annual event drawing thousands of participants, including Holocaust survivors and Jewish students, leaders, and politicians."}, {"id": "3baae460-908c-48c3-895b-426f60f6c0fc", "title": "Biden says  order must prevail  during campus protests over the war in Gaza | News , Sports , Jobs", "date": "2024-05-04 05:30", "url": "https://www.weirtondailytimes.com/news/local-news/2024/05/biden-says-order-must-prevail-during-campus-protests-over-the-war-in-gaza/", "message": "As college campuses convulsed with anger over the Vietnam War in 1968, Biden was in law school at Syracuse University.\n“You know, that’s not me.”The White House has also maintained its focus on combating antisemitism.\n“What’s happening on college campuses right now is wrong.”Johnson visited Columbia University with other members of his caucus last week.\n“The radical extremists and far-left agitators are terrorizing college campuses, as you possibly noticed,” Trump said.\nThey saw that it wasn’t based in reality.”Apart from condemning antisemitism, the White House has been reluctant to directly engage on the issue.", "location": "COLUMBIA UNIVERSITY", "classification": "antisemitism", "score": 0.8763530548610369, "event_breakdown": "- Biden was in law school at Syracuse University in 1968 during the Vietnam War protests\n- Johnson visited Columbia University with other members of his caucus last week\n- Trump criticized radical extremists and far-left agitators on college campuses\n- The White House maintained its focus on combating antisemitism\n- The White House has been reluctant to directly engage on the issue of college campus unrest"}, {"id": "4d60f2f8-661c-434e-a849-406bdacb45a7", "title": "The Sources of Anti - Semitic Conduct", "date": "2024-05-05 13:15", "url": "https://freebeacon.com/culture/the-sources-of-anti-semitic-conduct/", "message": "All this makes reading Stone’s book a particularly painful experience.\nYet at the same time, Stone’s descriptions of anti-Semitism of the past sound eerily similar to anti-Semitism manifest today in spheres regarding which the author seems unconcerned.\nWhy, for Stone, is the history of the Holocaust \"unfinished\"?\nIt features a man holding a sign featuring both an Israeli and Palestinian flag, a sign emblazoned with two words: \"Final Solution.\"\nIt is my hope that in a post-October 7 world, Dan Stone can see these dangers too.", "location": "", "classification": "antisemitism", "score": 0.8721969928631624, "event_breakdown": ""}, {"id": "13104907-611f-4264-9935-f36a94356c2a", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:00", "url": "https://www.newsday.com/news/nation/Israel-Poland-Holocaust-Gaza-march-Auschwitz-h48121", "message": "KIBBUTZ MEFALSIM, Israel — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nHamas militants poured over the border from Gaza and attacked towns, army bases and a music festival in southern Israel.", "location": "", "classification": "antisemitism", "score": 0.7350370049431462, "event_breakdown": "1. Hamas fighters invade southern Israel on Oct. 7\n2. Deadly attack on Jews perpetrated by Hamas, the deadliest since the Holocaust\n3. Annual event in its 36th year draws thousands of participants, including Holocaust survivors and Jewish students, leaders, and politicians\n4. Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024\n5. Hamas militants pour over the border from Gaza and attack towns, army bases, and a music festival in southern Israel."}, {"id": "4dbaf89d-7241-470f-8d04-b7a0bada6bff", "title": "A Holocaust Survivor Will Mark That History Differently after the Horrors of Oct . 7", "date": "2024-05-05 08:45", "url": "https://www.newsmax.com/world/globaltalk/israel-poland-holocaust-gaza-march-auschwitz/2024/05/05/id/1163510/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9866395318761043, "event_breakdown": "null"}, {"id": "0dafe5e1-e97c-4dc1-bb43-f9fbaa7a8a24", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:45", "url": "https://www.kob.com/news/us-and-world-news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9590549156824396, "event_breakdown": ""}, {"id": "9abfa03c-33b0-464e-b758-217e71151d54", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wfmz.com/news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_e8f14bc4-6d3a-595d-af45-a5281e1aec28.html", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in the garden of her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\n(AP Photo/Maya Alleruzzo)", "location": "Poland", "classification": "antisemitism", "score": 0.6268511434854429, "event_breakdown": ""}, {"id": "c8372ca7-3757-4f96-8440-29bf821b4957", "title": "Holocaust Survivor Finds Solace in Retelling Story in Wake of Recent Tragedy", "date": "2024-05-05 07:00", "url": "https://www.devdiscourse.com/article/law-order/2927949-holocaust-survivor-finds-solace-in-retelling-story-in-wake-of-recent-tragedy", "message": "When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year's Holocaust Remembrance Day, which begins Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nTzamir, whose kibbutz fended off Hamas attackers Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates 132,000 Holocaust survivors live in Israel.", "location": "Tzamir", "classification": "antisemitism", "score": 0.9797381691872994, "event_breakdown": ""}, {"id": "df8b92bf-3468-4a47-83af-6473381cfbb1", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 11:30", "url": "https://isp.netscape.com/news/world/story/0001/20240505/492eab9a3b95de64602ccdec863f1b37", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9866473197797783, "event_breakdown": "- Hamas fighters invaded southern Israel on Oct. 7, resulting in the deadliest attack on Jews since the Holocaust.\n- Holocaust Remembrance Day, which begins on Sunday evening in Israel, is observed with greater significance in light of the Oct. 7 attack.\n- Judith Tzamir, a Holocaust survivor in Kibbutz Mefalsim, southern Israel, discusses how the Oct. 7 attack brought back memories from her childhood trauma."}, {"id": "3855247f-40bf-47b5-b97a-06ec57e69733", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protestors.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees.", "location": "", "classification": "antisemitism", "score": 0.7274022151977523, "event_breakdown": "- Campus Y student leadership disputes assertions made.\n- Reduced hours implemented at Campus Y, affecting students.\n- Booking portal for Campus Y facilities removed from website.\n- University police remove pro-Palestinian encampment and arrest 36 protestors at around 6 a.m.\n- UNC Students for Justice in Palestine (SJP) holds vigil at noon.\n- Duke Academics and Staff for Justice in Palestine raise over $50,000 in support of UNC encampment arrestees."}, {"id": "430bf4dc-4ed2-4351-a02d-6568d485f747", "title": "How did Jews celebrate Passover during a war ? - opinion", "date": "2024-05-04 22:45", "url": "https://www.jpost.com/opinion/article-799791", "message": "This tranquil setting was the location of a dance/music event billed as a festival of “Friends, Love, and Infinite Freedom,” Nova was attended by more than 3,500 young Israelis.\nThe kibbutz is populated by young, idealistic Jews who wish to work the holy soil.\nOn October 7, despite a ceasefire between Hamas and Israel being in place, it was attacked by the Palestinian hordes.\nThese displaced Israelis are among the forgotten in Israel as the war enters its eighth month.\nI can’t imagine any other country at war demonstrating more humanitarian concern than Israel.”Our celebration of Passover in Israel reinforced an important age-old lesson for our family.", "location": "Nova", "classification": "antisemitism", "score": 0.6209995559715097, "event_breakdown": "- Dance/music event called \"Nova\" attended by more than 3,500 young Israelis at a tranquil setting.\n- Kibbutz in Israel populated by young, idealistic Jews who wish to work the holy soil.\n- Attack by Palestinian fighters on the kibbutz during a ceasefire on October 7.\n- Displaced Israelis as the war in Israel enters its eighth month.\n- Celebration of Passover in Israel."}, {"id": "11a08bdc-670f-411d-b09f-6dbe36825e58", "title": "College protests at Emerson mean criticism for school president", "date": "2024-05-04 12:15", "url": "https://www.bostonglobe.com/2024/05/04/metro/emerson-college-boston-president-protests-critcism/", "message": "“It was a terrible, horrible, no good, very bad day for President Bernhardt,” said Russell Newman, professor and president of the full-time faculty union.\nEmerson students locked arms in protest at the entrance to alley near the tent encampment on April 24.\nTwelve Emerson students were arrested while protesting outside the event against tuition increases and the college’s “silence on the ongoing genocide in Gaza,” according to an Instagram post from Emerson Students for Justice in Palestine.\n“However, we must also emphasize that we cannot prevent the enforcement of Boston city ordinances or Massachusetts state law.”Police arrested pro-Palestinian demonstrators at Emerson College on April 25.\nAn Emerson College student cried during a meeting to call on the school’s president, Jay Bernhardt, to resign on April 26.", "location": "Boston", "classification": "antisemitism", "score": 0.6860102063333988, "event_breakdown": "1. President Bernhardt had a terrible day according to Russell Newman, a professor and president of the full-time faculty union.\n2. Emerson students protested by locking arms at the entrance to an alley near the tent encampment on April 24.\n3. Twelve Emerson students were arrested during a protest against tuition increases and the college's \"silence on the ongoing genocide in Gaza\" on April 24.\n4. Pro-Palestinian demonstrators were arrested by the police at Emerson College on April 25.\n5. An Emerson College student cried during a meeting on April 26, demanding the resignation of the school's president, Jay Bernhardt."}, {"id": "98e5dec8-399d-4143-a2c6-c195d23c2e1e", "title": "Here where things stand one week since Penn ordered the Gaza Solidarity Encampment to disband", "date": "2024-05-04 19:00", "url": "https://www.thedp.com/article/2024/05/penn-gaza-solidarity-encampment-day-eight", "message": "The videos, which together are nearly six minutes long, were filmed by a Jewish student walking near the encampment.\nAt one point, the Jewish student asked an encampment participant if they were a student.\nThe DP could not confirm whether DPS has reached out to the student or whether the encampment participant was a student.\nThe DP could not independently corroborate Yakoby's allegation that encampment members have used slurs towards Jewish students.\nHe called on Penn’s leadership to keep students safe and said that Penn has not requested help from state police to disband the encampment.", "location": "", "classification": "antisemitism", "score": 0.5825308301516012, "event_breakdown": "- Videos filmed by a Jewish student near the encampment\n- Jewish student asking an encampment participant if they were a student\n- Difficulty confirming if DPS reached out to the student or if the encampment participant was a student\n- Inability to independently corroborate Yakoby's allegation of slurs towards Jewish students\n- Yakoby calling on Penn's leadership to keep students safe\n- Statement that Penn has not requested help from state police to disband the encampment."}, {"id": "2eaf039f-bf2e-4f92-a037-2aecd72c5f0f", "title": "Campus protests and arrests : Recent weeks have shown that colleges cant make everyone feel safe . Maybe they shouldnt need to . ", "date": "2024-05-03 19:30", "url": "https://slate.com/news-and-politics/2024/05/college-protests-ucla-columbia-arrests-antisemitism.html", "message": "Well before Israel’s war in Gaza and the U.S. campus protests of it, This is harmful and it makes me unsafe was a familiar claim on college campuses.\nAdvertisementFor decades, college administrators and professors have emphasized student safety, promising that students won’t just be physically safe on their campuses but will feel safe.\nOnce Israel launched its brutal war of reprisal and pro-Palestinian students responded with protests, the safety-related claims escalated.\nAdvertisementAdvertisementJewish students have reported legitimate safety concerns, including being harassed, threatened, intimidated, and assaulted on campus and near it.\nStill, as George Packer wrote in the Atlantic of the students making safety claims, “Who could blame them?", "location": "The information does not clearly point to a specific location. If you have any other questions or need further clarification, I'm here to help.", "classification": "antisemitism", "score": 0.7826324601875625, "event_breakdown": "- Claims of safety being a familiar issue on college campuses\n- Emphasis on student safety by college administrators and professors\n- Escalation of safety-related claims during Israel's war in Gaza and U.S. campus protests\n- Reports of Jewish students facing safety concerns such as harassment, threats, intimidation, and assault\n- George Packer's mention in the Atlantic of the students making safety claims"}, {"id": "2b0cefc9-3c7b-4787-bef7-06bc43f5352d", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://www.mymotherlode.com/news/world/3352547/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7.html", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7 View PhotoKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9866473197797783, "event_breakdown": "- Hamas fighters invaded southern Israel on Oct. 7\n- Deadliest attack on Jews since the Holocaust\n- Holocaust Remembrance Day begins on Sunday evening in Israel\n- Event in its 36th year\n- Usually draws thousands of participants, including Holocaust survivors, Jewish students, leaders, and politicians\n- Memories from childhood trauma resurfaced due to the Oct. 7 attack"}, {"id": "1bb4a0a0-481e-4e6e-9505-96bcd2e6570d", "title": "How Jews plan to mark Yom HaShoah 7 months after the deadliest day for Jews since the Holocaust", "date": "2024-05-04 00:00", "url": "https://www.jta.org/2024/05/03/israel/how-jews-plan-to-mark-yom-hashoah-7-months-after-the-deadliest-day-for-jews-since-the-holocaust", "message": "(JTA) — Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThis year, as the Israel-Hamas war enters its seventh month, the day takes on added symbolism: It is the first Yom HaShoah since Hamas’ Oct. 7 attack, which was the deadliest day for Jews since the Holocaust.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers.", "location": "", "classification": "antisemitism", "score": 0.9523896019196354, "event_breakdown": "- Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night\n- Anniversary of the Warsaw Ghetto Uprising\n- Memorial day for the 6 million Jews murdered by the Nazis\n- First Yom HaShoah since Hamas’ Oct. 7 attack\n- United Nations’ International Holocaust Remembrance Day on Jan. 27\n- Yom HaShoah initiatives and gatherings expecting large turnouts\n- Reported rise in antisemitism"}, {"id": "019bbb7a-76ce-42e5-8733-05e4bc1b9af9", "title": "Why is Jew - hatred and anti - Israelism on the rise ? - The Jerusalem Post", "date": "2024-05-04 01:30", "url": "https://www.jpost.com/opinion/article-799568", "message": "Eighty-five years ago, World War II began; the Holocaust had begun earlier, and the Nazi plan of the Final Solution was implemented in 1942.\nThis is a world war against the Jewish people and Israel, supported by most Muslim countries and Muslim authorities.\n(credit: Elizabeth Frantz/Reuters)Eighty-five years ago, World War II was launched against the Nazis; today, the world sees Israel as the enemy.\nAttempts to explain the rise in anti-Israelism in Europe and around the world ignore its historical roots in Jew-hatred.\nRejecting Luther’s Jew-hatred, for example, did not and could not prevent people from reading what he wrote about Jews.", "location": "Jerusalem", "classification": "antisemitism", "score": 0.5672656267535894, "event_breakdown": "- Historical event: World War II began 85 years ago.\n- Historical event: The Holocaust began before World War II, with the Nazi plan for the Final Solution implemented in 1942.\n- Discussion of global conflict against Jewish people and Israel, supported by most Muslim countries and authorities.\n- Criticism of anti-Israel sentiment in Europe and globally.\n- Discussion of historical roots of anti-Israelism in Jew-hatred, referencing Martin Luther's views on Jews."}, {"id": "67d0d5ed-b011-46d4-bdbf-338c1bd07dd5", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protesters.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees.", "location": "Chapel Hill, North Carolina", "classification": "antisemitism", "score": 0.7274022151977523, "event_breakdown": "- University of North Carolina at Chapel Hill (UNC), North Carolina: Around 6 a.m., university police removed a pro-Palestinian encampment and arrested 36 protesters.\n\n- University of North Carolina at Chapel Hill (UNC), North Carolina: At noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\n\n- Duke University, North Carolina: Duke Academics and Staff for Justice in Palestine raised more than $50,000 in support of UNC encampment arrestees."}, {"id": "7c716d9a-d842-4acc-ab11-a2566b8f75a3", "title": "UC Berkeley opens civil rights investigation into backyard confrontation between a law professor and a student", "date": "2024-05-03 22:30", "url": "https://www.nbcnews.com/news/us-news/uc-berkeley-opens-civil-rights-investigation-backyard-confrontation-la-rcna150667", "message": "The University of California, Berkeley, has opened a Title IX civil rights investigation into whether a law professor harassed a Muslim student during a dinner last month in the professor’s backyard.\nThe investigation by the university’s Office for the Prevention of Harassment and Discrimination stems from an April 9 incident at the home of professor Catherine Fisk and her husband, who is dean of the university’s law school.\nGraduating law student Malak Afaneh said she was subjected to harassment and discrimination when she attempted to deliver an unexpected pro-Palestinian speech at the invitation-only dinner.\nThe two appeared to briefly jostle for the microphone before Fisk released her grip.\nIn an emailed statement at the time, Chancellor Carol Christ said she was “appalled and deeply disturbed by what occurred” and offered support to Fisk and Chemerinsky.", "location": "Berkeley", "classification": "antisemitism", "score": 0.589850237060917, "event_breakdown": ""}, {"id": "a7a840cf-f1ee-44c8-ba84-303707715acf", "title": "Tech becomes teaching tool on Israel Holocaust remembrance day", "date": "2024-05-05 17:45", "url": "https://nocamels.com/2024/05/tech-becomes-teaching-tool-on-israels-holocaust-remembrance-day/", "message": "In Israel, Holocaust Remembrance Day for 2024 begins at sundown on May 5.\nThe first evening sees memorial services being held across the country, with a central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem.\nFlags are flown at half mast in Israel to mark Holocaust Remembrance Day (Joel Goldberg/Wikimedia Commons)The following morning is punctuated by a siren at 10am, which wails throughout Israel for two minutes in memory of the victims.\nAnd according to Zikaron BaSalon, the event is attended annually by around 2 million people across the country.\n“But this year was particularly painful – none of the Holocaust survivors we met even imagined that the horrific memories of the Holocaust would resurface, and this time in their own home.”", "location": "Jerusalem", "classification": "antisemitism", "score": 0.7877177970065752, "event_breakdown": "- Holocaust Remembrance Day begins at sundown on May 5 in Israel\n- Memorial services held across the country on the first evening\n- Central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem\n- Flags flown at half mast in Israel\n- Siren at 10am the following morning wails throughout Israel for two minutes\n- Event attended by around 2 million people across the country\n- Holocaust survivors are distressed by the resurfacing of horrific memories in their own homes"}, {"id": "fcb0171e-ede6-4009-80c8-778e72a9c31d", "title": "The past three days at GW Gaza solidarity encampment", "date": "2024-05-05 02:30", "url": "https://georgetownvoice.com/2024/05/04/the-past-three-days-at-gws-gaza-solidarity-encampment/", "message": "Over a week ago, a coalition of students from universities across D.C., including Georgetown, George Washington University (GW), and American University, established a Gaza solidarity encampment at University Yard (U-Yard) on GW’s campus.\nWhile the encampment has brought together students, academics, and community members from across D.C., it has also garnered national attention.\nUntil complete liberation, the students are for justice in Palestine.” While others listened to speakers who described messages they had received from people in Gaza thanking students for protesting at the GW encampment.\n“The only thing I can do is to be there with them in spirit by supporting GW and Georgetown students for here.”No Georgetown students spoke at the counter-protest, and it’s unclear if any were present at the demonstration.\nBased on a post on DMV SJP’s Instagram, demonstrators projected a photo of President Joe Biden onto the American flag for several hours, with the words ‘genocide Joe’ written underneath.", "location": "'George Washington University (GW) campus'", "classification": "antisemitism", "score": 0.7844045352952751, "event_breakdown": "- Establishment of a Gaza solidarity encampment at University Yard (U-Yard) on George Washington University (GW) campus by a coalition of students from universities across D.C., including Georgetown, GW, and American University, over a week ago.\n- National attention garnered by the encampment.\n- Presence of students, academics, and community members from across D.C. at the encampment.\n- Listening to speakers at the encampment, including messages from people in Gaza thanking students for protesting.\n- Counter-protest where no Georgetown students spoke, and it's unclear if any were present.\n- Projection of a photo of President Joe Biden onto the American flag with the words 'genocide Joe' written underneath, as per a post on DMV SJP's Instagram."}, {"id": "65973fc5-c526-4f28-adda-9330d2b27b79", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "http://www.middletownpress.com/news/world/article/a-holocaust-survivor-will-mark-that-history-19440012.php", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/APKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.", "location": "", "classification": "antisemitism", "score": 0.821799420364865, "event_breakdown": "- Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024\n- Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024\n- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust"}, {"id": "f0351c54-a350-400a-a835-35643b47c679", "title": "  Actions Have Consequences : Dartmouth Jewish Studies Professor Arrested at Pro - Palestinian Protest – JONATHAN TURLEY", "date": "2024-05-04 20:45", "url": "https://jonathanturley.org/2024/05/04/actions-have-consequences-dartmouth-jewish-studies-professor-arrested-at-pro-palestinian-protest/comment-page-2/", "message": "I was standing with a line of women faculty in the their 60s to 80s trying to protect our students.\nDespite pleading guilty to criminal assault, she was not fired and received overwhelming support from the students and faculty.\nAt Hunter College in New York, Professor Shellyne Rodríguez was shown trashing a pro-life display of students.\nMoreover, Jewish students and faculty at schools like Columbia and UCLA were prevented from gaining access to areas on the campuses.\n“Actions have consequences” for students and faculty alike.", "location": "", "classification": "antisemitism", "score": 0.4124504163993415, "event_breakdown": "- At Hunter College in New York, Professor Shellyne Rodríguez was shown trashing a pro-life display of students.\n- At Columbia and UCLA, Jewish students and faculty were prevented from gaining access to certain areas on the campuses.\n- A group of women faculty aged 60s to 80s stood in line to protect their students."}, {"id": "665445be-88af-44ad-91d9-0736e6a4b3d2", "title": "Jewish poet , paratrooper Hannah Senesh honoured in Budapest", "date": "2024-05-05 10:30", "url": "https://www.jwire.com.au/jewish-poet-paratrooper-hannah-senesh-honoured-in-budapest/", "message": "Browse > Home News / Jewish poet, paratrooper Hannah Senesh honoured in Budapest – J-WireJewish poet, paratrooper Hannah Senesh honoured in BudapestRead on for articleHannah Senesh (Szenes) was honoured on Friday in a ceremony at her birthplace in Budapest, Hungary.\nThe Jewish paratrooper and poet was executed at age 23 “not far from here,” Revital Yakin, deputy CEO of March of the Living, said during the event.\nSenesh (1921-44), who was captured after parachuting into Yugoslavia during World War II to rescue Hungarian Jews, endured “severe torture,” Yakin said.\nAnd here, there are more of those than anywhere else.”“How relevant and accurate Hannah Senesh’s letter is even for our days,” said Yakin.\n“May her memory be blessed.”Rakefet Senesh Shkiler, Senesh’s great-grandniece, was one of the poet’s family members who attended the event and laid a wreath in her honor.", "location": "BudapestJerusalem", "classification": "antisemitism", "score": 0.7971402382719714, "event_breakdown": "- Hannah Senesh was honored in a ceremony at her birthplace in Budapest, Hungary.\n- Revital Yakin, Deputy CEO of March of the Living, stated during the event that Hannah Senesh was executed at age 23 near Budapest.\n- Senesh was captured after parachuting into Yugoslavia during World War II to rescue Hungarian Jews and endured severe torture.\n- Rakefet Senesh Shkiler, Hannah Senesh's great-grandniece, attended the event and laid a wreath in her honor."}, {"id": "43f23928-cda1-49a4-87e1-4b813a585f33", "title": "Transcript : Queen Rania al Abdullah of Jordan on  Face the Nation , May 5 , 2024", "date": "2024-05-05 12:15", "url": "https://www.cbsnews.com/news/queen-rania-al-abdullah-jordan-face-the-nation-05-025-2024/", "message": "The following is a transcript of an interview with Queen Rania al Abdullah of Jordan that aired on May 5, 2024.\nMARGARET BRENNAN: Jordan has two field hospitals inside of Gaza, Jordan is helping to get aid into the Strip.\nAt the same time, they're- they're denying that the starvation is intentional.\nQUEEN RANIA: First of all, I think it's important to point out that law and order are paramount for everybody.\nAnd, you know, when- when Israelis are telling us, you know, \"They're dying because Hamas is using them as human shields.\"", "location": "Gaza", "classification": "antisemitism", "score": 0.2488112514172035, "event_breakdown": ""}]