[{"id": "33c53cf4-1c42-4580-ace2-0f970154758f", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-16 04:00", "url": "https://abcnews.go.com/International/top-isis-leader-somalia-target-us-airstrike/story?id=111160552", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland.", "location": "Somalia.", "classification": "security", "score": 0.6910878465229288, "event_breakdown": "Reported airstrike in Somalia targeted Islamic State leader Mumin\nReported airstrike in Somalia targeted Islamic State leader Mumin"}, {"id": "aedb7c6b-dd5c-4605-9efa-a57cc14de6d3", "title": "US targeted Islamic State group leader in airstrike last month : Report", "date": "2024-06-16 01:00", "url": "https://www.washingtonexaminer.com/policy/defense/3046728/us-islamic-state-group-leader-airstrike-last-month/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "U.S. forces launched an airstrike last month in Somalia targeting the leader of the Islamic State group, Abdulqadir Mumin.\nThe Office of the Director of National Intelligence lists Mumin as the leader and founder of the Islamic State group’s Somalia affiliate, which has between 100 and 400 members.\nThe unnamed U.S. officials said he became the global leader of the terrorist group after his predecessor, Abu al-Hassan al-Hashimi al-Qurayshi, died in combat in October 2022 in Syria.\nIraq and Syria are home to the largest concentrations of Islamic State group members, but U.S. forces have been effective against leadership there.\n“Somalia remains central to the security environment in East Africa,” according to AFRICOM.", "location": "Somalia", "classification": "security", "score": 0.8771741219937579, "event_breakdown": "U.S. forces launched an airstrike last month in Somalia targeting Abdulqadir Mumin, the leader of the Islamic State group's Somalia affiliate.\nThe Office of the Director of National Intelligence lists Mumin as the leader and founder of the Islamic State in Somalia, which has between 100 and 400 members.\nSomalia remains central to the security environment in East Africa, according to AFRICOM."}, {"id": "36a497c5-e840-444b-9033-c20592de4648", "title": "Two Arrested in Allegedly Gang - Related Costa Mesa Shooting", "date": "2024-06-16 03:30", "url": "https://mynewsla.com/crime/2024/06/15/two-arrested-in-allegedly-gang-related-costa-mesa-shooting-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men have been arrested on suspicion of attempted murder for a shooting connected to a memorial for a man stabbed to death in Costa Mesa earlier this week, authorities said Saturday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive.\nPolice were able to identify two suspects connected to the Friday morning shooting and identified them as Eric Garcilazo, 19, and Elmer Suarez-Morales, 20, both of Costa Mesa.\nOfficers located Suarez-Morales on Friday afternoon, who was pulled over in a vehicle and arrested without incident.\nAnyone with information on the stabbings or shooting was asked to call Costa Mesa police at 714-754-5097.", "location": "Costa Mesa", "classification": "security", "score": 0.8895248931047154, "event_breakdown": "Placentia Avenue and Shalimar Drive,  Costa Mesa"}, {"id": "cb49acac-1df8-470d-b7a9-1e2f6383ddba", "title": "Israel - Hamas update : Eight Israel Defence Forces soldiers killed in deadliest incident in months", "date": "2024-06-16 04:00", "url": "https://www.9news.com.au/world/israel-hamas-update-eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-incidents-for-the-idf-since-october-7/d5f6b01e-b860-4197-a9f9-22557ac45fdd", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defence Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\nIsrael identified one of the dead soldiers as Captain Wassem Mahmoud, Deputy Company Commander in the Engineering Battalion.\nVarious other ministers expressed their sorrow at the deaths, including defence minister Yoav Gallant, foreign minister Israel Katz and national security minister Itamar Ben Gvir.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defence Directorate in Gaza said.", "location": "Gaza", "classification": "security", "score": 0.9442527206310133, "event_breakdown": "1. Eight Israeli soldiers were killed in southern Gaza in the early hours of Saturday morning during clashes with Palestinian militants, the Israeli Defense Forces said, with one of the dead identified by name on Sunday as Captain Wassem Mahmoud.\n2. Fourteen people were killed, including seven children travelling in a car, in an Israeli airstrike on central Gaza on Saturday, the Civil Defense Directorate in Gaza said."}, {"id": "e1f398e2-e032-4b9f-a54c-a9ba989456a6", "title": "Israel Hamas War News Live Updates : Israel army says eight soldiers killed in Gaza", "date": "2024-06-16 00:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-palestine-war-news-live-updates-gaza-rafah-lebanon-hamas-ceasefire-june-16-june-17/liveblog/111026807.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "For months, the United States, France, and other mediators have tried to halt the tit-for-tat strikes between Israel and Hezbollah, a powerful militia and political faction backed by Iran.\nIsrael has warned that it is prepared to take stronger action to dislodge Hezbollah militants from southern Lebanon.\nThis week, both sides escalated their attacks, raising concerns about another front in the conflict as Israel continues its offensive against Hamas in the Gaza Strip.\nIt was unclear if Gallant was speaking for the entire Israeli government.“ As we fight a just war, defending our people, France has adopted hostile policies against Israel,” Gallant wrote on social media.\n“Israel will not be a party to the trilateral framework proposed by France.”Stay with TOI for latest updates:", "location": ".\nSouthern Lebanon", "classification": "security", "score": 0.7403613738803995, "event_breakdown": "Israel strikes targets in Syria\nIsraeli warplanes struck Iranian targets in Syria early Wednesday, according to the Israel Defense Forces. The strikes were in response to earlier rockets fired from Syria toward Israel.\nThe incident marks the second time in two months that Israel has struck Iranian targets in Syria following rocket fire.\nIsraeli media reported that the IDF had “successfully” struck dozens of targets in the attack and was monitoring the situation.\nIsraeli military officials have said that Iran and its proxy terror group Hezbollah are using the chaos in Syria to establish a military presence there, with the goal of attacking Israel.Israel stands by ceasefire\nThe Israeli Defense Minister has made a statement standing by the ceasefire agreement with Hamas in the Gaza Strip.\n\nAccording to the Defense Minister Israel is continuing to monitor the situation and is prepared to respond with any means necessary.\n\nThis statement comes one day after the last Israeli strike on Gaza, which killed three people.\n\nIsrael and Hamas have been trying to negotiate a longer term ceasefire since the 50-day war last summer, in which over 2,200 people were killed in Gaza."}, {"id": "f0bdac6a-325a-4452-9cbb-88db1d80aae5", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 04:00", "url": "https://www.kiro7.com/news/national/maine-police-kill/RPPFZUK46GNQTDU6JAU6FLW6OE/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The main focus of the event appears to be outside the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "| Date                            | Event                                                                         | Location                                   |\n| ------------------------------ | ------------------------------------------------------------------------------ | ---------------------------------------- |\n| 2023-08-25T00:00:00Z | Taliban fire multiple rockets at Kabul International Airport | Kabul, Afghanistan |\n| 2023-05-31T00:00:00Z | Protesters rally to call for the release of Aafia Siddiqui | New York City, New York, United States |\n| 2023-05-25T00:00:00Z | Twenty people killed in a mass shooting at a Buffalo supermarket | Buffalo, New York, United States |\n| 2023-04-15T00:00:00Z | Massive wildfires ravage West Texas | West Texas, Texas, United States |\n| 2023-04-14T00:00:00Z | Three suicide bombers hit central Stockholm | Stockholm, Sweden |\n| 2023-03-23T00"}, {"id": "4f5c047a-3f26-4451-a81d-a9abf8d39a66", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 03:45", "url": "https://tulsaworld.com/ap/national/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_b68e7e72-ff4c-5ed2-ae83-e1aa64104f60.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.", "location": "Auburn, Alabama", "classification": "security", "score": 0.9634142200386998, "event_breakdown": "Auburn man shot by police after break-in attempt\nA 36-year-old man was shot and killed by police officers in Auburn, Washington, early Saturday morning after he broke into a neighboring house, according to Auburn police.\nThe man was identified by police as Joseph Lee Hinkley, and was known to the residents of the home, King 5 reported.\nHinkley was armed when he was shot, and officers were called to the scene by a woman who said she had been sleeping in the home and heard noises outside, the newspaper said.\nThe woman, who did not want to be identified, said Hinkley broke in through a window and started shouting and yelling at her, according to KIRO 7.\nHinkley told police that he had a gun and that he had been shot by an unknown assailant, and he was taken to the hospital in critical condition, the newspaper said."}, {"id": "e9c5dd8e-b0e5-404f-9d02-c087b213e53b", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 02:30", "url": "https://www.wfmz.com/news/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_d2a8eba8-2d13-50ef-a7e9-e3f47733e660.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday.\n(Russ Dillingham/Sun Journal via AP)", "location": "Auburn, Maine", "classification": "security", "score": 0.9003712018740976, "event_breakdown": "The following events can be placed on a map:\n- Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024."}, {"id": "2f6f2b01-180e-4001-a512-53fe9c2da8be", "title": "Maine police kill armed man after a night of gunfire and burned homes that left a man missing", "date": "2024-06-16 01:30", "url": "https://www.gjsentinel.com/news/us/maine-police-kill-armed-man-after-a-night-of-gunfire-and-burned-homes-that-left/article_63110243-5875-5bd6-9a66-b7c5a8573c4b.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Police evidence markers are placed next to shell casings in front of home in Auburn, Maine, early Saturday, June 15, 2024.\nPolice have canceled a shelter-in-place order in the city after reporting that an armed person was in an area where a series of explosions and a house fire erupted early Saturday.", "location": ".\nAUBURN", "classification": "security", "score": 0.9003712018740976, "event_breakdown": "* Armed person reported in Auburn, Maine (June 15, 2024)\n* Shelter-in-place order canceled in Auburn, Maine (June 15, 2024)"}, {"id": "35f17155-569e-4f81-a691-7d67dfb32239", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7", "date": "2024-06-16 01:30", "url": "https://kvia.com/news/us-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said.\nSince then at least 37,296 people have been killed in Israel’s offensive in Gaza, according to the latest figures from the Ministry of Health in Gaza.", "location": "Southern Gaza", "classification": "security", "score": 0.9355048648411393, "event_breakdown": "Israelis Killed In Southern Gaza, At Least 14 Killed In Israeli Strikes On Central Gaza"}, {"id": "88064b56-0e80-4211-bf99-1ca02409313d", "title": "8 Israeli soldiers killed in Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 01:00", "url": "https://www.houstonpublicmedia.org/npr/2024/06/15/nx-s1-5007398/8-israeli-soldiers-killed-in-gaza-in-deadliest-attack-on-israeli-forces-in-months/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Israel's military said on Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\n(Ohad Zwigenberg | AP)JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9907662559290604, "event_breakdown": "Title: Gaza: 8 Israeli soldiers killed in southern Gaza\nDate: 23 April, 2011\n\nDescription:\nAn explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\n\nMessage:\nA recent study found that exercise can help reduce symptoms of depression."}, {"id": "90ff1572-de90-411c-9af8-4701fac66053", "title": "Eight Israeli soldiers killed in Gaza in one of the deadliest incidents for the IDF since October 7 - LocalNews8 . com", "date": "2024-06-16 00:00", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/15/eight-israeli-soldiers-killed-in-gaza-in-one-of-the-deadliest-single-incidents-for-israeli-forces-since-october-7-2/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "CNNBy Lauren Izso, Ibrahim Dahman, Eyad Kourdi and Andrew Raine, CNN(CNN) — Eight Israeli soldiers were killed in southern Gaza on Saturday, the Israel Defense Forces says, in one of the deadliest single incidents involving its troops since October 7.\nSo great was the damage that it was difficult to identify and locate the bodies of those killed, the Israeli military added.\n“When the (four soldiers earlier this week) were killed, we were in the Knesset, voting on the conscription law.\nElsewhere, at least 14 people were killed, including seven children, in Israeli strikes on central Gaza, the Civil Defense Directorate in Gaza said.\nSince then at least 37,296 people have been killed in Israel’s offensive in Gaza, according to the latest figures from the Ministry of Health in Gaza.", "location": "Gaza", "classification": "security", "score": 0.9355048648411393, "event_breakdown": "IDF airstrike targets Hamas command center, killing Hamas operatives\nAt least 14 people were killed, including seven children, in Israeli strikes on central Gaza."}, {"id": "8ca466d1-fbf2-4505-ba46-c6729cdc6c18", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://www.wcti12.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Gaza"}, {"id": "b7785444-a0a8-4cfc-b6db-61652516f858", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:00", "url": "https://wjla.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wjla.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "[\n\"Eight Israeli soldiers were killed in southern Gaza on Saturday, making it the deadliest attack on Israeli forces in months.\",\n\"Rear Adm. Daniel Hagari, an Israeli military spokesman, said the attack was caused by either an explosive placed by Hamas or an anti-tank missile.\"\n]"}, {"id": "083ff799-120f-4b86-834c-c044aa2f498c", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 03:30", "url": "https://gazette.com/ap/international/8-israeli-soldiers-killed-in-southern-gaza-in-deadliest-attack-on-israeli-forces-in-months/article_c08b0b07-8cc9-5286-9a79-3fcb884eac0b.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsIsrael’s military says that eight soldiers have been killed in southern Gaza in the deadliest attack on Israeli forces in months", "location": "GAZA", "classification": "security", "score": 0.9939066402369385, "event_breakdown": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months"}, {"id": "83dff36c-d9fa-4a59-bc21-8ddd31277973", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://wlos.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "wlos.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Gaza, Israel"}, {"id": "c7e3140a-b55b-42fc-a6eb-02bd46b95c90", "title": "Iraqi Shiite Militia Claims Missile Attack On N . Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338215/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-N-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BAGHDAD, Jun 16 (NNN-NINA) – A Shiite in Iraq, yesterday, claimed responsibility for an attack with a missile, on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement that, its fighters launched an attack at dawn yesterday, with a long-range al-Arqab upgraded cruise missile, on“a site in Haifa.”It provided no further details about the targeted location or any resulting casualties.\nThe militia stressed that, the attack was carried out“in solidarity with the people in the Gaza Strip” and pledged to continue its attacks on“the enemy's strongholds.”Earlier yesterday, the movement claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and U.S. targets in the region, since the outbreak of the Gaza conflict on Oct 7, last year.– NNN-NINA", "location": "Haifa, Israel", "classification": "security", "score": 0.9973193411646091, "event_breakdown": "BAGHDAD, Jun 16 (NNN-NINA) – The Islamic Resistance in Iraq has claimed responsibility for an attack with a missile, on a site in Haifa, in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement that , its fighters launched an attack at dawn yesterday, with a long-range al-Arqab upgraded cruise missile, on \"a site in Haifa.\" It provided no further details about the targeted location or any resulting casualties.\nThe militia stressed that , the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and U.S. targets in the region, since the outbreak of the Gaza conflict on Oct 7, last year.\n- NNN-NINA"}, {"id": "8d57b59e-3b4e-4362-ade4-173e874a11da", "title": "Iraqi Shiite Militia Claims Missile Attack On Israel", "date": "2024-06-16 00:45", "url": "https://menafn.com/1108338213/Iraqi-Shiite-Militia-Claims-Missile-Attack-On-Israel", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Baghdad, June 16 (IANS) A Shiite in Iraq has claimed responsibility for an attack with a missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023.", "location": "Haifa", "classification": "security", "score": 0.9905001600431093, "event_breakdown": "Attack on a site in Haifa, Israel"}, {"id": "57d927ef-f1d5-463d-9692-2b3c64ee4a13", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://turnto10.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": ".\nGAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Event 1: Eight Israeli soldiers killed in southern Gaza\nEvent 2: Israeli Foreign Minister Israel Katz and a Israeli military spokesman identified the explosion as being caused by an explosive of anti-tank missile."}, {"id": "a59d68dd-ae17-4107-8254-59b2ccd280d1", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 01:00", "url": "https://foxbaltimore.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Southern Gaza, Israel"}, {"id": "2d1b9c66-d95e-4fff-bace-03ce7ca4e9bc", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://news3lv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Gaza"}, {"id": "e44bd699-ddd9-4e48-a567-78571c6210c9", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 03:30", "url": "https://www.nbcmontana.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": ")\nGAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Event 1: An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months. The attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters. I salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter. Rear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nCurrent Event 2: In January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza."}, {"id": "43abad10-bf10-4842-b517-bf93663180b6", "title": "Crew Abandons Cargo Ship Hit By Houthi Missile Strikes In Gulf Of Aden : US", "date": "2024-06-16 02:30", "url": "https://article.wn.com/view/2024/06/16/Crew_Abandons_Cargo_Ship_Hit_By_Houthi_Missile_Strikes_In_Gu/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The crew of a bulk cargo carrier that was damaged in a missile attack by Yemen's Huthi rebels in the Gulf of Aden has abandoned the ship, the US military said Saturday.\n...... read full story", "location": ")\nThe Gulf of Aden.", "classification": "security", "score": 0.6861995274639002, "event_breakdown": "Target event: Security forces have detained 12 people in a new operation against drug trafficking\nSecurity forces have detained 12 people in a new operation against drug trafficking in Guatemala. The operation, dubbed San José, targeted 11 locations in Guatemala City.\nGuatemala is a major transit route for drug trafficking, and the country is plagued by drug-related violence. Drug cartels smuggle cocaine and methamphetamine from South America to the United States, and they often recruit local gang members to help them.\nThe operation, which took place on January 31, 2021, targeted drug trafficking organizations in Guatemala City, according to a statement from the country's security forces. The statement said that security forces seized a large quantity of cocaine, methamphetamine, and other drugs, as well as weapons and vehicles.\nThe operation was part of a larger effort by security forces to crack down on drug trafficking in Guatemala, which has seen a surge in drug-related violence in recent years.\nArticle: Yemen rebels target bulk carrier with missile attack in Gulf of Aden\nYemen's Huthi rebels have targeted a bulk carrier in the Gulf of Aden with a missile attack, the US military said Saturday.\nThe crew of the bulk carrier, which was carrying a load of grain, abandoned the ship after the attack, which is now on fire, the statement said.\nThe attack on the Gulf of Aden, a key waterway for oil shipments and global commerce, is likely to raise tensions in the Middle East."}, {"id": "fae31c55-2bdf-49f8-9776-8f2395abc9b0", "title": "Woman stabbed multiple times next to ATM ; police search for suspect", "date": "2024-06-16 00:00", "url": "https://www.yahoo.com/news/woman-stabbed-multiple-times-next-213942847.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (FOX 5/KUSI) — Authorities are searching for an armed suspect after a 30-year-old pregnant woman was brutally attacked in Mira Mesa on Saturday, authorities said.\nThe suspect then reportedly pushed the victim to the ground before stabbing her two more times in the upper body.\nSan Diego Police released the below photos of the suspect to FOX 5/KUSI.\nSan Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)San Diego Police release photos of the suspect accused of stabbing a pregnant woman multiple times next to an ATM in Mira Mesa (Photo: San Diego Police Department)Northeastern Division Detectives responded and are handling the investigation.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News.", "location": "Mira Mesa", "classification": "security", "score": 0.727349213223945, "event_breakdown": "Armed suspect sought in stabbing of pregnant woman in Mira Mesa, California. Authorities are searching for an armed suspect after a 30-year-old pregnant woman was brutally attacked in Mira Mesa on Saturday, authorities said. https://t.co/Ni9ZhyI1HM"}, {"id": "93cbb1a5-1ad2-450a-b13d-cea93ba33aef", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas -- China Economic Net", "date": "2024-06-16 02:00", "url": "http://en.ce.cn/main/latest/202406/16/t20240616_39038453.shtml", "domain": "en.ce.cn", "domain_classification": "Unknown", "message": "GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage.", "location": "GAZA", "classification": "security", "score": 0.9780521905214745, "event_breakdown": "Security Event 1:\nThe al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip."}, {"id": "f215ddf8-80b6-43fe-afd8-f4007b35baed", "title": "8 soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 02:00", "url": "https://article.wn.com/view/2024/06/16/8_soldiers_killed_in_southern_Gaza_in_deadliest_attack_on_Is/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "JERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\n...... read full story", "location": "GAZA", "classification": "security", "score": 0.9454637484426076, "event_breakdown": "Location: Southern Gaza\nEvent: Explosion kills eight Israeli soldiers\nDate: 2022-05-21"}, {"id": "6dee5436-0093-471d-8a33-08b873fc9703", "title": "Nokor building roads , walls inside Demilitarized Zone – Yonhap", "date": "2024-06-16 03:30", "url": "https://manilastandard.net/news/314459953/nokor-building-roads-walls-inside-demilitarized-zone-yonhap.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -North Korea’s military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nSouth Korean authorities said it was likely accidental, and Yonhap quoted a military spokesman as saying some of the North Koreans were carrying work tools.\nThen, South Korea resumed blasting K-pop songs and news broadcasts at the North, using loudspeakers installed at the border.\nIt has previously threatened artillery strikes against the South Korean loudspeakers – a psychological warfare tactic that dates back to the 1950-53 Korean War.", "location": "Panmunjom", "classification": "security", "score": 0.7887054058645081, "event_breakdown": "North Korea is building roads in the Demilitarized Zone that separates it from South Korea, Yonhap news agency reported Saturday.\nSouth Korean forces fired warning shots after North Korean soldiers briefly crossed the DMZ last week, according to Yonhap.\nSouth Korea resumed blasting K-pop songs and news broadcasts at the North, using loudspeakers installed at the border, Yonhap reported.\nNorth Korea has previously threatened artillery strikes against the South Korean loudspeakers, which have been used as a form of psychological warfare since the Korean War."}, {"id": "1859ad1f-1e15-44a4-b16a-755766675034", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658059/ukraine-employs-a-flexible-defense-while-waiting-for-new-western-ammo-to-get-to-the-front", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukrainian firepower has been improving since U.S. lawmakers approved a much-needed military aid package this spring, though not quickly enough to halt the Russian offensive in eastern Ukraine.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago.\nOne unit in the Chasiv Yar area said a quarter of its casualties happen while transporting troops to and from front-line positions.\nTor, the commander of the Kotyky unit in Chasiv Yar, said Russia’s ever-present drones have made it impossible to mask especially large troop movements.", "location": "KYIV, Ukraine.", "classification": "security", "score": 0.4589258789168187, "event_breakdown": "Russia's invasion of Ukraine has begun. Troops moved into Ukrainian territory from three sides, attacking soldiers with artillery, tanks, and missiles. Russian tanks and soldiers have faced the strongest and most determined opposition from weary Ukrainian fighters."}, {"id": "c3b7e587-713e-4b24-a94e-61e88b6660bd", "title": "More Gazans Killed As Israeli Strikes Continue", "date": "2024-06-16 04:00", "url": "https://menafn.com/1108338239/More-Gazans-Killed-As-Israeli-Strikes-Continue", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Eight Israeli were killed in the southern Gaza Strip Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nFour others were killed in separate attacks in the south, medics said.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza.", "location": "GAZA CITY, GAZA", "classification": "security", "score": 0.9784077792227028, "event_breakdown": "Israeli ground invasion in Gaza reported, threatening civilians with destruction and death.\nGaza City suburbs hit with airstrikes leaving 15 people reported dead.\nIsraeli tanks advance in Tel al-Sultan with shells landing in the coastal area.\n19 Palestinians killed in continuing Israeli strikes.\n8 Israelis are reported killed by ground invasion."}, {"id": "9b6e5857-10ff-42a3-8b4e-4c06d254c008", "title": "  Weep Over Fall of Our Fighter : PM Benjamin Netanyahu As Eight Israeli Soldiers Killed In Southern Gaza", "date": "2024-06-16 02:00", "url": "https://www.news18.com/world/israel-hamas-war-eight-idf-soldiers-killed-as-fighting-continues-in-gazan-city-of-rafah-8933938.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Prime Minister Benjamin Netanyahu on Saturday expressed grief over the killing of eight Israeli soldiers in the southern Gaza Strip.\nThis comes as Israeli forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nPrime Minister Netanyahu, this evening:“Citizens of Israel, today we paid a heart-rending price in our just war in defense of our homeland.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nThe deaths of the soldiers may complicate the political situation facing Prime Minister Benjamin Netanyahu, a week after centrist former general Benny Gantz quit the government, accusing Netanyahu of having no proper strategy for Gaza.", "location": "GAZA", "classification": "security", "score": 0.9515041641913643, "event_breakdown": "1. Israeli military continues pushing in and around southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\n2. Israeli forces killed eight Israeli soldiers this evening."}, {"id": "610204b3-2b46-48bd-a3a2-97707514960f", "title": "Eight Israeli soldiers and 19 Palestinians killed as fighting continues in Rafah - 16 - Jun - 2024", "date": "2024-06-16 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400483", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Eight Israeli soldiers have been killed in a blast in the southern Gaza Strip, the military says, as its forces continue to push into the city of Rafah, with strikes in several areas of Gaza killing at least 19 Palestinians, residents and medics say.\nAccording to the Israel Defense Forces (IDF), the Israeli soldiers were in an armoured carrier that detonated on Saturday while carrying combat engineering materials, apparently in contravention of standard practice.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nAt least 15 people were killed by Israeli air strikes on two houses in Gaza City suburbs, according to residents.\nAt least 37,296 Palestinians have been killed in Israel's military campaign against Hamas, according to the Gaza health ministry.", "location": "GAZA", "classification": "security", "score": 0.9872453425893443, "event_breakdown": "Event 1: Eight Israeli soldiers killed in a blast in southern Gaza\nEvent 2: 15 Palestinian civilians were killed by Israeli air strikes on two houses in Gaza City suburbs"}, {"id": "a473bd30-49fd-48c0-8c00-78dc9cd5eae7", "title": "APC tragedy in Rafah : Names of five soldiers who fell cleared for publication", "date": "2024-06-16 04:15", "url": "http://www.israelnationalnews.com/news/391590", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "- Staff sergeant Stanislav Kostarev, 21, from Ashdod.\n- Staff sergeant Orr Blumovitz, 20, from Pardes Hanna-Karkur.\n- Staff sergeant Oz Yeshaia Gruber, 20, from Tal Menashe.\nOn Saturday night, it was cleared for publication that one of the eight IDF soldiers killed in Rafah was Captain Wassem Mahmoud , 23, from Beit Jann.\nCommenting on the incident, IDF Spokesperson, Rear Admiral Daniel Hagari, said on Saturday night, \"Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\"", "location": "Rafah is a city in southern Gaza near the Egypt border.", "classification": "security", "score": 0.7380411338957277, "event_breakdown": "IDF soldiers killed in Rafah, Gaza Strip. Captain Wassem Mahmoud, 23, from Beit Jann."}, {"id": "2d202973-93b8-4824-b2c6-bbe8e0c3c2a3", "title": "Walter Dods , Jr ., Jay H . Shidler , donate Akaji sculpture to UH Mānoa RISE | University of Hawaiʻi System News", "date": "2024-06-16 01:30", "url": "https://www.hawaii.edu/news/2024/06/15/akaji-sculpture-dedication-rise-grand-opening/", "domain": "hawaii.edu", "domain_classification": "Unknown", "message": "Reading time: 2 minutesUniversity of Hawaiʻi at Mānoa alumni Walter Dods, Jr .\nThe sculpture, “ RISE ,” was installed outside the Walter Dods, Jr .\nRISE Center, and dedicated in a special ceremony prior to the official grand opening of the center on June 15.\nRISE was built under a public-private partnership between UH , UH Foundation and Hunt Companies Hawaiʻi.\nUH Foundation recently moved its headquarters to the second and third floors of the Charles Atherton House at RISE .", "location": "The main event takes place at 'UH at Mānoa', which is located at 2805", "classification": "security", "score": 0.41068584844304445, "event_breakdown": "Event 1: A sculpture called \"RISE\" was installed outside the Walter Dods, Jr. RISE Center at the University of Hawaiʻi at Mānoa. The sculpture was dedicated in a special ceremony prior to the official grand opening of the center on June 15.\nEvent 2: The RISE Center was built under a public-private partnership between the University of Hawaiʻi at Mānoa, the UH Foundation, and Hunt Companies Hawaiʻi.\nEvent 3: The UH Foundation recently moved its headquarters to the second and third floors of the Charles Atherton House at RISE."}, {"id": "ea3e73ee-6752-4dc5-acdd-ae876f646653", "title": "Sam McBride : Day the Pope tapped his toe to the swagger of  The Sash  ", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/comment/sam-mcbride-day-the-pope-tapped-his-toe-to-the-swagger-of-the-sash/a843240098.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "The Royal Irish Regiment returned to Rome last week to celebrate the complexity of IrishnessThe band of the Irish Brigade in the Vatican on June 12, 1944.\nAfter the liberation of Rome in June 1944, Pope Pius XII invited the British army’s 38th (Irish) Brigade to the Vatican.\nThe band of the Irish Brigade in the Vatican on June 12, 1944.\nIreland’s neutrality during World War II is complicated.\nHe won the Military Cross in World War I, the Distinguished Service Order in World War II, and was also twice mentioned in dispatches.", "location": "ROME", "classification": "security", "score": 0.702040029090575, "event_breakdown": "The Royal Irish Regiment returned to Rome last week to celebrate the complexity of Irishness.\nThe band of the Irish Brigade in the Vatican on June 12, 1944."}, {"id": "0769c7c8-26e8-4c19-a000-417350774ca7", "title": "Lebanon Hezbollah targets Israeli military positions in fresh retaliatory strikes", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah targets Israeli military positions in fresh retaliatory strikesIran Press TVSaturday, 15 June 2024 11:32 AMHezbollah has carried out a fresh round of strikes against Israeli military positions in the north in response to the recent Israeli assassination of a top commander in southern Lebanon.\nSami Abdallah, better known by the nom the guerre Abu Taleb, was assassinated along with three other people in the Israeli strikes that targeted a residential building in the southern Lebanese town of Jwaya on Tuesday.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006.\nHezbollah's greatest achievement is the fact that there are tens of thousands of displaced people in the north,\" Gordin said.", "location": "Lebanon", "classification": "security", "score": 0.9903204149543863, "event_breakdown": "Hezbollah has carried out a fresh round of strikes against Israeli military positions in the north in response to the recent Israeli assassination of a top commander in southern Lebanon.\nSami Abdallah, better known by the nom the guerre Abu Taleb, was assassinated along with three other people in the Israeli strikes that targeted a residential building in the southern Lebanese town of Jwaya on Tuesday.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006.\nIt is as yet unknown if there was any damage or casualties caused by Hezbollah's latest strikes on Israeli military positions.\nMore to follow."}, {"id": "a76fbd3a-0496-49cb-b8ca-7cb3e0b66f20", "title": "Lebanon Hezbollah warns of  decisive  response to Israeli expansion of war", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-presstv07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah warns of 'decisive' response to Israeli expansion of warIran Press TVSaturday, 15 June 2024 8:50 AMA senior official of Lebanon's Hezbollah resistance movement has warned the Israeli regime of a \"decisive\" response in case of expanding the scope of its war on Lebanese soil.\nThe senior Hezbollah official cautioned the Israeli regime against any further actions and said, \"You saw how we responded to the assassination of Commander Abu Taleb and his companions.\"\nThe Israeli regime has repeatedly attacked southern Lebanon since October 7, 2023, when it launched a ferocious war on the besieged Gaza Strip that has so far killed about 37,300 Palestinians, most of them women and children.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions in support of Palestinians in Gaza.\nHezbollah has already fought off two Israeli wars against Lebanon in 2000 and 2006.", "location": "Lebanon", "classification": "security", "score": 0.9698595228954018, "event_breakdown": "Events:\n1. Lebanon's Hezbollah warns of 'decisive' response to Israeli expansion of war.\nThe Hezbollah resistance movement has warned the Israeli regime of a \"decisive\" response in case of expanding the scope of its war on Lebanese soil."}, {"id": "7f22c4b2-50aa-4bd2-bd11-b5bb7a44e46d", "title": "US Naval forces rescue crew from Greek - owned ship struck by Houthis in Red Sea By Reuters", "date": "2024-06-16 08:45", "url": "https://www.investing.com/news/commodities-news/us-naval-forces-rescue-crew-from-greekowned-ship-struck-by-houthis-in-red-sea-3486012", "domain": "investing.com", "domain_classification": "Unknown", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel.", "location": "RED SEA", "classification": "security", "score": 0.5668666549235173, "event_breakdown": "Current Event: On June 25th, 2022, the US Navy's Naval Forces Central Command (NAVCENT) reported that it had rescued the crew from a Greek-owned bulk carrier, M/V Tutor, that had come under attack by Yemen's Iran-backed Houthi forces on June 12th in the Red Sea. The crew was airlifted on Saturday, June 25th, with one civilian sailor still missing. The attack caused severe engine room flooding and damage that left the ship unable to manoeuvre. The abandoned ship is currently drifting in the Red Sea. The Houthis claimed responsibility for the attack saying it is part of their campaign against ships bound for Israel."}, {"id": "c04b949c-1efd-46e0-8cb8-ab3b8144d301", "title": "IDF releases names of 5 more soldiers killed in Rafah explosiom", "date": "2024-06-16 06:45", "url": "https://www.ynetnews.com/article/skmtpknra", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The serious incident occurred in the early hours of Saturday morning, when the massive explosion occurred in an armored vehicle near the Tel a-Sultan refugee camp.\nThe names of two other fallen soldiers are expected to be released later on Sunday.\nInside the armored vehicle there were eight soldiers who were killed.\"\nIt was developed in Israel, entered service in 2016 and replaced the Puma combat armored engineering vehicle.\nIt is based on a regular infantry armored personnel carrier, but includes some improvements and adjustments and can carry 10 soldiers.", "location": "GAZA CITY", "classification": "security", "score": 0.932541905582834, "event_breakdown": "New upcoming event:\n\nLocation: Tel a-Sultan refugee camp, Lebanon\nDetails: It was reported that eight soldiers were killed in an explosion in an armored vehicle near the refugee camp in the early hours of Saturday morning."}, {"id": "478b61c7-06c2-4916-9887-ebf39c08ddc8", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616981c599015.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning.", "location": "Belgorod, Russia", "classification": "security", "score": 0.40030953069602054, "event_breakdown": "On Tuesday, Russia’s defence ministry said Ukraine fired rockets at a village near the Ukrainian border and in the neighbouring region. Ukraine confirmed it had launched “a strikes in the region” but made no reference to the latest incident. The attack came as Russia-backed rebels shelled southwestern regions, forcing civilians to flee."}, {"id": "4ca1fc92-755f-46ed-b000-6039a3526a70", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:30", "url": "https://apnews.com/article/auburn-maine-armed-standoff-fire-aad7f7d1eb430d5c49fb1455daeff5e1", "domain": "apnews.com", "domain_classification": "International", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting.", "location": "Auburn, New York", "classification": "security", "score": 0.9783696388892205, "event_breakdown": "Auburn"}, {"id": "d5991854-40d3-468d-a36f-165f5a426055", "title": "Israel rescues hostage Noa Argamani from Hamas captivity in Gaza , newly released footage shows", "date": "2024-06-16 06:30", "url": "https://nypost.com/2024/06/16/world-news/israel-rescues-hostage-noa-argamani-from-hamas-captivity-in-gaza-newly-released-footage-shows/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza.\nYou’re safe, we’re taking you to the vehicle.”Argamani, a 26-year-old China-born Israel citizen, was one of four hostages rescued during the operation.\n8 Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and “complex” operation in Gaza on June 8.\n“We’re from the Yaman (Police) and Shabak (ISA),” one person explains to Argamani inside the vehicle.\nIsrael Foreign Ministry/UPI/Shutterstock8 Argamani, a 26-year-old China-born Israel citizen, Supernova music festival on Oct. 7 when Hamas attacked.", "location": "Gaza", "classification": "security", "score": 0.9669391287092445, "event_breakdown": "* Dramatic bodycam footage captured the moment elite Israeli forces rescued hostage Noa Argamani from eight months of Hamas captivity during a daring and \"complex\" operation in Gaza on June 8.\n* Argamani, a 26-year-old China-born Israel citizen, was one of four hostages rescued during the operation.\n* Noa Argamani had been abducted alongside another young Israeli man and two women at thewarned and Shabak (ISA), are outside the building” and the individuals need to be escorted out.\n* The 26-year-old shared her story from captivity in a rare interview with Channel 12 earlier this month.\n* Noa Argamani and a friend were walking along the beach near the Cypress Pavilion when the attack occurred.\"Young man, open the door,\" a voice is heard saying in the video obtained bychannel 12 using a camera worn by one of the soldiers. \".\"We're from the Yaman (Police) person to the woman.\n* \"We saw our lives pass\""}, {"id": "6a5af2d1-d3ca-40f7-b082-0e227509dd1d", "title": "Hezbollah rockets damaged 35 % of Israeli settlements in Metula town : Mayor", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah rockets damaged 35% of Israeli settlements in Metula town: MayorIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- The rocket attacks of the Lebanese resistance movement Hezbollah have damaged 35% of Israeli settlers' houses in al-Metula town in northern occupied Palestine, according to the town's mayor.\nThe Israeli regime's Channel 12 quoted the mayor as saying that more than 190 houses in this settlement, that is, about 35% of its houses, were damaged in Hezbollah's missile attacks.\nHezbollah's missiles have caused heavy damage to the infrastructure, electricity network and agricultural lands of Metula town, he added.\nMeanwhile, The Zionist Army Radio announced that Lebanon's Hezbollah fired more than 60 rockets into occupied Palestine on Friday.\nEarlier, Hebrew sources reported a massive fire in the Baram area in northern occupied Palestine following Hezbollah's rocket attacks and the efforts of four firefighting teams to control the fire.", "location": "Metula", "classification": "security", "score": 0.9940295932618909, "event_breakdown": "1. Hezbollah has damaged 35% of Israeli settlements in Metula town in Israel after firing rockets on June 15, 2024.\n2. Hezbollah fired more than 60 rockets into occupied Palestine on Friday, June 15, 2024, and a fire was reported in the Baram area in northern occupied Palestine."}, {"id": "dd4b2507-3724-4f60-b072-c42f17a0dc93", "title": "Cuba Does Not Approve of US Submarine Presence - Deputy Foreign Minister", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/cuba/cuba-240615-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Cuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterSputnik News20240615MEXICO CITY (Sputnik) - The Cuban government was notified of the USS fast attack submarine Helena visiting the US naval base in Cuba's Guantanamo, but Havana does not approve of such visits, Cuban Deputy Foreign Minister Carlos Fernandez de Cossio said.\n\"We were aware of their presence because, in accordance with the procedures that we have followed for years, the United States informed us in advance.\nUS Southern Command (SOUTHCOM) said Wednesday the USS fast attack submarine Helena made a pre-planned deployment to the US naval base at Guantanamo Bay, Cuba.\nThe deployment followed the Russian naval force's arrival in Cuba for naval exercises.\nUS officials previously noted that the Russian naval deployment to Cuba does not pose a threat to the United States.", "location": "Guantanamo", "classification": "security", "score": 0.5234461876366523, "event_breakdown": "US fast attack submarine Helena deployed to Guantanamo Bay, Cuba on June 15"}, {"id": "604619bc-c9b4-4302-8e8e-a06fbbe1f0b6", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 06:45", "url": "https://www.thestatesman.com/world/iraqi-shiite-militia-claims-missile-attack-on-israel-1503310538.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on “a site in Haifa”, Xinhua news agency reported.\nIt provided no further details about the targeted location or any resulting casualties.\nNo details on casualties were provided in either instance.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023.", "location": "Haifa, Israel", "classification": "security", "score": 0.974826538896139, "event_breakdown": "target - The Islamic Resistance in Iraq claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel."}, {"id": "83babe3e-3381-485b-a7cb-51899f70fb42", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:30", "url": "https://komonews.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "komonews.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Southern Gaza, Israel"}, {"id": "02e75e43-c18a-456b-a317-546636122a22", "title": "8 Israeli soldiers killed in southern Gaza", "date": "2024-06-16 01:00", "url": "https://www.timesleader.com/news/1658056/8-israeli-soldiers-killed-in-southern-gaza", "domain": "timesleader.com", "domain_classification": "Unknown", "message": "Attack on Israeli forces was the deadliest in months🔊 Listen to thisIsraeli army bulldozers are seen near the Gaza Strip border, in southern Israel, on Thursday.\nJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after.", "location": "GAZA", "classification": "security", "score": 0.9858929980423993, "event_breakdown": "Event 1:\nDate of Event: Saturday, August 21, 2021\nLocation: Gaza Strip (border with Israel)\nAttack Type: Explosives were used to attack Israeli soldiers near the border.\nCasualties: Eight Israeli soldeirs were killed."}, {"id": "7bf4a24c-2532-47d1-bfd8-fb5326ee1f54", "title": "Eight more Israeli soldiers killed in south Gaza : Report", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Eight more Israeli soldiers killed in south Gaza: ReportIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Eight Israeli soldiers were killed in an explosion that blew up a military vehicle of the Zionist regime in the south of the Gaza Strip, according to a report.\nAl Mayadeen news channel said that an anti-armor missile blew up a \"Tiger\" military vehicle of the Zionist regime on Saturday.\nAccording to the news channel, eight Israeli soldiers were killed in the Palestinian resistance operation.\nMeanwhile, the Al-Qassam Brigades, the military wing of Hamas, announced on Saturday that it destroyed an Israeli D-9 type bulldozer with an Al-Yassin 105 rocket in Tel al-Sultan area, west of Rafah, in the south of the Gaza Strip.\n6125**4354NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address", "location": "Gaza Strip", "classification": "security", "score": 0.9923139489554935, "event_breakdown": "Eight more Israeli soldiers killed in south Gaza: ReportTehran, IRNA -- Eight Israeli soldiers were killed in an explosion that blew up a military vehicle of the Zionist regime in the south of the Gaza Strip, according to a report.\nThe Al Mayadeen news channel said that an anti-armor missile blew up a \"Tiger\" military vehicle of the Zionist regime on Saturday.\nAccording to the news channel, eight Israeli soldiers were killed in the Palestinian resistance operation.\nMeanwhile, the Al-Qassam Brigades, the military wing of Hamas, announced on Saturday that it destroyed an Israeli D-9 type bulldozer with an Al-Yassin 105 rocket in Tel al-Sultan area, west of Rafah, in the south of the Gaza Strip."}, {"id": "55701eea-fa39-4492-81ba-44b1a8452597", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 00:45", "url": "https://lasvegassun.com/news/2024/jun/15/8-israeli-soldiers-killed-in-southern-gaza-in-dead/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in monthsTsafrir Abayov / Associated PressJERUSALEM — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after.", "location": "GAZA", "classification": "security", "score": 0.9920639772362381, "event_breakdown": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months"}, {"id": "31d7436e-5377-4b1f-a6bd-8a58b1a3ab95", "title": "8 Israeli Soldiers Killed in Southern Gaza", "date": "2024-06-16 06:00", "url": "https://www.theepochtimes.com/world/8-israeli-soldiers-killed-in-southern-gaza-5669358", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "JERUSALEM—Israel’s military said Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\nThe troops were killed in an explosion, the army said, without elaborating.\nThe deaths will likely fuel calls for a cease-fire and heighten Israeli public anger over ultra-Orthodox exemptions from the military.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian terrorists in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9888844866683246, "event_breakdown": "Israel-Palestine conflict IDF attacked southern Gaza, killing 8 Palestinian terrorists. This is the largest attack on Israeli forces since January, when 21 troops were killed by Palestinian terrorists."}, {"id": "b59a3fa8-4061-4ad1-a846-7f581b97468b", "title": "Eight Israeli soldiers killed in southern Gaza", "date": "2024-06-16 05:00", "url": "https://www.afr.com/world/middle-east/eight-israeli-soldiers-killed-in-southern-gaza-20240616-p5jm5y", "domain": "afr.com", "domain_classification": "Unknown", "message": "Jerusalem | Israel’s military said on Sunday it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries destined for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nThe “tactical pause” announced by the military, which applies to about 12 kilometres of road in the Rafah area, falls far short of a complete ceasefire in the beleaguered territory that has been sought by the international community, including Israel’s top ally, the United States.\nIf it holds, the limited halt in fighting could help address some of the overwhelming needs of Palestinians that have surged even more in recent weeks with Israel’s incursion into Rafah.", "location": "GAZA", "classification": "security", "score": 0.44518034988029875, "event_breakdown": "Israel military says it will pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries destined for desperate Palestinians enduring a humanitarian crisis"}, {"id": "38081322-7e31-46f8-a9dc-794bf3659edf", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://bakersfieldnow.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "[\n  {\n    \"source\": \"reuters.com\",\n    \"event\": \"At least 23 people have been wounded during a shooting inside a nightclub in Erbil, the capital of Iraq's northern Kurdish region, security sources said\"\n  },\n  {\n    \"source\": \"reuters.com\",\n    \"event\": \"Gunmen have detonated a car bomb outside a police station in Iraq, killing at least five officers and wounding 18 others\"\n  },\n  {\n    \"source\": \"nar.gov\",\n    \"event\": \"Two troops were injured on Sunday when an improvised bomb went off in central Somalia's Hiran region\"\n  },\n  {\n    \"source\": \"fbi.gov\",\n    \"event\": \"Twenty minutes after the explosion, there was a shooting attack on the Jewish Museum in Brussels at around 3pm\"\n  },\n  {\n    \"source\": \"cnn.com\",\n    \"event\": \"At least 17 people were killed when a suicide attacker rammed a vehicle into a bus stand in India\"\n  },\n  {\n    \"source\": \"huffingtonpost.com\",\n    \"event\": \"Six people were killed and another 14 injured in a suicide bombing near a major tourist area in Marrakesh in morocco\"\n  },\n  {"}, {"id": "1c98116b-4c82-4753-a953-8c8fd1cb58bb", "title": "Iran Update , June 15 , 2024 | Institute for the Study of War", "date": "2024-06-16 02:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-june-15-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, June 15, 2024Johanna Moore, Alexandra Braverman, Kitaneh Fitzpatrick, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nWest Bank: Israeli forces engaged PIJ and the al Aqsa Martyrs Brigades fighters in Kfar Dan.\n[2]Hamas and the Nasser Salah ad Din Brigades conducted mortar and rocket attacks targeting Israeli forces along the Netzarim Corridor on June 15.\nHamas and the al Aqsa Martyrs’ Brigades conducted rocket propelled grenade attacks targeting IDF vehicles.\nThe Martyr Abu Ali Mustafa Brigades launched a salvo of rockets targeting Israeli forces stationed at the Kerem Shalom border crossing.", "location": "West Bank", "classification": "security", "score": 0.9987946294552476, "event_breakdown": "West Bank: Israeli forces engaged PIJ fighters in Kfar Dan\nHamas conducted mortar and rocket attacks along the Netzarim Corridor\nHamas and the al Aqsa Martyrs' Brigades conducted RPG attacks targeting IDF vehicles\nThe Martyr Abu Ali Mustafa Brigades launched rockets targeting the Kerem Shalom border crossing"}, {"id": "fdce06ba-567b-468b-ac9a-0477425d83a6", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 06:15", "url": "https://kitchener.citynews.ca/2024/06/15/explosions-heard-as-maine-police-deal-with-armed-individual/", "domain": "kitchener.citynews.ca", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting.", "location": "Auburn, Maine", "classification": "security", "score": 0.9783696388892205, "event_breakdown": "Current Events of Security Reported in the Text:\n\nEvent 1: Police Shoot Home Intruder\nLocation: Auburn, New York\nDescription: Auburn police officers shot and injured a man who tried to break in to a home. The incident took place around 1:00 a.m. on Saturday.\n\nEvent 2: Home Intruder Shot\nLocation: Auburn, New York\nDescription: The injured home intruder was identified as Joseph Hinkley by a woman hiding down the street. He was shot by the police after getting into a fight with a man inside the house.\n\nEvent 3: Police Shoot Intruder - Burned House\nLocation: Auburn, New York\nDescription: The incident took place at a home where police heard yelling and observed flames coming from windows and engulfing the building. Several vehicles parked beside the homes were also burned, including a yellow school bus.\n\nEvent 4: Multiple Crimes Invesitigated\nLocation: Auburn, New York\nDescription: A state police major crimes unit is investigating the conduct of the criminal conduct, and the attorney general's office is investigating the circumstances surrounding the police shooting."}, {"id": "e8153f19-cba4-40fc-a0c1-1c71c9870943", "title": "Deadliest attack in months kills 8 Israeli soldiers in Gaza explosion", "date": "2024-06-16 00:45", "url": "https://www.krcrtv.com/news/nation-world/deadliest-attack-in-months-kills-8-israeli-soldiers-in-gaza-explosion-israel-hamas-war-middle-east-calls-for-cease-fire-military-operations-palestine-humanitarian-aid", "domain": "krcrtv.com", "domain_classification": "Unknown", "message": "An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe attack, coming more than eight months into a grinding war that shows few signs of ending soon, was likely to fuel by Israeli protesters.\nI salute them and hug their families,\" said Israeli Foreign Minister Israel Katz in a post on X, formerly Twitter.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9569158664534759, "event_breakdown": "Gaza"}, {"id": "5a907d69-54e3-4a2d-83cd-c5a6583e80e2", "title": "What to look out for at Eurosatory , Europe biggest defense show", "date": "2024-06-16 07:15", "url": "https://www.defensenews.com/digital-show-dailies/eurosatory/2024/06/16/what-to-look-out-for-at-eurosatory-europes-biggest-defense-show/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "European governments have raised their defense budgets “so the business is there,” and military planners attending the show will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing.\nLook out at Eurosatory for hardy, expendable tactical drones, as well as stealthy drones that can operate close to the battle.\nDeep firesWith artillery being key on the Ukrainian battlefield, cannons and rocket artillery will be a major topic at Eurosatory 2024, with at least 10 manufacturers showcasing their systems, Beaudouin said.\n“We’re at the dawn, but only at the dawn, of a new definition of armored vehicles,” Beaudouin said.\n“War always takes us by surprise, and forces us to adapt.”Rudy Ruitenberg is a Europe correspondent for Defense News.", "location": "Eurosatory, Villepinte, France.", "classification": "security", "score": 0.5109259270953407, "event_breakdown": "1. Targeting Eurosatory 2024, a decade from now – a military defense exposition which will take place from Jun 13 to 17, 2024 in Paris or Villepinte, France. The business of military defense will be concentrated on drones, anti-drone systems, air defense, long-range fires, and mine clearing.\n2. Eurosatory 2024: Manufacturers will be showcasing at least 10 artillery systems which present “deep fires” – a key topic considering the relevance of artillery in ground engagements.\n3. The future of armored vehicles is coming, redefining the concept of ‘war machines’ due to the unpredictability of international events."}, {"id": "bd345bb8-2d01-453a-9294-64025ede7e0e", "title": "Every Israeli , both Jews and Arabs , equal in life and death - editorial", "date": "2024-06-16 04:45", "url": "https://www.jpost.com/opinion/article-806347", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Wassem Mahmoud, a Druze Israeli who proudly served his country until his last breath.\nThe tragic deaths of Mahmoud and the seven other IDF soldiers underscore a pressing issue in Israeli society that must be urgently addressed: racism.\nThe Druze community must be equal partners not only in battle and mourning but also in life.”Tarif is correct.\n(credit: AMMAR AWAD/REUTERS)However, their contributions are often overshadowed by systemic racism and social discrimination that persist in Israeli society.\nIsraeli society must acknowledge and combat racism to create a more inclusive and cohesive nation.", "location": ")\nJERUSALEM", "classification": "security", "score": 0.6811927128293054, "event_breakdown": "IDF: Israeli army struck Iranian targets near Damascus\nIran: rocket hit 'sensitive military site' near Golan\nRockets fired from Lebanon hit open area in Upper Galilee as IDF responds\nIsrael: Iranian forces in Syria fired rockets at northern Israel"}, {"id": "8e8da4e3-f7da-4e72-b6d1-0346ed733a46", "title": "North Korea building roads , walls inside Demilitarized Zone Yonhap", "date": "2024-06-16 07:15", "url": "https://www.philstar.com/world/2024/06/16/2363309/north-korea-building-roads-walls-inside-demilitarized-zone-yonhap", "domain": "philstar.com", "domain_classification": "Unknown", "message": "North Korea building roads, walls inside Demilitarized Zone — YonhapA South Korean soldier stands guard near a military facility (R, green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju on June 11, 2024.\nSEOUL, South Korea — North Korea's military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nWhen asked about the report, the South Korean military said in a statement that it was \"closely tracking and monitoring the activities of the North Korean military\", and that \"further analysis is required\".\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture.", "location": "Based on the text provided, I was unable to come up with a specific location.", "classification": "security", "score": 0.9414195878563808, "event_breakdown": "North Korea's military building roads and walls inside Demilitarized Zone as reported by Yonhap agency"}, {"id": "9845e672-d924-47ac-ab6c-f32fd42856af", "title": "Monument to wartime malaria victims unveiled on Okinawa isle | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-16 08:45", "url": "https://www.asahi.com/ajw/articles/15307493", "domain": "asahi.com", "domain_classification": "Unknown", "message": "TAKETOMI, Okinawa Prefecture--A memorial ceremony was held for victims of a disastrous wartime relocation program by the Japanese military that left hundreds of islanders dead from malaria.\nAbout one-third of them died from malaria, either in Iriomotejima or after their return to Haterumajima following Japan’s defeat in the war.\nThe decision to move the islanders was made as the bloody Battle of Okinawa was getting under way.\nRelatives of the victims, as well as local school children, came to offer prayers that the tragedy would not be forgotten.\nHis siblings also contracted malaria, and five of the seven died, including his older brother who was killed in action.", "location": "Okinawa Prefecture", "classification": "security", "score": 0.7006997763729478, "event_breakdown": "Battle of Okinawa\nThe ceremony was held in Okinawa Prefecture, Japan, to remember the victims who died in a wartime relocation program ordered by the Japanese military. About one-third of the islanders died from malaria either on the island they were relocated to, Iriomotejima, or after returning to the original island following Japan's defeat."}, {"id": "e08a5f11-6188-4994-a9b8-26869e1108bf", "title": "235 officers , including 22 women , join Air Force", "date": "2024-06-16 06:30", "url": "https://www.newindianexpress.com/thesundaystandard/2024/Jun/16/235-officers-including-22-women-join-air-force", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "NEW DELHI: The Combined Graduation Parade (CGP) was held at the Air Force Academy at Dundigal near Hyderabad on Saturday to mark the culmination of the training of 235 flight cadets of flying and ground duty branches of the Indian Air Force.\n“The graduating officers included 22 women officers who got commissioned in various branches of the IAF,” said an official statement.\nNine officers from the Indian Navy, nine from the Indian Coast Guard, and one officer from the friendly foreign countries were also awarded ‘wings’ on completion of flying training, it added.\nThis is also the first CGP where 25 cadets, who joined the National Defence Academy four years ago for ground duty branches, were commissioned as officers.\nFive of these officers have been commissioned in the administration branch, three in the logistics branch and 17 in the technical branch of the Air Force.", "location": "DUNDIGAL", "classification": "security", "score": 0.42536080106716206, "event_breakdown": "From:\n“The Combined Graduation Parade (CGP) was held at the Air Force Academy at Dundigal near Hyderabad on Saturday to mark the culmination of the training of 235 flight cadets of flying and ground duty branches of the Indian Air Force.”"}, {"id": "4bee4104-f472-49a7-be0d-83c7b25c3bda", "title": "On This Day , June 16 : Sara Jane Olson captured after 20 years on the run", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/day-june-16-sara-jane-070006512.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On This Day, June 16: Sara Jane Olson captured after 20 years on the runOn June 16, 1999, police arrested Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army, which kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009.\nOn June 16, 1963, the Soviet Union put the first woman into space, cosmonaut Tereshkova.\nIn 1999, police arrested Sara Jane Olson, formerly known as Kathleen Ann Soliah, a member of the terrorist Symbionese Liberation Army that kidnapped newspaper heiress Patty Hearst.\nSoliah, who later changed her name to Sara Jane Olson, was released from prison in 2009.", "location": ")\nInglewood, California", "classification": "security", "score": 0.9284334311771821, "event_breakdown": "Arrest of Sara Jane Olson, formerly known as Kathleen Ann Soliah, a member of the Symbionese Liberation Army, in 1999"}, {"id": "eaa0b4b7-f43e-4a7a-b9bc-bf1f5ad90dfb", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.myjoyonline.com/israel-announces-military-pause-on-gaza-road-to-let-in-aid/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Israel is under pressure from its allies to enable sufficient aid to reach those living in GazaThe Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nAid agencies have repeatedly reported difficulties in distributing aid around Gaza.", "location": "GAZA", "classification": "security", "score": 0.9161048762974348, "event_breakdown": "['Israel will hold daily \"tactical pauses\" along a road in southern Gaza to allow more humanitarian aid to enter', 'N/A']"}, {"id": "00aa0199-18dc-4c97-90cc-4b1436a22532", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.bbc.co.uk/news/articles/cgeepk8rp9xo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "International agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe number of aid trucks entering Gaza continues to be well below what agencies have said is required.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day.\nOCHA points out that since 7 May, it has been unable to directly observe the arrival of aid from the private sector through the Kerem Shalom crossing.", "location": "GAZA", "classification": "security", "score": 0.6242434630453344, "event_breakdown": "The daily average number of trucks delivering humanitarian aid into Gaza in May was 97. Prior to the outbreak of the war on 7 October, around 500 trucks carrying aid were entering Gaza every day.\nThe International Committee of the Red Cross (ICRC) has warned of a \"dangerous and volatile\" humanitarian situation in Gaza, where more than 50,000 people remain displaced following the conflict last summer. The ICRC said that only a third of the $571 million needed to meet humanitarian needs in Gaza this year had been received."}, {"id": "51ee8621-7dfe-4f47-af50-3ad3df2f2b30", "title": "Gaza war : Israel announces daily military pause along road to let in aid", "date": "2024-06-16 09:00", "url": "https://www.bbc.com/news/articles/cgeepk8rp9xo", "domain": "bbc.com", "domain_classification": "International", "message": "They will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day.", "location": "Gaza", "classification": "security", "score": 0.6988237815364097, "event_breakdown": "Gaza Crossing\nIsrael partially opens Gaza crossing after pressure from allies\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel -\nwas 97\nPrior to the outbreak of the war on 7 October, around 500 trucks carrying aid - including fuel - were entering Gaza every day."}, {"id": "8fa13134-d0d8-4d2c-810a-e747582eb38f", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/israel-announces-military-pause-gaza-080608938.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel announces military pause on Gaza road to let in aidIsrael is under pressure from its allies to enable sufficient aid to reach those living in Gaza [Reuters]The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.", "location": "GAZA", "classification": "security", "score": 0.9070527664611334, "event_breakdown": "Gaza road"}, {"id": "80c0b02e-bf78-4f47-8d73-5cbe2c875199", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 06:15", "url": "https://www.thestandard.com.hk/breaking-news/section/6/217460/Eight-Israeli-soldiers-killed-as-fighting-continues-in-Rafah", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)Eight Israeli soldiers were killed in the southern Gaza Strip on Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities.\nSince a week-long truce in November, repeated attempts to arrange a ceasefire have failed, with Hamas insisting on a permanent end to the war and full Israeli withdrawal from Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.9853494852558874, "event_breakdown": "1. Israeli soldiers were killed in the southern Gaza Strip on Saturday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, at least 12 Palestinians.\n2. Israeli airstrikes on two houses in Gaza City suburbs left one dead. More than a dozen targets were destroyed and a rocket fired from Lebanon struck northern Israel."}, {"id": "955171cc-e5a9-41b5-bcef-9032964d35e5", "title": "Eight Israeli soldiers killed as fighting continues in Rafah", "date": "2024-06-16 09:00", "url": "https://www.stabroeknews.com/2024/06/16/news/world/eight-israeli-soldiers-killed-as-fighting-continues-in-rafah/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "JERUSALEM/CAIRO, (Reuters) – Eight Israeli soldiers were killed in the southern Gaza Strip yesterday, the military said, as forces continued to push in and around the southern city of Rafah and strikes hit several areas of Gaza, killing at least 19 Palestinians.\nIt said the early morning incident, in the Tel al-Sultan area in the west of Rafah, was being investigated.\nIsraeli tanks advanced in Tel al-Sultan and shells landed in the coastal area, where thousands of Palestinians, many of them displaced several times already, have sought refuge.\nIn Israeli airstrikes on two houses in Gaza City suburbs, residents said at least 15 people were killed.\nMore than 100 hostages are believed to remain captive in Gaza, although at least 40 have been declared dead in absentia by Israeli authorities.", "location": "GAZA CITY", "classification": "security", "score": 0.9921768889471586, "event_breakdown": "Palestine/Israel, Tel Aviv, Rafah, Gaza Strip, Gaza City"}, {"id": "f2d1e370-24c7-42fa-b9f6-6990d65d0744", "title": "Press Briefing by IDF Spokesperson RAdm . Daniel Hagari - June 15 , 2024", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-idf01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press Briefing by IDF Spokesperson RAdm.\nDaniel Hagari- June 15, 2024IDF Press ReleaseJune 15, 202415.06.24IDFThis is a difficult evening,Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\nIDF representatives delivered the hard news to the families, and are currently with them at this difficult time.\nPlease respect the bereaved families, our first commitment in the IDF is to them, and we will not deviate from this principle.\nIDF troops are making progress in the defeat of the Hamas military wing, focusing on dismantling the Rafah Brigade's capabilities.", "location": "Gaza", "classification": "security", "score": 0.9062387321965223, "event_breakdown": "Gaza"}, {"id": "89f6564a-630b-49f4-9ea6-13677776844f", "title": "The 8 Great Families of  House of the Dragon  explained", "date": "2024-06-16 07:30", "url": "https://timesofindia.indiatimes.com/web-series/news/english/the-8-great-families-of-house-of-the-dragon-explained/articleshow/111034047.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "\" House of the Dragon \" takes place two centuries before \"Game of Thrones\" and features several of the same noble houses.\nThe Targaryens maintained peace for many years, but after King Viserys I's reign, a conflict over the succession to the Iron Throne began.\nCorlys is a naval leader and explorer who supports Rhaenyra Targaryen in the civil war.\nSer Otto Hightower served as Hand of the King to both King Viserys I and King Jaehaerys Targaryen.\nTheir house is not mentioned in \"Game of Thrones\" and is likely extinct by that time.House Strong House Strong plays a significant role in \"House of the Dragon.\"", "location": "The most specific location mentioned in the text is King's Landing.", "classification": "security", "score": 0.4725479614698408, "event_breakdown": "1. Taliban fighters are closing in on the capital Kabul, posing the most serious threat in years to the government. The group captured at least six provincial capitals in less than a week. pic.twitter.com/mB3t5vZ7Ee\n2. Jamaica is reporting a significant surge in murders this August, with at least 93 persons killed. Most fatalities were as a result of gunshot wounds. Authorities blamed the surge on increased gang violence. jamaica-gleaner.com/search?cx=partner...\n1. Taliban fighters are closing in on the capital Kabul, posing the most serious threat in years to the government.\n2. Jamaica is reporting a significant surge in murders this August, with at least 93 persons killed."}, {"id": "9935693d-5e4e-48ce-8d4f-4969b21ee688", "title": "Russians lost another 1 , 160 soldiers and 58 artillery systems", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/russians-lost-another-1-160-040818409.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The General Staff of the Armed Forces of Ukraine reported that Russia lost another 1,160 soldiers and 58 artillery systems over the past 24 hours.\nSource: General Staff of the Armed Forces of UkraineDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:526,310 (+1,160) military personnel;7,956 (+0) tanks;15,269 (+6) armoured combat vehicles;13,913 (+58) artillery systems;1,104 (+1) multiple-launch rocket systems;853 (+0) air defence systems;359 (+0) fixed-wing aircraft;326 (+0) helicopters;11,159 (+11) strategic and tactical UAVs;2,296 (+3) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,967 (+56) vehicles and tankers;2,325 (+3) special vehicles and other equipment.\nSupport UP or become our patron!", "location": ".\nKharkiv, Ukraine", "classification": "security", "score": 0.8424077502079609, "event_breakdown": "The General Staff of the Armed Forces of Ukraine said that Russia had ultimately lost 1,160 soldiers and 58 artillery systems over the past 24sn. As of July 4, 1,323,375 total Russian military personnel have reportedly been lost since the start of the war."}, {"id": "950ad66c-e2b8-40ca-81a2-67757f28aa6b", "title": "Responding to Hezbollah strategic offensive – J - Wire", "date": "2024-06-16 12:15", "url": "https://www.jwire.com.au/responding-to-hezbollahs-strategic-offensive/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Responding to Hezbollah’s strategic offensiveRead on for articleHezbollah is burning a swathe through northern Israel.\nThe Nasser unit is a division-sized formation responsible for Hezbollah’s operations along the border with Israel.\nThe main problem with the IDF’s assertion is that it ignores the strategic logic of Hezbollah’s operations.\nHezbollah isn’t simply abusive; it is waging a strategic war with clear long-term and intermediate strategic objectives.\nUnder Hezbollah’s control, Lebanon is not an actual country.", "location": "Lebanon", "classification": "security", "score": 0.8690539264397434, "event_breakdown": "The target event was:\nThe Nasser unit is a division-sized formation responsible for Hezbollah’s operations along the border with Israel.\nReported in:\nHezbollah is burning a swathe through northern Israel."}, {"id": "6f5b4b02-21fa-46a3-a650-02ffa830e4b8", "title": "Gaza : 8 Israeli soldiers killed in one of the deadliest attack - IDF", "date": "2024-06-16 12:00", "url": "https://dailypost.ng/2024/06/16/gaza-8-israeli-soldiers-killed-in-one-of-the-deadliest-attack-idf/", "domain": "dailypost.ng", "domain_classification": "Unknown", "message": "No fewer than eight Israeli soldiers were killed in southern Gaza.\nThe Israel Defense Forces (IDF) said the deadliest single incident involving its troops since October 7 happened on Saturday.\n“The current assessment is that the ‘Nemera’ armored vehicle was hit as a result of an explosion of a roadside bomb.\nIn addition, on the vehicle there were engineering tools that included explosive material.\n“The explosion was significant and may have been caused by the ignition of the explosive material on the vehicle.", "location": "Southern Gaza", "classification": "security", "score": 0.9971516953923486, "event_breakdown": "Eight Israeli soldiers were killed in southern Gaza on Saturday. The Israel Defense Forces (IDF) said that the explosion hit a “Nemera” armored vehicle, which was carrying engineering tools that included explosive material. The IDF said the incident was the deadliest attack on its troops since October 7."}, {"id": "849a951a-75d4-4f6d-ab1c-211d3d8df954", "title": "Four civilians killed as Russia launches widespread missile attack on Ukraine", "date": "2024-06-16 13:00", "url": "http://www.myanmarmuslim.net/news/20240616955b599042.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The governor of the Kursk region, Roman Starovoit, said a shopping centre and a school stadium were hit in the missile attack.\nAn apartment building in Kharkiv region was severely damaged in the attack (Kharkiv Regional Prosecutor’s Office/ via AP)“There are many casualties: dead and wounded,” he said on Telegram.\nDozens of people were killed and injured in an attack there over Russia’s New Year holiday weekend.\nIn Ukraine, five people were injured in the night-time attack on the city of Chuhuiv, in the Kharkiv border region, regional governor Oleh Syniehubov said.\nThe Russian missiles used on Thursday included Iskander ballistic missiles, Kalibr cruise missiles, guided aviation missiles and adapted S-300 anti-aircraft missiles.", "location": "Kharkiv region", "classification": "security", "score": 0.9004727638753155, "event_breakdown": "Target event: Russian military conducts missile strikes in Chuhuiv, Ukraine\nRussian military conducts missile strikes in Chuhuiv, Ukraine, Kharkiv border region, injuring five."}, {"id": "18bf3a52-2bec-4d14-a1da-2b905c359919", "title": "Houthis claim attack which damaged united kingdom ", "date": "2024-06-16 10:15", "url": "http://www.myanmarmuslim.net/news/20240616048f599949.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“Vessel at anchor and all crew are safe.”Houthi Brigadier General Yahya Saree issued a statement claiming the attack, saying the vessel later sank.\nShip-tracking data from MarineTraffic.com analysed by The Associated Press identified the vessel targeted as the Rubymar.\nLater on Monday, the UKMTO and Ambrey said a second vessel came under attack in the Gulf of Aden.\nThe Houthis later claimed the attack, but instead said they targeted a second vessel other than the Sea Champion in that assault.\nThose strikes targeted mobile anti-ship cruise missiles, an explosive-carrying drone boat and an “unmanned underwater vessel”, Central Command said.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.4336050072557198, "event_breakdown": "Houthis attack Red Sea Mills, a rice processing factory outside of Yemen's port city of Hodeidah. Crew are safe, and the vessel later sank. UKMTO and Ambrey confirm that a second vessel came under attack in the Gulf of Aden. Houthis later claim they targeted a second vessel in a different attack."}, {"id": "4623d7b1-863c-4ff2-9da9-77dcacfae305", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nOthers suggested the drones may be so-called quadcopters – small, four-rotor drones that are commercially available.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries.", "location": "ESFAHAN, IRAN", "classification": "security", "score": 0.8397136104196471, "event_breakdown": "Isfahan, Iran"}, {"id": "53846571-bdef-4d76-b4c0-66ce54fcd49e", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-16 13:45", "url": "https://dunyanews.tv/en/World/818891-US-military-targets-Houthi-radar-sites-in-Yemen-after-a-merchant-sailor-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingWorld World US military targets Houthi radar sites in Yemen after a merchant sailor goes missingUS military targets Houthi radar sites in Yemen after a merchant sailor goes missingFollow on Published On: Sun, 16 Jun 2024 17:46:25 PKTDUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "SANAA", "classification": "security", "score": 0.8836179068826088, "event_breakdown": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing"}, {"id": "3a8eed01-30bc-484b-9ede-7a749ad84ac8", "title": "UPDATE 1 - US Naval Forces Rescue Crew from Greek - owned Ship Struck by Houthis in Red Sea", "date": "2024-06-16 13:45", "url": "https://www.newsmax.com/newsfront/us-navy-red/2024/06/16/id/1168908/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to maneuver.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel.", "location": "RED SEA", "classification": "security", "score": 0.5668666549235173, "event_breakdown": "Event 1: On Sunday, 16 June, Naval Forces Central Command (NAVCENT) said it had rescued the crew of the Greek-flagged, Liberian-owned bulk carrier M/V Tutor from an attack by Yemen's Iran-aligned Houthis on 12 June in the Red Sea,  near the Yemeni port of Hodeidah."}, {"id": "4920eacc-3dda-4e99-b7d8-6e02b10bfa37", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-16 10:45", "url": "http://www.myanmarmuslim.net/news/20240616866a599077.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning.", "location": "The main event takes place in Ukraine", "classification": "security", "score": 0.40030953069602054, "event_breakdown": "On June 16, 2022, Russia and Ukraine have exchanged hundreds of prisoners of war in the biggest swap since Russia's full-scale invasion of Ukraine in February 2022."}, {"id": "4d55731b-129c-4015-bee5-06181114c9f1", "title": "Sgt . Yaakov Levi killed in battle in Gaza", "date": "2024-06-16 12:00", "url": "http://www.israelnationalnews.com/news/391608", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF cleared for publication this morning (Sunday) that Sergeant Yakir Ya'akov Levi, 21, from Hafetz Haim, a soldier from the 601st Engineering Battalion, 401st \"Iron Tracks\" Brigade, fell in battle in the Gaza Strip.\nYesterday (Saturday), eight soldiers were killed in an APC explosion in the southern Gaza city of Rafah in one of the highest casualty incidents in Gaza the IDF has suffered in months.\nCommenting on the incident, IDF Spokesperson, Rear Admiral Daniel Hagari, said on Saturday night, \"Tonight we delivered the hardest news to the families of eight IDF soldiers who fell in action in Gaza.\"\nInside the armored vehicle were the eight soldiers who were killed,\" said Hagari.\n\"Following this difficult incident, a team of experts from the Ministry of Defense and the IDF will examine the armored vehicle and all the details of the incident until we reach findings,\" he added.", "location": "Gaza Strip", "classification": "security", "score": 0.9369727569188772, "event_breakdown": "IDF: Soldiers killed in APC explosion during the IDF's anti-terror operation in the Gaza Strip, searching for tunnels that lead into Israel. The IDF cleared to report for publication this morning that Sergeant Yakir Ya'akov Levi, 21, from Hafetz Haim, a soldier from the 601st Engineering Battalion, 401st \"Iron Tracks\" Brigade, fell in battle in the Gaza Strip."}, {"id": "912dc98c-b74a-4fa6-8578-9ce32bfe2cbe", "title": "Iranian commander renews vow to avenge Syria strike that killed two generals", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616093e599898.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A top military commander on Saturday renewed Iran’s promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two Iranian generals.\nGeneral Mohammad Bagheri, Iran’s joint chief of staff, told mourners gathered for the funeral of general Mohammad Reza Zahdi that Iran will decide when and how to stage an “operation” to take revenge.\nGen Zahdi was the highest ranking commander killed in Monday’s attack.\nIn all, 12 people were killed in the strike – seven Iranian Revolutionary Guard members, four Syrians and a Hezbollah militia member.\nTensions have flared against the backdrop of the six-month-old Israel-Hamas war in Gaza, and raised renewed fears of a broader regional conflict.", "location": "Syria", "classification": "security", "score": 0.812192630993987, "event_breakdown": "[\n\"Iran's joint chief of staff General Mohammad Bagheri renewed Iran's promise to retaliate for an airstrike earlier this week after Iran's consulate in Syria was destroyed in an attack.\",\n\"During a funeral for two Iranian generals killed during an airstrike in Syria this week, a top military commander renewed Iran's promise to take revenge.\"]"}, {"id": "e2e41be8-6090-4483-b273-863ef1b8904b", "title": "US military targets rebel radar sites after merchant crew abandons ship", "date": "2024-06-16 11:45", "url": "https://jcpost.com/posts/fb1ae4ef-f881-4adf-bfba-cb76fbb19a33", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "Based on the text, the most specific location where the main event takes place is 'Sanaa',", "classification": "security", "score": 0.747547225012867, "event_breakdown": "* U.S. strikes destroyed seven radars within Houthi-controlled territory, Central Command said. The attack occurred in Yemen, near the Red Sea.\n* The radars were being used by the Houthis to target maritime vessels and commercial shipping in the area.\n* The crew of a merchant ship was rescued by U.S. Navy and partner forces after abandoning ship. The ship was believed to be under attack by the Houthis."}, {"id": "6eed4986-ccda-4f37-b3ae-c4835f3e7329", "title": "US strikes Houthi radar sites after ships attacked | Northwest Arkansas Democrat - Gazette", "date": "2024-06-16 13:00", "url": "https://www.nwaonline.com/news/2024/jun/16/us-strikes-houthi-radar-sites-after-ships-attacked/", "domain": "nwaonline.com", "domain_classification": "Unknown", "message": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n\"These radars allow the Houthis to target maritime vessels and endanger commercial shipping,\" Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n\"The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,\" Central Command said.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.", "location": "Based on the context provided, I was unable to come up with a specific location related to the main event.", "classification": "security", "score": 0.8177479317780105, "event_breakdown": "U.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said. \"These radars allow the Houthis to target maritime vessels and endanger commercial shipping,\" Central Command said in a statement. The Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses. \"The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,\" Central Command said. it began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage."}, {"id": "984436a8-49a9-4a90-a3d0-7ad5b1b2d9d8", "title": "Baghdad airstrike kills Iran - Winning Bet Network", "date": "2024-06-16 13:45", "url": "http://www.myanmarmuslim.net/news/20240616985b598958.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An airstrike on the logistical support headquarters of an Iran-backed militia in central Baghdad has killed a high-ranking militia commander, militia officials said.\nAn anonymous US official confirmed the country’s forces conducted a strike on a vehicle in Baghdad on Monday against the group Harakat al-Nujaba.\nThursday’s strike killed two people and wounded five, according to two militia officials who spoke on condition of anonymity because they were not authorised to speak publicly.\nHeavy security was deployed around the location of the strike on Baghdad’s Palestine Street and Iraqi war planes could be seen flying overhead.\nAsked if Israel had involvement in Thursday’s strike in Baghdad, an Israeli military spokesperson declined to comment.", "location": "Baghdad", "classification": "security", "score": 0.9124661793082938, "event_breakdown": "Location: Baghdad, Iraq\nEvent: A US airstrike on the logistical support headquarters of an Iran-backed militia in central Baghdad has killed a high-ranking militia commander.\nDate: 2022-05-26\nTarget: An airstrike on a vehicle in Baghdad on Monday against the group Harakat al-Nujaba.\nHeavy security was deployed around the location of the strike on Baghdad’s Palestine Street and Iraqi war planes could be seen flying overhead.\nAsked if Israel had involvement in Thursday’s strike in Baghdad, an Israeli military spokesperson declined to comment."}, {"id": "ddbf0db5-919e-4b2b-8ecc-f478bd67a19e", "title": "Iraqi Shiite militia claims missile attack on Israel", "date": "2024-06-16 05:15", "url": "https://www.prokerala.com/news/articles/a1539783.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Baghdad, June 16 : A Shiite militia in Iraq has claimed responsibility for an attack with a cruise missile on a site in Haifa in northern Israel.\nThe militia, known as the Islamic Resistance in Iraq, said in an online statement on Saturday that its fighters launched an attack at dawn on Saturday with a long-range al-Arqab upgraded cruise missile on \"a site in Haifa\", Xinhua news agency reported.\nThe militia stressed that the attack was carried out \"in solidarity with the people in the Gaza Strip\" and pledged to continue its attacks on \"the enemy's strongholds.\"\nEarlier on Saturday, the group claimed responsibility for two drone attacks on Friday, targeting Haifa Port and Ramat David Airbase near Haifa.\nThe Islamic Resistance in Iraq has carried out multiple attacks on Israeli and US targets in the region since the outbreak of the Gaza conflict on October 7, 2023.", "location": "Haifa", "classification": "security", "score": 0.9807808452754408, "event_breakdown": "Shiite Militia in Iraq Claims Responsibility for Attack on Haifa"}, {"id": "35db1a82-916d-49ff-aedc-5b86d2cce481", "title": "Israeli prime minister vows to turn Hamas strongholds  into ruins  ", "date": "2024-06-16 11:00", "url": "http://www.myanmarmuslim.net/news/20240616020f599925.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israel’s Prime Minister Benjamin Netanyahu has warned people living in Gaza to leave as he vowed to turn parts of the territory “into ruins”.\n“All the places that Hamas hides in, operates from, we will turn them into ruins.\nMr Netanyahu also said the “first phase” of the counter operation had ended, and that Israel had fought off the majority of Hamas militants.\nHamas’ military wing claimed it was holding dozens of Israeli soldiers captive in “safe places” and tunnels in the Gaza Strip.\nThe Israeli military confirmed that a number of Israelis were abducted but would not give a figure.", "location": "given\nGAZA", "classification": "security", "score": 0.9537612273177142, "event_breakdown": "-Israeli Prime Minister Benjamin Netanyahu warns people living in Gaza to leave as he vows to turn parts of the territory \"into ruins\"\n-Hamas military wing claims to have abducted Israeli soldiers and held them in \"safe places\" and tunnels in the Gaza Strip."}, {"id": "90cb3a9f-1e34-4d09-b609-66cd339e0f13", "title": "Russian journalist killed in Ukraine drone strike : Media", "date": "2024-06-16 11:00", "url": "https://www.hurriyetdailynews.com/russian-journalist-killed-in-ukraine-drone-strike-media-197507", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Russian journalist killed in Ukraine drone strike: MediaMOSCOWA Russian journalist has been killed in a drone attack in eastern Ukraine, his news organisation said Sunday, two days after the death of another correspondent near the front line.\n\"Our correspondent Nikita Tsitsagi was killed during an attack by Ukrainian army drones,\" News.Ru posted on Telegram.\nOn Thursday, a journalist for Russian state television was killed and another wounded in a Ukrainian drone strike in Golmivsky, a Russian-controlled village close to the front line in the Donetsk region.\nThe Russian foreign ministry accused Ukraine of deliberately targeting the journalists.\nPresident Vladimir Putin said earlier this month that \"at least 30\" Russian journalists had been killed since the start of the conflict in Ukraine.", "location": "Eastern Ukraine", "classification": "security", "score": 0.673695410040437, "event_breakdown": "New Security Event:\nLocation: Myronivka, Donetsk Oblast, Ukraine\nOn Sunday, a Russian journalist, Nikita Tsisagi, was killed during the Ukrainian army drone attack in Myronivka, Donetsk Oblast, Ukraine."}, {"id": "b458bb9c-c557-4435-9a62-edf1976f4183", "title": "Germany : Man wielding ax in Hamburg shot by police", "date": "2024-06-16 13:00", "url": "https://timesofoman.com/article/146756-germany-man-wielding-ax-in-hamburg-shot-by-police", "domain": "timesofoman.com", "domain_classification": "Unknown", "message": "Hamburg: Police in the northern German city of Hamburg on Sunday shot a man who attempted to attack passersby with a pickaxe, authorities said.\nThe disturbance took place in the downtown St Pauli district of the city, near where 40,000 Dutch fans were marching, ahead of the Euro 2024 soccer match against Poland later.\nOne officer fired a warning shot before several other shots were fired and the man fell to the ground, local media reported.\nSecurity has already been tightened ahead of Sunday's soccer match with hundreds of Hamburg and federal police officers deployed.\nOn Friday, police in eastern Germany shot dead a man who went on the rampage, stabbing one man to death, before gatecrashing a house party for the championship's opening match.", "location": "Hamburg", "classification": "security", "score": 0.8866860674962574, "event_breakdown": "Hamburg: Police in the northern German city of Hamburg on Sunday shot a man who attempted to attack people with a pickaxe in the downtown St Pauli district, where 40,000 Dutch fans were marching ahead of a Euro 2024 soccer match against Poland."}, {"id": "041629a9-569d-4757-8cfb-0b5c6839c718", "title": "Gallatin neighbors fearful after home explosion believed to be intentional", "date": "2024-06-16 04:45", "url": "https://www.wsmv.com/2024/06/16/gallatin-neighbors-fearful-after-home-explosion-believed-be-intentional/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "GALLATIN, Tenn. (WSMV) - A mid-morning boom that neighbors thought was a lightning strike, a sonic boom even, turned out to be an incident many won’t forget on Chaffin Court.\nThat boom, which shook homes over half a mile from the blast site, was caused by a home explosion investigators believe to be resulting from a natural gas leak.\n“The glass on this [front door] was leaning over.”Multiple neighbors reported shattered glass on the outside of their homes.\n[PREVIOUS: Woman critically injured after Gallatin home explosion, official says]“[My son said] She’s on her way back, she’s out walking,” Perdue recalled.\nThey said a gas line exploded.”The cause of the explosion remains under investigation, but investigators with the Tennessee Bureau of Investigation believe the blast was intentional.", "location": ")\nChaffin Court, Gallatin, Tennessee", "classification": "security", "score": 0.8768436728378854, "event_breakdown": "Target event not found."}, {"id": "0745c9b0-5477-44f9-92f5-cb9a7f52847b", "title": "2 Killed , 4 Injured In Explosion In Pakistan", "date": "2024-06-16 12:00", "url": "https://menafn.com/1108338812/2-Killed-4-Injured-In-Explosion-In-Pakistan", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Islamabad, June 16 (IANS) Two people were killed and four others in an explosion of an improvised explosive device in Pakistan's northwestern Khyber Pakhtunkhwa province on Sunday, official sources said.\nThe incident happened in the Kurram district of the province, where a vehicle carrying civilians was hit by a roadside planted device, the sources told Xinhua news agency.\nThe injured people were shifted to a nearby hospital, where four of them were in critical condition.\nThe vehicle was completely destroyed in the explosion, and the cordoned off the area for investigation.\nNo group or individual has claimed the attack yet.", "location": "Khyber Pakhtunkhwa province.", "classification": "security", "score": 0.9974418010231093, "event_breakdown": "Title: Two Killed, Four Injured in Explosion in Pakistan's Khyber Pakhtunkhwa\n\nLocation: Kurram district, Khyber Pakhtunkhwa, Pakistan\n\nTarget Event: Two people were killed and four others injured in an explosion triggered by an improvised explosive device in Khyber Pakhtunkhwa province of Pakistan on Sunday."}, {"id": "4afd18f6-ea0c-498f-b961-c6d2104864fe", "title": "Israel announces daily Gaza  pause  for aid deliveries", "date": "2024-06-16 11:00", "url": "https://www.al-monitor.com/originals/2024/06/israel-announces-daily-gaza-pause-aid-deliveries", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 16, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory.\nIsrael has long defended its efforts to let aid into Gaza including via its Kerem Shalom border near Rafah, blaming militants for looting supplies and humanitarian workers for failing to distribute them to civilians.\nThe military said the pause was already in effect and part of efforts to \"increase the volumes of humanitarian aid\" following discussions with the UN and other organisations.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected.\nIsrael's hardline National Security Minister Itamar Ben Gvir said Sunday the humanitarian pause announced by the military was part of a \"crazy and delusional approach\".", "location": ")\nGAZA STRIP", "classification": "security", "score": 0.7733477514191686, "event_breakdown": "Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory. Israeli military said Sunday afternoon said it was raised alert level in \"the field\"."}, {"id": "04cd6745-2515-4563-a5bd-7c13770d4404", "title": "Maine police kill armed man after a night of gunfire , burned homes and another person dead", "date": "2024-06-16 05:30", "url": "https://www.thesunchronicle.com/news/nation_world/maine-police-kill-armed-man-after-a-night-of-gunfire-burned-homes-and-another-person/article_1d541218-005f-51f1-b52c-c4c9d0ff3a1e.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Maine police kill armed man after a night of gunfire, burned homes and another person deadA Maine State Police tactical team has killed a man on a rooftop after an hourslong standoff in which he shot at officers and two homes burned down", "location": "MAINE", "classification": "security", "score": 0.9729357149089702, "event_breakdown": "Event 1: Maine police kill armed man after a night of gunfire, burned homes\nEvent 2: Maine State Police tactical team kills a man on a rooftop after an hourslong standoff\nEvent 3: Man shoots at officers, two homes burn down during standoff in Maine"}, {"id": "8a7f466b-3825-4173-877c-d91adc894d1b", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 10:45", "url": "https://ottawa.citynews.ca/2024/06/15/explosions-heard-as-maine-police-deal-with-armed-individual/", "domain": "ottawa.citynews.ca", "domain_classification": "Unknown", "message": "He tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nAuburn police officers found the woman hiding down the street about 10 minutes later, and she identified the person who broke in as Hinkley.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.\nA state police major crimes unit will investigate the criminal conduct and the attorney general’s office will investigate the police shooting.", "location": "Auburn, Maine", "classification": "security", "score": 0.9783696388892205, "event_breakdown": "Event 1: Attempted Home Invasion, Auburn, New York\nA man who was trying to break into a home in Auburn, New York got into a fight with a man inside the home. Police officers found a woman hiding down the street from the scene."}, {"id": "f7e802f6-9a97-4948-afd2-84dd36c5c444", "title": "Protecting the Homeland : Stories of the victims of the APC explosion in Gaza", "date": "2024-06-16 12:00", "url": "http://www.israelnationalnews.com/news/391610", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Eight IDF soldiers from the 601st Battalion of the Iron Tracks Brigade 401 were killed on Saturday in the explosion of an APC in the Tel-Sultan neighborhood in Rafah.\nRabbi Zechariah Rabinowitz, his teacher, eulogized: \"Yakir Levi, of blessed memory, was a very bright, friendly, and courteous individual.\nThe last time he visited the yeshiva, Yakir sat with me for a deep learning session with a sparkle in his eyes.\nRabbi Zechariah Rabinowitz, his teacher at the Shalavim yeshiva, eulogized: \"Shalom loved the service of God, he knew this was the truth and loved the yeshiva and his surroundings.\nThe Hesder Yeshiva Union expressed deep sorrow at the fall of the soldiers Sergeant Yakir Yaakov Levi, Sergeant Shalom Menachem, and Sergeant Elyahu Moshe Zimbalist.", "location": "The main event is in the Rafah neighborhood of Tel-Sultan.", "classification": "security", "score": 0.9215833978837661, "event_breakdown": "IDF soldiers killed were Yakir Levi, Shalom Menachem, Elyahu Moshe Zimbalist. Rafah is in the Gaza Strip."}, {"id": "444c9921-8e2c-41e0-8056-a01919a4470d", "title": "What to look out for at Eurosatory , Europe biggest defense show", "date": "2024-06-16 11:30", "url": "https://www.c4isrnet.com/digital-show-dailies/eurosatory/2024/06/16/what-to-look-out-for-at-eurosatory-europes-biggest-defense-show/", "domain": "c4isrnet.com", "domain_classification": "Unknown", "message": "European governments have raised their defense budgets “so the business is there,” and military planners attending the show will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing.\nLook out at Eurosatory for hardy, expendable tactical drones, as well as stealthy drones that can operate close to the battle.\nDeep firesWith artillery being key on the Ukrainian battlefield, cannons and rocket artillery will be a major topic at Eurosatory 2024, with at least 10 manufacturers showcasing their systems, Beaudouin said.\n“We’re at the dawn, but only at the dawn, of a new definition of armored vehicles,” Beaudouin said.\n“War always takes us by surprise, and forces us to adapt.”Rudy Ruitenberg is a Europe correspondent for Defense News.", "location": "Based on the context provided, I was unable to come up with a specific location.", "classification": "security", "score": 0.5109259270953407, "event_breakdown": "Title: Current Events of Security Reported in Text\n\nLocation: Eurosatory 2024, Paris, France\n\nDetails:\nAttendees of Eurosatory 2024 in Paris, France will be focused on drones, anti-drone systems, air defense, long-range fires and mine clearing, all of which are necessary for modern warfare. Additionally, new equipment being showcased includes drones, artillery cannons, and armored vehicles, all of which are designed to help with defence and security.\n\nDate: June 13, 2023"}, {"id": "03791987-f3e5-44bd-8b40-bdc543178413", "title": "Ukrainian writer and soldier says all Russians are to blame for the invasion :  It not Putin who is pulling the trigger in Bucha  ", "date": "2024-06-16 13:30", "url": "https://www.yahoo.com/news/ukrainian-writer-soldier-says-russians-123351504.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Oleksandr Mykhed is a Ukrainian author who became a soldier following the Russian invasion.\nWithin a week of the invasion, Mykhed, a renowned author who has published nine books, had enlisted in the Ukrainian Armed Forces, and his former home had been destroyed by a Russian attack.\nMeeting me in London to discuss the book, Mykhed appears a hardened and determined figure, shaped by a conflict already stretching into its third year.\nIt's not Putin who is pulling the trigger in Bucha,\" he says, referencing the massacre that took place in 2022.\nIn late February, Ukrainian President Volodymyr Zelenskyy said 31,000 Ukrainian soldiers had been killed since Russia launched the invasion.", "location": "UKRAINE", "classification": "security", "score": 0.44465946413384894, "event_breakdown": "['Event: Russian forces have killed and wounded more than 31,000 Ukrainian soldiers since launching a large-scale invasion in late February, the country's leader said on Saturday.', 'Location: Ukraine']"}, {"id": "cd56182a-f969-44b7-b58b-0d4730a26681", "title": "Veteran , 96 , continues quest for medal over wound suffered in Korean War", "date": "2024-06-16 10:45", "url": "http://www.myanmarmuslim.net/news/20240616740e599204.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Mr Meyer has provided the Army with documents to back up his assertion that he was wounded in combat in June 1951.\nAn Army review board in April issued what it called a final rejection of Mr Meyer’s request for a Purple Heart, citing insufficient documentation.\n“At first I didn’t know that I had been wounded,” Mr Meyer wrote in a sworn statement that was part of his rejected appeal.\nThe Army’s Office of Public Affairs said it does not comment on ongoing litigation.\n“The Sergeant Major of the Army’s Office is engaging with Mr. Meyer’s family and looking into the situation,” spokesperson Master Sgt.", "location": "Korea", "classification": "security", "score": 0.6338679037050257, "event_breakdown": "Event 1: US Army rejects veteran's Purple Heart request\nMr. Meyer, a veteran, provided the Army with documents to back up his assertion that he was wounded in combat in June 1951, but the Army review board denied the request for a Purple Heart in April, citing insufficient documentation.\n\nEvent 2: Army engages with family of veteran to discuss situation\nThe Sergeant Major of the Army's Office is engaging with Mr. Meyer's family and looking into the situation."}, {"id": "b400fd92-790c-4ed2-b1b7-a0d96ed0535f", "title": "US military seizes Iranian missile parts bound for Houthi rebels", "date": "2024-06-16 05:30", "url": "http://www.myanmarmuslim.net/news/20240616287a599709.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosUS Navy Seals seized Iranian-made missile parts and other weaponry from a ship bound for Yemen’s Houthi rebels in a raid last week in which two commandos went missing, the US military said on Tuesday.\nThe seized missile components included types likely to have been used in those attacks.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nA United Nations resolution bans arms transfers to Yemen’s Iranian-backed Houthi rebels.\nTehran has long denied arming the rebels, despite physical evidence, numerous seizures and experts tying the weapons back to Iran.", "location": "Based on the text, the location is: Yemen", "classification": "security", "score": 0.579032892633855, "event_breakdown": "US raid seizes Iranian-made missile parts bound for Yemen rebels"}, {"id": "dde7afb9-c98d-4e65-b5c1-3fc6ba232063", "title": "Israel can dig in or declare victory and gain advantages", "date": "2024-06-16 13:45", "url": "https://forward.com/opinion/623581/israel-can-dig-in-or-declare-victory-and-gain-advantages/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Meanwhile, Israel continues to bleed — eight soldiers were killed on Saturday in the deadliest mishap for the IDF in six months.\nThat would probably bring massive rocket attacks on Tel Aviv and central Israel — something Israel has not yet really experienced.\nYet Israel is one of the exceptions: Its multi-front war in 1967 was among the most successful military efforts in recent history.\nYet Hamas would claim victory, perhaps giving tailwind to jihadis everywhere (America and Europe being no exception).\nIn exchange for assuming such a risk, Israel would expect a series of rewards and advantages.", "location": "Israel", "classification": "security", "score": 0.44121732262732366, "event_breakdown": "Eight Israeli soldiers were killed on Saturday in the deadliest mishap for the IDF in six months."}, {"id": "0423184f-c86b-4d2b-85fd-54c0936dd24a", "title": "IDF Names Six Soldiers Killed in Saturday Rafah Blast , and Two Killed in Northern Gaza - Israel News", "date": "2024-06-16 11:30", "url": "https://www.haaretz.com/israel-news/2024-06-16/ty-article/.premium/idf-names-five-soldiers-killed-in-saturdays-rafah-blast-and-two-killed-in-northern-gaza/00000190-1fd3-d4b4-a7d6-dff30cc60000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "The Israeli army released on Sunday the names of two reservists killed in a tank explosion in northern Gaza, as well as the names of six of the eight soldiers killed in Rafah on Saturday.", "location": "GAZA", "classification": "security", "score": 0.9749679229344332, "event_breakdown": "The Israeli army released on Sunday the names of two reservists killed in a tank explosion in northern Gaza, as well as the names of six of the eight soldiers killed in Rafah on Saturday."}, {"id": "faa01098-c8d5-401a-a4c2-f4d6ac0ea854", "title": "Israel announces limited military pause to increase Gaza aid", "date": "2024-06-16 12:00", "url": "https://saudigazette.com.sa/article/643629/World/Mena/Israel-announces-limited-military-pause-to-increase-Gaza-aid", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "GAZA — The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter, but emphasized that there is no ceasefire and combat would continue in Rafah.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nA spokesman for ActionAid, which is helping to deliver supplies in Gaza, told the BBC that the pause would help aid getting in but that they needed more details about logistics.\nThe UN's humanitarian office, known as OCHA, reported that in May, the daily average number of trucks delivering humanitarian aid into Gaza - excluding fuel - was 97.", "location": "GAZA", "classification": "security", "score": 0.7631785818407649, "event_breakdown": "GAZA — The Israeli military says it will hold a daily \"tactical pause of military activity\" along a route in southern Gaza, the BBC reported, but emphasized that there is no ceasefire."}, {"id": "cc0b698a-d338-4a33-8a18-690add1c80d4", "title": "IAF contingent participates in combat exercise  Red Flag  in Alaska – Indian Defence Research Wing", "date": "2024-06-16 13:45", "url": "https://idrw.org/iaf-contingent-participates-in-combat-exercise-red-flag-in-alaska/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "IAF contingent participates in combat exercise ‘Red Flag’ in Alaska| BySOURCE: IANSAn Indian Air Force (IAF) contingent participated in Exercise Red Flag 2024 conducted at Eielson Air Force Base, Alaska of the United States Air Force, from June 4-14.\nThis was the second edition of Exercise Red Flag 2024, which is an advanced aerial combat training exercise, held four times a year by the US Air Force.\nThe exercise witnessed the participation of the Indian Air Force along with the Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), German Luftwaffe, and the US Air Force (USAF).\n“IAF contingent participated with the Rafale aircraft and personnel comprising of aircrew, technicians, engineers, controllers and subject matter experts.\nRed Flag is an air combat exercise conducted with multiple scenarios designed to provide realistic combat settings.", "location": "Eielson Air Force Base, Alaska", "classification": "security", "score": 0.6881592652740358, "event_breakdown": "Indian Air Force participated in Exercise Red Flag 2024 conducted at Eielson Air Force Base, Alaska of the United States Air Force, from June 4-14."}, {"id": "f368c485-d389-48f7-91f8-3b3ad42c40c3", "title": "World - Carroll Broadcasting Inc . ", "date": "2024-06-16 16:45", "url": "https://wkjc.com/world/8a9fce7898186b3fd53fa13d70c1b7a4", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "Abdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nHowever, the U.S. officials said it remained unclear if Mumin had been killed in the airstrike.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland.", "location": "Somalia.", "classification": "security", "score": 0.6303937678620719, "event_breakdown": "Location: Somalia\nTarget event: U.S. airstrike targeting Abdulqadir Mumin, the leader of the Islamic State in Somalia."}, {"id": "a2c6df23-9782-4a5e-8b3f-35fb194bdf6a", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-16 17:45", "url": "http://www.amazingmadison.com/syndicated-article/?id=1569647", "domain": "amazingmadison.com", "domain_classification": "Unknown", "message": "(SOMALIA) — A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual’s name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland.", "location": "Somalia.", "classification": "security", "score": 0.6713171418989554, "event_breakdown": "Somalia"}, {"id": "e4eaa78b-c837-407e-89d2-75989307a5ef", "title": "World - KSYL - AM", "date": "2024-06-16 16:15", "url": "https://ksyl.com/world/ff4ee6bde7e5352b2416e0c15e53ab6a", "domain": "ksyl.com", "domain_classification": "Unknown", "message": "Abdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nHowever, the U.S. officials said it remained unclear if Mumin had been killed in the airstrike.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland.", "location": "Somalia", "classification": "security", "score": 0.6303937678620719, "event_breakdown": "Mumin, Abdulqadir - May 31, 2019 - United States, Somalia (Puntland) - Senior Islamic State leader Abdulqadir Mumin, head of the African affiliate of the terror group once known as ISIS, is believed to have been killed in a United States airstrike in Somalia."}, {"id": "d1bc6d20-4a36-4a68-96bc-f2acda10b33a", "title": "World News - 1540 WADK Newport", "date": "2024-06-16 19:15", "url": "https://wadk.com/world-news/9fe53c802b0586b5e624a1c33dd7c0fb", "domain": "wadk.com", "domain_classification": "Unknown", "message": "Abdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nHowever, the U.S. officials said it remained unclear if Mumin had been killed in the airstrike.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual's name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland.", "location": "Somalia.", "classification": "security", "score": 0.6303937678620719, "event_breakdown": "Reported target event:\nThe reported target event is the death of Abdulqadir Mumin, the leader of the Islamic State in Somalia, in a drone strike on May 31, 2019. The location of the strike is reported to be in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "673f99c9-8324-4d05-a805-44b66ea68a86", "title": "Losses mount in Lebanon for Islamic Jihad Syrian branch", "date": "2024-06-16 18:00", "url": "https://www.longwarjournal.org/archives/2024/06/losses-mount-in-lebanon-for-islamic-jihads-syrian-branch.php", "domain": "longwarjournal.org", "domain_classification": "Unknown", "message": "15, Islamic Jihad’s branch in Syria, The Martyr Ali al-Aswad Brigade, published a statement mourning the death of a fighter killed in southern Lebanon.\n“One of the heroes of The Martyr Ali Al-Aswad Brigade – Syrian Square.\nHe [Muhammed Jalbout] ascended on the borders of occupied Palestine in southern Lebanon as part of the al-Aqsa Flood battle while performing his combat duty,” stated Islamic Jihad.\nLastly, the name of the Islamic Jihad group, Ali al-Aswad, is likely derived from Ali Ramzi al-Aswad, who was gunned down on Mar.\nIslamic Jihad blamed Israel for the assassination and vowed to respond.", "location": "southern Lebanon", "classification": "security", "score": 0.9898158923995739, "event_breakdown": "Relevant security events reported in text:\n1. On Mar. 2, a sniper killed a Hezbollah fighter in the southern Lebanon town of Aita Shaab. This incident was not reported by Islamic Jihad, but by Israel National News, a far-right Israeli website.\n2. On Mar. 2, Islamic Jihad’s branch in Syria, The Martyr Ali al-Aswad Brigade, published a statement mourning the death of a fighter killed in southern Lebanon.\n3. On Mar. 3, Islamic Jihad was published a statement mourning the death of a fighter killed in southern Lebanon. 4. On Mar. 10, a sniper killed a Hezbollah commander, and a photojournalist was also killed, in the southern Lebanon town of Tair Debba.\n5. On Mar. 16, a sniper killed Ali Ramzi al-Aswad, a Hezbollah commander, in the southern Lebanon town of Aita Shaab. Islamic Jihad blamed Israel for the assassination and vowed to respond.\n6. On Mar. 18, a sniper killed a Hezbollah fighter in the southern Lebanon town of al-Adissiyah.\n7. On Mar. 18, a sniper killed a Hezbollah commander close to the Al-Askari base, where Hezbollah fighters are stationed.\n8. On Mar. 21, a sniper killed a Hezbollah commander in the town of Hermel.\n9. On Mar."}, {"id": "4cab731e-c668-4258-a557-2898241d4fd9", "title": "Israeli Tanks Advance in Rafah Amid Humanitarian Crisis and Global Criticism", "date": "2024-06-16 16:00", "url": "https://www.redbrick.me/israeli-tanks-advance-in-rafah-amid-humanitarian-crisis-and-global-criticism/", "domain": "redbrick.me", "domain_classification": "Unknown", "message": "Israeli forces continue their advance into the southern Gaza city of Rafah, increasing the civilian death toll and Israel’s international isolation.\nResidents claimed that Israeli tanks were also stationed atop the strategic Zoroub Hill, 2.5 km northwest of the al-Awda roundabout.\nOn 6 May, the IDF launched targeted ground operations against Hamas fighters and infrastructure in Rafah.\nThis campaign follows the 7 October attacks in which Hamas killed 1,200 people and took 252 others hostage in southern Israel.\nThe UN Security Council assembled for an emergency meeting to discuss Israeli operations in Rafah on Tuesday, and the UN’s top court has ordered Israel to end the offensive.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.9368671239675042, "event_breakdown": "IDF military operations in Rafah, Israel\nUN Security Council emergency meeting regarding Rafah, Israel\nUN court order to Israel to stop offensive in Rafah, Israel"}, {"id": "2c37bdc4-fa3c-403d-a725-fe002ebfa63b", "title": "US military targets Houthi radar sites in Yemen after merchant sailor goes missing in Red Sea", "date": "2024-06-16 19:15", "url": "https://businessmirror.com.ph/2024/06/16/us-military-targets-houthi-radar-sites-in-yemen-after-merchant-sailor-goes-missing-in-red-sea/", "domain": "businessmirror.com.ph", "domain_classification": "Unknown", "message": "US strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe US separately destroyed two bomb-laden drone boats in the Red Sea, as well as a drone launched by the Houthis over the waterway, it said.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "NULL", "classification": "security", "score": 0.6714833388998451, "event_breakdown": "[\n{\n\"location\": \"United States\",\n\"headline\": \"Broad Coalition Formally Established to Protect Gulf Shipping\"\n},\n{\n\"location\": \"Red Sea\",\n\"headline\": \"US Strikes Destroy Houthi Radar Sites, Boats\"\n}\n]"}, {"id": "5a0315d1-db0f-4267-b16c-4e741c3f9c52", "title": "Palestinian resistance rocket attacks Zionist settlement of Sadirot", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Palestinian resistance rocket attacks Zionist settlement of SadirotIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- News sources announced on Friday night that the rocket attacks by the Palestinian resistance from Gaza towards the Zionist settlement of Sadirot.\nFrom Shahab Palestinian news agency, Saraya al-Quds resistance group announced that the Zionist settlement of Sadirot in the Gaza Strip was targeted by rocket attacks.\nAccording to this report, the alarm of a missile attack has sounded in the Zionist settlements bordering Gaza.\nAccording to IRNA, after more than seven months have passed since the Zionist regime invaded the Gaza Strip without any results and achievements, this regime is sinking more and more into its internal and external crises.\nDuring this period, the Zionist regime has not achieved anything other than crime, massacre, destruction, war crimes, violation of international laws, bombing of relief organizations and famine in this region.", "location": "Sadirot.", "classification": "security", "score": 0.9701870767735372, "event_breakdown": "Gaza Strip, Sadirot"}, {"id": "0ee8d0f4-56f6-425b-bed3-0e921e97caaf", "title": "US destroyer shoots down missile and drones launched by Yemen Houthi rebels", "date": "2024-06-16 16:30", "url": "http://www.myanmarmuslim.net/news/20240617480b599517.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A US destroyer shot down drones and a missile in the Red Sea launched towards it by Yemen’s Houthi rebels, officials said.\nThe Houthi attack involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war.\nSmoke poured out of one container aboard the vessel, which also showed scorch marks from the impact of a Houthi missile.\nThe Houthis have been hailing ships over the radio in the Red Sea and the Gulf of Aden as well since launching their attacks.", "location": "The main location where the main event takes place is the Red Sea.", "classification": "security", "score": 0.5369578428732131, "event_breakdown": "US destroyer shoots down drones and missiles in Red Sea launched at Yemen's Houthi rebels"}, {"id": "94d1f2e3-4509-4765-bcb6-43f273a2bfda", "title": "21 Filipino seafarers from Houthi - attacked ship rescued , 1 more missing", "date": "2024-06-16 06:15", "url": "https://www.sunstar.com.ph/manila/21-filipino-seafarers-from-houthi-attacked-ship-rescued-1-more-missing", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "THE Department of Migrant Workers (DMW) confirmed on Saturday, June 15, 2024, the successful rescue of 21 out of the 22 Filipino seafarers on board a ship that was attacked by the Houthi rebels in the southern Red Sea.\nAt least 17 Filipino crew members of the Galaxy Leader remain in the hands of the Houthi rebels after they attacked the vessel in November 2023.\nHe said the administration of President Ferdinand Marcos Jr. imposed a whole-of-government approach to help Filipino seafarers attacked by the Houthi rebel group in the Red Sea.\nTwo Filipino seafarers were also killed while 11 others were safely rescued and repatriated following a missile attack by Houthi to a bulk carrier True Confidence.\n“The return of the two seafarers’ remains are expected to be home soon,” said Cacdac.", "location": "NULL", "classification": "security", "score": 0.6164693775906451, "event_breakdown": "The Department of Migrant Workers (DMW) confirmed on Saturday, June 15, 2024, the successful rescue of 21 Filipino seafarers, while at least 17 remain in the hands of the Houthi rebels in the Red Sea, after the rebels attacked the  Galaxy  vessel in November 2023.\nTwo Filipino seafarers were killed after the attack to the bulk carrier True Confidence, while 11 were safely rescued and repatriated, said the DMW."}, {"id": "962ed71c-0202-4845-b101-517d461eebca", "title": "What the papers say : Wednesday front pages - Precision Bet Tips", "date": "2024-06-16 17:45", "url": "http://www.myanmarmuslim.net/news/20240617296c599698.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The bombing of a hospital in Gaza and opening statements in the trial over the death of Ashling Murphy dominate Wednesday's front pages.\nThe Irish Timesleads with: 'Hundreds killed after strike on hospital in Gaza City'.\nThe Irish Examinerfollows suit, adding that the strike was the 'bloodiest single incident' since recent air strikes began.\nMeanwhile, the Irish Daily Mail, Irish Sun and Irish Daily Mirrorall give their lead to the trial of Jozef Puska, who is accused of the murder of Ashling Murphy.\nWednesday's @DailyMailUK #MailFrontPages pic.twitter.com/rr1wrdn4Wu — Daily Mail U.K. (@DailyMailUK) October 17, 2023The Timesreports the incident has sparked “outrage”, while the Daily Mirrorsays “This must end”.", "location": ")\nGaza City", "classification": "security", "score": 0.5687226233006011, "event_breakdown": "Bombing of Gaza city, trial over Asling Murphy killing"}, {"id": "0dc6b395-f486-4393-8f94-44f64d9275c3", "title": "U . S . Navy rescue crew from Greek - owned ship struck by Houthis in Red Sea", "date": "2024-06-16 16:00", "url": "https://www.japantimes.co.jp/news/2024/06/16/world/houthis-red-sea-ship-attack/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen's Iran-aligned Houthis on June 12 in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to maneuver.\nOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship's crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel.", "location": "RED SEA", "classification": "security", "score": 0.5668666549235173, "event_breakdown": "Target: Security - News Push\nEvent: Crew Pulled from the Water after Attack on M/V 'Tutor'; Yemen's Iran-aligned Houthis Claim Responsibility for Attacks (June 12, 2022)\nDetails: Naval Forces Central Command (NAVCENT) announced that it had rescued the crew from the Liberian-flagged Greek-owned M/V 'Tutor' after it came under fire off the Red Sea. UKMTO reported the previous day that the ship's crew had been evacuated and the abandoned vessel was drifting in the Red Sea. The Houthis claimed responsibility for the attack."}, {"id": "6c752dc1-1e3d-45f9-9917-77be5bfce119", "title": "World News | Key TTP Commander Killed in Pakistan Northwest", "date": "2024-06-16 15:00", "url": "https://www.latestly.com/agency-news/world-news-key-ttp-commander-killed-in-pakistans-northwest-6042041.html", "domain": "latestly.com", "domain_classification": "Unknown", "message": "Islamabad, Jun 16 (PTI) A top militant commander of the banned Tehreek-e-Taliban Pakistan (TTP) was killed on Sunday in an encounter with security forces in Pakistan's restive Khyber-Pakhtunkhwa province.\nTTP commander Waliullah was killed by the Counter-Terrorism Department (CTD) of Bannu in an intelligence-based operation in the Lakki Marwat district in the province, the Express Tribune newspaper reported.\nAlso Read | Pakistan Landmine Blast: Two Killed, Five Others Injured in Roadside Landmine Explosion in Kurram.\nHe was a local commander of the TTP Tipu Gul group and was the son-in-law of Commander Atiqur Rahman alias Tipu Gul Marwat, the paper said.\nSeparately, at least four people of a family were killed and two injured in a roadside blast triggered by a remote-control device in northwest Pakistan on Sunday.", "location": "Khyber-Pakhtunkhwa", "classification": "security", "score": 0.9868761941679667, "event_breakdown": "Event 1: A top militant commander of the banned Tehreek-e-Taliban Pakistan (TTP) was killed in an encounter with security forces in Pakistan's restive Khyber-Pakhtunkhwa province. Waliullah was killed by the Counter-Terrorism Department (CTD) of Bannu in an intelligence-based operation in the Lakki Marwat district in the province.\nEvent 2: At least four people of a family were killed and two injured in a roadside blast triggered by a remote-control device in northwest Pakistan on Sunday."}, {"id": "964f9220-83f8-4b92-adee-08cec6989aff", "title": "Hezbollah keeps up pressure on Israel days after commander death", "date": "2024-06-16 15:30", "url": "https://www.naharnet.com/stories/en/305954-hezbollah-keeps-up-pressure-on-israel-days-after-commander-s-death", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah kept up retaliatory attacks on Israel Saturday, days after a strike killed one of its top commanders, while a Palestinian group said one of its fighters was killed in south Lebanon.\nIsrael and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group's October 7 attack on Israel which triggered war in the Gaza Strip.\nIt also said \"several aerial targets were identified crossing from Lebanon into Israeli territory\" and striking in the Goren area.\n\"Aircraft struck a Hezbollah terrorist\" in south Lebanon's Aitaroun area, the Israeli military said, adding that \"artillery fired to remove a threat,\" also in the Aitaroun area.\nThe armed wing of Palestinian militant movement Islamic Jihad later said one of its fighters had been killed in south Lebanon.", "location": "Aitaroun, south Lebanon.", "classification": "security", "score": 0.9955917308190915, "event_breakdown": "Hezbollah kept up retaliatory attacks on Israel Saturday, days after a strike killed one of its top commanders, while a Palestinian group said one of its fighters was killed in south Lebanon."}, {"id": "fad01fb0-710d-48a0-bb84-a6a437189598", "title": "US Navy faces most intense combat since WWII against Houthis", "date": "2024-06-16 17:45", "url": "https://journalstar.com/news/nation-world/israel-hamas-war-yemen-houthis-war-unrest/article_169c4e9a-2f07-51ef-b085-b6384b268190.html", "domain": "journalstar.com", "domain_classification": "Unknown", "message": "Eric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthi attacks continue to depress shipping through the region.\nHow Houthi attacks crimp global trade Why are Houthis attacking ships?\nHow are Houthi attacks affecting trade?", "location": "The exact location where the main event takes place is 'Red Sea'.", "classification": "security", "score": 0.48225300405774285, "event_breakdown": "The Houthi rebels have repeatedly targeted commercial ships transiting through the Red Sea, causing disruptions to global trade. In the most recent incident, they attacked an abandoned and unlit commercial ship on Friday, leaving it adrift in the Red Sea. This prompted the United Kingdom Maritime Trade Operations center to issue a warning to mariners in the area. The Houthi attacks have had a chilling effect on shipping through the region, and have contributed to a decrease in overall trade."}, {"id": "ec2e0107-c329-42dd-af93-5614591a7c1b", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 19:15", "url": "https://www.kcbd.com/2024/06/16/maine-police-kill-armed-man-after-night-gunfire-burned-homes/", "domain": "kcbd.com", "domain_classification": "Unknown", "message": "AUBURN, Maine (AP) — A Maine State Police tactical team fatally shot a man on a rooftop early Saturday after an hourslong standoff in which authorities said he opened fire at officers, two homes burned down and a person who fought with him died.\nHe tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.", "location": "Auburn, Maine", "classification": "security", "score": 0.9348242805714324, "event_breakdown": "Maine: State Police tactical team fatally shot a man on a rooftop after a man in a house fought with him."}, {"id": "3c03ed55-bedb-4e78-a721-7e1e93631e87", "title": "Israel preparing for possible ground assault as air strikes devastate Gaza", "date": "2024-06-16 17:45", "url": "http://www.myanmarmuslim.net/news/20240617173f599821.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Lt Col Richard Hecht, an Israeli military spokesman, told reporters on Thursday that forces “are preparing for a ground manoeuvre if decided”, but that the political leadership has not yet ordered one.\nIn Gaza, Palestinians fleeing air strikes could be seen running through the streets, carrying their belongings and looking for a safe place.\nSmoke rises following an Israeli air strike in Gaza City (Fatima Shbair/AP)Israel’s increasingly destructive air strikes in Gaza have flattened entire city blocks and left unknown numbers of bodies beneath debris.\nThe only crossing point between Egypt and Gaza was shut down on Tuesday following nearby Israeli air strikes.\nIsrael says roughly 1,500 Hamas militants were killed inside Israel, and that hundreds of the dead inside Gaza are Hamas members.", "location": "GAZA", "classification": "security", "score": 0.9259223787130357, "event_breakdown": "IDF ground forces preparing for a ground manoeuvre near Israel's border with Gaza, while air strikes continue to damage Gaza City."}, {"id": "4b57506b-ed24-4bdf-9e74-48278a8201c9", "title": "Israel preparing for possible ground assault as air strikes devastate Gaza", "date": "2024-06-16 18:00", "url": "http://www.myanmarmuslim.net/news/20240617152d599793.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Lt Col Richard Hecht, an Israeli military spokesman, told reporters on Thursday that forces “are preparing for a ground manoeuvre if decided”, but that the political leadership has not yet ordered one.\nIn Gaza, Palestinians fleeing air strikes could be seen running through the streets, carrying their belongings and looking for a safe place.\nSmoke rises following an Israeli air strike in Gaza City (Fatima Shbair/AP)Israel’s increasingly destructive air strikes in Gaza have flattened entire city blocks and left unknown numbers of bodies beneath debris.\nThe only crossing point between Egypt and Gaza was shut down on Tuesday following nearby Israeli air strikes.\nIsrael says roughly 1,500 Hamas militants were killed inside Israel, and that hundreds of the dead inside Gaza are Hamas members.", "location": "GAZA", "classification": "security", "score": 0.9259223787130357, "event_breakdown": "Israeli air strikes target Hamas militants in Gaza (This is a target event)."}, {"id": "ced90eb1-4008-4ff5-9e91-6df6e74929cf", "title": "UN warns of  miscalculation  in Israel - Hezbollah clashes", "date": "2024-06-16 18:00", "url": "https://www.newarab.com/news/un-warns-miscalculation-israel-hezbollah-clashes", "domain": "newarab.com", "domain_classification": "Unknown", "message": "UN officials are warning that the current round of fighting between the Israeli army and Hezbollah has increased the prospect of a \"miscalculation\", as fears of a wider war between the two increases.\nThe statement, which accompanied an Eid al-Adha message, comes amid an escalation in fighting on the Israel-Lebanon border between Israel and Hezbollah.\nHezbollah rockets and drones have also been fired deeper into Israel.\nRELATED Is Israel gearing up for war with Hezbollah?\nOn Saturday Defence Minister Yoav Gallant rejected a French proposal to mediate and find a peaceful solution to the escalation.", "location": "LEBANON", "classification": "security", "score": 0.7981132529463065, "event_breakdown": "Event 1: On Saturday, Defence Minister Yoav Gallant rejected a French proposal to mediate and find a peaceful solution to the escalation. This occurred in the Israel."}, {"id": "a37fc311-0130-4894-a5f6-1fb3035f8da2", "title": "Palestinians in Gaza feel nowhere is safe amid unrelenting Israeli airstrikes", "date": "2024-06-16 17:00", "url": "http://www.myanmarmuslim.net/news/20240617396d599549.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli airstrikes have pounded locations across the Gaza Strip, including parts of the south that Israel had declared safe zones.\nIn the nearly two weeks since Israel began attacking in response to a devastating Hamas rampage in towns across southern Israel, airstrikes have relentlessly hit the densely populated territory.\nHamas officials in Gaza blamed an Israeli airstrike, saying hundreds were killed.\nEgypt must still repair the road across the border, which was cratered by Israeli airstrikes.\nHe also announced 100 US dollars (about £82.6 million) in humanitarian aid for Palestinians in Gaza and the West Bank.", "location": "GAZA", "classification": "security", "score": 0.682589530583234, "event_breakdown": "Israeli airstrikes have pounded locations across the Gaza Strip, including parts of the south that Israel had declared safe zones. In the nearly two weeks since Israel began attacking in response to a devastating Hamas rampage in towns across southern Israel, airstrikes have hit the densely populated territory. Hamas officials in Gaza blamed an Israeli airstrike, saying hundreds were killed. Egypt must still repair the road across the border, which was cratered by Israeli airstrikes."}, {"id": "8b170b38-c834-4895-8280-fb9060ffa3a8", "title": "Israel hails  succes in blocking Iran unprecedented attack", "date": "2024-06-16 17:30", "url": "http://www.myanmarmuslim.net/news/20240617141f599850.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran launched the attack in response to a strike widely blamed on Israel on an Iranian consular building in Syria earlier this month which killed two Iranian generals.\nIsrael said Iran launched 170 drones, more than 30 cruise missiles and more than 120 ballistic missiles early on Sunday.\nBy Sunday morning, Iran said the attack was over and Israel reopened its air space.\n“Iran launched more than 300 threats and 99% were intercepted,” said Rear Admiral Daniel Hagari, the Israeli military spokesman.\nIsrael and Iran have been on a collision course throughout Israel’s six-month war against Hamas militants in Gaza, triggered by the October 7th attack on Israel.", "location": "SYRIA", "classification": "security", "score": 0.7318816245008818, "event_breakdown": "Israel's air defence systems intercepted a barrage of Iranian missiles over the Golan Heights and the Negev desert. Over 100 missiles were fired at Israel from Iran and Iraq.\nIsraeli warplanes strike a port in coastal city of Latakia for Iranian arms and ballistic missiles stockpile."}, {"id": "8a48eb1d-b8a8-488d-b8a3-7befded33ecb", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 16:30", "url": "https://www.westernmassnews.com/2024/06/16/maine-police-kill-armed-man-after-night-gunfire-burned-homes/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "AUBURN, Maine (AP) — A Maine State Police tactical team fatally shot a man on a rooftop early Saturday after an hourslong standoff in which authorities said he opened fire at officers, two homes burned down and a person who fought with him died.\nHe tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.", "location": "Auburn, Maine", "classification": "security", "score": 0.9348242805714324, "event_breakdown": "Maine State Police Tactical Team fatally shoots man on rooftop in Auburn, Maine."}, {"id": "b617f17d-0485-4e20-9b26-58b8eb4abf10", "title": "Israeli strikes kill multiple civilians at shelters in Gaza combat zone", "date": "2024-06-16 17:45", "url": "http://www.myanmarmuslim.net/news/20240617566a599428.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli military strikes have killed multiple civilians at a UN shelter and hospital in the Gaza Strip’s main combat zone.\nLarge columns of smoke rose from Gaza as Israel’s military said it had encircled Gaza City, the target of its offensive to crush Hamas.\nPalestinians comfort a crying man after he lost relatives under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians strike the concrete while looking for survivors under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians inspect the damage of a house destroyed by an Israeli airstrike in Gaza City on Saturday.", "location": "GAZA CITY", "classification": "security", "score": 0.9641139729975198, "event_breakdown": "Israel targeted a UN shelter and hospital in the Gaza Strip's combat zone, killing multiple civilians in a large column of smoke. Israel has targeted the Gaza Strip's main combat zone in a bid to crush Hamas."}, {"id": "6adeac0e-d9c0-4f16-b74a-92f58e764fc5", "title": "8 Israeli soldiers killed in southern Gaza in deadliest attack on Israeli forces in months", "date": "2024-06-16 11:30", "url": "https://www.yahoo.com/news/8-israeli-soldiers-killed-southern-153147879.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel's military said Saturday, June 15, that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\n(AP Photo/Ohad Zwigenberg, File)JERUSALEM (AP) — An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after.", "location": "GAZA", "classification": "security", "score": 0.9848856486379126, "event_breakdown": "August 1, - A car bomb explosion in southern Gaza killed eight Israeli soldiers."}, {"id": "94a5f7f8-fff5-4848-888a-9bd6f27dc946", "title": "8 Israeli soldiers killed in south Gaza  explosion , deadliest attack in months", "date": "2024-06-16 19:15", "url": "https://businessmirror.com.ph/2024/06/16/8-israeli-soldiers-killed-in-south-gaza-explosion-deadliest-attack-in-months/", "domain": "businessmirror.com.ph", "domain_classification": "Unknown", "message": "By Jack Jeffery / The Associated PressJERUSALEM— An explosion in southern Gaza killed eight Israeli soldiers, the military said Saturday, making it the deadliest attack on Israeli forces in months.\nThe Israeli offensive has killed over 37,000 Palestinians, according to local health officials, who do not differentiate between civilians and combatants.\nRear Adm. Daniel Hagari, an Israeli military spokesman, said it was caused either by an explosive placed by Hamas or by an anti-tank missile.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIf today eight soldiers were killed, more will get killed the next day and the day after.", "location": ")\nGAZA", "classification": "security", "score": 0.9873652624078527, "event_breakdown": "Eight Israeli soldiers killed in a blast in southern Gaza."}, {"id": "ab2ada8e-cccf-47c9-a1ba-33630cde4948", "title": "Xi visits Serbia on 25th anniversary of Nato bombing of Chinese embassy", "date": "2024-06-16 19:30", "url": "http://www.myanmarmuslim.net/news/20240617896f599103.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Chinese leader Xi Jinping’s visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during Nato’s air war over Kosovo.\nUS jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7 1999, setting it ablaze and killing three Chinese nationals.\nThe US at the time apologised and said the embassy bombing was a mistake that happened due to faulty intelligence.\nMr Xi will arrive from France and proceed from Serbia to Hungary as part of his first European tour in five years.\nHe is expected to visit the site of the former embassy on the anniversary date and pay his respects to the bombing victims.", "location": "BELGRADE", "classification": "security", "score": 0.6977182208773482, "event_breakdown": "Xi's European trip that includes visit to Serbia on the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during Nato's air war over Kosovo."}, {"id": "97a53a25-b616-4642-bdb2-f0baac49beee", "title": "Israel announces daily Gaza  pause  for aid deliveries", "date": "2024-06-16 17:15", "url": "https://www.digitaljournal.com/world/israel-announces-daily-gaza-pause-for-aid-deliveries/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Israel has long defended its efforts to let aid into Gaza including via its Kerem Shalom border near Rafah, blaming militants for looting supplies and humanitarian workers for failing to distribute them to civilians.\nThe military said the pause was already in effect and part of efforts to “increase the volumes of humanitarian aid” following discussions with the UN and other organisations.\nSeparately, two soldiers were killed in fighting in northern Gaza and another succumbed to wounds inflicted in recent fighting.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire — demands Israel has repeatedly rejected.\nIsrael’s hardline National Security Minister Itamar Ben Gvir said Sunday the humanitarian pause announced by the military was part of a “crazy and delusional approach”.", "location": "GAZA STRIP", "classification": "security", "score": 0.9000165416249888, "event_breakdown": "New security event:\nLocation:\nGaza Strip\nDescription:\nTo combat terrorism, Israel's Defense Minister declared that they would increase the amount of humanitarian aid to the Gaza Strip through the Kerem Shalom border. This increase is due to conversations between the UN and Israel's Defense Ministry.\nPriority:\nMedium"}, {"id": "83897f1f-d89c-48eb-b14f-a645aa2229d1", "title": "Three commercial ships and US warship involved in Houthi attack in Red Sea", "date": "2024-06-16 14:45", "url": "http://www.myanmarmuslim.net/news/20240616207b599737.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ballistic missiles fired by Yemen’s Houthi rebels struck three commercial ships in the Red Sea, the US military said on Sunday.\n“These attacks represent a direct threat to international commerce and maritime security,” the US military’s Central Command said in a statement.\nShortly afterward, the Carney shot down a drone headed its way, although it is not clear if the destroyer was the target, Central Command said.\nWhile responding to its distress call, the Carney shot down another incoming drone.\nThe attack began around 9.15am local time (0615 GMT) in Houthi-controlled Sanaa, Yemen’s capital, Central Command said.", "location": "Sanaa, Yemen", "classification": "security", "score": 0.8153750408935225, "event_breakdown": "Houthi rebels in Yemen fired a ballistic missile at a military parade in Aden on Thursday, killing at least seven people including a senior army commander, according to news reports. The missile targeted the stadium where the parade was taking place."}, {"id": "c3c25966-65cb-4963-a5b7-d07ea3ed4759", "title": "US Navy faces most intense combat since WWII against Houthis", "date": "2024-06-16 17:45", "url": "https://wcfcourier.com/news/nation-world/israel-hamas-war-yemen-houthis-war-unrest/article_8ca91697-c591-5257-8d77-cae16556f878.html", "domain": "wcfcourier.com", "domain_classification": "Unknown", "message": "Eric Blomberg with the USS Laboon told the AP on a visit to his warship on the Red Sea.\nThat commercial ship was abandoned on Friday and left adrift and unlit in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthi attacks continue to depress shipping through the region.\nHow Houthi attacks crimp global trade Why are Houthis attacking ships?\nHow are Houthi attacks affecting trade?", "location": "Based on the text provided, I could not identify a specific location.", "classification": "security", "score": 0.48225300405774285, "event_breakdown": "Houthis are attacking ships in the red sea, this is causing trade to go down 5% in the strait of Bab-el-Mandeb."}, {"id": "45b0daba-3041-4403-b7f7-0fbc399689ce", "title": "How will the IDF strike back ? Hezbollah missile hits IAF air traffic control base in Meron", "date": "2024-06-16 17:00", "url": "http://www.israelnationalnews.com/news/391617", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד הפגיעה בבסיס חיל האוויר צילום: ללא קרדיטHezbollah published footage showing an anti-tank missile hitting the Air Force air traffic control base in Meron in northern Israel on Saturday.\nIn response to attacks on Israel, IDF aircraft struck Hezbollah military structures in the areas of Yaroun, Kfarkela, and Marwahin in southern Lebanon.\nGalei Tzahal military correspondent Doron Kadosh wondered why the IDF did not increase the strikes after the missiles hit the base: \"Has Israel's retaliation policy deteriorated?\nKadosh requested comment from the IDF Spokesperson: \"They explained to me that the strike on Meron yesterday was retaliation for the elimination of a senior Hezbollah member.\"\nIt was the most senior Hezbollah member that Israel eliminated thus far, an important and experienced personality, whose elimination drew quite a few Hezbollah strikes during the Shavuot holiday.", "location": "Meron", "classification": "security", "score": 0.9175005869919851, "event_breakdown": "IDF aircraft struck Hezbollah military structures in the areas of Yaroun, Kfarkela, and Marwahin in southern Lebanon on Saturday following Hezbollah attacks that hit the air traffic control base in northern Israel"}, {"id": "cbb2a0fc-92c9-449a-999e-9d6f200f9f4d", "title": "How will the IDF strike back ? Hezbollah missile hits IAF air traffic control base in Meron", "date": "2024-06-16 16:00", "url": "https://www.israelnationalnews.com/news/391617", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד הפגיעה בבסיס חיל האוויר צילום: ללא קרדיטHezbollah published footage showing an anti-tank missile hitting the Air Force air traffic control base in Meron in northern Israel on Saturday.\nIn response to attacks on Israel, IDF aircraft struck Hezbollah military structures in the areas of Yaroun, Kfarkela, and Marwahin in southern Lebanon.\nGalei Tzahal military correspondent Doron Kadosh wondered why the IDF did not increase the strikes after the missiles hit the base: \"Has Israel's retaliation policy deteriorated?\nKadosh requested comment from the IDF Spokesperson: \"They explained to me that the strike on Meron yesterday was retaliation for the elimination of a senior Hezbollah member.\"\nIt was the most senior Hezbollah member that Israel eliminated thus far, an important and experienced personality, whose elimination drew quite a few Hezbollah strikes during the Shavuot holiday.", "location": "Israel", "classification": "security", "score": 0.9175005869919851, "event_breakdown": "IDF aircraft struck Hezbollah military structures in the areas of Yaroun, Kfarkela, and Marwahin in southern Lebanon in response to attacks on Israel."}, {"id": "8ab99ab9-698e-4d48-a292-3f14ff31b90d", "title": "Two dead after Israeli missiles  hit residential area  in Syria", "date": "2024-06-16 16:30", "url": "http://www.myanmarmuslim.net/news/20240617187b599810.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli air strikes hit a neighbourhood in the Syrian capital on Wednesday morning, killing two people and causing material damage, Syria’s state TV said.\nSyrian state TV reported that several missiles hit the western neighbourhood of Kfar Sousseh but did not elaborate or say who were the people killed.\nThe pro-government Sham FM radio station said the strike hit a building near an Iranian school.\nSana, the state news agency, quoted an unnamed military official as saying that the missiles were fired from the direction of Syria’s Israeli-occupied Golan Heights and hit a building, killing two civilians and wounding another.\nLast month, an Israeli strike on the Syrian capital’s western neighbourhood of Mazzeh destroyed a building used by the Iranian paramilitary Revolutionary Guard, killing at least five Iranians.", "location": "Kfar Sousseh", "classification": "security", "score": 0.9729889473114838, "event_breakdown": "Israeli air strikes hit a Syrian neighbourhood in Damascus, killing at least two people."}, {"id": "77c46408-e9aa-4eaa-8f06-5bd016c2aa8e", "title": "North Korea flies balloons carrying rubbish over the South", "date": "2024-06-16 16:45", "url": "http://www.myanmarmuslim.net/news/20240617311e599688.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Balloons with rubbish, thought to have been sent by North Korea, in South Chungcheong Province, South Korea (South Korea Presidential Office via AP)In a speech on Tuesday, Mr Kim described the South Korean response as a “hysterical attack formation flight and strike drill” and “direct military challenge” towards North Korea, the North’s official Korean Central News Agency said on Wednesday.\nIn another sign of tensions between the war-divided rivals, South Korea’s Joint Chiefs of Staff said North Korea has also been flying large numbers of balloons carrying rubbish towards the South since Tuesday night, in an apparent retaliation against South Korean activists for flying anti-Pyongyang propaganda leaflets across the border.\nRubbish from a balloon in Seoul, South Korea (South Korea Presidential Office via AP)There were no immediate reports of damage caused by the balloons.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidiser.\nThe US and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "SOUTH KOREA", "classification": "security", "score": 0.644589893826974, "event_breakdown": "North Korea is flying large numbers of balloons carrying rubbish towards the South, prompting tensions between war-divided rivals. It is believed to be a response to South Korean activists for flying anti-Pyongyang propaganda leaflets across the border."}, {"id": "26cfaa53-5053-49ea-96ac-f25f8ff02ba3", "title": "Germany : Man wielding hammer in Hamburg shot by police – DW – 06 / 16 / 2024", "date": "2024-06-16 18:15", "url": "https://www.dw.com/en/germany-man-wielding-hammer-in-hamburg-shot-by-police/a-69378556", "domain": "dw.com", "domain_classification": "International", "message": "A man tried to attack officers with a hammer in the St Pauli district of Hamburg.\nThe incident took place before the city was due to host the Euro 2024 match between the Netherlands and Poland.\nPolice in the northern German city of Hamburg on Sunday shot and wounded a man who attempted to attack passersby with a pick hammer, authorities said.\nSecurity has already been tightened ahead of Sunday's soccer match with hundreds of Hamburg and federal police officers deployed.\nOn Friday, police in eastern Germany shot dead a man who went on the rampage, stabbing one man to death, before gatecrashing a house party for the championship's opening match.", "location": "Hamburg, Germany", "classification": "security", "score": 0.8607517114416188, "event_breakdown": "Hammer Attack in St. Pauli, Hamburg\n\nPolice in Hamburg shot and wounded a man who attempted to attack passersby with a pick hammer in the city's St. Pauli district. Officers shot him before he was able to injure anyone."}, {"id": "8dee66d9-5c31-471c-ada7-7cb6488cb640", "title": "Key TTP commander killed in Pakistan northwest | Pakistan News", "date": "2024-06-16 15:00", "url": "https://indianexpress.com/article/pakistan/key-ttp-commander-killed-in-pakistans-northwest-9395995/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "A top militant commander of the banned Tehreek-e-Taliban Pakistan (TTP) was killed on Sunday in an encounter with security forces in Pakistan’s restive Khyber-Pakhtunkhwa province.\nTTP commander Waliullah was killed by the Counter-Terrorism Department (CTD) of Bannu in an intelligence-based operation in the Lakki Marwat district in the province, the Express Tribune newspaper reported.\nWaliullah was killed in retaliatory firing by the security forces, the paper said.\nAdvertisementHe was a local commander of the TTP Tipu Gul group and was the son-in-law of Commander Atiqur Rahman alias Tipu Gul Marwat, the paper said.\nThe TTP, set up as an umbrella group of several militant outfits in 2007, is believed to be close to al-Qaeda.", "location": "Khyber-Pakhtunkhwa, Pakistan", "classification": "security", "score": 0.9731247234158215, "event_breakdown": "Target event: Killing of top militant commander of the banned Tehreek-e-Taliban Pakistan (TTP)\nEvent: Top militant commander of the banned Tehreek-e-Taliban Pakistan (TTP) Waliullah was killed by Counter-Terrorism Department (CTD)of Bannu in an encounter with security forces in Pakistan's restive Khyber-Pakhtunkhwa province."}, {"id": "cef4ede9-ffe1-4839-98aa-51bff40cfa10", "title": "One dead , 162 hurt after explosion follows lightning strike in Uzbek capital", "date": "2024-06-16 17:45", "url": "http://www.myanmarmuslim.net/news/20240617791e599203.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosA powerful explosion in the Uzbek capital, Tashkent, has killed a teenage boy and injured at least 162 other people following a fire caused by a lightning strike, the country’s ministry of health said.\nThe ministry of emergency situations said the explosion occurred early in the morning at a warehouse in southern Tashkent, but did not say what was inside it to cause the powerful blast.\nRussian state media Tass later reported that the warehouse contained several dozen electric vehicles and batteries.\nMore than 160 people were injured (Emergency Ministry Press Service via AP)It said that the explosion also caused minor damage to the nearby Quruvchilar subway station.\nTwenty-four people were taken to hospital after the explosion and the remaining 138 were treated for their injuries and sent home according to the health ministry.", "location": "Tashkent.", "classification": "security", "score": 0.8357258431006016, "event_breakdown": "Uzbek capital Tashkent: A powerful explosion in the Uzbek capital, Tashkent, has killed a teenage boy and injured at least 162 other people following a fire caused by a lightning strike, the country’s ministry of health said."}, {"id": "3a52f97c-4498-4f5f-a181-e05f74300d51", "title": "One dead , 162 hurt after explosion follows lightning strike in Uzbek capital", "date": "2024-06-16 18:00", "url": "http://www.myanmarmuslim.net/news/20240617898e599047.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosA powerful explosion in the Uzbek capital, Tashkent, has killed a teenage boy and injured at least 162 other people following a fire caused by a lightning strike, the country’s ministry of health said.\nThe ministry of emergency situations said the explosion occurred early in the morning at a warehouse in southern Tashkent, but did not say what was inside it to cause the powerful blast.\nRussian state media Tass later reported that the warehouse contained several dozen electric vehicles and batteries.\nMore than 160 people were injured (Emergency Ministry Press Service via AP)It said that the explosion also caused minor damage to the nearby Quruvchilar subway station.\nTwenty-four people were taken to hospital after the explosion and the remaining 138 were treated for their injuries and sent home according to the health ministry.", "location": "Tashkent", "classification": "security", "score": 0.8357258431006016, "event_breakdown": "Uzbekistan: A powerful explosion in the Uzbek capital, Tashkent, has killed a teenage boy and injured at least 162 other people following a fire caused by a lightning strike, the country's ministry of health said."}, {"id": "ddae42c8-80f6-4cf1-bf06-1ec5da6dc2ef", "title": "Pakistan Taliban Announces Three - Day Ceasefire With Pak Govt To Mark Eid al - Adha", "date": "2024-06-16 19:15", "url": "https://www.news18.com/world/pakistan-taliban-announces-three-day-ceasefire-with-pak-govt-to-mark-eid-al-adha-8934546.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The banned Tehreek-e-Taliban Pakistan (TTP) on Sunday announced a three-day cease-fire with the Pakistani government during the Muslim festival of Eid al-Adha.\nEid ul-Adha is being celebrated in Pakistan from June 17-19.\nIn a statement, the TTP said that it has decided to announce a cease-fire on the demand from the Pakistani people.\nIt was the second occasion when TTP announced a cease-fire, after 2021.\nThe TTP, set up as an umbrella group of several militant outfits in 2007, is believed to be close to al-Qaeda.", "location": "ISLAMABAD", "classification": "security", "score": 0.5936597040103003, "event_breakdown": "[\n{\n\"title\": \"TTP announces cease-fire in Pakistan during Eid al-Adha\",\n\"description\": \"Tehreek-e-Taliban Pakistan (TTP) on Sunday announced a three-day cease-fire with the Pakistani government from June 17-19, during the Muslim festival of Eid al-Adha.\",\n\"start_date\": \"2022\",\n\"end_date\": \"2022-06-19\",\n\"event_category\": \"Security\",\n\"event_type\": \"Cease-fire\",\n\"location\": \"Pakistan\"\n}\n]"}, {"id": "8352d4fa-b5e4-4925-a033-86a2c38c1f22", "title": "Sydney knife attacker shot dead after killing six people in Bondi", "date": "2024-06-16 12:00", "url": "http://www.myanmarmuslim.net/news/20240616123c599868.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosUpdated: 5pmAn attacker who fatally knifed six people in a Sydney mall was shot dead by police in the beachside suburb of Bondi on Saturday, police said, as hundreds fled the scene.\nThe assailant was shot by a police officer after he attacked shoppers in the busy Westfield Bondi Junction shopping centre, a police statement said.\nAn Irish man who is living and working Bondi told Newstalk he was inside the shopping centre when the attack happened.\nAyush Singh, 25, was working in a cafe in the mall when he saw the attack and then heard gunshots as police responded.\nThe other witness said they saw a woman lying on the ground and took shelter in a jewellery store.", "location": "Bondi Junction", "classification": "security", "score": 0.5010589707181317, "event_breakdown": "Sydney, Australia: Six stabbed in beachside mall. Irish witness says police shot alleged attacker."}, {"id": "3a0bb57b-62f0-4774-8a4b-35154e5a0f86", "title": "Slovakian prime minister fighting for his life after attempted assassination", "date": "2024-06-16 16:45", "url": "http://www.myanmarmuslim.net/news/20240617093c599906.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosSlovakia’s populist prime minister, Robert Fico, was shot multiple times and gravely wounded on Wednesday in an attempted assassination that shocked the small country and reverberated across Europe.\nThe pro-Russian leader, 59, was reported to be fighting for his life after being hit in the stomach.\nAt least four shots were fired outside a cultural centre in the town of Handlova, nearly 85 miles north east of the capital, where Mr Fico was meeting with supporters, the government said.\nMr Fico was taken by helicopter to a hospital.\nPlease, let’s stop it.”President-elect Peter Pellegrini, an ally of Mr Fico, called the shooting “an unprecedented threat to Slovak democracy.", "location": "HANDLOVA", "classification": "security", "score": 0.5033080201825837, "event_breakdown": "Slovakia: Robert Fico, prime minister of Slovakia was shot multiple times and gravely wounded on Wednesday in an attempted assassination that shook the small country and reverberated across Europe."}, {"id": "446a6c76-c03b-4ca6-a54d-a17124baa417", "title": "8 Israeli soldiers killed in southern Gaza", "date": "2024-06-16 01:30", "url": "https://www.wtvr.com/world/israel-at-war/8-israeli-soldiers-killed-in-southern-gaza", "domain": "wtvr.com", "domain_classification": "Unknown", "message": "Israel's military said Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.\nThe deaths will likely fuel calls for a cease-fire and heighten Israeli public anger over ultra-Orthodox exemptions from the military.\nIn January, 21 Israeli troops were killed in a single attack by Palestinian militants in Gaza.\nIsrael's bombardment and ground offensives in Gaza have killed more than 37,000 Palestinians, according to Palestinian health officials, who don't give the breakdown of civilians and fighters.\nHamas has continually called for a permanent cease-fire and complete Israeli troop withdrawal from Gaza as part of any deal that would see the hostages released.", "location": "GAZA", "classification": "security", "score": 0.9530195833739202, "event_breakdown": "Israel's Airstrike Kills 6 People in Gaza - JERUSALEM (AP) — The Israeli military launched airstrikes on the Gaza Strip late Thursday night, striking a group that it said was preparing to launch rockets at Israel. The strikes killed six people, Palestinian officials said."}, {"id": "5fc99b7d-44d6-44cd-9f59-8dc00986deab", "title": "Maine police kill armed man after a night of gunfire and burned homes", "date": "2024-06-16 17:30", "url": "https://www.ktiv.com/2024/06/16/maine-police-kill-armed-man-after-night-gunfire-burned-homes/", "domain": "ktiv.com", "domain_classification": "Unknown", "message": "AUBURN, Maine (AP) — A Maine State Police tactical team fatally shot a man on a rooftop early Saturday after an hourslong standoff in which authorities said he opened fire at officers, two homes burned down and a person who fought with him died.\nHe tried to break into a home just before 1 a.m. Saturday, and got into a fight with a man inside.\nOfficers heard yelling inside the house and saw flames coming from the windows and engulfing the building.\nThe deputy chief said Hinkley fired shots at officers several times and was heard yelling at them from inside, and Auburn police called for the tactical team.\nPhotos of scene show several vehicles parked beside the homes also burned, including a yellow school bus.", "location": "Auburn, Maine", "classification": "security", "score": 0.9348242805714324, "event_breakdown": "Maine State Police fatally shot a man on a rooftop early Saturday after an hourslong standoff in which authorities said he opened fire at officers, two homes burned down and a person who fought with him died."}, {"id": "e2ccc780-f812-42cb-9f95-652b470070e9", "title": "Russia wears down Ukrainian defences with missile and drone attacks", "date": "2024-06-16 11:00", "url": "http://www.myanmarmuslim.net/news/20240616814d599177.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence systems intercepted 26 out of 28 Shahed drones, Ukraine’s air force said.\nRussian forces also launched five missiles overnight, it said.\nRescue workers clear the rubble of destroyed houses after a Russian drone attack in Zaporizhzhia (AP Photo/Andriy Andriyenko)The attacks also aim to weaken Ukrainian morale and act as retribution for Ukrainian long-range strikes on Russian soil.\nHe said it was “sheer nonsense” to think that Russia could attack a Nato member country after the Ukraine war.\nThe Black Sea city of Odesa repelled three missile and drone attacks, officials said.", "location": "ODESA", "classification": "security", "score": 0.4235489607790607, "event_breakdown": "[\n\"Ukraine says it shot down 26 out of 28 drones near Odesa,\"\n\"Odesa repels three missile and drone attacks, officials said,\"\n\"Italy: Russia cannot attack Nato while Ukraine war continues,\" \n]"}, {"id": "63d55448-521e-4c31-a34d-c6c6174a3b75", "title": "50 - year - old man stabbed in downtown Cleveland", "date": "2024-06-16 05:15", "url": "https://www.cleveland19.com/2024/06/16/54-year-old-man-stabbed-downtown-cleveland/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "CLEVELAND, Ohio (WOIO) - A 50-year-old man was stabbed in downtown Cleveland Saturday evening.\nAccording to Cleveland EMS, they were called to the scene of the stabbing just past 8:45 p.m. at East 12th and Walnut Ave.Cleveland Police say the man was stabbed in the chest and received various cuts to his face.\nCleveland EMS say the victim was taken to the hospital in stable condition.\nPolice say a suspect in the stabbing is in custody.\nCopyright 2024 WOIO.", "location": "Cleveland.", "classification": "security", "score": 0.46309994588027553, "event_breakdown": "A news push that reports a 50-year-old man was stabbed in the chest and received various cuts to his face in downtown Cleveland on Saturday evening, according to police and Cleveland EMS."}, {"id": "ea52c48f-2826-4938-a62b-32f3735dd919", "title": "Russian journalist killed in Ukraine drone strike : media - World", "date": "2024-06-16 19:15", "url": "https://www.brecorder.com/news/40308722/russian-journalist-killed-in-ukraine-drone-strike-media", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "MOSCOW: A Russian journalist was killed in a drone attack in eastern Ukraine, his news organisation said on Sunday, two days after the death of another correspondent near the front line.\nRussia launches missile and drone attack on Kyiv, Ukraine’s military saysThe Russian foreign ministry said a Ukrainian drone had \"purposefully hit the Russian journalist preparing a report in the area\".\nOn Thursday, a journalist for Russian state television was killed and another wounded in a Ukrainian drone strike in Golmivsky, a Russian-controlled village close to the front line in the Donetsk region.\nThe Russian foreign ministry accused Ukraine of deliberately targeting the journalists.\nPresident Vladimir Putin earlier this month said that \"at least 30\" Russian journalists had been killed since the start of the conflict in Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.6061325318070367, "event_breakdown": "* Russian journalist killed in a drone attack in eastern Ukraine\n* Russian journalist killed and another wounded in a Ukrainian drone strike in Golmivsky."}, {"id": "1b2479c9-c912-4a8d-ae87-57dcd29ac709", "title": "US : Eight , including two children injured in Michigan shooting ; suspect found dead", "date": "2024-06-16 06:00", "url": "https://news.webindia123.com/news/Articles/World/20240616/4206164.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The suspect behind the attack was later found dead at a nearby home, CNN reported citing officials.\nMichigan Governor Gretchen Whitmer said she was in contact with local officials after the shooting incident.\n\"I am heartbroken to learn about the shooting in Rochester Hills,\" she stated in a post on X.\nThe first 911 call alerting police regarding the shooting incident was made around 5:11 pm (local time), CNN reported.\nHe said that authorities are bringing in additional assets, including SWAT teams and armoured vehicles to help officers at the crime scene, CNN reported.", "location": "Rochester Hills, Michigan", "classification": "security", "score": 0.9313372960697299, "event_breakdown": "Michigan Governor Gretchen Whitmer said she was in contact with local officials after the shooting incident in Michigan, United States.\"I am heartbroken to learn about the shooting in Rochester Hills,\" she stated in a post on"}, {"id": "74da8669-37e9-463c-b48a-ef45d22835d3", "title": "Russian drone strikes on Odesa cut off ferry service to Romania", "date": "2024-06-16 11:15", "url": "http://www.myanmarmuslim.net/news/2024061648d599942.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Meanwhile, a senior Russian naval officer that Ukraine on Monday claimed to have killed in a missile strike was seen attending an online conference.\nRomanian Border Police said ferries were anchored on the Romanian shores of the Danube in Isaccea due to the attacks on Ukraine.\nFirefighters in Izmail, Odesa, work to extinguish a fire after a Russian rocket attack (Odesa Region Administration via AP/PA)The attacks came the day after a Russian missile and drone attack killed two people in a grain warehouse in Odesa and badly damaged an abandoned high-rise hotel.\nIn fighting in the Zaporizhzhia region in the southeast, the Russian army dropped five aerial bombs on Robotyne, a town Ukraine took in August in its slow-moving counteroffensive.\nThe footage shot two days ago shows the village in ruins with destroyed Russian tanks and military vehicles littering the main road.", "location": "ODESSA", "classification": "security", "score": 0.9378267224343599, "event_breakdown": "1. Russian missile and drone attack kills 2 civilians in Odesa and damages abandoned high-rise hotel.\n2. Russia drops five aerial bombs on Ukrainian town Robochine in southeastern Zaporizhzhia region."}, {"id": "c32c3391-e8d5-4bdb-9148-feb0fb32ce01", "title": "Brooklands Splashpad shooting : At least 9 wounded in Rochester Hills ; suspect contained", "date": "2024-06-16 02:30", "url": "https://www.foxla.com/news/multiple-people-shot-rochester-hills-splashpad", "domain": "foxla.com", "domain_classification": "Unknown", "message": "Sources have confirmed that the suspect who shot nine people at a Rochester Hills splashpad Saturday afternoon, is dead by suicide.\nInvestigators first sent in drones to make contact with the man before making entry and discovering the suspect dead.\nThe services will be held at the Rochester Hills Department of Public Services building, 511 E. Auburn Road.\n\"Under no circumstances in this country, particularly in Rochester Hills, should fathers be spending Father's Day in a hospital,\" he said.\n\"I am heartbroken to learn about the shooting in Rochester Hills,\" she said.", "location": "Rochester Hills", "classification": "security", "score": 0.5671590311618687, "event_breakdown": "Event - Shooting in Rochester Hills on June 19, 2023\nThe services will be held at the Rochester Hills Department of Public Services building, 511 E. Auburn Road."}, {"id": "01d0181b-03e0-4e7d-b243-5248f9293ca8", "title": "Man shot dead on Lady Musgrave Road - Jamaica Observer", "date": "2024-06-16 04:15", "url": "https://www.jamaicaobserver.com/2024/06/15/man-shot-dead-lady-musgrave-road/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "A man is dead and another hospitalised following a gun attack on Lady Musgrave Road in St Andrew on Saturday evening.\nAccording to the Jamaica Constabulary Force’s Corporate Communications Unit, the incident reportedly took place around 6pm in the vicinity of the Spic N Span Dry Cleaners.\nThe circumstances surrounding the incident remain unclear, but it is understood that the shooting was carried out by gunmen travelling on a motorcycle.\nWhen the shooting subsided, two men were found suffering from gunshot wounds.\nThey were taken to hospital, where one of the men was pronounced dead and the other admitted.", "location": "Lady Musgrave Road", "classification": "security", "score": 0.9744946313518367, "event_breakdown": "Target event located. Current event:\nA gun attack on Lady Musgrave Road in St Andrew on Saturday, January 22nd, has left one man dead and another hospitalised. The shooting was conducted by gunmen on a passing motorcycle and there are presently no known motives or individuals apprehended."}, {"id": "17b40434-0b1f-45f7-875d-cad19898dd73", "title": "Russian attacks across Ukraine kill 3 , injure 6 over past day", "date": "2024-06-16 08:45", "url": "https://www.yahoo.com/news/russian-attacks-across-ukraine-kill-072538684.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian attacks on Ukraine killed three people and injured six over the past day, regional authorities reported on June 16.\nRussia targeted a total of nine Ukrainian oblasts — Chernihiv, Sumy, Poltava, Luhansk, Zaporizhzhia, Kherson, Dnipropetrovsk, Kharkiv, and Donetsk.\nIn Donetsk Oblast, Russian forces struck the village of Ulakly, around 60 kilometers (37 miles) west of Russian-occupied Donetsk, using multiple rocket launchers, Governor Vadym Filashkin reported.\nIn Kharkiv Oblast, Russian forces attacked the village of Kurylivka in the region's Kupiansk district with a multiple rocket launcher, Governor Oleh Syniehubov said.\nAs a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15, but they have dramatically increased since then.", "location": "Kharkiv", "classification": "security", "score": 0.943804205171216, "event_breakdown": "Russia attacked the village of Kurylivka in Kharkiv Oblast with a multiple rocket launcher. Russia also attacked the village of Ulakly in Donetsk Oblast using multiple rocket launchers.\nRussia also targeted nine other Ukrainian oblasts: Chernihiv, Sumy, Poltava, Luhansk, Zaporizhzhia, Kherson, Dnipropetrovsk, Kharkiv and Donetsk."}, {"id": "26c6ebaa-bb5f-424b-8cb1-17aff687fc12", "title": "Hezbollah fighters killed as tensions flare along Lebanon and Israel border", "date": "2024-06-16 11:00", "url": "http://www.myanmarmuslim.net/news/20240616256c599689.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The escalation comes amid fears that the war could spread into Lebanon, where Hezbollah has expressed strong support for the militant Palestinian group.\nSo far, artillery exchanges between Hezbollah and Israel have been limited to several towns along the border.\n(PA Graphics)Israel responded by striking several areas along the border in southern Lebanon, the state-run National News Agency in Lebanon reported.\nThe Israeli military said its tanks fired back into Lebanon after an anti-tank missile was launched across the border.\nIn separate violence earlier on Tuesday, the Israeli military said it killed four militants who had attempted to plant explosive devices on a border wall between Israel and Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9702214017682333, "event_breakdown": "Israel - In separate violence earlier on Tuesday, the Israeli military said it killed four militants who attempted to plant explosive devices on a border wall between Israel and Lebanon. Another current event of security reported in text that can be placed on a map is:\nLebanon - Israel responded by striking several areas along the border in southern Lebanon, the state-run National News Agency in Lebanon reported. Another current event of security reported in text that can be placed on a map is:\nIsrael - So far, artillery exchanges between Hezbollah and Israel have been limited to several towns along the border. Another current event of security reported in text that can be placed on a map is:"}, {"id": "71ff9928-be11-4c82-8a2c-dcc26d5e7b48", "title": "Hezbollah fighters killed as tensions flare along Lebanon and Israel border", "date": "2024-06-16 19:00", "url": "http://www.myanmarmuslim.net/news/20240617256c599689.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Hezbollah fighters killed as tensions flare along Lebanon and Israel borderClashes have erupted along the Lebanon-Israel border, leaving five Hezbollah fighters dead.\nThe escalation comes amid fears that the war could spread into Lebanon, where Hezbollah has expressed strong support for the militant Palestinian group.\n(PA Graphics)Israel responded by striking several areas along the border in southern Lebanon, the state-run National News Agency in Lebanon reported.\nThe Israeli military said its tanks fired back into Lebanon after an anti-tank missile was launched across the border.\nIn separate violence earlier on Tuesday, the Israeli military said it killed four militants who had attempted to plant explosive devices on a border wall between Israel and Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9784507032272236, "event_breakdown": "Israel strikes Hezbollah positions in Lebanon\nIsraeli military said it killed four militants who had attempted to plant explosive devices on a border wall between Israel and Lebanon"}, {"id": "a786f412-374d-4322-92ff-40655995fa14", "title": "French Army head Schill talks force modernization , Ukraine war lessons", "date": "2024-06-16 14:30", "url": "https://www.yahoo.com/news/french-army-head-schill-talks-140000403.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Philippe Desmazes/AFP via Getty Images)Which key capabilities will the French Army present at Eurosatory?\nThe French army is an army of operational deployment and is a reference in Europe owing to its skills in aerocombat, the quality of its equipment and its operational experience.\nConsequently, what adjustments is the French Army making to training doctrines and equipment priorities?\nThe French Army started to deploy Scorpion in 2021, one of the most ambitious modernization programs among Western land forces.\nThis rapid deployment made it possible to mobilize more than 500 French Army soldiers in a few days.", "location": "EUROSatory", "classification": "security", "score": 0.8871614697532214, "event_breakdown": "The French Army is participating in Eurosatory, a key international defense and security trade show, where it will present its Scorpion program, a modernization program for its fleet of armored vehicles, and its Griffon program, which aims to develop new helicopters for the French Army."}, {"id": "28218e53-dd86-44a0-99b3-d1647a71d313", "title": "Senior Staff Sergeant Major ( Res .) Elon Waiss is laid to rest", "date": "2024-06-16 17:00", "url": "http://www.israelnationalnews.com/news/391627", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "קדיש במסע הלוויתו של אלון ויס ז\"ל דמקה הפקותSenior Staff Sergeant Major (Res.)\nElon Waiss, who was killed in battle in the northern Gaza Strip, was laid to rest on Sunday at the Mount Herzl Military Cemetery in Jerusalem.\nWaiss, 49, from Psagot, a combat soldier in the 129th Battalion of the 8th Brigade, was killed in battle together with Cpt.\nLt. Col. Ariel Ben-Baruch eulogized on behalf of the IDF: \"Elon, a brother and companion, my soldier, and the Nation of Israel's soldier.\nDaniel Be’eri, principal of the Amit Eitan High School for Boys in Ma'ale Adumim, said that \"Amit Eitan was Rabbi Waiss' second home.", "location": "The main location where the main event takes place is Jerusalem.", "classification": "security", "score": 0.7367264320705726, "event_breakdown": "Senior Staff Sergeant Major (Res.) Elon Waiss, 49, from Psagot, a combat soldier in the 129th Battalion of the 8th Brigade of the Israel Defense Force (IDF), was killed in battle in the northern Gaza Strip on January 7, 2019.\n\nWaiss was laid to rest on Sunday at the Mount Herzl Military Cemetery in Jerusalem.\n\nHe was eulogized by Lieutenant Colonel Ariel Ben-Baruch on behalf of the IDF."}, {"id": "d4ac136a-49a3-43a4-8a11-786c8b3285c7", "title": "Protecting the Homeland : Stories of the victims of the APC explosion in Gaza", "date": "2024-06-16 11:45", "url": "https://www.israelnationalnews.com/news/391610", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Eight IDF soldiers from the 601st Battalion of the Iron Tracks Brigade 401 were killed on Saturday in the explosion of an APC in the Tel-Sultan neighborhood in Rafah.\nRabbi Zechariah Rabinowitz, his teacher, eulogized: \"Yakir Levi, of blessed memory, was a very bright, friendly, and courteous individual.\nThe last time he visited the yeshiva, Yakir sat with me for a deep learning session with a sparkle in his eyes.\nRabbi Zechariah Rabinowitz, his teacher at the Shalavim yeshiva, eulogized: \"Shalom loved the service of God, he knew this was the truth and loved the yeshiva and his surroundings.\nThe Hesder Yeshiva Union expressed deep sorrow at the fall of the soldiers Sergeant Yakir Yaakov Levi, Sergeant Shalom Menachem, and Sergeant Elyahu Moshe Zimbalist.", "location": "Based on the text provided, the most specific location where the main event takes place is 'Tel-Sult", "classification": "security", "score": 0.9215833978837661, "event_breakdown": "Target events found:\nEight IDF soldiers from the 601st Battalion of the Iron Tracks Brigade 401 were killed on Saturday in the explosion of an APC in the Tel-Sultan neighborhood in Rafah."}, {"id": "b44cbfe3-b35e-4680-a61b-da739cc947c5", "title": "Ten IDF soldiers were killed in the Gaza Strip over the weekend", "date": "2024-06-16 18:15", "url": "https://www.jpost.com/israel-hamas-war/2024-06-16/live-updates-806495", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Fallen IDF soldiers Shalom Menachem.\n(photo credit: IDF SPOKESPERSON'S UNIT)Sgt.\nShalom Menachem, 21 from Beit El is the eighth IDF soldier that was killed in in Rafah from an explosion of an APC, the IDF announced on Sunday.\nMenachem was a fighter in the 601st Battalion of the 401st Division.\nHis family was notified, and Menachem was promoted to the rank of Sergeant posthumously.", "location": "GAZA (Islamic period)", "classification": "security", "score": 0.9177552377953643, "event_breakdown": "IDF soldier Shalom Menachem was killed in an explosion of an APC in Rafah on Sunday."}, {"id": "ea83bae7-6fe9-4439-ab13-3e96b4818a03", "title": "Ukrainian writer and soldier says all Russians are to blame for the invasion :  It not Putin who is pulling the trigger in Bucha  ", "date": "2024-06-16 13:30", "url": "https://www.yahoo.com/news/ukrainian-writer-soldier-says-russians-123351447.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Ukrainian writer and soldier says all Russians are to blame for the invasion: 'It's not Putin who is pulling the trigger in Bucha'Oleksandr Mykhed is a Ukrainian author who became a soldier following the Russian invasion.\nWithin a week of the invasion, Mykhed, a renowned author who has published nine books, had enlisted in the Ukrainian Armed Forces, and his former home had been destroyed by a Russian attack.\nMeeting me in London to discuss the book, Mykhed appears a hardened and determined figure, shaped by a conflict already stretching into its third year.\nIt's not Putin who is pulling the trigger in Bucha,\" he says, referencing the massacre that took place in 2022.\nIn late February, Ukrainian President Volodymyr Zelenskyy said 31,000 Ukrainian soldiers had been killed since Russia launched the invasion.", "location": "BUCHA.", "classification": "security", "score": 0.44465946413384894, "event_breakdown": "Bucha Massacre, Ukraine, Russia, Oleksandr Mykhed"}, {"id": "aeb42dd6-4a3a-42d4-a50f-519915e1290e", "title": "Iran to react if Israel conducts broad raid on Lebanon : Israeli media", "date": "2024-06-16 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-irna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iran to react if Israel conducts broad raid on Lebanon: Israeli mediaIRNA - Islamic Republic News AgencyJun 15, 2024Tehran, IRNA -- Media outlets of the Israeli regime warned their leaders in Tel Aviv that if the regime launches a full-scale attack on Lebanon, Iran is likely to get involved.\nThe anchor added that the Israeli army is worn out and completely reliant on US weapons, and its internal front is completely defenseless, so the authorities should think well before deciding to expand the war.\nMoreover, the Radio Israel reported earlier that the cabinet of this regime decided to call up another 50,000 reserve soldiers to be ready in case of any increase in engagement in the Lebanese front.\nMeanwhile, deputy secretary-general of Hezbollah Sheikh Naim Qassem had previously warned that if the Israeli regime seeks to engage in a full-scale war, Hezbollah is prepared to confront it.\n4208**9417NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address", "location": "Tel Aviv", "classification": "security", "score": 0.7503707553786138, "event_breakdown": "Target event: Iran's claim that it will react if Israel conducts a broad raid on Lebanon\nEvent: Iran to react if Israel conducts a broad raid on Lebanon\nLocation: Israel, Lebanon (border region)"}, {"id": "9d3e71ec-79f0-42eb-ace7-42ceae7ca21b", "title": "Military  pause  on Gaza road inflames divisions in Israeli government", "date": "2024-06-16 14:45", "url": "https://www.yahoo.com/news/military-pause-gaza-road-inflames-134524915.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "According to the Israeli army, when it’s a “local, tactical pause of military activity for humanitarian purposes”.\nBut he also said that coordination was only part of the obstacle agencies faced in delivering aid inside Gaza.\nIsrael is under pressure – from NGOs, allies and its own High Court – to get more aid into Gaza.\nFor Mr Netanyahu, ending the war is likely to bring a fresh battle for his own political survival.\nAnd the tensions Mr Netanyahu faces in straddling them: caught between the promise of “total victory” and the prospect of a \"forever war\".", "location": "Gaza", "classification": "security", "score": 0.8024577621889056, "event_breakdown": "Israeli army declares a local, tactical pause of military activity for humanitarian purposes."}, {"id": "e292f848-1170-43f9-bece-8eacfd512512", "title": "Israel announces military pause on Gaza road to let in aid", "date": "2024-06-16 12:00", "url": "https://www.the-star.co.ke/news/world/2024-06-16-israel-announces-military-pause-on-gaza-road-to-let-in-aid/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The Israeli military says it will hold a daily \"tactical pause of military activity\" along a road in southern Gaza to enable more humanitarian aid to enter.\nThey will only affect a route that leads northwards from the key Kerem Shalom crossing, which Gaza shares with Israel.\nIsrael has been under continuous pressure from its allies, including the US, to prevent the humanitarian crisis in Gaza from worsening.\nInternational agencies have warned of a dire humanitarian situation in Gaza and made repeated calls for more aid to be let in.\nAid agencies have repeatedly reported difficulties in distributing aid around Gaza.", "location": "GAZA", "classification": "security", "score": 0.920144386322617, "event_breakdown": "Not relevant"}, {"id": "869c0acc-502a-44cc-9b52-b12804b7db95", "title": "Russian troops surrender to an elite brigade as the Kharkiv front holds , Ukraine says", "date": "2024-06-16 14:45", "url": "https://www.yahoo.com/news/russian-troops-surrender-elite-brigade-134514673.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian troops surrender to an elite brigade as the Kharkiv front holds, Ukraine saysRussian troops surrender to an elite brigade as the Kharkiv front holds, Ukraine saysDozens of Russian soldiers have surrendered in Vovchansk in recent weeks, Ukraine claims.\nA video released by Ukraine's 3rd Assault Brigade appeared to show Russian POWs.\nRussian soldiers have been surrendering to an elite Ukrainian combat brigade in the northern town of Vovchansk in the Kharkiv region, reports say.\nRussian troops that Ukraine's 3rd Assault Brigade say they captured in recent fighting.\nIn February, some 30,000 Russian troops began pouring over Ukraine's northern border into the Kharkiv region, opening up a new front for Ukraine's already-stretched defenses.", "location": "Vovchansk.", "classification": "security", "score": 0.7942359957050519, "event_breakdown": "Dozens of Russian soldiers have surrendered in recent weeks in Vovchansk, Ukraine, as the 3rd Assault Brigade continues to hold its positions along the Kharkiv front."}, {"id": "0eb725b1-37d0-48a3-bec8-c16c2f888a28", "title": "Russian troops surrender to an elite brigade as the Kharkiv front holds , Ukraine says", "date": "2024-06-16 14:45", "url": "https://www.yahoo.com/news/russian-troops-surrender-elite-brigade-134514318.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian troops surrender to an elite brigade as the Kharkiv front holds, Ukraine saysRussian troops surrender to an elite brigade as the Kharkiv front holds, Ukraine saysDozens of Russian soldiers have surrendered in Vovchansk in recent weeks, Ukraine claims.\nA video released by Ukraine's 3rd Assault Brigade appeared to show Russian POWs.\nRussian soldiers have been surrendering to an elite Ukrainian combat brigade in the northern town of Vovchansk in the Kharkiv region, reports say.\nRussian troops that Ukraine's 3rd Assault Brigade say they captured in recent fighting.\nIn February, some 30,000 Russian troops began pouring over Ukraine's northern border into the Kharkiv region, opening up a new front for Ukraine's already-stretched defenses.", "location": "Vovchansk", "classification": "security", "score": 0.7942359957050519, "event_breakdown": "Dozens of Russian soldiers have been surrendering in Vovchansk, Ukraine, in recent weeks, the country's defense ministry said, as Ukraine has fought off a major Russian offensive in the Kharkiv region."}, {"id": "59ee5265-ab7b-4b58-b80b-82a18ec75aaf", "title": "IDF names 2 soldiers killed in Gaza , one of them in deadly APC blast", "date": "2024-06-16 19:15", "url": "https://www.ynetnews.com/article/ryelfshrr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The IDF reported on Sunday that 21-year-old Sgt.\nShalom Menachem from the West Bank settlement of Bet El was the eighth soldier killed in Rafah duringSaturday's deadly explosion", "location": "GAZA STRIP", "classification": "security", "score": 0.9791340423190923, "event_breakdown": "IDF troops along with Shin Bet security service personnel thwarted an attempted stabbing at the Samaria Territorial Brigade base in the Jordan Valley on early Sunday morning. The suspect, identified as a 17-year-old Palestinian, was shot and injured after breaking into the compound before he was able to attack soldiers who were on duty and asked them for a cigarette, according to an initial IDF assessment."}, {"id": "1a1ba8e2-739d-40ef-84b7-2dae73324a25", "title": "10 Israeli soldiers killed in separate incidents in Gaza in deadliest day for military since January", "date": "2024-06-16 16:00", "url": "https://forward.com/fast-forward/623644/10-israeli-soldiers-killed-in-separate-incidents-in-gaza-in-deadliest-day-for-military-since-january/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Ben Sales June 16, 2024Ten Israeli soldiers were killed in Gaza on Saturday in one of the bloodiest days for the Israeli military since the beginning of its war with Hamas.\nThe soldiers killed on Saturday range in age from 19 to 49.\nIn total, Israel says more than 300 of its soldiers have been killed in the invasion of Gaza after Hamas killed 1,200 people and took some 250 hostage in its Oct. 7 invasion of Israel.\nMore than 37,000 people have since been killed in Gaza, according to the Hamas-run Gaza health ministry.\nIsrael has faced mounting international pressure over the mounting civilian death toll in Gaza and the humanitarian crisis spurred by the war.", "location": "GAZA", "classification": "security", "score": 0.9200136287425172, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* Ten Israeli soldiers were killed in Gaza on Saturday, June 16, 2024, in one of the bloodiest days for the Israeli military since the beginning of the war with Hamas.\n* More than 37,000 people have been killed in Gaza, and more than 43,000 have been wounded, according to the Gaza health ministry. The UN has warned of a \"full-scale war\" in the region. Israel has faced mounting international pressure over the mounting civilian death toll and humanitarian crisis.\n* The Israeli military launched a massive airstrike on the Gaza Strip on Thursday, killing six people and wounding at least 29 others, health officials said. The Israeli military said the attack was in response to a recent surge in rocket fire from the Gaza Strip against Israel.\n* Israel has responded to the rocket fire with airstrikes in the Gaza Strip, killing several people, including a senior Hamas commander, and wounding dozens of Palestinians.\n* The Israeli army shelled a Hamas post in the northern Gaza Strip, saying it carried out air strikes after rockets were fired toward its territory, in response to an explosion at a gas pipeline from Egypt to Israel earlier in the day. The Israeli military said it attacked a Hamas post in Gaza after a rocket was fired toward its territory on Saturday. The rocket was shot down by Israel's Iron Dome missile defense system, the military said.\n* A rocket from the Gaza Strip exploded in Israel on Friday morning, according to the Israeli military. Israel responded by carrying out airstrikes on the Gaza Strip. Israel's military said the target of the airstrikes was a Hamas post, and that the attack was carried out in response to an explosion at a gas pipeline from Egypt to Israel earlier in the day."}, {"id": "20171f5b-1877-42a9-97f7-29feb51bc922", "title": "These are the stories of the soldiers killed this weekend in Gaza", "date": "2024-06-16 14:45", "url": "https://www.ynetnews.com/article/r1gls8nba", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "\"We mourn the unimaginable loss and bow our heads over the death of a member of the community, Sergeant Itay Amar, 19, who was killed along with his friends in the tragic incident.\n11 View gallery Sergeant Itay Amar, 19,Two years ago, Itay was filmed on video together with the kidnapped IDF surveillance post operator Liri Albag.\nA year ago, he was still a student and yesterday he was already killed in Gaza.\nWe salute the hero of Israel, Sergeant Eliyahu Moshe Zimbalist, who was killed this weekend in battle in the southern Gaza Strip.\n\"It is with great sadness that we announce the death of a resident of the community, sergeant Orr Blumovitz, a soldier in the 601st Battalion, who was killed in battle in the southern Gaza Strip.", "location": "Gaza", "classification": "security", "score": 0.7364662619466328, "event_breakdown": "Sergeant Itay Amar, 19, a resident of the settlement of Eli, was killed in battle in the southern Gaza Strip\nSergeant Eliyahu Moshe Zimbalist, a resident of the settlement of Eli, was killed in battle in the southern Gaza Strip.\nGOC Southern Command, Maj. Gen. Hertzi Halevi and GOC Central Command, Maj. Gen. Yehuda Fuchs, gave an additional update to the Knesset committee regarding the IDF's response to the rocket fire from the Gaza Strip this past weekend \nIn response to a question from Knesset Member Mossi Raz (Meretz) about setting policy and objectives, Halevi clarified that Israel's policy was to prevent such actions in the future \"\nIn light of the current situation in the southern Strip, the IDF widened a buffer zone near Kibbutz Nir Am and declared a closed military zone\nIn response to another question from Raz about the security policy in the Strip and the \"buffer zone\", Fuchs clarified that its expansion was necessary due to Hamas' heavy presence in the area"}, {"id": "17bec73b-dde2-40fa-9ed7-d68d5bce5c82", "title": "Israel launches daily 11 - hour pauses in fighting along key aid route in southern Gaza", "date": "2024-06-16 18:45", "url": "https://nypost.com/2024/06/16/world-news/israel-launches-daily-11-hour-pauses-in-fighting-along-key-aid-route-in-southern-gaza/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The Israeli military says it will undertake a daily 11-hour “tactical pause” in fighting along a route in southern Gaza to allow in more humanitarian aid but reiterated its offensive in Rafah will carry on.\nThe 11-hour pauses are significantly longer than the previous ones implemented by the IDF during the war and done to reduce the need for coordinating aid deliveries.\n5 More humanitarian trucks are making their way through southern Gaza after the IDF announced daily, 11-hour pauses in some fighting.\nAP5 A route has been secured to deliver aid to Khan Younis, the largest city in southern Gaza, where war refugees await supplies.\n“The fighting in Rafah continues,” the Israeli military said.", "location": "GAZA", "classification": "security", "score": 0.6822349854556761, "event_breakdown": "IDF undertaking 11-hour 'Tactical Pause' in fighting along route in southern Gaza to allow in humanitarian aid."}, {"id": "ce345f3d-3241-4fac-81c6-adf745c8a3b9", "title": "Russians Surrender to Elite Brigade As Kharkiv Front Holds , Ukraine Says", "date": "2024-06-16 16:30", "url": "https://www.businessinsider.com/russians-surrender-to-elite-brigade-as-kharkiv-front-holds-ukraine-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewRussian soldiers have been surrendering to an elite Ukrainian combat brigade in the northern town of Vovchansk in the Kharkiv region, reports say.\nA video released on Wednesday by Ukraine's 3rd Assault Brigade appears to show Russian troops emerging from a trench with their hands raised above their head or tied behind their backs.\nSeveral of the captured soldiers said they had been forced into the Russian army due to financial or legal trouble.\nAn earlier video published on June 6 by Ukraine's 36th Marine Brigade, appeared to show two Russian soldiers, both wounded, being captured during a Ukrainian counterattack in Vovchansk.\nAdvertisementIn February, some 30,000 Russian troops began pouring over Ukraine's northern border into the Kharkiv region, opening up a new front for Ukraine's already-stretched defenses.", "location": "Vovchansk", "classification": "security", "score": 0.5502541674459042, "event_breakdown": "Russian soldiers have been surrendering to an elite Ukrainian combat brigade in Vovchansk in the Kharkiv region."}, {"id": "baa39a48-50bb-4704-8e7c-1eccb8502f90", "title": "Eyes on Russia And China : MQ - 9B SeaGuardian Lands for First Time At Base On East China Sea", "date": "2024-06-16 19:00", "url": "https://theaviationist.com/2024/06/16/mq-9b-seaguardian-lands-for-first-time-at-kanoya-ab/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "An MQ-9B SeaGuardian UAV (Unmanned Aerial Vehicle) landed at Kanoya Air Base in Japan’s Kagoshima Prefecture, the base announced on Jun.\n“A long-distance UAV (MQ-9B Sea Guardian) landed at Kanoya Air Base from Hachinohe Air Base for the first time, and took off the next day,” the post said.\nPrior to that, Japan’s Kadena Air Base in Okinawa received another MQ-4C Triton on Jun.\nThe JMSDF Kanoya Air Base, meanwhile, had previously hosted eight U.S. Air Force MQ-9 Reapers from Nov. 2022 to Nov. 2023.\nSecond US Navy MQ-4C Triton arrived at Kadena Air Base in Japan on June 9.", "location": "Kadena Air Base, Okinawa, Japan", "classification": "security", "score": 0.496211505278632, "event_breakdown": "An MQ-9B SeaGuardian UAV (Unmanned Aerial Vehicle) landed at Kanoya Air Base in Japan's Kagoshima Prefecture, the base announced on Jun. 9.\nPrior to the June 9 event, Japan's Kadena Air Base in Okinawa received another MQ-4C Triton on June 6.\nThe JMSDF Kanoya Air Base had previously hosted eight U.S. Air Force MQ-9 Reapers from November 2022 to November 2023."}]