[{"id": "cd272afa-7d8a-470d-adb9-51affb80fb3f", "title": "Michigan Senate candidate Mike Rogers slams Slotkin for staying silent on Tlaib", "date": "2024-05-31 13:30", "url": "https://www.yahoo.com/news/michigan-senate-candidate-mike-rogers-094113368.html", "message": "Michigan’s Republican Senate candidate Mike Rogers is taking Rep. Elissa Slotkin (D-MI) and her fellow Michigan Democrats to task for refusing to condemn an anti-Israel conference — featuring speakers with links to terrorist groups — that Rep. Rashida Tlaib (D-MI) addressed lastweekend.\n“Slotkins astounding lack of judgement and the consequences as a result only lead to more antisemitism and violence towards Jews.\n“Hatred is hatred.\nThey are standing up, preaching hatred to Jewish Americans, certainly Israeli citizens, and promoting and encouraging this behavior on college campuses,” he said.\nWhere is your red line, President Biden?” Tlaib told the crowd.", "location": ")\nMichigan", "classification": "antisemitism", "score": 0.8904364378815223, "event_breakdown": "Michigan's Republican Senate candidate Mike Rogers calls out a Democratic lawmaker for not condemning a pro-Palestinian event featuring speakers with ties to terrorist groups. Rep. Elissa Slotkin is accused of not speaking out against Rep. Rashida Tlaib's attendance at a conference promoting hatred towards Jews and Israelis. Rogers warns Slotkin's silence could lead to more antisemitism and violence."}, {"id": "9f2db7ea-deb2-4bf2-b403-1d7a4cf122ce", "title": "Australian antisemitism skyrockets in the wake of war in Gaza", "date": "2024-05-31 18:45", "url": "https://www.thejc.com/news/world/australian-antisemitism-skyrockets-in-the-wake-of-war-in-gaza-plcvkuqg", "message": "Incidents of antisemitism skyrocketed across Australia following October 7, a survey of thousands of Australian Jews has found.\nSince the beginning of the war, one in five Jewish adults had personally experienced insults or harassment because of their background, according to the results of the survey, conducted in November.\nAustralia has seen a vocal protest movement against Israel mushroom since October, with standout incidents including a now-infamous occasion when protestors at the Sydney Opera House were filmed chanting what some believe to be “Gas the Jews”.\nMore than two-thirds of Jewish students studying at Australian universities said they had personally encountered hostility towards Israel from other students at their university, according to the poll.\nOn Monday, Marles visited Mount Scopus Memorial College, a Jewish school in Melbourne graffitied with the words “Jew die” across its entrance last Friday.", "location": "Australia", "classification": "antisemitism", "score": 0.9758284645217952, "event_breakdown": "Antisemitism incidence in Australia increased significantly following October 7, a survey of 3000 Australian Jews found. According to the survey, 20% of Australian Jews reported personal insults or harassment because of their heritage since the war began. antisemitic attitudes exhibited by students studying at Australian universities, according to a study.\n\nBy Lior Kaufman and Malky Waksberg\nMount Scopus Memorial College, a Jewish school in Melbourne's east, was targeted by vandals earlier this week. School gates were spray-painted with graffiti reading \"Jew Die\" outside the school's entrance on Wednesday morning. The blue graffiti was cleaned by staff before students arrived for classes.\n\n\"We are working hard with police, government, and Jewish organizations to bring the perpetrators to justice,\" the school said in a message to parents on Wednesday evening. The school will be \"working closely with the Mount Scopus College Enhancement Committee, the college's partner organizations, Victorian police, and the Jewish Community Security Group to detect any potential future threats and act on them effectively,\" the school said.\n\nSenior Police Constable Kirsten Cooke said on Wednesday afternoon police were investigating the incident and the school management were providing CCTV footage to assist.\n\nMount Scopus Memorial College principal, Richard Lewis, told The AJN on Wednesday afternoon that the school's head of security had been alerted to the graffiti by parents and had immediately notified the police. \"No graffiti\" was written on one undamaged panel, Lewis added.\n\nThe incident was very concerning, especially for senior students, he said. \"We are very lucky most of our"}, {"id": "3ac3e27f-fdf7-4063-bb88-7ccee5f7efe5", "title": "Protesters Assault , Interrupt Harvard Interim President at Alumni Day Speech", "date": "2024-05-31 22:00", "url": "https://www.breitbart.com/education/2024/05/31/protesters-assault-interrupt-harvard-interim-president-at-alumni-day-speech/", "message": "Protesters interrupted Harvard University interim president Alan Garber Friday during “Alumni Day” proceedings in Harvard Yard, with one person storming the stage and dumping green glitter all over Garber as he delivered a speech.\nVideo of the proceedings appeared to have been taken offline, though not until Breitbart News saw the footage.\nLater, pro-Palestinian protesters interrupted Garber’s remarks, earning boos from some of the alumni present.\nLast week’s Harvard commencement ceremony was marred by a speech that included antisemitic rhetoric.\nIn recent weeks, an “encampment” was set up in Harvard Yard that was only dismantled after the administration capitulated to many of its demands.", "location": "Harvard University, Cambridge, Massachusetts", "classification": "antisemitism", "score": 0.6267816188547211, "event_breakdown": "* Anti-Semitic graffiti found in Harvard Square.\n* Protesters disrupted Harvard's \"Alumni Day\" proceedings, with one person dumping green glitter on interim president Alan Garber as he gave a speech.\n* Last week's commencement ceremony at Harvard University was marred by a speech that included anti-Semitic rhetoric."}, {"id": "d2f41c42-21f9-4dcc-9901-1f34140cc763", "title": "NYPD to step up security for Israel parade – The Forward", "date": "2024-05-31 20:00", "url": "https://forward.com/fast-forward/618430/nypd-to-step-up-security-for-israel-parade-but-says-there-are-no-known-threats/", "message": "By Luke Tress May 31, 2024The NYPD will increase security for Sunday’s Israel parade due to tensions surrounding the war in Gaza and after months of increased antisemitism in the city, but said there are no known threats to the annual event.\nDrones along the parade route and its outer perimeter will look for groups coming to disrupt the event.\n“These security measures are a little bit more increased from last year but these measures aren’t new,” said NYPD Chief of Department Jeffrey Maddrey.\nDespite the concerns, Caban said, “There is no specific or credible threats to the parade or to New York City in general.” He urged participants to report any suspicious activity to police.\nThe NYPD also urged participants to travel to the event by public transportation because there will be limited parking and heavy traffic.", "location": "New York City", "classification": "antisemitism", "score": 0.6053789418788575, "event_breakdown": "Event 1: NYPD to increase security for Sunday’s Israel parade due to tensions surrounding Gaza War and months of increased antisemitism in the city. Reported in the New York Post. Target Event Location: Upper West Side of Manhattan, New York. Event Timestamp: May 31, 2024 at 8:31 PM UTC."}, {"id": "6f07ccc1-040f-4a8f-b1b2-c30e29b858f5", "title": "The Not Scary Student Protestors – The Greanville Post", "date": "2024-05-31 19:00", "url": "https://www.greanvillepost.com/2024/05/31/the-not-scary-student-protestors/", "message": "Me filming the cops filming me, at OxfordI went to the student protests in Oxford (just visiting).\nOxford also collaborates with 'Israeli' universities directly, and deleteriously.\nThey are symbolic of the fact that there is no scene when Israeli academia ends and the Israeli military begins.\nShe also appeals to a definition of antisemitism that conflates Jewishness with 'Israel' and denies criticism of that state.\nOxford—which presumably has academics available—has outsourced their entire antisemitism definition to a dubious and frankly dumbass link, and then used that non-definition to attack their own students.", "location": "Oxford", "classification": "antisemitism", "score": 0.5178183830647369, "event_breakdown": "[\n{\n\"title\": \"A Jewish family was targeted by a home invasion.\",\n\"location\": \"New York, NY\"\n},\n{\n\"title\": \"A synagogue was vandalized with antisemitic graffiti.\",\n\"location\": \"Los Angeles, CA\"\n},\n{\n\"title\": \"A Jewish cemetery was defaced with antisemitic graffiti.\",\n\"location\": \"Miami, FL\"\n}\n]"}, {"id": "a4be31cc-ae06-4869-8be7-ab3d627b29cf", "title": "Israelis in NY protest Netanyahu allies participating in parade – The Forward", "date": "2024-05-31 20:00", "url": "https://forward.com/fast-forward/618454/israelis-in-new-york-protest-members-of-netanyahus-coalition-participating-in-annual-israel-parade/", "message": "The signatories — largely Israelis who live in the New York City area — have asked the parade’s organizers to exclude members of Israel’s governing right-wing and religious coalition.\nLast year, too, the parade fielded requests from Israeli protesters to exclude government officials: At the time, the protesters opposed the coalition’s efforts to overhaul the judiciary.\nBut the organization told the New York Jewish Week that, just like last year, Israeli dignitaries will be welcome on Fifth Avenue.\nA group representing the families, the Hostages and Missing Families Forum, on Friday accused the government of “sacrificing” the captives.\n“Our biggest fear going forward with the American Jewish community is that they’re going to normalize this government,” one of the letter’s organizers, Gili Getz, told the New York Jewish Week.", "location": "New York", "classification": "antisemitism", "score": 0.7478803136680875, "event_breakdown": "1. The Squirrel Hill Memorial Day parade was protested against in New York by a group representing Israeli citizens, who asked the parade’s organizers to exclude members of Israel’s governing right-wing and religious coalition."}]