[{"id": "7fbcd6d2-51ef-4a2a-bd4e-38ce14ed9e53", "title": "Historic tropical cyclone threatens Tanzania with major flooding", "date": "2024-05-04 15:15", "url": "https://www.theweathernetwork.com/en/news/weather/severe/historic-tropical-cyclone-hidaya-threatens-tanzania-with-major-flooding", "message": "Forecast Centre The Weather Network Hidaya is the strongest tropical cyclone ever recorded in the Tanzanian regionDeadly floods across eastern Africa may worsen this weekend after Cyclone Hidaya made landfall in Tanzania on Saturday.\nThe storm, a historic first for this stretch of coastal Africa, could produce 100-200+ mm of rain around the country’s densely populated capital region of Dar es Salaam.\nThe storm made landfall near the Tanzanian capital of Dar es Salaam in the early morning hours on Saturday.\nStrong winds are a secondary threat to the tremendous amount of tropical rainfall that’ll push into the coast through this weekend.\nForecasters expect more than 200 mm of rain to fall around the Dar es Salaam region, which is home to more than 5 million people.", "location": "", "classification": "natural-disasters", "score": 0.976132781595351, "event_breakdown": "- Cyclone Hidaya, the strongest tropical cyclone ever recorded in the Tanzanian region, made landfall near the Tanzanian capital of Dar es Salaam\n- Deadly floods across eastern Africa may worsen after Cyclone Hidaya made landfall in Tanzania, with the potential for 100-200+ mm of rain around the country’s capital region of Dar es Salaam\n- Strong winds are a secondary threat to the tremendous amount of tropical rainfall pushing into the coast through the weekend\n- Forecasters expect more than 200 mm of rain to fall around the Dar es Salaam region, which is home to more than 5 million people"}, {"id": "b3fbce6d-3ea0-4ae5-9e34-68b8b3450b20", "title": "Hurricane Preparedness Week kicks off : Know your risk from wind and water", "date": "2024-05-05 07:15", "url": "https://cbs12.com/news/local/sunday-may-5-2024-hurricane-preparedness-week-kicks-off-know-your-risk-from-wind-and-water", "message": "Hurricane season begins on June 1st and ends on November 30th, but this is not a set-in-stone timeframe.\nThere have been years when tropical systems have developed before the season begins and after the season ends.\nFor South Florida, historically, most of our landfalling hurricanes occur after the climatological peak of the season on September 10.\nYou know what the risks are here in South Florida.\nCheck back all this week on CBS 12 News and CBS 12.com to continue preparing for the upcoming hurricane season.", "location": "South Florida", "classification": "natural-disasters", "score": 0.5564661120346259, "event_breakdown": "1. Hurricane season begins on June 1st and ends on November 30th.\n2. Tropical systems have developed before the season begins and after the season ends in some years.\n3. Historically, most landfalling hurricanes in South Florida occur after September 10, which is the climatological peak of the season.\n4. CBS 12 News and CBS 12.com are providing continuous updates and preparations for the upcoming hurricane season in South Florida."}, {"id": "204ac7ee-67e7-4fe7-bb16-0e9774d64062", "title": "Texas is getting hotter and drier . Here what we can do about it . ", "date": "2024-05-04 20:45", "url": "https://www.dallasnews.com/opinion/commentary/2024/05/04/texas-weather-getting-hotter-plan-ahead/", "message": "Texas summers have become significantly hotter and rainfall is becoming more sporadic, reshaping Texas’ weather patterns.\nThese are just some of the conclusions found in the latest edition of “Future Trends of Extreme Weather in Texas,” a report produced by the Office of the Texas State Climatologist at Texas A&M University in collaboration with Texas 2036.\nAdvertisementUpdated data and analysis in the new report tell us many extreme weather trends continue to accelerate in Texas, posing daunting challenges to Texas’ water supply, flood control and electric power resources.\nTexas’ susceptibility to extreme weather trends should continue to inform state policymakers’ decisions.\nAdvertisementJohn Nielsen-Gammon has served as the Texas state climatologist since 2000.", "location": "", "classification": "natural-disasters", "score": 0.5480490887658597, "event_breakdown": "- Texas summers have become significantly hotter.\n- Rainfall is becoming more sporadic in Texas.\n- Office of the Texas State Climatologist at Texas A&M University in collaboration with Texas 2036 produced a report titled \"Future Trends of Extreme Weather in Texas.\"\n- The report contains updated data and analysis on extreme weather trends in Texas.\n- These extreme weather trends in Texas pose challenges to the state's water supply, flood control, and electric power resources.\n- John Nielsen-Gammon has been the Texas state climatologist since 2000."}, {"id": "2364cc15-8b4e-4db6-a8f1-8e74df62c90e", "title": "Hurricane Preparedness Week 2024", "date": "2024-05-04 00:45", "url": "https://www.wuft.org/weather/2024-05-03/hurricane-preparedness-week-2024", "message": "Sunday May 5th is the first day of the National Oceanic and Atmospheric Admistration (NOAA) National Hurricane Preparedness Week.\nThe start of the 2024 hurricane season less than a month away and there are early indicators of an active year in the tropics.\nOn day one of Hurricane Preparedness week, NOAA is focusing on knowing the risks for your particular area.\nAlso as part of Hurricane Preparedness Week, NOAA is emphasizing the importance of having a plan far in advance of any tropical threats.\nBeing ready for hurricane season takes time.", "location": "NOAA", "classification": "natural-disasters", "score": 0.7517977159427927, "event_breakdown": "- Start of National Hurricane Preparedness Week on Sunday, May 5th, 2024\n- Early indicators of an active year in the tropics for the upcoming 2024 hurricane season\n- Focus on knowing the risks for specific areas on day one of Hurricane Preparedness Week by NOAA\n- Emphasis on the importance of having a plan well in advance of any tropical threats by NOAA during Hurricane Preparedness Week"}, {"id": "64c94e6e-fb7c-42c2-a83c-da65a6b7ad2e", "title": "Watch : Powerful Texas Floodwaters Sweep Semi Away", "date": "2024-05-03 19:00", "url": "https://newstalk1290.com/ixp/175/p/texas-floodwaters-sweep-semi-away/", "message": "But there’s a reason for the saying “turn around, don’t drown.”According to the National Weather Service, more people die from drowning in floodwaters each year than from any other hazard related to thunderstorms.\nGet our free mobile appMany people underestimate the power of floodwaters and fall victim to drowning.\nThe below video is the perfect example of just how powerful floodwaters can be.\nFootage shows the terrifying moment a semi is sucked into flooding on I-59 near Shepherd, Texas.\nKeep reading to discover the 50 of the most expensive climate disasters in recent decades in the U.S. Gallery Credit: KATELYN LEBOFF", "location": "Shepherd, Texas", "classification": "natural-disasters", "score": 0.703013444162502, "event_breakdown": "- A semi is sucked into flooding on I-59 near Shepherd, Texas."}, {"id": "16f23192-5957-4987-af02-78d7c57d7c8e", "title": "Evacuations ordered , homes damaged in Texas after storms spawn tornadoes and send rivers surging to Hurricane Harvey levels - Boston News , Weather , Sports", "date": "2024-05-03 19:45", "url": "https://whdh.com/news/evacuations-ordered-homes-damaged-in-texas-after-storms-spawn-tornadoes-and-send-rivers-surging-to-hurricane-harvey-levels/", "message": "(CNN) — Powerful storms unloaded flooding rainfall that swept away vehicles and triggered evacuations, delivered hail the size of softballs and spun up at least one damaging tornado in Texas Thursday.\nMandatory evacuations due to flooding were also ordered for parts of San Jacinto County and Polk County, with voluntary evacuations for Montgomery County.\nThe repeated bouts of heavy rainfall soaked soils, making many areas extremely prone to both flash and river flooding.\nAs torrential rain flooded eastern Texas, severe thunderstorms spun up tornadoes both north and south of the Abilene area in west Texas.\nThere were “numerous” injuries, but no deaths as of Friday morning, Hawley Police Chief Brad Wilson told CNN.", "location": "Abilene", "classification": "natural-disasters", "score": 0.9457696714764526, "event_breakdown": "- Flooding rainfall in Texas\n- Evacuations in San Jacinto County, Polk County, and Montgomery County\n- Hail the size of softballs\n- Damaging tornado in Texas\n- Severe thunderstorms in Abilene area\n- Injuries in Hawley"}, {"id": "5bff2563-370a-48f9-aa62-b72412adb81f", "title": "Be prepared for Hurricane Season 2024 before it begins June 1", "date": "2024-05-04 12:30", "url": "https://news.wgcu.org/hurricane/2024-05-04/be-prepared-for-hurricane-season-2024-before-it-begins-june-1", "message": "Sunday May 5th is the first day of the National Oceanic and Atmospheric Admistration (NOAA) National Hurricane Preparedness Week.\nThe start of the 2024 hurricane season less than a month away and there are early indicators of an active year in the tropics.\nAnother way to be prepared for hurricane season is by knowing where to go to get high quality weather information for your area or areas that are along your evacuation route.\nIt's not just the National Hurricane Center track forecast for a specific storm that is important.\nBeing ready for hurricane season takes time.", "location": "", "classification": "natural-disasters", "score": 0.9064112411603645, "event_breakdown": "- Sunday May 5th: Start of National Hurricane Preparedness Week by NOAA\n- 2024 hurricane season approaching with early indicators of an active year\n- Importance of knowing where to get high quality weather information for evacuation route\n- Emphasis on the significance of National Hurricane Center track forecast for specific storm\n- Preparation for hurricane season requires time"}, {"id": "2aca3005-ab28-4e26-b1de-620fd824abc2", "title": "Evacuations ordered , homes damaged in Texas after storms spawn tornadoes and send rivers surging to Hurricane Harvey levels", "date": "2024-05-03 19:45", "url": "https://ktvz.com/cnn-weather-environment/2024/05/03/evacuations-ordered-homes-damaged-in-texas-after-storms-spawn-tornadoes-and-send-rivers-surging-to-hurricane-harvey-levels/", "message": "“Due to continuous rainfall across East Texas and rising levels in creeks and rivers, flood levels may increase.\nGreg Abbott expanded the storm-related declarations in response to the flooding, according to a news release.\nThe repeated bouts of heavy rainfall soaked soils, making many areas extremely prone to both flash and river flooding.\nHurricane Harvey created a widespread flooding disaster in Houston after dropping 30 to 40 inches of rain across the entire metro in just 48 hours.\nRainfall totals from flooding in Texas and Louisiana this week showed nearly two feet of rain in five days, according to the National Weather Service.", "location": "Houston", "classification": "natural-disasters", "score": 0.9747096506410732, "event_breakdown": "- Continuous rainfall across East Texas and rising levels in creeks and rivers\n- Greg Abbott expanded storm-related declarations in response to the flooding\n- Soaked soils due to repeated bouts of heavy rainfall, making areas prone to flash and river flooding\n- Hurricane Harvey caused widespread flooding in Houston after dropping 30 to 40 inches of rain within 48 hours\n- Flooding in Texas and Louisiana this week resulted in nearly two feet of rain in five days, according to the National Weather Service."}, {"id": "246bea95-cac6-4a8f-8aaf-816bbce7d9b8", "title": "Houston - area flooding could create new San Jacinto River flood risks", "date": "2024-05-04 15:15", "url": "http://www.houstonchronicle.com/news/houston-texas/environment/article/san-jacinto-river-floodwater-sediment-sand-19437982.php", "message": "Mark Mulligan/Staff photographer Following Hurricane Harvey, crews began an emergency dredging operation in the San Jacinto River West Fork on Thursday, Sept. 20, 2018.\nThe rising water from the West Fork of the San Jacinto River, downstream from Lake Conroe, flooded homes and roads along FM2854.\nYi-Chin Lee/Staff photographer A helicopter flies above the San Jacinto River, that has rose out of its banks in the aftermath of a severe storm on Thursday, May 2, 2024 in Conroe.\nThe rising water from the West Fork of the San Jacinto River, downstream from Lake Conroe, flooded homes and roads along FM2854.\nBrett Coomer/Staff photographerSome Kingwood-area residents are worried that sediment roiling in the flood-ravaged San Jacinto River will create blockages like those that sent floodwater into nearby homes during Hurricane Harvey.", "location": "San Jacinto River, Conroe", "classification": "natural-disasters", "score": 0.8103419912884117, "event_breakdown": "- Emergency dredging operation begins in the San Jacinto River West Fork after Hurricane Harvey (Sept. 20, 2018)\n- Flooding of homes and roads along FM2854 due to rising water from the West Fork of the San Jacinto River downstream from Lake Conroe (date not specified)\n- Helicopter flies above the San Jacinto River as it overflows after a severe storm in Conroe (May 2, 2024)\n- Concerns raised by Kingwood-area residents about sediment roiling in the flood-ravaged San Jacinto River potentially causing blockages and flooding similar to Hurricane Harvey (date not specified)"}, {"id": "0b417a10-755b-4b36-8a14-626b5006e434", "title": "As climate change threatens cemeteries , states look to Louisiana for help", "date": "2024-05-04 00:45", "url": "https://www.wwno.org/coastal-desk/2024-05-03/as-climate-change-threatens-cemeteries-states-look-to-louisiana-for-help", "message": "As climate change increases the likelihood of weather-related disasters, many other states are now grappling with damaged cemeteries.\nLouisiana's cemetery task forceThe flooding that damaged Dalfrey’s family members’ graves in 2016 affected more than 800 graves in 74 cemeteries across Louisiana.\nAfter that event, the Louisiana Cemetery Response Task Force was created.\n“We are the only state that has that,” says Ryan Seidemann, the task force chairman.\nThe task force is activated when there has been a disaster declaration and reports of cemetery damage.", "location": "", "classification": "natural-disasters", "score": 0.8322632931484822, "event_breakdown": ""}, {"id": "b398991c-b9ca-46b2-b33a-4135eff323ef", "title": "San Jacinto River Authority explains release of Lake Conroe water", "date": "2024-05-05 05:45", "url": "https://www.fox26houston.com/news/san-jacinto-river-authority-explains-release-lake-conroe", "message": "Some homeowners are raising concerns that water releases from Lake Conroe are making flooding worse.\nThe homeowners expressed their frustrations to FOX 26 Houston about the San Jacinto River Authority releasing water into the San Jacinto River which is now flooding.\nRELATED: Houston flooding: Water rescues in the Cleveland, Huffman area\"Where that water is flowing out from my yard and the yard next to it.\nThe San Jacinto River Authority said in 2017 during Hurricane Harvey, the inflow into Lake Conroe was about 130,000 cubic feet per second.\n\"Our primary goal is to protect our dam,\" said Aubrey Spear, the general manager of the San Jacinto River Authority.", "location": "", "classification": "natural-disasters", "score": 0.7117227540105767, "event_breakdown": "- Homeowners raise concerns about water releases from Lake Conroe causing flooding\n- Homeowners express frustrations to FOX 26 Houston about San Jacinto River Authority's water releases\n- San Jacinto River Authority releases water into San Jacinto River, leading to flooding\n- Water flowing from yards due to water releases\n- San Jacinto River Authority's goal to protect the dam during Hurricane Harvey in 2017"}, {"id": "fe484992-2b9d-4e7a-b5fb-1dd049828bc2", "title": "No Evidence to Support Claims Climate Change Causing More Tornadoes , Hurricanes", "date": "2024-05-03 18:30", "url": "https://pjmedia.com/marktapscott/2024/05/03/no-evidence-to-support-claims-climate-change-causing-more-tornados-hurricanes-n4928743", "message": "Every year around this time, the Mainstream Media is filled with claims from \"experts\" who tell us that there are more tornadoes, hurricanes, blizzards, and every other form imaginable of severe weather, thanks to climate change.\nThe drone shots of the flattened downtown of Sulphur, Okla., demonstrate that severe weather is a seriously damaging and dangerous phenomenon.\n• However, many types of extreme weather show no signs of increasing and in some cases are decreasing.\n\"While media and political activists assert that the evidence for increasing harms from increasing extreme weather is iron-clad, it is anything but.\nSo the next time somebody tells you climate change is causing more severe weather, point them to these two studies and encourage them to stop letting climate agitpropsters in the mainstream media do their thinking for them.", "location": "Sulphur, Oklahoma", "classification": "natural-disasters", "score": 0.5928503940833549, "event_breakdown": "Events:\n\n1. Mainstream Media claims of increased severe weather due to climate change.\n2. Drone shots of flattened downtown in Sulphur, Oklahoma, demonstrating the damaging and dangerous nature of severe weather.\n3. Some types of extreme weather show no signs of increasing and may even be decreasing.\n4. Assertion that evidence for increasing harms from extreme weather is not iron-clad.\n5. Mention of two studies contradicting the claim that climate change causes more severe weather.\n6. Encouragement to stop relying on mainstream media for thinking about climate change."}, {"id": "952c8cbd-9e34-4051-b887-10ac5b809487", "title": "Houston weather updates : Flood threat persists as rivers swell", "date": "2024-05-04 15:15", "url": "http://www.houstonchronicle.com/news/houston-weather/article/houston-flooding-weather-updates-19438274.php", "message": "Raquel Natalicchio/Staff photographer Severe flooding is seen on Idle Glen Roadway on Saturday, May 4, 2024, in New Caney.\nJason Fochtman/Staff photographer Homes are inundated due to severe flooding on Saturday, May 4, 2024, in Channelview.\nRaquel Natalicchio/Staff photographer A neighborhood is seen inundated due to severe flooding on Saturday, May 4, 2024, in Channelview.\nThe West Lake Houston Parkway Bridge connecting Kingwood and Atascocita is closed due to high water on both sides of the bridge.\nHarris County Judge Lina Hidalgo said the surge of flood water heading toward Lake Houston remains unpredictable.", "location": "Channelview", "classification": "natural-disasters", "score": 0.7179124327787351, "event_breakdown": "1. Severe flooding on Idle Glen Roadway in New Caney on May 4, 2024.\n2. Homes inundated due to severe flooding in Channelview on May 4, 2024.\n3. Neighborhood inundated due to severe flooding in Channelview on May 4, 2024.\n4. West Lake Houston Parkway Bridge connecting Kingwood and Atascocita closed due to high water on both sides on May 4, 2024.\n5. Harris County Judge Lina Hidalgo stating the surge of floodwater heading toward Lake Houston remains unpredictable."}, {"id": "aafcf4c9-02fe-48cf-a2c4-d7ca70d3f59e", "title": "Brazilians wait on their roofs to be rescued by the military as death toll rises to 57 in record - breaking floods that have made thousands homeless", "date": "2024-05-04 17:30", "url": "https://www.dailymail.co.uk/news/article-13382893/Brazil-death-toll-rises-57-floods-thousands-homeless.html", "message": "Record breaking floods in Brazil have left thousands homeless, with people having to be rescued from their roofs by the military.\nFootage showed residents hit by downpours receiving help as the country faced its worst flooding in 80 years.\nLocal authorities in Brazil's southernmost state of Rio Grande do Sul said that floods had so far claimed 56 lives as of Saturday afternoon, with dozens still yet to be accounted for.\nHeavy rains had already hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers.", "location": "Rio Grande do Sul", "classification": "natural-disasters", "score": 0.9136144202515915, "event_breakdown": "- Record-breaking floods in Brazil leaving thousands homeless\n- People being rescued from their roofs by the military\n- Footage showing residents hit by downpours receiving help\n- Brazil facing its worst flooding in 80 years\n- Local authorities in Brazil's state of Rio Grande do Sul reporting 56 lives lost due to floods\n- Dozens of people still unaccounted for in the floods\n- Heavy rains hitting Rio Grande do Sul last September, causing floods that killed over 50 people\n- Persistent drought in Brazil for over two years due to the La Nina phenomenon"}, {"id": "2edbd9f4-0eda-4fc1-a726-a666615d1087", "title": "Rising death toll from rains in Brazil as floods destroy roads and bridges", "date": "2024-05-04 21:00", "url": "https://www.irishtimes.com/world/americas/2024/05/04/rising-death-toll-from-rains-in-brazil-as-floods-destroy-roads-and-bridges/", "message": "The death toll from rains in Brazil’s southernmost state of Rio Grande do Sul rose to 57, local authorities said on Saturday afternoon, while dozens still have not been accounted for.\nFloods destroyed roads and bridges in several regions of the state.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nHeavy rains had hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers.", "location": "Porto Alegre, Rio Grande do Sul", "classification": "natural-disasters", "score": 0.9286899909770298, "event_breakdown": "- Death toll from rains in Brazil’s southernmost state of Rio Grande do Sul rises to 57\n- Floods destroy roads and bridges in several regions of the state\n- Guaiba lake in Porto Alegre breaks its banks, flooding streets\n- Heavy rains hit Rio Grande do Sul in September, causing floods that killed more than 50 people"}, {"id": "22f7cb95-867c-45a9-a2b9-10995441d5b6", "title": "Death toll from rains in southern Brazil climbs to 57 , some 70 still missing", "date": "2024-05-04 18:45", "url": "https://www.swissinfo.ch/eng/death-toll-from-rains-in-southern-brazil-climbs-to-57%2c-some-70-still-missing/76910115", "message": "Heavy rains in southern Brazil kill nearly 60, over 70 still missing2 minutesSAO PAULO (Reuters) -Heavy rains in Brazil’s southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities’ authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "Bento Goncalves", "classification": "natural-disasters", "score": 0.7463719227111398, "event_breakdown": "- Heavy rains in southern Brazil kill nearly 60, over 70 still missing\n- Flooding in Porto Alegre, the capital of Rio Grande do Sul"}, {"id": "53166589-7d0e-4093-a8f4-a416ecb66b10", "title": "Death toll from rains in southern Brazil climbs to 57 , some 70 still missing", "date": "2024-05-04 19:00", "url": "https://gazette.com/news/us-world/death-toll-from-rains-in-southern-brazil-climbs-to-57-some-70-still-missing/article_7254bb8e-f2ad-5d42-a10f-9a99b98bb5de.html", "message": "SAO PAULO (Reuters) -Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "Bento Goncalves", "classification": "natural-disasters", "score": 0.6889372817057625, "event_breakdown": "- **Rio Grande do Sul, Brazil**: Heavy rains in the southernmost state killed at least 55 people, with dozens still unaccounted for.\n- **Bento Goncalves, Brazil**: A second dam in the city is at risk of collapsing, according to local authorities.\n- **Porto Alegre, Brazil**: The Guaiba lake broke its banks, causing flooding in the streets.\n"}, {"id": "2bbc2d93-1cea-4681-8a48-b1ccdf417daf", "title": "Drought to deluge : East Africa bears brunt of climate change", "date": "2024-05-03 21:00", "url": "https://www.stripes.com/theaters/africa/2024-05-03/drought-deluge-climate-change-africa-13743831.html", "message": "(Patrick Meinhardt/Bloomberg)East Africa is bracing for more floods, as torrential rain after years of drought deliver a reminder of the threat created by climate change.\nWhile it takes time to evaluate the impact of climate change on heavier rainfall, scientists have found that warmer air holds more water.\nThe same research group also found that climate change exacerbated deadly flooding that hit West Africa in 2022.\n“Sadly, we have not seen the last of this perilous period, as the situation is expected to escalate.”Even after the flooding abates, East Africans will continue to feel the effects through higher food prices.\nKenyan inflation cooled to 5% year-on-year in April compared with 5.7% in the prior month as energy and food prices eased, but the flooding puts that at risk.", "location": "", "classification": "natural-disasters", "score": 0.7940172805702799, "event_breakdown": "- East Africa: Torrential rain after years of drought has led to floods.\n- West Africa: Deadly flooding hit the region in 2022.\n- Kenya: Kenyan inflation was at 5% year-on-year in April compared with 5.7% in the prior month, influenced by energy and food prices."}, {"id": "ea70d658-be28-45dc-968c-e1813817c23a", "title": "Flooding death toll in Brazil climbs to 57 , dozens missing", "date": "2024-05-04 19:00", "url": "https://www.voanews.com/a/flooding-death-toll-in-brazil-climbs-to-57-dozens-missing-/7598067.html", "message": "The death toll from rains in Brazil's southernmost state of Rio Grande do Sul rose to 57, local authorities said Saturday afternoon, while dozens still have not been accounted for.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaíba River broke its banks, flooding streets.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rain and others of drought.\nHeavy rains had already hit Rio Grande do Sul last September, as an extratropical cyclone caused floods that killed more than 50 people.\nThat came after more than two years of a persistent drought due to the La Nina phenomenon, with only scarce showers.", "location": "Porto Alegre", "classification": "natural-disasters", "score": 0.9822889221162177, "event_breakdown": ""}, {"id": "b85a1e2f-7002-4522-9ba8-eb9d81dc65e7", "title": "Houston braces for flooding to worsen in wake of storms", "date": "2024-05-04 20:45", "url": "https://indianexpress.com/article/world/houston-braces-for-flooding-to-worsen-in-wake-of-storms-9308379/", "message": "A stranded care is seen near the bridge over Lake Houston along West Lake Houston Parkway after it was closed due to high water on either side of the thoroughfare, Saturday, May 4, 2024, in Kingwood, Texas.\n(Jason Fochtman/Houston Chronicle via AP)The water could be seen flowing into parts of the couple’s subdivision.\nHOUSTON IS ONE OF THE MOST FLOOD-PRONE METRO AREAS IN THE USAuthorities in Houston had not reported any deaths or injuries.\n(Jason Fochtman/Houston Chronicle via AP)Most of Houston’s city limits were not heavily impacted by the weather.\nThe greater Houston area covers about 10,000 square miles (about 25,900 square kilometers) — a footprint slightly bigger than New Jersey.", "location": "Kingwood, Texas", "classification": "natural-disasters", "score": 0.4087135199622912, "event_breakdown": "1. A stranded car is seen near the bridge over Lake Houston along West Lake Houston Parkway in Kingwood, Texas, due to high water on either side of the thoroughfare.\n2. Water is seen flowing into parts of a couple's subdivision in Houston, Texas.\n3. Houston is reported as one of the most flood-prone metro areas in the US.\n4. Authorities in Houston have not reported any deaths or injuries.\n5. Most of Houston's city limits were not heavily impacted by the weather.\n6. The greater Houston area covers about 10,000 square miles, slightly bigger than New Jersey."}, {"id": "e4413aff-de22-46dd-8cd1-bc74fdccaf24", "title": "Evacuations ordered , homes damaged in Texas as rivers rise to Hurricane Harvey level", "date": "2024-05-04 03:45", "url": "https://www.thepacket.ca/evacuations-ordered-homes-damaged-in-texas-as-rivers-rise-to-hurricane-harvey-level/", "message": "CNN—Severe storms and heavy rains have intensified flooding in Texas, sweeping away vehicles, damaging homes and prompting evacuations.\n“As rain continues to fall across East Texas and creeks and rivers rise, flood levels may increase.\nParts of East Texas have received three to seven times the normal rainfall over the past three to four weeks.\nRepeated heavy rains have soaked the soil, leaving many areas highly prone to both flash and river flooding.\nTornadoes with severe thunderstorms moved north and south of the Abilene area in West Texas as heavy rain left East Texas flooded.", "location": "", "classification": "natural-disasters", "score": 0.9684028511981808, "event_breakdown": ""}, {"id": "851a8b78-8feb-4e90-9a9d-82afd1086113", "title": "La Niña wrath could mean drought conditions , stronger hurricanes in Georgia this summer", "date": "2024-05-03 18:45", "url": "https://www.yahoo.com/news/la-ni-wrath-could-mean-174156390.html", "message": "The effects of weather occurrences El Niño and La Niña have made their way to Georgia.\nWhat is El Niño and La Niña exactly?\nThe El Niño pattern of weather results in warmer ocean temperatures while its counterpart, La Niña, produces colder ocean temperatures.\nEl Niño and La Niña are opposite phases of a naturally occurring climate pattern collectively known as the El Niño-Southern Oscillation (ENSO).\nAccording to Vox climate coverage, the outgoing El Niño event has been among the strongest the Earth has ever experienced.", "location": "", "classification": "natural-disasters", "score": 0.3881535141916211, "event_breakdown": "- Effects of El Niño and La Niña in Georgia\n    - El Niño pattern results in warmer ocean temperatures\n    - La Niña pattern produces colder ocean temperatures\n    - El Niño and La Niña are opposite phases of the El Niño-Southern Oscillation (ENSO)\n    - Outgoing El Niño event reported as one of the strongest ever experienced on Earth"}, {"id": "48e61125-e1b2-43f6-9280-83771d05f6ae", "title": "Heavy rains over Texas have led to water rescues , school cancellations and orders to evacuate", "date": "2024-05-03 19:00", "url": "https://www.newsday.com/news/nation/Flooding-Texas-Houston-rain-v97032", "message": "HOUSTON — Heavy storms slammed the Houston area again Friday, widening already dangerous flooding in Texas and leading to numerous high-water rescues, including some from the rooftops of flooded homes.\nThere had already been at least two dozen water rescues in the county, in addition to getting 30 pets to safety.\nFor weeks, drenching rains in Texas and parts of Louisiana have filled reservoirs and saturated the ground.\nIn Polk County, located about 100 miles (160 kilometers) northeast of Houston, officials have done over 100 water rescues in the past few days, said Polk County Emergency Management Coordinator Courtney Comstock.\nThe greater Houston area covers about 10,000 square miles — a footprint slightly bigger than New Jersey.", "location": "", "classification": "natural-disasters", "score": 0.8337779467588178, "event_breakdown": "- Heavy storms slam Houston area, causing dangerous flooding\n- Numerous high-water rescues, including from rooftops of flooded homes in Houston\n- At least two dozen water rescues in the county\n- Getting 30 pets to safety\n- Drenching rains in Texas and parts of Louisiana filling reservoirs and saturating the ground\n- Over 100 water rescues in Polk County, located about 100 miles northeast of Houston"}, {"id": "58fa8471-1088-4099-bec5-c2a61cc64f49", "title": "The science behind why the world is getting wetter", "date": "2024-05-05 10:00", "url": "https://www.livemint.com/science/the-science-behind-why-the-world-is-getting-wetter-11714901298593.html", "message": "The powerful downpours are the result of natural weather patterns being supercharged by a record-breaking year for global temperatures.\nAs the globe gets hotter, it is getting wetter too.\nRecord rainfall totaling 17 inches across the month inundated Guangdong province, in southern China, where on Monday a section of a highway collapsed in a mountainous area, killing 48 people.\nThere have been 10 straight months of record-breaking global average atmospheric temperatures, and 12 consecutive months of record global average ocean temperatures.\nRecord rainfall hit the island, the miner said.", "location": "", "classification": "natural-disasters", "score": 0.4206738265011853, "event_breakdown": "- Record-breaking global temperatures leading to powerful downpours\n- Record rainfall in Guangdong province, China causing a highway collapse and resulting in 48 deaths\n- 10 straight months of record-breaking global average atmospheric temperatures\n- 12 consecutive months of record global average ocean temperatures\n- Record rainfall on an island"}, {"id": "a3d11753-8dc7-4b33-9d0c-d0e169b4e5da", "title": "Inside abandoned ghost town at Fukushima after nuclear power plant meltdown", "date": "2024-05-05 08:30", "url": "https://www.mirror.co.uk/news/weird-news/inside-abandoned-ghost-town-fukushima-32696396", "message": "Tokyo Matilda, a 20-year-old from Sheffield, England, embarked on a mission to delve into this deserted ghost town of Fukushima in Japan.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)While visiting the disaster site, Tokyo explored a theme park, a school and even a ramen café that have all been empty since 2011.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)The danger of radiation poisoning was a very real risk for Tokyo as she explored the many sights.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)‌The Fukushima disaster took place when three of the six nuclear reactors in the power plant suffered damage to their core after the 9.1 magnitude earthquake and following tsunami.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)In turn, they began releasing hydrogen and deadly toxic radiation into the surrounding environment and causing a huge hydrogen explosion that impeded immediate shutdown and rescue efforts.", "location": "Fukushima", "classification": "natural-disasters", "score": 0.5451493068351129, "event_breakdown": "- Matilda, a 20-year-old from Sheffield, England, explored the deserted ghost town of Fukushima, Japan.\n- Tokyo Matilda explored a theme park, a school, and a ramen café that have been empty since 2011 in Fukushima.\n- The danger of radiation poisoning was a risk for Tokyo during her exploration.\n- The Fukushima disaster occurred when three of the six nuclear reactors in the power plant suffered core damage after a 9.1 magnitude earthquake and subsequent tsunami.\n- The damaged reactors released hydrogen and toxic radiation into the surrounding environment, leading to a hydrogen explosion that hindered immediate shutdown and rescue efforts."}, {"id": "653dd0be-88c7-4250-bb75-c948715b06c6", "title": "Commentary : Climate challenges at the nation most expensive home", "date": "2024-05-05 11:30", "url": "https://www.orlandosentinel.com/2024/05/05/commentary-climate-challenges-at-the-nations-most-expensive-home/", "message": "Scientists have confirmed Hurricane Ian’s destructive power was exacerbated by climate change, leading to heavier rains, more powerful winds and a higher storm surge.\nThe 100 Bay property epitomizes the complexities facing buyers in today’s emerging climate-aware market.\nIn 2024, we can now scientifically attribute whether damaging weather events were made more likely or more damaging due to climate change.\nThe stunning property at 100 Bay Road should be enjoyed for generations to come, but its future is jeopardized by climate change.\nThis opinion piece was distributed by The Invading Sea website (www.theinvadingsea.com), which posts news and commentary on climate change and other environmental issues affecting Florida.", "location": "", "classification": "natural-disasters", "score": 0.8435153293463538, "event_breakdown": "- Hurricane Ian's destructive power confirmed to be exacerbated by climate change\n- 100 Bay Property complexities facing buyers in climate-aware market\n- Scientific attribution of weather events to climate change in 2024\n- Future of stunning property at 100 Bay Road jeopardized by climate change\n- Opinion piece distributed by The Invading Sea website on climate change and environmental issues in Florida"}, {"id": "7ab12717-80fe-4068-9843-e0331d6ec033", "title": "Earthquake Felt In Edmond On Saturday", "date": "2024-05-05 01:30", "url": "http://www.news9.com/story/663639242f0aca064a01f4a7/earthquake-felt-in-edmond-on-saturday", "message": "As the winter storm moved into the metro this weekend, many people in Oklahoma City and Edmond felt more than a cold front.\nHolle says following an earthquake event, his office receives calls from customers about earthquake coverage.\nHe says while it’s not part of the homeowner’s standard policy, earthquake insurance is available as an endorsement or a stand-alone policy.\nInformation from the OID website says earthquake insurance covers repairs needed because of earthquake damage to your home and that an Oklahoma homeowner can expect to pay $50 to $300 per year for earthquake coverage.\nReview your earthquake coverage to understand what is not covered or speak to your agent.", "location": "", "classification": "natural-disasters", "score": 0.854004538999643, "event_breakdown": "- Winter storm in Oklahoma City and Edmond, Oklahoma, causing more than just a cold front.\n- Holle's office received calls from customers about earthquake coverage following an earthquake event.\n- Earthquake insurance is not part of a standard homeowner’s policy but is available as an endorsement or stand-alone policy.\n- The Oklahoma Insurance Department (OID) website provides information on earthquake insurance, stating that it covers repairs due to earthquake damage to a home.\n- The cost of earthquake insurance in Oklahoma ranges from $50 to $300 per year.\n"}, {"id": "29b7ef0a-1b15-41bf-99bf-5bd76cb4f0b7", "title": "High winds to rip across interior West and High Plains , generating difficult travel and a high fire risk", "date": "2024-05-04 17:30", "url": "https://www.yahoo.com/news/high-winds-rip-across-interior-153109163.html", "message": "\"Winds may become strong enough to cause property damage, knock over trees and bring down power lines from Sunday to Monday from the Rockies to the High Plains,\" AccuWeather Senior Meteorologist Alex Sosnowski said.\nAccuWeather's experts say wind gusts of 40-60 mph will sweep across the Southwestern states through the weekend before reaching the High Plains by Monday.\n\"These winds will make for difficult travel as areas of blowing dust could reduce visibility for drivers across the region,\" AccuWeather Senior Meteorologist Dan Pydynowski said.\nBy Monday, I-90 and I-94 will be buffeted by strong south-to-southeasterly winds, which can again make for tough travel, according to Pydynowski.\nThe region is expected to face a high to extreme risk of significant fires this year, especially through the month of June.", "location": "", "classification": "natural-disasters", "score": 0.6108526826141208, "event_breakdown": "- Strong winds may cause property damage, knock over trees, and bring down power lines from the Rockies to the High Plains from Sunday to Monday.\n- Wind gusts of 40-60 mph will sweep across the Southwestern states through the weekend before reaching the High Plains by Monday.\n- Difficult travel conditions due to blowing dust reducing visibility for drivers across the region.\n- Strong south-to-southeasterly winds expected to buffet I-90 and I-94 by Monday, causing challenging travel conditions.\n- High to extreme risk of significant fires in the region, especially through the month of June."}, {"id": "d9c31756-755c-48b6-8d41-967f1b4f3369", "title": "Heavy winds and rain damage homes and cause more flooding in Tanzania", "date": "2024-05-05 08:45", "url": "https://www.africanews.com/2024/05/05/heavy-winds-and-rain-damage-homes-and-cause-more-flooding-in-tanzania/", "message": "Heavy rains and strong winds have caused damage and more flooding as Cyclone Hidaya lashed Tanzania over the weekend.\nA major blackout hit most of the country on Saturday as it braced for the tropical cyclone which came following weeks of flooding in the region which has left over 150 people dead.\nThe weather service says more than usual amounts of rainfall were recorded in coastal areas overnight Friday, and forecasters warned flooding across the region may worsen this weekend.\nHeavy rain and flooding has caused chaos on the roads and for small businesses, with authorities saying more than 200 thousand people have been affected.\nHidaya is reportedly the strongest tropical cyclone ever recorded in Tanzania", "location": "Tanzania", "classification": "natural-disasters", "score": 0.9864960050913574, "event_breakdown": "- Heavy rains and strong winds cause damage and flooding as Cyclone Hidaya hits Tanzania\n- Major blackout hits the country as it prepares for the cyclone\n- More than usual amounts of rainfall recorded in coastal areas overnight Friday\n- Forecasters warn of worsening flooding across the region\n- Heavy rain and flooding leads to chaos on roads and for small businesses\n- Authorities report over 200 thousand people affected by the storms\n- Cyclone Hidaya is the strongest tropical cyclone ever recorded in Tanzania"}, {"id": "ed1249d4-9406-4adf-a5f1-fa5c4efa83e8", "title": "  The water is coming this way : Mayor Whitmire visits Kingwood ahead of  peak  flooding as concerns pour in", "date": "2024-05-04 01:15", "url": "https://www.click2houston.com/news/local/2024/05/03/watch-live-mayor-whitmire-updates-the-flooding-situation-in-kingwood/", "message": "HOUSTON – Houston Mayor John Whitmire visited Houston Fire Station 102 in Kingwood to provide the latest updates as we move into the night, which he says is considered the “peak” of the flooding.\nAs clear skies shine in the Kingwood area, Whitmire urged residents in the area not to take the tame conditions as a sign that the flooding won’t be significant.\n“I think we have to guard against any false impression that we have been cleared,” Whitmire said.\nHeavy thunderstorms pounded the Houston area Thursday and made their presence known with gusty winds, lots of lightning, and very heavy rainfall.\nSeveral videos from Kingwood yesterday illustrated the hectic flooding conditions that are already plaguing the area.", "location": "Houston, Texas", "classification": "natural-disasters", "score": 0.7800128394897292, "event_breakdown": "- Houston Mayor John Whitmire visits Houston Fire Station 102 in Kingwood to provide flood updates\n- Mayor Whitmire warns residents in Kingwood not to underestimate the potential severity of the flooding\n- Heavy thunderstorms with gusty winds, lightning, and heavy rainfall hit the Houston area\n- Videos from Kingwood show flooding conditions in the area"}, {"id": "4049dd60-ad88-45fe-9816-12b19a1e8296", "title": "Four hikers drown after heavy rains in Iraq - Newspaper", "date": "2024-05-04 03:45", "url": "https://www.dawn.com/news/1831361/four-hikers-drown-after-heavy-rains-in-iraq", "message": "SULAIMANIYAH: Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday.\n“Four members of a hiking team drowned because of heavy rains and flooding in Awaspi village”, in Qaradah district, local official Rouf Kamal said.\nCivil defence spokesperson Aram Ali confirmed the toll, and said eight other hikers survived the incident south of Sulaimaniyah, the autonomous Kurdistan region’s second city.\nHe said a weather warning had been issued on Thursday, with hikers in particular urged to avoid mountainous areas.\nHeavier than usual rainfall has caused flooding in several parts of Iraq, especially the north, and some roads in Kurdistan region capital Arbil were blocked.", "location": "SULAIMANIYAH", "classification": "natural-disasters", "score": 0.5981296915849998, "event_breakdown": "- Four hikers killed in floods in Awaspi village, Qaradah district, Sulaimaniyah region, northern Iraq\n- Eight hikers survived the flooding incident south of Sulaimaniyah\n- Weather warning issued on Thursday urging people to avoid mountainous areas\n- Heavier than usual rainfall causing flooding in several parts of Iraq\n- Some roads in Kurdistan region capital Arbil blocked due to flooding"}, {"id": "42fdd664-4b11-4357-b6c4-ba30b85d72c9", "title": "Global Coastal Hurricane Conditions Intensify Due to Warming Temperatures", "date": "2024-05-04 09:15", "url": "https://www.natureworldnews.com/articles/61561/20240504/global-coastal-hurricane-conditions-intensify-due-warming-temperatures.htm", "message": "The latest report raised concerns about the intensifying global hurricane conditions due to climate change and warming temperatures.\nUnderstanding hurricane impacts is essential for better weather prediction and forecasts, particularly for vulnerable communities.\nClimate change, which is increasing due to greenhouse gas emissions, can result in alarming concerns.\nResearchers, led by experts from the Department of Energy's Pacific Northwest National Laboratory, raised concerns that coastal hurricanes have intensified faster due to changing coastal conditions since 1979, particularly the nearshore hurricanes.\nThe study findings can help decision-makers, weather agencies, and forecasters better predict weather amidst the concerns of climate change and global warming.", "location": "", "classification": "natural-disasters", "score": 0.6381058390154422, "event_breakdown": ""}, {"id": "54fc2e80-ea76-4ae5-a593-7ff166c434f2", "title": "Houston flooding : Severe weather , heavy rain pummels Texas ; some facing  life - threatening  flood conditions", "date": "2024-05-03 19:45", "url": "https://abc7chicago.com/houston-flooding-severe-weather-heavy-rain-pummels-texas-some-facing-life-threatening-flood-conditions/14760639/", "message": "Numerous flash flood warnings are in effect, as up to 8 inches of rain has already fallen in some parts of southeastern Texas Thursday.\nNumerous flash flood warnings are in effect, as up to 8 inches of rain has already fallen in some parts of southeastern Texas Thursday.\nNumerous flash flood warnings are in effect, as up to 8 inches of rain has already fallen in some parts of southeastern Texas Thursday.\nNumerous flash flood warnings are in effect, as up to 8 inches of rain has already fallen in some parts of southeastern Texas Thursday.\nHOUSTON -- The Houston area is facing \"life-threatening\" flood conditions, officials warned, as severe weather pummels parts of Texas.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.718132003470643, "event_breakdown": ""}, {"id": "5d0f1e93-0650-465b-9e6e-7b3e9d940be9", "title": "Iraq rainstorm flooding kills hikers : officials", "date": "2024-05-03 19:30", "url": "https://www.al-monitor.com/originals/2024/05/iraq-rainstorm-flooding-kills-hikers-officials", "message": "May 3, 2024 — Sulaimaniyah (AFP)Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday, local officials told AFP.\n\"Four members of a hiking team drowned because of heavy rains and flooding in Awaspi village\" in Qaradah district, local official Rouf Kamal said.\nHe said a weather warning had been issued on Thursday, with hikers in particular urged to avoid mountainous areas.\nHeavier than usual rainfall has caused flooding in several parts of Iraq, especially the north, and some roads in Kurdistan region capital Arbil were blocked.\nIraq has suffered four consecutive years of drought, with irregular rainfall badly affecting water resources, forcing many farmers to abandon their land.", "location": "Awaspi village, Qaradah district", "classification": "natural-disasters", "score": 0.8049389459029077, "event_breakdown": "- Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday, May 3, 2024.\n- Four hikers drowned because of heavy rains and flooding in Awaspi village in the Qaradah district, according to local official Rouf Kamal.\n- A weather warning had been issued on Thursday, advising hikers to avoid mountainous areas due to heavy rain.\n- Heavier than usual rainfall caused flooding in several parts of Iraq, particularly in the north, with some roads in the Kurdistan region's capital, Arbil, being blocked.\n- Iraq has experienced four consecutive years of drought, with irregular rainfall affecting water resources, leading many farmers to abandon their land."}, {"id": "4f17224c-b0ee-46e5-ad0a-f839c6a6e37f", "title": "Warning issued for parts of Utah ahead of  significant  late season winter storm", "date": "2024-05-04 17:00", "url": "https://www.ksl.com:443/article/51001703/warning-issued-for-parts-of-utah-ahead-of-significant-late-season-winter-storm--", "message": "The National Weather Service issued a winter storm warning for the Wasatch and western Uinta mountains ahead of a \"significant late season storm\" that could dump as much as 1 to 2 feet in parts of the region between Sunday and Tuesday.\nStorm timingThe storm is expected to follow a much smaller system that delivered a few inches of mountain snow Friday morning.\nA significant late season winter storm is expected to impact Utah from Sunday through Tuesday.\nSignificant mountain snow across northern Utah is expected through this time, with the heaviest period anticipated on Sunday.\nThe storm will bring a mix of rain and thunderstorms in the valleys, while snow will fall in the mountains.", "location": "Wasatch and western Uinta mountains, Utah", "classification": "natural-disasters", "score": 0.908780029703242, "event_breakdown": "- The National Weather Service issued a winter storm warning for the Wasatch and western Uinta mountains\n- Significant late season winter storm expected to impact Utah from Sunday through Tuesday\n- Storm timing: much smaller system delivered a few inches of mountain snow Friday morning\n- Significant mountain snow across northern Utah expected with heaviest period on Sunday\n- Mix of rain and thunderstorms in valleys, while snow will fall in the mountains"}, {"id": "54e2d8f1-4df3-43db-bf56-250f51d6e66d", "title": "Houston area braces for flooding to worsen following storms", "date": "2024-05-04 10:00", "url": "https://www.houstonpublicmedia.org/npr/2024/05/04/1249155625/houston-flooding-storms/", "message": "Texas Parks & Wildlife Department game wardens use a boat to rescue residents from floodwaters in Liberty County, Texas, on Saturday.\nHOUSTON — High waters flooded neighborhoods around Houston on Saturday following heavy rains that have already resulted in crews rescuing more than 400 people from homes, rooftops and roads engulfed in murky water.\n\"It's going to keep rising this way,\" said Miguel Flores Jr., of the northeast Houston neighborhood of Kingwood.\nFloodwaters partially submerged cars and roads this week across parts of southeastern Texas, north of Houston, reaching the roofs of some homes.\nThe greater Houston area covers about 10,000 square miles (25,900 square kilometers) — a footprint slightly bigger than New Jersey.", "location": "Liberty County, Texas", "classification": "natural-disasters", "score": 0.4940747444333297, "event_breakdown": "- Texas Parks & Wildlife Department game wardens use a boat to rescue residents from floodwaters in Liberty County, Texas, on Saturday.\n- High waters flood neighborhoods around Houston, Texas, on Saturday, leading to rescues of more than 400 people from homes, rooftops, and roads.\n- Floodwaters partially submerge cars and roads across parts of southeastern Texas, north of Houston, reaching the roofs of some homes.\n- Miguel Flores Jr., a resident of the northeast Houston neighborhood of Kingwood, notes that the floodwaters are expected to keep rising.\n"}, {"id": "e0d4ab1a-1563-4fc6-bc56-5448bc2ee60e", "title": "Entergy Update : 10 : 00 am Saturday", "date": "2024-05-04 17:00", "url": "https://kiss1045fm.iheart.com/content/2024-05-04-entergy-update-1000-am-saturday/", "message": "Entergy Texas crews made significant progress overnight and have now restored power to 90% of customers impacted by severe thunderstorms that moved through the region Thursday and Friday.\nHigh flood waters are delaying restoration efforts, but Entergy Texas is using a variety of resources like high water vehicles and airboats to safely restore power to those customers as quickly as possible.\nWith flooding impacting several communities within the Entergy Texas service area, we’re encouraging customers to keep these flood safety tips top of mind:·Stay away from downed lines.\nKeeping customers informed before, during and after a storm is important to Entergy Texas.\nCustomers also can sign up for text messages about storm and restoration efforts by texting REG to 36778.", "location": "Entergy Texas", "classification": "natural-disasters", "score": 0.8495848885731948, "event_breakdown": "- Entergy Texas crews restored power to 90% of customers affected by severe thunderstorms\n- High flood waters are delaying restoration efforts\n- Entergy Texas using high water vehicles and airboats to restore power safely\n- Flooding impacting several communities within Entergy Texas service area\n- Customers encouraged to stay away from downed lines for safety\n- Entergy Texas keeping customers informed before, during, and after storms\n- Customers can sign up for text messages about storm and restoration efforts"}, {"id": "8f1fb888-aae4-4e94-8fd2-a39acdc73a20", "title": "Hurricane season is near for the southeast", "date": "2024-05-04 19:00", "url": "https://accesswdun.com/article/2024/5/1240845/hurricane-season-is-beginning-in-the-southeast", "message": "The 2024 hurricane season could be one of the most active on record according to early outlooks.\nThe official start to hurricane season is June 1, while National Hurricane Preparedness Week is May 5-11.\nIt’s important to have everyone involved and prepared, so take time with your family to make a written storm plan.\nFor guidance on creating a storm plan, visit ready.gov/plan.\nIf you would like more information on how to prepare for severe weather you can visit jacksonemc.com/storm for more details.", "location": "nullThank you for this response. If you have any other questions, I'm here to help. Would you like to discuss another topic or need further clarification on something?", "classification": "natural-disasters", "score": 0.8854711734576005, "event_breakdown": ""}, {"id": "c48be21d-4e20-42b8-a36a-7b2cd2bd7d4f", "title": "Iraq rainstorm flooding kills hikers : officials", "date": "2024-05-04 07:00", "url": "https://www.bssnews.net/news/187050", "message": "SULAIMANIYAH, May 4, 2024 (BSS/AFP) - Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday, local officials told AFP.\n\"Four members of a hiking team drowned because of heavy rains and flooding in Awaspi village\" in Qaradah district, local official Rouf Kamal said.\nHe said a weather warning had been issued on Thursday, with hikers in particular urged to avoid mountainous areas.\nHeavier than usual rainfall has caused flooding in several parts of Iraq, especially the north, and some roads in Kurdistan region capital Arbil were blocked.\nIraq has suffered four consecutive years of drought, with irregular rainfall badly affecting water resources, forcing many farmers to abandon their land.", "location": "Awaspi village", "classification": "natural-disasters", "score": 0.8894502950102501, "event_breakdown": "- Floods caused by torrential rainstorms killed four hikers in the Sulaimaniyah region of northern Iraq on Friday.\n- Four members of a hiking team drowned due to heavy rains and flooding in Awaspi village, Qaradah district.\n- Weather warning had been issued on Thursday, advising hikers to avoid mountainous areas.\n- Heavier than usual rainfall caused flooding in several parts of Iraq, especially in the north.\n- Flooding blocked some roads in the Kurdistan region capital Arbil.\n- Iraq experienced four consecutive years of drought, with irregular rainfall affecting water resources and forcing many farmers to abandon their land."}, {"id": "af13e2ad-3b0e-4dab-8244-85edf13b8e50", "title": "Death toll from rains in southern Brazil climbs to 56 | World", "date": "2024-05-05 09:30", "url": "https://en.ammonnews.net/article/72422", "message": "Home WorldDeath toll from rains in southern Brazil climbs to 56Ammon News - Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nState Governor Eduardo Leite told reporters on Saturday evening that Rio Grande do Sul would need a \"Marshall Plan\" to recover.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "", "classification": "natural-disasters", "score": 0.5677841003283745, "event_breakdown": ""}, {"id": "cdf9d483-4feb-407f-b8b0-0a3bad2e4400", "title": "If a Tsunami Hit Massachusetts Here Is What Would Happen", "date": "2024-05-04 18:00", "url": "https://wokq.com/ixp/519/p/massachusetts-tsunami-preparation-safety/", "message": "If you lived through the devastating tsunamis in Indonesia and Japan, the televised images of loss of life and wreckage immediately come to mind when you hear the word.\nIn April of 2024, Indonesia issued a tsunami alert, evacuating thousands after a volcano erupted on a remote island.\nThe state has calculated how many hospitals, bridges and pieces of infrastructure sit in danger of tsunami destruction.\nThe report did not indicate whether the Commonwealth has yet succeeded in organizing a comprehensive tsunami warning system for coastline residents.\nIt's important to remember that while a tsunami event could cripple waterfront parts of Massachusetts, historically, they are a rare occurrence in this part of the country.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.8459220931673915, "event_breakdown": ""}, {"id": "abc5e1b9-e1cd-4d40-a8ad-533d7bed936c", "title": "Evacuations ordered , homes damaged in Texas as rivers surge to Hurricane Harvey levels . And more rain is on the way", "date": "2024-05-04 15:45", "url": "https://www.aol.com/evacuations-ordered-homes-damaged-texas-145941738.html", "message": "“Due to continuous rainfall across East Texas and rising levels in creeks and rivers, flood levels may increase.\nGreg Abbott expanded the storm-related declarations in response to the flooding, according to a news release.\nThe repeated bouts of heavy rainfall soaked soils, making many areas extremely prone to both flash and river flooding.\nHurricane Harvey created a widespread flooding disaster in Houston after dropping 30 to 40 inches of rain across the entire metro in just 48 hours.\n- KTXSRainfall totals from flooding in Texas and Louisiana this week showed nearly two feet of rain in five days, according to the National Weather Service.", "location": "Houston", "classification": "natural-disasters", "score": 0.9747096506410732, "event_breakdown": "- Heavy rainfall causes flooding in East Texas\n- Greg Abbott expands storm-related declarations in response to flooding\n- Soaked soils increase risk of flash and river flooding in many areas\n- Hurricane Harvey leads to widespread flooding disaster in Houston\n- Rainfall totals show nearly two feet of rain in Texas and Louisiana"}, {"id": "111668f7-4dad-42d0-8f17-59da446a0f48", "title": "Flood - hit Kenya and Tanzania on alert as cyclone nears", "date": "2024-05-04 10:45", "url": "https://www.bssnews.net/international/187078", "message": "NAIROBI, May 4, 2024 (BSS/AFP) - Coastal regions of Kenya and Tanzania werebuffeted by heavy rains and high winds from a tropical cyclone on Saturday,adding to the chaos caused by deadly floods that have ravaged the region.\nThe Kenya Met Department said in a bulletin on Saturday that the effects ofTropical Cyclone Hidaya were already being felt offshore, with strong windsexceeding 40 knots and waves over two metres (over six feet).\n\"Current observations indicate that Tropical Cyclone Hidaya has made landfallon the coast of Tanzania.\nThe Climate Prediction and Applications Centre for East African trade blocIGAD had said Friday that Cyclone Hidaya will peak at gusts of 165 kilometres(100 miles) per hour when it makes landfall.\nUN refugee agency UNCHR said it was \"particularly concerned\" about thousandsof refugees displaced in Burundi, Kenya, Somalia and Tanzania.", "location": "Tanzania", "classification": "natural-disasters", "score": 0.9543119907568975, "event_breakdown": "- Coastal regions of Kenya and Tanzania hit by heavy rains and high winds from Tropical Cyclone Hidaya\n- Effects of Tropical Cyclone Hidaya felt offshore with strong winds and waves exceeding 40 knots and over two meters\n- Tropical Cyclone Hidaya makes landfall on the coast of Tanzania\n- Cyclone Hidaya predicted to peak at gusts of 165 kilometers per hour by the Climate Prediction and Applications Centre for East African trade bloc IGAD\n- UN refugee agency UNHCR expresses concern for thousands of displaced refugees in Burundi, Kenya, Somalia, and Tanzania"}, {"id": "39a1fe2c-a054-48dd-930b-6ef6213a6d3c", "title": "Brazil flooding death toll rises to 75 , with 80 , 000 evacuated", "date": "2024-05-05 19:45", "url": "https://news.sky.com/story/brazil-flooding-death-toll-rises-to-75-with-80000-evacuated-13130090", "message": "Mass flooding in Brazil has killed 75 people with more than 100 people still missing, local authorities said on Sunday.\nMore than 80,000 people have been forced to flee their homes since downpours began across Rio Grande do Sul in the south of the country on Monday.\nThe flooding has caused landslides, collapsed bridges, and seen roads transformed into rivers throughout the state.\nImage: Flooding in Sao Sebastiao do Cai, in Rio Grande do Sul.\nPresident Luiz Inacio Lula da Silva has travelled to Rio Grande do Sul to discuss rescue efforts with the governor.", "location": "Rio Grande do Sul", "classification": "natural-disasters", "score": 0.5122354255004392, "event_breakdown": "- Mass flooding in Brazil has killed 75 people with more than 100 people still missing, in Rio Grande do Sul\n- More than 80,000 people have been forced to flee their homes since downpours began in Rio Grande do Sul\n- The flooding has caused landslides, collapsed bridges, and seen roads transformed into rivers throughout the state\n- President Luiz Inacio Lula da Silva has travelled to Rio Grande do Sul to discuss rescue efforts with the governor"}, {"id": "c4bfc51d-b55c-48c5-81d3-9e684f61ba84", "title": "178 people rescued amid Texas flood watch :  Were not out of the woods yet  ", "date": "2024-05-04 23:45", "url": "https://6abc.com/178-people-rescued-amid-texas-flood-watch-were-not-out-of-the-wo/14765833/", "message": "178 people rescued amid Texas flood watch: 'We're not out of the woods yet'A flood watch remains in effect for more than 11 million people in Texas and Oklahoma on Saturday as a number of flood warnings were issued as residents are urged not to drive on flooded roads.\nDuring a press conference on Saturday afternoon, Harris County, Texas, Judge Lina Hidalgo said 178 people and 122 pets have been rescued amid the flooding, and no deaths or injuries have been reported.\n\"We're not out of the woods yet and a level of uncertainty remains,\" Hidalgo said.\nThe heaviest rain has eased up in southeast Texas on Saturday morning, with the region set to experience a reprieve for the day.\nMeanwhile, powerful thunderstorms have popped up seemingly every day this week across parts of Texas, and that will be the case again on Saturday.", "location": "Harris County, Texas", "classification": "natural-disasters", "score": 0.5375984425702741, "event_breakdown": "- 178 people and 122 pets rescued in Harris County, Texas amid flooding\n- Flood watch remains in effect for more than 11 million people in Texas and Oklahoma\n- No deaths or injuries reported in Texas flooding\n- Heaviest rain has eased up in southeast Texas on Saturday morning\n- Powerful thunderstorms continue to pop up across parts of Texas"}, {"id": "38aa3bca-a51e-4fcb-bfe3-3a10ec0425b6", "title": "Nearly 60 killed , over 69 , 000 displaced as heavy rains batter southern Brazil", "date": "2024-05-05 06:15", "url": "https://www.indiatoday.in/world/story/heavy-rains-batter-southern-brazil-many-killed-and-thousands-displaced-2535368-2024-05-05", "message": "Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "Bento Goncalves", "classification": "natural-disasters", "score": 0.6889372817057625, "event_breakdown": "- Heavy rains in Rio Grande do Sul, Brazil, caused at least 55 fatalities and dozens of missing people.\n  - Location: Rio Grande do Sul, Brazil\n  - Incident: Heavy rains causing severe damage and loss of life\n  \n- A second dam in Bento Goncalves at risk of collapsing.\n  - Location: Bento Goncalves, Rio Grande do Sul, Brazil\n  - Incident: A dam at risk of collapse due to heavy rains\n  \n- Guaiba lake floods streets in Porto Alegre.\n  - Location: Porto Alegre, Rio Grande do Sul, Brazil\n  - Incident: Guaiba lake breaks its banks, leading to street flooding\n  \n- Brazilian President Lula provides support to Rio Grande do Sul following severe weather events.\n  - Location: Brazil\n  - Incident: Governmental support and coordination with local authorities to manage the impact of intense weather patterns in Rio Grande do Sul"}, {"id": "63a80c89-32df-481d-a6d9-9ac9965732a6", "title": "Heavy rains in southern Brazil kill at least 55", "date": "2024-05-05 01:45", "url": "https://www.rte.ie/news/world/2024/0505/1447449-brazil-floods-deaths/", "message": "Raging floods and mudslides have killed at least 57 people in southern Brazil and forced nearly 70,000 to flee their homes, the country's civil defence agency has said.\nThe toll did not include two people who died in an explosion at a flooded gas station in Porto Alegre, witnessed by an AFP journalist, where rescue crews were attempting to refuel.\nFast-rising water levels in the state of Rio Grande do Sul were straining dams and particularly threatening economically important Porto Alegre, a city of 1.4 million.\nThe Porto Alegre international airport suspended all flights on Friday for an undetermined period.\nAt least 300 municipalities have suffered storm damage in Rio Grande do Sul since Monday, according to local officials.", "location": "", "classification": "natural-disasters", "score": 0.4983421232757623, "event_breakdown": "- Raging floods and mudslides kill at least 57 people in southern Brazil\n- Nearly 70,000 people forced to flee their homes\n- Two people died in an explosion at a flooded gas station in Porto Alegre\n- Fast-rising water levels in Rio Grande do Sul straining dams\n- Porto Alegre international airport suspends all flights\n- At least 300 municipalities suffering storm damage in Rio Grande do Sul"}, {"id": "221ace00-b57b-4c97-9edd-07fbb245afad", "title": "Texas Authorities Rescue Over 200 People , 153 Pets , As Residents Brace For More Flooding", "date": "2024-05-05 19:45", "url": "https://dailycaller.com/2024/05/05/people-pets-rescued-floods-houston-texas-houston/", "message": "Authorities in southern Texas rescued at least 224 people and 153 pets from floods late Saturday following recent storms, even as residents batten down for more rain and flooding, according to reports.\nThe figures of the rescued stood at 178 people and 122 pets as of Friday, Hidalgo told reporters at a press conference late Saturday, as aired by KHOU 11.\n“There have been no confirmed deaths related to the incident, and I haven’t heard about any serious injuries,” Hidalgo told reporters.\nThe floodwaters cut off Rio Villa and its surrounding areas south of Lake Houston, Hidalgo told reporters.\nTexas, Kansas and Oklahoma, comprising the southern Great Plains, “regularly experience some of the most extreme weather on the planet,” according to the U.S.", "location": "Houston", "classification": "natural-disasters", "score": 0.7783027828961951, "event_breakdown": "- Rescue of 224 people and 153 pets from floods in southern Texas\n  - Location: Southern Texas\n  - Incident: Authorities rescued 224 people and 153 pets from floods following recent storms.\n  \n- Additional 46 people and 31 pets rescued from floods in southern Texas\n  - Location: Southern Texas\n  - Incident: The total number of people rescued increased to 178, and the total number of pets rescued increased to 122 by Friday.\n  \n- Floodwaters cut off Rio Villa and surrounding areas south of Lake Houston\n  - Location: Rio Villa, south of Lake Houston, Texas\n  - Incident: Floodwaters cut off access to Rio Villa and surrounding areas.\n  \n"}, {"id": "d26b5e7a-b6d8-47ab-92a1-6502841222cc", "title": "Jefferson Parish leaders urge preparation for hurricane season ; permits required for roof work", "date": "2024-05-04 03:30", "url": "https://www.fox8live.com/2024/05/04/jefferson-parish-leaders-urge-preparation-hurricane-season-permits-required-roof-work/", "message": "NEW ORLEANS (WVUE) - Jefferson Parish leaders urge everyone to take the approaching hurricane season seriously and begin making plans now.\nAnd people getting new roofs in Jefferson need to follow new rules.\nParish President Cynthia Lee Sheng says hurricanes over the past several years have intensified quickly.\nUnlike when Hurricane Ida hit Jefferson Parish in 2021, the parish now has permit requirements for property owners who need a new roof any time of the year.\nDan Mills, CEO of the Homebuilders Association of Greater New Orleans joined Lee Sheng and others at the press conference.", "location": "JEFFERSON", "classification": "natural-disasters", "score": 0.2598028445542858, "event_breakdown": "- Jefferson Parish leaders urge residents to prepare for the approaching hurricane season\n  - Location: Jefferson Parish, Louisiana\n  - Incident: Local leaders emphasized the importance of planning for hurricane season and taking it seriously.\n  \n- New roof permit requirements in Jefferson Parish, Louisiana\n  - Location: Jefferson Parish, Louisiana\n  - Incident: Parish authorities implemented new permit requirements for property owners needing new roofs.\n  - Context: The permit rules change after previous hurricanes, such as Hurricane Ida in 2021."}]