[{"id": "cfae4d6c-9edd-4bcb-b2da-ffaa68f88d52", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354779.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes result in significant casualties among Russian troops.\n- UK Defense Ministry estimates 450,000 Russian troops killed or wounded since the conflict's onset.\n- Attack claims over 100 Russian soldiers in a single strike, according to OSINT and military analysts.\n- Russian soldiers killed during training on Dzharylhach island.\n- Ukraine uploads footage of HIMARS strike on a sandbar.\n- Ukrainian official describes Russian soldiers as \"sitting ducks\" in the incident."}, {"id": "e3b2dbf8-98f5-40be-b6a3-d17d74e6a107", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354241.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes killing scores of Russian troops\n- UK Defense Ministry estimating 450,000 Russian troops killed or wounded since start of conflict\n- Attack killing more than 100 Russian soldiers in one blow \n- Russians killed while training on Dzharylhach island\n- Footage of HIMARS strike on a sandbar uploaded by Ukraine"}, {"id": "03f91ecf-9d2e-4bf6-ac07-d265c2259fa6", "title": "Australian police shoot dead  radicalised  teenager after knife attack in Perth", "date": "2024-05-05 05:00", "url": "https://www.scmp.com/news/asia/australasia/article/3261462/australian-police-shoot-dead-radicalised-teenager-after-knife-attack-perth", "message": "The teenager “rushed” at police who responded by shooting him twice with tasers before firing a single fatal shot, they said.\nWestern Australian police shot and killed a “radicalised” 16-year-old boy with a knife who stabbed a man in a Perth car park, police and the state premier said on Sunday.\nPolice body camera images showed the teenager refused officers’ demands that he put down the knife, the police chief said.\n03:14 Authorities rule out terrorism in deadly Sydney knife attack Authorities rule out terrorism in deadly Sydney knife attackPolice believe the teenager sent “relevant messages” to some members of the Muslim community who immediately called police, he said, without giving details of the messages.\nTwo days after the mall attack an Assyrian Christian bishop was brutally stabbed during a live streamed service in western Sydney.", "location": "Perth", "classification": "security", "score": 0.8303601596936979, "event_breakdown": "- Western Australian police shot and killed a 16-year-old boy with a knife in a Perth car park after he stabbed a man.\n- The teenager \"rushed\" at police, who responded by shooting him twice with tasers before firing a single fatal shot.\n- Police body camera images showed the teenager refused officers' demands to put down the knife.\n- Authorities ruled out terrorism in a deadly knife attack in Sydney.\n- Police believe the teenager sent \"relevant messages\" to some members of the Muslim community, who immediately called the police, though details of the messages were not provided.\n- Two days after the mall attack, an Assyrian Christian bishop was brutally stabbed during a live-streamed service in western Sydney."}, {"id": "d50b5195-d582-4e12-ac76-d46a0473b9ef", "title": "Police in Australia shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 07:30", "url": "https://www.yahoo.com/news/police-australia-shoot-boy-dead-062748293.html", "message": "The car park in Perth where the stabbing and shooting occurred - Australian Broadcasting Corporation vi APPolice in Western Australia have shot dead a boy after he stabbed a man in Perth, in an attack authorities said indicated terrorism.\nThe apparently random attack, in the car park of a hardware store in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nState Police Commissioner Col Blanch said when police were called to the car park, the youth lunged at officers with the knife and was shot.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton, Perth", "classification": "security", "score": 0.9039307365082059, "event_breakdown": "- Stabbing and shooting incident at a car park in Perth, Australia\n- Police shooting a boy after he stabbed a man in the car park of a hardware store in Willetton, Perth\n- Authorities indicating that the incident had \"hallmarks\" of terrorism but was not declared a terrorist act\n- State Police Commissioner Col Blanch stating that the youth lunged at officers with a knife and was shot\n- Western Australia Premier Roger Cook mentioning that the attacker appeared to have acted solely and alone\n- Recent stabbing spree in Bondi, Sydney where six people were killed"}, {"id": "a02d5df2-c97e-4d90-b78b-c27da09f699b", "title": "Australian police shoot 16 - year - old boy dead after stabbing", "date": "2024-05-05 05:00", "url": "https://www.theglobeandmail.com/world/article-australian-police-shoot-16-year-old-boy-dead-after-stabbing/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThere were signs the 16-year-old, armed with a kitchen knife, had been radicalized online, state authorities said, adding they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised news conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.42508576033814766, "event_breakdown": "- A boy was shot dead by Australian police after stabbing a man in Perth, Western Australia\n- The 16-year-old attacker, armed with a kitchen knife, showed signs of being radicalized online\n- Concerned members of the local Muslim community had contacted authorities before the attack\n- The incident took place in the suburb of Willetton\n- Authorities stated that the attack had \"hallmarks\" of terrorism but had not been declared a terrorist act yet\n- Western Australia Premier Roger Cook mentioned that the attacker acted alone\n- The attack occurred shortly after a stabbing spree in Bondi, Sydney which resulted in six deaths"}, {"id": "652f5f48-06c3-4a07-bb66-e11bf0922b7b", "title": "These are the terrorists eliminated near Tulkarem", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389402", "message": "The IDF and ISA on Saturday night announced the names of the terrorists killed in a nearly 13-hour operation near Tulkarem.\n\"Over the last few hours, during a joint IDF, ISA, and Israel Police counterterrorism activity, a Hamas terrorist cell was neutralized in the area of Tulkarem,\" the statement read.\n\"As part of the counterterrorism activity, the forces located the terrorists in the town of Deir al-Ghusun and engaged in fire, eliminating four terrorists.\n\"The four terrorists who were eliminated in the area of Tulkarem were:\"1.\nTamer Abed Allatif Rajeh Rajeh - a Hamas operative from the town of Shuweika.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.964195166140549, "event_breakdown": "null"}, {"id": "8cce0556-8fab-431e-9369-0a25eb0b83cd", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "- Two Nigerian military officers to face court martial over drone strike in northwest Kaduna State.\n- Drone strike in December kills at least 85 civilians in a village as they celebrate a Muslim festival.\n- Nigerian military acknowledges accidental strike on the village.\n- Military relies on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n- United Nations human rights office notes the drone strike as one of at least four airstrikes since 2017 causing significant civilian fatalities."}, {"id": "7fbecffc-a889-4dac-afdf-b5c3bb6bd12a", "title": "IDF eliminates top PIJ commander who helped carry out October 7 attacks", "date": "2024-05-04 21:00", "url": "https://www.jpost.com/breaking-news/article-799817", "message": "A joint attack by the IDF and the Shin Bet (Israel Security Services) killed one of the top commanders of the Palestinian Islamic Jihad (PIJ), the IDF announced on Saturday.\n(credit: IDF SPOKESPERSON'S UNIT)The terrorist, Imam Zerev, was killed by Israel Air Force fighter jets in southern Gaza.\nIDF kills Imam Zerev in southern Gaza.\n(Credit: IDF Spokesperson's Unit).\nTwo other terrorists from PIJ were killed in the same air strike.", "location": "southern Gaza", "classification": "security", "score": 0.9793338893332181, "event_breakdown": "1. A joint attack by the IDF and the Shin Bet killed a top commander of the Palestinian Islamic Jihad (PIJ) in southern Gaza.\n2. Imam Zerev was killed by Israel Air Force fighter jets in southern Gaza.\n3. Two other terrorists from PIJ were also killed in the same air strike."}, {"id": "e93a1663-f323-4822-8a09-7d5daab7a0ef", "title": "Russo - Ukraine War - 04 May 2024", "date": "2024-05-05 06:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-04.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nLyman axis: the Ukrainian Defense Forces repelled 7x attacks in the vicinities of Serebryans'ke forestry (Luhansk oblast), Terny (Donetsk oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Nevs'ke (Luhansk oblast), Terny, Yampolivka, Tors'ke (Donetsk oblast).\nKherson axis: Russia does not abandon its intention to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River.", "location": "Serebryans'ke forestry, Luhansk oblast", "classification": "security", "score": 0.8355880818225166, "event_breakdown": "- On 24 February 2022, Ukraine was attacked by land, naval, and air forces of Russia, sparking the largest European war since the Great Patriotic War.\n- Ukrainian Defense Forces repelled 7 attacks in the areas of Serebryans'ke forestry (Luhansk oblast) and Terny (Donetsk oblast).\n- Russian forces fired artillery and mortars at over 10 settlements, including Nevs'ke (Luhansk oblast), Terny, Yampolivka, and Tors'ke (Donetsk oblast).\n- Russia continued its efforts to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River."}, {"id": "3b9f1d19-d6a1-47a2-a16f-998ffcf373f9", "title": "Explosion at DRC displaced person camp kills at least 9", "date": "2024-05-03 19:00", "url": "https://www.voanews.com/a/explosion-at-drc-displaced-persons-camp-kills-at-least-9-/7596984.html", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma, Democratic Republic of Congo", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion reported at Mugunga displaced persons camp in Goma, eastern Democratic Republic of Congo\n- At least nine people killed, most of them children\n- Witnesses and local officials report seeing nine bodies and at least 20 wounded\n- Local hospital receives 32 wounded and four bodies\n- DRC government spokesman blames Rwandan army and M23 rebels for the attack"}, {"id": "520c2ae9-a859-47bb-aa47-db1800301a23", "title": "Explosion at DRC displaced person camp kills at least 9 - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-04 16:30", "url": "https://www.newdelhitimes.com/explosion-at-drc-displaced-persons-camp-kills-at-least-9/", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at Mugunga displaced persons camp in Goma, Democratic Republic of Congo\n- At least nine people, mostly children, killed in the explosion\n- At least 20 people wounded in the explosion\n- Local hospital receiving 32 wounded and four bodies\n- Accusations by DRC government spokesman Patrick Muyaya blaming the Rwandan army and M23 rebels for the attack"}, {"id": "d4e3ab34-8ffd-48b9-8adc-c30850105a89", "title": "Terror strikes IAF convoy in J & K , one soldier dead", "date": "2024-05-04 23:45", "url": "https://www.dailypioneer.com/2024/page1/terror-strikes-iaf-convoy-in-j-k--one-soldier-dead.html", "message": "The attack occurred near Shashidhar when the convoy vehicles were moving towards Sanai Top in the district's Surankote area.\nFive Indian Army personnel including two officers were \"killed in action\" in the Kalakote forest area of Rajouri on November 22.\nTwo terrorists, including a top commander of LeT identified as Quari, were also killed in the two-day long gunfight.\nQuari was said to be the mastermind behind several attacks, including the killing of 10 civilians and five Army personnel in the district.\nIn May last year, five more Army personnel were killed and a major-rank officer was injured in Chamrer forest during an anti-terrorist operation.", "location": "Rajouri", "classification": "security", "score": 0.9852075559671105, "event_breakdown": "- Attack near Shashidhar in Surankote area\n- Five Indian Army personnel killed in action in Kalakote forest area of Rajouri\n- Two terrorists, including top LeT commander Quari, killed in gunfight\n- Quari identified as mastermind behind several attacks in the district\n- Five Army personnel killed and major-rank officer injured in Chamrer forest anti-terrorist operation"}, {"id": "20800e4a-9434-4515-96f9-c912bfa788f4", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "KHUZDAR", "classification": "security", "score": 0.982317040954408, "event_breakdown": "1. Journalist, 2 others killed after vehicle hit with remote-controlled blast in Khuzdar\n2. Remote-controlled blast carried out on Sultan Ibrahim Khan Road on National Highway\n3. Mohammad Siddiq Mengal's car damaged following the blast on May 3, 2024"}, {"id": "d4d98c3e-3a6c-4024-a998-08e6ce295ac0", "title": "Islamic Jihad commander killed in Rafah : Israeli Army", "date": "2024-05-05 06:15", "url": "https://www.dailyexcelsior.com/islamic-jihad-commander-killed-in-rafah-israeli-army/", "message": "Jerusalem, May 5: The Israel Defense Forces (IDF) announced on Saturday that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the Oct. 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, said the IDF in a statement.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for a combat in the southern Gaza Strip against the Israeli military, according to the statement.\nAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.", "location": "Rafah", "classification": "security", "score": 0.978502275377178, "event_breakdown": "- Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike in Rafah, Gaza\n- Zaarab directed the Islamic Jihad's elite forces during an attack on Kibbutz Sufa and the Sufa military post \n- Zaarab commanded and directed several attacks and led preparations for a combat in the southern Gaza Strip\n- Two other Islamic Jihad operatives were also killed in the airstrike"}, {"id": "a7487c0a-5bbd-4d2a-81f0-2d2f07636bd3", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Syrian defense ministry claims eight Syrian soldiers injured in an Israeli airstrike near Damascus.\n- The strike reportedly caused \"material losses,\" according to Syrian state-run broadcaster cited by The Times of Israel.\n- Israeli warplanes launch missiles from over the Golan Heights targeting a site near the capital, as reported by the Syrian defense ministry via the Syrian Arab News Agency.\n- Russian state media TASS quotes Dubai-based Al Hadath TV stating that the attack targeted a base of Lebanon's Shia militia, Hezbollah, southwest of Damascus International Airport.\n- No official confirmation from Israeli authorities regarding the reported reprisal strike."}, {"id": "9665791e-7e4a-49f5-8fc5-70f9e2455bfb", "title": "Islamic Jihad commander killed in Rafah : Israeli army", "date": "2024-05-05 06:15", "url": "https://www.thestatesman.com/world/islamic-jihad-commander-killed-in-rafah-israeli-army-1503297279.html", "message": "The Israel Defense Forces (IDF) has announced that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the October 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, the IDF was quoted as saying on Saturday by Xinhua news agency.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for combat in the southern Gaza Strip against the Israeli military, according to the IDF statement.\nAdvertisementAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.", "location": "Rafah", "classification": "security", "score": 0.9772831996242826, "event_breakdown": "- Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike in Rafah, southern Gaza.\n- Zaarab directed Islamic Jihad's elite forces during the October 7 attack on Kibbutz Sufa and the Sufa military post near the Gaza Strip border.\n- Zaarab had commanded and directed several attacks and led preparations for combat against the Israeli military in the southern Gaza Strip.\n- Two other Islamic Jihad operatives were also killed in the same strike."}, {"id": "d6ec9631-121d-4447-886c-4f899e1b7346", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\n- Footage captured by a drone shows a military training ground being hit by multiple explosions typical of an ATACMS strike.\n- The recent attack's footage appears to show the training ground as one of the targets.\n- Analysts suggest that the flashes of smoke seen erupting over the clearing were the M74 APAM mini-bombs detonating on the training ground, resulting in casualties among the Russian troops."}, {"id": "faa505d9-723a-4a31-9583-844d1101e6e6", "title": "N Korea plotting attacks on embassies , Seoul says", "date": "2024-05-03 19:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/04/2003817373", "message": "N Korea plotting attacks on embassies, Seoul saysAFP, SEOULSouth Korea’s spy agency yesterday said that Pyongyang was plotting “terrorist” attacks targeting Seoul’s officials and citizens overseas, with the South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries.\nNorth Korean leader Kim Jong-un, right, visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang on Friday.\nAs a result, the North may be “plotting retaliation” against South Korean embassy staff on such pretenses, NIS added.\nThis marked the highest number of defections by North Korean elites to the South since 2017, Seoul said.\nThe consul, also an intelligence agent, had been monitoring Pyongyang’s illicit activities, including drug trafficking and the production of counterfeit banknotes, according to South Korean reports.", "location": "Seoul, South Korea", "classification": "security", "score": 0.4236494391586273, "event_breakdown": "- North Korea plotting \"terrorist\" attacks targeting Seoul's officials and citizens overseas\n- South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries\n- North Korean leader Kim Jong-un visiting the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang\n- North Korea may be \"plotting retaliation\" against South Korean embassy staff\n- Highest number of defections by North Korean elites to the South since 2017\n- South Korean consul in Vladivostok, Russia, monitoring Pyongyang's illicit activities"}, {"id": "320129a1-b51a-4081-9668-b0eb5fdddd04", "title": "Russo - Ukraine War - 03 May 2024", "date": "2024-05-03 21:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-03.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nRussian forces launched air strikes in the vicinities of Verkhn'okam'yans'ke, Spirne, Ivano-Dar'ivka and New York (Donetsk oblast).\nRussian forces launched air strikes in the vicinities of Vovche, Kalynove, Zhelanne, Vesele, Novoselivka Persha, Komyshivka, Karlivka (Donetsk oblast).", "location": "Makiivka, Ukraine", "classification": "security", "score": 0.5579876950642361, "event_breakdown": "- Ukraine was attacked by land, naval and air forces of Russia on 24 February 2022\n- Russian forces fired artillery and mortars at more than 10 settlements including Makiivka, Nevs'ke, Terny, Yampolivka\n- Russian forces launched air strikes in the vicinities of VerkhnoKam'ians'ke, Spirne, Ivano-Dar'ivka, and New York in Donetsk oblast\n- Russian forces launched air strikes in the vicinities of Vovche, Kalynove, Zhelanne, Vesele, Novoselivka Persha, Komyshivka, and Karlivka in Donetsk oblast"}, {"id": "dd40ab49-830c-4938-926b-99490da55942", "title": "Israeli forces kill Hamas gunmen in overnight raid near West Bank Tulkarm", "date": "2024-05-05 06:15", "url": "https://www.deccanherald.com/world/israeli-forces-kill-hamas-gunmen-in-overnight-raid-near-west-banks-tulkarm-3008337", "message": "Hamas, the Islamist group which Israel has been fighting in Gaza, had also been building its fighting network in the West Bank before the start of the war.\nDuring the raid, the Israeli army levelled a two-storey house with a bulldozer in an operation that lasted more than 12 hours.\nAccording to Palestinian Health Ministry records, nearly 500 Palestinians have been killed by Israeli forces or Jewish settlers in the West Bank or East Jerusalem since Oct. 7.\nPalestinians want the West Bank and Gaza, which Israel captured in the 1967 Middle East war, as the core of an independent state with East Jerusalem as its capital.\nMore than 34,000 Palestinians have been killed in Israel's seven-month-old assault on the Gaza Strip, say health officials in the Hamas-ruled enclave.", "location": "West Bank", "classification": "security", "score": 0.8533481235865251, "event_breakdown": "- Hamas builds fighting network in the West Bank\n- Israeli army levels two-storey house with bulldozer during raid\n- Nearly 500 Palestinians killed by Israeli forces or Jewish settlers in West Bank and East Jerusalem\n- Palestinians seek West Bank and Gaza for an independent state with East Jerusalem as capital\n- Over 34,000 Palestinians killed in Israel's assault on Gaza Strip"}, {"id": "ca7e8dd3-f396-44cf-90a3-1e76a0697842", "title": "Rafah offensive and war in Gaza : Threat of a dangerous escalation", "date": "2024-05-04 06:45", "url": "https://www.firstpost.com/opinion/rafah-offensive-and-war-in-gaza-threat-of-a-dangerous-escalation-13767004.html", "message": "Rafah and RegionWithin the region, there is apprehension about the Rafah offensive.\nIn case of the Rafah offensive going ahead, there is all likelihood that the engagements from Hezbollah into northern Israel will grow.\nConclusionLike the Israeli strike on the Iranian consulate in Damascus, the Rafah offensive too threatens to escalate the conflict if launched.\nWhile the Iran-Israel spat was short, the Rafah offensive could spread very fast.\nThe only face-saving exit for either of the parties is an early and long lasting ceasefire in Gaza before any offensive in Rafah.", "location": "Rafah", "classification": "security", "score": 0.5080231489088098, "event_breakdown": "- Apprehension about the Rafah offensive in the region\n- Likelihood of engagements from Hezbollah into northern Israel if the Rafah offensive proceeds\n- Potential escalation of conflict if the Rafah offensive is launched\n- Concern over the speed at which the Rafah offensive could spread\n- Suggestion for an early and long-lasting ceasefire in Gaza as the only face-saving exit before any offensive in Rafah"}, {"id": "4b4cc595-106c-4f3a-9176-8dbdb372a592", "title": "Australian Muslims claim  double standard  in police handling of hate crime incidents – International Shia News Agency", "date": "2024-05-04 12:15", "url": "https://en.shafaqna.com/367278/australian-muslims-claim-double-standard-in-police-handling-of-hate-crime-incidents/", "message": "Shafaqna English- Australian Muslims claim ‘double standard’ in police handling of hate crime incidents, ead of the Australian National Imams Council (ANIC) said.\nAn April 13 knife attack in a mall in Sydney, Australia killed six people before police killed the attacker.\nDays later, Australian police said the attacker had mental health problems that led to the isolated act and that the attack was not related to terrorism.\n“One was described as a mental health issue, the other one was labeled a terrorist act.\nEmphasizing that the language used by police did not help the situation, Al-Suleiman said they conveyed their concerns about a double standard to authorities but got unsatisfactory feedback.", "location": "Sydney, Australia", "classification": "security", "score": 0.4265718112077503, "event_breakdown": "- Australian Muslims claim 'double standard' in police handling of hate crime incidents\n- Knife attack in a mall in Sydney, Australia on April 13 resulted in the deaths of six people\n- Police killed the attacker at the scene\n- Australian police stated that the attacker had mental health problems and that the incident was not related to terrorism\n- Concerns about a double standard in police language were raised by the Australian National Imams Council (ANIC)\n- ANIC expressed dissatisfaction with feedback received from authorities"}, {"id": "3477389f-098c-4646-9745-6722baa46e0c", "title": "Teenagers and terrorism : What is being done ? ", "date": "2024-05-03 20:45", "url": "https://www.brisbanetimes.com.au/national/vulnerable-cohort-what-is-it-about-teenagers-and-terrorism-and-what-is-being-done-20240502-p5foez.html", "message": "AdvertisementNor is the link yet clear between the six charged this week and the church attacker, though one described him as a “mate”.\nThey had comprised half of ASIO’s “priority counter-terrorism caseload” just a couple of years ago, and “it’s picked up again”, he said.\nASIO Director-General Mike Burgess told the press club that young terror suspects were not a new problem.\nMuslim leaders have slammed authorities for not exploring alternatives to the counter-terrorism raids in Sydney last month.\nThe speed with which police designated the church stabbing a terrorist incident, just hours after it occurred, remains another source of grievance.", "location": "Sydney, Australia.", "classification": "security", "score": 0.3949117641785517, "event_breakdown": "- The link between the six charged individuals this week and the church attacker is not yet clear, although one described him as a \"mate.\"\n- The individuals charged comprised half of ASIO's \"priority counter-terrorism caseload\" a couple of years ago, indicating a resurgence in such cases, according to ASIO Director-General Mike Burgess.\n- Burgess highlighted that young terror suspects were not a new problem.\n- Muslim leaders criticized authorities for not exploring alternatives to the counter-terrorism raids in Sydney last month.\n- The rapid designation of the church stabbing as a terrorist incident by police, just hours after it occurred, remains a source of grievance."}, {"id": "90c87dbf-3a9e-4439-9099-7f8ff3bdeff7", "title": "Sunday morning news brief , May 05 - The Times of India", "date": "2024-05-05 04:00", "url": "https://timesofindia.indiatimes.com/brief/sunday-morning-news-brief-may-05/liveblog/109850664.cms", "message": "08:27 (IST) May 05According to police sources, she was found at a farmhouse in Kalenahalli near Hunsur taluk of Mysuru.\nShe was taken to Bengaluru for questioning.\nThe farmhouse where she was found allegedly belongs to Rajagopal, said to be Revanna's personal assistant.", "location": "Kalenahalli", "classification": "security", "score": 0.7976371195308909, "event_breakdown": "- 08:27 (IST) May 05: A woman was found at a farmhouse in Kalenahalli near Hunsur taluk of Mysuru according to police sources.\n- The woman was taken to Bengaluru for questioning.\n- The farmhouse where she was found allegedly belongs to Rajagopal, who is said to be Revanna's personal assistant."}, {"id": "a800933c-af73-4462-b03b-495521eb254d", "title": "Progress in Gaza cease - fire talks , but little chance of ending war", "date": "2024-05-04 19:00", "url": "https://www.nydailynews.com/2024/05/04/israel-hamas-cease-fire-talks-progress-no-end-to-war/", "message": "Hamas has called for a complete end to the war and withdrawal of all Israeli forces from Gaza.\nA senior Israeli official, speaking on condition of anonymity to discuss ongoing negotiations, played down the prospects for a full end to the war.\nIsraeli strikes early Saturday on Gaza killed at least six people.\nA strike in the Nuseirat refugee camp in central Gaza killed three people, according to hospital officials.\nOnce inside Gaza, the convoy was commandeered by Hamas terrorists, before UN officials reclaimed it.", "location": "Nuseirat refugee camp", "classification": "security", "score": 0.9266667652864661, "event_breakdown": "- Hamas calls for complete end to the war and withdrawal of Israeli forces from Gaza\n- Senior Israeli official downplays prospects for full end to the war\n- Israeli strikes in Gaza kill at least six people \n- Strike in Nuseirat refugee camp in central Gaza kills three people\n- UN convoy is commandeered by Hamas terrorists in Gaza, later reclaimed by UN officials"}, {"id": "f7dbb604-af7b-401f-995d-0ef2014fccc6", "title": "Security forces kill six terrorists in North Waziristan IBO", "date": "2024-05-04 19:00", "url": "https://www.thenews.com.pk/latest/1185411-security-forces-kill-six-terrorists-in-north-waziristan-ibo", "message": "— AFPSix terrorists were killed by the security forces following an intense gun battle during an intelligence-based operation (IBO) in North Waziristan district, Inter-Services Public Relations (ISPR) said Saturday.\nDuring the conduct of the operation, intense fire exchange took place between the troops and the terrorists, as a result of which six terrorists were \"sent to hell\".\nThe killed terrorists remained actively involved in numerous terrorist activities against security forces as well as target killings of innocent civilians in the area.\nSecurity forces on Thursday killed terrorists involved in the recent abduction of district and sessions judge of South Waziristan in a joint IBO in KP's Tank district, the ISPR had said in a statement.\nAmong the 432 fatalities, 281 included that of civilians and security forces personnel.", "location": "North Waziristan district", "classification": "security", "score": 0.9765247571825078, "event_breakdown": "- Six terrorists killed in North Waziristan district during an IBO\n- Security forces engaged in intense gun battle with terrorists in North Waziristan\n- Killed terrorists were involved in terrorist activities and target killings\n- Security forces killed terrorists involved in abduction of judge in Tank district, KP"}, {"id": "a848b8d8-aebc-485b-a3c0-9911df3595a8", "title": "Australian police shoot dead a boy , 16 , armed with a knife after he stabbed a man in Perth – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/australian-police-shoot-dead-a-boy-16-armed-with-a-knife-after-he-stabbed-a-man-in-perth/", "message": "A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth, officials said Sunday.\nMELBOURNE, Australia (AP) — A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth, officials said Sunday.\nBlanch said members of the local Muslim community had raised concerns with police about the boy’s behavior before he was killed on Saturday.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead.", "location": "Perth", "classification": "security", "score": 0.7883950595554645, "event_breakdown": "- A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in Perth, Australia\n- Members of the local Muslim community raised concerns about the boy's behavior to the police\n- In November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before being shot dead by police"}, {"id": "bef17deb-b940-4bc6-a170-5ce155a8aab0", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "TALEEX", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashed in Somalia's Sool region late Thursday night.\n- Residents of Taleex district heard a loud explosion around midnight and discovered wreckage in the morning that resembled an Iranian Quds land-attack cruise missile (LACM).\n- No casualties were reported from the apparent cruise missile strike in Somalia's Sool region.\n- No group has claimed responsibility for the apparent cruise missile launch, which violated Somali airspace."}, {"id": "ce1ea49f-2a69-4c47-b1e0-6fd967e74f50", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Eight Syrian soldiers reportedly injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\n- The strike, targeting a military position in the Damascus area, occurred shortly before 11 p.m., as confirmed by the Syrian Defense Ministry.\n- Syrian state-run SANA broadcaster cites a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\n- The targeted building, located south of the Sayyeda Zeinab shrine, allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\n- This strike follows the April 1 incident where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel."}]