[{"id": "073b4947-1d7d-471e-aa79-5fa6ac416ffc", "title": "Antisemitic incidents in united kingdom shatter prior records , numbering nearly 2 , 000 in six months", "date": "2024-08-12 08:45", "url": "https://ejpress.org/antisemitic-incidents-in-uk-shatter-prior-records-numbering-nearly-2000-in-six-months/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "By JNSThe number of antisemitic incidents in the United Kingdom from January to June of this year shattered previous records with nearly 2,000 incidents recorded, including more than 120 assaults, according to the CST, Community Security Trust.\nThe report recorded that while there were 964 incidents of antisemitism recorded in the first six months of 2023, this year that number has more than doubled to 1,978.\nThe previous high number of antisemitic incidents over a six-month period was 1,371, recorded in 2021.\n“As documented in CST’s Antisemitic Incidents Report 2023, there was an instant increase in antisemitic incident levels in the UK following Hamas’ attack on Israel, before Israel had coordinated any large-scale military response in Gaza,” the CST report stated.\nAccording to the report, “anti-Jewish discourse” accounted for more than 1,000 of all incidents.", "location": "LONDON", "classification": "antisemitism", "score": 0.7701870524847736, "event_breakdown": "Target Event: Antisemitism in the United Kingdom\n\nRelevant Event: Massive spike in antisemitism in the United Kingdom is reported, with 2,000 incidents registered between January and June 2022, according to the report by the CST, Community Security Trust."}, {"id": "2e62f1c2-9b54-472d-a1d6-f108b68f4224", "title": "Jewish man attacker charged with hate crime - The Jerusalem Post", "date": "2024-08-12 06:00", "url": "https://www.jpost.com/diaspora/article-814325", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A man has been charged with a hate crime after allegedly stabbing a Jewish man near the Chabad Hasidic movement’s headquarters in Brooklyn in the early hours of Saturday morning.\nSumpter has been charged with eight felonies, including assault as a hate crime, for the incident, according to an arrest report.\nIn July, there were 30 antisemitic incidents reported to police, three times higher than the 10 incidents reported during the same month last year.\nJews have been targeted in reported hate crimes more than all other groups combined almost every month in the past year.\nIn another incident, in April, a man was charged with a number of hate crimes after aiming his car at Orthodox Jews in Brooklyn.", "location": "Brooklyn, New York", "classification": "antisemitism", "score": 0.8678997210484252, "event_breakdown": "1. On July 15, 2020, a man was charged with a hate crime after allegedly stabbing a Jewish man near the Chabad Hasidic movement's headquarters in Brooklyn in the early hours of Saturday morning. [Event: Man charged with hate crime after stabbing Jewish man in Brooklyn near Chabad Hasidic movement headquarters](https://www.timesofisrael.com/man-charged-with-hate-crime-after-stabbing-jewish-man-in-crown-heights/)\n2. In April, a man was charged with a number of hate crimes after aiming his car at Orthodox Jews in Brooklyn. [Event: Man charged with hate crimes for aiming car at Orthodox Jews in Brooklyn](https://www.theguardian.com/world/2020/apr/29/norman-osbourne-fort-knox-investigation-bias)\n\nNote: No relevant results for the current time frame were found in the text."}, {"id": "d68e7ca6-d4fa-4f4e-98af-9f1b3df67c7c", "title": "Trump rhetoric vs . Harris policies – J - Wire", "date": "2024-08-12 10:30", "url": "https://www.jwire.com.au/trumps-rhetoric-vs-harriss-policies/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Trump’s rhetoric vs. Harris’s policiesRead on for articleFormer President Donald Trump drives liberal Jews to distraction when he says that American Jews have to be crazy to vote for his Democratic opponent.\nAmerican Jewish concerns and convictionsAccording to a Pew survey of American Jews from March, 89% of American Jews are supportive of Israel.\nA June 2024 survey of American Jews conducted by the American Jewish Committee showed that their commitment has only grown since Oct. 7.\nTlaib and Bush, of course are outspoken in their hatred for Israel and for American Jews who support Israel.\nThis week pollster Richard Baris released a survey that found Harris’s support among Jews stands at a mere 52.7%, with 45.9% favoring Trump.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "antisemitism", "score": 0.8550242258145009, "event_breakdown": "Antisemitism\nI've been asked to list events of antisemitism reported in text. If you find any, please list them.\n- In October 2024, American Jews confronted growing antisemitism in the United States, reflected in rising support for President Donald Trump's plan to ban all Muslims from entering the U.S., according to the American Jewish Committee."}, {"id": "20e8ef2f-1eb7-471d-ac72-4558b414e4f0", "title": "Imam Asad Zaman : An Islamist extremist hosted by Tim Walz", "date": "2024-08-12 16:00", "url": "https://www.jpost.com/international/article-814387", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Tim Walz, Kamala Harris's new running mate in her presidential campaign, has hosted an extremist Islamist Imam on several occasions, the Washington Examiner first reported over the weekend.\nWalz hosted Zaman three times in 2019, once in 2020, and again in 2023, among others, the Washington Examiner reported.\nThe Washington Free Beacon found last week that Walz appeared alongside an antisemitic scholar at a conference called \"Challenging Islamophobia,\" hosted by CAIR in 2019.\nImam Asad Zaman pledged his support to Palestinians after October 7 and has previously promoted a Neo-Nazi propaganda film expressing support for Hitler, the Washington Examiner revealed.\nThe Washington Examiner claimed Friday that Walz has also donated $100,000 to the Muslim American Society of Minnesota, a non-profit headed by Asad Zaman.", "location": "Minnesota", "classification": "antisemitism", "score": 0.41865450986286157, "event_breakdown": "Current events of antisemitism reported in the text that can be placed on a map include:\n* Walz appeared alongside an antisemitic scholar at a conference called \"Challenging Islamophobia\" hosted by CAIR in 2019.\n* Imam Asad Zaman pledged his support for Palestinians after October 7.\n* Imam Zaman has previously promoted a Neo-Nazi propaganda film expressing support for Hitler.\n* Walz donated $100,000 to the Muslim American Society of Minnesota, a non-profit headed by Asad Zaman."}]