[{"id": "6ee40b50-a30a-4131-9423-28ca7c1bb98f", "title": "Two Hamas leaders killed in Gaza air strikes including anti - tank missile operative", "date": "2024-05-22 08:15", "url": "https://www.devdiscourse.com/article/international/2946236-two-hamas-leaders-killed-in-gaza-air-strikes-including-anti-tank-missile-operative", "message": "The strike was carried out with the intelligence aid of the Shin Bet (Israel's anti-terror General Security Services).\nAnti-tank missiles are a more serious threat to IDF units than rockets as they can be guided toward their targets and have more explosive power.\nAmong the terrorists who were killed in the attack was Fadi Salim, head of the information system in Hamas' Gaza division.\nAlong with him, three terrorists in the organization's intelligence system and another Nakhaba terrorist were killed.\n\"This is another example of the cynical and obvious use that Hamas makes of civilian spaces and facilities while using the Gaza population as a human shield,\" said the IDF.", "location": "GAZA", "classification": "security", "score": 0.9639231785122301, "event_breakdown": "form\nSecurity events in the text:\n\n1. An IDF strike was carried out in Gaza with the intelligence aid of the Shin Bet (Israel's anti-terror General Security Services).\n2. Three terrorists in Hamas' intelligence system were killed by the IDF.\n3. The head of information system in Hamas' Gaza division was killed in the IDF strike.\n4. Three additional terrorists in the intelligence system of Hamas and another Nakhaba terrorist were also killed in the IAF strike.\n5. The IDF issued a statement accusing Hamas of using civilian spaces and facilities while using civilians as a human shield."}, {"id": "574eff3d-b4d7-41e7-ae43-b377befe7679", "title": "Israel - Rafah War : Israeli forces raze parts of Gaza Jabalia , hit Rafah with airstrikes", "date": "2024-05-22 01:30", "url": "https://economictimes.indiatimes.com/news/defence/israeli-forces-raze-parts-of-gazas-jabalia-hit-rafah-with-airstrikes/articleshow/110316765.cms", "message": "\"The first missile when it hit, it hit the entrance of the emergency department.\nWe tried to enter, and then a second missile hit, and the third hit the building nearby,\" said Hussam Abu Safia, the head of hospital.\n\"Residents and medics said Israeli tanks were besieging another Jabalia hospital, Al-Awda Hospital, for the third day.\n\"These are the only two functional hospitals remaining in northern Gaza,\" Tedros said.\nTanks made incursions into the eastern Rafah suburbs of Jeneina, Al-Salam, and Brazil, according to residents.The Israeli military said over the past day it had \"identified a terrorist shooting mortar shells at IDF ( Israeli Defence Forces ) troops,\" though no injuries were reported.", "location": "GAZA", "classification": "security", "score": 0.9554369096422862, "event_breakdown": "Event 1: Israeli tanks shelled the entrance to the emergency department of a Gaza hospital.\nEvent 2: Israeli tanks shelled another hospital in the Jabalia area of northern Gaza for the third consecutive day.\nEvent 3: Tanks entered the eastern Rafah suburbs of Jeneina, Al-Salam, and Brazil.\nEvent 4: The Israeli army reported being attacked with mortar shells but did not report any injuries."}, {"id": "88b6e81d-15bc-4f28-b11d-f8d287077ce5", "title": "Israeli forces destroy residential areas in Gaza Jabalia ; Rafah hit by airstrikes , five killed – Firstpost", "date": "2024-05-22 08:30", "url": "https://www.firstpost.com/world/israeli-forces-destroy-residential-areas-in-gazas-jabalia-rafah-hit-by-airstrikes-five-killed-13773664.html", "message": "In a roundup of its activity over the past day, the Israeli military said it had dismantled “about 70 terror targets” throughout the Gaza Strip, including military compounds, weapon storage sites, missile launchers and observation posts.\n“The first missile when it hit, it hit the entrance of the emergency department.\nWe tried to enter, and then a second missile hit, and the third hit the building nearby,” said Hussam Abu Safia, the head of hospital.\n“These are the only two functional hospitals remaining in northern Gaza,” Tedros said.\nThe Israeli military said over the past day it had “identified a terrorist shooting mortar shells at IDF (Israeli Defence Forces) troops,” though no injuries were reported.", "location": "GAZA CITY", "classification": "security", "score": 0.9850463406044779, "event_breakdown": "List of Security Events:\n\n1. Israeli military claims to have dismantled \"about 70 terror targets\" throughout the Gaza Strip.\n2. Israeli forces targeted military compounds, weapon storage sites, missile launchers and observation posts in the Gaza Strip.\n3. Israel targeted two functional hospitals remaining in northern Gaza, according to the head of hospital Hussam Abu Safia.\n4. Israeli military identified the terrorist shooting mortar shells at IDF (Israeli Defence Forces) troops."}, {"id": "096efb2b-ba37-47b9-be5c-98145ed28ef4", "title": "Israeli forces raze parts of Gaza Jabalia , hit Rafah with airstrikes", "date": "2024-05-22 05:00", "url": "https://www.euractiv.com/section/global-europe/news/israeli-forces-raze-parts-of-gazas-jabalia-hit-rafah-with-airstrikes/", "message": "Israeli forces thrust deeper into Jabalia in northern Gaza on Tuesday (21 May), striking a hospital and destroying residential areas with tank and air bombardments, residents said, while Israeli airstrikes killed at least five people in Rafah in the south.\n“The first missile when it hit, it hit the entrance of the emergency department.\nWe tried to enter, and then a second missile hit, and the third hit the building nearby,” said Hussam Abu Safia, the head of hospital.\n“These are the only two functional hospitals remaining in northern Gaza,” Tedros said.\nThe Israeli military said over the past day it had “identified a terrorist shooting mortar shells at IDF (Israeli Defence Forces) troops,” though no injuries were reported.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9767598930664922, "event_breakdown": "1. Israeli forces thrust deeper into Jabalia in northern Gaza on Tuesday.\n2. Israeli forces strike a hospital and destroy it with tank and air bombardments in Jabalia.\n3. Israeli forces destroy residential areas with tank and air bombardments in northern Gaza.\n4. Israeli airstrikes kill five people in Rafah in southern Gaza.\n5. Israeli forces identify a terrorist shooting mortar shells at IDF troops."}, {"id": "887761db-19c3-4acb-9e48-8451bddd949a", "title": "IDF Destroys Hamas Compound in UNRWA School , Eliminates Another Oct . 7 Terrorist | The Jewish Press - JewishPress . com | Hana Levi Julian | 15 Iyyar 5784 – Wednesday , May 22 , 2024", "date": "2024-05-22 15:30", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/idf-destroys-hamas-compound-in-unrwa-school-eliminates-another-oct-7-terrorist/2024/05/22/", "message": "Photo Credit: IDF Spokesperson's UnitThe IDF has destroyed another Hamas terror compound located in an UNRWA school run by the United Nations Relief and Works Agency for Palestinian Authority children, in Nuseirat, in central Gaza.\nIsrael’s Air Force carried out a surgical air strike this week on the compound in which an anti-tank missile operative and a Hamas Nukhba terrorist were operating.\nAlso this week, the IAF struck and eliminated Hamas terrorist Ahmed Yasser Alkara in Khan Younis.\nIn another operation, IAF fighter jets directed by intelligence eliminated five Hamas terrorists operating from inside the Faami Aljerjawi School in Daraj Tuffah in northern Gaza.\nAmong the terrorists that were eliminated were Fadi Salim, the head of propaganda in the Hamas Gaza Brigade, three Hamas intelligence operatives, and an additional Nukhba terrorist.", "location": "GAZA", "classification": "security", "score": 0.9714655878270989, "event_breakdown": "1. IDF destroyed a Hamas terror compound located in an UNRWA school run by the United Nations Relief and Works Agency for Palestinian Authority children, in Nuseirat, in central Gaza.\n2. IAF targeted an anti-tank missile operative and a Hamas Nukhba terrorist in the strike.\n3. The IAF struck and eliminated Hamas terrorist Ahmed Yasser Alkara in Khan Younis.\n4. IAF fighter jets directed by intelligence eliminated five Hamas terrorists operating from Faami Aljerjawi School in Daraj Tuffah, northern Gaza. The eliminated terrorists included the head of propaganda in the Hamas Gaza Brigade, three Hamas intelligence operatives, and an additional Nukhba terrorist."}, {"id": "ab6142bd-32c6-487b-a22f-8d392044ce38", "title": "Israeli troops push into Jabalia , airstrikes kill five in Rafah", "date": "2024-05-22 00:45", "url": "https://www.fijitimes.com.fj/israeli-troops-push-into-jabalia-airstrikes-kill-five-in-rafah/", "message": "(Reuters) – Israeli forces thrust deeper into the Jabalia camp in northern Gaza on Tuesday, laying waste to residential districts with tank and air bombardments, residents said, while Israeli air strikes killed at least five people in the southern city of Rafah.\nWe want to spare lives not extra food,” said Abu El-Nasser, a resident of Jabalia, who fled to nearby Gaza City.\nIn the north, an airstrike on a house in Jabalia killed at least three people overnight.\nIn the south, airstrikes killed three children in a house in Khan Younis and at least five people including three children in a home in Rafah.\nThe Israeli military said over the past day it had “identified a terrorist shooting mortar shells at IDF troops”, though no injuries were reported.", "location": "MAIN LOCATION: Jabalia", "classification": "security", "score": 0.9786147487143042, "event_breakdown": ".\n- Israeli forces thrust deeper into the Jabalia camp in northern Gaza.\n- Israeli forces destroyed residential districts with tank and air bombardments.\n- Israeli forces airstrike on a house in the Jabalia camp killed at least three people overnight.\n- Israeli airstrikes killed three children in a house in Khan Younis.\n- Israeli airstrikes killed at least five people including three children in a home in Rafah."}, {"id": "39fc75c7-3db8-4473-b620-cdf4a1fa7fd9", "title": "Israeli forces raze parts of Gaza Jabalia , hit Rafah with airstrikes", "date": "2024-05-22 09:30", "url": "https://www.fijitimes.com.fj/israeli-forces-raze-parts-of-gazas-jabalia-hit-rafah-with-airstrikes/", "message": "By Nidal al-Mughrabi(Reuters) – Israeli forces thrust deeper into Jabalia in northern Gaza on Tuesday, striking a hospital and destroying residential areas with tank and air bombardments, residents said, while Israeli airstrikes killed at least five people in Rafah in the south.\n“The first missile when it hit, it hit the entrance of the emergency department.\nWe tried to enter, and then a second missile hit, and the third hit the building nearby,” said Hussam Abu Safia, the head of hospital.\n“These are the only two functional hospitals remaining in northern Gaza,” Tedros said.\nThe Israeli military said over the past day it had “identified a terrorist shooting mortar shells at IDF (Israeli Defence Forces) troops,” though no injuries were reported.", "location": "GAZA", "classification": "security", "score": 0.9765150842756278, "event_breakdown": "The Israeli military thrust deeper into Jabalia in northern Gaza on Tuesday, striking a hospital and destroying residential areas with tank and air bombardments, according to eyewitnesses. Five people were killed in Israeli airstrikes in Rafah in southern Gaza, a separate report said."}, {"id": "c9a2ac26-e700-4220-9340-03cc826098ce", "title": "Israeli forces advance deeper into Rafah during night of intense fighting", "date": "2024-05-22 13:15", "url": "https://www.foxnews.com/world/night-intense-fighting-marks-israeli-advance-deeper-rafah", "message": "Israeli tanks advanced to the edge of a crowded district in Rafah during one of the most intense nights of battle since Israel launched its offensive there this month.\nPalestinian residents said Israeli drones opened fire overnight on fishing boats on the beach of Rafah, causing some to catch fire.\nIsrael says it has no choice but to attack the city to root out the last battalions of Hamas fighters it believes are sheltering there.\nIsrael's assault on Rafah on Gaza's southern edge has set hundreds of thousands of people fleeing what had been a refuge for half of the enclave's 2.3 million people.\nIsrael says it has no choice but to attack the city to root out the last battalions of Hamas fighters it believes are sheltering there.", "location": "GAZA", "classification": "security", "score": 0.8809365868431716, "event_breakdown": "Israeli tanks advanced to the edge of a crowded district in Rafah during one of the most intense nights of battle since Israel launched its offensive there this month\n- Israeli drones opened fire on fishing boats on the beach of Rafah\n- Israel attacked the Rafah City to uproot the last battalions of Hamas fighters\n\nOutcome\nEastern Rafah is one of the most crowded areas in the Gaza strip."}, {"id": "36935df2-0c16-4359-be92-23b98645f64f", "title": "Russian forces attack Pokrovsk suburb with Iskander missile : 2 civilians killed – photos", "date": "2024-05-22 08:15", "url": "https://www.yahoo.com/news/russian-forces-attack-pokrovsk-suburb-063957224.html", "message": "Two people have been killed and two more, including a child, injured in a Russian missile attack on the outskirts of the town of Pokrovsk (Donetsk Oblast).\nSource: Donetsk Oblast Prosecutor's Office on FacebookQuote: \"Russian forces launched a missile attack on the territory of the village of Rih in Pokrovsk at 23:00 on 21 May.\nThe aftermath of the Russian strikes on the outskirts of PokrovskPhoto: Donetsk Oblast Prosecutor's OfficeDetails: In addition, a 24-year-old resident of a neighbouring house was injured.\nThe aftermath of the Russian strikes on the outskirts of PokrovskPhoto: Donetsk Oblast Prosecutor's OfficeThe explosion damaged three households and a gas pipeline.\nThe aftermath of the Russian strikes on the outskirts of PokrovskPhoto: Donetsk Oblast Prosecutor's OfficeSupport UP or become our patron!", "location": "Pokrovsk", "classification": "security", "score": 0.9608695518887728, "event_breakdown": "Pokrovsk, Donetsk Oblast, Russia\n1. Missile attack on village outside of Pokrovsk, Donetsk Oblast, Russia killed two, injured two more (including a child) on May 21, 2022 at 11:00 PM\n2. Missile damage to three households and a gas pipeline reported in the aftermath of the attack."}, {"id": "e212eeb0-bfa1-41f4-8b9f-5d445313981e", "title": "Operation Iron Swords", "date": "2024-05-22 03:45", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-21.htm", "message": "Operation Iron Swords - Day 228 - 21 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nAnother demand that makes it very difficult to accept the proposal from Israel's point of view is to stop the war in Gaza.\nAs part of the operation, the security forces conduct an exchange of fire with armed terrorists in the area and work to destroy terrorist infrastructures, terrorist attacks have been identified.\nThe \"barbaric scenes\" according to truck drivers, happened after the Israeli forces accompanying convoys of settlers completely disregarded the attacks.\nIn March, the International Court of Justice instructed Israel to ensure unimpeded access of food aid into Gaza.", "location": "Based on the context provided, I was unable to find a specific location for the event described in the text.", "classification": "security", "score": 0.9254229224629821, "event_breakdown": "Security events:\n- Exchange of fire with armed terrorists in the area\n- Attacks on convoys of settlers\n- Unidentified terrorist attacks\n- Israeli security forces disregarding attacks on convoys of settlers."}, {"id": "6bb817f9-4351-4171-b79c-ca5d2c973a28", "title": "Israeli attack in West Bank city leaves 7 dead and journalist injured , Palestinians say", "date": "2024-05-22 01:30", "url": "https://www.cbc.ca/news/world/jenin-west-bank-israeli-attack-rafah-gaza-1.7210650", "message": "Heavy-tracked armoured bulldozers tore up streets near the centre of the city, protected by Israeli forces in at least 20 vehicles.\nA girl walks next to cars destroyed during an Israeli military operation in Jenin, in the Israeli-occupied West Bank, on Tuesday.\nWATCH | 'They opened fire directly on us,' photojournalist says: Palestinian photojournalist hit as Israeli army raids West Bank city Duration 0:46 Amr Manasra says he was injured by shrapnel as he covered Israel's raid on Jenin, a city in the West Bank.\nThe attack killed seven Palestinians, health authorities in the West Bank said.\nWATCH | Palestinians draw comparisons between 1948 Nakba and current Gaza war: Palestinians in Gaza say current war more severe than 1948's Nakba Duration 1:54 Palestinians in Khan Younis reflected on the devastation of the ongoing Israel-Hamas war in Gaza as they marked the 76th anniversary of the Nakba.", "location": "Israeli-occupied West Bank", "classification": "security", "score": 0.9624992961465508, "event_breakdown": "The security events in the text are:\n1. Israeli forces carry out a military operation in the city of Jenin, in the Israeli-occupied West Bank.\n2. At least 20 Israeli forces vehicles participate in the operation.\n3. Heavy-tracked armoured bulldozers tear up streets near the center of the city during the operation.\n4. Israeli forces open fire during the operation, killing seven Palestinians, according to health authorities in the West Bank.\n5. An Israeli attack on the city kills seven Palestinians, according to health authorities in the West Bank.\n6. Palestinians in Gaza compare the destruction caused by the current Israel-Hamas war in Gaza to that of 1948's Nakba."}, {"id": "cbcc55cb-ab49-43c5-b575-ac2817723340", "title": "Israeli forces move deeper into Rafah in night of heavy battle", "date": "2024-05-22 10:30", "url": "https://www.yahoo.com/news/israeli-forces-move-deeper-rafah-093526800.html", "message": "Israel's assault on Rafah on Gaza's southern edge has set hundreds of thousands of people fleeing what had been a refuge for half of the enclave's 2.3 million people.\nIts troops have been slowly moving into the eastern outskirts of Rafah since the start of the month.\nThere was no immediate word from the Israeli military on Rafah.\nIn the central Gaza Strip town of Zawayda, an Israeli air strike killed seven people in one house, medics said.\nOn Gaza's northern edge in Jabalia, the largest of Gaza's eight historical refugee camps, Israeli forces pressed on with a ground offensive that has carried on in parallel with the Rafah assault for two weeks.", "location": "GAZA", "classification": "security", "score": 0.9280984077300009, "event_breakdown": "1. An Israeli assault on Rafah, Gaza's southern edge, has displaced hundreds of thousands of people.\n2. Israeli troops are moving into the eastern outskirts of Rafah, where the assault is ongoing.\n3. In Jabalia, the largest of eight refugee camps in Gaza, Israeli forces have continued a ground offensive for two weeks.\n4. In Zawayda, an Israeli airstrike has killed seven people in one house, according to medics."}, {"id": "a77ae546-e34a-482f-bb26-34cdf091ec25", "title": "Israeli forces move deeper into Rafah after night of heavy bombardment", "date": "2024-05-22 11:15", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-move-deeper-into-rafah-after-night-of-heavy-bombardment/", "message": "Israel’s assault on Rafah on Gaza’s southern edge has set hundreds of thousands of people fleeing what had been a refuge for half of the enclave’s 2.3 million people.\nIts troops have been slowly moving into the eastern outskirts of Rafah since the start of the month.\nThere was no immediate word from the Israeli military on Rafah.\nIn the central Gaza Strip town of Zawayda, an Israeli air strike killed seven people in one house, medics said.\nOn Gaza’s northern edge in Jabalia, the largest of Gaza’s eight historical refugee camps, Israeli forces pressed on with a ground offensive that has carried on in parallel with the Rafah assault for two weeks.", "location": "GAZA", "classification": "security", "score": 0.9573936554422473, "event_breakdown": "* Israeli assault in Rafah, southern edge\n* Israeli troops moving into eastern outskirts of Rafah\n* Israeli air strikes kill seven people in one house in Zawayda, central Gaza Strip\n* Israeli ground offensive in Jabalia, northern edge"}, {"id": "08b6ae4d-8d36-4da2-8e3a-a0eaf72f4556", "title": "Israeli forces move deeper into Rafah in night of intense bombardment of Gazan city", "date": "2024-05-22 15:45", "url": "https://www.irishtimes.com/world/middle-east/2024/05/22/israeli-forces-move-deeper-into-rafah-in-night-of-intense-bombardment-of-gazan-city/", "message": "A Palestinian man and his children sit in a destroyed room following the targeting or a residential building by an Israeli airstrike in Rafah in southern Gaza on Wednesday.\nIsrael's assault on Rafah on Gaza's southern edge has set hundreds of thousands of people fleeing what had been a refuge for half of the enclave's 2.3 million people.\nPeople walk past a mound of trash and destroyed buildings as smoke rises during Israeli bombardment in Jabalia on May 14th.\nIn the central Gaza Strip town of Zawayda, an Israeli air strike killed seven people in one house, medics said.\nOn Gaza's northern edge in Jabilia, the largest of Gaza's eight historical refugee camps, Israeli forces pressed on with a ground offensive that has carried on in parallel with the Rafah assault for two weeks.", "location": "GAZA", "classification": "security", "score": 0.9777633839255947, "event_breakdown": "- Israeli assault on Rafah, a Palestinian town on Gaza's southern edge\n-  Hundreds of thousands of people have fled to Rafah from other parts of Gaza due to this assault\n- Israel strikes killed over 19 people in Rafah, including seven in a residential building\n- A further 252 were killed in the northern town of Zawayda in an Israeli air strike, medics said.\n- Israeli forces press on with a ground offensive in Jabilia, the largest of Gaza's eight historical refugee camps"}, {"id": "57242080-7780-48b1-a5dd-de5eff3eedbb", "title": "Day 229 of Genocide : Civilians killed , injured , in Israeli bombardment of Gaza | World", "date": "2024-05-22 08:15", "url": "https://en.ammonnews.net/article/72785", "message": "Home WorldDay 229 of Genocide: Civilians killed, injured, in Israeli bombardment of GazaAmmon News - Dozens of Palestinian civilians were Wednesday morning killed and others were injured after the Israeli occupation forces bombed various areas of the Gaza Strip, in the ongoing aggression for the 229th day in a row.\nIsraeli warplanes launched an attack on Al-Zaytoun neighborhood, southeast of Gaza City, killing at least two people and a number of wounded who were transported to the Baptist Hospital in the city.\nThe Israeli occupation army artillery fired shells at the southern and northern areas of Gaza City, and at the eastern area of ​​the Nuseirat camp in the central Gaza Strip.\nA number of citizens were injured when Israeli warplanes bombed a house owned by Farhat family in Tal Al-Sultan, west of the city of Rafah, south of the Gaza Strip.\nThey were transferred to Kuwait Specialized Hospital, west of the city.", "location": "GAZA CITY", "classification": "security", "score": 0.9983128178311808, "event_breakdown": "* Israeli warplanes launch an attack in Al-Zaytoun neighborhood, southeast of Gaza City.\n* Israeli army artillery fires shells at Gaza City's southern and northern areas, and at the eastern area of the Nuseirat camp in the central Gaza Strip.\n* Israeli warplanes bomb a house owned by Farhat family in Tal Al-Sultan, west of Rafah.\n* Citizens are injured in the bombings and transported to a hospital."}, {"id": "e73d9475-45de-471f-8807-f68dd023a37d", "title": "PTI calls for judicial commission to probe attack on Raoof Hasan - Pakistan", "date": "2024-05-22 13:15", "url": "https://www.brecorder.com/news/40304703/pti-calls-for-judicial-commission-to-probe-attack-on-raoof-hasan", "message": "The Pakistan Tehreek-e-Insaf (PTI) on Wednesday demanded that a judicial commission investigate what it called a “terrorist attack” on the party’s central information secretary Raoof Hasan.\nRaoof Hasan was attacked by a group of four unknown persons.\n“Such shameful tactics will not deter Raoof Hasan or the PTI from our cause.\n“This [the attack] is an assassination attempt and clearly an act of terrorism,” Ayub maintained while accusing the police of tampering.\nThe opposition leader also warned that PTI would stage protests nationwide if the party leaders were attacked again.", "location": "ISLAMABAD", "classification": "security", "score": 0.90379643031413, "event_breakdown": "Security events:\n- Attack on Raoof Hasan, central information secretary of the Pakistan Tehreek-e-Insaf (PTI)\n- Four unknown persons attacking\n- Attempted assassination\n- Terrorism\n- Police tampering\n- Threats of nationwide protests by PTI"}, {"id": "f64bfaf7-f00d-447e-892e-3786e3595a10", "title": "Hamas missile operative who took part in October 7 massacre eliminated", "date": "2024-05-22 09:15", "url": "http://www.israelnationalnews.com/news/390345", "message": "תיעוד מחיסול המחבל דובר צה\"לThe IDF announced that following precise intelligence, the IAF struck and eliminated the Hamas terrorist Ahmed Yasser Alkara in Khan Yunis.\nAhmed Yasser Alkara took part in the October 7th Massacre in communities in southern Israel and was a significant anti-tank missile operative who carried out attacks on IDF troops during the war.\nDuring the preparations for the operation, the IDF aborted the strike after a child was identified nearby the terrorist Ahmed Yasser Alkara.\nIn another operation, IAF fighter jets directed by intelligence eliminated five Hamas terrorists operating from inside the Faami Aljerjawi School in Daraj Tuffah in the northern Gaza Strip.\nAmong the terrorists that were eliminated were Fadi Salim, Head of Propaganda in Hamas’ Gaza Brigade, as well as three Hamas intelligence operatives and an additional Nukhba terrorist.", "location": "GAZA", "classification": "security", "score": 0.967511403213364, "event_breakdown": "1. The IDF announced that following precise intelligence, the IAF struck and eliminated the Hamas terrorist Ahmed Yasser Alkara in Khan Yunis, Gaza.\n2. The IDF aborted the strike on Ahmed Yasser Alkara after identifying a child nearby.\n3. IAF fighter jets directed by intelligence eliminated five Hamas terrorists operating from inside the Faami Aljerjawi School in Daraj Tuffah, northern Gaza.\n4. The eliminated terrorists included Fadi Salim, Head of Propaganda in Hamas' Gaza Brigade, and three Hamas intelligence operatives, and another Nukhba terrorist."}, {"id": "4db003bf-ee4f-4e87-b454-3243b9a4a6c9", "title": "Remembering the 22 lives lost at Manchester Arena , seven years on", "date": "2024-05-22 08:15", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/remembering-the-22-lives-lost-29215989", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up for our daily newsletter to get the day's biggest stories sent direct to your inboxSomething went wrong, please try again later.\nToday we remember the 22 people who lost their lives in the terrorist attack and many more who were injured or otherwise affected.\nA minute's silence will be held during a special memorial service at 12pm, which will be led by the railway chaplain, Mike Roberts.", "location": "NULL", "classification": "security", "score": 0.41252504059609796, "event_breakdown": "The text mentions two security events:\n\n1. The terrorist attack on the Manchester Arena on May 22, 2017, in which 22 people were killed and several more were injured or otherwise affected.\n2. The special memorial service that will be held at 12pm on May 22, 2022, which will be led by the railway chaplain, Mike Roberts, and will include a minutes silence."}, {"id": "24f75df3-8289-4f27-853c-9d708773ffff", "title": "Latest Israeli strikes in Gaza kill a mother and her unborn child", "date": "2024-05-22 14:30", "url": "https://www.yahoo.com/news/latest-israeli-strikes-gaza-kill-135102569.html", "message": "The move is intended to pressure Israel to accept a political process to end its war with Hamas in the Gaza Strip.\nIsrael reacted angrily to the decision, calling it \"a distorted step\" and recalling its ambassadors to the three countries.\nThe bodies of Palestinians, killed in Israeli attacks on Jabalia and Beit Lahia in northern Gaza, are brought to the morgue of the al-Ahli Baptist Hospital in Gaza City, May 22, 2024.\nA worker from the Kamal al-Adwan hospital evacuates a Palestinian patient after Israeli airstrikes damaged the hospital in the Jabalia refugee camp in the northern Gaza Strip, May 21, 2024.\n/ Credit: Karam Hassan/Anadolu/GettyAn Israeli strike in the central Gaza town of Deir al Balah killed at least 12 people, including small children, al-Ghoul reported.", "location": "GAZA CITY", "classification": "security", "score": 0.983008161036496, "event_breakdown": ".\n* Israeli strike on central Gaza town of Deir al Balah kills 12 people\n* Israeli attacks on Jabalia and Beit Lahia in northern Gaza claim numerous lives\n* Bodies of Palestinians killed in Israeli attacks brought to morgue\n* Israeli airstrikes damage hospital in Jabalia refugee camp"}, {"id": "e4559590-2d94-441a-bb03-d8941fff3ef9", "title": "Ukraine plunged into darkness as Russia attacks power grid", "date": "2024-05-22 06:15", "url": "https://www.euronews.com/2024/05/22/ukraine-plunged-into-darkness-as-russia-attacks-power-grid", "message": "By Euronews with APRolling attacks by Moscow on Ukrainian energy infrastructure have forced Kyiv to implement nationwide blackouts.\nADVERTISEMENTWeeks of Russian strikes on Ukraine's power grid have forced leaders of the war-ravaged country to institute nationwide rolling blackouts.\nAn strike in April damaged the Ukrainian capital's largest thermal power plant, while a massive attack on 8 May hit power generation and transmission facilities in several regions.\n“With each attack we lose additional power generation, so it just goes minus, minus, minus,” Halushchenko said on Tuesday.\nA man looks on fragments of a Russian rocket that hit a thermal power plant in Ukraine, Tuesday, May 21, 2024.", "location": "Kyiv", "classification": "security", "score": 0.67111962411596, "event_breakdown": ".\nRussian attacks on Ukrainian energy infrastructure have forced Kyiv to implement nationwide blackouts.\nIn the text there are 2 different security events\n1. Moscow attacks Ukrainian energy infrastructure, forcing Kyiv to implement nationwide blackouts.\n2. Moscow launched a major attack May 8 that struck power generation and transmission facilities in several regions of Ukraine."}, {"id": "b4958a22-bf49-44d9-9a3e-cfc1d2f92eaa", "title": "U . S . Military Stockpiles are Dangerously Undersupplied", "date": "2024-05-22 00:45", "url": "https://foreignpolicy.com/2024/05/21/united-states-defense-pentagon-military-industrial-base-ammunition/?tpcc=recirc_trending062921", "message": "The Pentagon cannot continue to kick the can down the road and promise to buy more munitions next year.\nOur analysis of the 2024 request confirmed that the Defense Department was addressing critical gaps in maritime strike and air defense weapons, but needed to do more.\nBut after decades of neglecting anti-ship weapons, the Pentagon is still not making the scale of investments needed to meet projected demands.\nThe Navy, for example, stopped buying heavyweight torpedoes for decades, and since restarting production lines, it has only purchased 539 torpedoes.\nDespite the Pentagon’s continued pledges to expand inventories of key conventional weapons, munitions continue to lose in budget battles to larger platforms.", "location": "The Pentagon, Washington, D.C.", "classification": "security", "score": 0.5043640080154324, "event_breakdown": "1. The Pentagon cannot continue to kick the can down the road and promise to buy more munitions next year.\n2. Our analysis of the 2024 request confirmed that the Defense Department was addressing critical gaps in maritime strike and air defense weapons, but needed to do more.\n3. But after decades of neglecting anti-ship weapons, the Pentagon is still not making the scale of investments needed to meet projected demands.\n4. The Navy, for example, stopped buying heavyweight torpedoes for decades, and since restarting production lines, it has only purchased 539 torpedoes."}, {"id": "a8fbf608-bb3f-4472-b3ba-3eef9a86fa77", "title": "Source close to Hizbollah says 4 dead in Israeli strikes on Lebanon", "date": "2024-05-22 00:45", "url": "http://jordantimes.com/news/region/source-close-hizbollah-says-4-dead-israeli-strikes-lebanon", "message": "Hizbollah, a Hamas ally, has traded near daily cross-border fire with Israeli forces since the Palestinian group's October 7 surprise attack on southern Israel that sparked the war in Gaza.\nThe source close to Hizbollah told AFP that \"at least four Hizbollah fighters were killed in Israeli raids on two different sites in southern Lebanon\", identifying the locations as Naqura on the coast and Mais Al Jabal, a border village to the east.\nA Hizbollah fighter was also killed on Monday in a strike in neighbouring Syria blamed on Israel, a separate source from the group told AFP.\nHizbollah said it launched a heavy rocket attack at an Israeli army barracks in the country’s north “in retaliation” for the Naqura strike, while also announcing other attacks on Israeli positions.\nThe violence has raised fears of all-out conflict between Hizbollah and Israel, which went to war in 2006.", "location": "Naqura", "classification": "security", "score": 0.9725754080516641, "event_breakdown": "October 7: Hizbollah attacks Israel.\nOctober 25: Five dead in Israel.\nOctober 26: Five dead in Israel.\nOctober 27: Hizbollah attacks Israel in retaliation.\nOctober 29: Four dead in southern Lebanon."}, {"id": "276a27f8-32f3-4e52-a82b-6b0c6ccd7d77", "title": "USS Leyte Gulf returns to Norfolk from final deployment before decommissioning in September", "date": "2024-05-22 04:45", "url": "https://www.stripes.com/branches/navy/2024-05-21/uss-leyte-gulf-returns-norfolk-decommissioning-13933533.html", "message": "The guided-missile cruiser USS Leyte Gulf returns to Naval Station Norfolk on May 17, 2024, after its final deployment.\nA formation of sailors stand by to assist the guided-missile cruiser USS Leyte Gulf as it returns to Naval Station Norfolk on May 17, 2024, after its final deployment.\nAlescia Austin greats her family after the USS Leyte Gulf returned to Naval Station Norfolk on May 17, 2024, following its final deployment.\nNavy) Logistics Specialist 2nd Class Edgardo Manzaniloa greets his family after the USS Leyte Gulf returned to Naval Station Norfolk on May 17, 2024, following its final deployment.\nNavy) Chief Gas Turbine Systems Technician Thomas Midgette greets his family after the USS Leyte Gulf returned to Naval Station Norfolk on May 17, 2024, following its final deployment.", "location": ")\nNaval Station Norfolk", "classification": "security", "score": 0.8963200065125966, "event_breakdown": "1. USS Leyte Gulf returns to Naval Station Norfolk on May 17, 2024, after its final deployment.\n2. Sailors stand by to assist the guided-missile cruiser USS Leyte Gulf as it returns to Naval Station Norfolk.\n3. Alescia Austin greets her family after the USS Leyte Gulf returned to Naval Station Norfolk.\n4. Navy Logistics Specialist 2nd Class Edgardo Manzaniloa greets his family after the USS Leyte Gulf returned to Naval Station Norfolk.\n5. Navy) Chief Gas Turbine Systems Technician Thomas Midgette greets his family after the USS Leyte Gulf returned to Naval Station Norfolk."}, {"id": "8874a708-24cd-4c52-9dbc-a4ccf706401f", "title": "UNRWA school used as Hamas military compound", "date": "2024-05-22 14:00", "url": "http://www.israelnationalnews.com/news/390355", "message": "Following IDF and ISA intelligence, the IAF carried out a precise strike on a compound located inside a UNRWA school where Hamas terrorists - including an anti-tank missile operative and a Nukhba terrorist - were operating.\nThe compound that was struck also contained weapons, including mortars and explosives, as evidenced by the numerous secondary explosions after the strike.\nThe IDF stated that the strike was carefully planned and carried out using precise munitions to mitigate any harm to civilians in the area.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.9848970038749376, "event_breakdown": "Security Events:\n\n1. IAF airstrike on a compound located inside a UNRWA school.\n2. Presence of Hamas terrorists in the compound struck by the IAF, including an anti-tank missile operative and an Nukhba terrorist.\n3. Storage of weapons in the compound, including mortars and explosives.\n4. IAF strike resulted in numerous secondary explosions after the strike on the compound.\n\n(Related incident:)\n5. Precautionary measures taken during the strike to mitigate any harm to civilians in the area.\n\nNote: The IDF's statement regarding the careful planning and execution of the strike may not be counted as a separate security event, as it is directly connected to the planning and execution of the initial strike on the compound."}, {"id": "ca3a6f20-bb17-4259-be9e-6d218d84ea71", "title": "In the Vicinity of the Mosque - Resistance Roundup - Day 228", "date": "2024-05-22 00:45", "url": "https://www.palestinechronicle.com/in-the-vicinity-of-the-mosque-resistance-roundup-day-228/", "message": "By Palestine Chronicle StaffClashes between Palestinian Resistance and invading Israeli forces took place in every area of the war-torn Gaza Strip.\nAl-Qassam fighters killed and wounded several members of the occupation forces in the vicinity of the Omar bin al-Khattab Mosque, using anti-personnel television bombs and hand grenades.\nIn this video, Al-Qassam fighters are seen sniping an Israeli soldiers and bombing Israeli gatherings in the Netzarim axis.\nAt 15:05, a gathering of Israeli enemy soldiers in the vicinity of the Rahib site was targeted with rocket weapons.\nAt 17:20, a gathering of Israeli enemy soldiers at Karantina Hill was targeted with artillery shells.”(The Palestine Chronicle)", "location": "GAZA", "classification": "security", "score": 0.9946717038249884, "event_breakdown": "* Clashes between Palestinian Resistance and invading Israeli forces took place in every area of the war-torn Gaza Strip.\n* Al-Qassam fighters killed and wounded several members of the occupation forces in the vicinity of the Omar bin al-Khattab Mosque, using anti-personnel television bombs and hand grenades.\n* Al-Qassam fighters are seen sniping an Israeli soldiers and bombing Israeli gatherings in the Netzarim axis.\n* A gathering of Israeli enemy soldiers in the vicinity of the Rahib site was targeted with rocket weapons.\n* A gathering of Israeli enemy soldiers at Karantina Hill was targeted with artillery shells."}, {"id": "70494839-00b3-4cfb-8286-776b38a690c9", "title": "On This Day : People in Ireland vote to approve Good Friday Agreement in 1998", "date": "2024-05-22 03:45", "url": "https://in-cyprus.philenews.com/international/on-this-day-people-in-ireland-vote-to-approve-good-friday-agreement-in-1998/", "message": "1967 – A fire at the Brussels department store “L’Innovation” killed over 320 people.\n1998 – Northern Ireland’s voters approved a peace agreement designed to end 30 years of Protestant-Catholic bloodshed.\nAlmost 95 percent of voters in the Irish Republic simultaneously approved related changes to their own constitution.\n2003 – The U.N. Security Council voted 14-0 to adopt a U.S.-led resolution ending sanctions on Iraq after 13 years.\n2003 – Canadian speed skater Catriona Le May Doan, who set eight world records, announces her retirement.", "location": "Northern Ireland", "classification": "security", "score": 0.8051991442850307, "event_breakdown": "Three security events are described in the text:\n\n1. A fire at the Brussels department store \"L'Innovation\" killed over 320 people.\n2. Northern Irish voters approved a peace agreement designed to end 30 years of Protestant-Catholic bloodshed.\n3. The U.N. Security Council voted 14-0 to adopt a U.S.-led resolution ending sanctions on Iraq after 13 years."}, {"id": "4005cbe1-24bc-4b4a-9257-d10088064bee", "title": "The PA Return to Gaza : Impractical and Unwanted | The Jewish Press - JewishPress . com | Yoni Ben Menachem | 14 Iyyar 5784 – Wednesday , May 22 , 2024", "date": "2024-05-22 11:15", "url": "https://www.jewishpress.com/indepth/opinions/the-pas-return-to-gaza-impractical-and-unwanted/2024/05/22/", "message": "Photo Credit: Issam Rimawi / Flash90The prospect of the Palestinian Authority returning to control Gaza is not practical.\nThe PA has already lost security control in northern Samaria and cannot manage Gaza or confront Hamas’ military wing.\nThe Gazan public harbors significant animosity towards Abbas, who imposed sanctions on Gaza in 2018 to incite rebellion against Hamas.\nThe PA’s loss of security control in northern Samaria to Iranian-backed terrorist groups raises further doubts about its ability to manage Gaza.\nConclusionGiven the opposition from the Palestinian public, Israel, and the PA’s weakened state, the possibility of the PA returning to control Gaza is unlikely and impractical.", "location": "Gaza", "classification": "security", "score": 0.8553514120577664, "event_breakdown": "The events are:\n1. The Palestinian Authority loseing security control in northern Samaria.\n2. Reports of confrontation between Palestinian Authority and Iranian-backed terrorist groups.\n3. Reports of Anti-PA sentiment among Gazan public.\n4. Sanctions imposed by PA in 2018.\n5. Palestinian public animosity towards PA president.\nGiven the opposition to PA control of Gaza and the apparent erosion of PA’s security control, the prospect of PA returning to control Gaza is considered unlikely and impractical."}, {"id": "b53ae5f2-93c1-4fc6-bb4b-b2f15f254a06", "title": "Food distribution in Rafah suspended due to security situation", "date": "2024-05-22 08:30", "url": "https://www.siasat.com/food-distribution-in-rafah-suspended-due-to-security-situation-3030568/", "message": "Tel Aviv: The United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) temporarily suspended food distribution in Rafah in the south of the Gaza Strip, it wrote on the social media platform X.\nThe Israeli military operation was continuing in Rafah on the border with Egypt, particularly in the east of the city.\n🛑As a result of the ongoing military operation in eastern Rafah the @UNRWA distribution centre and @WFP warehouse, both in #Rafah, are now inaccessible.\nFood distributions in Rafah, southern📍#Gaza, are currently suspended due to lack of supplies and insecurity.\nMore than 35,000 people, mainly women and children, have been killed in the Israeli assault on the Gaza Strip, and around 80,000 injured.", "location": "Tel Aviv", "classification": "security", "score": 0.8062691177984866, "event_breakdown": "Events include an Israeli military operation in eastern Rafah on the Gaza Strip border with Egypt that limited access to a UNRWA distribution centre and a WFP warehouse in Rafah, causing the suspension in food distributions in the area."}, {"id": "79404568-a603-4d16-b866-da1870f67829", "title": "Qatar : A threat to the West", "date": "2024-05-22 11:00", "url": "https://www.americanthinker.com/blog/2024/05/qatar_a_threat_to_the_west.html", "message": "Qatar owns the French department store chain Printemps and numerous luxury hotels in London, including the Ritz and Claridge.\nQatar is heavily invested in giant German corporations such as Siemens, Volkswagen, Porsche, and Deutsche Bank.\nQatar has a stake in London’s Heathrow Airport, Barclay’s Bank, and the Sainsbury supermarket chain in the U.K.Today, Qatar controls the largest banks in western Europe.\nA headline in Ynet-News (an Israeli daily) on April 18, 2024 announced, “Qatar funds more terrorism than Iran.”It was Udi Levy who pointed out that Qatar is dancing at two weddings by complying with the West while funding widespread terrorism across the globe.\nDoha’s emir became the Muslim Brotherhood patron.", "location": "The main event takes place in London, United Kingdom.", "classification": "security", "score": 0.6991725624282944, "event_breakdown": "1. Qatar funds more terrorism than Iran - Ynet-News\n2. Qatar gained control over giant German corporations such as Siemens, Volkswagen, Porsche, and Deutsche Bank\n3. Doha’s emir became the Muslim Brotherhood patron."}, {"id": "f71999e5-015c-4d74-8912-80d825a54a41", "title": "Ukraine Army Gunners Now Finding – Some – Shells to Hit Latest Russian Assaults", "date": "2024-05-22 14:00", "url": "https://www.kyivpost.com/post/33005", "message": "The Armed Forces of Ukraine (AFU) first ran short of artillery ammunition in April 2022 and since then has suffered chronic shell shortages.\nIn past months Ukrainian howitzer and mortar crews were critically short of ammunition and sometimes lacked ammunition to shoot at Russian assaults.\nArtillery ammunition is available in quantities sufficient to crush all attacks and launch effective offensives at no location on the front, he said.\nAdvertisementZelensky said Europe’s main plan to get Ukraine more shells in the shorter term, a Czech-led initiative to pool funds and buy Ukraine artillery shells on international markets, was moving forward.\nThe Czech initiative initially should deliver Ukraine 500,000 155mm shells and 300,000 122mm shells, Prague officials have said.", "location": "Ukraine", "classification": "security", "score": 0.701708155958944, "event_breakdown": "Security Events:\n1. The Armed Forces of Ukraine first ran short of artillery ammunition in April 2022.\n2. Ukrainian howitzer and mortar crews were critically short of ammunition and sometimes lacked ammunition to shoot at Russian assaults.\n3. Artillery ammunition is available in quantities sufficient to crush all attacks and launch effective offensives at no location on the front.\n4. The Czech-led initiative to deliver Ukraine artillery shells is moving forward.\n5. The Czech initiative initially should deliver Ukraine 500,000 155mm shells and 300,000 122mm shells."}, {"id": "7baee7b6-66fa-4e94-b003-d30e400a3f5f", "title": "7 Israeli soldiers killed and injured in Gaza explosions and sniper fire", "date": "2024-05-22 16:45", "url": "https://www.albawaba.com/news/7-israeli-soldiers-killed-and-injured-gaza-explosions-and-sniper-fire-1568299", "message": "ALBAWABA- Two Israeli soldiers were killed and four others injured in separate incidents involving an explosive device and sniper fire in the Gaza Strip, according to Israeli media.\nThe Al-Qassam Brigades claimed responsibility for the sniper attack, stating their fighters managed to snipe three Israeli soldiers north of Beit Hanoun in the Gaza Strip.\nA widely circulated video released by the Al-Qassam Brigades shows an Al-Qassam sniper shooting two Israeli soldiers with a single bullet and a third soldier with another bullet.\nThe Al-Quds Brigades confirmed that Israeli forces are using explosive robots in Rafah and Gaza to detonate houses.\nMembers of the Al-Quds Brigades, the military wing of Islamic Jihad, managed to neutralize one of the explosive robots.", "location": "Gaza Strip", "classification": "security", "score": 0.9989035237669717, "event_breakdown": "1. Sniper attack by Al-Qassam Brigades in the Gaza Strip, north of Beit Hanoun, killing two Israeli soldiers and injuring four others.\n2. Al-Quds Brigades' success in neutralizing an explosive robot used by Israeli forces in Rafah and Gaza."}, {"id": "7a36f205-afa2-44d9-92fa-73d1317abbcb", "title": "Palestinian death toll in Gaza rises to 35 , 647 : Health authorities", "date": "2024-05-22 03:45", "url": "https://www.siasat.com/palestinian-death-toll-in-gaza-rises-to-35647-health-authorities-3030474/", "message": "Gaza: The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to 35,647, health authorities in the Palestinian enclave said in a press statement.\nDuring the past 24 hours, the Israeli army killed 85 Palestinians and wounded 200 others, bringing the total death toll to 35,647 and injuries to 79,852 since the Palestinian-Israeli conflict broke out in October 2023, Xinhua news agency reported on Tuesday.\nIsraeli forces killed several militants in the Jabalia area of the northern Gaza Strip, including a “terrorist group” that was shooting at soldiers, the statement said.\nIt added that the Israeli forces were continuing their operations in the southernmost Gazan city of Rafah, where a drone killed a “terrorist” who was firing mortar shells at Israeli soldiers.\nIsrael launched a large-scale offensive in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on October 7, 2023, during which about 1,200 people were killed and around 250 were taken hostage.", "location": "GAZA STRIP", "classification": "security", "score": 0.9889608987928475, "event_breakdown": "- Continued Israeli airstrikes in the Gaza Strip\n- Continued Israeli army operations in the Gaza Strip\n- Continued operations by Israeli forces in the Gaza Strip city of Rafah\n- Israeli drone strike kills a \"terrorist\" in Rafah"}, {"id": "ad1a70d8-cbe5-43b6-843c-bb9a57dc6cf5", "title": "Moral Cretins at the ICC", "date": "2024-05-22 11:15", "url": "https://freebeacon.com/israel/moral-cretins-at-the-icc/", "message": "The specifics of the charges illustrate the ICC’s moral obscenity and its ignorance of the way democracies have historically responded to existential threats.\nEstablished in 2002, the ICC ostensibly polices genocide and other war crimes.\nPublic opinion was supportive.\nLikewise, Israeli public opinion is supportive of the conduct of this war.\nUndeterred by preening prosecutors in the Hague, Israel should ignore the ICC and take a page from the Greatest Generation.", "location": "The ICC is the Headquarters of the International Criminal Court, and its located in The Hague, Netherlands.", "classification": "security", "score": 0.6249332317703373, "event_breakdown": "- Israeli public opinion supportive of the conduct of the war\n- International Criminal Court (ICC) policing genocide and other war crimes"}, {"id": "c35d49c3-66ca-4f43-ac60-16eae2dda983", "title": "Russia nuclear weapons drills in Ukraine are derided as  theatrical  ", "date": "2024-05-22 13:45", "url": "https://www.yahoo.com/news/russia-nuclear-weapons-drills-ukraine-130308501.html", "message": "Troops can be seen readying mobile Iskander missile systems – which are capable of delivering strikes with both nuclear and conventional rockets.\nDetails of the nuclear programme are closely guarded but the move to blur the warhead was described by analysts as “theatrical”.\nExperts said the exercises were designed as a reminder of Russia’s threat to use tactical nuclear weapons in Ukraine.\n‘Nuclear threat is a paper tiger’Hamish de Bretton-Gordon, a former commander of the Joint Chemical, Biological, Radiological and Nuclear Regiment, said: “This is more bluff and bluster.\n“This is another indication that Russia’s tactical nuclear threat is a paper tiger and should be treated as such.", "location": "Ukraine", "classification": "security", "score": 0.6070519665396202, "event_breakdown": "1. Russia conducted exercises with its Iskander missile systems.\n2. The Iskander missile systems can deploy both nuclear and conventional warheads.\n3. The exercises were described as \"theatrical\" as the Russian warheads were blurred.\n4.These exercises were likely meant as a reminder of Russia's threat to use tactical nuclear weapons in Ukraine.\n5. Experts believe that this is just more bluster and not to be taken seriously."}, {"id": "43c6b792-ce4f-4c6c-920a-1f0709a5edeb", "title": "May 20 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-05-22 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240521-presstv04.htm", "message": "Targeted an Israeli military Apache helicopter with a SAM-7 missile east of the Jabalia camp in the northern Gaza Strip.\nAl-Aqsa Martyrs Brigades' operations on May 20:Bombed an Israeli military gathering and military vehicles positioned in the vicinity of the Eastern Cemetery with a 107-type short-range rocket barrage.\nBombed a gathering of Israeli soldiers and their military vehicles east of the Jabalia camp with regular 60-caliber mortar shells.\nAt around 22:30 local time, Israeli soldiers at the Al-Malikiyah site were targeted with appropriate weapons.\nIslamic Resistance in Iraq's operations on May 20:Targeted an Israeli military site in Umm Al-Rashrash (Eilat) in the occupied Palestinian territories with at least two drones.", "location": "Gaza Strip", "classification": "security", "score": 0.996862893366805, "event_breakdown": "1. Al-Aqsa Martyrs Brigades' operations on May 20:\na. Bombed an Israeli military gathering and military vehicles positioned in the vicinity of the Eastern Cemetery with a 107-type short-range rocket barrage.\nb. Bombed a gathering of Israeli soldiers and their military vehicles east of the Jabalia camp with regular 60-caliber mortar shells.\n2. Islamic Resistance in Iraq's operations on May 20:\na. Targeted an Israeli military site in Umm Al-Rashrash (Eilat) in the occupied Palestinian territories with at least two drones."}, {"id": "dcb07992-aace-43f9-98c3-8fbbfa8f3a7f", "title": "Russian attacks on Sumy Oblast damage energy infrastructure , injure 1 person", "date": "2024-05-22 01:15", "url": "https://www.yahoo.com/news/russian-attacks-sumy-oblast-damage-233503706.html", "message": "Russian forces attacked 11 communities in Sumy Oblast, injuring one person, and causing damage to energy infrastructure, the Sumy Oblast Military Administration reported.\nRussian strikes against Sumy Oblast have become increasingly destructive in recent months.\nGiven the town's proximity to Russia, Velyka Pysarivka has become a main target of attack for Russia over recent months.\nMuch of the community's infrastructure has been destroyed by Russian attacks.\nRead also: Border Guard: Russian offensive in Sumy Oblast can’t be ruled outWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "VELIYKA PYSARIVKA.", "classification": "security", "score": 0.7356974437132913, "event_breakdown": "1. Russian forces attacked 11 communities in Sumy Oblast, injuring one person.\n2. Russian forces caused damage to energy infrastructure in Sumy Oblast.\n3. Russian strikes against Sumy Oblast have become increasingly destructive in recent months.\n4. The Russian town of Velyka Pysarivka has become a main target of attack for Russia over recent months.\n5. Russian attacks have destroyed much of the infrastructure in Velyka Pysarivka."}, {"id": "85f22439-f0c6-47a6-855b-9e9caaa77773", "title": "Russia nuclear weapons drills in Ukraine are derided as  theatrical  ", "date": "2024-05-22 13:30", "url": "https://www.aol.co.uk/news/russia-nuclear-weapons-drills-ukraine-130308461.html", "message": "Troops can be seen readying mobile Iskander missile systems – which are capable of delivering strikes with both nuclear and conventional rockets.\nDetails of the nuclear programme are closely guarded but the move to blur the warhead was described by analysts as “theatrical”.\nExperts said the exercises were designed as a reminder of Russia’s threat to use tactical nuclear weapons in Ukraine.\n‘Nuclear threat is a paper tiger’Hamish de Bretton-Gordon, a former commander of the Joint Chemical, Biological, Radiological and Nuclear Regiment, said: “This is more bluff and bluster.\n“This is another indication that Russia’s tactical nuclear threat is a paper tiger and should be treated as such.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6070519665396202, "event_breakdown": "[1.] Russian troops can be seen readying mobile Iskander missile systems, which are capable of delivering strikes with both nuclear and conventional rockets.\n[2.] Details of the nuclear programme are closely guarded but the move to blur the warhead was described by analysts as \"theatrical\".\n[3.] Experts said the exercises were designed as a reminder of Russia's threat to use tactical nuclear weapons in Ukraine.\n[4.] The former commander of the Joint Chemical, Biological, Radiological and Nuclear Regiment said: \"This is more bluff and bluster. This is another indication that Russia's tactical nuclear threat is a paper tiger and should be treated as such.\""}, {"id": "d7830973-b62d-4e16-89a0-2c544e124729", "title": "Man Killed in Cross - Border Shelling of Russia Belgorod", "date": "2024-05-22 10:45", "url": "https://www.themoscowtimes.com/2024/05/22/man-killed-in-cross-border-shelling-of-russias-belgorod-a85191", "message": "A man was killed and one other person was wounded in an attack on southwestern Russia’s Belgorod region, local authorities said Wednesday.\nIt said earlier that three Ukrainian drones were shot down over the Belgorod region overnight.\nBelgorod region Governor Vyacheslav Gladkov said the shoot-downs damaged households, vehicles and a power line in the village of Belenkoye 15 kilometers north of eastern Ukraine’s Kharkiv region.\n“To our great sorrow, one civilian was killed — a man received multiple shrapnel wounds incompatible with life,” Gladkov wrote on Telegram, adding that another man was hospitalized in serious but stable condition.\nGladkov said last month that 120 civilians had been killed and more than 650 others had been wounded in Belgorod since the start of the war.", "location": ")\nBELOGOROD REGION", "classification": "security", "score": 0.7309703699342522, "event_breakdown": "1. A man was killed and another person was wounded in an attack on southwestern Russia's Belgorod region.\n2. Authorities said earlier that three Ukrainian drones were shot down over the Belgorod region."}, {"id": "cda76896-e1a2-4339-bef9-9fb1164b45ff", "title": "Hamas Celebrates as Ireland , Norway , Spain to Recognize  Palestinian State  ", "date": "2024-05-22 17:15", "url": "https://www.breitbart.com/politics/2024/05/22/hamas-celebrates-as-ireland-norway-spain-to-recognize-palestinian-state/", "message": "Hamas celebrated Wednesday as Ireland, Norway, and Spain announced that they would recognize a Palestinian state in the wake of the October 7 terror attacks against Israel, prompting Israel to recall its ambassadors from all three.\nThere is no indication what the structure of a Palestinian state would be — whether it would be a democracy, or a radical Islamist theocracy.\nThere has never been a Palestinian state.\nThough many Israelis still backed a Palestinian state, public opinion flipped after Palestinians turned Gaza, from which Israel withdrew in 2005, into a terrorist launchpad.\nThis would be a terrorist state.", "location": "GAZA", "classification": "security", "score": 0.5145707419604857, "event_breakdown": "Terrorist state Hamas celebration after Ireland, Norway, and Spain said they would recognize Palestinian state Terrorist launching pad (Gaza, from which Israel withdrew)"}, {"id": "f0f0ee51-1c33-4e07-baa5-d0ede8553ed4", "title": "Cleared for publication : IDF soldier seriously injured in northern Gaza", "date": "2024-05-22 04:45", "url": "http://www.israelnationalnews.com/news/390336", "message": "The IDF Spokesperson's Unit cleared for publication on Wednesday morning that an IDF soldier from Battalion 222, Carmeli Brigade, was seriously injured on Tuesday during an encounter with terrorists in the northern Gaza Strip.\nOn Tuesday morning, the IDF Spokesperson's Unit cleared for publication that a reservist from the Rotem Battalion of the Givati Brigade was seriously injured on Monday in a battle in the southern Gaza Strip.\nIn addition, a reservist in the 8237th Division Logistics Brigade was seriously injured in battle in the southern Gaza Strip.\nOn Tuesday, the IDF announced that soldiers of the 401st Brigade combat team under the 162nd Division continued the operation in Rafah.\nDuring this activity, the soldiers eliminated dozens of terrorists in eastern Rafah who tried to approach IDF forces.", "location": "Gaza Strip", "classification": "security", "score": 0.9511949090443614, "event_breakdown": "1. An IDF soldier from Battalion 222 was seriously injured on Tuesday morning during an encounter with terrorists in the northern Gaza Strip.\n2. A reservist from the Rotem Battalion of the Givati Brigade was seriously injured in battle in the southern Gaza Strip on Monday.\n3. A reservist in the 8237th Division Logistics Brigade was seriously injured in battle in the southern Gaza Strip.\n4. Soldiers of the 401st Brigade combat team under the 162nd Division continued the operation in Rafah on Tuesday, eliminating dozens of terrorists in eastern Rafah who tried to approach IDF forces."}, {"id": "ef287278-4f4d-4e21-9e1d-47beab65a1b3", "title": "Cleared for publication : IDF soldier seriously injured in northern Gaza", "date": "2024-05-22 04:00", "url": "https://www.israelnationalnews.com/news/390336", "message": "The IDF Spokesperson's Unit cleared for publication on Wednesday morning that an IDF soldier from Battalion 222, Carmeli Brigade, was seriously injured on Tuesday during an encounter with terrorists in the northern Gaza Strip.\nOn Tuesday morning, the IDF Spokesperson's Unit cleared for publication that a reservist from the Rotem Battalion of the Givati Brigade was seriously injured on Monday in a battle in the southern Gaza Strip.\nIn addition, a reservist in the 8237th Division Logistics Brigade was seriously injured in battle in the southern Gaza Strip.\nOn Tuesday, the IDF announced that soldiers of the 401st Brigade combat team under the 162nd Division continued the operation in Rafah.\nDuring this activity, the soldiers eliminated dozens of terrorists in eastern Rafah who tried to approach IDF forces.", "location": "Gaza Strip", "classification": "security", "score": 0.9511949090443614, "event_breakdown": "Events:\n1. An IDF soldier from Battalion 222, Carmeli Brigade, was seriously injured on Tuesday during an encounter with terrorists in the northern Gaza Strip.\n2. A reserve soldier from the Rotem Battalion of the Givati Brigade was seriously injured on Monday in a battle in the southern Gaza Strip.\n3. A reservist in the 8237th Division Logistics Brigade was seriously injured in battle in the southern Gaza Strip.\n4. Soldiers of the 401st Brigade combat team under the 162nd Division continued the operation in Rafah.\n5. During this activity, the soldiers of the 401st Brigade combat team eliminated dozens of terrorists in eastern Rafah who tried to approach IDF forces."}, {"id": "80691c86-c1b0-49cb-9e36-691a5600d6f7", "title": "Army Eastern Command conducts Ex Airavat Prahar in northeast sector", "date": "2024-05-22 14:30", "url": "https://www.prokerala.com/news/articles/a1533398.html", "message": "Kolkata, May 22 : The Indian Army's Eastern Command has conducted a massive exercise that witnessed Aviation Brigade-level third-dimension maneuver capability and its integration with the ground regime in the northeastern sector.\nEx Airavat Prahar involved complex operations conducted in an intense air defence and electronic warfare environment.\nTiwari, general officer commanding-in-chief (GOC-in-C), Eastern Command, witnessed the Exercise from an indigenous Light Combat Helicopter (LCH) that participated in the operations.\nThe Exercise involved indigenous aviation assets such as the Prachand (LCH), Rudra (ALH-WSI) and Dhruv Mark-III ALHs.\nAccording to an official, the exercise involved the airlifting of troops and equipment from several locations by scores of helicopters and their coordinated flight towards a specific location.", "location": "Siliguri, West Bengal", "classification": "security", "score": 0.7154390002106328, "event_breakdown": "* Ex Airavat Prahar was conducted in the northeastern sector of India by the Indian Army's Eastern Command.\n* The Exercise involved Aviation Brigade-level third-dimension maneuver capability and its integration with the ground regime.\n* The Exercise witnessed complex operations conducted in an intense air defence and electronic warfare environment.\n* General Officer Commanding-in-Chief (GOC-in-C), Eastern Command, General Manoj Pande (Rtd), witnessed the Exercise from an indigenous Light Combat Helicopter (LCH) that participated in the operations.\n* The Exercise involved indigenous Aviation assets such as the Prachand (LCH), Rudra (ALH-WSI) and Dhruv Mark-III ALHs.\n* The Exercise involved the airlifting of troops and equipment by several helicopters and their coordinated flight to a specific location."}, {"id": "3ca7ec78-b58f-4cd5-ac20-e0eeb62ac143", "title": "Spain , Ireland and Norway say they will recognize a Palestinian state . Why does that matter ? ", "date": "2024-05-22 17:30", "url": "https://www.twincities.com/2024/05/22/spain-ireland-and-norway-say-they-will-recognize-a-palestinian-state-why-does-that-matter/", "message": "Spain, Ireland and Norway said Wednesday that they would recognize a Palestinian state on May 28, a step toward a long-held Palestinian aspiration that came amid international outrage over the civilian death toll and humanitarian crisis in the Gaza Strip following Israel’s offensive.\nCurrently, seven member of the 27-nation European Union officially recognize a Palestinian state.\nSome 140 of the about 190 countries represented in the U.N. have already recognized a Palestinian state.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nGerman, meanwhile, said it will not recognize a Palestinian state for the time being.", "location": "Spain", "classification": "security", "score": 0.569861848550259, "event_breakdown": "Security events:\n1. Spain, Ireland and Norway recognize a Palestinian state on May 28, 2014.\n2. Seven members of the EU (European Union) officially recognize a Palestinian state.\n3. A total of 140 of the 190 countries in UN (United Nations) have recognized a Palestinian state.\n4. Spain, Ireland, Malta and Slovenia are considering recognizing a Palestinian state in March 2014.\n5. Germany doesn't recognize the state of Palestine for the time being."}, {"id": "2a4c79f4-315d-4486-9e7c-75e304b71612", "title": "Manchester Arena terror attack survivor  still a prisoner in her own home  seven years on", "date": "2024-05-22 13:45", "url": "https://www.mirror.co.uk/news/uk-news/manchester-arena-terror-attack-survivor-32867998", "message": "Mum Joanne McSorley, 50, who survived the terrorist attack at Manchester Arena, was left disabled from injuries sustained in the blast and lives with chronic pain and debilitating depressionExclusive: Manchester Arena terror attack survivor 'still a prisoner in her own home' seven years onA mum who survived the Manchester Arena terror attack has told how she is a prisoner in her own home – seven years after the horror.\nShe told the Mirror: “At the beginning, I thought help would come because we were collateral damage of a high profile terror attack – but I’ve been left with nothing and made to feel like a criminal.\nJoanne and mum Susan, then 62, were waiting to collect her girls Ellie, 16 and Libby, 11, in the foyer at Manchester Arena when terrorist Salman Abedi detonated the bomb.\nShe recently joined Survivors Against Terror, a network of terror attack survivors, and is supporting the group’s push to create a charter to help support victims.\n“While we cannot comment on ongoing cases, since 2017 the Criminal Injuries Compensation Scheme has helped more than 450 Manchester Arena victims secure over £4.5 million to rebuild their lives.", "location": "Manchester Arena", "classification": "security", "score": 0.4174511255255778, "event_breakdown": ".\nManchester Arena terrorist attack"}, {"id": "c16c4c0c-5891-4c27-b8bf-13eaa5486bf9", "title": "UN food aid collapses as Israeli strikes pound Rafah", "date": "2024-05-22 06:30", "url": "https://www.hurriyetdailynews.com/un-food-aid-collapses-as-israeli-strikes-pound-rafah-193791", "message": "UN food aid collapses as Israeli strikes pound RafahRAFAHThe U.N. Agency helping Palestinian refugees reported that its distribution center and the U.N. World Food Program’s warehouses in Gaza’s southern city of Rafah “are now inaccessible due to ongoing military operations,” U.N. spokesman Stephane Dujarric said.\nIsrael's retaliatory offensive has killed at least 35,647 people in Gaza, most of them civilians, according to the Hamas-run territory's health ministry.\nThe ministry did not elaborate but said they fled “under fire from shelling.”The Israeli military did not immediately reply to requests for comment.\nAwda hospital issued a statement Tuesday saying it had been surrounded by Israeli troops for the past three days and that an artillery shell had hit its fifth floor.\nThe Israeli military said it had launched a \"counterterrorism operation\" in Jenin, adding later that \"exchanges of fire are underway between the security forces and the armed terrorists\".", "location": "RAFAH", "classification": "security", "score": 0.8250967287217328, "event_breakdown": "Here are the security events from the text:\n- The Israeli offensive has killed at least 35,647 people in Gaza, most of them civilians, according to the Hamas-run territory's health ministry.\n- The Israeli military launched a counterterrorism operation in Jenin, adding later that \"exchanges of fire are underway between the security forces and the armed terrorists\".\n- The Israeli military did not immediately reply to requests for comment on the military situation."}, {"id": "d14414d9-e83a-43f5-b29f-51dfcf7f6997", "title": "Yemeni armed forces down US MQ - 9 Reaper", "date": "2024-05-22 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240521-irna02.htm", "message": "Yemeni armed forces down US MQ-9 ReaperIRNA - Islamic Republic News AgencyMay 21, 2024Tehran, IRNA -- Brigadier General Yahya Saree, spokesman of the Yemeni armed forces, announced that Yemeni forces have shot down the fifth American MQ-9 Reaper.\n\"The Air Defense Forces of the Yemeni Armed Forces shot down an American unmanned aerial vehicle, MQ-9 Reaper, while it was carrying out hostile missions in the airspace of Al Bayda Governorate,\" Saree said in a statement on Tuesday.\n\"The Yemeni Armed Forces confirmed that the operation of shooting down this UAV came only a few days later from the shooting down of another UAV of the same type, in the airspace of Ma'rib Governorate,\" he noted.\nAccording to Saree, with this operation, the Yemeni Armed Forces succeeded in shooting down five UAVs of this type during the Battle of the Promised Conquest and Holy Jihad.\n\"The Yemeni Armed Forces continue to develop their defense capabilities to confront the American-British aggression against our country and continue to carry out their military operations in triumphing for the oppressed Palestinian people until the siege is lifted and the aggression against the Palestinian people in the Gaza Strip is ceased,\" he added.", "location": "Al Bayda Governorate", "classification": "security", "score": 0.986076952904486, "event_breakdown": "Here is the text converted into a list of events:\n* Yemeni armed forces shoot down US MQ-9 Reaper UAV Al Bayda Governorate\n* Yemeni armed forces shoot down another US MQ-9 Reaper UAV in the airspace of Ma'rib Governorate\n* Yemeni armed forces shoot down a total of five US MQ-9 Reaper UAVs in the Battle of the Promised Conquest and Holy Jihad"}, {"id": "b7cebf58-7628-4307-b58c-e8fd46f971ae", "title": "Ukraine war : At least 10 injured in Russian glide bomb attack on city of Kharkiv", "date": "2024-05-22 19:15", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-kharkiv-attack-glide-bombs-b2549602.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A Russian airstrike using deadly glide bombs has destroyed a cafe, set a petrol station ablaze and left 10 civilians injured in Ukraine’s northeast region of Kharkiv.\nKharkiv, Ukraine’s second largest city, and the surrounding region have been targeted by Russian attacks since the start of the full-scale war in 2022.\n“There’s not much point in going into a shelter because if a glide bomb hits, the crater will be deeper than the shelter.\nFurther north, in the neighbouring Sumy region, a Russian attack on the area’s energy facilities knocked out the power for more than half a million residents, according to the energy ministry.", "location": "Kharkiv", "classification": "security", "score": 0.622014898633174, "event_breakdown": "Here is the list of security events based on the text you provided:\n\n1. Russian airstrike destroys cafe and sets petrol station ablaze in northeast region of Ukraine's Kharkiv.\n2. Russian attack on the energy facilities in Sumy region of Ukraine knocks out the power to half a million residents."}, {"id": "436340c5-fcae-448a-8811-1b4d91e0e1e5", "title": "Iraqi resistance launches drone attack on Eilat Port", "date": "2024-05-22 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240521-irna03.htm", "message": "Iraqi resistance launches drone attack on Eilat PortIRNA - Islamic Republic News AgencyMay 21, 2024Tehran, IRNA -- The Islamic Resistance in Iraq says it has conducted a drone strike against a sensitive position in the Port of Eilat in the occupied Palestinian territories.\nIn a statement released on Monday, the Iraqi resistance announced that its forces targeted the military airbase of the Israeli regime in the Port of Eilat with two drones.\nThe resistance carried out the operation in support of the people of Gaza and in response to the Zionist regime's genocidal war on the besieged strip.\nIsraeli news outlets also reported that the Iron Dome system has been activated in the city of Eilat in southern occupied Palestine.\nThe Islamic Resistance in Iraq has carried out 243 operations against the Zionist regime since the beginning of the bloody war in Gaza in October last year.", "location": ")\nELAT, ISRAEL", "classification": "security", "score": 0.9461233559384242, "event_breakdown": "1. The Islamic Resistance in Iraq used two drones to attack the Israeli regime's military airbase in the Port of Eilat, which is in the occupied Palestinian territories.\n2. As a result of the attack, the Iron Dome system in the city of Eilat in southern occupied Palestine was activated."}, {"id": "032c9086-8a35-40f3-bcc7-71f102bf3c2e", "title": "Ireland , Norway and Spain to recognise Palestine as independent state", "date": "2024-05-22 10:45", "url": "https://www.independent.co.uk/news/world/europe/palestine-israel-ireland-norway-spain-state-recognition-b2549268.html", "message": "Please try again later {{ /verifyErrors }}Ireland, Spain and Norway have announced they will recognise a Palestinian state, as Israel accused the nations of “rewarding” Hamas for its brutal attack on 7 October.\nAnnouncing plans to recognise the state of Palestine, Spanish prime minister Pedro Sanchez received applause in parliament as he called for peace in Gaza.\nBritish foreign secretary Lord David Cameron said in January that Britain was “looking at the issue of recognising a Palestinian state”.\nBefore Wednesday’s announcements by Spain, Norway and Ireland, some 140 out of 193 member-states of the United Nations recognised a Palestinian state.\nA number of other European Union members, including Slovenia and Malta, have indicated their intention to recognise the state of Palestine.", "location": "-\nGAZA", "classification": "security", "score": 0.7263859794316072, "event_breakdown": "1. Ireland announced they will recognise a Palestinian state.\n2. Israel accused Ireland, Spain and Norway of rewarding Hamas for its brutal attack on 7 October.\n3. Spanish prime minister Pedro Sanchez received applause in parliament as he called for peace in Gaza.\n4. British foreign secretary Lord David Cameron said that Britain was “looking at the issue of recognising a Palestinian state”.\n5. Before Wednesday’s announcements by Spain, Norway and Ireland, some 140 out of 193 member-states of the United Nations recognised a Palestinian state.\n6. A number of other European Union members, including Slovenia and Malta, have indicated their intention to recognise the state of Palestine."}, {"id": "631072c1-67c4-4a7b-b06e-854cbd9f7c5d", "title": "BADARU WIND OF HOPE – THISDAYLIVE", "date": "2024-05-22 01:45", "url": "https://www.thisdaylive.com/index.php/2024/05/22/badarus-wind-of-hope/", "message": "But there is a blowing wind of hope which attests to the fact that the Ministry of Defence and all the allied agencies under it are not sleeping on duty.\nMinister of Defence, Mohammed Badaru, has been silently working the mills to surmount the general challenge of insecurity, though he blows no trumpet about this.\nBadaru’s logic is that Africa should not be treated in isolation in the onslaught against terrorism.\nOne of Tinubu’s desires in his Renewed Hope agenda is to defend the territorial integrity of the nation and to secure lives and property within.\nHe has certainly found a worthy partner in Badaru, himself an exemplar of peace even as governor of Jigawa State.", "location": "Nigeria", "classification": "security", "score": 0.4280521852438199, "event_breakdown": "1. Ministry of Defence and all the allied agencies under it are not sleeping on duty.\n2. Minister of Defence, Mohammed Badaru, has been silently working to surmount the general challenge of insecurity.\n3. Badaru's logic is that Africa should not be treated in isolation in the onslaught against terrorism.\n4. One of Tinubu's desires in his Renewed Hope agenda is to defend the territorial integrity of the nation.\n5. Badaru himself is an exemplar of peace.\n6. Governor Badaru has found a worthy partner in Tinubu, himself an exemplar of peace even as governor of Jigawa State."}, {"id": "a42ddff4-3e41-4573-a7a1-7a1c218b0c03", "title": "Norway , Ireland , Spain to recognise Palestinian state", "date": "2024-05-22 17:15", "url": "https://www.bssnews.net/international/190625", "message": "MADRID, May 22, 2024 (BSS/AFP) - Norway, Ireland and Spain announced onWednesday they will recognise a Palestinian state from next week, highlightingthe deep split over the issue within the EU as the Israel-Hamas war rages.\nAccording to the Palestinian Authority, which rules parts of the occupiedWest Bank, 142 of the 193 UN members already recognise a Palestinian state.\n- 'Only alternative' -Sweden, which has a large Palestinian community, became the first EuropeanUnion member in western Europe to recognise Palestinian statehood in 2014.\nA Palestinian state was recognised by Bulgaria, Cyprus, the Czech Republic,Hungary, Poland and Romania before they joined the EU.\nIn March, Slovenia and Malta signed a statement with Spain and Irelandexpressing their willingness to recognise a Palestinian state.", "location": "MADRID", "classification": "security", "score": 0.804818766807533, "event_breakdown": ".\nSecurity events:\n* Outbreak of conflict between Israel and Hamas, date unspecified\n* The recognition of a Palestinian state by Norway, Ireland, and Spain, respectively."}, {"id": "47d0f39a-3d4f-4cec-b89a-934c69be2cc4", "title": "Iran funeral : Tehran mourns President Raisi killed in helicopter crash", "date": "2024-05-22 08:15", "url": "https://www.nbcnews.com/news/world/iran-funeral-tehran-president-raisi-killed-helicopter-crash-rcna153426", "message": "Iran’s supreme leader led tens of thousands in mourning at a grand funeral in the capital, Tehran, on Wednesday for the country’s late president, foreign minister and others killed in a helicopter crash.\nAyatollah Ali Khamenei held the service at Tehran University, the caskets of the dead draped in Iranian flags with their pictures on them.\nOn the late President Ebrahim Raisi’s coffin sat a black turban — signifying his direct descendance from Islam’s Prophet Muhammad.\nAlso on hand was Ismail Haniyeh of Hamas, the militant group that Iran has armed and supported during the ongoing Israel-Hamas war raging in the Gaza Strip.\nHe also recounted meeting Raisi in Tehran during Ramadan, the holy Muslim fasting month, and heard the president say the Palestinian issue remains the key one of the Muslim world.", "location": "Tehran", "classification": "security", "score": 0.5705926015928904, "event_breakdown": "Event 1: Tehran University hosts a grand funeral for Iran's late president, foreign minister and others killed in a helicopter crash.\nEvent 2: Ayatollah Ali Khamenei leads the service at Tehran University with the caskets of the dead draped in Iranian flags with their pictures on them.\nEvent 3: Ismail Haniyeh of Hamas attends the funeral at Tehran University.\nEvent 4: On President Ebrahim Raisi's coffin, a black turban symbolizing his direct descendance from Islam's Prophet Muhammad sits."}, {"id": "dcc1b657-130c-4fab-8366-f5428820e261", "title": "  A fight for my life : Court hears rare testimony from officer involved in fatal shooting", "date": "2024-05-22 05:15", "url": "https://www.cbc.ca/news/canada/calgary/fatality-inquiry-calgary-police-osman-bridgeland-undercover-1.7210745", "message": "Davies killed Yacin Osman, 27, on April 9, 2018 after Osman attacked him with a knife, not knowing his victim was an undercover officer.\nDavies' testimony was a rare chance to hear from an officer involved in a fatal shooting.\nDavies' team was tasked with watching all entry and exit points on a home in Bridgeland so other investigators could execute a covert search warrant.\nOnce he was relieved by another officer, Davies testified he drove to a nearby abandoned, fenced-in school parking lot.\n'This was life or death'Osman spotted the gun and Davies testified that after that, \"the fight was on.\"", "location": "Based on the text, the most specific location where the main event takes place is:\n\nAbandoned", "classification": "security", "score": 0.9664741650821147, "event_breakdown": "Security Events:\n- Undercover officer Davies and his team were tasked with watching all entry and exit points on a home in Bridgeland.\n- Davies drove to an abandoned, fenced-in school parking lot nearby.\n- Yacin Osman discovered Davies' gun and attacked him with a knife, leading to a fight."}, {"id": "79289174-f7db-4cbb-9ffe-69678d724e41", "title": "Spain , Ireland and Norway say they will recognize a Palestinian state . Why does that matter ? ", "date": "2024-05-22 19:30", "url": "https://www.dailycamera.com/2024/05/22/spain-ireland-and-norway-say-they-will-recognize-a-palestinian-state-why-does-that-matter/", "message": "Currently, seven member of the 27-nation European Union officially recognize a Palestinian state.\nSome 140 of the about 190 countries represented in the U.N. have already recognized a Palestinian state.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nWHO RECOGNIZES A PALESTINIAN STATE?\nGerman, meanwhile, said it will not recognize a Palestinian state for the time being.", "location": "Ramallah, Palestine", "classification": "security", "score": 0.5416894192133992, "event_breakdown": "* Seven members of the European Union have officially recognize a Palestinian state.\n* 140 of 190 countries in the U.N. officially recognize a Palestinian state.\n* In March, leaders of Spain, Ireland, Malta and Slovenia stated they were considering recognizing a Palestinian state.\n* Germany has refused to recognize a Palestinian state for the time being."}, {"id": "399dfc72-43cb-4a3a-ad86-cd644f8dbdc3", "title": "Philippine Cardinal Condemns Chapel Bombing as  Horrendous Sacrilegious Act  ", "date": "2024-05-22 03:15", "url": "https://www.ncregister.com/cna/philippine-cardinal-condemns-chapel-bombing-as-horrendous-sacrilegious-act", "message": "The grenade attack happened on Pentecost Sunday at Santo Niño Chapel in Cotabato City.\nA Catholic cardinal condemned the grenade attack on a village chapel during a Bible service that left two wounded in the southern Philippines on Sunday.\nCardinal Orlando Quevedo, the archbishop emeritus of Cotabato, denounced the grenade attack, calling it a “dastardly bombing,” according to the news site of the Catholic Bishops’ Conference of the Philippines.\nCardinal Quevedo called the attack a “horrendous sacrilegious act that cries out to heaven.”“I call upon our security, military and investigative forces to ferret out the perpetrators and bring them to justice,” he added.\n“We stand in solidarity with the Catholic community of Cotabato City and the entire Bangsamoro region during this unforeseen challenge,” he continued.", "location": "given\nCotabato City", "classification": "security", "score": 0.9649769800571032, "event_breakdown": "Event 1: Grenade attack on a village chapel during a Bible service in the southern Philippines\nEvent 2: Cardinal Orlando Quevedo denounced the attack and called on authorities to ferret out the perpetrators and bring them to justice."}, {"id": "b372c191-706f-4b90-ab28-059f13166412", "title": "Spain , Ireland and Norway say they will recognize a Palestinian state . Why does that matter ? ", "date": "2024-05-22 16:45", "url": "https://www.capitalgazette.com/2024/05/22/spain-ireland-and-norway-say-they-will-recognize-a-palestinian-state-why-does-that-matter/", "message": "Currently, seven member of the 27-nation European Union officially recognize a Palestinian state.\nSome 140 of the about 190 countries represented in the U.N. have already recognized a Palestinian state.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nWHO RECOGNIZES A PALESTINIAN STATE?\nGerman, meanwhile, said it will not recognize a Palestinian state for the time being.", "location": "Ramallah, Palestine", "classification": "security", "score": 0.5416894192133992, "event_breakdown": "Recognition of a Palestinian state\nEuropean Union member states\nUNSC votes on Palestinian state"}, {"id": "054dff40-81be-415c-b7e9-95118161f5ed", "title": "Hezbollah targets Israeli barracks ; Israel responds with airstrikes", "date": "2024-05-22 16:45", "url": "https://www.albawaba.com/news/hezbollah-targets-israeli-barracks-israel-responds-airstrikes-1568296", "message": "ALBAWABA- Tensions flared up at the border as Hezbollah fighters launched rockets toward the Israeli Zibdin barracks in the occupied Shebaa Farms, located south of Lebanon.\nAccording to a statement from Hezbollah, they targeted a building used by Israeli soldiers in the Avivim settlement, claiming a direct hit with appropriate weaponry.\nIsraeli Channel 13 reported a fire breaking out in the town of Avivim in northern Israel, following the firing of an anti-tank missile from Lebanon.\nAn Israeli military spokesperson confirmed they attacked a military building in the Mays al-Jabal area.\nThe Israeli forces also carried out raids on Hezbollah military buildings in Aita al-Shaab and reconnaissance sites in Alma al-Shaab.", "location": "SHEBA FARMS", "classification": "security", "score": 0.9964356150966255, "event_breakdown": "The events were:\n- Hezbollah fighters launched rockets toward the Israeli Zibdin barracks in the occupied Shebaa Farms.\n- Hezbollah targeted a building used by Israeli soldiers in the Avivim settlement, claiming a direct hit.\n- A fire broke out in the town of Avivim in Israel following the firing of an anti-tank missile from Lebanon.\n- The Israeli army attacked a military building in the Mays al-Jabal area.\n- The Israeli army carried out raids on Hezbollah military buildings in Aita al-Shaab.\n- The Israeli army carried out raids on Hezbollah reconnaissance sites in Alma al-Shaab. These events are related to the security tensions that occurred along the Lebanon-Israel border."}, {"id": "b501e8c8-b4a9-4b8a-8142-70423e824700", "title": "UN food agency warns that the new US sea route for Gaza aid may fail unless conditions improve", "date": "2024-05-22 01:00", "url": "https://abcnews.go.com/US/wireStory/food-agency-warns-new-us-sea-route-gaza-110443278", "message": "The operation was halted for at least two days after crowds looted aid trucks coming from the port and one Palestinian man was killed.\nThe U.N. food agency is now reevaluating logistics and security measures and looking for alternate routes within Gaza, said spokesperson Abeer Etefa.\nHowever, Associated Press video shows Israeli armored vehicles on a beach road, then aid trucks moving down the road.\nCivilians watching from the roadside gradually start to clamber on top of the aid trucks, throwing aid down to people below.\nNumbers of people then appear to overrun the aid trucks and their goods.", "location": "GAZA CITY", "classification": "security", "score": 0.8887842908601014, "event_breakdown": "Security Events:\n- Crowds looting aid trucks coming from the port: Location: Not specified.\n- One Palestinian man was killed: Location: Not specified.\n- Armored Israeli vehicles on a beach road: Location: Not specified.\n- Aid trucks moving down the road: Location: Not specified.\n- Civilians clambering on top of aid trucks: Location: Not specified.\n- Overrunning of aid trucks by people: Location: Not specified."}, {"id": "d904f188-e118-488b-9239-af27dbedf6e4", "title": "UN World Food Program says humanitarian aid in Gaza close to failure", "date": "2024-05-22 17:15", "url": "https://www.csmonitor.com/World/Middle-East/2024/0522/Gaza-food-crisis-aid-trucks", "message": "The operation was halted for at least two days after crowds looted aid trucks coming from the port and one Palestinian man was killed.\nHowever, Associated Press video shows Israeli armored vehicles on a beach road, then aid trucks moving down the road.\nCivilians watching from the roadside gradually start to clamber on top of the aid trucks, throwing aid down to people below.\nNumbers of people then appear to overrun the aid trucks and their goods.\nMr. Taravella said little aid or fuel – needed to run aid delivery trucks – is currently reaching any part of Gaza, and stocks of both are almost exhausted.", "location": "Gaza", "classification": "security", "score": 0.853592976797476, "event_breakdown": "Security Events:\n\n- Crowds looted aid trucks coming from the port.\n- One Palestinian man was killed.\n- Israeli armored vehicles on a beach road.\n- Aid trucks moving down the road.\n- Civilians climbing on top of aid trucks.\n- Aid being thrown to people below.\n- People appearing to overrun the aid trucks.\n- Little aid or fuel is currently reaching any part of Gaza."}, {"id": "26495a8c-a1bc-48a7-ab6b-b9d37b7ec0a8", "title": "UN food agency warns that the new US sea route for Gaza aid may fail unless conditions improve – Metro US", "date": "2024-05-22 00:15", "url": "https://www.metro.us/un-food-agency-warns-that-the-new-us-sea-route-for-gaza-aid-may-fail-unless-conditions-improve/", "message": "Palestinians are storming trucks loaded with humanitarian aid brought in through a new U.S.-built pier, in the central Gaza Strip, Saturday, May 18, 2024.\nThe operation was halted for at least two days after crowds looted aid trucks coming from the port and one Palestinian man was killed.\nHowever, Associated Press video shows Israeli armored vehicles on a beach road, then aid trucks moving down the road.\nCivilians watching from the roadside gradually start to clamber on top of the aid trucks, throwing aid down to people below.\nNumbers of people then appear to overrun the aid trucks and their goods.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9157193342712501, "event_breakdown": "1. Palestinians are storming trucks loaded with humanitarian aid brought in through a new U.S.-built pier, in the central Gaza Strip, Saturday, May 18, 2024.\n2. The operation is halted for at least two days after crowds looted aid trucks coming from the port in Gaza Strip and a Palestinian man was killed.\n3. Associated Press video shows Israeli armored vehicles on a beach road, then aid trucks moving down the road.\n4. Civilians watching from the roadside gradually start to clamber on top of the aid trucks, throwing aid down to people below.\n5. Numbers of people then appear to overrun the aid trucks and their goods."}, {"id": "c8cfbc59-e2f4-4bae-b9a2-f03b92e13dd9", "title": "Ukrainian forces attack Russians twice on Kharkiv front , causing Russians to lose 60 soldiers – Ukraine General Staff", "date": "2024-05-22 08:15", "url": "https://www.yahoo.com/news/ukrainian-forces-attack-russians-twice-055937813.html", "message": "A total of 13 combat engagements took place on the Kharkiv front, where Ukrainian forces mounted two attacks on the Russians.\nA total of 13 combat engagements occurred there over the past 24 hours.\nUkrainian forces mounted two attacks on the Russians.\nThe Russians have lost over 220 personnel (64 killed in action) and 32 pieces of weapons and military equipment in the north of Kharkiv Oblast over the past 24 hours.\nUkrainian forces destroyed one tank, one armoured combat vehicle, four howitzers and mortars, nine strategic and tactical UAVs and six units of vehicles belonging to the Russians.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.9905819934486735, "event_breakdown": "List of security events (over the past 24 hours):\nRussian forces attacked Ukrainian positions in Kharkiv Oblast.\nUkrainian forces destroyed the Russian military vehicle in the north of Kharkiv Oblast.\nUkrainian forces destroyed the Russian military vehicle in Kharkiv Oblast.\nUkrainian forces attacked the Russian military in Kharkiv Oblast.\nOver 220 personnel of the Russian armed forces were killed in the north of Kharkiv Oblast.\nThe Russians lost 32 equipment units in the north of Kharkiv Oblast.\nThe Russian forces lost a tank in the north of Kharkiv Oblast.\nThe Russian forces lost one armored vehicle in the north of Kharkiv Oblast.\nOne strategic UAV was destroyed in the north of the Kharkiv Oblast.\nUkrainian forces destroyed nine strategic and tactical unmanned aerial vehicles (UAVs) in the north of Kharkiv Oblast.\nThe Ukrainian forces destroyed four howitzers and mortars in Kharkiv Oblast."}, {"id": "36e59a60-5300-4d6a-a24b-9f9a5825f87e", "title": "Netanyahu Says He Has No Plans For Israeli Settlements In Gaza", "date": "2024-05-22 01:45", "url": "https://menafn.com/1108242236/Netanyahu-Says-He-Has-No-Plans-For-Israeli-Settlements-In-Gaza", "message": "(MENAFN- IANS) Tel Aviv, May 22 (IANS/DPA) Israeli Prime Minister Benjamin Netanyahu has told US media that Israel has no plans to build settlements in the Gaza Strip once the war there is over.\n\"Resettling Gaza... was never in the cards,\" Netanyahu said in an interview with the US broadcaster CNN on Tuesday.\nSeveral of the right-wing nationalist Ministers in Netanyahu's coalition had repeatedly spoken out in favour of resettling the Gaza Strip with Jewish settlers.\nThe unprecedented attack triggered the Gaza war as Israel responded with massive airstrikes and a ground offensive.\nSo far, he has refused to present a plan for the administration and reconstruction of the Gaza Strip after the end of the war.", "location": "Tel Aviv", "classification": "security", "score": 0.609824424475787, "event_breakdown": "* Israeli Prime Minister Benjamin Netanyahu told US media on May 22 that Israel has no plans to build settlements in the Gaza Strip.\n* Several right-wing nationalist ministers in Israel's coalition had previously spoken out in favour of resettling the Gaza Strip with Jewish settlers."}, {"id": "8d0192de-0c1e-4ba1-bb34-2da050b128d0", "title": "Russia - Ukraine war : List of key events , day 817", "date": "2024-05-22 02:45", "url": "https://www.aljazeera.com/news/2024/5/22/russia-ukraine-war-list-of-key-events-day-817-2", "message": "Russia-Ukraine war: List of key events, day 817As the war enters its 817th day, these are the main developments.", "location": "Ukraine", "classification": "security", "score": 0.5428428659096032, "event_breakdown": "List of key events related to the war in Ukraine on the 817th day:\n\n1. Russian attack on Svyatogorsk, Donetsk: Russian forces shelled the Svyatogorsk district of Donetsk, killing three people, according to the region’s military administration.\n2. Russia bombs Ukrainian military barracks in Luhansk: Russia fired missiles at the military barracks of the Ukrainian forces stationed in the east of Ukraine on Saturday.\n3. Russia's foreign minister meets China's top diplomat: Russian Foreign Minister Sergei Lavrov met Chinese State Councilor and Foreign Minister Wang Yi during his visit to the southern Chinese city of Guilin.\n4. Explosion At Military Warehouse In Ukraine's Lviv; Russia Blamed: The explosion occurred in Lviv, western Ukraine, where the U.S. military also stores supplies.\n\nIt is reported that the Russian forces killed three people during a missile attack on the Svyatogorsk district of Donetsk and fired missiles on the military barracks of Ukrainian forces stationed in Luhansk. Russian Foreign Minister Sergei Lavrov met with Chinese State Councilor and Foreign Minister Wang Yi during his visit to the southern Chinese city of Guilin. According to Ukrainian officials, Russia was responsible for an explosion in a military warehouse in the western Ukrainian city of Lviv."}, {"id": "e774167b-9dad-4cfa-90a3-4fe6c26f2623", "title": "Israel razes parts of Gaza Jabalia , hits Rafah with airstrikes", "date": "2024-05-22 03:15", "url": "https://www.chinadailyhk.com/hk/article/583746", "message": "Smoke billows after an explosion in the Gaza Strip, as seen from southern Israel, May 21, 2024.\n\"These are the only two functional hospitals remaining in northern Gaza,\" Tedros said.\nPalestinians wounded in the Israeli bombardment of the Gaza Strip are brought to Al Aqsa hospital in Deir al Balah, Gaza Strip, May 21, 2024.\nIsrael is seeking to eradicate Hamas after militants from the group stormed into southern Israel on Oct 7, killing 1,200 and taking more than 250 hostages, by Israeli tallies.\nIsrael has pledged to continue with the Rafah assault to root out what it says are four remaining battalions of Hamas fighters holed up there.", "location": "GAZA", "classification": "security", "score": 0.9777697062764038, "event_breakdown": "* On October 7, 2024, Hamas militants from the Gaza Strip stormed into southern Israel, killing 1200 civilians and taking 250 hostages\n* Israel began an air assault against Rafah in the Gaza Strip on October 19, 2024\n* Northern Gaza saw two of its hospitals shut down by Israel because they said Hamas militants and explosives were in them."}, {"id": "f951b5ec-db7d-4638-b1bc-b53fcfbeb417", "title": "Briefing to the United Nations Security Council : Threats to International Peace and Security - Ms . Izumi Nakamitsu High Representative for Disarmament Affairs ( New York , 20 May 2024 ) - Ukraine", "date": "2024-05-22 08:15", "url": "https://reliefweb.int/report/ukraine/briefing-united-nations-security-council-threats-international-peace-and-security-ms-izumi-nakamitsu-high-representative-disarmament-affairs-new-york-20-may-2024", "message": "Strikes have also been reported inside the Russian Federation, reportedly also resulting in civilian casualties and damage to civilian infrastructure.\nAll parties to any armed conflict have an obligation to protect civilians in armed conflict and to ensure compliance with applicable international law, including international humanitarian law.\nLet me say it again: deliberate and direct attacks against civilians and civilian infrastructure and indiscriminate attacks, including disproportionate attacks are prohibited under international humanitarian law.\nMuch of the information from governments about their transfers of weapons systems and ammunition to Ukraine is available through open sources.\nTo prevent the diversion of conventional arms and regulate the international arms trade, States have established a number of arms control treaties and instruments.", "location": "Ukraine", "classification": "security", "score": 0.9045356550005575, "event_breakdown": "Security events in the text:\n- Strikes reported inside the Ukrainian territory resulting in civilian casualties and damage to civilian infrastructure\n- Strikes reported inside the territory of the Russian Federation,  reportedly also resulting in civilian casualties and damage to civilian infrastructure"}, {"id": "2fa5873f-fa58-4ec6-b6e8-5035342d3448", "title": "How Kremlin uses false fact checks to spread disinformation - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-22 12:45", "url": "https://www.newdelhitimes.com/how-kremlin-uses-false-fact-checks-to-spread-disinformation/", "message": "In reality, however, “War on Fakes” is one of the main groups that push and promote false narratives through fake fact-checking.\nFake fact-checking is an effective way of spreading state propaganda and disinformation, according to Roman Osadchuk of the Atlantic Council’s Digital Forensic Research Lab (DFRLab).\nShe cites false narratives around an attack on the Moscow Crocus City Hall concert in March, when gunmen killed more than 140 people and set fire to the building.\nBut, says Innes, false fact-checking has been more institutionalized since February 2022.\nThese false narratives are then shared by officials, ministries, embassies, state-run media outlets, and on social media.", "location": "Moscow", "classification": "security", "score": 0.4635066040381988, "event_breakdown": "Security Events:\n1. Attack on the Moscow Crocus City Hall concert in March (Location: Moscow, Russia)\n2. Gunmen killed more than 140 people and set the building on fire (Location: Moscow, Russia)"}, {"id": "20fc79c0-b43c-48f2-8ada-5ca1b8bb5a39", "title": "US , NATO forces showcase tactics , integration during Astral Knight 2024 > Air Force Reserve Command > News", "date": "2024-05-22 00:45", "url": "https://www.afrc.af.mil/News/Article/3783672/us-nato-forces-showcase-tactics-integration-during-astral-knight-2024/", "message": "NATO's exercise Astral Knight 2024 concluded May 18 in Gdynia, demonstrating joint force interoperability and strategic readiness between U.S. forces and NATO allies.\nThese operations are aimed at ensuring aircrews and Airmen are well prepared to deliver lethal combat power and conduct precise recovery operations in contested environments.\n\"Our presence here at Astral Knight 24 aimed to refine and test the Special Warfare Teaming strategy,” said U.S. Air Force Tech.\n\"The integration of TACPs and PJs into a cohesive unit allows us to leverage our respective strengths,” said U.S. Air Force Capt.\n“This exercise effectively assessed the current state of Air Force Special Warfare Teaming, allowing us to inform the development of the special warfare enterprise.", "location": "Gdynia, Poland.", "classification": "security", "score": 0.48368791362686364, "event_breakdown": "Exercise Astral Knight 2024 (May 18 - 26, 2024), NATO exercise in Gdynia, Poland."}, {"id": "df8943eb-242d-42d7-88b9-a338372adeb6", "title": "How have Israelis adjusted to life in wartime ? - The Jerusalem Post", "date": "2024-05-22 00:45", "url": "https://www.jpost.com/opinion/article-802102", "message": "I knew the amount of rocket fire Israel was incurring was troubling me, but beyond that, I wasn’t sure.\nSince many do not carry cell phones on the day of rest, Israeli news channels are left on a silent broadcast.\nAs the need arose, a newscaster would come on screen and calmly report which town had terrorists roaming the streets.\nCHILDREN PLAY in a pre-school group set up inside a bomb shelter, in the center of the country, in November.\nThe writer is a rabbi, a wedding officiant, and a mohel who performs ritual circumcisions and conversions in Israel and worldwide.", "location": "Israel", "classification": "security", "score": 0.7088298306830274, "event_breakdown": "1. Children play in a bomb shelter in the center of Israel.\n2. Terrorists are roaming the streets of which town."}, {"id": "240337c7-4d11-4808-9e00-5bdb97ce8be1", "title": "The Latest | Norway , Ireland and Spain make a coordinated move to recognize a Palestinian state", "date": "2024-05-22 08:30", "url": "https://www.yahoo.com/news/latest-norway-ireland-spain-coordinated-074949741.html", "message": "European Union countries Spain and Ireland as well as Norway announced Wednesday May 22, 2024 their recognition of a Palestinian state.\n— Norway, Ireland and Spain recognize a Palestinian state in a historic move.\nFRANCE INDICATES IT WON'T RECOGNIZE A PALESTINIAN STATE YETPARIS — France indicated that it isn’t ready to join other countries in recognizing a Palestinian state, even if it isn’t opposed to the idea in principle.\nIRELAND RECOGNIZES A PALESTINIAN STATE IN COORDINATED MOVE WITH SPAIN AND NORWAYLONDON — Ireland has recognized a Palestinian state, Prime Minister Simon Harris said Wednesday.\nSPAIN ANNOUNCES IT WILL RECOGNIZE A PALESTINIAN STATEBARCELONA, Spain — Spanish Prime Minister Pedro Sánchez says that his country will recognize a Palestinian state on May 28.", "location": "Ireland", "classification": "security", "score": 0.6405147070690561, "event_breakdown": "Events:\n* Norway, Ireland and Spain recognized a Palestinian state.\n* France said it is not ready to join other countries in recognizing a Palestinian state.\n* Ireland recognized a Palestinian state.\n* Spain announced it will recognise a Palestinian state."}, {"id": "0199f49f-d453-444c-9859-703bd125d4f9", "title": "How the IDF is attempting to dislodge Hamas from Jabalya", "date": "2024-05-22 13:15", "url": "https://www.jpost.com/israel-hamas-war/article-802198", "message": "But it turns out that there were areas the IDF didn’t reach, and Hamas has returned to Jabalya and other places.\nThe 98th Division has brought the skills it learned in Khan Yunis to Jabalya.\nThe 98th Division left Khan Yunis in early April and was sent into Jabalya about a month later.\nOfficers at the company and battalion level are gaining unique skills from their experience in Khan Yunis, Jabalya, and other areas.\nAs in Khan Yunis, the IDF continues to find weapons in many civilian homes.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.819370223648967, "event_breakdown": "Events:\n- IDF enters Jabalya\n- IDF finds weapons in civilian homes in Jabalya and Khan Yunis"}, {"id": "7c38e72b-2091-4044-add0-c13eafe604fd", "title": "ISPR says security forces killed 29 terrorists in April - Pakistan", "date": "2024-05-22 12:15", "url": "https://www.brecorder.com/news/40304688/ispr-says-security-forces-killed-29-terrorists-in-april", "message": "The Inter-Services Public Relations (ISPR) announced on Wednesday that 29 terrorists have been successfully neutralised by the security forces in past one month.\n“In this context, in addition to other areas along Pakistan-Afghanistan border, security forces are conducting operations in general area Sambaza in Zhob District of Balochistan, since April 21, 24,” the ISPR said.\nPakistan’s security forces are determined and remain committed to secure the borders and ensure safety of its citizens against the scourge of terrorism, the military’s media wing added.\nHowever, the DG ISPR lamented that despite Pakistan’s efforts for peace, its security personnel and workers have been martyred in huge numbers.\nSeven terrorists killed as security forces foil infiltration bid from Afghanistan“There is concrete evidence that Tehreek-i-Taliban Pakistan (TTP) terrorists are still using Afghan soil to launch attacks in Pakistan.", "location": "Pakistan", "classification": "security", "score": 0.7035895312362558, "event_breakdown": "* 29 terrorists neutralised by security forces in past one month\n* Military conducting operations in general area Sambaza since April 21, 24\n* TTP terrorists still using Afghan soil to launch attacks in Pakistan"}, {"id": "5d955e44-291b-413e-80b9-461d6483ed31", "title": "Putin ready to launch INVASION of Nato nations & could annex parts of Estonia & Sweden to test West , warns top spy boss", "date": "2024-05-22 06:30", "url": "https://www.thesun.co.uk/news/27778356/putin-military-operation-nato-seize-parts-estonia-sweden/", "message": "VLADIMIR Putin is ready to launch a military operation against a Nato country to test the West, a Polish spy boss has warned.\nA number of Nato member states in Europe have alerted the public in recent weeks about the possibility of impending Russian aggression.\nPoland has already given the green light as they're ready to host nuclear weapons on their borders if needed.\nEstablished in the North Atlantic Treaty of 1949, it essentially means that an attack against one Nato member is considered an attack against all members.\nIf any NATO member state is attacked, the other members are obligated to come to its defence, using whatever means necessary, including military force.", "location": "Warsaw, Poland", "classification": "security", "score": 0.53485054280563, "event_breakdown": "Events:\n- Warning that Vladimir Putin is ready to launch a military operation against a NATO country to test the West.\n- Poland ready to host the nuclear weapons on the borders if needed, and has given the green light as they're alert to possible Russian aggression.\n- Poland is one of the several states in Europe that has warned the public about the possibility of impending Russian aggression."}, {"id": "4b5a99de-7389-4fcb-8af4-f50a758be3fa", "title": "On This Day , May 22 : Crater Lake National Park established", "date": "2024-05-22 08:15", "url": "https://www.yahoo.com/news/day-may-22-crater-lake-070007243.html", "message": "On May 22, 1902, President Theodore Roosevelt established Crater Lake National Park in southwest Oregon, the fifth-oldest national park in the United States.\nIn 1902, President Theodore Roosevelt established Crater Lake National Park in southwest Oregon, the fifth-oldest national park in the United States.\nFile Photo by Joe Mitchell/UPIIn 1990, South Yemen and North Yemen united, forming the new Yemeni Arab Republic.\nIn 2011, the deadliest tornado to strike the United States in half a century roared into the heart of Joplin, Mo., with winds of 200 mph.\nIn 2017, a suicide bomber killed 22 people attending an Ariana Grande concert in Manchester, England.", "location": "Crater Lake National Park", "classification": "security", "score": 0.6350804278032686, "event_breakdown": "2017 Manchester suicide bombing\n2011 Joplin tornado"}, {"id": "c839cb36-2f9f-4fc4-8ecc-7be026a2b481", "title": "Kyiv Blackouts as Russia Continues Focus on Bombing Ukraine Power", "date": "2024-05-22 17:15", "url": "https://www.breitbart.com/politics/2024/05/22/kyiv-experiences-blackouts-as-russia-continues-focus-on-bombing-ukraines-power-infrastructure/", "message": "KYIV, Ukraine (AP) – Sustained Russian attacks on Ukraine’s power grid in recent weeks have forced leaders of the war-ravaged country to institute nationwide rolling blackouts.\nAmong the strikes were an April barrage that damaged Kyiv´s largest thermal power plant and a massive attack on May 8 that targeted power generation and transmission facilities in several regions.\nIn all, half of Ukraine´s energy system was damaged, Foreign Minister Dmytro Kuleba said.\nRussia Destroys Major Ukrainian Power Plant In Missile Strike, Power Shortages Expected https://t.co/Rd2gyq14oj — Breitbart London (@BreitbartLondon) April 12, 2024Entire apartment blocks in the capital went dark.\nGerman Foreign Minister Annalena Baerbock´s joined him on the plant visit, underscoring Ukraine´s desperation to close the power gap as quickly as possible.", "location": "KYIV, Ukraine.", "classification": "security", "score": 0.5377286273241071, "event_breakdown": "* April barrage damages Kyiv's largest thermal power plant (geolocation: Kyiv)\n* Massive attack on May 8 targets power generation and transmission facilities in several regions (geolocation: various regions)\n* Russian attacks have forced Ukraine to implement nationwide rolling blackouts (geolocation: nationwide)"}, {"id": "fa9876f4-d1f2-4830-9bec-6225a4d21346", "title": "Timeline : Which countries have recognised Palestinian state ? When and why ? ", "date": "2024-05-22 13:15", "url": "https://www.euronews.com/2024/05/22/timeline-which-countries-have-recognised-palestinian-state-when-and-why", "message": "Why is recognising the Palestinian state such a polarising issue?\nAlthough numerous Arab League and developing countries in Asia and Africa pledged their support, by February 1989, only 94 countries officially recognised Palestine as an independent state.\nSome countries have established diplomatic relations with the Fatah-led Palestinian Authority, seen by many as the de facto government of the Palestinian state.\nSweden recognised Palestinian statehood in 2014, but its officials have since walked back on the pledge, with former Foreign Minister Tobias Billström calling it \"unfortunate and premature\" in 2022.\nHungary also recognised Palestine as a sovereign state in the same year, while both European countries were still part of the Soviet bloc.", "location": "GAZA CITY", "classification": "security", "score": 0.4187121527124374, "event_breakdown": "Security Events from the Text:\n\n1989: Only 94 countries officially recognize Palestine as an independent state.\n2022: Sweden walks back on its pledge to recognize Palestine as a sovereign state.\n2022: Hungary recognizes Palestine as a sovereign state."}, {"id": "832c68c5-5f0a-43b6-ab2d-8caadfc664ee", "title": "Gunmen kill 40 in north - central Nigeria attack", "date": "2024-05-22 03:15", "url": "https://www.myjoyonline.com/gunmen-kill-40-in-north-central-nigeria-attack/", "message": "At least 40 people were killed and many others wounded in an attack by gunmen on Zurak village in Nigeria's north-central Plateau state, where clashes between herders and farmers are rife, the police and residents said on Tuesday.\nWhile seven of the assailants were neutralised by security agents, fleeing gang members killed nine people and burnt down six houses, Alabo said in a statement.\nThey told Reuters that dozens of gunmen had stormed the village on motorcycles, shooting indiscriminately, abducting an unspecified number of people, and setting houses ablaze.\nUntil now, I haven't seen many of my family members,\" said Babangida Aliyu, a resident of Zurak who fled.\nAlabo said the Plateau police command has deployed more officers to the area to secure the villages.", "location": "ZURAK.", "classification": "security", "score": 0.9205307976795953, "event_breakdown": "Events:\n- Terrorist attack in Zurak, Nigeria\n- Clashes between herders and farmers in Plateau state, Nigeria"}, {"id": "7c4fd879-bb08-4602-ba78-ae4cfd6bff53", "title": "Russians drop aerial bomb on Toretsk district , injuring 3 civilians", "date": "2024-05-22 14:30", "url": "https://www.yahoo.com/news/russians-drop-aerial-bomb-toretsk-120002311.html", "message": "The Russians have struck the village of Pivnichne in the Toretsk hromada [a hromada is an administrative unit designating a village, several villages, or a town, and their adjacent territories – ed.\nSource: report by the Donetsk Oblast Prosecutor’s OfficeQuote: \"On 22 May 2024 at 11:50, the Russian troops launched an airstrike on the village of Pivnichne near the city of Toretsk.\nThey were hospitalised with shrapnel wounds, mine-blast injuries and craniocerebral injuries.\"\nDetails: The Prosecutor’s Office added that the Russians likely used a guided aerial bomb for the strike.\nBackground: On 22 May the Russians struck a residential area in the Shevchenkivskyi district of the city of Kharkiv with guided aerial bombs, injuring nine people.", "location": "TORETSK", "classification": "security", "score": 0.9903654080995004, "event_breakdown": "Here is a list of security events based on the information provided:\n- Russian troops launched a strike on the village of Pivnichne in the Toretsk hromada on May 22nd, 2024 at 11:50 AM.\n- The village of Pivnichne was struck with a guided aerial bomb.\n- The missile injured 9 people."}, {"id": "8f9957f2-109c-4c17-952c-37e31ca897dd", "title": "White House says no  day after  plan from Israel emboldens Hamas , as IDF advances to", "date": "2024-05-22 20:00", "url": "https://www.ynetnews.com/article/bji0roi7r", "message": "The IDF said on Wednesday that its forces have made significant strides in the war against Hamas.\nAccording to reports, forces reached the outskirts of a refugee camp located in the center of Rafah, but have not yet entered tghe city center, as intense fighting continues.\nThe IDF said on Wednesday that its forces have made significant strides in the war against Hamas.\nAccording to reports, forces reached the outskirts of a refugee camp located in the center of Rafah, but have not yet entered tghe city center, as intense fighting continues.\nAccording to reports, forces reached the outskirts of a refugee camp located in the center of Rafah, but have not yet entered tghe city center, as intense fighting continues.", "location": "RAFAH.", "classification": "security", "score": 0.8100800521364754, "event_breakdown": "1. IDF forces have made significant strides in the war against Hamas.\n2. IDF forces have reached the outskirts of a refugee camp located in the center of Rafah.\n3. IDF forces have not yet entered the city center of Rafah as intense fighting continues."}, {"id": "c3ab619e-cb8f-4d70-bd59-e32c5f486124", "title": "Israel - Hezbollah border clashes : Latest developments", "date": "2024-05-22 17:30", "url": "https://www.naharnet.com/stories/en/305383-israel-hezbollah-border-clashes-latest-developments", "message": "Israeli warplanes and drones raided Wednesday the southern border towns of Mays al-Jabal and Aita al-Shaab while artillery shelled Markaba and the outskirts of Tayrharfa and Alma al-Shaab.\nOn Tuesday, Hezbollah carried out seven attacks on Israeli positions.\nThe fighting has so far killed at least 426 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally.\nIsrael says 14 soldiers and 11 civilians have been killed on its side of the border.\nThe violence has raised fears of all-out conflict between Hezbollah and Israel, which went to war in 2006.", "location": "Lebanon", "classification": "security", "score": 0.9581179580506956, "event_breakdown": "Israeli warplanes and drones raid the southern border towns of Mays al-Jabal and Aita al-Shaab, artillery shells Markaba and the outskirts of Tayrharfa and Alma al-Shaab. Hezbollah carries out several attacks on Israeli positions."}, {"id": "dca31904-16cc-4637-bd2b-ead44c5fd2cd", "title": "Israeli Attack Survivor Tells Her Story in East Hampton", "date": "2024-05-22 22:45", "url": "https://www.danspapers.com/2024/05/israeli-attack-survivor-east-hampton/", "message": "“When I’m standing here today, I’m their legacy.”Gafner told her story to a rapt, standing-room-only audience of congregants and guests at the Chabad of the Hamptons on Woods Lane in East Hampton.\n“When I smell the grass of the kibbutz and when I enter the gate, I know I’m home,” she said.\nMultiple sirens went off before Gafner, her family and her neighbors began to comprehend the intensity of the threat they were facing.\n“I could actually hear a Hamas terrorist stepping into my home.\nAccording to reports in the Israeli press, at least five other kibbutz residents were taken hostage, their fates unclear.", "location": "EAST HAMPTONS", "classification": "security", "score": 0.4290339596975901, "event_breakdown": "Security events:\n1. A Hamas terrorist entered Gafner's home.\n2. Five other residents were abducted and their fates were unclear."}, {"id": "aa7c0ef3-a31f-4e6f-af3c-ca51f15bf864", "title": "  Everything is burning : Battles rage outside Kharkiv as Ukraine tries to hold back Russian advance - LocalNews8 . com", "date": "2024-05-22 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/22/everything-is-burning-battles-rage-outside-kharkiv-as-ukraine-tries-to-hold-back-russian-advance/", "message": "Russia’s relentless onslaught has a key goal: If they take Lyptsi, then they can position artillery within range of Ukraine’s second city, Kharkiv, 20 minutes down the road.\n“They’re not sending just anyone into the assaults.”His stare lengthens when asked about what fortifications were in place before the surprise Russian attack.\nAt one position closer to the Russian border, the 92nd Assault Brigade showed CNN a Russian artillery gun, captured in the first days of the war, from which they are now firing French mortar shells.\nThe gun was partially hidden by a wire net, aimed at providing some protection from an attack drone.\nAttacks persisted in the distance however, keeping the city’s residents awake through violently loud nights, now amplified by the threat of Russian artillery edging closer.", "location": "KHARKIV, UKRAINE", "classification": "security", "score": 0.8561941388173286, "event_breakdown": "Security Events:\n\n1. Russian onslaught has a key goal of taking Lyptsi\n2. Artillery can be positioned within range of Kharkiv when Russians take Lyptsi\n3. Surprise Russian attack\n4. 92nd Assault Brigade has a position of French mortar shells\n5. Artillery gun was hidden by a wire net\n6. Attacks persist in the distance\n7. Nights in the city are violent and disturbed by the presence of Russian artillery.\n8. Newly captured Russian artillery can be used to attack French mortar shells."}, {"id": "ba2500e0-67e8-4fb5-81cf-bd0b2ab593f3", "title": "Vladimir Putin Massacres Over 80 , 000 Dolphins , Other Species in Ukraine War", "date": "2024-05-22 22:30", "url": "https://radaronline.com/p/vladimir-putin-kills-80000-dolphins-ukraine-war/", "message": "Vladimir Putin's troops have reportedly massacred over 80,000 dolphins and other wildlife in the Ukraine war, RadarOnline.com has learned.\nRussian navy sonar and explosions are believed to be responsible for killing tens of thousands of dolphins in Ukraine's Black Sea, while explosions over a nature park have had a devastating impact on hundreds of animals.", "location": "Ukraine", "classification": "security", "score": 0.6422190028628982, "event_breakdown": "* Massacring dolphins in the Black Sea\n* Killing wildlife in the Black Sea\n* Explosions over a nature park in Ukraine"}, {"id": "28e52016-7aef-4c3d-a2fe-08033f7544e2", "title": "  Everything is burning : Battles rage outside Kharkiv as Ukraine tries to hold back Russian advance", "date": "2024-05-22 23:15", "url": "https://www.aol.com/everything-burning-battles-rage-outside-191129343.html", "message": "Russia’s relentless onslaught has a key goal: If they take Lyptsi, then they can position artillery within range of Ukraine’s second city, Kharkiv, 20 minutes down the road.\n“They’re not sending just anyone into the assaults.”His stare lengthens when asked about what fortifications were in place before the surprise Russian attack.\nAt one position closer to the Russian border, the 92nd Assault Brigade showed CNN a Russian artillery gun, captured in the first days of the war, from which they are now firing French mortar shells.\nThe gun was partially hidden by a wire net, aimed at providing some protection from an attack drone.\nAttacks persisted in the distance however, keeping the city’s residents awake through violently loud nights, now amplified by the threat of Russian artillery edging closer.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8561941388173286, "event_breakdown": "Security events in the text:\n\n1. Russian artillery is positioning itself within range of Ukraine’s second city, Kharkiv.\n2. Russian troops captured a Russian artillery gun in Ukraine and fired mortar shells from the captured gun."}, {"id": "cc1048fb-2e0f-4c5f-b68c-d1d39d39955c", "title": "The Mystery of Indira Gandhi assassination by her own bodyguards", "date": "2024-05-22 19:45", "url": "https://www.yahoo.com/news/mystery-indira-gandhis-assassination-her-170727484.html", "message": "The Mystery of Indira Gandhi's assassination by her own bodyguardsIndira Gandhi, a prominent Indian politician and the daughter of Jawaharlal Nehru, India's inaugural prime minister, was tragically assassinated by her own bodyguards on Oct. 31, 1984.\nIn exploring the narrative of Gandhi's assassination, it is crucial to examine the backgrounds and motivations of her assailants, shedding light on the reasons that led to their fatal decision.\nGandhi's assassination on Oct. 31, 1984, was committed by her bodyguards, notably Beant Singh, who was considered a favorite.\nIndira Gandhi’s son, Sanjay Gandhi, succeeded her as prime minister of India.\nOriginal article source: The Mystery of Indira Gandhi's assassination by her own bodyguards", "location": "New Delhi", "classification": "security", "score": 0.6966946750164952, "event_breakdown": "Security Events:\n\n* Assassination of a prominent Indian politician, Indira Gandhi, by her own bodyguards on Oct. 31, 1984.\n* Beant Singh, considered a favorite, was a part of the bodyguards responsible for the assassination.\n* Indira Gandhi's son, Sanjay Gandhi, succeeded her as the Prime minister of India."}, {"id": "25dedeb7-99ed-4f5e-80b8-0e062cc08a92", "title": "Why Is the White House Hiding the Nationalities of Terror Suspects at the Border ? ", "date": "2024-05-22 20:00", "url": "https://townhall.com/columnists/williamdavis/2024/05/22/why-is-the-white-house-hiding-the-nationalities-of-terror-suspects-at-the-border-n2639360", "message": "The administration claims it can’t release this information because it would violate the privacy of these suspected terrorists.\nThe reason the nationality of these suspected terrorists is important is because it helps identify the potential sources behind these threats.\nPerhaps the most ominous data coming from the border is the large number of “gotaways” who have illegally entered the country and eluded Border Patrol.\nFor the suspected terrorists we do know about, however, the federal government owes the public the upmost transparency.\nIf the Biden administration refuses to secure the border, the least they can do is let the public know who’s coming here and where they’re coming from.", "location": ".\nBased on the context provided, I was not able to find a specific location that the main focus of the event takes place.", "classification": "security", "score": 0.40225862377156113, "event_breakdown": "Security Events:\n1. Gotaways who crossed the border illegally eluded Border Patrol.\n2. Many suspected terrorists were apprehended at the southern border.\n3. The federal government owes the public the utmost transparency when it comes to information about suspected terrorists.\n4. The administration claims it cannot release this information because it would violate the privacy of these suspected terrorists.\n5. Nationality of these suspected terrorists is important to help identify potential sources behind these threats."}, {"id": "182a0385-94d6-4b30-b0f7-b57cf0ca5691", "title": "Families of Uvalde school shooting victims plan Wednesday announcement ahead of 2 - year anniversary – Winnipeg Free Press", "date": "2024-05-22 04:45", "url": "https://www.winnipegfreepress.com/world/2024/05/21/families-of-uvalde-school-shooting-victims-plan-wednesday-announcement-ahead-of-2-year-anniversary", "message": "FILE - Crosses are surrounded by flowers and other items at a memorial, Thursday, June 9, 2022, for the victims of a shooting at Robb Elementary School in Uvalde, Texas.\nFamilies of the victims in the Uvalde elementary school shooting listen to attorney Josh Koskoff during a news conference, Wednesday, May 22, 2024, in Uvalde, Texas.\nThe families of 19 of the victims announced a lawsuit against nearly 100 state police officers who were part of the botched law enforcement response.\nFamilies of the victims in the Uvalde elementary school shooting arrive for a news conference, Wednesday, May 22, 2024, in Uvalde, Texas.\nThe families of 19 of the victims announced a lawsuit against nearly 100 state police officers who were part of the botched law enforcement response.", "location": "Uvalde, Texas", "classification": "security", "score": 0.5226616528188814, "event_breakdown": ".\n- A shooting at Robb Elementary School in Uvalde, Texas, left 19 victims dead.\n- Families of the 19 victims announced a lawsuit against nearly 100 state police officers who were part of the botched law enforcement response."}, {"id": "9a724a05-08e9-4b94-a2b1-8102d986640a", "title": "The Latest | Norway , Ireland and Spain make a coordinated move to recognize a Palestinian state – Winnipeg Free Press", "date": "2024-05-22 08:15", "url": "https://www.winnipegfreepress.com/world/2024/05/22/the-latest-norway-ireland-and-spain-make-a-coordinated-move-to-recognize-a-palestinian-state", "message": "Ireland and Spain have recognized a Palestinian state.\nCurrently:— Takeaways from AP examination of how two debunked accounts of sexual violence on Oct. 7 originated— Norway, Ireland and Spain recognize a Palestinian state in a historic move.\nNorway, Ireland and Spain recognized a Palestinian state on Wednesday May 22, 2024 in a historic move that drew condemnation from Israel and jubilation from the Palestinians.\nFRANCE INDICATES IT WON’T RECOGNIZE A PALESTINIAN STATE YETPARIS — France indicated that it isn’t ready to join other countries in recognizing a Palestinian state, even if it isn’t opposed to the idea in principle.\nIRELAND RECOGNIZES A PALESTINIAN STATE IN COORDINATED MOVE WITH SPAIN AND NORWAYLONDON — Ireland has recognized a Palestinian state, Prime Minister Simon Harris said Wednesday.", "location": "LONDON", "classification": "security", "score": 0.7602847799573694, "event_breakdown": "The following are the security events mentioned in the text:\n\n1. Norway, Ireland, and Spain recognize a Palestinian state on May 22, 2024.\n2. France indicated that it is not ready to join other countries in recognizing a Palestinian state, even if it doesn't oppose the idea in principle.\n3. Ireland recognizes a Palestinian state on May 22, 2024."}, {"id": "0c3d3785-d135-40f3-9996-5276774f3fd4", "title": "Netanyahu , Hamas Leaders : France , Belgium back ICC bid for arrest warrants", "date": "2024-05-22 00:45", "url": "https://www.thedailystar.net/news/world/middle-east/news/netanyahu-hamas-leaders-france-belgium-back-icc-bid-arrest-warrants-3615766", "message": "France, Belgium and Slovenia released statements supporting the world's top war crimes court and its chief prosecutor's request for arrest warrants for leaders of Israel and Hamas, after Israel and the United States both harshly condemned the effort.\nWhile Netanyahu and Gallant do not face imminent arrest, the announcement Monday was a symbolic blow that deepened Israel's isolation over the offensive in Gaza, reports AP.\nThe Belgian Foreign Minister Hadja Lahbib welcomed the International Criminal Court (ICC) prosecutor's request for arrest warrants against Israeli and Hamas leaders as an \"important step\".\nAt least 35,647 Palestinians have been killed in Israel's offensive in Gaza, according to the enclave's health ministry yesterday.\nAn airstrike on a house in Jabalia killed at least three people overnight.", "location": "GAZA", "classification": "security", "score": 0.6004580092263544, "event_breakdown": "* Israel launched an offensive in Gaza on May 10, 2021.\n* The ICC prosecutor requested arrest warrants for Israeli and Hamas leaders on June 22, 2021.\n* A strike on a house in Jabalia killed at least three people overnight on July 22, 2021."}, {"id": "e395a259-681f-417e-a323-10fcf3741aa8", "title": "Letters : US president Joe Biden condemnation of the ICC arrest warrants may ruin election chances", "date": "2024-05-22 04:45", "url": "https://www.independent.ie/opinion/letters/letters-us-president-joe-bidens-condemnation-of-the-icc-arrest-warrants-may-ruin-election-chances/a265103053.html", "message": "Finally, it must be recognised that being against Netanyahu and the Israeli government’s actions in Gaza does not mean being antisemitic; it means being against war crimes and crimes against humanity.\nComplicity with war crimes and genocide is also a crime that comes within the remit of the ICC and the International Court of Justice (ICJ).\nThe US and several Nato and EU member states have been actively supportive of Israeli war crimes and probable genocide in Gaza, by supplying large amounts of the weapons and munitions that Israel has been using to commit those crimes.\nBy allowing US military aircraft to use Shannon Airport and Irish airspace, Ireland and its leaders and officials are at least indirectly ­complicit in war crimes and ­probable genocide.\nI believed it was the local authority and the local agencies, given the numbers employed, that sort out local queries and problems.", "location": "Based on the text provided, I was unable to come up with a specific location.", "classification": "security", "score": 0.5998094534813203, "event_breakdown": "Security Events:\n\n1. Supply of US weapons and munitions to Israel by US and several NATO and EU member states, for use in committing war crimes in Gaza.\n2. Complicity with war crimes and probable genocide by the US, several NATO and EU member states, by allowing the use of their territory or airspace by US military aircraft."}, {"id": "32a76e6c-8021-4d63-b065-00bacb6a567e", "title": "Warrants for war criminals - Newspaper", "date": "2024-05-22 03:45", "url": "https://www.dawn.com/news/1834979/warrants-for-war-criminals", "message": "In the same statement, Khan announced that he had also requested arrest warrants for Hamas leaders Yahya Sinwar, Ismail Haniyeh and Muhammad Diab Ibrahim al-Masri.\nHamas leaders accused him of equating the victims of the war with the perpetrators.\nThe request for warrants is now with the judges of the ICC, who will evaluate whether the evidence submitted by Karim Khan is adequate for the warrants to be issued.\nIf they decide that there is adequate evidence submitted in support of the arrest warrants, these will then be issued.\nIts leaders facing arrest warrants may abridge their travels to some extent, but their movement is already greatly limited by the classification of the organisation.", "location": "Based on the context provided, I was unable to come up with a specific location for the main event.", "classification": "security", "score": 0.505337752918202, "event_breakdown": "Security Events:\n\n1. Karim Khan (Chief Prosecutor at the ICC) submits a request for arrest warrants for Hamas leaders Yahya Sinwar, Ismail Haniyeh, and Muhammad Diab Ibrahim al-Masri.\n2. Hamas leaders accuse Khan of equating the victims of the war with the perpetrators."}, {"id": "e478eb47-a8a5-42c8-8777-d5ab73f3979d", "title": "Israel - Hezbollah border clashes : Latest developments", "date": "2024-05-22 11:15", "url": "https://www.naharnet.com:443/stories/en/305383-israel-hezbollah-border-clashes-latest-developments", "message": "Israeli warplanes and drones raided Wednesday the southern border towns of Mays al-Jabal and Aita al-Shaab while artillery shelled Markaba and the outskirts of Tayrharfa and Alma al-Shaab.\nOn Tuesday, Hezbollah carried out seven attacks on Israeli positions.\nThe fighting has so far killed at least 426 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally.\nIsrael says 14 soldiers and 11 civilians have been killed on its side of the border.\nThe violence has raised fears of all-out conflict between Hezbollah and Israel, which went to war in 2006.", "location": "Lebanon", "classification": "security", "score": 0.9581179580506956, "event_breakdown": "Israeli warplanes and drones raid on Mays al-Jabal, Aita al-Shaab, Markaba, Tayrharfa, and Alma al-Shaab; Hezbollah carries out seven attacks on Israeli positions."}, {"id": "edd0eba3-9fd4-4351-b441-bddb7e660832", "title": "Nigeria : Gunmen Kill Dozens in Attack On Nigerian Mining Community", "date": "2024-05-22 11:00", "url": "https://allafrica.com/stories/202405220280.html", "message": "Gunmen on motorbikes stormed a mining community in central Nigeria, killing up to 40 people and torching homes, residents said, in the latest violence to hit a region troubled by resource disputes and intercommunal strife.\nArmed men invaded Zurak community, shooting sporadically and torching houses, Plateau state commissioner for information Musa Ibrahim Ashoms told French news agency AFP by telephone.\nHe initially gave an estimate of around 40 killed, but later said only nine had so far been confirmed dead after speaking to local officials as the situation was still unclear.\nBut local residents and youth leader Shafi'i Sambo said at least 40 people had been killed in the raid.\nOutbreaks of violenceWase has deposits of zinc and lead, while Plateau as a whole is known for its tin mining industry.", "location": "Wase, Plateau state, Nigeria", "classification": "security", "score": 0.7730353684164929, "event_breakdown": "Security events:\n- Armed men on motorbikes storm Zurak community, shooting sporadically\n- Homes torched in Zurak community"}]