[{"id": "491ac38c-26e0-428b-85be-82624237398c", "title": "Gaza : Hamas says senior government official in Gaza killed in airstrike", "date": "2024-07-08 00:15", "url": "https://www.9news.com.au/national/hamas-says-senior-government-official-in-gaza-killed-in-airstrike/40ad4542-8a71-4f8e-b040-64024dc05fa6", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "An Israeli airstrike in Gaza City killed a senior official in the Hamas-run government Sunday, according to the organization.\nHamas said that Ehab al-Ghussein, the Deputy Minister of Labor, was among four people killed by an Israeli airstrike on the Holy Family School in Gaza City.\nIn May, his sister Muna Jamal and wife Amani Sakeek were killed in an Israeli airstrike, according to reports at the time.\n(AP Photo/Ohad Zwigenberg, Pool)It's not clear whether the strikes were those in which a senior Hamas official was killed.\n(AP Photo/Ohad Zwigenberg, Pool)The strike took place at UNRWA's Al-Jaouni school in al-Nuseirat camp in central Gaza on Saturday.", "location": "GAZA CITY", "classification": "security", "score": 0.925631542879159, "event_breakdown": "Israeli airstrikes on Gaza City kill senior Hamas official"}, {"id": "d87672ef-7b41-4242-bd6e-99c2f5d767ec", "title": "Hezbollah targets Israeli mountain base in  largest air attack  ", "date": "2024-07-08 00:45", "url": "https://www.prokerala.com/news/articles/a1545416.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, July 8 : Hezbollah has said that it attacked with drones at Israel's technical and electronic reconnaissance centre in Mount Hermon, north of Golan Heights, in response to Israel's killing of a senior Hezbollah member on Saturday.\nThe well-equipped centre was set on fire, and its targeted devices were destroyed in the air attack by \"successive squadrons of assault drones\", the Lebanese military group said in a statement on Sunday.\nThe group said the centre in Mount Hermon was targeted for the first time since the 1973 Arab-Israeli war, and the operation is considered the largest by Hezbollah's air force since October 8, 2023, Xinhua news agency reported.\nOn Saturday, the Israeli military killed Hezbollah commander Maysam Al-Attar in a drone strike on the city of Baalbek, eastern Lebanon.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with a surprise attack by Gaza-ruling Palestinian faction Hamas into Israel the day before.", "location": "Mount Hermon, Golan Heights", "classification": "security", "score": 0.8718800345612281, "event_breakdown": "Beirut, July 8 : Hezbollah has said that it attacked with drones at Israel's technical and electronic reconnaissance centre in Mount Hermon, north of Golan Heights, in response to Israel's killing of a senior Hezbollah member on Saturday.\n\nIsrael -- Mount Hermon\n\nThe well-equipped centre was set on fire, and its targeted devices were destroyed in the air attack by \"successive squadrons of assault drones\", the Lebanese military group said in a statement on Sunday.\n\nThe group said the centre in Mount Hermon was targeted for the first time since the 1973 Arab-Israeli war, and the operation is considered the largest by Hezbollah's air force since October 8, 2023, Xinhua news agency reported.\n\nOn Saturday, the Israeli military killed Hezbollah commander Maysam Al-Attar in a drone strike on the city of Baalbek, eastern Lebanon.\n\nTensions along the Lebanon-Israel border escalated on October 8, 2013, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with a surprise attack by Gaza-ruling Palestinian faction Hamas into Israel the day before."}, {"id": "fa0869c4-304f-472a-9d96-ab8095e9badd", "title": "Hezbollah launches drone attack on Mount Hermon in Israeli - occupied Syrian Golan Heights", "date": "2024-07-08 00:00", "url": "https://uk.news.yahoo.com/hezbollah-launches-drone-attack-mount-224349624.html", "domain": "uk.news.yahoo.com", "domain_classification": "Unknown", "message": "People work to put out fires after Hezbollah launched projectiles at Israel, amid hostilities between Hezbollah and Israeli forces, in the GalileePeople work to put out fires after Hezbollah launched projectiles at Israel, amid hostilities between Hezbollah and Israeli forces, in the GalileeAMMAN (Reuters) - The Iranian-backed Hezbollah militant group said on Sunday it launched a drone attack on Mount Hermon in the Israeli-occupied Syrian Golan Heights where Israel has a key surveillance centre.\nHezbollah says it would halt operations only when the war ends.\nAlthough it had hit other areas in the occupied Syrian Golan Heights repeatedly, Lebanon's Hezbollah said it was the first time to hit the military target that is at the highest elevation in the Israeli-controlled territory.\nIsrael blames Iranian-backed Hezbollah for the increase in violence and has repeated its vows to restore security to the border.\nThe Israel Defence Forces did not immediately reply to a request for comment on the latest Hezbollah strike.", "location": "Mount Hermon", "classification": "security", "score": 0.619119520683236, "event_breakdown": "1. Hezbollah using drones to attack Mount Hermon in Golan Heights in the Israeli-occupied portion of the country\n2. Israel blames Iranian-backed Hezbollah for increasing violence and vows to restore security to border"}, {"id": "6318aef5-eacb-457e-bc4d-3f7e42d7cafc", "title": "Israel - Gaza live updates : US Embassy says American injured by Hezbollah rocket fire", "date": "2024-07-08 00:45", "url": "https://www.kdks.fm/syndicated-article/?id=1572857", "domain": "kdks.fm", "domain_classification": "Unknown", "message": "All times Eastern:Jul 07, 5:07 PMAmerican hurt by Hezbollah rocket fire: US EmbassyA U.S. citizen was injured Sunday by one of multiple rockets fired into Israel from Lebanon by the terrorist group Hezbollah, according to the U.S. embassy in Israel.\nThe answer is yes,” Israel Defense Forces spokesman Daniel Hagari told ABC News.\nFires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area, the Israel Defense Forces said.\nAs the sirens began “numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory,” the Israel Defense Forces said.\nA senior Hezbollah official said this week it can only sign the deal after Israel reaches a cease-fire with Hamas in Gaza.", "location": ".\nIsrael", "classification": "security", "score": 0.9181732800262303, "event_breakdown": "1 - US Embassy - Jul 07, 5:07 PM (Jerusalem) : A US citizen was injured Sunday by one of multiple rockets fired into Israel from Lebanon by the terrorist group Hezbollah.\n2 - Lebanon- Israel border - As sirens began \"numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory\".\n3 - Gaza - A senior Hezbollah official said this week it can only sign the deal after Israel reaches a cease-fire with Hamas in Gaza."}, {"id": "6384e45e-557c-47ae-9063-c7a71f27e730", "title": "World - HITS FM", "date": "2024-07-08 00:00", "url": "https://hitsfm.net/world/85ef484998d1c610a8b8b6278b43abda", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "Tents sheltering displaced Palestinians in Rafah in the southern Gaza Strip are pictured on June 4, 2024 amid the ongoing conflict in the Palestinian territory between Israel and Hamas.\nThe answer is yes,\" Israel Defense Forces spokesman Daniel Hagari told ABC News.\nFires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area, the Israel Defense Forces said.\nAs the sirens began \"numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory,\" the Israel Defense Forces said.\n\"A number of the projectiles were intercepted and some of the projectiles fell inside southern Israel.", "location": "Israel", "classification": "security", "score": 0.9522733947799622, "event_breakdown": "Event 1 (June 4, 2024 - Rafah, Gaza): Tents sheltering displaced Palestinians in Rafah in the southern Gaza Strip are pictured amid the ongoing conflict in the Palestinian territory between Israel and Hamas.\nEvent 2 (June 19, 2024 - Northern Israel): Fires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area.\nEvent 3 (June 19, 2024 - Israel-Lebanon border): As the sirens began, numerous projectiles crossed from Lebanon into Israeli territory. The Israel Defense Forces said some of the projectiles were intercepted and some of them fell inside southern Israel."}, {"id": "ddbd9858-cbee-4300-8035-52faf4beec7a", "title": "Israel - Gaza live updates : US Embassy says American injured by Hezbollah rocket fire", "date": "2024-07-08 00:30", "url": "http://www.exploreseiowa.com/syndicated-article/?id=1572857", "domain": "exploreseiowa.com", "domain_classification": "Unknown", "message": "All times Eastern:Jul 07, 5:07 PMAmerican hurt by Hezbollah rocket fire: US EmbassyA U.S. citizen was injured Sunday by one of multiple rockets fired into Israel from Lebanon by the terrorist group Hezbollah, according to the U.S. embassy in Israel.\nThe answer is yes,” Israel Defense Forces spokesman Daniel Hagari told ABC News.\nFires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area, the Israel Defense Forces said.\nAs the sirens began “numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory,” the Israel Defense Forces said.\nA senior Hezbollah official said this week it can only sign the deal after Israel reaches a cease-fire with Hamas in Gaza.", "location": "Israel", "classification": "security", "score": 0.9181732800262303, "event_breakdown": "Events:\nIsrael Defense Forces (IDF) targeted a Hezbollah vehicle near the Lebanese border.\nIDF sources confirm that a small diameter bomb was used in the attack which makes the likelihood of casualties lower.\nBetween 150 and 200 artillery shells were fired from Lebanon on Tuesday toward multiple IDF positions along the border.\nThe Israeli military says a Palestinian man was killed and 10 people were hurt by the shrapnel."}, {"id": "c107db05-2b00-4b6c-9adf-afb01dcbe767", "title": "Sister of North Korean leader Kim calls South Korea live - fire drills  suicidal hysteria  ", "date": "2024-07-08 03:45", "url": "https://www.wsls.com/news/world/2024/07/08/sister-of-north-korean-leader-kim-calls-south-koreas-live-fire-drills-suicidal-hysteria/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "FILE - Kim Yo Jong attends a wreath-laying ceremony at Ho Chi Minh Mausoleum in Hanoi, Vietnam, March 2, 2019.\nThe powerful sister of North Korean leader Kim Jong Un called South Koreas recent front-line live-fire drills suicidal hysteria as she threatened unspecified military steps Monday, July 8, 2024, if further provoked.\n(Jorge Silva/Pool Photo via AP, File)SEOUL – The powerful sister of North Korean leader Kim Jong Un called South Korea’s recent front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps Monday if further provoked.\nThe warning by Kim Yo Jong came after South Korea resumed firing exercises near its tense land and sea borders with North Korea in the past two weeks.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.", "location": "NULL", "classification": "security", "score": 0.7158813348660237, "event_breakdown": "1. South Korea to resume firing exercises near its tense land and maritime borders with North Korea in the past two weeks."}, {"id": "3e566089-e481-4436-9f0a-cb2f301ad3e6", "title": "IDF to Stay in Philadelphi Corridor", "date": "2024-07-08 00:00", "url": "https://www.algemeiner.com/2024/07/07/idf-to-stay-in-philadelphi-corridor/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Richard Goldberg, senior adviser at the Washington-based Foundation for Defense of Democracies, told JNS, “History would repeat itself the minute the IDF abandons the Philadelphi Corridor, with Hamas rebuilding its smuggling operations.\nBy maintaining a presence in this corridor, the IDF aims to ensure that Hamas is unable to rebuild its terror capabilities.\nSecuring the Philadelphi Corridor ensures that Hamas remains isolated from its external sources of weapons and materials, which are crucial for its military operations.\nThe IDF is also continually expanding a “sterile zone” around the Corridor, as part of its ongoing counter-tunnel and terror infrastructure destruction operations, Israel’s Channel 12 reported on June 30.\nThe IDF’s continued presence in the Philadelphi Corridor ensures that Israel retains control over a critical aspect of its national security, without relying on external actors.", "location": "The Philadelphi Corridor.", "classification": "security", "score": 0.7328460666234482, "event_breakdown": "IDF Maintains Presence in Philadelphi Corridor\nIDF Continues to Expand ‘Sterile Zone’ Around Philadelphi Corridor\nIDF Continues Presence in Philadelphi Corridor to Ensure Security"}, {"id": "3b585262-7edf-40f1-a4e4-563fadc5c9b6", "title": "Israeli Protesters Block Highways", "date": "2024-07-08 09:15", "url": "https://www.deccanchronicle.com/world/asia/israeli-protesters-block-highways-1809003", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Tel Aviv: Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a cease-fire that could bring back the hostages held by Hamas.\nNear the border with Gaza, Israeli protestors released 1,500 black and yellow balloons to symbolize those who were killed and abducted.\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nMeanwhile, fighting in Gaza continued, with nine Palestinians reported dead from Israeli strikes overnight and into the early hours of Sunday.\nThe Israeli military said they were targeting Hamas militants and had taken numerous steps to reduce civilian casualties.", "location": "Tel Aviv", "classification": "security", "score": 0.920166718587597, "event_breakdown": "Tel Aviv, Israel"}, {"id": "9af3a50e-0d6b-44fa-9302-2b928db6cc09", "title": "Senior Hamas official killed as Israel orders fresh evacuation", "date": "2024-07-08 05:45", "url": "https://saudigazette.com.sa/article/644084/World/Mena/Senior-Hamas-official-killed-as-Israel-orders-fresh-evacuation", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "GAZA — A senior Hamas administration official was among four people killed in an Israeli air strike at a school in Gaza City, Palestinian sources say.\nA local official told the BBC that Ehab Al-Ghussein was appointed to manage the affairs of the Hamas government in Gaza City and northern Gaza three months ago.\nEyewitnesses say the attack targeted the Holy Family School next to the Holy Family Church to the west of Gaza city.\nSeparately the Israeli military issued another evacuation order for a central part of Gaza City.\nAt least 38,098 Palestinians have been killed in Gaza as a result of Israel's offensive, according to the territory's Hamas-run health ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9438562446390654, "event_breakdown": "Ehab Al-Ghussein, a senior Hamas administration official, was killed in an Israeli air strike at a school in Gaza City on Monday, according to witnesses. The attack targeted the military wing of the Islamic Jihad movement that was in Al-Ghoussein."}, {"id": "cc5e9f0c-c4e2-49ab-871e-be9812d6071f", "title": "Explosion rocks Mykolaiv during air - raid warning because of ballistic missile threat", "date": "2024-07-08 07:30", "url": "https://www.yahoo.com/news/explosion-rocks-mykolaiv-during-air-212311155.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Explosion rocks Mykolaiv during air-raid warning because of ballistic missile threatSmoke after an explosion.\nStock photo: Open sourcesAn explosion occurred in the city of Mykolaiv on the night of 7-8 July.\nSource: Ukraine’s Air Force; Suspilne, a Ukrainian public broadcasterDetails: The explosion occurred after the military warned of a threat of ballistic missile attacks from the south.\nAn air-raid warning was issued in Ukraine’s southern oblasts.\nSupport UP or become our patron!", "location": "Mykolaiv", "classification": "security", "score": 0.9399497612426089, "event_breakdown": "Reported 7/7/22\nThe following oped locations had security incidents:\nLocation Date Description\nMykolayiv 7/7/22 An explosion occurred in the city of Mykolaiv. The blast occurred after the military warned of a threat of ballistic missile attacks from the south."}, {"id": "0063d6de-b46d-480c-b81b-96987f20e5f7", "title": "Hamas signals shift on key Gaza truce demand", "date": "2024-07-08 07:15", "url": "https://dunyanews.tv/en/World/822940-Hamas-signals-shift-on-key-Gaza-truce-demand", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hamas signals shift on key Gaza truce demandWorld World Hamas signals shift on key Gaza truce demandIsrael has repeatedly rejected demands for a permanent ceasefire.\n\"Hamas had previously required that Israel agree to a complete and permanent ceasefire,\" the top official told AFP as the war entered its 10th month.\nThe Israeli military said that in Shujaiya, its troops killed \"several\" militants and dismantled militant infrastructure.\nAnother strike Sunday on a church-run school in Gaza City killed at least four people, said the civil defence agency.\nSince the Gaza war began, Israeli forces and Hezbollah have exchanged almost daily cross-border fire, with attacks and rhetoric escalating in recent weeks.", "location": "GAZA CITY", "classification": "security", "score": 0.8113636338992808, "event_breakdown": "Location: Gaza Strip\nTarget Event: Israeli Troops Attack Church in Shujaiya\nOther recent events:\n- Israeli airstrikes on a church-run-school in Gaza City killed at least four people\n- Israeli forces and Hezbollah have exchanged almost daily cross-border fire\n- Israeli forces killed \"several\" militants in Shujaiya"}, {"id": "d393b232-ecc1-4155-b5aa-9fe7b904b484", "title": "Israeli airstrike kills senior Hamas official in northern Gaza", "date": "2024-07-08 05:45", "url": "http://www.uniindia.com/israeli-airstrike-kills-senior-hamas-official-in-northern-gaza/world/news/3235604.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Israeli airstrike kills senior Hamas official in northern GazaGaza, July 7 (UNI) Ehab al-Ghussein, undersecretary of the Hamas-run Ministry of Labor, was killed in an Israeli airstrike on the west of Gaza City on Sunday, said Palestinian sources.\nIsraeli forces targeted a house west of the city in the northern Gaza Strip, killing four Palestinians, including the senior official, Palestinian security sources told Xinhua.\nThe wife and daughters of Ghussein were killed in a previous Israeli attack in Gaza.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 were taken hostage.\nThe Israeli attacks have so far killed 38,153 Palestinians and injured 87,828 others in the strip, said the Gaza-based health authorities in an update earlier in the day.", "location": "GAZA", "classification": "security", "score": 0.9825276402130344, "event_breakdown": "Ehab al-Ghussein, undersecretary of the Hamas-run Ministry of Labor, was killed in an Israeli airstrike on western Gaza City on Sunday. Israeli forces targeted a house west of the city in the northern Gaza Strip, killing four Palestinians, officials said. Israel launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7."}, {"id": "d5dc2eec-0111-4921-9596-07c3f106de0d", "title": "American severely injured in a Hezbollah strike", "date": "2024-07-08 07:15", "url": "https://www.albawaba.com/news/american-severely-injured-hezbollah-1576053", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - According to medical reports, an American citizen is in deteriorating condition after being severely injured by Hezbollah missiles fired toward Israeli sites.\n🇱🇧 🇺🇸 🇮🇱 🚨 A 31-year-old American citizen who was severely injured today in Zarit, as a result of a missile launch from Lebanon, has come to light to be an employee of an American company that sold or donated accessories to reserve soldiers.\nCiting US sources, the American news website Axios said that one of the country's citizens had been injured in the strikes.\nIn response, Israeli armed forces announced targeting Hamas positions inside the Gaza Strip.\nThousands were killed, and dozens of thousands of others were injured in the Israeli attacks on the Gaza Strip.", "location": "LEBANON", "classification": "security", "score": 0.9802061347553807, "event_breakdown": "- On August 6, 2021, an American citizen was wounded in Zarit, Lebanon, as a result of a missile launch from Lebanon.\n- Israel retaliated by launching airstrikes on the Gaza Strip."}, {"id": "00bf57a8-9f1e-4446-a8fd-b5cc0de04633", "title": "Israeli Airstrikes in Gaza Kill and Injure Dozens", "date": "2024-07-08 07:15", "url": "https://english.almanar.com.lb/2147389", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Last night, Israeli occupation airstrikes resulted in the deaths and injuries of several Palestinians in Gaza, particularly in the al-Daraj and al-Tuffah neighborhoods and the old town.\nThe intense bombing by the Israeli air force shook communities in the northern part of the Gaza Strip.\n10 Palestinians killed in an lsraeli airstrike on a residential block in Jabaliya refugee camp, Northern Gaza.\npic.twitter.com/tJ0oYQwQOl — TIMES OF GAZA (@Timesofgaza) July 7, 2024According to medical sources, the airstrikes have left dozens dead and injured, adding to the already devastating toll of 38,153 killed and 87,828 injured during 275 days of Israeli aggression in Gaza.\nThousands of Palestinian families are fleeing their homes in Gaza City amid relentless Israeli occupation bombardment and the threat of imminent invasion.", "location": "GAZA CITY", "classification": "security", "score": 0.9795891763596192, "event_breakdown": "Israeli occupation airstrikes kill 10 Palestinians in Jabaliya refugee camp, Northern Gaza."}, {"id": "8b3568e7-270b-45d0-93bc-ad05aad8f783", "title": "USS Eisenhower vs . Houthis – mouse against an elephant ? - Opinion", "date": "2024-07-08 05:30", "url": "https://www.dailymirror.lk/plus/USS-Eisenhower-vs-Houthis-mouse-against-an-elephant/352-286629", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "All their attacks on Red Sea shipping originate from land bases.\nThe Houthis (Iran-backed Ansar-Allah movement) fighting the government of Yemen control large coastal areas bordering the Red Sea.\nThey said attacks on Red Sea shipping were in retaliation to the Israeli bombardment of the Gaza Strip, and related Western support for Israel.\nIt has been forced to send the nuclear-powered Eisenhower, the world’s third-largest aircraft carrier ith 90 aircraft, to the region.\nBut the lesson of just how vulnerable an aircraft carrier has been displayed vividly by a rebel group in Yemen.", "location": "The main location where the main event takes place is the Red Sea. It is a body of water that lies between Africa and Asia, connecting", "classification": "security", "score": 0.6869119038723327, "event_breakdown": "Ansar Allah (Houthis) in Yemen have targeted the Red Sea shipping originating from land bases, causing international problems. The US government was forced to deploy the nuclear-powered aircraft carrier Eisenhower to the Red Sea in response to an increased threat to shipping from the Houthis. The Gulf of Aden joins the Red Sea and the Indian Ocean, a significant passage for oil tankers."}, {"id": "b627cc28-22f4-4ee1-934d-49a491d0f6d3", "title": "Protesters take to the streets , demand end to Gaza war and Netanyahu  resignation", "date": "2024-07-08 06:00", "url": "https://www.firstpost.com/world/protesters-take-to-the-streets-demand-end-to-gaza-war-and-netanyahus-resignation-13790467.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The demonstrations come as long-running efforts to broker a truce gained momentum last week when Hamas dropped a key demand for an Israeli commitment to end the war.\nNear the border with Gaza, Israeli protestors released 1,500 black and yellow balloons to symbolize those fellow citizens who were killed and abducted.\nOn Sunday, Israel issued new evacuation orders for parts of Gaza City, which was heavily bombed and largely emptied early in the war.\nHezbollah began launching rocket and mortar attacks after the outbreak of the war in Gaza.\nHezbollah has said it will halt its attacks if there is a cease-fire in Gaza.", "location": "GAZA", "classification": "security", "score": 0.855368717584572, "event_breakdown": "Israeli protestors released 1,500 black and yellow balloons near the border with Gaza."}, {"id": "606672b4-db1c-42cd-a43f-dfe989bb14e8", "title": "Protesters block highways , call for ceasefire to return hostages", "date": "2024-07-08 06:00", "url": "https://jamaica-gleaner.com/article/world-news/20240708/protesters-block-highways-call-ceasefire-return-hostages", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Tel aviv (AP):Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country on Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a ceasefire to bring back scores of hostages held by Hamas.\nThe militant group is still seeking a permanent ceasefire, while Netanyahu has vowed to keep fighting until Hamas is destroyed.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolise those fellow citizens who were killed and abducted.\nShe added: “It’s nine months today, to this black day, and still nobody in our government takes responsibility.”About 120 hostages remain captive after more than 100 hostages were released as part of a November ceasefire deal.\nThe United States has rallied the world behind a proposal for a phased ceasefire in which Hamas would release the remaining captives in return for a lasting ceasefire and the withdrawal of Israeli forces from Gaza.", "location": "GAZA", "classification": "security", "score": 0.6462331172743058, "event_breakdown": "Tel Aviv: Protesters blocked highways across country, call on Netanyahu resign seek ceasefire (AP)"}, {"id": "bd8a1979-f03f-4f80-aabf-02652372020e", "title": "Drone triggers warehouse explosions in Russia as war of attrition grinds on", "date": "2024-07-08 06:00", "url": "https://jamaica-gleaner.com/article/world-news/20240708/drone-triggers-warehouse-explosions-russia-war-attrition-grinds", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Kyiv (AP):A village in a border region of western Russia was evacuated on Sunday following a series of explosions after debris from a downed Ukrainian drone set fire to a nearby warehouse, local officials said.\nSocial media footage appeared to show rising clouds of black smoke in the Voronezh region, while loud explosions could be heard in succession.\nNo casualties were reported, but residents of a nearby village in the Podgorensky district were evacuated, he said.\nRussian emergency services had reported that falling drone debris had started a fire at the site, which was successfully extinguished on Sunday morning.\nRussia’s Ministry of Defence did not address either strike in their morning briefing, but said that air defence systems had destroyed a Ukrainian drone over the Belgorod region.", "location": "Voronezh", "classification": "security", "score": 0.6498432023660883, "event_breakdown": "Voronezh, Russia\nA village in the Voronezh region was evacuated on Sunday following a series of explosions after debris from a downed Ukrainian Drone set fire to a nearby warehouse. No casualties were reported but residents of a nearby village were evacuated."}, {"id": "43865624-a4d7-400e-8936-046f4e820209", "title": "New evidence of historical Japanese germ - warfare unit unveiled _ Guangming Online", "date": "2024-07-08 07:15", "url": "https://en.gmw.cn/2024-07/08/content_37426935.htm", "domain": "en.gmw.cn", "domain_classification": "Unknown", "message": "Jin Shicheng, a researcher with the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army, displays a photocopy of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, in Harbin, northeast China's Heilongjiang Province, July 5, 2024.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.", "location": "Harbin, northeast China's Heilongjiang Province.", "classification": "security", "score": 0.6401716466559364, "event_breakdown": "1. On Saturday, 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province.\n2. Jin Shicheng, a researcher with the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army, displayed the photocopies of the Japanese military personnel registration forms."}, {"id": "6b0ff339-66aa-4ca7-a9b4-d0c6c5f67a3f", "title": "New evidence of historical Japanese germ - warfare unit unveiled _ Guangming Online", "date": "2024-07-08 07:15", "url": "https://en.gmw.cn/2024-07/08/content_37426815.htm", "domain": "en.gmw.cn", "domain_classification": "Unknown", "message": "Jin Shicheng, a researcher with the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army, displays a photocopy of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, in Harbin, northeast China's Heilongjiang Province, July 5, 2024.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.\nA total of 177 pages of Japanese military personnel registration forms detailing their work in Unit 731, a Japanese germ-warfare unit during World War II, were made public in Harbin, the capital of northeast China's Heilongjiang Province, on Saturday.", "location": "Harbin, Heilongjiang Province, China", "classification": "security", "score": 0.6401716466559364, "event_breakdown": "Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army made available to the public.\nHarbin, northeast China's Heilongjiang Province."}, {"id": "b4aa512b-ef70-4ebb-957d-001ae985fd36", "title": "HOTD Season 2 : Breaking Down the Battle at Rook Rest", "date": "2024-07-08 05:00", "url": "https://www.slashfilm.com/1614581/house-of-the-dragon-season-2-battle-at-rooks-rest-explained/", "domain": "slashfilm.com", "domain_classification": "Unknown", "message": "House Of The Dragon's First Giant Battle Scene Is A Brutal, Harrowing AffairThis post contains spoilers for \"House of the Dragon\" and its source material.\n\"There are those who have mistaken my caution for weakness,\" she states in the latest episode, right before dispatching her men to aid the residents of Rook's Rest.\nThis trap sprung by Team Green seems innocuous at first, as Rook's Rest is geographically close to the volcanic island of Dragonstone, risking exposure to the dragons controlled by Rhaenyra and her allies.\nHowever, Cole's aggressive strategy unfolds with brutal precision, leading to burnt troops and violent bloodshed in broad daylight.\nEpisode 4 brings the Battle at Rook's Rest to life in excruciating detail, marking the event with pathos and unexpected betrayal.", "location": "NULL.", "classification": "security", "score": 0.49844071269973933, "event_breakdown": "House of the Dragons first giant battle scene is a brutal, harrowing affair as Team Red gains an upper hand against Team Green."}, {"id": "02db8a44-503d-4908-9c9f-9bd96f35a8a3", "title": "North Korea : Sister of North Korean leader calls South Korea live - fire drills  suicidal hysteria  ", "date": "2024-07-08 05:00", "url": "https://www.9news.com.au/world/north-korean-leader-kim-sister-calls-south-koreas-livefire-drills-suicidal-hysteria/bebf7e0f-26ff-4737-a618-e0822a515802", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The powerful sister of North Korean leader Kim Jong-un called South Korea’s recent front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps on Monday if further provoked.\nThe warning by Kim Yo Jong came after South Korea performed firing exercises in its tense land and sea borders with North Korea in the past two weeks.\nThe powerful sister of North Korean leader Kim Jong Un called South Koreas recent front-line live-fire drills suicidal hysteria as she threatened unspecified military steps.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.\nNorth Korean leaders Kim Jong-un (AP)North Korea has been engaged in a provocative run of weapons tests since 2022.", "location": "Korean Peninsula", "classification": "security", "score": 0.7073994531517673, "event_breakdown": "North Korean threatens to conduct unspecified military steps if provoked more as Kim Yo Jong calls South Korea's recent front-line live-fire drills suicidal hysteria."}, {"id": "ce911868-d1ff-425f-a45b-68070447f7cb", "title": "Sister of North Korean leader Kim calls South Korea live - fire drills  suicidal hysteria  ", "date": "2024-07-08 05:45", "url": "https://www.local10.com/news/world/2024/07/08/sister-of-north-korean-leader-kim-calls-south-koreas-live-fire-drills-suicidal-hysteria/", "domain": "local10.com", "domain_classification": "Unknown", "message": "FILE - Kim Yo Jong attends a wreath-laying ceremony at Ho Chi Minh Mausoleum in Hanoi, Vietnam, March 2, 2019.\nThe powerful sister of North Korean leader Kim Jong Un called South Koreas recent front-line live-fire drills suicidal hysteria as she threatened unspecified military steps Monday, July 8, 2024, if further provoked.\n(Jorge Silva/Pool Photo via AP, File)SEOUL – The powerful sister of North Korean leader Kim Jong Un called South Korea’s recent front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps Monday if further provoked.\nThe warning by Kim Yo Jong came after South Korea resumed firing exercises near its tense land and sea borders with North Korea in the past two weeks.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.", "location": ")\nSOUTH KOREA", "classification": "security", "score": 0.7158813348660237, "event_breakdown": "Live-fire exercises by South Korea near land and sea borders with North Korea by order of South Korea’s conservative government to escape domestic political crisis."}, {"id": "eab19a8d-d80d-42c9-abb7-8292d5c12447", "title": "House of the Dragon Recap With Spoilers :  A Dance of Dragons  ", "date": "2024-07-08 05:15", "url": "https://comicbook.com/tv-shows/news/house-of-the-dragon-recap-spoilers-season-2-episode-4-dance-of-dragons/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "The Targaryen civil war rages on in Sunday's latest edition of House of the Dragon, as the battles continue to claim substantial losses.\nWARNING: This article contains MAJOR SPOILERS for House of the Dragon Season 2!\nRhaenys & Corlys and Aegon & Aemond(Photo: Eve Best as Rhaenys and Steve Toussaint as Corlys in House of the Dragon - HBO)For better and for worse, this is Rhaenys' episode.\nIt also sees Rhaenys tell her husband that Alyn deserves to be given a more prominent position than he has, especially since he saved Corlys' life.\nHe puts the sword away and Cole sees Aegon laying beside the dragon, burnt and potentially dead.", "location": "As the main focus of the event is centered around the Targaryen civil war, the exact name of the location is \"Dragonstone", "classification": "security", "score": 0.45152818734157013, "event_breakdown": "Target event - The ongoing civil war in the fictional world of Westeros from the House of the Dragon TV show.\nRhaenys and Aegon, who are both fighting for the Targaryen dynasty, have engaged in a massive battle between one another, and it appears that one of the characters may have been killed."}, {"id": "dfc82fcd-fbb1-48af-8b45-6aa7bb6fd7d5", "title": "Is an Israel - Lebanon War Going to Happen : How Did We Get There ? - Australian Institute of International Affairs", "date": "2024-07-08 06:45", "url": "https://www.internationalaffairs.org.au/australianoutlook/is-an-israel-lebanon-war-going-to-happen-how-did-we-get-there/", "domain": "internationalaffairs.org.au", "domain_classification": "Unknown", "message": "The Israeli Defense Forces (IDF) have incurred 18 fatalities, and 7 Israeli citizens have died.\nAfter Israel’s victory in the 1948 war, Lebanon became home to 110,000 displaced Arabs who had previously lived in the Palestinian Mandate.\nIn 2006, a complex, cross-border attack on IDF forces in Northern Israel prompted the Second Lebanon War.\nThey need to know how the Third Lebanon War ends: it needs to end with the defeat of Hezbollah, unlike in 2006.\nThe Third Lebanon War must be not only surgical and precise, and with a clearly defined vision of victory, but also supported by an international information campaign of support.", "location": "Lebanon", "classification": "security", "score": 0.8443289427704105, "event_breakdown": "IDF forces inflict heavy casualties on Hezbollah militants, leading to a ceasefire agreement."}, {"id": "ffb2e5d3-6da4-4c5a-84cb-5ca8862ce157", "title": "Russia loses another 1 , 200 soldiers and 40 armoured combat vehicles over past day", "date": "2024-07-08 07:30", "url": "https://www.yahoo.com/news/russia-loses-another-1-200-041600234.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 1,200 soldiers and 40 armoured combat vehicles over past dayUkrainian soldiers.\nPhoto: General Staff of the Armed Forces of Ukraine on FacebookRussian forces have lost 1,200 soldiers killed and wounded, as well as 16 tanks and 40 armoured combat vehicles, over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 8 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 552,190 (+1,200) people;8,171 (+16) tanks;15,685 (+40) armoured combat vehicles;14,966 (+29) artillery systems;1,115 (+0) multiple-launch rocket systems;880 (+1) air defence systems;361 (+1) fixed-wing aircraft;326 (+0) helicopters;11,893 (+31) operational-tactical UAVs;2,353 (+1) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;20,150 (+47) vehicles and tankers;2,503 (+8) special vehicles and other equipment.\nThe information is being confirmed.", "location": "Ukraine", "classification": "security", "score": 0.9359127673099361, "event_breakdown": "Russia has reportedly lost 1,200 soldiers killed and wounded, as well as 16 tanks and 40 armoured combat vehicles, over the past 24 hours. Ukraine has released information about the war Facebook page."}, {"id": "6e300e11-00a6-47ec-92f2-130c20919851", "title": "Israeli army used Hannibal Directive during October 7 Hamas attack : Report", "date": "2024-07-08 00:00", "url": "https://www.aljazeera.com/news/2024/7/7/israeli-army-used-hannibal-directive-during-october-7-hamas-attack-report", "domain": "aljazeera.com", "domain_classification": "International", "message": "The Israeli army ordered the Hannibal Directive – a controversial Israeli military policy aimed at preventing the capture of Israeli soldiers by enemy forces at any cost – on October 7 last year, an investigation by the Israeli newspaper Haaretz has revealed.\n“At this point, the [Israeli army] was not aware of the extent of kidnapping along the Gaza border, but it did know that many people were involved.\nBut many of those captured were civilians and not soldiers, to whom the Hannibal Directive does not apply.\nDozens of Palestinians were killed in the Israeli bombardment that followed, sparking accusations of war crimes against the Israeli army.\nAccording to Haaretz’s investigation, a senior Israeli army source also confirmed the Hannibal procedure was “employed on October 7”.", "location": "GAZA", "classification": "security", "score": 0.8829161188383957, "event_breakdown": "On October 7, the Israeli army ordered the Hannibal Directive, a controversial policy that forbids the capture of Israeli soldiers by enemy forces at any cost. Haaretz confirmed this through a senior Israeli army source."}, {"id": "8368d0a8-5a7e-4b93-9490-8f6aca0e4e6d", "title": "  House of the Dragon  Season 2 , episode 4 recap : It best to just be nice to your siblings", "date": "2024-07-08 07:30", "url": "https://ktvz.com/entertainment/cnn-entertainment/2024/07/07/house-of-the-dragon-season-2-episode-4-recap-its-best-to-just-be-nice-to-your-siblings/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "King Aegon finds out about Daemon claiming Harrenhal, and he’s mad.\nNot part of the plan, however, is King Aegon flying in on Sunfyre, which causes Criston to momentarily panic.\nKing Aegon is just trying to hang on when Aemond swoops in and fires off a “dracarys,” seemingly aimed in Aegon’s direction.\n• Rattled by her meeting with Rhaenyra, Alicent questions whether King Viserys truly wanted King Aegon to succeed him.\nAemond’s betrayal of King Aegon here seemed deliberate, as opposed to simply opportunistic.", "location": "King's Landing", "classification": "security", "score": 0.4842183782875957, "event_breakdown": "1. Harrenhal: Daemon Targaryen flies a dragon over the fortress claiming it for the black dragon and green forces\n2. King's Landing: King Aegon flies his dragon, Sunfyre, to confront Daemon and reclaim Harrenhal for the Targaryen cause"}, {"id": "4d68c624-6e33-4420-a58b-b7c38665c4ba", "title": "Japan and the Philippines sign a defense pact in the face of shared alarm over China", "date": "2024-07-08 07:00", "url": "https://economictimes.indiatimes.com/news/defence/japan-and-the-philippines-sign-a-defense-pact-in-the-face-of-shared-alarm-over-china/articleshow/111569667.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "I cannot determine a specific location from the text provided.", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "```\nInfoSphere: Security incidents reported in the last week\n\nDate: 2023/06/06\nLocation: Paris, France\nEvent: Protest against nuclear power\n\nDate: 2023/06/07\nLocation: Islamabad, Pakistan\nEvent: Terror attack at political rally\n\nDate: 2023/06/08\nLocation: Washington DC, USA\nEvent: Shooting at US Capitol\n\nDate: 2023/06/09\nLocation: Kabul, Afghanistan\nEvent: Suicide bombing at market\n\nDate: 2023/06/10\nLocation: Mogadishu, Somalia\nEvent: Suicide bombing at airport\n\n```\nIn English.\nFoul language"}, {"id": "a932ff7a-54ed-4948-b43a-d4ec6127967c", "title": "UK Defence Secretary John Healey flees missile attack on Ukraine visit as he rushes to bomb shelter - World News", "date": "2024-07-08 00:00", "url": "https://www.mirror.co.uk/news/world-news/uk-defence-secretary-john-healey-33189554", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "John Healey also instructed officials to ensure that the military aid package promised in April is expedited and delivered to Ukraine in full within the next 100 days.\nBritain's new Defence Secretary John Healey was forced to take cover in a bomb shelter during his first official visit to Odesa, Ukraine this weekend.\nDespite the missile strikes nearby, Mr Healey remained calm and insisted talks continued in the basement.\nMr Healey’s predecessor Grant Shapps aborted a visit to Odesa in March over fears Russian spies knew about his plans.\nMr Shapps claimed Vladimir Putin had come “perilously close to essentially assassinating two western leaders”, as Greece’s PM Kyriakos Mitsotakis was meeting Mr Zelensky at the time.", "location": "ODESA", "classification": "security", "score": 0.5370489594488758, "event_breakdown": "Event 1: John Healey, the newly appointed British Defence Secretary, was forced to take cover in a bomb shelter during his first official visit to Odesa, Ukraine over the weekend.\nEvent 2: Missile strikes occurred nearby. Despite the strikes, talks continued in the basement."}, {"id": "67bf035e-b9fe-414d-9a07-8ee72dfa6cb1", "title": "Russian daytime missile barrage on Ukraine including Kyiv children hospital leaves at least 20 dead", "date": "2024-07-08 11:30", "url": "https://nypost.com/2024/07/08/world-news/russian-daytime-missile-barrage-on-ukraine-including-kyiv-childrens-hospital-leaves-at-least-20-dead/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "10 Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday.\nGetty Images“The whole world must act as decisively as it can to put an end to Russian air strikes.\nThe Russian Defence Ministry said its forces had carried out strikes on defence industry targets and aviation bases in Ukraine.\n10 Patients look on near Ohmatdyt Children’s Hospital that was damaged during Russian missile strikes.\n10 A woman stands next to patients near Ohmatdyt Children’s Hospital that was damaged during Russian missile strikes.", "location": "KYIV", "classification": "security", "score": 0.4554705862098042, "event_breakdown": "Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday."}, {"id": "faac3081-6193-4cf9-bb82-0cb69ef9bfe7", "title": "Kyiv children hospital hit as Russian missile attack kills at least 29 in Ukraine | Ukraine", "date": "2024-07-08 14:15", "url": "https://www.theguardian.com/world/article/2024/jul/08/rescuers-search-rubble-of-kyiv-childrens-hospital-after-russian-missile-attack-in-ukraine", "domain": "theguardian.com", "domain_classification": "International", "message": "An unknown number of people have been trapped under rubble after Ukraine’s largest children’s hospital was hit during a daylight Russian missile barrage that the authorities said had killed at least 29 people across the country.\nVolodomyr Zelenskiy vowed retaliation as he said Kyiv’s Okhmatdyt hospital, the main treatment centre in the country for children with cancer, had taken a direct missile hit.\nIhor Klymenko, the interior minister, said five people had been confirmed dead in the Kyiv hospital attack and at least four more had been injured.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said the Donetsk regional governor.\nThe Italian foreign minister, Antonio Tajani, wrote on X: “I am struck by the images of the bombings in Kyiv which also hit a children’s hospital.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.6516410097641177, "event_breakdown": "The following current events of security are found in the text:\n* An unknown number of people have been trapped under rubble after Ukraine’s largest children’s hospital was hit during a daylight Russian missile barrage.\n* At least five people have died in the Kyiv hospital attack and at least four more have been injured.\n* Another three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility."}, {"id": "9ef2c670-1d56-4a63-82fd-a7488470d315", "title": "Hezbollah official killed in Israeli airstrike in southern Lebanon - Xinhua", "date": "2024-07-08 13:00", "url": "https://english.news.cn/20240708/d84f69b8f53d48b2b7d38e059d565409/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 8 (Xinhua) -- A Hezbollah official was killed and another individual wounded early Monday in an Israeli airstrike targeting a car and motorcycle in southern Lebanon, according to Lebanese military sources.\nIdentified as Mustafa Hassan Salman, the motorcyclist is a local military official within Hezbollah responsible for operations in the western sector of the southern Lebanese border area, according to the sources.\nThe sources also detailed a separate attack, stating that \"an Israeli warplane fired two air-to-surface missiles at a farm on Jabal Toura, a mountain in the Jezzine district of southern Lebanon.\"\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon.\"\nMeanwhile, Hezbollah Secretary-General Hassan Nasrallah warned that no place in Israel \"will be safe\" from his party's missiles in the event of an outbreak of war.", "location": "BEIRUT", "classification": "security", "score": 0.9918488703283082, "event_breakdown": "BEIRUT, July 8 (Xinhua) -- A Hezbollah official was killed and another individual wounded early Monday in an Israeli airstrike targeting a car and motorcycle in southern Lebanon, according to Lebanese military sources."}, {"id": "fbfa3d03-0526-4a22-a028-1989ce0f0c74", "title": "Young Ukrainian family recalls horror of air strike on children hospital", "date": "2024-07-08 13:30", "url": "https://www.yahoo.com/news/young-ukrainian-family-recalls-horror-122846950.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rescuers on Monday afternoon were still combing through the wreckage of the strike on Ukraine's largest children's hospital, hit in a barrage of missile strikes across the country that killed at least 29 people and wounded dozens.\nPresident Volodymyr Zelenskiy said Russia fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings.\nAfter the strike, hundreds of local residents flocked to the hospital offering water and assistance.\nOne woman stood crying outside the main gates, worried about a relative who had been inside.\nHolding her baby son, Kravchenko stood outside with her husband Volodymyr, staring at the destruction.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.7961763311301308, "event_breakdown": "1. Children's hospital damaged by bombardment by Russian forces is located in south-eastern Ukraine in Mariupol"}, {"id": "a1325834-9459-401c-b3d8-51f1913be6ec", "title": "Kyiv children hospital hit as wave of Russian attacks kill at least 29", "date": "2024-07-08 12:15", "url": "https://www.thenationalnews.com/news/europe/2024/07/08/kyiv-childrens-hospital-russia-missiles/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "Ukraine’s largest children’s hospital was partially destroyed in a Russian missile barrage that struck several cities across the country, killing at least 29 people and injuring almost 100.\nA large section of Okhmatdyt children’s hospital, in Kyiv, was reduced to rubble.\nRescuers work at Ohmatdyt, a children's hospital that was damaged during Russian missile strikes, amid the attack.\nRescue teams at work at Ohmatdyt children's hospital after it was damaged by Russian missiles.\nA woman holds a girl near the children's hospital in the aftermath of the missile strikes.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.8247838192184893, "event_breakdown": "The following current events of security were reported:\n- At least 29 people were killed and 100 injured after a Russian missile barrage struck several cities across Ukraine, including Kyiv, on Wednesday. Ukraine’s largest children's hospital, Okhmatdyt, was partially destroyed in the attack.\n- Rescuers worked at Ohmatdyt, a children's hospital in Kyiv, after the attack, and search for survivors in the rubble."}, {"id": "016b6ab2-546d-49dc-8349-7af0b8fccdc9", "title": "Ukraine intercepted 30 of 38 Russian missiles during mass attack , Air Force says", "date": "2024-07-08 13:00", "url": "https://www.yahoo.com/news/ukraine-intercepted-30-38-russian-121245227.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine intercepted 30 of 38 Russian missiles during mass attack, Air Force saysUkrainian forces downed 30 of the 38 Russian missiles launched during a large-scale attack against multiple cities on the morning of July 8, the Air Force said.\nIn total, Russian forces launched one Kinzhal ballistic missile, four Iskander-M ballistic missiles, one 3M22 Zirkon hypersonic cruise missile, 13 Kh-101 cruise missiles, 14 Kalibr cruise missiles, two Kh-22 cruise missiles, and three Kh-59/69 guided aerial missiles, according to the statement.\nKyiv, Dnipro, Kryvyi Rih, and other cities across Ukraine were hit, with at least 28 civilians killed and 112 injured as of 3 p.m. local time.\nThe strike took place on the eve of the NATO summit in Washington, where Ukraine hopes to receive long-term aid commitments from the allies.\nRead also: Explosions rock Kyiv, other cities in Russian Monday morning massive attackWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Kyiv", "classification": "security", "score": 0.7286377171275998, "event_breakdown": "Seven Russian cruise missiles were brought down by Ukrainian air defenses, while 23 were destroyed before hitting their intended targets, the Air Force said.\nAs a result, the military said that it claims to have prevented at least 850 pieces of Russian equipment and hundreds of soldiers from achieving criminal tasks.\nThe strike took place on the eve of the NATO summit in Washington, where Ukraine hopes to receive long-term aid commitments from the allies.\nAs a result of the strike, the military said that at least 850 pieces of Russian equipment and hundreds of soldiers failed to reach their intended targets."}, {"id": "350e505c-f1ca-44a2-b0ff-113fb28164d9", "title": "Russian missile attack on multiple cities kills 29 , hits children hospital", "date": "2024-07-08 12:15", "url": "https://www.independent.ie/world-news/europe/russian-missile-attack-on-multiple-cities-kills-29-hits-childrens-hospital/a636824093.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "latest | Russian missile attack on multiple cities kills 29, hits children's hospitalRussia missile attacks kill at least 29 across UkraineMissile hits children's hospital in capital Kyiv, officials sayUkraine's President Zelenskiy says more than 40 missiles firedMissiles damaged infrastructure, commercial and residential buildingsPeople walk near Ohmatdyt Children's Hospital that was damaged during Russian missile strikes, amid Russia's attack on Ukraine, in Kyiv, Ukraine July 8, 2024.\nREUTERS/Gleb GaranichOlena Harmash and Max Hunder Today at 13:52Russia rained missiles down on cities across Ukraine in broad daylight on Monday morning, killing at least 29 civilians and badly damaging Kyiv's main children's hospital in the deadliest air strike in months, officials said.", "location": "Ukraine", "classification": "security", "score": 0.6550022048066926, "event_breakdown": "Russia rains missiles down on multiple cities across Ukraine, killing at least 29 civilians, and badly damaging Kyiv's main children's hospital."}, {"id": "613e1bab-86fb-4bff-aa47-53fac56e4a0b", "title": "Ukraine Health Ministry announces fundraiser for Kyiv children hospital hit in Russian missile strike", "date": "2024-07-08 14:15", "url": "https://www.yahoo.com/news/ukraines-health-ministry-announces-fundraiser-110821395.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's Ministry of Health has launched a fundraising campaign for the Okhmatdyt National Children's Specialised Hospital, which was hit by a Russian missile on Monday 8 July.\nSource: Ukraine’s Ministry of Health on Telegram; Okhmatdyt Foundation; Mykhailo Shamanov, spokesman for the Kyiv City Military Administration, on the national 24/7 newscastDetails: This link allows you to transfer funds to the Okhmatdyt Foundation.\nHe also stated that the Children's Hospital is currently aware of two deaths and 15 injuries.\nBackground:On the morning of 8 July, Russian terrorists once again launched a massive missile attack on Ukraine, using more than 40 missiles of various types.\nThe Russians have launched a strike on the Okhmatdyt National Children's Specialised Hospital in Kyiv, injuring people.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7130421688666172, "event_breakdown": "Ukraine’s Ministry of Health has launched a fundraising campaign for the Okhmatdyt National Children's Specialised Hospital, which was hit by a Russian missile on Monday 8 July."}, {"id": "d25a9c74-b639-4cc2-bcca-716e3fa6a06e", "title": "20 killed in Russian attack across Ukrainian cities", "date": "2024-07-08 11:45", "url": "https://www.albawaba.com/news/20-killed-russian-attack-across-1576123", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - At least 20 people have been killed in massive Russian strikes on several Ukrainian cities, officials told the press.\nA strike in Kyiv killed 7 people in what counted as a rare daytime attack.\nKyiv mayor Vitali Klitschko stated that a children's hospital was also targeted during the Russian attacks.\n\"The children's hospital Okhmatdyt was damaged in the Shevchenkivsky district, there is destruction,\" the statement reads.\nOkhmatdyt Children's Hospital in Kyiv.", "location": "KYIV", "classification": "security", "score": 0.9024991333019166, "event_breakdown": "Map\nChildren's Hospital Okhmatdyt, Kyiv."}, {"id": "4048e021-373d-4763-9c89-fcd26954116e", "title": "Hezbollah , Inc . ", "date": "2024-07-08 07:00", "url": "https://townhall.com/columnists/alanjosephbauer/2024/07/08/hezbollah-inc-n2641495", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Hezbollah has always been a terror group in a class of its own.\nHezbollah for decades has not stopped talking about destroying the Zionist enemy, fighting the IDF, taking control of northern Israel, etc.\nHezbollah has claimed that it only knew of the attack after it started, something that is very hard to believe when Iran was involved in planning and financing the invasion, and both Hamas and Hezbollah are clients of Iran.\nSince the war began, Hezbollah has been firing rockets, suicide drones, and anti-tank missiles at Israeli targets.\nHezbollah, while dedicated to fighting Israel, has become a central political player in Lebanon and the Arab world.", "location": "Lebanon", "classification": "security", "score": 0.8453072959137328, "event_breakdown": "Hezbollah fires rockets on Israeli targets - Hezbollah fired rockets on Israeli targets in response to the ongoing Israeli assault on the Gaza Strip."}, {"id": "afc08d5e-aeba-45b0-8a0e-59d472eda94b", "title": "Hypersonic missiles rock Kyiv in  one of the worst attack as a children hospital reduced to rubble - London Business News", "date": "2024-07-08 11:45", "url": "https://londonlovesbusiness.com/hypersonic-missiles-rock-kyiv-in-one-of-the-worst-attacks-as-a-childrens-hospital-reduced-to-rubble/", "domain": "londonlovesbusiness.com", "domain_classification": "Unknown", "message": "On Monday morning Russia launched a “massive” hypersonic missile attack on Kyiv and a children’s hospital was struck killing many.\n‼️ A children’s medial facility!!\n#russiaisateroriststate https://t.co/Dqr4O19xbx pic.twitter.com/N3gt5IfGKJ — Їne Back Їversen (@IneBackIversen) July 8, 2024The Mayor of Kyiv Vitali Klitschko said, “This is one of the worst attacks.\nA Russian hypersonic missile struck Okhmatdyt children’s hospital, which is Ukraine’s largest children’s medial facility and people have been reported to be trapped “under the rubble.”Okhmatdyt Children's Hospital in Kyiv.\nApartment buildings, infrastructure, and a children’s hospital have been damaged.”The Ukrainian chief of staff Andriy Yermak accused Russia of “deliberately targeting” children.", "location": "Kyiv", "classification": "security", "score": 0.8123147549220193, "event_breakdown": "Russian forces have targeted a children's hospital in Kyiv, Ukraine, with a hypersonic missile, according to the CNN. The Mayor of the city, Vitali Klitschko, called the explosion caused by Russian forces, \"one of the most destructive\" in the city. At least 8 people are reported dead in the attack, which took place on Monday July 8, 2024."}, {"id": "f0b4c719-b8a1-4cf6-a97b-f9d49f314d41", "title": "Russia strikes Kyiv children hospital as Putin launches hypersonic missile attack on ... ", "date": "2024-07-08 11:30", "url": "https://www.lbc.co.uk/news/russia-launches-missile-attack-on-childrens-hospital-in-kyiv/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Russia strikes Kyiv children’s hospital as Putin launches hypersonic missile attack on multiple targets across UkraineRussian missiles struck multiple targets in Ukraine this morning including Ukraine's biggest children's hospital.\nPicture: Social MediaBy Asher McShaneA Russian missile barrage has devastated a children's hospital in Kyiv.\nListen to this article Loading audio...Russian missiles hit Okhmatdyt children's hospital, Ukraine's biggest children's medical facility.\nRussian terrorists have once again launched a massive missile attack on Ukraine.\nThe attack struck Okhmatdyt children's hospital in Kyiv, Ukraine's biggest children's medical facility.", "location": "KIEv.", "classification": "security", "score": 0.6810276007249506, "event_breakdown": "Title: Russian Missiles Strike Okhmatdyt Children's Hospital in Ukraine\n\nEvent: A Russian missile barrage has devastated a children's hospital in Kyiv, Ukraine's biggest children's medical facility.\n\nTime and Place: The attack struck Okhmatdyt children's hospital in Kyiv, Ukraine's biggest children's medical facility at 12:30 PM local time on June 5, 2022.\n\nAdditional Information: The attack coincides with Russia's announcement that it has fired a hypersonic ballistic missile at a military airfield in the Ukrainian city of Lviv, which is near the Polish border.\n\nImplications: The attack is part of a larger Russian offensive against Ukraine. It is the latest in a series of attacks targeting hospitals and schools, and has prompted international condemnation."}, {"id": "e9e0332a-4404-42d5-b9ef-de88d050e62a", "title": "Russian attack on Kyiv : 8 civilians killed , 15 more injured , people trapped under rubble", "date": "2024-07-08 10:30", "url": "https://www.yahoo.com/news/russian-attack-kyiv-8-civilians-085302029.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Two injured in Russian attack on Kyiv die at hospital, bringing death toll to 17 and number of injured to 66 – photosSeventeen people were killed and 41 more injured in a Russian missile attack on Kyiv on 8 July.\nLater, Ukraine's Interior Minister Ihor Klymenko reported that seven people had been killed in the Russian missile attack on Kyiv.\nLater, the Prosecutor General's Office reported that the death toll had risen to nine.\nAs of 14:00, the data of the Prosecutor General's Office indicated that the death toll has risen to 15.\nThe SES noted that the aftermath of the Russian attack on the capital is being dealt with.", "location": "KYIV", "classification": "security", "score": 0.9213229873206847, "event_breakdown": "Russian missile attack on Kyiv - 17 killed, 41 injured\nAftermath of the Russian attack on the capital being dealt with"}, {"id": "a7f74d55-d67a-4a16-8f66-9e9c9ee4f9c5", "title": "IDF Troops Kill 30 Terrorists In Rafah , Dozens In Shujaiya Operations", "date": "2024-07-08 11:00", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-troops-kill-30-terrorists-in-rafah-dozens-in-shujaiya-operations", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Israeli forces have killed more than 30 terrorists in the Rafah area and dozens of terrorists in Shujaiya in the past day, according to the Israel Defense Forces spokesperson's unit on Monday.\nThe 162nd Divison collaborated with the Air Force to eliminate more than 30 terrorists in Rafah.\nTwo launch sites ready to fire rockets into Israel were destroyed by air in the southern Khan Yunis and central Gaza City.\nIDF spokesperson's unitThe 98th Division operating in Shujaiya continued operations, eliminating dozens of terrorists posing a threat to Israeli forces with anti-tank rockets.\nIn one airstrike in southern Gaza, a Hamas sniper was killed after guidance from ground forces who identified him.", "location": "GAZA", "classification": "security", "score": 0.9928212870861249, "event_breakdown": "IDF: Israeli forces have killed more than 30 terrorists in the Rafah area and dozens of terrorists in Shujaiya in the past day."}, {"id": "65e6d0a5-1e2b-4590-9f21-e942f6c3d5c7", "title": "Debris falls on medical centre on Kyiv left bank , 7 people killed", "date": "2024-07-08 13:30", "url": "https://www.yahoo.com/news/debris-falls-medical-centre-kyivs-115155287.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debris from downed Russian air targets has fallen on a medical centre in the Dniprovskyi district in Kyiv, damaging the building and killing seven civilians.\nSource: Kyiv Mayor Vitali Klitschko; Serhii Popko, Head of Kyiv City Military Administration; the State Emergency Service on Telegram; Ukrainian Prosecutor General’s Office (PGO) on TelegramQuote from Klitschko: \"Debris fell on a medical centre in the Dniprovskyi district.\nDetails: Serhii Popko said four people had been killed and three injured in the Dniprovskyi district.\nUpdate: The PGO reported that seven people are known to have been killed and three injured in Kyiv's Dniprovskyi district as of 14:00.\nBackground:On the morning of 8 July, Ukraine's Air Force reported that Russia had scrambled Tu-95 bombers from the Olenya airfield.", "location": "Kyiv", "classification": "security", "score": 0.9579869543112536, "event_breakdown": "Debris from downed Russian air targets has fallen on a medical centre in the Dniprovskyi district in Kyiv, damaging the building and killing seven civilians. On 8 July, Ukraine's Air Force reported that Russia had scrambled Tu-95 bombers from the Olenya airfield."}, {"id": "dfaa4454-daf3-40be-b79e-a35750c4d0db", "title": "NO JEWS , NO PROTESTS : Russia Fires 40 Missiles ; One Hits Kyiv Children Hospital , Kills At Least 31 , Injures 130 – The Yeshiva World", "date": "2024-07-08 14:30", "url": "https://www.theyeshivaworld.com/news/general/2295363/no-jews-no-protests-russia-fires-40-missiles-one-hits-kyiv-childrens-hospital-kills-at-least-31-injures-130.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv", "classification": "security", "score": 0.8667358899533286, "event_breakdown": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\n\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\n\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\n\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.\n\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said."}, {"id": "54e058ed-cdd9-4d40-844f-6aed35b96d41", "title": "Ukraine war live : Kyiv children hospital hit as Russian daytime strikes on Ukraine kill 31", "date": "2024-07-08 14:15", "url": "https://www.bbc.com/news/live/c6p2zqlvqdgt", "domain": "bbc.com", "domain_classification": "International", "message": "'They are killing children and peaceful civilians' Kyla HerrmannsenReporting from KyivOlena works as a cleaner at Ohmatdyt Hospital and was inside the building when the explosion occurred.\nShe fell down onto her knees, trying to hide.\nAt first, she says she didn’t understand what was going on.\nThen she heard sirens and saw injured patients all around her.\n“Please, can someone stop this war because they are killing children and peaceful civilians”, Olena tells the BBC.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9095832415211008, "event_breakdown": "Kyla Herrmannsen is reporting about attacks in Kyiv, where Olena, a cleaner at Ohmatdyt Hospital, was inside the building when an explosion occurred. Olena fell down onto her knees, trying to hide. She says at first, she didn’t understand what was going on. Then she heard sirens and saw injured patients all around her."}, {"id": "25f3dac8-441d-4f83-b11e-940ddbc3864f", "title": "Russian missile strikes children hospital as 5 Ukrainian cities targeted in major attack", "date": "2024-07-08 13:30", "url": "https://www.adn.com/nation-world/2024/07/08/russian-missile-strikes-childrens-hospital-as-5-ukrainian-cities-targeted-in-major-attack/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Rescuers, volunteers and medical workers clean up the rubble and search victims after Russian missile hit oncology clinic, left, and dialysis clinic, right, of the country's main children hospital Okhmadit in Kyiv, Ukraine, Monday, July 8, 2024.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched rubble for casualties.\n(AP Photo/Efrem Lukatsky)KYIV, Ukraine — A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7011767507719378, "event_breakdown": "Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Monday, officials said, with one missile striking a large children&#039;s hospital in the capital, Kyiv, where emergency crews searched rubble for casualties."}, {"id": "ac84f23a-5c4f-4bc2-9e0a-f3b7bb11df22", "title": "At least 20 dead in Russian attack on Ukraine cities", "date": "2024-07-08 10:45", "url": "https://www.the-star.co.ke/news/world/2024-07-08-at-least-20-dead-in-russian-attack-on-ukraine-cities/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "At least 20 people have been killed after Russia launched a massive missile attack against cities across Ukraine, according to officials.\nIn the capital, Kyiv, at least seven people were killed in a rare daytime attack.\nThe city's mayor said a children's hospital was hit by the missile strike and was being evacuated.\nResidential buildings, infrastructure and a children's hospital were damaged,\" he said.\nPlumes of smoke could be seen across the capital Kyiv, while video posted on social media showed the destruction inside and outside of the Okhmadyt children's hospital.", "location": "KYIV", "classification": "security", "score": 0.46713437574041694, "event_breakdown": "At least 20 people have been killed after Russia launched a massive missile attack against cities across Ukraine, according to officials. In the capital, Kyiv, at least seven people were killed in a rare daytime attack. The city's mayor said a children's hospital was hit by the missile strike and was being evacuated. Residential buildings, infrastructure and a children's hospital were damaged,\" he said."}, {"id": "bffd7a60-8bc0-40b5-825b-d9322348d957", "title": "Ukrainian children hospital hit , 31 people killed in daytime Russian missile attack", "date": "2024-07-08 14:00", "url": "https://www.nbcchicago.com/news/business/money-report/ukrainian-childrens-hospital-hit-in-daytime-russian-missile-attack/3483315/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Russian forces launched more than 40 missiles across Ukraine, seriously damaging a children's hospital in Kyiv, Ukrainian officials said.\nA barrage of Russian missiles across Ukraine killed at least 31 people, injured 125 others and seriously damaged a key children's hospital in a rare large-scale daytime attack, Ukraine's Ministry of Internal Affairs said.\nThe Ukrainian capital's Okhmatdyt Children's Hospital undertook \"considerable destruction,\" with patients being transferred to other medical facilities in Kyiv.\n\"Okhmatdyt Children's Hospital in Kyiv.\nHe will meet with Russian President Vladimir Putin in an effort to strengthen ties as Russia remains secluded or outright sanctioned by international peers.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.7828729469578978, "event_breakdown": "Russian Forces launch missiles across Ukraine. The Okhmatdyt Children's Hospital in Kyiv is targeted and destroyed during a large-scale daytime attack. The attack kills 31 people and seriously Injures 125 people."}, {"id": "274dfa35-b89a-4135-a633-3aac9a679dad", "title": "Russia - Ukraine war : Russian forces launch hypersonic missiles against Ukrainian targets", "date": "2024-07-08 13:00", "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-33aecd50cf252ff6184c0c14f90588b5", "domain": "apnews.com", "domain_classification": "International", "message": "KYIV, Ukraine (AP) — A major Russian missile attack across Ukraine on Monday killed at least 31 people and injured 154, officials said, with one striking a large children’s hospital in the capital of Kyiv, where emergency crews searched the rubble for victims.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nZelenskyy said during a visit to Poland he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "location": "Kyiv", "classification": "security", "score": 0.7674843791169466, "event_breakdown": "Location: Russia\n> Russian shelling targeting a village near the northern city of Kharkiv killed at least one man and injured four, including a 10-year-old child, the military said late Monday. As night fell Monday, Russian forces' assault targeting Ukrainian infrastructure continued, with rockets hitting the eastern city of Kramatorsk."}, {"id": "f24fb039-b47d-4176-abb1-60d9bfa6780a", "title": "Ukrainian children hospital hit , 31 people killed in daytime Russian missile attack", "date": "2024-07-08 14:15", "url": "https://www.nbcmiami.com/news/business/money-report/ukrainian-childrens-hospital-hit-in-daytime-russian-missile-attack/3355785/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "Russian forces launched more than 40 missiles across Ukraine, seriously damaging a children's hospital in Kyiv, Ukrainian officials said.\nA barrage of Russian missiles across Ukraine killed at least 31 people, injured 125 others and seriously damaged a key children's hospital in a rare large-scale daytime attack, Ukraine's Ministry of Internal Affairs said.\nThe Ukrainian capital's Okhmatdyt Children's Hospital undertook \"considerable destruction,\" with patients being transferred to other medical facilities in Kyiv.\n\"Okhmatdyt Children's Hospital in Kyiv.\nHe will meet with Russian President Vladimir Putin in an effort to strengthen ties as Russia remains secluded or outright sanctioned by international peers.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.7828729469578978, "event_breakdown": "Russian missiles kill 31 in Ukraine, seriously damage children's hospital in Kyiv."}, {"id": "185688e5-4361-4aab-9dc4-3c2bb7ffb5b4", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 14:00", "url": "https://komonews.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "komonews.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children's hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack."}, {"id": "eb52a5bd-1b63-498e-802b-57ff8d4d7304", "title": "Israelis wounded in Hezbollah missile and drone attacks on Galilee", "date": "2024-07-08 07:30", "url": "https://www.5tjt.com/israelis-wounded-in-hezbollah-missile-and-drone-attacks-on-galilee/", "domain": "5tjt.com", "domain_classification": "Unknown", "message": "(July 7, 2024 / JNS)Three Israelis were wounded, including one seriously, on Sunday afternoon when a Hezbollah anti-tank missile fired from Lebanon scored a direct hit in the area of Moshav Zar’it in the Upper Galilee.\nThe Israel Defense Forces said in a statement, “Earlier today, two anti-tank missiles were detected that crossed [from] the territory of Lebanon into the Zar’it area.\n“Meitham led many of the unit’s activities and took part in the planning and carrying out of numerous terrorist attacks against Israelis.\nThe attack reportedly came in response to an IDF strike the previous day that killed top Hezbollah commander Muhammad Nimah Nasser.\nHezbollah leader Hassan Nasrallah has vowed to continue the attacks until a “complete and permanent ceasefire” is reached in Gaza.", "location": "Lebanon", "classification": "security", "score": 0.9602111074865978, "event_breakdown": "Security incidents can be identified and mapped using the following format:\n\n[Security incident]: [Description of the incident], [Time of incident], [Location], [What happened?], [Who is involved?], [What happened as a result?]\n\n1. Attack on an Israeli patrol near the Lebanese border:\nOn May 25th, 2024, during the escalation with Israel"}, {"id": "a8400f09-120e-4123-8b18-aa829b45d17c", "title": "Injured American citizen condition  worsening  after Hezbollah missiles fired toward Israel", "date": "2024-07-08 12:30", "url": "https://www.egyptindependent.com/injured-american-citizens-condition-worsening-after-hezbollah-missiles-fired-toward-israel/", "domain": "egyptindependent.com", "domain_classification": "Unknown", "message": "CNN —The condition of an American citizen injured Sunday after the Lebanese militant group Hezbollah fired missiles toward northern Israel is “worsening,” according to the medical center treating him.\nHezbollah fired dozens of projectiles and anti-tank missiles toward northern Israel on Sunday, according to the Israeli military.\nThe Israeli military said it had responded with strikes on Hezbollah military structures.\nHezbollah said in multiple statements on Sunday that it had fired rockets toward several Israeli military sites.\nThat comes after the Israeli military conducted an airstrike in northern Lebanon on Saturday that it said killed a senior Hezbollah operative.", "location": "Israel", "classification": "security", "score": 0.9306053070044661, "event_breakdown": "Israeli military claims to have struck multiple military sites belonging to Hezbollah in response to projectiles being fired toward northern Israel. The attack comes one day after the Israeli military killed a senior Hezbollah leader in an airstrike. There are no reported deaths at the moment."}, {"id": "8cf82fca-a5d9-4821-ab94-6af24a5d81bd", "title": "Russia attacks Ukraine biggest children hospital in Kyiv – photos", "date": "2024-07-08 11:30", "url": "https://www.pravda.com.ua/eng/news/2024/07/8/7464614/", "domain": "pravda.com.ua", "domain_classification": "Unknown", "message": "The Russians have launched a strike on the Okhmatdyt National Children's Specialised Hospital in Kyiv, injuring people.\nSource: Vitali Klitschko, the Mayor of Kyiv, on Telegram; Volodymyr Zhovnir, General Director of the Okhmatdyt Hospital, in a comment to Ukrainska PravdaQuote from Klitschko: \"There was a strike on a children's medical institution.\"\nphoto: Volodymyr zelenskyy in TELEGRAMAn Ukrainska Pravda source said there are casualties in the hospital.\nPresident Volodymyr Zelenskyy, who likely arrived in Warsaw on 8 July, stated that Kyiv's Okhmatdyt is one of the most important children's hospitals not only in Ukraine but also in Europe.\nphoto: bohdan kutiopov, upphoto: bohdan kutiopov, upphoto: bohdan kutiopov, upphoto: bohdan kutiopov, upphoto: bohdan kutiopov, upBackground:On the morning of 8 July, the Russians carried out another missile attack on the territory of Ukraine.", "location": ")\nKYIV, UKRAINE", "classification": "security", "score": 0.8539756551879875, "event_breakdown": "Title: Russian Strike on Okhmatdyt Children's Hospital in Kyiv Injures People\n\nEvent: Russians have carried out a strike on the Okhmatdyt National Children's Specialised Hospital in Kyiv, injuring people.\n\nDescription: Multiple sources have confirmed the missile strike, including Vitali Klitschko, the Mayor of Kyiv, and Volodymyr Zhovnir, General Director of the Okhmatdyt Hospital. Photos and videos from the hospital show damage, and Ukrainska Pravda, a Ukrainian news outlet, has reported that casualties have occurred. There has been no official statement from Russian authorities.\n\nLocation: Okhmatdyt Children's Hospital, Kyiv, Ukraine"}, {"id": "b53c5c8e-4cf2-42a7-87a8-c574ee0c45d9", "title": "Russian daytime attack on Ukraine kills at least 20 , hits children hospital in Kyiv", "date": "2024-07-08 11:00", "url": "https://www.thestandard.com.hk/breaking-news/section/6/218201/Russian-daytime-attack-on-Ukraine-kills-at-least-20,-hits-children", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "People shelter in a metro station during Russian missile strikes on Kyiv, amid Russia’s attack on Ukraine, in Kyiv, Ukraine, July 8, 2024.\n(Reuters)Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children's hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donetsk regional governor.", "location": "KYIV", "classification": "security", "score": 0.8439574130047326, "event_breakdown": "Russia fires barrage of missiles targeting Ukrainian cities with death tolls report of 20."}, {"id": "4d4438d7-b640-4d3c-a904-81b28d0dc3c0", "title": "Children hospital in Kyiv hit in rare Russian daytime missile barrage", "date": "2024-07-08 12:30", "url": "https://www.telegraph.co.uk/world-news/2024/07/08/kyiv-russia-missile-attack-childrens-hospital/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The main children’s hospital in Kyiv was struck in a Russian missile barrage, which killed at least 20 people across Ukraine.\nPresident Volodymyr Zelensky said Russian forces fired more than 40 long-range munitions, including the hypersonic Kinzhal, at different cities in a rare daytime raid.\nRescue workers were dispatched to Ohmatdyt Children’s Hospital amid reports that children were trapped in the wreckage of the building.\nParents holding bloodied babies, crying and dazed, were photographed trying to escape the carnage after the strike.\nYoung patients could be seen receiving treatment on the street as local authorities promised the missile attack would not disrupt services at the hospital.", "location": "Kyiv", "classification": "security", "score": 0.6612439802377238, "event_breakdown": "Event 1: Russian forces fired a barrage of missiles at the Ohmatdyt Children’s Hospital in Kyiv, Ukraine. The strike killed 20 people and injured many more. The Ukrainian president said children were still being treated in the hospital.\nEvent 2: The Russian army fired more than 40 long-range munitions at different angles in a rare daytime raid on Monday, including hypersonic Kinzhal missiles. The government says that the strike hit different cities, including Mariupol and several other locations."}, {"id": "d8919583-5767-469f-a925-81c9ee6d12b3", "title": "Hamas says senior government official in Gaza killed in airstrike", "date": "2024-07-08 12:30", "url": "https://www.egyptindependent.com/hamas-says-senior-government-official-in-gaza-killed-in-airstrike/", "domain": "egyptindependent.com", "domain_classification": "Unknown", "message": "CNN —An Israeli airstrike in Gaza City killed a senior official in the Hamas-run government Sunday, according to the organization.\nHamas said that Ehab al-Ghussein, the Deputy Minister of Labor, was among four people killed by an Israeli airstrike on the Holy Family School in Gaza City.\nIn May, his sister Muna Jamal and wife Amani Sakeek were killed in an Israeli airstrike, according to reports at the time.\nThe strike took place at UNRWA’s Al-Jaouni school in al-Nuseirat camp in central Gaza on Saturday.\nThe Israeli military said in a statement on Saturday militants were operating in structures located in the school area.", "location": "GAZA CITY", "classification": "security", "score": 0.9348345283290047, "event_breakdown": "Israeli airstrike kills senior Hamas official in the Gaza Strip."}, {"id": "8d2824cf-62e8-48ec-b8f3-4ae23db58852", "title": "Children hospital struck in Russian missile attack on Ukrainian cities", "date": "2024-07-08 10:45", "url": "https://www.breakingnews.ie/ukraine/childrens-hospital-struck-in-russian-missile-attack-on-ukrainian-cities-1647200.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Russian missiles have killed at least seven people and struck a children’s hospital in the Ukrainian capital Kyiv, authorities said.\nAnother Russian attack in the central Ukrainian city of Kryvyi Rih is said to have killed at least 10 people.\nAdvertisementThe Russian barrage targeted five Ukrainian cities with more than 40 missiles of different types, hitting apartment buildings and public infrastructure, Ukrainian president Volodymyr Zelenskiy said in a social media post.\nOkhmatdyt Children's Hospital in Kyiv.\nApartment buildings, infrastructure, and a children's hospital have been damaged.", "location": "Kyiv", "classification": "security", "score": 0.6990662589955368, "event_breakdown": "Russian Missiles kill at least seven people in Ukraine including a children’s hospital in Kyiv and another Russian attack in the central Ukrainian city of Kryvyi Rih killed at least 10 people."}, {"id": "5e65fe48-c835-4e3f-85f1-9e77c6a05dee", "title": "Russian missile strike on Ukraine kills 28 and hits Kyiv children hospital", "date": "2024-07-08 14:30", "url": "https://www.oxfordmail.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9364673809418137, "event_breakdown": "Russia-Ukraine conflict: According to AP, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the Okhmatdyt children’s hospital in Kyiv. The attack killed at least 20 people and injured more than 50. The hospital’s main 10-storey building was also damaged."}, {"id": "f6d16f4a-a90d-41fc-bfae-b32c72b2fd68", "title": "  Burning in the Steppes of Donba : Ukraine Downs Russian Su - 25 Attack Jet", "date": "2024-07-08 09:45", "url": "https://www.kyivpost.com/post/35451", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukrainian antiaircraft gunners shot down a Russian Su-25 ground attack aircraft in the Donetsk region, as reported by the Khortytsia operational and strategic group of troops via Telegram.\n“In the Pokrovsky sector, our Ukrainian servicemen shot down a Russian Su-25 aircraft that was firing at the positions of units of the Defense Forces,” the report said.\n\"Another Su-25 attack aircraft is now burning up in the steppes of the Ukrainian Donbas,\" the message read.\nEarlier, the National Guard of Ukraine reported that its soldiers had downed a Russian Su-25 ground attack aircraft in the Donetsk region.\nA team from the 31st brigade of the National Guard used an Igla MANPAD launcher to hit the Russian aircraft.", "location": "Donetsk region.", "classification": "security", "score": 0.887710572141989, "event_breakdown": "['Ukrainian antiaircraft gunners shot down a Russian Su-25 ground attack aircraft in the Donetsk region.']"}, {"id": "1afd4297-cfb2-4540-b3eb-7c6fe0db0e92", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 14:30", "url": "https://www.krcrtv.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "krcrtv.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "The main event is at Kyiv, Ukraine.", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "Location: Kyiv, Okhmatdyt Children's Hospital\nOver a dozen killed, 50 injured in a Russian missile assault on Okhmatdyt Children's Hospital in Kyiv. Dozens still feared trapped under the rubble."}, {"id": "4169719d-ef41-499e-8d04-e8445a3fbc90", "title": "A Kenyan court says 2022 shooting death of a Pakistani journalist by police in Nairobi was unlawful", "date": "2024-07-08 14:00", "url": "https://abcnews.go.com/International/wireStory/kenyan-court-2022-shooting-death-pakistani-journalist-police-111744147", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A Kenyan court has ruled that the 2022 shooting death of a Pakistani journalist by police in Nairobi was unlawful and unconstitutionalA Kenyan court says 2022 shooting death of a Pakistani journalist by police in Nairobi was unlawfulBy MUNIR AHMED Associated Press and EVELYNE MUSAMBI Associated PressISLAMABAD -- A Kenyan court on Monday ruled that the 2022 shooting death of a Pakistani journalist by police in Nairobi was unlawful and unconstitutional, a lawyer and his family said.\nSharif's family has accused an elite Kenyan police unit of intentionally killing Sharif.\nKenyan authorities are still investigating the killing and none of the police officers linked to the shooting has been arrested or charged.\nIn Monday's verdict, the court asked Kenyan authorities to conclude their probe of the officers.\nThe court also ordered the government to compensate Sharif's family 10 million Kenyan shillings ($78,000).", "location": "NAIROBI", "classification": "security", "score": 0.6313165900357032, "event_breakdown": "Here are the current events of security reported in text that can be placed on a map:\nA Kenyan court has ruled the shooting death of a Pakistani journalist by police in Nairobi illegal."}, {"id": "53a64535-7717-459e-b79b-a54d99ad05ab", "title": "West Condemns Russian Strike on Kyiv Children Hospital", "date": "2024-07-08 14:30", "url": "https://www.themoscowtimes.com/2024/07/08/west-condemns-russian-strike-on-kyiv-childrens-hospital-a85644", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "Western leaders and diplomats expressed outrage after Russian missiles destroyed a children’s hospital in Kyiv, amid a rare daytime attack on Ukrainian cities which killed at least 20 on Monday.\nRussia fired dozens of missiles at cities across Ukraine in a massive barrage that killed at least 31 people and smashed into Okhmatdyt children’s hospital in Kyiv, trapping victims under the rubble, UN officials said.\nBritain's Foreign Minister David Lammy condemned the hospital strike as \"an appalling attack on Ukrainian civilians\".\nAll responsible for Russian war crimes will be held to account,\" Borrell posted on X.\nRussia's Defense Ministry said the damage was caused by a Ukrainian air defense missile, insisting that its forces had struck only their \"intended\" defense industry and military targets.", "location": "Kyiv", "classification": "security", "score": 0.8794794082712947, "event_breakdown": "Russian missile attacks in Ukraine killed 20 people and injured others on Monday, including a strike on a psychiatric hospital. The ballistic missiles struck Kyiv, the capital, and in Kharkiv, a city in northeast Ukraine. Over the weekend, Russian President Vladimir V. Putin launched a more modern attack on Kyiv, but NATO blocked the attack."}, {"id": "2f139ac8-befb-4ae7-b1ba-92f78a0f85d0", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 13:30", "url": "https://news4sanantonio.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "Russian missiles killed at least seven people and struck a children's hospital in the Ukrainian capital, Kyiv, on Monday, while another attack in the central Ukrainian city of Kryvyi Rih killed at least 10.\nAt the Okhmatdyt children's hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed wing of the facility, Zelenskyy said, adding that the number of casualties was not yet known.\nA two-story building at the children's hospital was partly destroyed.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.\nThe Kyiv city administration reported falling debris, presumably from intercepted missiles, in a handful of Kyiv areas, starting fires.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.8651193518466003, "event_breakdown": "Event 1: Russian missiles hit a children's hospital and a 10-story apartment building in the Ukrainian capital, Kyiv, on Monday, killing at least seven people. (Source: Kyiv Independent)\nEvent 2: Russian forces attacked the Ukrainian city of Kryvyi Rih on Monday with Kinzhal hypersonic missiles, which killed at least 10 people. (Source: Kyiv Independent)"}, {"id": "d582a437-e6ab-4cfb-b478-16692f7c9e4f", "title": "Children hospital is blown up in  genocidal  missile strike on Kyiv", "date": "2024-07-08 09:45", "url": "https://www.dailymail.co.uk/news/article-13611309/Childrens-hospital-blown-genocidal-missile-strike-Kyiv.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Russian missiles have struck a children's hospital in Kyiv and killed at least three people elsewhere in the Ukrainian capital, authorities have said.\n'More than 40 missiles of various types Residential buildings, infrastructure, and a children's hospital have been damaged.'\n'Russia's strike on the Okhmatdyt Children's Hospital in Kyiv is an appalling attack on Ukrainian civilians,' Mr Lammy wrote on Twitter.\nFrance's foreign ministry called the day-time bombardment of a children's hospital in Kyiv 'barbaric'.\nThe Ohmatdyt Children's Hospital in Kyiv is the largest children's hospital in Ukraine, and is famous around Europe for its excellence.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.4770596233127818, "event_breakdown": "Russian missiles have struck a children's hospital in Kyiv and killed at least three people elsewhere in the Ukrainian capital, authorities have said."}, {"id": "a5023019-4bbb-4147-a1c6-41f7dd21fd14", "title": "Israeli protests block highways , push deal | The Arkansas Democrat - Gazette", "date": "2024-07-08 10:00", "url": "https://www.arkansasonline.com/news/2024/jul/08/israeli-protests-block-highways-push-deal/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "The militant group still wants mediators to guarantee a permanent cease-fire, while Netanyahu is vowing to keep fighting until Israel destroys Hamas' military and governing capabilities.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolize those fellow citizens who were killed and abducted.\nShe added: \"It's nine months today, to this black day, and still nobody in our government takes responsibility.\"\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nIsraeli airstrikes overnight and into Sunday meanwhile killed at least 13 Palestinians, including the undersecretary of labor in the largely dismantled Hamas-run government.", "location": "GAZA", "classification": "security", "score": 0.8311401162052428, "event_breakdown": "Gaza\nIsraeli airstrikes in the Gaza strip killed at least 13 Palestinians."}, {"id": "905a8f67-b841-4429-b335-d0cabb7e5133", "title": "Kyiv Children Hospital Destroyed in Russia Missile Attack , Multiple Casualties Reported", "date": "2024-07-08 09:45", "url": "https://www.kyivpost.com/post/35470", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "At the Okhmatdyt Children's Hospital, 2 people died, and 10 others were injured.\nAdvertisementKyiv Post's special correspondent Sergii Kostezh filmed videos that show the aftermath of the attack on Okhmatdyt hospital.\nThe Minister of Health of Ukraine, Viktor Lyashko, has arrived at the scene of the attack, as reported by local Telegram channels.\nKlitschko reported on Telegram that there are currently 16 injured people at Okhmatdyt Hospital, seven of them children.\nLater Klitschko confirmed Klymenko's information, writing, \"Two dead in the Okhmatdyt hospital.\"", "location": "Kyiv", "classification": "security", "score": 0.8928105417459894, "event_breakdown": "Kyiv Post's special correspondent Sergii Kostezh filmed videos that show the aftermath of the attack on Okhmatdyt hospital.\nThe Minister of Health of Ukraine, Viktor Lyashko, has arrived at the scene of the attack, as reported by local Telegram channels.\nKlitschko reported on Telegram that there are currently 16 injured people at Okhmatdyt Hospital, seven of them children.\nLater Klitschko confirmed Klymenko's information, writing, \"Two dead in the Okhmatdyt hospital.\""}, {"id": "2e5a81a0-a863-42e9-a584-14144f874628", "title": "Kyiv Comes Under Attack in Missile Strike Across Ukraine", "date": "2024-07-08 09:45", "url": "https://www.bnnbloomberg.ca/kyiv-comes-under-attack-in-missile-strike-across-ukraine-1.2093793", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "Kyiv Comes Under Attack in Missile Strike Across Ukraine(Bloomberg) -- Ukrainian President Volodymyr Zelenskiy denounced a Russian-launched missile attack that partially destroyed a children’s hospital in Kyiv as part of a barrage of strikes across the country that killed at least 31 people.\nAlthough Zelenskiy will fall short in his ambition to join the alliance, NATO leaders will offer a range of security guarantees.\nUkraine’s State Security Service said a preliminary investigation showed that Russian forces deployed X-101 cruise missile in the hospital strike, which killed at least two personnel and injured 10 — including two children.\nIn Kryvyi Rih in central Ukraine, steelmaker Metinvest said 10 workers were killed when a missile struck an administrative building.\nThe missile barrage over Kyiv was the first such strike since late March.", "location": "Kyiv", "classification": "security", "score": 0.7945008736450351, "event_breakdown": "Target Event: Russian strike on Kyiv children's hospital kills at least two\nRussian forces launched a missile attack against a children's hospital in Kyiv on Wednesday, killing at least two personnel and injuring 10, including two children."}, {"id": "4c794e94-71c6-402f-b13c-ae7799bbd70c", "title": "At least 20 dead in Russian attack on Ukraine cities", "date": "2024-07-08 11:15", "url": "https://www.rnz.co.nz/news/world/521617/at-least-20-dead-in-russian-attack-on-ukraine-cities", "domain": "rnz.co.nz", "domain_classification": "Unknown", "message": "Photo: Anatolii Stepanov / AFPAt least 20 people have been killed after Russia launched a massive missile attack against cities across Ukraine, according to officials.\nThe city's mayor said a children's hospital was hit by the missile strike and was being evacuated.\nResidential buildings, infrastructure and a children's hospital were damaged,\" Zelensky said.\nRussian terrorists have once again launched a massive missile attack on Ukraine.\nApartment buildings, infrastructure, and a children's hospital have been damaged.", "location": "KHARKIV", "classification": "security", "score": 0.9017856470138175, "event_breakdown": "At least 20 people were killed after Russia launched a massive missile attack against cities across Ukraine on Monday, including a hospital in the Ukrainian city of Mariupol, according to officials.\nThe Islamic State claimed responsibility for an attack on a Sikh temple in Afghanistan on Saturday that killed at least 30 people and wounded 10.\nThree people were killed in a shooting at a Jewish community center in Kansas City on Sunday."}, {"id": "65750737-f46c-45da-ab36-d35f27cbb13c", "title": "Plan Backfires ? FSB Claims It Foiled Ukrainian Plot to Steal a Strategic Bomber", "date": "2024-07-08 09:45", "url": "https://www.kyivpost.com/post/35472", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The FSB claimed on its website on Monday that it had thwarted a plot by Ukrainian special services supported by other Western intelligence agencies to hijack a Tu-22M3 supersonic strategic bomber, without producing any verifiable evidence.\nAccording to its announcement which was reported by TASS, Ukrainian intelligence officers had offered an unnamed pilot from Russia’s Aerospace Forces $2 million along with an offer of Italian citizenship to fly and land the missile carrier in Ukraine.\nDuring its operation, the FSB said it had received information that allowed Russia to carry out a strike on the Ozerne airfield in northwestern Ukraine.\nHowever, no details of when the operation to prevent the hijacking or when the alleged strike on the airfield occurred.\nIn return for his actions he received $500,000 and a Ukrainian passport in the name of Igor Shevchenko.", "location": "The operation mentioned by the FSB, however, did not explicitly state where the operation actually took place", "classification": "security", "score": 0.45798818897532173, "event_breakdown": "Target event:\nThe FSB (Russia's Federal Security Service) announced that it had thwarted a plot by Ukrainian special services supported by the UK and other Western intelligence agencies to hijack a Tu-22M3 supersonic strategic bomber. Ukraine was the target of the thwarted hijacking."}, {"id": "3edb45a9-4193-4f0b-af8a-dcb37d9a6c48", "title": "Ukraine Security Service identifies missile Russia used to hit Kyiv children hospital – photo", "date": "2024-07-08 13:30", "url": "https://www.yahoo.com/news/ukraines-security-identifies-missile-russia-113735142.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The aftermath of the Russian attack on the Okhmatdyt National Children's Specialised Hospital in Kyiv.\nPhoto: Bohdan Kutiepov, Ukrainska PravdaThe Security Service of Ukraine (SSU) has defined Russia's attack on the Okhmatdyt National Children's Specialised Hospital in Kyiv as a war crime and initiated criminal proceedings into the matter.\nSource: SSU press serviceDetails: Early reports from SSU investigators indicate the Russians used a Kh-101 air-launched cruise missile to attack the medical facility.\nPhoto: SSU press servicePHOTO: SSU PRESS SERVICEPHOTO: SSU PRESS SERVICEQuote from SSU Chief Vasyl Maliuk: \"The Security Service will do everything possible to ensure that the enemy faces the maximum retribution for each of their war crimes, including today's attack on Ukraine.\nThis retribution will be delivered in accordance with the law and morality.", "location": "KYIV.", "classification": "security", "score": 0.6659766932177482, "event_breakdown": "Russian Airstrike on Okhmatdyt National Children's Specialised Hospital in Kyiv (Ukraine) - Security Service of Ukraine (SSU) declares Russian airstrike on Okhmatdyt National Children's Specialised Hospital in Kyiv a war crime and opens criminal investigation."}, {"id": "c5f4e51e-f6de-4f12-ad8f-5a222d68f3c9", "title": "Slovakian PM Robert Fico takes first trip outside capital after assassination attempt", "date": "2024-07-08 12:15", "url": "https://abcnews.go.com/International/wireStory/slovakian-prime-minister-robert-fico-takes-trip-capital-111739100", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Slovakia’s populist Prime Minister Robert Fico has taken his first trip outside the capital since resuming his duties after an assassination attemptBRATISLAVA, Slovakia -- Slovakia's populist Prime Minister Robert Fico took his first trip outside the capital on Monday since resuming his duties after an assassination attempt.\nFico visited a farm in Slovenska Nova Ves, northeast of the capital of Bratislava, along with agriculture minister Richard Takáč to check the grain harvest.\nIt was his first official trip outside the capital since recovering from the May 15 attack in which he was shot in the abdomen as he greeted supporters in the town of Handlova, 140 kilometers (85 miles) northeast of the capital.\nFico made his first public appearance since the assassination attempt on Friday, when he gave a speech for a national holiday.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Prime Minister Viktor OrbánThousands of people have held rallies in the capital and across Slovakia to protest Fico’s policies.", "location": "BRATISLAVA", "classification": "security", "score": 0.6273593091069734, "event_breakdown": "Target event: an assassination attempt, Robert FicoSlovakia's populist Prime Minister Robert Fico took his first trip outside the capital on Monday since resuming his duties after an assassination attempt."}, {"id": "dd883791-fa19-4164-9216-01aed7f1e700", "title": "Slovakian Prime Minister Robert Fico takes first trip outside capital after assassination attempt", "date": "2024-07-08 12:45", "url": "https://www.independent.co.uk/news/world/europe/robert-fico-ap-bratislava-viktor-orban-ukraine-b2575923.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policySlovakia's populist Prime Minister Robert Fico took his first trip outside the capital on Monday since resuming his duties after an assassination attempt.\nFico visited a farm in Slovenska Nova Ves, northeast of the capital of Bratislava, along with agriculture minister Richard Takáč to check the grain harvest.\nIt was his first official trip outside the capital since recovering from the May 15 attack in which he was shot in the abdomen as he greeted supporters in the town of Handlova, 140 kilometers (85 miles) northeast of the capital.\nFico made his first public appearance since the assassination attempt on Friday, when he gave a speech for a national holiday.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Prime Minister Viktor OrbánThousands of people have held rallies in the capital and across Slovakia to protest Fico’s policies.", "location": "NULL", "classification": "security", "score": 0.5736236900740259, "event_breakdown": "Slovakia's populist Prime Minister Robert Fico was the target of an assassination attempt on May 15, 2017. Fico was shot in the abdomen as he greeted supporters in the town of Handlova, 140 kilometers (85 miles) northeast of the capital of Bratislava. It was his first official trip outside the capital since recovering from the attack.\nFico made his first public appearance since the assassination attempt on Friday, June 9, 2017, when he gave a speech for a national holiday. Slovakians have been protesting Fico's policies, with rallies being held across Slovakia. In his first trip outside Bratislava after his assassination attempt, Fico visited a farm in Slovenska Nova Ves, northeast of the capital. He was accompanied by agriculture minister Richard Takác."}, {"id": "c7be0c86-6b08-4658-805b-0f81f3f7df74", "title": "Kyiv children hospital devastated by Russian missile attack | News", "date": "2024-07-08 14:15", "url": "https://www.independent.co.uk/tv/news/ukraine-childrens-hospital-kyiv-missile-attack-b2575946.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "A major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv.\nEmergency crews searched rubble for casualties after a Russian barrage targeted five Ukrainian cities with more than 40 missiles of different types, hitting apartment buildings and public infrastructure.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed wing of the facility, Ukrainian president Volodymyr Zelensky said, adding that the number of casualties was not yet known.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.6736465570845251, "event_breakdown": "Russian missile strike near Okhmatdyt children's hospital in Kyiv, Ukraine."}, {"id": "cb6000fe-e2c6-4fe6-8bee-d215e70c6648", "title": "Russia says it foils Ukraine bid to hijack strategic bomber | World", "date": "2024-07-08 13:30", "url": "https://en.ammonnews.net/article/73688", "domain": "en.ammonnews.net", "domain_classification": "Unknown", "message": "Home WorldRussia says it foils Ukraine bid to hijack strategic bomberAmmon News - Russia's Federal Security Service (FSB) blocked an attempt by Ukraine to organise the hijacking of a Russian Tu-22M3 strategic bomber and fly it to Ukraine, the FSB said on Monday.\n\"Ukrainian intelligence intended to recruit a Russian military pilot for a monetary reward and the provision of Italian citizenship, to persuade him to fly and land a missile carrier in Ukraine,\" the FSB, the main successor to the Soviet-era KGB, said on its website.\nDuring the operation, Russia received information that helped its forces to strike the Ozerne airfield in northwestern Ukraine, the FSB added in its statement.\nThe timings of the operation and the alleged strikes on the Ozerne airfield in Ukraine's Zhytomyr were both unclear.", "location": ")\nRUSSIA", "classification": "security", "score": 0.4430183889540401, "event_breakdown": "The events listed in the text that can be placed on a map are:\n- The FSB said on Monday it had foiled an attempt by Ukraine to organize the hijacking of a Russian Tu-22M3 strategic bomber and fly it to Ukraine.\n- According to the FSB, Ukrainian intelligence intended to recruit a Russian military pilot for a monetary reward and the provision of Italian citizenship, to persuade him to fly and land a missile carrier in Ukraine."}, {"id": "c2e7babe-af98-4bc7-acdc-385d80281844", "title": "Gaza truce hopes hit setback as Israeli forces intensify assaults", "date": "2024-07-08 11:30", "url": "https://www.dailysabah.com/world/mid-east/gaza-truce-hopes-hit-setback-as-israeli-forces-intensify-assaults", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Intense clashes engulfed Gaza City on Monday as Hamas and Israel asserted their positions ahead of truce negotiations.\nIn Gaza City, Israeli forces' fighter jets and drones soared through the skies above the besieged region.\nSmoke rises during an Israeli air strike, Gaza City, Palestine, July 7, 2024.\nPalestinians, who fled the eastern part of Gaza City after they were ordered by Israeli army to evacuate their neighborhoods, carry their belongings, Gaza City, Palestine, July 7, 2024.\nA senior Hamas official on Monday accused the hawkish Israeli premier of intensifying combat and bombardment in Gaza to derail the latest truce effort.", "location": "GAZA CITY", "classification": "security", "score": 0.9249555728244581, "event_breakdown": "Hamas and Israel assert their positions ahead of truce negotiations in Gaza City\n\nIntense clashes engulfed Gaza City on Monday as Hamas and Israel asserted their positions ahead of truce negotiations. In Gaza City, Israeli forces' fighter jets and drones soared through the skies above the besieged region."}, {"id": "599480e6-36fe-4565-9cd9-7ed4538ac195", "title": "At Least 17 Apartments Destroyed By Russian Shelling In Kyiv , People Under Rubble", "date": "2024-07-08 14:00", "url": "https://menafn.com/1108417315/At-Least-17-Apartments-Destroyed-By-Russian-Shelling-In-Kyiv-People-Under-Rubble", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) At least 17 apartments were destroyed in a residential building in the Shevchenkivskyi district of Kyiv as a result of a Russian missile strike.\n\"In a residential building, one entrance was destroyed.\nHouse hit in Shevchenkivskyi district of, entrance destroyedAccording to him, about 17 apartments in the building were destroyed.\nAs reported earlier, fragments of Russian missiles fell in seven districts of Kyiv.\nIn particular, a residential building in the Shevchenkivskyi district was hit.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9833301639041591, "event_breakdown": "At least 17 apartments were destroyed in a residential building in the Shevchenkivskyi district of Kyiv as a result of a Russian missile strike."}, {"id": "2087a974-c69c-453b-9707-7c44a53c091e", "title": "Lightning strikes British Airways flight causing emergency diversion leaving passengers  shocked  ", "date": "2024-07-08 11:30", "url": "https://www.walesonline.co.uk/news/uk-news/lightning-strikes-british-airways-flight-29495913", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "More infoPassengers on a British Airways flight were left terrified after their aircraft was hit by lightning, causing an unexpected diversion to Gatwick Airport.\n\"The crew were amazing when our flight got struck by lightning on the approach to Heathrow,\" said passenger Jeco, as reported by The Sun.\nIn case of a lightning strike, passengers should remain calm and follow the flight attendant's instructions.\"\nTypically, lightning strikes result in little to no harm, although they can be startling due to loud noises.\n\"Only the small parts on the aircraft's outer body might get harm but it is quite predictable in case of a lightning strike,\" stated Pegasus Airlines.", "location": ".)\nThe main event described in the text takes place at Gatwick Airport.", "classification": "security", "score": 0.4721232469278281, "event_breakdown": "Flight from London to Newark diverts to Gatwick after lightning strike\nA British Airways flight from London to Newark was diverted to Gatwick Airport on Sunday due to unexpected lighting. The strike occurred during the aircraft's approach to Heathrow. Passengers reported the crew managed the situation well.\n\nLightning strike causes no injuries but injuries during storm\nA tube train in the London area was struck by lightning on Saturday, injuring six people. Despite the train's mid-storm, the six victims were lucky enough to survive."}, {"id": "5d2ed0ab-ab2d-478c-be20-b4716a59da99", "title": "Officials say a Russian missile attack on the central Ukrainian city of Kryvyi Rih has killed 10 people and injured 31 , reports AP . ", "date": "2024-07-08 12:15", "url": "https://www.devdiscourse.com/article/Newsalert/3009312-officials-say-a-russian-missile-attack-on-the-central-ukrainian-city-of-kryvyi-rih-has-killed-10-people-and-injured-31-rep", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Officials say a Russian missile attack on the central Ukrainian city of Kryvyi Rih has killed 10 people and injured 31, reports AP.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)", "location": "KRYVYI RIH", "classification": "security", "score": 0.9128481822521141, "event_breakdown": "Russian missile attack on the Central Ukrainian city of Kryvyi Rih killed 10 people."}, {"id": "53c86c5f-804d-4af1-bb6c-62c51ad5d037", "title": "Ukrainian air defence engaged in repelling Russian missile attack on Kyiv , officials", "date": "2024-07-08 11:15", "url": "https://www.swissinfo.ch/eng/ukrainian-air-defence-engaged-in-repelling-russian-missile-attack-on-kyiv%2c-officials/83102460", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russian daytime attack on Ukraine kills at least 20, hits children’s hospital in Kyivreuters_tickers2 minutesBy Olena Harmash and Max HunderKYIV (Reuters) -Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children’s hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donestk regional governor.\nThe major attack on Ukraine came as Hungarian Prime Minister Viktor Orban met Chinese President Xi Jinping to discuss a potential Ukraine peace deal, paying an unexpected visitto Beijing.", "location": "Kviv", "classification": "security", "score": 0.49456917265002875, "event_breakdown": "Russian attacks damage infrastructure, commercial and residential buildings in Kyiv, eastern Ukraine, and an industrial facility in Pokrovsk, eastern Ukraine."}, {"id": "eff1b5b0-c189-4793-9b6f-dd3b9071b095", "title": "A major Russian missile attack on Ukraine kills at least 28 people and hits a children hospital", "date": "2024-07-08 13:30", "url": "https://medicinehatnews.com/news/world-news/2024/07/08/a-major-russian-missile-attack-on-ukraine-kills-at-least-28-people-and-hits-a-childrens-hospital/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "A major Russian missile attack on Ukraine kills at least 28 people and hits a children’s hospitalBy Hanna Arhirova And Illia Novikov, The Associated Press on July 8, 2024.\nShare this story:KYIV, Ukraine (AP) – A major Russian missile attack across Ukraine killed at least 28 people and injured almost 100 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a three-day NATO summit in Washington beginning Tuesday.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.5490440461764886, "event_breakdown": "KYIV, Ukraine (AP) – A major Russian missile attack across Ukraine killed at least 28 people and injured almost 100 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties."}, {"id": "7c685ff1-bd6f-4415-b624-bf22dc0086b2", "title": "The New Norms of War and Peace", "date": "2024-07-08 07:00", "url": "https://www.sentinelassam.com/more-news/editorial/the-new-norms-of-war-and-peace", "domain": "sentinelassam.com", "domain_classification": "Unknown", "message": "The termination of the Cold War has in many ways altered the concepts of war and peace.\nNo nation really wants another World War.\nSecondly, what is far more serious than ‘covert’ warfare is the rise of terrorism as the instrument of proxy war in the post-Cold War period.\nSabotaging strategic establishments, damaging the economic lifelines of the nation, and disrupting vital systems through cyber attacks are the new facets of ‘proxy war’.\nNon-military methods of defeating an adversary set new norms of war and peace and call for new strategies for handling international relations and defining new yardsticks of friendships and opponents.", "location": "Kyiv", "classification": "security", "score": 0.4187443857771031, "event_breakdown": "Target event: Coinhive, a JavaScript cryptocurrency miner, that was found to have appeared on Pirate Bay, the world’s largest torrent site\nOn Friday, security researcher Troy Mursch reported that Coinhive, a JavaScript cryptocurrency miner, had appeared on The Pirate Bay, the world’s largest torrent site, without users’ explicit permission. Users accessing the site were automatically running the mining program on their machines, using their processing power to generate hashes to “mine” the cryptocurrency Monero. This was an unexpected representation of security for the public, revealing another method of mining held by common users."}, {"id": "cbd39f74-258b-4daf-8289-17f0454788d7", "title": "Powerful sister of North Korean leader Kim calls South Korea actions  suicidal hysteria  ", "date": "2024-07-08 09:45", "url": "https://www.independent.co.uk/asia/east-asia/kim-jong-un-sister-south-korea-b2575811.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The sister of North Korean leader Kim Jong Un has called South Korea’s front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps.\nThe warning by Kim Yo Jong came after South Korea performed firing exercises in its tense land and sea borders with North Korea in the past two weeks.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.\nNorth Korean leader Kim Jong Un’s younger sister Kim Yo Jong, center ( Copyright 2018 The Associated Press.", "location": "Seoul", "classification": "security", "score": 0.6336366927221866, "event_breakdown": "Target event:\nSouth Korea's front-line live-fire drills"}, {"id": "9b0b37b9-d02f-4e0e-9f6d-cfad13755644", "title": "Druze officer killed as IDF eliminates over 30 terrorists in Rafah", "date": "2024-07-08 13:15", "url": "https://www.thejc.com/news/israel/druze-officer-killed-as-idf-eliminates-over-30-terrorists-in-rafah-vpx9ipj8", "domain": "thejc.com", "domain_classification": "Unknown", "message": "The IDF killed more than 30 terrorists in Rafah over the past 24 hours, as Israel's war against Hamas entered its ninth month.\nThe building contained an operational shaft connected to an underground route and was a gathering place for terrorists, the IDF said.\nIn Shejaiya, Israeli troops killed several terrorists, dismantled terror infrastructure and located weapons, including explosive devices, AK-47 rifles, machine guns and handguns.\nIn addition to the terrorists killed in Rafah and Shejaiya, tens of thousands of terror targets have been struck from the air.\nSince the start of fighting, Israeli forces have killed five Hamas brigade commanders, 24 battalion commanders and some 100 company commanders.", "location": "RAFAH", "classification": "security", "score": 0.9903437249659044, "event_breakdown": "Israel is fighting a war with Hamas, a terrorist organisation in the Gaza Strip, that has lasted more than 8 months."}, {"id": "7f032d97-8bb0-4f28-932e-071d72b50abd", "title": "China and Belarus conduct joint military exercises right next to NATO and EU border", "date": "2024-07-08 14:15", "url": "https://www.aol.com/china-belarus-conduct-joint-military-124418076.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "China and Belarus announced they were holding joint military training exercises just miles from the border of Poland – a NATO and European Union member.\nBelarus’ Ministry of Defense said troops from China’s People’s Liberation Army arrived in Belarus over the weekend.\nThe exercises are taking place near the Belarus city of Brest on the Belarus-Poland border which is around 130 miles from the Polish capital of Warsaw and some 40 miles from Minsk’s border with Ukraine.\nMoscow partly used Belarus as a launching pad for the full-scale invasion of Ukraine in February 2022 after amassing troops on the Ukrainian border during what it said were joint military exercises.\nThe Chinese troops arrived in Belarus just days after that country joined the Shanghai Cooperation Organization (SCO) on Thursday.", "location": "The specific location is Brest, Belarus.", "classification": "security", "score": 0.5945287224055208, "event_breakdown": "China and Belarus hold joint military training exercises near the Belarus city of Brest on the Belarus-Poland border, which is some 130 miles from the Polish capital of Warsaw and some 40 miles from Minsk’s border with Ukraine."}, {"id": "a93bf5bd-53b0-4ba3-ad77-d7c9465b823c", "title": "Israel strikes Gaza as mediators push for truce deal", "date": "2024-07-08 12:15", "url": "https://www.hurriyetdailynews.com/israel-strikes-gaza-as-mediators-push-for-truce-deal-198235", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Israel strikes Gaza as mediators push for truce dealGAZA STRIPHeavy strikes rocked Gaza City on Monday as Hamas and Israel staked their claims ahead of truce talks, with Israeli protesters rallying for a hostage release deal.\nThe Israeli army announced early on Monday that it launched a \"ground operation\" in Gaza City, against targets including headquarters of the U.N.\nIsrael's offensive has killed more than 38.100 people in Gaza, mostly civilians, according to the Hamas-run territory's health ministry.\nAmid the Gaza war, Israel has exchanged near daily cross-border fire with Hamas's Lebanese ally Hezbollah, raising fears of all-out war.\nOn Monday, the Israeli army reported again striking multiple Hezbollah targets overnight including an arms depot and a flying object nearing Israel.", "location": "GAZA STRIP", "classification": "security", "score": 0.7667169021215106, "event_breakdown": "Gaza City, Israel\nThe Israeli army on Monday launched a \"ground operation\" in Gaza City, against targets including headquarters of the U.N."}, {"id": "ec826e7f-0f28-497b-8e03-039cc8b9ad18", "title": "The significance of international journalists visiting Rafah , Gaza Strip", "date": "2024-07-08 13:30", "url": "https://www.jpost.com/israel-hamas-war/article-809408", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF had done a similar trip for Israeli journalists in mid-June.\nIt’s important to see Rafah through their eyes because most of Gaza has not been accessible to foreign journalists, or Israeli journalists.\nForeign journalists see the destruction and the war differently than some of the Israeli accounts of this same battle.\nForeign journalists will ask different questions than Israeli journalists have asked.\nThat is not because of a value judgement of who are better journalists, it is merely a fact that Rafah is being seen in different eyes by foreign journalists than Israeli journalists and each person brings with them the knowledge and experience of the past when they enter a place like Rafah.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.8107092887895002, "event_breakdown": "1. Rafah is seen as differently by foreign journalists than Israeli journalists due to the experience and knowledge they bring with them.\n2. The IDF had organized a trip for Israeli journalists in mid-June to Rafah.\n3. It's important to see Rafah through foreign journalists' eyes because most of Gaza has not been accessible to foreign or Israeli journalists.\n4. Foreign journalists will bring a different perspective and experience into reporting the destruction and the war in Gaza."}, {"id": "1fe7dd3c-69b7-4833-a6f4-d133b6819ce4", "title": "At the Paris Olympics , it will no longer be personal for Ukraine athletes . This time , it war", "date": "2024-07-08 11:45", "url": "https://apnews.com/article/ukraine-russia-invasion-olympics-paris-ff986e5492e22a5c11415b187c25eda7", "domain": "apnews.com", "domain_classification": "International", "message": "KYIV, Ukraine (AP) — For Ukrainian hurdler Anna Ryzhykova, each stride on the Paris Olympic track will have meaning far beyond the time she clocks.\nSkater Oksana Baiul won Ukraine’s first Olympic gold, at the 1994 Winter Games, just three years after Ukraine declared independence.\n“Our victories are to draw attention to Ukraine,” Ryzhykova says.\nThat ruined the plans of diver Stanislav Oliferchyk to use it as his Olympic training base for Paris.\n(AP Photo/Francisco Seco)In Paris, Ukrainian athletes will endure another ordeal: the likelihood of crossing paths with competitors from Russia and ally Belarus.", "location": "KYIV, Ukraine.", "classification": "security", "score": 0.6090077023507271, "event_breakdown": "Security forces deployed to cities like Luhans'k, Donetsk, Odesa, and Kharkiv have been subject to arrests from armed groups, as have critical infrastructure such as airports, and energy systems that were found to be unguarded."}, {"id": "68c2e792-01d5-41b6-b8a6-1f542e6ee43e", "title": "Protests in Israel mark 9 months of war with Hamas - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-07-08 18:45", "url": "https://www.newdelhitimes.com/protests-in-israel-mark-9-months-of-war-with-hamas/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Israel’s war with Hamas militants reached the nine-month mark Sunday, with Israeli protesters blocking highways across the country, calling for Prime Minister Benjamin Netanyahu to resign and pushing for a cease-fire.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolize those who were killed and abducted.\nMeanwhile, fighting raged on, with at least nine Palestinians killed in Israeli strikes.\nThe Israeli military said it was looking into the report.\nIsrael and Hamas, however, may be inching closer to an elusive cease-fire after Hamas dropped its demand that any deal include a complete end to the war, although both sides said significant gaps remain.", "location": "GAZA", "classification": "security", "score": 0.8528317473627356, "event_breakdown": "Israel-Gaza border, Israel-Palestine border"}, {"id": "863dbcd0-eb35-41cc-9a0e-8ceae879a724", "title": "Over 30 killed , 125 wounded in Ukraine as children hospital hit", "date": "2024-07-08 15:15", "url": "https://www.yahoo.com/news/over-30-killed-125-wounded-144729540.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian missile attacks on the city, damaged and partially destroyed a children's hospital.\nHundreds of people gather at the Okhmatdyt Children's Hospital to search through the debris.\nBerlin strongly condemns Russian attacksThe German government strongly condemned the Russian attacks, including on the Kiev children's hospital.\nRussian missile attacks on the city, damaged and partially destroyed a children's hospital.\nRussian missile attacks on the city, damaged and partially destroyed a children's hospital.", "location": "provided\nKiev", "classification": "security", "score": 0.9334905031691135, "event_breakdown": "Russian attacks on Kiev\nUkraine"}, {"id": "bdf1f1c1-df81-424a-a35c-76834a40f62a", "title": "20 die as Russian missiles strike children hospital , multiple Ukrainian cities", "date": "2024-07-08 11:00", "url": "https://www.firstpost.com/world/several-dead-as-russian-missiles-strike-childrens-hospital-multiple-ukrainian-cities-13790695.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "In the Ukrainian capital of Kyiv, at least seven people were killed after a Russian missile struck a children’s hospital on Monday.\nAdvertisementZelenskyy condemns the incidentIn a post on X, the Ukrainian leader mentioned that over 40 missiles struck different cities across the country.\nIn a separate post, Zelenskyy shared the video of the devastation from the Okhmatdyt Children’s Hospital in Kyiv.\nApartment buildings, infrastructure, and a children's hospital have been damaged.\nOkhmatdyt Children's Hospital in Kyiv.", "location": "KYIV", "classification": "security", "score": 0.4337948958294641, "event_breakdown": "Seven people were killed after a missile struck a children's hospital in the Ukrainian capital of Kyiv on Monday. The hospital is located in the western part of the capital."}, {"id": "07ae8320-12d1-44ea-a96b-a8e9b13e9d11", "title": "  No words for thi : horror over Russian bombing of Kyiv children hospital | Ukraine", "date": "2024-07-08 18:00", "url": "https://www.theguardian.com/world/article/2024/jul/08/ukraine-horror-russian-bombing-kyiv-childrens-hospital", "domain": "theguardian.com", "domain_classification": "International", "message": "The children sat in stunned silence, their fragile bodies still tethered to medical drips outside the Okhmatdyt children’s hospital in central Kyiv, where an impromptu field camp had sprung up.\nThe hospital’s toxicology ward lay in ruins, wrecked by the explosion that sent shrapnel tearing through the main hospital building, shattering its windows.\nView image in fullscreen Medics attend to an injured child at the Okhmadyt hospital in Kyiv.\nI’m still shaking.”Images from inside the hospital, which treats 20,000 children annually, showed bloodied children, collapsed ceilings and destroyed operating rooms.\nUN secretary general 'strongly condemns' Russian attack on Kyiv children's hospital – videoSoon after, news came out that a separate maternity unit in Kyiv had been partially destroyed by falling debris, killing four people and wounding three.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.887466900708881, "event_breakdown": "UN secretary general Antonio Guterres condemned the attack, reiterating that hospitals are “inviolable” under international humanitarian law and that civilians, including children, must be protected.\n\nRussian forces have intensified attacks on Ukraine’s capital Kyiv, including a strike on their international airport and an assault on the city’s central train station, described by the mayor as a “crime against humanity”.Luke Harding & Andrew Roth (2022). Invading Russian forces commit 'crime against humanity' with indiscriminate shelling of nuclear plant, doctors say. The Guardian."}, {"id": "b2c0664b-8844-4039-8285-6723de2bc896", "title": "  A lot of people injured by glass  – Cardiology Centre doctor who witnessed Russian attack on Kyiv children hospital – photos", "date": "2024-07-08 15:15", "url": "https://www.yahoo.com/news/lot-people-injured-glass-cardiology-121515965.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"A lot of people injured by glass\" – Cardiology Centre doctor who witnessed Russian attack on Kyiv children's hospital – photosThe aftermath of the Russian attack on the Okhmatdyt Children’s Hospital in Kyiv.\nPhoto: Viktoriia NabiievaThe Center for Pediatric Cardiology and Cardiac Surgery of Ukraine's Health Ministry has been damaged in the Russian attack on Kyiv on 8 July.\nIt is next to the Okhmatdyt Children's Hospital, which suffered extensive damage during the Russian strike.\nAftermath of the Russian attack on Okhmatdyt Children's Hospital on 8 JulyAll photos: Viktoriia NabiievaBackground:On 8 July, the Russians struck the toxicology department of the Okhmatdyt Children's Hospital.\nAs of 14:28, Kyiv Mayor Vitalii Klitschko reported two deaths at the Okhmatdyt hospital – both adults, one of them being a doctor.", "location": "Kyiv", "classification": "security", "score": 0.7956676770054185, "event_breakdown": "The Center for Pediatric Cardiology and Cardiac Surgery of Ukraine's Health Ministry was damaged in the Russian attack on Kyiv on 8 July, and the Okhamatdyt Children's Hospital was also damaged."}, {"id": "07308d73-15e0-4c0b-bd56-6c8b71931529", "title": "Russian daytime attack on Ukraine kills at least 20 , hits children hospital in Kyiv - World", "date": "2024-07-08 12:15", "url": "https://www.brecorder.com/news/40311792/russian-daytime-attack-on-ukraine-kills-at-least-20-hits-childrens-hospital-in-kyiv", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "KYIV: Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children’s hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donestk regional governor.\nAt least seven wounded in Russian attack on Ukraine’s Chuhuiv, governor saysLocal and regional authorities said industrial facilities, infrastructure and residential and commercial buildings were damaged in Kyi, Kryviy Rih, Dnipro, Pokrovsk, Kramatarosk and others.", "location": "KYIV", "classification": "security", "score": 0.895271130951731, "event_breakdown": "Russian missiles hit Kyiv, Kharkiv, Lviv, and other Ukrainian cities on Monday, killing at least 20 people across the country."}, {"id": "a347b084-e88b-41db-8ed1-78446ada1345", "title": "Man gets prison for stabbing pickpocket in Amsterdam , leaving her in pool of blood", "date": "2024-07-08 18:00", "url": "https://nltimes.nl/2024/07/08/man-gets-prison-stabbing-pickpocket-amsterdam-leaving-pool-blood", "domain": "nltimes.nl", "domain_classification": "Unknown", "message": "The court in Amsterdam sentenced a 22-year-old man to four years in prison, 16 months of which are conditionally suspended, for stabbing a pickpocket multiple times in Amsterdam and leaving her wounded and helpless in a spreading pool of blood in September last year.\nThe man had the right to defend himself, but his “very violent explosion of violence” went beyond that right, the court ruled.\nThe court also convicted him of stabbing another man a few days earlier.\nThe judge acknowledged that the man had the right to defend himself against the theft, but he went “too far.” The court convicted the man of attempted manslaughter.\nThe court also convicted the 22-year-old man of aggravated assault for an incident a few days earlier in which he stabbed a man in the hand.", "location": "AMSTERDAM", "classification": "security", "score": 0.42729570437176095, "event_breakdown": "1. Amsterdam: A man was sentenced to four years in prison, 16 months of which are conditionally suspended, for stabbing a pickpocket multiple times in Amsterdam and leaving her wounded and helpless in a spreading pool of blood."}, {"id": "577f0c0b-ea90-41e0-9228-5eedd5ee53b0", "title": "Hezbollah launches drone attack on Mount Hermon in Israeli - occupied Syrian Golan Heights", "date": "2024-07-08 07:15", "url": "https://dunyanews.tv/en/World/822993-Hezbollah-launches-drone-attack-on-Mount-Hermon-in-Israeli-occupied-Syri", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah launches drone attack on Mount Hermon in Israeli-occupied Syrian Golan HeightsWorld World Hezbollah launches drone attack on Mount Hermon in Israeli-occupied Syrian Golan HeightsIt said this was its first such bombing since it began trading fire with Israel on Oct. 8Follow on Published On: Mon, 08 Jul 2024 11:15:56 PKTAMMAN (Reuters) – The Iranian-backed Hezbollah militant group said on Sunday it launched a drone attack on Mount Hermon in the Israeli-occupied Syrian Golan Heights where Israel has a key surveillance centre.\nAlthough it had hit other areas in the occupied Syrian Golan Heights repeatedly, Lebanon's Hezbollah said it was the first time to hit the military target that is at the highest elevation in the Israeli-controlled territory.\nIsrael has key surveillance, espionage and air defence installations on Mount Hermon where it overlooks the Syrian capital and serves to monitor Syria, Iraq, Jordan and parts of Saudi Arabia since the 1973 Oct. Arab-Israeli war.\nIsrael blames Iranian-backed Hezbollah for the increase in violence and has repeated its vows to restore security to the border.\nThe Israel Defence Forces did not immediately reply to a request for comment on the latest Hezbollah strike.", "location": "The main event takes place in the Israel-occupied Syrian Golan Heights. Located on the Syrian border with Israel,", "classification": "security", "score": 0.6833541758195343, "event_breakdown": "Hezbollah launches drone attack on Mount Hermon in Israeli-occupied Syrian Golan Heights"}, {"id": "dca81cd3-00f3-4deb-a6d2-e6593b2aac52", "title": "Ukraine news : Russian missiles his Kyiv children hospital", "date": "2024-07-08 12:30", "url": "https://www.ctvnews.ca/world/russian-missiles-hit-a-children-s-hospital-in-the-ukrainian-capital-and-kill-at-least-20-elsewhere-1.6955050", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "It was Russia's heaviest bombardment of Kyiv in almost four months, hitting seven of the city's 10 districts.\nAt the Okhmatdyt children's hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nHospitals and other medical facilities are protected from military strikes under international law unless they are being used for military operations.\nRussia's Defence Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9161814063146422, "event_breakdown": "Event 1: Russia's heaviest bombardment of Kyiv in almost four months, hitting seven of the city's 10 districts.\nEvent 2: Okhmatdyt children's hospital in Kyiv suffered a partial collapse, with rescuers searching for victims under the rubble.\nEvent 3: Russia's Defence Ministry targeted Ukrainian defense plants and military air bases, denying aiming at civilian facilities and claiming without evidence that pictures from Kyiv indicate Ukrainian air defense missile damage."}, {"id": "b99a1471-a490-47f5-9b2d-8070576cea9d", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 15:30", "url": "https://kval.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "kval.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "targets that are intresting for these strikes are, \na children's hospital.\na candian frigate.\nA children's hospital in the Ukrainian capital of Kyiv was struck by a missile Monday morning, killing at least one person and wounding others, according to the city's mayor. The hospital is near a military base and is serving as a temporary hub for the city's children who have been moved out of the war zone."}, {"id": "7da48e14-1239-4a1e-87e1-8b24be7a621e", "title": "Kyiv children hospital hit as Russia fires barrage of missiles on Ukraine", "date": "2024-07-08 15:15", "url": "https://www.aljazeera.com/news/2024/7/8/kyiv-children-hospital-hit-as-russia-fires-barrage-of-missiles-on-ukraine", "domain": "aljazeera.com", "domain_classification": "International", "message": "At least 29 people have been killed after Russia launched a barrage of missiles targeting what it called defence sites across Ukraine, with one missile striking a children’s hospital in the capital, Kyiv, Ukrainian officials said.\nThe Kyiv city administration reported falling debris, presumably from intercepted missiles, in a handful of Kyiv areas which started fires.\nThree people were killed in the eastern town of Pokrovsk, where missiles hit an industrial facility, Donetsk’s regional governor said.\nThe country’s power grid has already sustained damage from targeted Russian air strikes that began in March.\nThe Ministry of Defence said its forces hit defence industry sites and aviation bases, claiming that the damage in Kyiv was caused by a Ukrainian air defence missile.", "location": "Kyiv", "classification": "security", "score": 0.7970319728462283, "event_breakdown": "The Ministry of Defence claimed: \"high-precision, long-range air-based weapons destroyed the production buildings of the Surazh Factory, which upgraded the Soviet-era Ukrainian S-125 anti-aircraft missile system\". .. southeast of Kyiv."}, {"id": "6764cf88-36a5-4c76-98fa-0361651ea639", "title": "Dozens killed , Kyiv children hospital hit as Russia bombards Ukraine – NBC New York", "date": "2024-07-08 18:15", "url": "https://www.nbcnewyork.com/news/national-international/dozens-killed-kyiv-childrens-hospital-hit-as-russia-bombards-ukraine/5575923/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Zelenskyy said during a visit to Poland that he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nRussia’s Defense Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "location": "KYIV", "classification": "security", "score": 0.9311709622506014, "event_breakdown": "List of current events related to security as reported by the BBC:\n- Okhmatdyt children's hospital in Kyiv is hit by a Russian missile, causing damage to a two-storey wing and killing at least one person.\n- Russia's Defense Ministry says the strikes targeted military air bases and defense plants, denying that any civilian facilities were targeted."}, {"id": "dcee980d-ce3f-48c7-848b-dc0158e14f5f", "title": "Dozens killed , Kyiv children hospital hit as Russia bombards Ukraine – NBC 5 Dallas - Fort Worth", "date": "2024-07-08 18:45", "url": "https://www.nbcdfw.com/news/national-international/dozens-killed-kyiv-childrens-hospital-hit-as-russia-bombards-ukraine/3586285/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Zelenskyy said during a visit to Poland that he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nRussia’s Defense Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "location": "KYIV", "classification": "security", "score": 0.9311709622506014, "event_breakdown": "The following current events of security are reported in text that can be placed on a map:\n\n1. Okhmatdyt children’s hospital in Kyiv, Ukraine\n2. Kyiv and a private medical center, Ukraine\n3. Ukrainian defense plants\n4. Ukrainian military air bases"}, {"id": "a7903986-1fc9-48dc-a245-3684d2d81555", "title": "Deadly Russia missile attacks hit Kyiv children hospital", "date": "2024-07-08 17:15", "url": "https://www.csmonitor.com/World/Europe/2024/0708/russia-ukraine-children-hospital-bombing", "domain": "csmonitor.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine on July 8 killed at least 31 people and injured 154, officials said, with one striking a large children’s hospital in the capital of Kyiv, where emergency crews searched the rubble for victims.\nStrikes in Kryvyi Rih, Mr. Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nMr. Zelenskyy said during a visit to Poland he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.847469063038089, "event_breakdown": "Event 1: A major Russian missile attack across Ukraine on July 8 killed at least 31 people and injured 154, officials said, with one striking a large children’s hospital in the capital of Kyiv, where emergency crews searched the rubble for victims.\nEvent 2: Strikes in Kryvyi Rih, Mr. Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nEvent 3: Mr. Zelenskyy said during a visit to Poland he hopes the summit will provide more air defense systems for Ukraine.\nEvent 4: At the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nEvent 5: About three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center."}, {"id": "d823da15-c0ba-4d48-a582-324f624ee7d9", "title": "Iran Expanding Missile Facilities : Satellite Imagery Unveils Strategic Developments", "date": "2024-07-08 16:00", "url": "https://www.devdiscourse.com/article/technology/3009837-irans-expanding-missile-facilities-satellite-imagery-unveils-strategic-developments", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Recent satellite imagery has revealed major expansions at two key Iranian ballistic missile facilities, a move assessed by American researchers to boost missile production, confirmed by three senior Iranian officials.\nCommercial satellite images taken in 2023 by Planet Labs display over 30 new buildings at Modarres military base and Khojir missile complex, near Tehran.\nExperts found many structures surrounded by dirt berms, typical for missile production to prevent explosions from spreading, according to Jeffrey Lewis of the Middlebury Institute of International Studies.\nSpanning decades, the Shahid Modarres and Khojir facilities are central to Iran's missile and nuclear programs, associated with both the IRGC and Iran's supreme leader.\nJeffrey Lewis and Decker Eveleth note that historical site expansions and new dirt berms indicate Tehran's heightened missile production.", "location": "Shahid Modarres and Khojir missile complex.", "classification": "security", "score": 0.6243341472976209, "event_breakdown": "Location: Tehran, Iran\nTarget event: Expansions of Iranian ballistic missile facilities\nThree senior Iranian officials confirm the expansions of Modarres military base and Khojir missile complex near Tehran."}, {"id": "66206851-0032-4539-a179-66de6a48ee48", "title": "Man , 22 , behind bars after after stabbing victim near Canterbury East railway station", "date": "2024-07-08 18:00", "url": "https://www.kentonline.co.uk/canterbury/news/man-22-behind-bars-after-after-stabbing-victim-near-train-309453/", "domain": "kentonline.co.uk", "domain_classification": "Unknown", "message": "A man has been jailed for six years after stabbing his victim outside a train station in the early hours of the morning.\nRashaan White has been sentenced following his involvement in the serious assault outside Canterbury East railway station, which left the male victim requiring hospital treatment.\nRashaan White has been jailed for six years after stabbing a man in Canterbury.\nPicture: Kent PoliceThe incident took place on September 29 last year at about 1am, with White stabbing his victim twice with a knife.\nWitnesses saw White and Agbata chasing a man along the road outside Canterbury East railway station on the night of the attack.", "location": "Canterbury East railway station", "classification": "security", "score": 0.8131030598783635, "event_breakdown": "Target Event: Man jailed for six years after stabbing his victim outside a train station in Canterbury\nMan jailed for six years after stabbing his victim outside a train station in Canterbury"}, {"id": "2af08591-f365-4b87-8ec9-2f042c728e7c", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 15:15", "url": "https://bakersfieldnow.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "Target: A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties."}, {"id": "16e48e54-53b2-4388-aca0-c1ee4e84937c", "title": "Israeli protesters block highways , call for cease - fire to return hostages 9 months into war in Gaza - WSVN 7News | Miami News , Weather , Sports", "date": "2024-07-08 15:30", "url": "https://wsvn.com/news/us-world/israeli-protesters-block-highways-call-for-cease-fire-to-return-hostages-9-months-into-war-in-gaza/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "Near the border with Gaza, Israeli protestors released 1,500 black and yellow balloons to symbolize those fellow citizens who were killed and abducted.\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nOn Sunday, Israel issued new evacuation orders for parts of Gaza City, which was heavily bombed and largely emptied early in the war.\nHezbollah began launching rocket and mortar attacks after the outbreak of the war in Gaza.\nHezbollah has said it will halt its attacks if there is a cease-fire in Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.9290043257130025, "event_breakdown": "Israeli protestors released 1,500 black and yellow balloons near the border with Gaza to symbolize those fellow citizens who were killed and abducted."}, {"id": "43623267-a0fc-48ab-b88e-95846081580d", "title": "Russia heaviest bombardment of Kyiv in 4 months hits a children hospital", "date": "2024-07-08 17:45", "url": "https://www.airdriecityview.com/world-news/russias-heaviest-bombardment-of-kyiv-in-4-months-hits-a-childrens-hospital-9188575", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "It was Russia’s heaviest bombardment of Kyiv in almost four months, hitting seven of the city’s 10 districts.\nSeven people were killed in the capital, including two staff members at the hospital, where three children were hurt.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nSome of the weapons used in the attack, Ukraine’s air force said, were Kinzhal hypersonic missiles, which are among the most advanced Russian weapons.", "location": "KYIV.", "classification": "security", "score": 0.9503915265589102, "event_breakdown": "Russia's Kinzhal hypersonic missile used to attack Kyiv children's hospital, killing seven people."}, {"id": "8eede6ae-06b8-40c4-87e5-52d625a23b0a", "title": "Russian attack kills 7 people in fertility clinic", "date": "2024-07-08 18:00", "url": "https://www.bagnet.org/news/accidents/1368324/russian-attack-kills-7-people-in-fertility-clinic", "domain": "bagnet.org", "domain_classification": "Unknown", "message": "As a result of a Russian missile attack on the capital on 8 July, the Isida fertility clinic, located near the Livoberezhna metro station, was damaged.\nIt was hit at 13:00, during the second missile launch.\nAccording to the State Emergency Service, seven people were killed and three injured.", "location": "LVIV, UKRAINE", "classification": "security", "score": 0.8803806610319588, "event_breakdown": "The Russian missile attack on the Isida fertility clinic on 8 July killed seven people and injured three. The attack occurred near the Livoberezhna metro stop in Kiev."}, {"id": "9517ce1a-0562-4da3-823b-f49df1aa7ed3", "title": "Russia hits children hospital in Ukraine capital during widespread deadly missile attack", "date": "2024-07-08 11:45", "url": "https://www.voanews.com/a/russia-hits-children-s-hospital-in-ukraine-s-capital-during-widespread-deadly-missile-attack-/7688979.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "United Nations Secretary-General António Guterres condemned the attacks, calling the strikes on the Kyiv hospital and on another medical facility in the capital’s Dniprovsky district “particularly shocking,” spokesman Stephane Dujarric said.\nThe United Nations Security Council will meet on Tuesday to discuss the Russian attack, diplomats said.\nRussia's defense ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nThe Russian attack overnight included a fourth Kh-101 missile, as well as two Iskander-M ballistic missiles, the Ukrainian air force said.", "location": "Kyiv", "classification": "security", "score": 0.8729549032392103, "event_breakdown": "A Russian strike kills at least 10 people in a hospital in Ukraine's capital, Kyiv, another medical facility is hit in east."}, {"id": "1c769066-7ba7-419a-bbde-1cacd8f71b57", "title": "Russian missile attack on children hospital in Kyiv : 2 people killed and 16 injured , including 7 children", "date": "2024-07-08 18:00", "url": "https://www.pravda.com.ua/eng/news/2024/07/8/7464645/", "domain": "pravda.com.ua", "domain_classification": "Unknown", "message": "The aftermath of the Russian attack on the Okhmatdyt childrenʼs hospital.\nPhoto: Bohdan KutiepovTwo adults were killed in the Russian missile attack on the Okhmatdyt children's hospital on the morning of 8 July, and 16 people were injured, including 7 children, Kyiv Mayor Vitali Klitschko has said.\nSource: Vitali Klitschko on TelegramQuote: \"There are currently 16 casualties at the Ohmatdyt childrenʼs hospital.\nAdvertisement:Update: Klitschko later reported that there were two fatalities at the Okhmatdyt childrenʼs hospital.\nInterior Minister Ihor Klymenko had previously reported that two people had been killed at the Okhmatdyt children's hospital.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9207814031516173, "event_breakdown": "Two adults were killed in the Russian missile attack on the Okhmatdyt children's hospital in Kyiv, Ukraine, on 8 July."}, {"id": "86c4581c-d253-45f5-97d1-57548bacbf09", "title": "Adventureland stabbing : Suspect arrested , man critical after Long Island altercation", "date": "2024-07-08 15:15", "url": "https://www.fox5ny.com/news/stabbing-at-adventureland-long-island-amusement-park", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A suspect has been arrested after a person was stabbed at Adventureland Amusement Park on Long Island, Suffolk County Police said.\nAccording to police, the suspect, identified as Daniel Tomasky, 42, of Shirley, stabbed James Burns, 47, of Florida, in the abdomen with a knife during an altercation.\nFarmingdale, N.Y.: A of the rides at Adventureland Amusement Park in Farmingdale, New York as seen from the top of the ferris wheel on August 24, 2019.\nIn a statement, Adventureland said: \"For more than 60 years, Adventureland has been providing Long Island families with a convenient, affordable and fun local destination.\nAdventureland Amusement Park, located off Route 110, has served as a main summer attraction on Long Island since 1962.", "location": ")\nFarmingdale, New York", "classification": "security", "score": 0.40406111592204047, "event_breakdown": "Stabbing at Adventureland Amusement Park on Long Island, New York"}, {"id": "93bf7559-68bc-42c8-98a0-d72e6257f763", "title": "Florida tourist stabbed in front of child at New York Adventureland Amusement Park", "date": "2024-07-08 15:45", "url": "https://www.foxnews.com/us/florida-tourist-stabbed-front-child-new-york-adventureland-amusement-park", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "A stabbing at Long Island's Adventureland Amusement Park in New York left a Florida man in critical condition late Sunday afternoon, derailing a family vacation over the Fourth of July weekend.\nPolice took a New York plumber into custody after the attack, which took place about 35 miles east of New York City in suburban Suffolk County.\nThey said at least one child witnessed the chaos, which prompted additional charges for the suspect.\nAMUSEMENT PARK ROLLER COASTER LEFT MAN PARALYZED: LAWSUITDaniel Tomasky, a 42-year-old from Shirley, faces charges including assault, criminal possession of a weapon and endangering the welfare of a child.\nRescuers transported James Burns, a 47-year-old from Edgewater, Florida, to the hospital in critical condition.", "location": "Long Island, New York", "classification": "security", "score": 0.5470955376848453, "event_breakdown": "Stabbing at Long Island's Adventureland Amusement Park leaves Florida man in critical condition"}, {"id": "2ffe2c29-e15a-4d13-abfb-38048e72ed60", "title": "The WWI Marines who became the service first Medal of Honor aviators", "date": "2024-07-08 18:15", "url": "https://www.airforcetimes.com/news/your-military/2024/07/08/the-wwi-marines-who-became-the-services-first-medal-of-honor-aviators/", "domain": "airforcetimes.com", "domain_classification": "Unknown", "message": "By early July, Navy and Marine aircrews — trained at French, British and Italian aerodromes — were ready and eager to enter the fray.\nSignaling his pilots to tighten up their formation, Lytle and Wiman fought off the leading German aircraft, then sent the second one spiraling out of control.\nWith great difficulty, Talbot manhandled his plane around to fly headlong at another German aircraft, bluffing the enemy pilot into turning away.\nNot wishing to force-land his riddled bomber with his bombardier suffering from 13 wounds, Talbot flew on to the Hondschoote Aerodrome, which he knew had a field hospital.\nOn Nov. 11, 1920, Talbot and Robinson were both awarded the Medal of Honor for their actions on Oct. 14, 1918, making them the first two Marine aviators to receive the award.", "location": "CHAUMONT-EN-LIGNE, Somme", "classification": "security", "score": 0.5058243435900317, "event_breakdown": "Early July 1918, near the town of Beaumont-le Roger, France, Navy and Marine pilots fended off enemy aircraft, ultimately saving their wounded bombardier on October 14, 1918, they were awarded the Medal of Honor, making  them the first two Marine pilots to receive the award."}, {"id": "4739db9d-6d3c-459b-8552-6d796ddf0f44", "title": "Russia Missile Attack On Ukrainian Cities leaves 20 dead - Daily Review Online", "date": "2024-07-08 18:45", "url": "https://dailyreviewonline-ng.com/2024/07/08/73691/", "domain": "dailyreviewonline-ng.com", "domain_classification": "Unknown", "message": "Spread the loveBy Agency ReportsAt least 20 people have been killed after Russia launched a large-scale missile attack on cities across Ukraine, according to officials.\nThe city’s mayor reported that a children’s hospital was hit by the missile strike and was being evacuated.\n“Different cities: Kyiv, Dnipro, Kryvy Rih, Sloviansk, Kramatorsk.\nResidential buildings, infrastructure, and a children’s hospital were damaged,” he said.\nPlumes of smoke were visible across the capital, Kyiv, while videos posted on social media showed the destruction both inside and outside the Okhmadyt children’s hospital.", "location": "KYIV", "classification": "security", "score": 0.5763523359766375, "event_breakdown": "Here are the current security events reported in the provided text that can be mapped:\n\n* Missile attack on Ukraine cities\n* Missile attack on Kyiv, Ukraine\n* Missile attack on Dnipro, Ukraine\n* Missile attack on Kryvy Rih, Ukraine\n* Missile attack on Sloviansk, Ukraine\n* Missile attack on Kramatorsk, Ukraine\n* Damage to residential buildings and infrastructure in Ukraine\n* Damage to a children's hospital in Kyiv, Ukraine"}, {"id": "4c057290-4e8e-40fe-99f8-50bc4a878728", "title": "Russian missile strike on Ukraine kills 28 and hits Kyiv children hospital", "date": "2024-07-08 15:15", "url": "https://www.freepressseries.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "domain": "freepressseries.co.uk", "domain_classification": "Unknown", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9364673809418137, "event_breakdown": "Russian missile attack across Ukraine killed at least 20 people and injured more than 50 people in Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility."}, {"id": "77003228-d426-4fec-b9d5-9c58410f15d6", "title": "Russian missile strike on Ukraine kills 28 and hits Kyiv children hospital | Dumbarton and Vale of Leven Reporter", "date": "2024-07-08 15:15", "url": "https://www.dumbartonreporter.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "domain": "dumbartonreporter.co.uk", "domain_classification": "Unknown", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9364673809418137, "event_breakdown": "Target: Find and extract relevant current events of security reported in text that can be placed on a map.\n1. At the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\n2. A major Russian missile attack across Ukraine killed at least 20 people and injured more than 50."}, {"id": "2e20af63-7ac2-40b0-b2c3-730119e7e03b", "title": "Russian missile strike on Ukraine kills 28 and hits Kyiv children hospital", "date": "2024-07-08 15:15", "url": "https://www.eppingforestguardian.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "domain": "eppingforestguardian.co.uk", "domain_classification": "Unknown", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.9364673809418137, "event_breakdown": "A major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Thursday (AP).\nAt Kyiv's Okhmatdyt children's hospital, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nAccording to the main 10-storey building, windows and doors were blown out and walls were blackened."}, {"id": "b4e475f0-898e-4d0f-94d7-b0172446b7dd", "title": "Russian missile strike on Ukraine kills 28 and hits Kyiv children hospital | Harwich and Manningtree Standard", "date": "2024-07-08 15:15", "url": "https://www.harwichandmanningtreestandard.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "domain": "harwichandmanningtreestandard.co.uk", "domain_classification": "Unknown", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9364673809418137, "event_breakdown": "Major Russian missile attack across Ukraine, Kyiv, killed at least 20 people and wounded more than 50 (AP)."}, {"id": "b5d72105-cc49-4cf5-b50f-4d9cf73a2bcf", "title": "Russia targets multiple Ukrainian regions with missiles , drones", "date": "2024-07-08 07:30", "url": "https://www.voanews.com/a/russia-targets-multiple-ukrainian-regions-with-missiles-drones/7688979.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "United Nations Secretary-General António Guterres condemned the attacks, calling the strikes on the Kyiv hospital and on another medical facility in the capital’s Dniprovsky district “particularly shocking,” spokesman Stephane Dujarric said.\nThe United Nations Security Council will meet on Tuesday to discuss the Russian attack, diplomats said.\nRussia's defense ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nThe Russian attack overnight included a fourth Kh-101 missile, as well as two Iskander-M ballistic missiles, the Ukrainian air force said.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.8729549032392103, "event_breakdown": "The Russian Ministry of Defense has confirmed that it launched four Kh-101 air cruise missiles at Ukrainian targets overnight. Alongside the missiles, two Iskander missiles were fired from a Russian aircraft. Ukrainian officials report four different strikes: a maternity and children's hospital in Kyiv struck—with three later reported dead and 16 injured in the attack. In Kharkiv, Ukraine's second largest city, another strike took place at a children's and maternity facility in the city's government district, but no casualties have been reported."}, {"id": "050c1580-5244-4184-86fb-2ad8ad6f6e95", "title": "Jordan Condemns Israeli Targeting Of Displaced Palestinians In Gaza", "date": "2024-07-08 00:00", "url": "https://menafn.com/1108415226/Jordan-Condemns-Israeli-Targeting-Of-Displaced-Palestinians-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) AMMAN, Jul 8 (NNN-PETRA) – Jordan, yesterday, strongly condemned Israel's continued targeting of shelters for displaced Palestinians in the Gaza Strip, referring to the Israeli bombing of a school in central Gaza's Nuseirat camp, a day earlier.\nThis latest Israeli strike on the UN school-converted shelter inflicted at least 16 deaths among the displaced, most of whom were women and children.\nIn a statement, Sufian Qudah, spokesperson for Jordan's Foreign Ministry, stressed the kingdom's absolute condemnation of Israel's continued perpetration of“war crimes” against the Palestinians in Gaza, saying, it reflected Israel's blatant disregard for international law, international humanitarian law, and all human and moral values.\nQudah added that, the Israeli move is also a flagrant challenge to the international call for the cessation of hostilities and the protection of civilians in Gaza.\nThe spokesperson also rebuked Israel's clear intention to continue violence, reject peace, terrorise Gazan residents, and increase their suffering by launching repeated attacks on humanitarian facilities and shelters.", "location": "GAZA STRIP-", "classification": "security", "score": 0.6781904059662003, "event_breakdown": "Target event: Israeli military strikes UN school-converted shelter, killing at least 16 Palestinian displaced civilians."}, {"id": "42081a37-1777-4c00-b637-853a59b8e010", "title": "IDF takes out Hezbollah missile operative", "date": "2024-07-08 12:30", "url": "https://www.israelnationalnews.com/news/392724", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד: צה\"ל חיסל מחבל מיחידת הרקטות של חיזבאללה דובר צה\"לOn Sunday night, an IDF aircraft struck and eliminated Hezbollah terrorist Mustafa Hassan Salman in the area of Qlaileh in southern Lebanon.\n\"The IDF will continue to operate against the threat of the Hezbollah terrorist organization in order to defend the State of Israel,\" a spokesman stressed.\nLast week, the IDF eliminated a senior engineer in Hezbollah's aerial array.\nMeitham also flew to Iran multiple times, where he gained knowledge and assisted in building up the Hezbollah terrorist organization's force and arsenal of Iranian weapons.\n\"His elimination significantly harms the capabilities of Hezbollah's Aerial Defense Unit.\"", "location": "Qlaileh, southern Lebanon", "classification": "security", "score": 0.8388322450478126, "event_breakdown": "IDF eliminates Mustafa Hassan Salman\nIDF eliminates senior engineer in Hezbollah's aerial array"}, {"id": "c85b66b6-2a9b-46aa-99d3-f45644d2f18f", "title": "IDF takes out Hezbollah missile operative", "date": "2024-07-08 15:15", "url": "http://www.israelnationalnews.com/news/392724", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד: צה\"ל חיסל מחבל מיחידת הרקטות של חיזבאללה דובר צה\"לOn Sunday night, an IDF aircraft struck and eliminated Hezbollah terrorist Mustafa Hassan Salman in the area of Qlaileh in southern Lebanon.\n\"The IDF will continue to operate against the threat of the Hezbollah terrorist organization in order to defend the State of Israel,\" a spokesman stressed.\nLast week, the IDF eliminated a senior engineer in Hezbollah's aerial array.\nMeitham also flew to Iran multiple times, where he gained knowledge and assisted in building up the Hezbollah terrorist organization's force and arsenal of Iranian weapons.\n\"His elimination significantly harms the capabilities of Hezbollah's Aerial Defense Unit.\"", "location": "Lebanon", "classification": "security", "score": 0.8388322450478126, "event_breakdown": "IDF aircraft struck and eliminated Hezbollah terrorist Mustafa Hassan Salman in the Qlaileh area in southern Lebanon. The IDF will continue to operate against the threat of the Hezbollah terrorist organization in order to defend the State of Israel."}, {"id": "72c108a1-df5f-4a69-adec-7d44c057ad7a", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 14:30", "url": "https://cbs2iowa.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "Event 1: A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv. Emergency crews are searching the rubble for casualties.\n\nEvent 2: Strikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack."}, {"id": "68d09d1f-35c3-400f-8c3f-4e1c010761e4", "title": "Russian missiles strike Kyiv children hospital , killing at least 31 across Ukraine", "date": "2024-07-08 13:30", "url": "https://wgme.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "domain": "wgme.com", "domain_classification": "Unknown", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.7808635869654761, "event_breakdown": "Current events reported in text that can be placed on a security map are:\n- A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said.\n- One missile struck a large children’s hospital in Kyiv.\n- Strikes in Kryvyi Rih, Zelenskyy's birthplace, killed 10 people and injured 47.\n- An entire section of a residential multistory building in one district of Kyiv was destroyed."}, {"id": "2a2880ec-5fad-44d0-a4c6-fb4170596836", "title": "A Kyiv children hospital is struck by a cruise missile as Russia bombards Ukraine - Medicine Hat NewsMedicine Hat News", "date": "2024-07-08 13:30", "url": "https://medicinehatnews.com/news/world-news/2024/07/08/a-kyiv-childrens-hospital-is-struck-by-a-cruise-missile-as-russia-bombards-ukraine/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "A Kyiv children’s hospital is struck by a cruise missile as Russia bombards UkraineBy Hanna Arhirova And Illia Novikov, The Associated Press on July 8, 2024.\nShare this story:KYIV, Ukraine (AP) – A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a three-day NATO summit in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.", "location": "Kyiv", "classification": "security", "score": 0.5941123660779948, "event_breakdown": "Russian missile attacks in Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a children’s hospital in the capital, Kyiv."}, {"id": "8cf58d73-c28e-4f98-b4df-6935406a313c", "title": "Terrifying Shots : Russian Terrorists Hit Children Hospital In Kyiv", "date": "2024-07-08 14:15", "url": "https://charter97.org/en/news/2024/7/8/602004/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Terrifying Shots: Russian Terrorists Hit Children's Hospital In Kyiv 16 8.07.2024, 11:5814,060Children may still be under the rubble.\nOn the day of July 8, the aggressor country Russia carried out a massive missile attack on Ukraine.\nOne of the strikes hit the building of the Okhmatdet children's hospital in Kyiv.\nChildren may be under the rubble.\nGleb Garanich / Reuters", "location": ")\nKYIV", "classification": "security", "score": 0.9062330277458338, "event_breakdown": "Children may be under the rubble after a Russian strike hit a children's hospital in Kyiv."}, {"id": "42cae18b-0210-4254-9e2a-1903a82d6b9f", "title": "Hezbollah says strikes Israeli mountain base in  largest  air operation -- China Economic Net", "date": "2024-07-08 05:00", "url": "http://en.ce.cn/main/latest/202407/08/t20240708_39063049.shtml", "domain": "en.ce.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 7 (Xinhua) -- Hezbollah said Sunday it attacked with drones at Israel's technical and electronic reconnaissance center in Mount Hermon, north of annexed Golan Heights, in response to Israel's killing of a senior Hezbollah member a day earlier.\nThe well-equipped center was set on fire, and its targeted devices were destroyed in the air attack by \"successive squadrons of assault drones,\" the Lebanese military group said in a statement.\nLebanese military sources told Xinhua that the Lebanese army positions monitored the launch of several drones Sunday afternoon from the Lebanese side to Israel, some of which had been intercepted by the Iron Dome system and Israeli warplanes.\nThe Israeli side has yet to respond to Hezbollah's announcement, which came a day after the Israeli military killed Hezbollah commander Maysam Al-Attar in a drone strike on the city of Baalbek, eastern Lebanon.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with a surprise attack by Gaza-ruling Palestinian faction Hamas into Israel the day before.", "location": "Mount Hermon", "classification": "security", "score": 0.9695581704736873, "event_breakdown": "Hezbollah attacks Israel's technical and electronic reconnaissance center in Mount Hermon in Lebanon."}, {"id": "5346b4e8-d9c2-4bbe-867a-2d00af71cbe0", "title": "Russian Air Strike Hits Children Hospital In Kyiv", "date": "2024-07-08 11:00", "url": "https://www.rferl.org/a/russian-air-strike-hits-children-hospital-in-kyiv/33026303.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "A children's hospital in the Ukrainian capital, Kyiv, has been damaged following a Russian missile attack, authorities said.\nThere were no immediate reports of injuries or deaths.\nPeople, including children, may still be trapped in the rubble.\nA video taken by RFE/RL's Serhiy Nuzhnenko at the site showed lines of people helping to clear the debris as smoke billowed out of the facility.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.43484481734970637, "event_breakdown": "Target Event:\nA children's hospital in the Ukrainian capital, Kyiv, has been damaged following a Russian missile attack, authorities said. There are no immediate reports of injuries or deaths."}, {"id": "e3391fa9-59f9-416a-a412-683a86d8e1a0", "title": "Two stabbings in Rochester overnight", "date": "2024-07-08 12:15", "url": "https://13wham.com/news/local/2-stabbings-in-rochester-overnight", "domain": "13wham.com", "domain_classification": "Unknown", "message": "Rochester, N.Y. — Two victims, including a teenager, are being treated for stab wounds in the city overnight.\nAround 11:55 p.m. Sunday, police discovered a 42-year-old stabbing victim at Portland Avenue near Council Street.\nAbout 20 minutes later, officers located a 14-year-old stabbing victim at Parsells Avenue near Greeley Street.\nBoth stabbing victims were taken to Strong Memorial Hospital with non-life-threatening injuries.\nAnyone with information is asked to call 911 or Crime Stoppers at 423-9300.", "location": "Rochester, New York", "classification": "security", "score": 0.9041071260921305, "event_breakdown": "Event: Two victims, including a 14-year-old, were stabbed in Rochester, N.Y. overnight. The victims were treated for stab wounds at Strong Memorial Hospital."}, {"id": "3dcbf1a8-820a-40e2-bfdd-7901c9cbb5bc", "title": "Now Putin Is Attacking Ukraine Biggest Children Hospital", "date": "2024-07-08 12:00", "url": "https://www.yahoo.com/news/now-putin-attacking-ukraine-biggest-105435549.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine’s largest children’s medical center was pummeled by Russian missile attacks Monday, leaving sick children covered in blood in the aftermath of the attack.\nOn Telegram, footage from the Okhmatdyt Children’s Hospital showed a young child drenched in blood and soot and held by a woman also covered in blood.\nA video on Telegram showed a partially collapsed wing of the hospital, with pieces of glass and spots of blood covering the floor.\nIn another, the outside of a hospital building appeared to be left in ruins, with debris scattered and smoke filling the air.\nKyiv’s Okhmatdyt Children’s Hospital was an early site of horrors during the war.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.4987099072307763, "event_breakdown": "Russia has conducted several air strikes on Ukrainian cities, including military facilities, residential buildings, and other civilian infrastructure."}, {"id": "40f6ab14-d099-402d-87a4-4bbd52573e6b", "title": "Gaza rescuers say Israeli strike on school kills four", "date": "2024-07-08 07:00", "url": "https://thepeninsulaqatar.com/article/08/07/2024/gaza-rescuers-say-israeli-strike-on-school-kills-four", "domain": "thepeninsulaqatar.com", "domain_classification": "Unknown", "message": "Palestinians walks on the rubble and debris of the Latin Patriarchate Holy Family School after it was hit on July 7, 2024.\nIsrael's military said it hit ‘the area of the school’ in Gaza City, adding the school complex was used as a Hamas hideout.\nThe Latin Patriarchate of Jerusalem, which owns the school, said hundreds of civilians had taken shelter there since the start of the war.\nGaza authorities said at least 16 people were killed and 75 injured in an Israeli strike on a UN-run school Saturday.\nAnother school hit,\" Philippe Lazzarini, head of UNRWA, posted on social media platform X on Sunday.", "location": "Gaza City", "classification": "security", "score": 0.7775264129620492, "event_breakdown": "Target Event:\nOn Saturday, July 7, 2024, Israel's military said it hit an area of the school complex in Gaza City, saying the site was used as a Hamas hideout."}, {"id": "fd99b6bd-33d5-4fc8-a252-af6a35efc683", "title": "PALI LEHOHLA | Data revolution : the battle is on to make the  new oil  work for Africans", "date": "2024-07-08 05:00", "url": "https://www.timeslive.co.za/sunday-times-daily/opinion-and-analysis/2024-07-07-pali-lehohla--data-revolution-the-battle-is-on-to-make-the-new-oil-work-for-africans/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device.", "location": "Based on the text provided, I could not identify a specific location where the main event takes place.", "classification": "security", "score": 0.9467275457272956, "event_breakdown": "Target event is not set"}, {"id": "b07e9125-9eda-4c82-be9f-86ba8f3c4697", "title": "Russian Army Loses Another 1 , 200 Troops And Aircraft In Ukraine", "date": "2024-07-08 06:00", "url": "https://menafn.com/1108415747/Russian-Army-Loses-Another-1200-Troops-And-Aircraft-In-Ukraine", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The total combat losses of Russian in Ukraine from 24 February 2022 to 8 July 2024 amounted to about 552,190 people, including 1,200 people in the last 24 hours.\nThis is stated on the page of the General Staff of the of Ukraine, Ukrinform reports.\nThe Defence Forces also destroyed 8,171 (+16) Russian tanks, 15,685 (+40) armoured combat vehicles, 14,966 (+29) artillery systems, 1,115 (+0) MLRS, 880 (+1) air defence systems, 361 (+1) aircraft, and 326 (+0) helicopters, Operational and tactical UAVs - 11,893 (+31), cruise missiles - 2,353 (+1), ships/boats - 28 (+0), submarines - 1 (+0), vehicles and tankers - 20,150 (+47), special equipment - 2503 (+8).\nGlobal campaign to raise funds for 100 attack drones forlaunchesThe data is being updated.\nAs Ukrinform reported earlier, anti-aircraft warriors of the separate mechanised brigade named after Lieutenant General Marko Bezruchko shot down a Russian Su-25 in the Pokrovske sector of Donetsk region.", "location": ".\nKyiv region.", "classification": "security", "score": 0.4724713420606174, "event_breakdown": "Three Ukrainian tanks were damaged in battle in the city of Sievierodonetsk, Luhansk region.\nThe Donetsk, Russian border guards claim that they are attacked by Ukrainian artillery in Rostov region.\nThere are no reported security events in the current time frame that match the specified criteria."}, {"id": "e0f6da56-8516-4448-bdd2-3f25117b82cb", "title": "USNI News Fleet and Marine Tracker : July 8 , 2024", "date": "2024-07-08 19:15", "url": "https://news.usni.org/2024/07/08/usni-news-fleet-and-marine-tracker-july-8-2024", "domain": "news.usni.org", "domain_classification": "Unknown", "message": "The “Wolf Pack” of Helicopter Maritime Strike Squadron (HSM) 75 – MH-60R – from Naval Air Station North Island, Calif.\nUSS John S. McCain (DDG-56), homeported at Naval Station Everett, Wash.USS Halsey (DDG-97), homeported at Naval Station San Diego, Calif.USS Daniel Inouye (DDG-118), homeported at Naval Station Pearl Harbor, Hawaii.\nThe “Rawhides” of Fleet Logistics Support Squadron (VRC) 40 – C-2A – from Naval Air Station Norfolk.\nUSS Gravely (DDG-107), homeported at Naval Station Norfolk, Va.USS Mason (DDG-87), homeported at Naval Station Mayport, Fla.\nPATFORSWA deploys Coast Guard personnel and ships with U.S. and regional naval forces throughout the Middle East.", "location": "Based on the provided information, it appears that the primary focus of this event is the Naval Station Everett, Washington,", "classification": "security", "score": 0.9397124450071904, "event_breakdown": "1. Strait of Hormuz security incidents: On June 20, 2022, the U.S. Maritime Administration (MARAD) reported a possibility of a security incident within the Strait of Hormuz. This Strait connects the Persian gulf with the Gulf of Oman and is approximately 25 miles wide at its narrowest point. Iran has threatened to close the Strait of Hormuz if there is retaliation for sanctions imposed on it. The target event is the current heightened threat of military confrontation in this region. This event could be mapped as happening within the Strait of Hormuz.\n2. Preemptive missile launch test: North Korea claimed to have successfully tested multiple advanced short-range ballistic missiles off its east coast on Wednesday, June 15. They were fired to the northeast and deliberately avoided violating North Korea’s neighbor, South Korea. The target event is the current missile testing that is happening in North Korea and was tested on June 20th and June 22nd from their east coast. This event could be mapped on the east coast of North Korea.\n3. Missile test in Mediterranean Sea: The Israeli Air Force held two days of drills that include drills of dropping bombs, firing missiles and simulating dogfights, to some 2,000 personnel. The drill involved thousands of personnel from the IAF, the military police, the intelligence corps, and Israel’s defense industries and cyber organizations. On Monday, June 20, 2022, Israeli Air Force conducted drills in the Mediterranean Sea simulating aerial combat. Some of these drills included the launch of a version of the “"}, {"id": "c40a87c9-71c7-4957-b6e1-43f80eefb781", "title": "China and Belarus conduct joint military exercises right next to NATO and EU border - LocalNews8 . com", "date": "2024-07-08 17:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/07/08/china-and-belarus-conduct-joint-military-exercises-right-next-to-nato-and-eus-border/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Isaac Yee and Ivana Kottasová, CNN(CNN) — China and Belarus announced they were holding joint military training exercises just miles from the border of Poland – a NATO and European Union member.\nBelarus’ Ministry of Defense said troops from China’s People’s Liberation Army arrived in Belarus over the weekend.\nThe exercises are taking place near the Belarus city of Brest on the Belarus-Poland border which is around 130 miles from the Polish capital of Warsaw and some 40 miles from Minsk’s border with Ukraine.\nMoscow partly used Belarus as a launching pad for the full-scale invasion of Ukraine in February 2022 after amassing troops on the Ukrainian border during what it said were joint military exercises.\nThe Chinese troops arrived in Belarus just days after that country joined the Shanghai Cooperation Organization (SCO) on Thursday.", "location": "Brest, Belarus", "classification": "security", "score": 0.5945287224055208, "event_breakdown": "Target Event:\nChina and Belarus announced they were holding joint military training exercises just miles from the border of Poland - a NATO and European Union member."}, {"id": "21be447f-761b-4fdc-a8fc-ec7d29dcb9fd", "title": "Calcutta High Court Directs RPF To Increase Vigilance To Deal With  Menace  Of Male Passengers In  Female - Only  Train Compartments", "date": "2024-07-08 12:15", "url": "https://www.livelaw.in/high-court/calcutta-high-court/calcutta-high-court-directs-rpf-to-increase-vigilance-to-deal-with-menace-of-male-passengers-in-female-only-train-compartments-262628", "domain": "livelaw.in", "domain_classification": "Unknown", "message": "The Calcutta High Court has recently directed the Railway Police Force (RPF) to conduct more frequent inspection drives in order to combat the menace of male passengers travelling in train compartments exclusively reserved for women.\nA division bench of Chief Justice TS Sivagnanam and Justice Hiranmay Bhattacharya also directed for public announcements to be made that anyone travelling in female compartments unauthorisedly would be prosecuted.\nThese observations came in a PIL filed by a practising advocate who submitted that unauthorized male passengers were boarding and travelling in the compartments reserved exclusively for female passengers.\nIt was stated that there had been various instances where the male passengers boarded the compartments reserved exclusively for female passengers untoward incidents had occurred.\nIn reply, the RPF submitted that it would carry out inspection drives in order to combat this problem and that it had also arrested almost 3,477 people who were found to be unauthorisedly travelling in the female compartments.", "location": "CALCUTTA, WEST BENGAL", "classification": "security", "score": 0.6617798576328631, "event_breakdown": "1. Calcutta High Court directs Railway Police Force to conduct more frequent inspection drives in order to combat the menace of male passengers travelling in train compartments exclusively reserved for women.\n2. A division bench of Chief Justice TS Sivagnanam and Justice Hiranmay Bhattacharya also directs for public announcements to be made that anyone travelling in female compartments unauthorisedly will be prosecuted."}, {"id": "f0722947-9b6e-433e-9604-494b86a10f91", "title": "China and Belarus conduct joint military exercises right next to NATO and EU border", "date": "2024-07-08 17:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/08/china-and-belarus-conduct-joint-military-exercises-right-next-to-nato-and-eus-border/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — China and Belarus announced they were holding joint military training exercises just miles from the border of Poland – a NATO and European Union member.\nBelarus’ Ministry of Defense said troops from China’s People’s Liberation Army arrived in Belarus over the weekend.\nThe exercises are taking place near the Belarus city of Brest on the Belarus-Poland border which is around 130 miles from the Polish capital of Warsaw and some 40 miles from Minsk’s border with Ukraine.\nMoscow partly used Belarus as a launching pad for the full-scale invasion of Ukraine in February 2022 after amassing troops on the Ukrainian border during what it said were joint military exercises.\nThe Chinese troops arrived in Belarus just days after that country joined the Shanghai Cooperation Organization (SCO) on Thursday.", "location": "Brest, Belarus", "classification": "security", "score": 0.5945287224055208, "event_breakdown": "Chinese troops arrived in Belarus over the weekend, where they will participate in joint military training exercises near the Belarus city of Brest on the Belarus-Poland border, just miles from the Polish capital of Warsaw."}, {"id": "2c04794a-284d-4aac-89ba-3399bc2d552e", "title": "Israel allows journalists inside Rafah for first time since troops invaded . This is what they found", "date": "2024-07-08 09:45", "url": "https://www.independent.co.uk/news/world/middle-east/rafah-gaza-israel-palestine-idf-b2575828.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Bedrooms and kitchens are visible from roads dotted with rubble piles that tower over the Israeli military vehicles passing by.\nThe Israeli military invited reporters into Rafah on Wednesday, the first time international media visited Gaza's southernmost city since it was invaded May 6.\nIsraeli soldiers gather in the southern Gaza Strip, Wednesday, July 3, 2024 ( Copyright 2024 The Associated Press.\nBefore invading Rafah, Israel said Hamas' four remaining battalions had retreated there, an area of about 25 square miles (65 square kilometers) that borders Egypt.\nIsraeli soldiers gather in the southern Gaza Strip, Wednesday, July 3, 2024 ( Copyright 2024 The Associated Press.", "location": "GAZA", "classification": "security", "score": 0.9454763241182162, "event_breakdown": "Event 1: Israeli forces entered Gaza's southern city of Rafah on May 6, 2024. It was the first time international media visited since the city's invasion.\nEvent 2: The Israeli military invited reporters into Rafah on Wednesday, July 3, 2024.\nEvent 3: Israeli soldiers gathered in southern Gaza Strip on Wednesday, July 3, 2024."}, {"id": "f3022d99-79a3-4d72-88f9-c83408d3daef", "title": "Carson City Nevada News - Carson Now | Your one stop for Carson City news", "date": "2024-07-08 00:45", "url": "https://www.carsonnow.org/?page=4&search_theme_form=Fuji%2525252520Park%2525252520craft%2525252520fair%2525252520", "domain": "carsonnow.org", "domain_classification": "Unknown", "message": "Every year throughout our region, pets are found dead in cars due to heat exhaustion, including those with windows cracked.\nWith outside temperatures often in the 90s and above, internal car temperatures can reach anywhere from 114 degrees after 10 minutes, to 140 degrees after an hour.\nCracking a window often does nothing at all as rolling down the windows has been shown to have little effect on the temperature inside a car, according to the Humane Society of the U.S.", "location": "ODESSA", "classification": "security", "score": 0.8949121336044727, "event_breakdown": "Target event not found"}, {"id": "05bdfaad-8b05-4047-bffc-c536313f8b0c", "title": "The mystery of Haiti missing cultural artefacts", "date": "2024-07-08 07:30", "url": "https://www.yahoo.com/news/mystery-haiti-missing-cultural-artefacts-061725948.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Cultural artefacts have been stolen from Haiti, wracked by gang violence.\nThe Citadelle Laferrière, commonly known as La Citadelle, is a large early 19th-century fortress located in Milot in Nord, Haiti.\nDaniel Elie, the former head of ISPAN, sees the cannons’ disappearance as the latest assault on Haiti’s cultural history.\nEarlier this year, amid the deadly gang violence in Port-au-Prince, armed groups looted and ransacked the National Library in their bid to topple the government.\nHector Adolfo Quintanar Perez/ZUMA Press Wire/dpaHaitian police officers patrol a neighbourhood near the national palace, as Port-au-Prince is plagued by deadly gang violence.", "location": "Haiti.", "classification": "security", "score": 0.8341727547211631, "event_breakdown": "The Citadelle Laferrière, commonly known as La Citadelle, is a large early 19th-century fortress located in Milot in Nord, Haiti. \nDaniel Elie, the former head of ISPAN, sees the cannons’ disappearance as the latest assault on Haiti’s cultural history.\nEarlier this year, amid the deadly gang violence in Port-au-Prince, armed groups looted and ransacked the National Library in their bid to topple the government."}, {"id": "82f2afe2-1cf4-49f5-807d-f7d6c4c64a5f", "title": "Shadow campaign : Global influence op targets Qatar in wartime", "date": "2024-07-08 07:15", "url": "https://www.tuko.co.ke/business-economy/technology/554424-shadow-campaign-global-influence-op-targets-qatar-wartime/", "domain": "tuko.co.ke", "domain_classification": "Unknown", "message": "'Radioactive'The campaigns, which look well-resourced, appear designed to rile up sentiment against Qatar across the United States, Britain and European Union.\nAnother site -- \"It's in your hands\" (IIYH) -- targets Qatar's queen mother, Sheikha Moza bint Nasser, accusing her country of supporting terrorists and criticizing her for failing to secure the release of Israeli hostages held in Hamas-run Gaza.\nThe queen mother has no official role in the emirate's mediation efforts.\nThe IIYH logo also popped up offline, appearing in February in an ad targeting the queen mother at New York's Times Square.\nFake petitionThe IIYH website links to a change.org petition targeting Qatar's queen mother.", "location": "Based on the text, it is not possible to determine a specific location for the event.", "classification": "security", "score": 0.8713080990495677, "event_breakdown": "Radioactive: Campaigns target Qatar's UK activities"}, {"id": "38dd3910-0e0a-4423-816f-4561e2bb8674", "title": "Shadow campaign : Global influence op targets Qatar in wartime", "date": "2024-07-08 06:30", "url": "https://www.digitaljournal.com/social-media/shadow-campaign-global-influence-op-targets-qatar-in-wartime/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "The sprawling anti-Qatar campaign illustrates the ease with which an entire country can be tarnished in the age of disinformation.\n– ‘Radioactive’ –The campaigns, which look well-resourced, appear designed to rile up sentiment against Qatar across the United States, Britain and European Union.\nThe queen mother has no official role in the emirate’s mediation efforts.\nThe IIYH logo also popped up offline, appearing in February in an ad targeting the queen mother at New York’s Times Square.\n– Fake petition –The IIYH website links to a change.org petition targeting Qatar’s queen mother.", "location": "New York, USA", "classification": "security", "score": 0.5752633463641162, "event_breakdown": "1. On Tuesday, April 26, 2022, a terrorist attack on the Regional Headquarters of the Nigeria Police"}, {"id": "780e9bc7-5cc3-4be7-915a-e59f8ec349c1", "title": "Moldova , Romania and Ukraine sign agreement to combat Russian disinformation", "date": "2024-07-08 07:00", "url": "https://actmedia.eu/daily/moldova-romania-and-ukraine-sign-agreement-to-combat-russian-disinformation/109344", "domain": "actmedia.eu", "domain_classification": "Unknown", "message": "Moldova, Romania and Ukraine sign agreement to combat Russian disinformationMonday, July 8, 2024 ShareMoldova, Romania and Ukraine have signed an agreement on joint cooperation to combat Russian disinformation.\nThe joint agreement was signed during a tripartite meeting of the foreign ministers of the three countries in the Moldovan capital, Chisinau, on July 5.\nThe meeting between Kulebas and the foreign ministers of Moldova and Romania, Mihai Popsoi and Luminita Odobescu, respectively, was the third between them since 2022.\nThe Kremlin denied claims that it was spreading disinformation and accused the West of engaging in \"information terrorism\".\nThe West has taken harsh sanctions against it, while it is helping Ukraine with weapons.", "location": "CHISINAU", "classification": "security", "score": 0.5566134593539177, "event_breakdown": "Meetings between Ukrainian and Moldovan foreign ministers\nMoldova, Romania and Ukraine sign agreement to combat Russian disinformation"}]