[{"id": "18130a98-7f69-48ea-bc10-d936c1f633ab", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354779.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes kill scores of Russian troops\n- UK Defense Ministry estimates 450,000 Russian troops killed or wounded\n- Attack kills more than 100 Russian soldiers\n- Russians killed while training on Dzharylhach island\n- Ukrainian upload footage of HIMARS strike on a sandbar"}, {"id": "53dfd67b-b307-4d3c-9f1f-1701e3baf858", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354241.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach Island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes kill scores of Russian troops\n- UK Defense Ministry estimates 450,000 Russian troops killed or wounded since the conflict began\n- Attack kills over 100 Russian soldiers in a single strike\n- Russians killed while training on Dzharylhach island\n- Ukraine uploads footage of HIMARS strike on sandbar on Dzharylhach island"}, {"id": "0056563f-d855-4969-a64b-31088b1a101d", "title": "Australian police shoot dead  radicalised  teenager after knife attack in Perth", "date": "2024-05-05 05:00", "url": "https://www.scmp.com/news/asia/australasia/article/3261462/australian-police-shoot-dead-radicalised-teenager-after-knife-attack-perth", "message": "The teenager “rushed” at police who responded by shooting him twice with tasers before firing a single fatal shot, they said.\nWestern Australian police shot and killed a “radicalised” 16-year-old boy with a knife who stabbed a man in a Perth car park, police and the state premier said on Sunday.\nPolice body camera images showed the teenager refused officers’ demands that he put down the knife, the police chief said.\n03:14 Authorities rule out terrorism in deadly Sydney knife attack Authorities rule out terrorism in deadly Sydney knife attackPolice believe the teenager sent “relevant messages” to some members of the Muslim community who immediately called police, he said, without giving details of the messages.\nTwo days after the mall attack an Assyrian Christian bishop was brutally stabbed during a live streamed service in western Sydney.", "location": "Perth", "classification": "security", "score": 0.8303601596936979, "event_breakdown": "- A teenager rushed at police who responded by shooting him with tasers before firing a fatal shot in an unspecified location.\n- Western Australian police shot and killed a radicalised 16-year-old boy with a knife who stabbed a man in a Perth car park, according to police and the state premier.\n- Police body camera images showed the teenager refusing officers' demands to put down the knife, as stated by the police chief.\n- Authorities ruled out terrorism in a deadly Sydney knife attack at 03:14.\n- Police believed the teenager sent relevant messages to some members of the Muslim community who immediately called the police without specifying the content of the messages.\n- Two days after the mall attack, an Assyrian Christian bishop was brutally stabbed during a live-streamed service in western Sydney."}, {"id": "6f2e99f8-3a66-4556-a379-1022ba5e5379", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say", "date": "2024-05-03 10:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "- \"My soul is gone.\" - Shahed and 10 other children killed in an attack on April 16 in Gaza.\n- Analysis by a freelance journalist suggesting Israeli military responsibility for the attack.\n- Israeli military's shifting response and lack of providing additional evidence to back up claims."}, {"id": "fa11f4a9-ae0d-4a4e-97e2-4fcfa65f2a02", "title": "Police in Australia shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 07:30", "url": "https://www.yahoo.com/news/police-australia-shoot-boy-dead-062748293.html", "message": "The car park in Perth where the stabbing and shooting occurred - Australian Broadcasting Corporation vi APPolice in Western Australia have shot dead a boy after he stabbed a man in Perth, in an attack authorities said indicated terrorism.\nThe apparently random attack, in the car park of a hardware store in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nState Police Commissioner Col Blanch said when police were called to the car park, the youth lunged at officers with the knife and was shot.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton, Perth, Western Australia", "classification": "security", "score": 0.9039307365082059, "event_breakdown": "- Stabbing and shooting incident at a car park in Perth\n- Police shoot dead a boy after he stabs a man in the car park in Willetton, Perth\n- Authorities suggest the attack has \"hallmarks\" of terrorism but not yet declared as a terrorist act\n- The youth, armed with a knife, lunges at officers and gets shot\n- Western Australia Premier Roger Cook states that the attacker acted alone\n- The incident occurs shortly after a stabbing spree that killed six people in Bondi, Sydney."}, {"id": "f667ff32-caca-453a-bdb7-6e3235daa45d", "title": "Australian police shoot 16 - year - old boy dead after stabbing", "date": "2024-05-05 05:00", "url": "https://www.theglobeandmail.com/world/article-australian-police-shoot-16-year-old-boy-dead-after-stabbing/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThere were signs the 16-year-old, armed with a kitchen knife, had been radicalized online, state authorities said, adding they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised news conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.42508576033814766, "event_breakdown": "- A boy was shot dead by Australian police after stabbing a man in Willetton, Perth.\n- The 16-year-old attacker had signs of being radicalized online and the attack had indications of terrorism.\n- Concerned members of the local Muslim community had contacted state authorities before the attack.\n- The attacker acted alone according to Western Australia Premier Roger Cook.\n- The attack occurred late on Saturday night in Willetton, but it was not declared a terrorist act.\n- Days prior to this incident, a stabbing spree killed six people in Bondi, Sydney."}, {"id": "306341e7-6e21-430a-add5-e7238489e314", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "- Two Nigerian military officers to face court martial over drone strike that killed civilians in northwest Kaduna State\n- The drone strike accidentally struck a village, killing at least 85 civilians during a Muslim festival celebration\n- The Nigerian military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest\n- The military conducted an investigation into the incident and initiated disciplinary action against those responsible\n- The United Nations human rights office reported that the drone strike was one of at least four airstrikes since 2017 that caused significant civilian fatalities"}, {"id": "72896891-0921-4601-aa21-24db5745fe10", "title": "IDF eliminates top PIJ commander who helped carry out October 7 attacks", "date": "2024-05-04 21:00", "url": "https://www.jpost.com/breaking-news/article-799817", "message": "A joint attack by the IDF and the Shin Bet (Israel Security Services) killed one of the top commanders of the Palestinian Islamic Jihad (PIJ), the IDF announced on Saturday.\n(credit: IDF SPOKESPERSON'S UNIT)The terrorist, Imam Zerev, was killed by Israel Air Force fighter jets in southern Gaza.\nIDF kills Imam Zerev in southern Gaza.\n(Credit: IDF Spokesperson's Unit).\nTwo other terrorists from PIJ were killed in the same air strike.", "location": "southern Gaza", "classification": "security", "score": 0.9793338893332181, "event_breakdown": "- Joint attack by IDF and Shin Bet kills top PIJ commander Imam Zerev in southern Gaza\n- IDF announces killing of terrorist Imam Zerev by Israel Air Force fighter jets\n- Two other PIJ terrorists killed in the same air strike"}, {"id": "9cf09a6e-7efd-4e6c-a759-cbe3bea0e99c", "title": "Russo - Ukraine War - 04 May 2024", "date": "2024-05-05 06:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-04.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nLyman axis: the Ukrainian Defense Forces repelled 7x attacks in the vicinities of Serebryans'ke forestry (Luhansk oblast), Terny (Donetsk oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Nevs'ke (Luhansk oblast), Terny, Yampolivka, Tors'ke (Donetsk oblast).\nKherson axis: Russia does not abandon its intention to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River.", "location": "Serebryans'ke (Luhansk oblast)", "classification": "security", "score": 0.8355880818225166, "event_breakdown": "- On 24 February 2022, Ukraine was attacked by land, naval, and air forces of Russia, sparking the largest European war since the Great Patriotic War.\n- Ukrainian Defense Forces repelled 7 attacks near Serebryans'ke forestry in Luhansk oblast and Terny in Donetsk oblast.\n- Russian forces fired artillery and mortars at more than 10 settlements, including Nevs'ke in Luhansk oblast, Terny, Yampolivka, and Tors'ke in Donetsk oblast.\n- Russia continued its efforts to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River in the Kherson axis."}, {"id": "b4cfe442-5dba-4302-a607-62a816555a8b", "title": "Explosion at DRC displaced person camp kills at least 9", "date": "2024-05-03 19:00", "url": "https://www.voanews.com/a/explosion-at-drc-displaced-persons-camp-kills-at-least-9-/7596984.html", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at the Mugunga displaced persons camp in Goma reported by DRC journalist Daniel Michombero\n- At least nine people killed, most of them children, following explosion(s) at the displaced persons camp in Goma\n- Witnesses and local officials witness nine bodies and at least 20 wounded at the scene\n- Local hospital receives 32 wounded and four bodies from the incident\n- DRC government spokesman Patrick Muyaya blames the Rwandan army and M23 rebels for the attack"}, {"id": "3948d721-890e-40cb-a1d1-d7feba5a17d0", "title": "Explosion at DRC displaced person camp kills at least 9 - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-04 16:30", "url": "https://www.newdelhitimes.com/explosion-at-drc-displaced-persons-camp-kills-at-least-9/", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at the Mugunga displaced persons camp in Goma, Democratic Republic of Congo\n- At least nine people, mostly children, killed in the explosion\n- At least 20 people wounded in the explosion\n- Local hospital receiving 32 wounded and four bodies\n- Accusation by DRC government spokesman Patrick Muyaya blaming the Rwandan army and M23 rebels for the attack"}, {"id": "a3491799-12e7-4fee-9c2d-3edd191480d0", "title": "Terror strikes IAF convoy in J & K , one soldier dead", "date": "2024-05-04 23:45", "url": "https://www.dailypioneer.com/2024/page1/terror-strikes-iaf-convoy-in-j-k--one-soldier-dead.html", "message": "The attack occurred near Shashidhar when the convoy vehicles were moving towards Sanai Top in the district's Surankote area.\nFive Indian Army personnel including two officers were \"killed in action\" in the Kalakote forest area of Rajouri on November 22.\nTwo terrorists, including a top commander of LeT identified as Quari, were also killed in the two-day long gunfight.\nQuari was said to be the mastermind behind several attacks, including the killing of 10 civilians and five Army personnel in the district.\nIn May last year, five more Army personnel were killed and a major-rank officer was injured in Chamrer forest during an anti-terrorist operation.", "location": "Rajouri", "classification": "security", "score": 0.9852075559671105, "event_breakdown": "- Attack near Shashidhar as convoy vehicles moved towards Sanai Top in Surankote area.\n- Five Indian Army personnel, including two officers, killed in action in Kalakote forest area of Rajouri on November 22.\n- Two terrorists, including top LeT commander Quari, killed in two-day long gunfight.\n- Quari, mastermind behind several attacks, including killing of 10 civilians and five Army personnel in the district.\n- In May last year, five more Army personnel killed and a major-rank officer injured in Chamrer forest during anti-terrorist operation."}, {"id": "b06bbcf9-b94a-48c6-9729-b6edb517bc46", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Khuzdar", "classification": "security", "score": 0.982317040954408, "event_breakdown": "- Journalist and 2 others killed in a remote-controlled blast in Khuzdar\n- Blast occurred on Sultan Ibrahim Khan Road on National Highway\n- Mohammad Siddiq Mengal, journalist and president of Khuzdar Press Club, targeted in the attack\n- The journalist's vehicle was hit while he was traveling from home to the university\n- Killed passers-by seriously injured and brought to the hospital\n- Eight other injured individuals receiving treatment in different hospitals."}, {"id": "e9c5c896-1499-4226-9ab2-79a100e4cf09", "title": "Islamic Jihad commander killed in Rafah : Israeli Army", "date": "2024-05-05 06:15", "url": "https://www.dailyexcelsior.com/islamic-jihad-commander-killed-in-rafah-israeli-army/", "message": "Jerusalem, May 5: The Israel Defense Forces (IDF) announced on Saturday that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the Oct. 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, said the IDF in a statement.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for a combat in the southern Gaza Strip against the Israeli military, according to the statement.\nAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.", "location": "Rafah", "classification": "security", "score": 0.978502275377178, "event_breakdown": "- Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on Rafah, Gaza\n- Zaarab directed the Islamic Jihad’s elite forces during the Oct. 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip\n- Two other Islamic Jihad operatives were killed during the same strike"}, {"id": "b335e5ac-064e-48d5-ac3a-3aba8c4a33d9", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Syrian defence ministry claimed 8 Syrian soldiers were injured in an Israeli airstrike near Damascus.\n- The Times of Israel, citing Syrian state-run broadcaster, reported the strike caused \"material losses.\"\n- Israeli warplanes launched missiles from over the Golan Heights at a site near the capital, as per the Syrian defence ministry via the Syrian Arab News Agency.\n- Russian state media TASS quoted Dubai-based Al Hadath TV stating that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport."}, {"id": "c2d98ef5-0f33-40d5-a656-626110f2effa", "title": "Islamic Jihad commander killed in Rafah : Israeli army", "date": "2024-05-05 06:15", "url": "https://www.thestatesman.com/world/islamic-jihad-commander-killed-in-rafah-israeli-army-1503297279.html", "message": "The Israel Defense Forces (IDF) has announced that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the October 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, the IDF was quoted as saying on Saturday by Xinhua news agency.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for combat in the southern Gaza Strip against the Israeli military, according to the IDF statement.\nAdvertisementAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.", "location": "Rafah", "classification": "security", "score": 0.9772831996242826, "event_breakdown": "- Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike in Rafah, southern Gaza.\n- Zaarab directed the Islamic Jihad's elite forces during an attack on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip.\n- Zaarab had commanded and directed several attacks and led preparations for combat in the southern Gaza Strip.\n- Two other Islamic Jihad operatives were also killed in the airstrike."}, {"id": "c33979f6-582b-4cad-bf4e-a60c6d4aaf95", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\n- Military training ground hit by multiple explosions typical of an ATACMS strike captured by a drone.\n- Footage shows the training ground as a target of the recent attack.\n- Hundreds of flashes of smoke seen erupting over the area where Russian soldiers were present, believed to be M74 APAM mini-bombs detonating and killing many troops."}, {"id": "43c673a3-e18c-4276-8d1f-29db0a10093d", "title": "N Korea plotting attacks on embassies , Seoul says", "date": "2024-05-03 19:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/04/2003817373", "message": "N Korea plotting attacks on embassies, Seoul saysAFP, SEOULSouth Korea’s spy agency yesterday said that Pyongyang was plotting “terrorist” attacks targeting Seoul’s officials and citizens overseas, with the South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries.\nNorth Korean leader Kim Jong-un, right, visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang on Friday.\nAs a result, the North may be “plotting retaliation” against South Korean embassy staff on such pretenses, NIS added.\nThis marked the highest number of defections by North Korean elites to the South since 2017, Seoul said.\nThe consul, also an intelligence agent, had been monitoring Pyongyang’s illicit activities, including drug trafficking and the production of counterfeit banknotes, according to South Korean reports.", "location": "Pyongyang", "classification": "security", "score": 0.4236494391586273, "event_breakdown": "- N Korea plotting attacks on embassies, Seoul raises alert level\n- NIS warns of possible retaliation against South Korean embassy staff \n- High number of defections by North Korean elites to the South since 2017 \n- South Korean consul in N. Korea monitored illicit activities, reports say"}, {"id": "45ed8b36-2f42-41a2-a967-78c42d2606e3", "title": "Israeli forces kill Hamas gunmen in overnight raid near West Bank Tulkarm", "date": "2024-05-05 06:15", "url": "https://www.deccanherald.com/world/israeli-forces-kill-hamas-gunmen-in-overnight-raid-near-west-banks-tulkarm-3008337", "message": "Hamas, the Islamist group which Israel has been fighting in Gaza, had also been building its fighting network in the West Bank before the start of the war.\nDuring the raid, the Israeli army levelled a two-storey house with a bulldozer in an operation that lasted more than 12 hours.\nAccording to Palestinian Health Ministry records, nearly 500 Palestinians have been killed by Israeli forces or Jewish settlers in the West Bank or East Jerusalem since Oct. 7.\nPalestinians want the West Bank and Gaza, which Israel captured in the 1967 Middle East war, as the core of an independent state with East Jerusalem as its capital.\nMore than 34,000 Palestinians have been killed in Israel's seven-month-old assault on the Gaza Strip, say health officials in the Hamas-ruled enclave.", "location": "West Bank", "classification": "security", "score": 0.8533481235865251, "event_breakdown": "- Hamas building its fighting network in the West Bank\n- Israeli army leveling a two-storey house with a bulldozer during a raid\n- Nearly 500 Palestinians killed by Israeli forces or Jewish settlers in the West Bank or East Jerusalem since Oct. 7\n- Palestinians seeking the West Bank and Gaza for an independent state with East Jerusalem as its capital\n- Over 34,000 Palestinians killed in Israel's assault on the Gaza Strip"}, {"id": "de94bd53-bfee-4066-a9b1-cb099469277a", "title": "Rafah offensive and war in Gaza : Threat of a dangerous escalation", "date": "2024-05-04 06:45", "url": "https://www.firstpost.com/opinion/rafah-offensive-and-war-in-gaza-threat-of-a-dangerous-escalation-13767004.html", "message": "Rafah and RegionWithin the region, there is apprehension about the Rafah offensive.\nIn case of the Rafah offensive going ahead, there is all likelihood that the engagements from Hezbollah into northern Israel will grow.\nConclusionLike the Israeli strike on the Iranian consulate in Damascus, the Rafah offensive too threatens to escalate the conflict if launched.\nWhile the Iran-Israel spat was short, the Rafah offensive could spread very fast.\nThe only face-saving exit for either of the parties is an early and long lasting ceasefire in Gaza before any offensive in Rafah.", "location": "Rafah", "classification": "security", "score": 0.5080231489088098, "event_breakdown": "- Apprehension within the region regarding the Rafah offensive.\n- Likelihood of increased engagements from Hezbollah into northern Israel if Rafah offensive proceeds.\n- Rafah offensive threatens to escalate conflict, akin to Israeli strike on Iranian consulate in Damascus.\n- Potential for rapid spread of conflict if Rafah offensive occurs.\n- Suggestion of an early and lasting ceasefire in Gaza as a face-saving exit strategy for both parties before any offensive in Rafah."}, {"id": "d057b664-a728-4bce-abd5-406b1ee5251c", "title": "Australian Muslims claim  double standard  in police handling of hate crime incidents – International Shia News Agency", "date": "2024-05-04 12:15", "url": "https://en.shafaqna.com/367278/australian-muslims-claim-double-standard-in-police-handling-of-hate-crime-incidents/", "message": "Shafaqna English- Australian Muslims claim ‘double standard’ in police handling of hate crime incidents, ead of the Australian National Imams Council (ANIC) said.\nAn April 13 knife attack in a mall in Sydney, Australia killed six people before police killed the attacker.\nDays later, Australian police said the attacker had mental health problems that led to the isolated act and that the attack was not related to terrorism.\n“One was described as a mental health issue, the other one was labeled a terrorist act.\nEmphasizing that the language used by police did not help the situation, Al-Suleiman said they conveyed their concerns about a double standard to authorities but got unsatisfactory feedback.", "location": "SYDNEY, AUSTRALIA", "classification": "security", "score": 0.4265718112077503, "event_breakdown": "- Knife attack in a mall in Sydney, Australia on April 13 kills six people before police kill the attacker.\n- Australian police claim the attacker had mental health problems, attributing the attack to an isolated act unrelated to terrorism.\n- Australian Muslims criticize police handling, citing a perceived double standard in labeling hate crime incidents versus terrorist acts.\n- Head of the Australian National Imams Council (ANIC), Al-Suleiman, voices concerns to authorities about the language used by police, but receives unsatisfactory feedback."}, {"id": "43f330a6-de20-402f-bc5d-3b7a0aaa6969", "title": "Sunday morning news brief , May 05 - The Times of India", "date": "2024-05-05 04:00", "url": "https://timesofindia.indiatimes.com/brief/sunday-morning-news-brief-may-05/liveblog/109850664.cms", "message": "08:27 (IST) May 05According to police sources, she was found at a farmhouse in Kalenahalli near Hunsur taluk of Mysuru.\nShe was taken to Bengaluru for questioning.\nThe farmhouse where she was found allegedly belongs to Rajagopal, said to be Revanna's personal assistant.", "location": "Kalenahalli near Hunsur taluk of Mysuru", "classification": "security", "score": 0.7976371195308909, "event_breakdown": "- 08:27 (IST) May 05: Woman found at a farmhouse in Kalenahalli near Hunsur taluk of Mysuru.\n- Woman taken to Bengaluru for questioning.\n- The farmhouse where she was found allegedly belongs to Rajagopal, said to be Revanna's personal assistant."}, {"id": "071c44d4-5334-4eb7-8ef6-d5719bc05771", "title": "Progress in Gaza cease - fire talks , but little chance of ending war", "date": "2024-05-04 19:00", "url": "https://www.nydailynews.com/2024/05/04/israel-hamas-cease-fire-talks-progress-no-end-to-war/", "message": "Hamas has called for a complete end to the war and withdrawal of all Israeli forces from Gaza.\nA senior Israeli official, speaking on condition of anonymity to discuss ongoing negotiations, played down the prospects for a full end to the war.\nIsraeli strikes early Saturday on Gaza killed at least six people.\nA strike in the Nuseirat refugee camp in central Gaza killed three people, according to hospital officials.\nOnce inside Gaza, the convoy was commandeered by Hamas terrorists, before UN officials reclaimed it.", "location": "Nuseirat refugee camp", "classification": "security", "score": 0.9266667652864661, "event_breakdown": "null"}, {"id": "4117b409-02eb-4fbb-8fe9-3fa6380bd683", "title": "Security forces kill six terrorists in North Waziristan IBO", "date": "2024-05-04 19:00", "url": "https://www.thenews.com.pk/latest/1185411-security-forces-kill-six-terrorists-in-north-waziristan-ibo", "message": "— AFPSix terrorists were killed by the security forces following an intense gun battle during an intelligence-based operation (IBO) in North Waziristan district, Inter-Services Public Relations (ISPR) said Saturday.\nDuring the conduct of the operation, intense fire exchange took place between the troops and the terrorists, as a result of which six terrorists were \"sent to hell\".\nThe killed terrorists remained actively involved in numerous terrorist activities against security forces as well as target killings of innocent civilians in the area.\nSecurity forces on Thursday killed terrorists involved in the recent abduction of district and sessions judge of South Waziristan in a joint IBO in KP's Tank district, the ISPR had said in a statement.\nAmong the 432 fatalities, 281 included that of civilians and security forces personnel.", "location": "North Waziristan district", "classification": "security", "score": 0.9765247571825078, "event_breakdown": "- Six terrorists killed in North Waziristan district during an IBO\n- Security forces engaged in intense gun battle with terrorists\n- Killed terrorists involved in terrorist activities and target killings in the area\n- Security forces killed terrorists involved in the abduction of a judge in Tank district, KP\n- 432 fatalities, including 281 civilians and security forces personnel"}, {"id": "aa8022a7-9bd3-426a-8279-4bf1d494f71a", "title": "Australian police shoot dead a boy , 16 , armed with a knife after he stabbed a man in Perth – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/australian-police-shoot-dead-a-boy-16-armed-with-a-knife-after-he-stabbed-a-man-in-perth/", "message": "A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth, officials said Sunday.\nMELBOURNE, Australia (AP) — A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth, officials said Sunday.\nBlanch said members of the local Muslim community had raised concerns with police about the boy’s behavior before he was killed on Saturday.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead.", "location": "Perth, Australia", "classification": "security", "score": 0.7883950595554645, "event_breakdown": "- A 16-year-old boy armed with a knife was shot dead by police in Perth, Australia after stabbing a man.\n- The incident took place in the Australian west coast city of Perth.\n- Members of the local Muslim community had raised concerns with the police about the boy's behavior before the incident.\n- In November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before being shot dead by police."}, {"id": "6e0515ff-3943-472a-bedb-dc9d9d51f050", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "TALEEX, Somalia", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashed in Somalia's Sool region, with witnesses and visual evidence confirming the incident.\n- Residents of Taleex district heard a loud explosion around midnight, with the discovery of wreckage resembling an Iranian Quds land-attack cruise missile.\n- No group has claimed responsibility for the apparent cruise missile launch that violated Somali airspace.\n- CENTCOM issued a statement mentioning the actions taken to protect freedom of navigation and ensure the safety of US, coalition, and merchant vessels.\n- No casualties have been reported in Somalia due to the failed cruise missile strike."}, {"id": "21a12131-1d44-4bef-a401-24fd04c3d9fb", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Israeli airstrike on the outskirts of Damascus\n- Eight Syrian soldiers injured\n- Strike targeted a military position in Damascus area\n- Missiles launched from over the Golan Heights in northern Israel\n- Material losses reported\n- Building targeted allegedly used by Syrian security forces\n- Strike location just south of the Sayyeda Zeinab shrine\n- Similar incident on April 1 with Islamic Republic Revolutionary Guard Corps officers killed"}]