[{"id": "2c1fe25c-ff52-4348-8e13-f8a67da811da", "title": "Hurricane Preparedness Week kicks off : Know your risk from wind and water", "date": "2024-05-05 07:15", "url": "https://cbs12.com/news/local/sunday-may-5-2024-hurricane-preparedness-week-kicks-off-know-your-risk-from-wind-and-water", "message": "Hurricane season begins on June 1st and ends on November 30th, but this is not a set-in-stone timeframe.\nThere have been years when tropical systems have developed before the season begins and after the season ends.\nFor South Florida, historically, most of our landfalling hurricanes occur after the climatological peak of the season on September 10.\nYou know what the risks are here in South Florida.\nCheck back all this week on CBS 12 News and CBS 12.com to continue preparing for the upcoming hurricane season.", "location": "South Florida", "classification": "natural-disasters", "score": 0.5564661120346259, "event_breakdown": "- Hurricane season begins on June 1st and ends on November 30th.\n- Tropical systems have developed before the season begins and after the season ends in some years.\n- Most landfalling hurricanes in South Florida historically occur after the climatological peak of the season on September 10."}, {"id": "9c8c10f0-eff9-43f0-802a-e16f684e8510", "title": "Hurricane Preparedness Week starts May 5", "date": "2024-05-06 04:45", "url": "https://www.news4jax.com/weather/2024/05/06/hurricane-preparedness-week-starts-sunday-may-5/", "message": "The National Oceanic and Atmospheric Association (NOAA) began Hurricane Preparedness Week on Sunday and one of the most important topics they’re covering is knowing your risks when it comes to water and wind.\nWhen a hurricane is tracking toward NE Florida and SE Georgia, we need to know how to react and have a solid plan to keep our family safe.\nHurricane kits, evacuation routes, generators, and knowing your risks ahead of time will save lives.\nEvery county has a flood zone map and evacuation list, here’s the Duval County link whereyou can look up with your zip code, as well.\nOther topics include understanding the forecast, precautions after the storm passes, and how you can take action.", "location": "Duval County", "classification": "natural-disasters", "score": 0.8379547483376809, "event_breakdown": "1. NOAA initiates Hurricane Preparedness Week.\n2. Emphasis on understanding risks related to water and wind during hurricanes.\n3. Importance of having a solid reaction plan for hurricanes in NE Florida and SE Georgia.\n4. Highlight on hurricane kits, evacuation routes, generators, and risk awareness.\n5. Availability of flood zone maps and evacuation lists for each county, including Duval County.\n6. Additional topics include comprehending forecasts, post-storm precautions, and proactive measures."}, {"id": "5365ee64-292d-49f4-814e-37f2f0060f60", "title": "Beyond The Forecast - Hurricane Preparedness Week runs May 5 through May 11", "date": "2024-05-06 17:30", "url": "https://www.wsls.com/weather/2024/05/06/beyond-the-forecast-hurricane-preparedness-week-runs-may-5-through-may-11/", "message": "We are less than a month away from the start of the Atlantic hurricane season.\nColorado State and NC State are both forecasting an active hurricane season.\nCredit: NOAA's National Weather ServiceUnderstanding the ForecastTuesday’s topic is an important one for us as a weather team - understanding forecast information.\nCredit: NOAA's National Weather ServiceWhere to Go When a Storm ThreatensVery rarely will we have to evacuate for a storm.\nCredit: NOAA's National Weather ServiceStay Ahead of the SeasonEven though it’s spring, some of what we tell you during severe storm season applies to hurricane season.", "location": "Colorado State", "classification": "natural-disasters", "score": 0.9444010226962587, "event_breakdown": "- Less than a month away from the start of the Atlantic hurricane season\n- Colorado State and NC State forecast an active hurricane season\n- Understanding forecast information is important for the weather team\n- Rarely needing to evacuate for a storm\n- Some advice for severe storm season also applies to hurricane season"}, {"id": "18a06b4b-589a-46c7-b906-d10155aa22dc", "title": "National Hurricane Preparedness Week : What you need to know", "date": "2024-05-06 15:15", "url": "https://www.yahoo.com/news/national-hurricane-preparedness-week-know-142453787.html", "message": "Florida officials are urging residents to prepare for the possibility of major storms this hurricane season.\nThe National Oceanic and Atmospheric Administration has declared this week “National Hurricane Preparedness Week.”The warning comes as we are less than a month from the start of the 2024 Atlantic Hurricane Season on June 1.\nThis week is Hurricane Preparedness Week.\nAs hurricane season approaches, I encourage all Floridians to make a plan and build your kit.\nWatch: Early tropical disturbance could be indicative of a very active hurricane season• Know Your Zone, Know Your Home – It’s important for residents to know if they live in an evacuation zone, a low-lying, flood-prone area, a mobile home or an unsafe structure during hurricane season.", "location": "Florida", "classification": "natural-disasters", "score": 0.9039284013711771, "event_breakdown": "- Florida officials urging residents to prepare for major storms this hurricane season\n- The National Oceanic and Atmospheric Administration declaring \"National Hurricane Preparedness Week\"\n- Approaching start of the 2024 Atlantic Hurricane Season on June 1\n- Encouragement for Floridians to make a plan and build an emergency kit\n- Early tropical disturbance suggesting a potentially active hurricane season\n- Importance of knowing one's evacuation zone, flood-prone areas, mobile homes, or unsafe structures during hurricane season."}, {"id": "663a3f3b-ea06-4401-bd78-aa094cf32332", "title": "San Jacinto River Authority explains release of Lake Conroe water", "date": "2024-05-05 05:45", "url": "https://www.fox26houston.com/news/san-jacinto-river-authority-explains-release-lake-conroe", "message": "Some homeowners are raising concerns that water releases from Lake Conroe are making flooding worse.\nThe homeowners expressed their frustrations to FOX 26 Houston about the San Jacinto River Authority releasing water into the San Jacinto River which is now flooding.\nRELATED: Houston flooding: Water rescues in the Cleveland, Huffman area\"Where that water is flowing out from my yard and the yard next to it.\nThe San Jacinto River Authority said in 2017 during Hurricane Harvey, the inflow into Lake Conroe was about 130,000 cubic feet per second.\n\"Our primary goal is to protect our dam,\" said Aubrey Spear, the general manager of the San Jacinto River Authority.", "location": "Lake Conroe", "classification": "natural-disasters", "score": 0.7117227540105767, "event_breakdown": "- Homeowners raising concerns about water releases from Lake Conroe worsening flooding\n- Homeowners frustrated with San Jacinto River Authority for releasing water into San Jacinto River\n- San Jacinto River Authority's statement on the inflow into Lake Conroe during Hurricane Harvey\n- Aubrey Spear, general manager of the San Jacinto River Authority, mentioning the primary goal of protecting the dam"}, {"id": "b7cb8abe-63e0-4e7a-a190-b7f602d4ad29", "title": "What will determine the severity of this year wildfire season ? ", "date": "2024-05-07 00:00", "url": "https://www.canadianunderwriter.ca/catastrophes/what-will-determine-the-severity-of-this-years-wildfire-season-1004246035/", "message": "Precipitation in June will likely determine the severity of this year’s wildfire season in western Canada, says Glenn McGillivray, managing director of the Institute for Catastrophic Loss Reduction (ICLR).\nMcGillivray notes some experts are indicating the 2024 wildfire season will be as bad or worse than 2023.\nLast year was the worst fire season on record, burning more than 18.5 million hectares and forcing more than 230,000 people from their homes, according to the Canadian Press.\n“That being said, the 2024 wildfire season in B.C.\nor Alberta could be worse than 2023 from a provincial perspective.”Less than one week ago, there were 113 fires reported in B.C., McGillivray said Friday; some have triggered evacuation notices or actual evacuations.", "location": "B.C. (British Columbia)", "classification": "natural-disasters", "score": 0.795243276564067, "event_breakdown": "- Precipitation in June impacting severity of wildfire season in western Canada\n- 2024 wildfire season projected to be as bad or worse than 2023\n- 2023 marked as the worst fire season on record in western Canada\n- Over 18.5 million hectares burned and over 230,000 people forced from their homes in 2023\n- 113 fires reported in B.C. triggering evacuation notices or actual evacuations"}, {"id": "8620d9d5-edd3-440d-b674-e8ffa6756442", "title": "Central Okanagan urged to  get ready  during Emergency Preparedness Week", "date": "2024-05-06 23:45", "url": "https://www.kelownacapnews.com/local-news/central-okanagan-urged-to-get-ready-during-emergency-preparedness-week-7354371", "message": "Emergency Preparedness Week is May 5 to 11Listen to this articleEmergency Preparedness Week is May 5 to 11 and Central Okanagan are reminded to be aware of hazards such as flooding, drought, wildfire, and extreme weather.\nThe Regional Emergency Program’s Ask an Expert video series will spotlight essential information, covering post-wildfire hazards, emergency preparedness, and FireSmart initiatives.\nThe Central Okanagan Emergency Operations Centre (EOC) invites residents to share their preparedness insights before May 12, 2024.\nA brief questionnaire at yoursay.rdco.com gauges preparedness levels and enters participants into a draw for emergency preparedness kits valued at $170.\nPaper questionnaires are available at Central Okanagan Regional Library branches and the main fire station in Kelowna.", "location": "Kelowna", "classification": "natural-disasters", "score": 0.75563167976682, "event_breakdown": "- Emergency Preparedness Week is May 5 to 11\n- Regional Emergency Program’s Ask an Expert video series on post-wildfire hazards, emergency preparedness, and FireSmart initiatives\n- Central Okanagan Emergency Operations Centre (EOC) invites residents to share their preparedness insights before May 12, 2024\n- Questionnaire at yoursay.rdco.com to gauge preparedness levels and enter participants into a draw for emergency preparedness kits valued at $170\n- Paper questionnaires available at Central Okanagan Regional Library branches and the main fire station in Kelowna"}, {"id": "bd3b4a40-7b3f-4f4c-8d59-798046584703", "title": "National Hurricane Preparedness Week - May 5 - 11", "date": "2024-05-06 01:15", "url": "https://979kissfm.iheart.com/content/2024-05-05-national-hurricane-preparedness-week-may-5-11/", "message": "Hurricane Season officially begins June 1st, but the time to prepare is now during National Hurricane Preparedness Week, which runs through May 11.\nForecasters expect the 2024 Atlantic hurricane season to be one of the most active on record, with up to 24 named storms and 11 hurricanes.\nRecent record temperatures have warmed ocean waters and lowered wind shear.\nUnlike last year's storm-suppressing El Niño weather system, this year's La Niña conditions typically enhance storm formation in the Atlantic.\nYou can stock up on supplies during the Hurricane Sales-Tax Holidays between June 1st and 14th and from August 24th to September 6th.", "location": "Atlantic", "classification": "natural-disasters", "score": 0.9276774991039163, "event_breakdown": "1. National Hurricane Preparedness Week, May 5th - May 11th\n2. Forecast of up to 24 named storms and 11 hurricanes for the 2024 Atlantic hurricane season\n3. Record temperatures warming ocean waters and lowering wind shear\n4. La Niña conditions enhancing storm formation in the Atlantic\n5. Hurricane Sales-Tax Holidays: June 1st - 14th and August 24th - September 6th"}, {"id": "50361da9-d1a9-4fc8-9e04-a2a9782f947f", "title": "Despite social media posts , scientists say no rise in quakes | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-06 11:45", "url": "https://www.asahi.com/ajw/articles/15256965", "message": "“It is probably because people have come to experience earthquakes as a social phenomenon,” he said.\nFurthermore, smartphones and social media have become common communication tools, and news sites and disaster prevention applications have been enhanced.\nIn other words, the recent “increase in earthquakes” is more about the “increase in postings and information about earthquakes,” he said.\nAfter the Noto Peninsula earthquake, many false rescue requests were posted on social media.\nUploaded images of the 2011 Great East Japan Earthquake and tsunami and the 2004 Kumamoto Earthquakes were falsely described as damage on the Noto Peninsula.", "location": "Noto Peninsula", "classification": "natural-disasters", "score": 0.5536059762287897, "event_breakdown": ""}, {"id": "c76bf3b9-42cb-4028-9d32-4fcb3ca22664", "title": "Houston area flood problems offer lessons for cities trying to adapt to a changing climate", "date": "2024-05-05 20:45", "url": "https://www.yahoo.com/news/houston-area-flood-problems-offer-192222994.html", "message": "I work with a center at the University of Michigan that helps communities turn climate knowledge into projects that can reduce the harm of future climate disasters.\nFlooding events like the Houston area experienced provide case studies that can help cities everywhere manage the increasing risk.\nChengyue Lao/Xinhua via Getty ImagesFlood risks are risingThe first thing recent floods tell us is that the climate is changing.\nWarming leads to increasing precipitation and more intense downpours, and increased flood potential, particularly when storms hit on already saturated ground.\nPavement is a major contributor to urban flooding, because water cannot be absorbed and it runs off quickly.", "location": "Houston", "classification": "natural-disasters", "score": 0.9659609473594358, "event_breakdown": "1. University of Michigan center aids communities in utilizing climate knowledge for disaster mitigation projects.\n2. Flooding events, like those in the Houston area, serve as case studies for managing rising flood risks globally.\n3. Recent floods indicate climate change, with warming leading to more precipitation and intense downpours, increasing flood potential.\n4. Urban flooding exacerbated by pavement, preventing water absorption and causing rapid runoff."}, {"id": "096239b5-a45a-4806-8d9e-ffc39a83bc74", "title": "Hurricane Awareness Tour warns Maine to prepare for upcoming hurricane season", "date": "2024-05-06 23:30", "url": "https://www.mainepublic.org/environment-and-outdoors/2024-05-06/hurricane-awareness-tour-warns-maine-to-prepare-for-upcoming-hurricane-season", "message": "Serving as its first stop, NOAA's 2024 Hurricane Awareness Tour is aimed at spreading awareness about the upcoming Atlantic hurricane season beginning in June.\nWhile Mainers along the coast are especially at risk of hurricanes, storm surge flooding caused by strong storms can also affect those inland.\nLori Ehrlich, the regional administrator for FEMA Region 1 which covers New England, said preparing for the upcoming hurricane season doesn’t have to break the bank.\n\"It’s been forecast that we’re going to have a more active hurricane season this year,\" Ehrlich said.\nEhrlich also recommends every household to make an emergency hurricane plan that might include evacuation.", "location": "New England", "classification": "natural-disasters", "score": 0.9136432798980717, "event_breakdown": "- NOAA's 2024 Hurricane Awareness Tour begins as its first stop\n- Mainers along the coast are at risk of hurricanes and storm surge flooding can affect those inland\n- Lori Ehrlich, FEMA Region 1 administrator, encourages preparation for the upcoming hurricane season\n- Ehrlich mentions the forecast of a more active hurricane season this year\n- Ehrlich suggests every household should create an emergency hurricane plan that might include evacuation"}, {"id": "73a813b8-756d-43dd-b112-d03f8da6a613", "title": "Blog : Our soggy weather pattern begins", "date": "2024-05-05 13:00", "url": "https://www.yahoo.com/news/blog-soggy-weather-pattern-begins-110246403.html", "message": "As we head into the work week, we’ll continue to see some scattered rain chances.\nWitA few storms mid to late week could be strong – especially Thursday as a front moves into the area.\nStay tuned for updates and make sure you have our WAVY Weather app to get any alerts that are issued.\nThis week on Wednesday the NOAA Hurricane Hunter aircraft will be here in our area and you can tour the planes.\nMeteorologist Ricky MatthewsFollow Ricky on Facebook and TwitterFor the latest news, weather, sports, and streaming video, head to WAVY.com.", "location": "WAVY", "classification": "natural-disasters", "score": 0.5692440318171325, "event_breakdown": "- Scattered rain chances throughout the week\n- Strong storms expected on Thursday as a front moves into the area\n- NOAA Hurricane Hunter aircraft tour on Wednesday"}, {"id": "73d47b05-5b4e-4149-9b28-a8101f9dabb9", "title": "What Cities Everywhere Can Learn From The Houston Areas Severe Flooding As They Try To Adapt To Climate Change", "date": "2024-05-06 23:00", "url": "https://www.wateronline.com/doc/what-cities-everywhere-can-learn-from-the-houston-area-severe-flooding-0001", "message": "I work with a center at the University of Michigan that helps communities turn climate knowledge into projects that can reduce the harm of future climate disasters.\nFlooding events like the Houston area experienced provide case studies that can help cities everywhere manage the increasing risk.\nFlood Risks Are RisingThe first thing recent floods tell us is that the climate is changing.\nPavement is a major contributor to urban flooding, because water cannot be absorbed and it runs off quickly.\nThe Houston area’s frequent flooding illustrates the risks.", "location": "Houston, Texas", "classification": "natural-disasters", "score": 0.9392205113802935, "event_breakdown": "1. University of Michigan's center assists communities in translating climate knowledge into actionable projects.\n2. Utilization of flooding events, such as those in the Houston area, as case studies for managing climate risks.\n3. Recognition of rising flood risks due to climate change.\n4. Identification of pavement as a significant factor in urban flooding, leading to rapid runoff.\n5. Houston's frequent flooding serves as an illustration of the associated risks."}, {"id": "6d3d907d-6dbf-48cf-86c2-aa45b84356c3", "title": "Time for Floridians to Officially Prepare for Hurricane Season | NewsRadio WFLA", "date": "2024-05-06 20:00", "url": "https://wflanews.iheart.com/featured/florida-news/content/2024-05-06-time-for-floridians-to-officially-prepare-for-hurricane-season/", "message": "We are in the midst of Hurricane Preparedness Week ahead of the storm season which officially begins June first.\nNational Weather Service warning coordinator Robert Molleda encourages all sectors of the community to get a plan.\n“Florida Preparedness Week is the perfect time to sit down with your family and ensure you have a customized plan for your household,” said Gov.\nMolleda says now is the time to develop a hurricane plan and know your risks from the hazards of tropical systems like wind and storm surge.\nFinally, educate yourself on evacuation routes, identify safe shelters, and have a plan for your pets.", "location": "Florida", "classification": "natural-disasters", "score": 0.8316839171493233, "event_breakdown": "- National Weather Service warning coordinator Robert Molleda encourages community to create a hurricane plan\n- Gov urges families to ensure they have a customized plan during Florida Preparedness Week\n- Molleda advises developing a hurricane plan and understanding risks from tropical hazards\n- Educate yourself on evacuation routes, safe shelters, and pet safety in preparation for hurricanes"}, {"id": "64111222-9a55-407d-baa8-3ac7cb93ffc0", "title": "Hurricane Preparedness Week encourages residents to be ready for what could be an active season", "date": "2024-05-06 23:45", "url": "https://www.wwaytv3.com/hurricane-preparedness-week-encourages-residents-to-be-ready-for-what-could-be-an-active-season/", "message": "Hurricane Preparedness Week encourages residents to be ready for what could be an active seasonSOUTHEASTERN, NC (WWAY)– With the official start of hurricane season just 26 days away, Sunday marked the first day of Hurricane Preparedness Week in North Carolina.\n“Hurricane Preparedness Week is a time for everybody to think about the hurricane season that’s coming up, and for folks to get prepared,” said Meteorologist Bob Bright of the National Weather Service in Wilmington.\n“We have been looking towards the 2024 Hurricane Season since, I would say, December 1st, 2023.\nThe 2024 Atlantic Hurricane Season is just around the corner, and predictions have this season shaping up to be an active one.\nThings that they’re going to do to protect their property, their lives, friends and family during the hurricane season,” said Bright.", "location": "Southeastern, NC", "classification": "natural-disasters", "score": 0.7522091160648404, "event_breakdown": "1. Start of Hurricane Preparedness Week in North Carolina.\n2. Emphasis on preparation for the upcoming hurricane season.\n3. Meteorologist Bob Bright highlights the need for readiness.\n4. Anticipation of an active 2024 Atlantic Hurricane Season.\n5. Focus on actions to protect lives, property, and loved ones during hurricanes."}, {"id": "77dd2b14-0b1d-4c6b-a383-5f20d002f403", "title": "Mega Disasters - Blaze | TV Guide", "date": "2024-05-06 00:15", "url": "https://www.tvguide.co.uk/schedule/49fa29fd-a275-5c27-b776-575421fe6e44/mega-disasters", "message": "Mega DisastersBlaze 6:00 AM to 7:00 AM Monday 6 May Share Add toCalendar +Mega Tsunami Season 3 Episode 2 of 12Eight thousand years ago, waves taller than the Statue of Liberty ruined the coasts of the Mediterranean Sea, devastating ancient villages.\nA team of scientists pieces together evidence of this mega stormMega Disasters airs on Blaze at 6:00 AM, Monday 6 May .\nLearn more about Mega Disasters and other education/science/factual topics on our factual page", "location": "Mediterranean Sea", "classification": "natural-disasters", "score": 0.4770400944456177, "event_breakdown": ""}, {"id": "9b868c23-b24d-4ece-8cbb-f037a59da567", "title": "The science behind why the world is getting wetter", "date": "2024-05-05 10:00", "url": "https://www.livemint.com/science/the-science-behind-why-the-world-is-getting-wetter-11714901298593.html", "message": "The powerful downpours are the result of natural weather patterns being supercharged by a record-breaking year for global temperatures.\nAs the globe gets hotter, it is getting wetter too.\nRecord rainfall totaling 17 inches across the month inundated Guangdong province, in southern China, where on Monday a section of a highway collapsed in a mountainous area, killing 48 people.\nThere have been 10 straight months of record-breaking global average atmospheric temperatures, and 12 consecutive months of record global average ocean temperatures.\nRecord rainfall hit the island, the miner said.", "location": "Guangdong province", "classification": "natural-disasters", "score": 0.4206738265011853, "event_breakdown": "1. Record-breaking global temperatures contribute to intensified natural weather patterns, resulting in powerful downpours.\n2. Guangdong province in southern China experiences record rainfall of 17 inches in a month, leading to a highway collapse in a mountainous area and the death of 48 people.\n3. Ten consecutive months of record-breaking global average atmospheric temperatures, accompanied by 12 straight months of record global average ocean temperatures.\n4. Record rainfall reported on an island, according to a mining company statement."}, {"id": "5f5b6ad6-1140-4529-8be9-cf4033b76bb0", "title": "Inside abandoned ghost town at Fukushima after nuclear power plant meltdown", "date": "2024-05-05 08:30", "url": "https://www.mirror.co.uk/news/weird-news/inside-abandoned-ghost-town-fukushima-32696396", "message": "Tokyo Matilda, a 20-year-old from Sheffield, England, embarked on a mission to delve into this deserted ghost town of Fukushima in Japan.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)While visiting the disaster site, Tokyo explored a theme park, a school and even a ramen café that have all been empty since 2011.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)The danger of radiation poisoning was a very real risk for Tokyo as she explored the many sights.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS) Image: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)‌The Fukushima disaster took place when three of the six nuclear reactors in the power plant suffered damage to their core after the 9.1 magnitude earthquake and following tsunami.\nImage: Tokyo Matilda/ CATERS NEWS) Tokyo Matilda/ CATERS NEWS)In turn, they began releasing hydrogen and deadly toxic radiation into the surrounding environment and causing a huge hydrogen explosion that impeded immediate shutdown and rescue efforts.", "location": "Fukushima", "classification": "natural-disasters", "score": 0.5451493068351129, "event_breakdown": "- Tokyo Matilda from Sheffield, England, visited the deserted ghost town of Fukushima in Japan\n- Tokyo explored a theme park, a school, and a ramen café that have been empty since 2011\n- Tokyo faced the real risk of radiation poisoning while exploring the sights\n- The Fukushima disaster occurred when three of the six nuclear reactors in the power plant suffered core damage after a 9.1 magnitude earthquake and following tsunami\n- The damaged reactors released hydrogen and toxic radiation into the surrounding environment, causing a huge explosion that impeded immediate shutdown and rescue efforts"}, {"id": "20bc5290-4f5d-46f7-be10-136f87cbbf3b", "title": "Commentary : Climate challenges at the nation most expensive home", "date": "2024-05-05 11:30", "url": "https://www.orlandosentinel.com/2024/05/05/commentary-climate-challenges-at-the-nations-most-expensive-home/", "message": "Scientists have confirmed Hurricane Ian’s destructive power was exacerbated by climate change, leading to heavier rains, more powerful winds and a higher storm surge.\nThe 100 Bay property epitomizes the complexities facing buyers in today’s emerging climate-aware market.\nIn 2024, we can now scientifically attribute whether damaging weather events were made more likely or more damaging due to climate change.\nThe stunning property at 100 Bay Road should be enjoyed for generations to come, but its future is jeopardized by climate change.\nThis opinion piece was distributed by The Invading Sea website (www.theinvadingsea.com), which posts news and commentary on climate change and other environmental issues affecting Florida.", "location": "Florida", "classification": "natural-disasters", "score": 0.8435153293463538, "event_breakdown": ""}, {"id": "2902a7de-e3a7-4830-aa1e-f44b4ccec3d7", "title": "Drought and Flood Protection Program now open", "date": "2024-05-06 17:45", "url": "https://www.alberta.ca/release.cfm?xID=9030110F35789-FBF1-7397-10FA7A15FAC6B9E2", "message": "To help, Alberta’s government is launching the new $125-million Drought and Flood Protection Program.\nThat’s why I encourage any and all communities to apply.” Rebecca Schulz, Minister of Environment and Protected AreasThe Drought and Flood Protection Program builds on the work of the Alberta Community Resilience Program.\nThis year, $25 million is being made available for projects to benefit communities across the province that are facing drought and flood.\nThe Drought and Flood Protection Program will help communities design and construct projects that protect critical infrastructure from drought and flooding and help ensure public safety is protected.\nQuick factsBudget 2024 allocated $25 million per year from 2024-25 through 2028-29 for the Drought and Flood Protection Program.", "location": "Alberta", "classification": "natural-disasters", "score": 0.8737072837503123, "event_breakdown": "- Alberta government launching the new $125-million Drought and Flood Protection Program\n- Minister of Environment and Protected Areas, Rebecca Schulz, encouraging communities to apply for the program\n- Drought and Flood Protection Program building on the work of the Alberta Community Resilience Program\n- $25 million being made available this year for projects benefiting communities facing drought and flood\n- Budget 2024 allocating $25 million per year from 2024-25 through 2028-29 for the Drought and Flood Protection Program"}, {"id": "365be207-3ffd-4e12-ad37-e35aba27baf7", "title": "Heavy winds and rain damage homes and cause more flooding in Tanzania", "date": "2024-05-05 08:45", "url": "https://www.africanews.com/2024/05/05/heavy-winds-and-rain-damage-homes-and-cause-more-flooding-in-tanzania/", "message": "Heavy rains and strong winds have caused damage and more flooding as Cyclone Hidaya lashed Tanzania over the weekend.\nA major blackout hit most of the country on Saturday as it braced for the tropical cyclone which came following weeks of flooding in the region which has left over 150 people dead.\nThe weather service says more than usual amounts of rainfall were recorded in coastal areas overnight Friday, and forecasters warned flooding across the region may worsen this weekend.\nHeavy rain and flooding has caused chaos on the roads and for small businesses, with authorities saying more than 200 thousand people have been affected.\nHidaya is reportedly the strongest tropical cyclone ever recorded in Tanzania", "location": "Tanzania", "classification": "natural-disasters", "score": 0.9864960050913574, "event_breakdown": "- Heavy rains and strong winds from Cyclone Hidaya cause damage and flooding in Tanzania\n- Major blackout affects most of the country as Cyclone Hidaya approaches\n- More than usual amounts of rainfall recorded in coastal areas overnight Friday\n- Forecasters warn of worsening flooding across the region due to heavy rain\n- Chaos on the roads and impact on small businesses due to heavy rain and flooding\n- Over 200 thousand people affected by the severe weather\n- Cyclone Hidaya reported as the strongest tropical cyclone ever recorded in Tanzania"}, {"id": "bca6e401-3bcd-4d58-917e-c1589d98788f", "title": "Watch : Powerful Texas Floodwaters Sweep Semi Away", "date": "2024-05-05 06:30", "url": "https://987jack.com/ixp/175/p/texas-floodwaters-sweep-semi-away/", "message": "But there’s a reason for the saying “turn around, don’t drown.”According to the National Weather Service, more people die from drowning in floodwaters each year than from any other hazard related to thunderstorms.\nGet our free mobile appMany people underestimate the power of floodwaters and fall victim to drowning.\nThe below video is the perfect example of just how powerful floodwaters can be.\nFootage shows the terrifying moment a semi is sucked into flooding on I-59 near Shepherd, Texas.\nKeep reading to discover the 50 of the most expensive climate disasters in recent decades in the U.S. Gallery Credit: KATELYN LEBOFF", "location": "I-59 near Shepherd, Texas", "classification": "natural-disasters", "score": 0.703013444162502, "event_breakdown": "1. Warning about the danger of drowning in floodwaters by the National Weather Service.\n2. Highlighting the underestimation of floodwaters' power leading to drowning incidents.\n3. Video footage depicting a semi-truck being sucked into flooding on I-59 near Shepherd, Texas.\n4. Mention of upcoming content about the 50 most expensive climate disasters in recent decades in the U.S."}, {"id": "944c30dc-422c-4d9c-8a72-2c01048ef779", "title": "Burn ban in Sarasota County due to drought conditions", "date": "2024-05-05 21:45", "url": "https://www.fox13news.com/news/burn-ban-in-sarasota-county-due-to-drought-conditions", "message": "Authorities say there's an increased chance of fire hazards and there are local drought conditions.\nSarasota County’s burn ban ordinance (Sarasota County Code Section 58-2) automatically goes into effect countywide and prohibits almost all open burning when the Keetch-Byram Drought Index (KBDI) meets or exceeds 500, according to county officials.\nThe burn ban will automatically lift after the drought index falls below 500 for seven consecutive days, according to officials.\nAn announcement will be made on scgov.net and on Sarasota County social media pages.\nFor more information, call 311 in Sarasota County or visit scgov.net/fire.", "location": "Sarasota County", "classification": "natural-disasters", "score": 0.44944865921154536, "event_breakdown": ""}, {"id": "28ddfd8f-dae7-468b-a7d2-6fe98151bba5", "title": "Residents ordered to evacuate after dam fails in Bennettsville", "date": "2024-05-07 00:30", "url": "https://wpde.com/news/local/lake-wallace-dam-breaks-flooding-bennettsville-shady-rest-richardson-park-communities-alerted-police-emergency-managers-block-roads-water-rising-spilling-onto-roads-evacuation-developing-story-south-carolina-may-6-2024", "message": "Officials are telling community members to evacuate after reports and concerns that bridges in and around the Shady Rest community are overflowing on Monday.\nBennettsville Mayor Leith Fowler confirmed that the dam at Lake Wallace has breached and they're in the process of alerting people in the Shady Rest and Richardson Park communities.\nTRENDING:The dam has failed at Lake Paul Wallace,\" the city shared.\nAccording to the the Lake Wallace Dam was last inspected on July 13, 2022.\nThe Shady Rest and Richardson Park communities experienced major flooding previously due to a nearby dam bursting during Hurricane Matthew and Hurricane Florence.", "location": "Lake Wallace, Bennettsville", "classification": "natural-disasters", "score": 0.4893859453144934, "event_breakdown": ""}, {"id": "b710384a-c837-4ab8-9274-8ad284ccfc0a", "title": "Death toll from rains in southern Brazil climbs to 56 | World", "date": "2024-05-05 09:30", "url": "https://en.ammonnews.net/article/72422", "message": "Home WorldDeath toll from rains in southern Brazil climbs to 56Ammon News - Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nState Governor Eduardo Leite told reporters on Saturday evening that Rio Grande do Sul would need a \"Marshall Plan\" to recover.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "Porto Alegre", "classification": "natural-disasters", "score": 0.5677841003283745, "event_breakdown": "- Death toll from rains in southern Brazil climbs to 56, with at least 55 people killed in Rio Grande do Sul\n- Guaiba lake in Porto Alegre breaks its banks, flooding streets\n- State Governor Eduardo Leite states that Rio Grande do Sul would need a \"Marshall Plan\" to recover\n- Former President Lula announces government's constant contact with state and cities' authorities to support the region"}, {"id": "ff09e601-8549-41cf-bdae-2e14423aa28d", "title": "How hot will it be this summer in Wisconsin ? Here what AccuWeather predicts", "date": "2024-05-06 16:00", "url": "https://news.yahoo.com/hot-summer-wisconsin-heres-accuweather-142842321.html", "message": "On Wednesday, AccuWeather released its U.S. summer forecast, which predicts temperatures will soar 2 to 4 degrees above the historical average across much of the country in the coming season.\nAccuWeather also predicts flooding and a potentially record-breaking hurricane season for the Gulf Coast states, as well as drought conditions in multiple regions, including the Upper Midwest.\nHere's AccuWeather's summer forecast for Wisconsin.\nThroughout most of Wisconsin, including the Milwaukee area, AccuWeather predicts June through August temperatures will be 3 to 4 degrees above the historical average.\nAccuWeather predicts \"some\" drought conditions this summer in southern Wisconsin.", "location": "Milwaukee, Wisconsin", "classification": "natural-disasters", "score": 0.9436976584926002, "event_breakdown": "1. AccuWeather releases U.S. summer forecast, anticipating temperatures 2 to 4 degrees above historical averages nationwide.\n2. Forecast warns of flooding and potentially record-breaking hurricane season for Gulf Coast states, along with drought conditions in various regions, including the Upper Midwest.\n3. Detailed summer forecast for Wisconsin by AccuWeather, projecting temperatures 3 to 4 degrees above historical averages for June through August.\n4. Prediction of \"some\" drought conditions in southern Wisconsin by AccuWeather for the upcoming summer."}, {"id": "32ca2e9d-b13c-47aa-984c-3da96dd71404", "title": "Brazil flooding death toll rises to 75 , with 80 , 000 evacuated", "date": "2024-05-05 19:45", "url": "https://news.sky.com/story/brazil-flooding-death-toll-rises-to-75-with-80000-evacuated-13130090", "message": "Mass flooding in Brazil has killed 75 people with more than 100 people still missing, local authorities said on Sunday.\nMore than 80,000 people have been forced to flee their homes since downpours began across Rio Grande do Sul in the south of the country on Monday.\nThe flooding has caused landslides, collapsed bridges, and seen roads transformed into rivers throughout the state.\nImage: Flooding in Sao Sebastiao do Cai, in Rio Grande do Sul.\nPresident Luiz Inacio Lula da Silva has travelled to Rio Grande do Sul to discuss rescue efforts with the governor.", "location": "Rio Grande do Sul", "classification": "natural-disasters", "score": 0.5122354255004392, "event_breakdown": "1. Mass flooding in Brazil's Rio Grande do Sul killed 75 people and left over 100 missing.\n2. Over 80,000 people displaced from their homes due to heavy downpours across Rio Grande do Sul.\n3. Flooding led to landslides, collapsed bridges, and roads turning into rivers in the state.\n4. Flooding in Sao Sebastiao do Cai, Rio Grande do Sul, depicted in an image.\n5. President Luiz Inacio Lula da Silva visited Rio Grande do Sul to discuss rescue efforts with the governor."}, {"id": "e0657940-09ed-4040-b3ed-7f4e5efc23d6", "title": "Local official :  Today , more than any other day in the past , be ready  for severe weather", "date": "2024-05-06 20:15", "url": "https://news.yahoo.com/storms-expected-hit-eastern-kansas-134756883.html", "message": "\"All ingredients are coming together\" for northeast Kansas to see a \"high-impact severe weather event\" between 4 and 11 p.m. Monday, reporters were told by a meteorologist with the Topeka Weather Service's Topeka office.\nPLEASE!’Shawnee County emergency management director Dusty Nichols wrote Monday afternoon on his department’s Facebook page: \"It appears nearly the entire weather expert (real and amateur) community across the nation is indicating the severe weather potential today.\nThe National Weather Service's Topeka office posted on its website this graphic showing the anticipated arrival times for severe weather Monday evening in central and eastern Kansas.\nThe National Weather Service's Storm Prediction Center posted on its website this graphic showing the chances for severe weather Monday in various parts of Kansas and surrounding states.\nThe eastern two-thirds of the storm will see \"enhanced\" moderate\" chances for severe weather Monday, said a convective outlook issued by the weather service's Storm Prediction Center in Norman, Oklahoma.", "location": "Northeast Kansas", "classification": "natural-disasters", "score": 0.7366623050198646, "event_breakdown": "- Meteorologist warns of high-impact severe weather event in northeast Kansas between 4 and 11 p.m. Monday\n- Shawnee County emergency management director notes widespread indication of severe weather potential across the nation on Monday afternoon\n- Anticipated arrival times for severe weather Monday evening in central and eastern Kansas are posted by the National Weather Service's Topeka office\n- Chances for severe weather Monday in various parts of Kansas and surrounding states are shown in a graphic by the National Weather Service's Storm Prediction Center\n- Eastern two-thirds of the storm will see enhanced moderate chances for severe weather Monday according to a convective outlook issued by the weather service's Storm Prediction Center in Norman, Oklahoma"}, {"id": "0a4640de-dc2b-456e-a8ec-57bfc4729710", "title": "  Steadily receding : After four days of flooding , water is slowly starting to go down", "date": "2024-05-06 05:00", "url": "https://www.click2houston.com/news/local/2024/05/06/steadily-receding-after-four-days-of-flooding-water-is-slowly-starting-to-go-down/", "message": "On Sunday, the Harris County Sheriff’s Office Marine Unit said the water is steadily lowering.\n@SheriffEd_HCSO pic.twitter.com/IjLWgaSOkL — Gage Goulding - KPRC 2 (@GageGoulding) May 5, 2024“It’s come down a lot,” said Lt. David Jasper with the Harris County Sheriff’s Office.\n“We’d gone over the top of a fence.”A street sign in the Channelview neighborhood of Houston, Texas surrounded by flood water from the San Jacinto River on May 5, 2024.\n“We personally did close to 100 water evacuations,” Lt. Jasper said.\nBut you really learn when you deploy and you’re working with multiple agencies,” Lt. Jasper said.", "location": "", "classification": "natural-disasters", "score": 0.41991026179617047, "event_breakdown": "- Water levels steadily lowering in Harris County\n- Flood water surrounds a street sign in the Channelview neighborhood of Houston, Texas\n- Harris County Sheriff's Office conducted close to 100 water evacuations in the area\n- Collaboration with multiple agencies during deployment"}, {"id": "bb4f88c7-fd48-4aae-8ed8-905e0b6d6e28", "title": "Nearly 60 killed , over 69 , 000 displaced as heavy rains batter southern Brazil", "date": "2024-05-05 06:15", "url": "https://www.indiatoday.in/world/story/heavy-rains-batter-southern-brazil-many-killed-and-thousands-displaced-2535368-2024-05-05", "message": "Heavy rains in Brazil's southernmost state of Rio Grande do Sul this week killed at least 55 people, local authorities said on Saturday evening, while dozens remain unaccounted for.\nA second dam in the city of Bento Goncalves is also at risk of collapsing, authorities said.\nIn Porto Alegre, the capital of Rio Grande do Sul, the Guaiba lake broke its banks, flooding streets.\nLula said on X that his government is in constant contact with state and cities' authorities to support the region with whatever they need.\nRio Grande do Sul is at a geographical meeting point between tropical and polar atmospheres, which has created a weather pattern with periods of intense rains and others of drought.", "location": "Porto Alegre", "classification": "natural-disasters", "score": 0.6889372817057625, "event_breakdown": "1. Heavy rains in Rio Grande do Sul, Brazil, result in at least 55 deaths, with many still missing.\n2. Concerns arise over the potential collapse of a second dam in Bento Goncalves.\n3. Flooding in Porto Alegre, the capital of Rio Grande do Sul, as Guaiba lake overflows, inundating streets.\n4. President Lula pledges government support to the affected region in coordination with state and city authorities.\n5. Rio Grande do Sul's location at the convergence of tropical and polar atmospheres leads to a weather pattern characterized by alternating periods of intense rainfall and drought."}, {"id": "e24b40d1-54fd-492a-a1da-7d902c2a95a7", "title": "El Niño damage in NegOcc reaches P214M", "date": "2024-05-06 18:15", "url": "https://www.sunstar.com.ph/bacolod/el-ni%C3%B1o-damage-in-negocc-reaches-p214m", "message": "The damages caused by the drought due to the El Niño phenomenon in Negros Occidental have already reached P213,150,252.20 as of May 3, a report from the Office of the Provincial Agriculturist showed.\nThe report by Dina Genzola, OIC provincial agriculturist, showed that damages to rice crops are now at P206,336,070.57 while damages to corn crops have reached P5,814,191.64.\nThe drought affected a total of 187 barangays with rice lands, and 5,355 farmers in 4,035 hectares of rice land.\nIt also affected a total of 32 barangays with corn crops, 219 farmers, and 148.71 hectares of corn land.\nWe are preparing more for the upcoming La Niño which is expected to bring heavy rain and flooding, Tabujara said.", "location": "", "classification": "natural-disasters", "score": 0.7291946413556213, "event_breakdown": ""}, {"id": "68e53ea3-307c-45fa-b023-2a025c5aeb3e", "title": "6 . 0 - magnitude earthquake hits off eastern Indonesia - Xinhua", "date": "2024-05-06 02:00", "url": "https://english.news.cn/20240506/f047ece81a204dbb8b78d3636e0cb3f3/c.html", "message": "JAKARTA, May 6 (Xinhua) -- A 6.0-magnitude earthquake struck off Indonesia's eastern Maluku province on Monday morning without triggering giant waves, the country's meteorology and geophysics agency said.\nThe undersea earthquake occurred at 01:33 a.m. Jakarta time (1833 GMT Sunday) with its epicenter situated 57 km southeast of Seram Bagian Timur regency and a depth of 19 km, the agency reported.\nThe intensity of the quake was felt at IV to V MMI (Modified Mercalli Intensity) in the Seram Bagian Timur regency, the agency said.\nOfficials of the agency did not issue a tsunami warning as the tremors would not cause giant waves, it said.\nIndonesia, an archipelagic nation, is prone to earthquakes for its position in a vulnerable quake-stricken zone called \"the Pacific Ring of Fire.\"", "location": "", "classification": "natural-disasters", "score": 0.6328359701134979, "event_breakdown": "- A 6.0-magnitude earthquake struck off Indonesia's eastern Maluku province\n- The earthquake occurred at 01:33 a.m. Jakarta time (1833 GMT Sunday)\n- Epicenter situated 57 km southeast of Seram Bagian Timur regency\n- Depth of the earthquake was 19 km\n- Intensity of the quake felt at IV to V MMI in the Seram Bagian Timur regency\n- No tsunami warning issued by officials\n- Indonesia is prone to earthquakes due to its position in the Pacific Ring of Fire"}, {"id": "a8263e7e-4b22-4ef8-85b0-25e65b2780ed", "title": "6 . 0 - magnitude earthquake hits off eastern Indonesia | Central India Premier English Daily", "date": "2024-05-06 08:30", "url": "https://www.centralchronicle.com/6-0-magnitude-earthquake-hits-off-eastern-indonesia/", "message": "Jakarta, May 6 (UNI) A 6.0-magnitude earthquake struck off Indonesia’s eastern Maluku province on Monday morning without triggering giant waves, the country’s meteorology and geophysics agency said.\nThe undersea earthquake occurred at 01:33 a.m. Jakarta time (1833 GMT Sunday) with its epicenter situated 57 km southeast of Seram Bagian Timur regency and a depth of 19 km, the agency reported.\nThe intensity of the quake was felt at IV to V MMI (Modified Mercalli Intensity) in the Seram Bagian Timur regency, the agency said.\nOfficials of the agency did not issue a tsunami warning as the tremors would not cause giant waves, it said.\nIndonesia, an archipelagic nation, is prone to earthquakes for its position in a vulnerable quake-stricken zone called “the Pacific Ring of Fire.”", "location": "Seram Bagian Timur regency", "classification": "natural-disasters", "score": 0.6562031533976818, "event_breakdown": "- A 6.0-magnitude earthquake struck off Indonesia's eastern Maluku province.\n- The earthquake occurred at 01:33 a.m. Jakarta time with its epicenter situated 57 km southeast of Seram Bagian Timur regency and a depth of 19 km.\n- The intensity of the quake was felt at IV to V MMI in the Seram Bagian Timur regency.\n- No tsunami warning was issued as the tremors would not cause giant waves.\n- Indonesia is prone to earthquakes due to its position in the Pacific Ring of Fire."}, {"id": "ea150ff1-62a6-4a13-abd3-31f076d72b3b", "title": "Texas Authorities Rescue Over 200 People , 153 Pets , As Residents Brace For More Flooding", "date": "2024-05-05 19:45", "url": "https://dailycaller.com/2024/05/05/people-pets-rescued-floods-houston-texas-houston/", "message": "Authorities in southern Texas rescued at least 224 people and 153 pets from floods late Saturday following recent storms, even as residents batten down for more rain and flooding, according to reports.\nThe figures of the rescued stood at 178 people and 122 pets as of Friday, Hidalgo told reporters at a press conference late Saturday, as aired by KHOU 11.\n“There have been no confirmed deaths related to the incident, and I haven’t heard about any serious injuries,” Hidalgo told reporters.\nThe floodwaters cut off Rio Villa and its surrounding areas south of Lake Houston, Hidalgo told reporters.\nTexas, Kansas and Oklahoma, comprising the southern Great Plains, “regularly experience some of the most extreme weather on the planet,” according to the U.S.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.7783027828961951, "event_breakdown": "- Authorities in southern Texas rescued at least 224 people and 153 pets from floods\n- Residents in southern Texas batten down for more rain and flooding\n- The figures of the rescued stood at 178 people and 122 pets as of Friday\n- Hidalgo confirmed no deaths related to the incident and no serious injuries\n- Floodwaters cut off Rio Villa and its surrounding areas south of Lake Houston in Texas"}, {"id": "a8905d23-64c4-47d9-adfd-14d694b46b7f", "title": "Millions of people across Oklahoma , southern Kansas at risk of tornadoes and severe thunderstorms", "date": "2024-05-06 15:45", "url": "https://www.stripes.com/theaters/us/2024-05-06/oklahoma-kansas-tornadoes-severe-thunderstorms-13769719.html", "message": "In all, nearly 10 million people live in areas under threat of severe weather, the National Weather Service’s Storm Prediction Center said.\nForecasters there issued a rare high risk for central Oklahoma and southern Kansas.\nThe risk on Monday in parts of the southern Plains is the worst in five years, AccuWeather Chief Meteorologist Jon Porter said.\nThe moisture is not being pulled into Colorado though which is not at risk of tornadoes or thunderstorms, he said.\nSevere weather was possible in southern Kansas after about 4 p.m. Monday.", "location": "Central Oklahoma", "classification": "natural-disasters", "score": 0.8149205418611827, "event_breakdown": "- Nearly 10 million people live in areas under threat of severe weather.\n- The National Weather Service's Storm Prediction Center issued a rare high risk for central Oklahoma and southern Kansas.\n- The risk in parts of the southern Plains on Monday is the worst in five years, according to AccuWeather Chief Meteorologist Jon Porter.\n- Colorado is not at risk of tornadoes or thunderstorms as the moisture is not being pulled into the state.\n- Severe weather was possible in southern Kansas after about 4 p.m. on Monday."}, {"id": "38a824bc-c6ed-4bec-84bd-adda8e6dd8b5", "title": "National Hurricane Preparedness Week 2024 Continues Through Saturday", "date": "2024-05-06 01:15", "url": "https://www.yahoo.com/news/national-hurricane-preparedness-week-2024-232922423.html", "message": "DOTHAN, Ala. (WDHN) — Hurricane season is officially less than four weeks away, but it’s never too early to prepare.\nNOAA and the National Hurricane Center are hosting National Hurricane Preparedness Week in order to prepare inland and coastal residents for the upcoming hurricane season, which starts June 1.\nNational Hurricane Preparedness Week comes as most agencies predict an above average or hyperactive hurricane season.\nIn the off season, getting to know National Hurricane Center and National Weather Service products can help make one make informed decisions during the season.\nAs always, we will help you prepare and keep you informed throughout the hurricane season.", "location": "Dothan, Alabama", "classification": "natural-disasters", "score": 0.8103553018291869, "event_breakdown": "1. National Hurricane Preparedness Week hosted by NOAA and the National Hurricane Center\n2. Preparation for inland and coastal residents for the upcoming hurricane season\n3. Prediction of an above average or hyperactive hurricane season\n4. Getting to know National Hurricane Center and National Weather Service products for informed decisions during the season\n5. Assistance in preparation and information throughout the hurricane season"}, {"id": "b898cd4f-cbed-4c53-96e0-91dd55f7c50a", "title": "Eyeing the storm : Air Force  Hurricane Hunter are busier than ever", "date": "2024-05-06 15:15", "url": "https://www.airforcetimes.com/news/your-air-force/2024/05/06/eyeing-the-storm-air-forces-hurricane-hunters-are-busier-than-ever/", "message": "The crew from the 53rd Weather Reconnaissance Squadron, a reserve unit from Keesler Air Force Base, Mississippi, is preparing for hurricane season.\nKnown as the “Hurricane Hunters,” the 53rd plays a critical role gathering data inside storms to help the NHC improve its forecasting.\nWeathering the stormComprised of 10 WC-130J aircraft loaded with weather-measuring equipment, the Hurricane Hunters are an exclusive Air Force mission.\nFive airmen work aboard each flight: two pilots, a navigator, an aerial reconnaissance weather officer and a loadmaster.\n“They are definitely spread thin,” Maj. Gen. C. McCauley von Hoffman, deputy chief of staff of the Air Force Reserve, told reporters.", "location": "Keesler Air Force Base, Mississippi.", "classification": "natural-disasters", "score": 0.4699167977031214, "event_breakdown": "- Crew from the 53rd Weather Reconnaissance Squadron preparing for hurricane season at Keesler Air Force Base, Mississippi\n- 53rd Weather Reconnaissance Squadron, known as the \"Hurricane Hunters,\" gathering data inside storms to help the NHC improve forecasting\n- 53rd Weather Reconnaissance Squadron being an exclusive Air Force mission with 10 WC-130J aircraft loaded with weather-measuring equipment\n- Five airmen working aboard each Hurricane Hunters flight: two pilots, a navigator, an aerial reconnaissance weather officer, and a loadmaster"}, {"id": "99a9d778-2b38-46dd-91ca-ee422392fa3c", "title": "Houston - area floods have lessons to teach the world", "date": "2024-05-06 23:30", "url": "http://www.houstonchronicle.com/opinion/outlook/article/houston-texas-flooding-19442162.php", "message": "Flood risks are risingThe first thing recent floods tell us is that the climate is changing.\nAdvertisement Article continues below this adBasic physics points to the rising risks: Global greenhouse gas emissions are increasing global average temperatures.\nIf the infrastructure is well designed and maintained, flood damage can be greatly reduced.\nFlood damage does not occur in isolation.\nAdvertisement Article continues below this adIn most cases, local officials’ initial instinct has been to protect property and persist without changing where people live.", "location": "", "classification": "natural-disasters", "score": 0.813477356898041, "event_breakdown": ""}, {"id": "b35b2971-aff6-470b-ae2d-1a183e1a6c90", "title": "Texas weather : Catastrophic flooding hits north of Houston", "date": "2024-05-07 03:45", "url": "https://www.fox7austin.com/news/catastrophic-flooding-hits-east-texas", "message": "Governor Greg Abbott provided an update Monday on the catastrophic flooding that hit East Texas.\n\"More than a third of all the counties in the state of Texas have been impacted by this weather event,\" Abbott said.\n\"The main thing we want to do is to protect lives,\" Abbott said.\nIf you don’t have it already, officials encourage you to get flood insurance.\n\"Just because you do not live in a flood plain does not mean you're not eligible for flood insurance.", "location": "East Texas", "classification": "natural-disasters", "score": 0.8498478980477963, "event_breakdown": ""}, {"id": "cdc4ece9-b56d-486e-b27f-81ecd7ac7bcd", "title": "Sarasota County burn ban : What residents can do to help prevent major fires in drought conditions", "date": "2024-05-07 02:15", "url": "https://www.yahoo.com/news/sarasota-county-burn-ban-residents-210324242.html", "message": "Sarasota County has put a burn ban in effect, banning most outdoor burning.\nRELATED: Burn ban in Sarasota County due to drought conditions\"Florida has a 12-month fire season, because we have a 12-month growth season,\" said Patrick Mahoney with the Myakka River District of the Florida Forest Service.\nHe said the markers and qualifications for implementing a burn ban typically differ county by county.\n\"Over the weekend, we had a couple of small fires where people were burning yard debris and walked away,\" he said.\nIn Sarasota County, officials said the burn ban will automatically be lifted when the drought index drops below 500 for seven straight days.", "location": "Sarasota County", "classification": "natural-disasters", "score": 0.5723603649186361, "event_breakdown": "- Sarasota County implements a burn ban, prohibiting most outdoor burning\n- Patrick Mahoney from the Myakka River District of the Florida Forest Service explains the year-round fire season in Florida\n- Criteria for implementing burn bans vary by county\n- Recent small fires occurred due to people burning yard debris and leaving it unattended\n- The burn ban in Sarasota County will be lifted when the drought index remains below 500 for seven consecutive days"}, {"id": "b96e267e-7b50-4bcb-a3a6-1c2f32ef7e43", "title": "Buresh Blog : Hurricane Preparedness Week ... Night Skies", "date": "2024-05-07 03:45", "url": "https://www.yahoo.com/news/buresh-blog-hurricane-preparedness-week-031137958.html", "message": "Become a part of the First Alert Neighborhood Weather Station Network OR click * here *:Hurricane Preparedness Week continues through May 11th.\nClick on the links below for info.... & visit the First Alert Hurricane Center * here *... the online 2024 Hurricane Preparation Guide * here *.\nMay 12 (evening): The waxing crescent Moon is in Gemini, a little more than 2° to the left of Pollux.\nMay 19–20 (all night): The waxing gibbous Moon inches toward Spica, in Virgo, closing from 4° to 2° away.\nThe Moon occults (covers) the star for those in the southeastern U.S.May 31 (morning): Turn toward the east-southeast to see the waning crescent Moon less than 1° below Saturn.", "location": "southeastern U.S.", "classification": "natural-disasters", "score": 0.5009739710123332, "event_breakdown": ""}]