[{"id": "16f995c6-f1ed-4ecf-b01d-69be0cdbe868", "title": "Mass Antisemitic Rally In Front Of Munich Synagogue Calls For Israel Eradication", "date": "2024-05-19 18:00", "url": "https://www.i24news.tv/en/news/international/europe/artc-mass-antisemitic-rally-in-front-of-munich-synagogue-calls-for-israel-s-eradication", "message": "Nearly 4,000 anti-Israel protestors turned up on Saturday in front of the main Munich synagogue demanding the obliteration of the Jewish state, according to German media reports.\nA mix of German Muslim, leftist and mainstream Germans appeared at the mass rally, according to the online German news organization NIUS.\nThere has been scarce resistance to rising antisemitism in the southern German city of Munich in the state of Bavaria.\nHe will not ban the Palestine Committee Stuttgart because he is not allowed to do that.\nIsraeli lawyers told i24 that Nopper can delete all postings of NGOs, including Palestine Committee Stuttgart, on the city website to ensure that the city does not enable Palestine Committee Stuttgart to finance the terrorist entities, Hamas and Samidoun.", "location": "Munich", "classification": "antisemitism", "score": 0.7335555568993944, "event_breakdown": "1. A mass rally of nearly 4,000 anti-Israel protestors takes place in Munich, Germany, demanding the obliteration of the Jewish state.\n2. The German city of Munich has faced scarce resistance to rising antisemitism.\n3. The mayor of the German city of Munich, Dieter Nopper, will not ban the Palestine Committee Stuttgart, an organization that supports the Boycott, Divestment, Sanctions (BDS) movement.\n4. Israeli lawyers argue that Nopper should delete all postings of NGOs, including the Palestine Committee Stuttgart, from the city website to ensure that the city does not support the terrorist entities Hamas and Samidoun."}, {"id": "d47fb457-3652-4ccd-b66a-85bb16d8e7cb", "title": "Israel Amb . to united kingdom :  Jewish communities feel like theyre under attack by antisemitism  ", "date": "2024-05-19 21:00", "url": "https://www.israelnationalnews.com/news/390213", "message": "She recounted how \"the young students are feeling it on the campuses here and some people feel it where they work or live.\nHotovely explained the feelings these days in the UK Jewish community, saying that it is a, “Very proud community and very much connected to Israel.\nMany people that I meet are saying, ‘My son is in Gaza,’ ‘My nephew is in Gaza.’ So we really feel the strong bond between the Jewish community here and the Israelis.\nAt the same time, Jewish communities feel like they're under attack by antisemitism.\nDuring the press conference, he said, ‘We won't be hijacked by those radicals,’ and at the same time he defined it as a threat to Britain, not as a threat just to the Jewish community.", "location": "The United Kingdom", "classification": "antisemitism", "score": 0.9444438294267925, "event_breakdown": "1. A proud Jewish community feels very connected to Israel.\n2. The Jewish community in the UK feels like it's under attack by antisemitism.\n3. A young student feels antisemitism on college campuses in the UK.\n4. People in the UK Jewish community say that their sons or nephews are in Gaza, so they feel a strong bond with Israel.\n5. A spokesman for the \"proud Jewish community\" says at an event it won't be \"hijacked by radicals\".\n6. A spokesman for the \"proud Jewish community\" defines antisemitism as a threat not just to the Jewish community but to the UK as well."}]