[{"id": "6e4317cf-953b-4c87-b7aa-fa6abbe9acc0", "title": "Israel Day of Fifth : An unparalleled platform to make our voices heard", "date": "2024-06-10 00:15", "url": "https://www.jpost.com/opinion/article-805568", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "This shift went well beyond the event’s new name, Israel Day on Fifth, formerly the Salute to Israel Parade and the Celebrate Israel Parade.\nMany Israel Fellows are also leading trips to Israel for Jewish students through Taglit-Birthright Israel and for non-Jewish students through the Maccabee Task Force, providing these young adults with the transformative experience of discovering Israel firsthand at this crucial moment in the country’s history.\nAt The Jewish Agency, we confront today’s challenges by emphasizing the power of the collective.\nMuch like we did at the Israel Day on Fifth parade, we must continue to stand up for what we believe in: a strong State of Israel alongside a strong American Jewish community.\nThe writer is chairman of the Board of Governors of The Jewish Agency for Israel.", "location": "NEW YORK", "classification": "antisemitism", "score": 0.7781861767524871, "event_breakdown": "Antisemitism has cropped up in Washington state. A Jewish cemetery at a Jewish Community Center (JCC) was targeted with anti-Zionist graffiti in March. A month later, an anti-terrorism rally in Seattle had to be stopped by protestors who chanted antisemitic slurs. Most recently, a Jewish teenager was the victim of an antisemitic assault while on his way home from school."}, {"id": "2e718dfa-714e-4fc6-b2df-6c8790196c1c", "title": "Tens of thousands surround White House in anti - genocide protest", "date": "2024-06-10 08:00", "url": "https://www.wsws.org/en/articles/2024/06/10/uiwd-j10.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Anti-genocide protesters demonstrate in front of the White House in Washington, Saturday, June 8, 2024.\nThe Palestinian Youth Movement, Jewish Voice for Peace and National Students for Justice in Palestine were among the sponsors of the event.\n“This ‘red line’ in his rhetoric is rubbish,” Mahdawi said.\nThey called for more protests to Congress and the Democratic Party, even though this perspective has been proven completely futile.\nLiza, who gave her support to the SEP campaign, said:The official White House reaction to the protest was one of extreme nervousness.", "location": "Washington", "classification": "antisemitism", "score": 0.7772312142291646, "event_breakdown": "The target event - a protest in front of the White House calling for an end to the genocide of Palestinians - happened on June 8, 2024. No relevant current events of antisemitism reported in the text can be placed on a map."}, {"id": "a90c1a54-198c-4bcd-9d3b-e6346f84da5d", "title": "  Shame on you : East Brunswick school administrators under fire for yearbook mistake", "date": "2024-06-10 10:00", "url": "https://www.yahoo.com/news/shame-east-brunswick-school-administrators-091138793.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Megahed was one of the audience of nearly 750 that crowded into the high school auditorium who spoke to the school board about the controversy which has roiled the suburban school district.\nWe also know the impact to students in East Brunswick and the entire East Brunswick community because of this oversight.\nThe 2024 East Brunswick High School yearbook removed the names of members of a Jewish student group and ran a photo of Muslim students instead.\nI will always be reminded of this distressing event every time I open my high school yearbook.\"\nThis article originally appeared on MyCentralJersey.com: East Brunswick NJ schools under fire for yearbook mistake", "location": "East Brunswick, New Jersey", "classification": "antisemitism", "score": 0.5365701439200331, "event_breakdown": "Title: East Brunswick NJ schools under fire for yearbook mistake\n| Location: East Brunswick, NJ, USA\nAntisemitism at East Brunswick high school hit a new level when the yearbook removed the names of members of a Jewish student group and ran a photo of Muslim students instead. As parents and the community react to this antisemitic event, they speak before the school board and address this oversight. The government has yet to respond."}, {"id": "32f90338-f14d-4b54-9788-d1700548dbe0", "title": "  Shame on you : East Brunswick school administrators under fire for yearbook mistake", "date": "2024-06-10 10:15", "url": "https://www.yahoo.com/news/shame-east-brunswick-school-administrators-091138498.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Megahed was one of the audience of nearly 750 that crowded into the high school auditorium who spoke to the school board about the controversy which has roiled the suburban school district.\nWe also know the impact to students in East Brunswick and the entire East Brunswick community because of this oversight.\nThe 2024 East Brunswick High School yearbook removed the names of members of a Jewish student group and ran a photo of Muslim students instead.\nI will always be reminded of this distressing event every time I open my high school yearbook.\"\nThis article originally appeared on MyCentralJersey.com: East Brunswick NJ schools under fire for yearbook mistake", "location": "East Brunswick", "classification": "antisemitism", "score": 0.5365701439200331, "event_breakdown": "event1:\nMaine Gov. Janet Mills on Monday signed a bill into law that requires the state’s education agency to develop guidelines for teaching about the Holocaust and other genocides, including the Armenian genocide and the the Holocaust, in K–12 classrooms.\nevent2:\nProtesters from both sides clashed inside a South Florida synagogue on Sunday in a standoff that turned violent.\nevent3:\nA federal judge on Wednesday ruled that members of the far-right Proud Boys who took part in a 2018 brawl with Antifa activists outside an NYC Republican club were engaged in constitutionally protected free speech."}, {"id": "64dc0506-2cc0-47d3-83f8-cba96b563b3b", "title": "New wave of diaspora Jews make aliyah amid war - The Jerusalem Post", "date": "2024-06-10 14:30", "url": "https://www.jpost.com/diaspora/article-805738", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The October 7 Hamas attack on Israel sparked an emotionally charged phenomenon: a new wave of Jews choosing to move to Israel despite the war, lack of safety, and numerous challenges.\nAs the war started, at first I was doubting my decision to come to Israel,” Amar explained.\n“When the war started, I saw that a lot of people who I grew up with were sharing pro-Palestine posts on Instagram.\nBesides the US, Israel has seen an influx of new immigrants coming from France, despite the ongoing war.\nToday, despite the difficulties of immigration and the danger of war, Israel’s new immigrants felt that living in a Jewish state was a positive experience.", "location": "Israel", "classification": "antisemitism", "score": 0.6764012797181768, "event_breakdown": "Target event/news focus - Increased emigration of French Jews moving to Israel\nNo relevant events were reported."}, {"id": "a55db8cf-7b9f-4742-972f-956f88f3f8de", "title": "One of the most Jewish elections in the country is in Northern Virginia", "date": "2024-06-10 18:15", "url": "https://www.jta.org/2024/06/10/politics/one-of-the-most-jewish-elections-in-the-country-is-in-northern-virginia", "domain": "jta.org", "domain_classification": "Unknown", "message": "WASHINGTON — Eileen Filler-Corn was the first Jewish speaker of the Virginia House of Delegates.\nThe growth in Northern Virginia has been exponential.”In addition to the invocations of Jewish identity in the race, pro-Israel money has poured into Filler-Corn’s campaign.\nFiller-Corn invoked a Jewish idea, tikkun olam, or repairing the world, that has become commonplace among Jewish Democrats.\nA 2018 population survey surprised local Jewish officials when it reported that Washington’s northern Virginia suburbs had a greater number of Jews than Maryland’s, where much of the Jewish community had long been centered.\nShe joined her synagogue’s pre-school board, and has had leadership positions on the Jewish Community Relations Council, the local American Jewish Committee chapter and the Jewish Foundation for Group Homes.", "location": "Virginia", "classification": "antisemitism", "score": 0.6760937726158768, "event_breakdown": "* A Virginia House of Delegates election race that is causing significant divisions within the Jewish community due to comments from a candidate that some say cast doubt upon their ability to serve their constituents and a controversy about pro-Israel money. (February 1, 2019)\n* Anti-Semitic graffiti and Nazi symbols were sprayed on a Northern Virginia Synagogue. The police are urging people to report hate incidents. (October 13, 2018)"}, {"id": "9a8ac98a-6527-4265-b76f-260cc9f46da7", "title": "The Israel - Hamas war has spurred protests on college campuses across the country . What has happened at Duke ? ", "date": "2024-06-10 19:00", "url": "https://www.dukechronicle.com/article/2024/04/duke-university-israel-hamas-war-encampments-protests-on-college-campuses-student-arrests-oct-7th-attacks-comparison", "domain": "dukechronicle.com", "domain_classification": "Unknown", "message": "Hundreds of students have been arrested at college campuses across the country amidst a flare-up of pro-Palestinian encampments and demonstrations in response to the Israel-Hamas war.\nEncampments emerge on college campusesPro-Palestinian encampments have arisen at over 40 college campuses, including Harvard, Yale, Princeton and the Massachusetts Institute of Technology.\nThe event included speeches and chants from Duke students and members of the UNC’s Students for Justice in Palestine chapter.\nThe rally drew over 50 pro-Palestinian protesters who gathered on the other side of the quad.\nPrice made a second statement in an Oct. 16 email to the Duke community urging respectful debate and discussion surrounding the Israel-Hamas war.", "location": "The main event takes place at Duke.", "classification": "antisemitism", "score": 0.8385468280352345, "event_breakdown": "Reported at Duke Mask Protest\nAbout 200 Pro-Palestinian protesters held a die-in at the Duke University Chapel to mark their hands with bright red paint. This protest displays both symbolic and scriptural imagery, with those lying down arranged so that the numbers 4 and 20 can be seen from above; these numbers refer to the April 20 date that the Israeli Defense Forces began a wave of violent aggression against Palestinians in the West Bank, Gaza, and Jerusalem."}]