[{"id": "5b7d33c8-9f7e-4c48-8b08-d17c621e655b", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\"", "location": "Moscow, Russia", "classification": "security", "score": 0.7431922073966853, "event_breakdown": "- Iranian Defense Minister Mohammad Reza Ashtiani stated that recent terrorist attacks in Iran and Russia are linked to the support of Western countries, especially the United States, to terrorist groups\n- Iran and Russia have been targeted by attacks from ISIS\n- ISIS orchestrated an explosion in Kerman, Iran in January, resulting in the death of nearly 100 people\n- Smoke rose above the burning Crocus City Hall concert venue following a reported shooting incident outside Moscow, Russia\n- An anonymous Israeli official mentioned that individuals eliminated in the incident in Moscow had been behind attacks on Israeli and American assets, with plans for more attacks"}, {"id": "c5e99aeb-4c3b-487c-9d54-68b29c6e5f15", "title": "Nato chief chides members as Ukraine allies say slow arms deliveries have helped Russia", "date": "2024-04-29 22:15", "url": "https://www.scmp.com/news/world/europe/article/3260842/nato-chief-chides-members-ukraines-allies-say-slow-arms-deliveries-have-helped-russia", "message": "Outgunned, Ukraine’s troops have struggled to fend off Russian advances on the battlefield.\n“Serious delays in support have meant serious consequences on the battlefield” for Ukraine, Nato Secretary General Jens Stoltenberg told a news conference in Kyiv with Ukrainian President Volodymyr Zelensky.\nDrawn-out Ukrainian efforts to mobilise more troops, and the belated building of battlefield fortifications, are other factors undermining Ukraine’s war effort, military analysts say.\nThe Russian military is in a better position at the moment.\n“Russian forces remain unlikely to achieve a deeper operationally significant penetration in the area in the near term,” the Institute for the Study of War said in an assessment Sunday.", "location": "Kyiv", "classification": "world", "score": 0.5866176253955832, "event_breakdown": "- Ukrainian troops struggling to fend off Russian advances on the battlefield\n- Nato Secretary General Jens Stoltenberg highlighting serious delays in support for Ukraine\n- Ukrainian efforts to mobilise more troops and build battlefield fortifications facing challenges\n- Russian military currently in a better position than Ukrainian forces\n- Assessment by the Institute for the Study of War stating that Russian forces are unlikely to achieve a deeper operationally significant penetration in the near term."}, {"id": "a0f27da8-e1ed-4f4c-8301-b8918334fede", "title": "Iran Claims Coalition of Ten Countries Helped Israel Block Missile Barrage", "date": "2024-04-29 23:00", "url": "https://www.breitbart.com/national-security/2024/04/29/iran-claims-coalition-of-ten-countries-helped-israel-block-missile-barrage/", "message": "According to the Israel Defense Forces (IDF), “99 percent” of all objects fired at Israel were intercepted, including all drones and cruise missiles.\nSharif reportedly accused ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n“Operation True Promise was not a military exercise but the scene of a real operation,” Sharif said, using the official Iranian term for the inept bombing.\nWhile those partnerships are well-known, several reports indicated that multiple Muslim countries within the Middle East also intercepted Iranian missiles.\nPressTV did not specify what information Sharif was using to accuse ten unnamed countries of supporting Israel.", "location": "Israel", "classification": "world", "score": 0.38873990080251836, "event_breakdown": "- IDF reports that 99% of objects fired at Israel were intercepted\n- Sharif accuses ten countries of supporting Israel to make a false case\n- Operation True Promise referred to as a real operation by Sharif\n- Multiple Muslim countries in the Middle East intercepted Iranian missiles, according to reports\n- PressTV does not specify the information Sharif used to accuse ten unnamed countries"}, {"id": "70a5020b-76d0-418b-8126-984e9050115b", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "Gaza", "classification": "security", "score": 0.9755571757962365, "event_breakdown": "- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in northern Gaza\n- Troops identified terrorists at the launch location in northern Gaza and eliminated them\n- Two terrorists were identified advancing towards troops in central Gaza \n- Fighter jets struck the structure, eliminating the terrorist in central Gaza\n- Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam in southern Lebanon"}, {"id": "a781db75-61cb-4e35-8296-cd43247140e9", "title": "Ukraine updates : Russia strikes Odesa for 2nd time this week – DW – 05 / 01 / 2024", "date": "2024-05-01 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-2nd-time-this-week/a-68967110", "message": "Russia has pummeled the vital port city of Odesa, stepping up aerial attacks that have also damaged civilian infrastructure there, according to Ukrainian officials.\nAt least three people were killed and three more injured in a Russian missile strike on the Ukrainian city of Odesa in the early hours of Wednesday morning, local authorities said.\nAs a consequence of the attack, three people were killed and three more wounded,\" wrote Gennadiy Trukhanov, the mayor of the southwestern port city, on Telegram.\nThe attack comes just two days after Russian missiles struck an educational institution in the city, killing five people.\nAccording to Shmyhal, Ukraine had previously earmarked 43.3 billion hryvnia for the purchase of drones this year.", "location": "Odesa", "classification": "security", "score": 0.8820837055918667, "event_breakdown": "- Russian aerial attacks on the city of Odesa result in civilian casualties\n- Three people killed and three injured in a missile strike on Odesa\n- Mayor Gennadiy Trukhanov confirms casualties from the attack\n- Previous missile strike on an educational institution in Odesa resulted in five deaths\n- Ukraine had allocated 43.3 billion hryvnia for drone purchases"}, {"id": "bd377a84-e9e5-4249-9a20-ea05c0805c24", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "location": "Mogadishu", "classification": "security", "score": 0.5268761109185044, "event_breakdown": "- Six employees of Hormuud Telecom, Somalia, killed in roadside blast on outskirts of Mogadishu\n- Government describes attack as deliberate targeting of commercial companies in Somalia\n- Previous explosions have targeted Hormuud Telecom branches and vehicles in Mogadishu and beyond\n- Hormuud Telecom expresses deepest condolences to families and friends of victims\n- Investigation into the attack ongoing as families and Hormuud Telecom community mourn the loss of their colleagues"}, {"id": "18e8294e-e423-4507-97bc-e6dd1670a530", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9537699385755353, "event_breakdown": "- Israeli airstrike kills 22, including at least one infant and a toddler, in Rafah, Gaza.\n- Mahmoud Abu Taha holds up body of baby boy, denouncing targeting of civilians.\n- Video reveals 10 relatives of Abu Taha family killed in the airstrike.\n- Some victims previously displaced from Khan Younis, where they were also targeted in a prior Israeli airstrike."}, {"id": "3d3cb552-195d-4db1-87b4-df228968c92c", "title": "Sydney church stabbing : Teen alleged terrorism texts , claims he wanted to  kill non believers  ", "date": "2024-04-30 10:30", "url": "https://www.nzherald.co.nz/world/sydney-church-stabbing-teens-alleged-terrorism-texts-claims-he-wanted-to-kill-non-believers/OUECF7DEZNDHHKQVO2BCBQEPDU/", "message": "A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences following the Sydney church stabbing allegedly sent text messages declaring he was “going to kill non-believers” before the attack was carried out by an alleged associate.\nHis alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.", "location": "Sydney", "classification": "security", "score": 0.4260738952908896, "event_breakdown": "- A 16-year-old boy was charged with terrorism offences in connection with the Sydney church stabbing.\n- The boy allegedly declared he was \"going to kill\" in messages about carrying out a plan against non-believers.\n- The attack was carried out by an alleged associate of the boy.\n- The alleged attacker was charged with terrorism offences.\n- Four others, believed to be associates, were arrested following widespread search warrants."}, {"id": "3ac3d854-827c-4d93-983f-54881343ef0c", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA", "classification": "security", "score": 0.47245463261582726, "event_breakdown": "- Russian missile attack targets educational institution in Odesa, Ukraine.\n- Attack kills at least five people and injures 32.\n- Footage shows severe damage to the roof of a private law academy.\n- Odesa Mayor Hennadii Trukhanov describes witnessing missile strike in video posted on Telegram.\n- Russian missile attack on an educational institution in Odesa, Ukraine\n- Attack killed at least five people and injured 32\n- The educational institution targeted was a private law academy in a popular seafront park\n- Odesa Mayor Hennadii Trukhanov's reaction to the attack\n- Odesa being a frequent target of Russian missile and drone attacks, particularly targeting port infrastructure"}, {"id": "0ee95d6f-efa0-4dda-9162-1808f1d57862", "title": "Wakeley church stabbing : Teens allegedly discussed bombs , guns in group chats", "date": "2024-04-30 07:30", "url": "https://www.brisbanetimes.com.au/national/nsw/we-re-gonna-kill-teens-allegedly-discussed-bombs-guns-in-groups-chats-20240430-p5fnrv.html", "message": "A group of teenagers discussed carrying out a terrorism attack and a desire to kill before they were arrested in anti-terrorism raids last Wednesday, a court has heard.\nThe conversations took place in group chats after the alleged stabbing of Bishop Mar Mari Emmanuel during a live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15.\nThe father of a teenager accused of stabbing a priest in a Wakeley church leaves Parramatta Children’s Court.\nCredit: Janie BarrettNine days later, anti-terrorism police raided a dozen south-west suburbs and have arrested six young people, including a 16-year-old boy, who was charged with conspiring to prepare or plan for a terrorist act.\nThat 16-year-old has been in custody since his arrest a week ago and was refused bail at Parramatta Local Court on Tuesday by Magistrate Janet Wahlquist.", "location": "Wakeley", "classification": "world", "score": 0.4096534934535242, "event_breakdown": "- Group of teenagers discussing terrorism attack and desire to kill in group chats\n- Alleged stabbing of Bishop Mar Mari Emmanuel during live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15\n- Anti-terrorism police raid a dozen south-west suburbs and arrest six young people\n- 16-year-old boy charged with conspiring to prepare or plan for a terrorist act\n- 16-year-old boy refused bail at Parramatta Local Court by Magistrate Janet Wahlquist"}, {"id": "136e15ae-3d5a-40a1-a92b-cc069da08534", "title": "Missile attack by Yemen Houthi rebels damages a ship in Red Sea", "date": "2024-05-01 06:15", "url": "https://www.sunstar.com.ph/network/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-red-sea", "message": "JERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, April 29, 2024, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Bab el-Mandeb Strait", "classification": "security", "score": 0.5488933144612118, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in the Red Sea on April 29, 2024\n- Italian frigate shoots down Houthi drone near Bab el-Mandeb Strait on April 29, 2024\n- Decline in shipping through the Red Sea and Gulf of Aden due to security threat\n- US military shoots down five drones over the Red Sea on Sunday morning"}, {"id": "156318ff-6543-4872-b401-75d51adca102", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5068969617636545, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in Red Sea, latest assault in campaign against shipping.\n- UKMTO reports ship damage from attack; crew safe, heading to next port of call.\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait between Red Sea and Gulf of Aden.\n- Threat of attacks leads to decline in shipping through Red Sea and Gulf of Aden.\n- US military intercepts and destroys five drones over Red Sea, according to Central Command."}, {"id": "ebc6ab95-2c4c-40a7-9937-2617dedc00f9", "title": "World News : Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 12:45", "url": "http://www.gdnonline.com/Details/1311004", "message": "ODESA, Ukraine - A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy's president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA", "classification": "world", "score": 0.451879256815849, "event_breakdown": "- Russian missile attack on an educational institution in Odesa, Ukraine\n- Attack resulted in at least five deaths and 32 injuries\n- The targeted institution was a private law academy located in a popular seafront park\n- Odesa Mayor Hennadii Trukhanov expressed shock at the devastation caused by the strike\n- Academy's president, Serhiy Kivalov, a former member of parliament, was injured in the attack\n- Odesa has been repeatedly targeted by Russian missile and drone attacks, particularly on port infrastructure."}, {"id": "2fd952b8-4acc-4012-acdb-7168b9dcd649", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5457119768814919, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- US military shoots down five drones over the Red Sea"}, {"id": "5f6668fa-c0a3-4852-b12c-27d28aa063ec", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group.", "location": "Mokha, Yemen", "classification": "security", "score": 0.8422909504198774, "event_breakdown": "- Houthi rebels in Yemen attacked two US destroyers and two vessels in the Red Sea with drone strikes off the coast of Mokha, Yemen.\n- The attack caused damage to one of the ships, but the crew was reported safe and heading to its next port of call.\n- The United Kingdom Maritime Trade Operations center issued a warning for vessels to exercise caution in the area.\n- The Houthis did not immediately acknowledge the attack, leading to suspicions about their involvement."}, {"id": "0efb81e6-0814-48fb-8f8a-fd7f8cb076c9", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "Odesa", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- Russian missile strike kills five, injures 32 in Odesa, Ukraine; day of mourning declared.\n- Russia claims to have shot down six U.S.-supplied ATACMS missiles.\n- Uncertainty over number of ATACMS missiles provided to Ukraine.\n- Warning issued as undetonated submunitions scatter after missile interception.\n- ATACMS used to target Russian-occupied territory following interception."}, {"id": "2c725bb1-82ba-47a6-b8fb-487d105b0285", "title": "  First Told Pakistan About Balakot Airstrike : Modi on New India  Fight from Front  Policy", "date": "2024-04-30 03:45", "url": "https://www.news18.com/elections/first-told-pakistan-about-balakot-airstrike-pm-modi-on-new-indias-fight-from-front-policy-8871364.html", "message": "Prime Minister Narendra Modi has revealed the untold story of how he ensured Pakistan was the first to officially hear about the 2019 Balakot airstrike.\n“I instructed our forces to notify media about the airstrike, albeit after I had informed Pakistani authorities over phone that we have carried out an airstrike, killed these many people and caused this much destruction,” the prime minister said on Monday.\nPM Modi further stated that when he had dialled the neighbouring country, “they wouldn’t take calls”.\nEarlier this year, while delivering a keynote address at the Network18 Rising Bharat Summit 2024, PM Narendra Modi had recalled that when he was at the conclave five years ago, a significant event took place soon after.\nWhether terrorist masterminds or countries seeking peace and development, everyone has experienced the phenomenon of Rising Bharat, the PM said at the summit.", "location": "Balakot", "classification": "world", "score": 0.6551443808544122, "event_breakdown": "1. Prime Minister Narendra Modi reveals the untold story of informing Pakistan about the 2019 Balakot airstrike.\n2. PM Modi instructs forces to notify media about the airstrike after informing Pakistani authorities over the phone.\n3. PM Modi mentions that when he called Pakistan, they wouldn't take the calls.\n4. PM Modi recalls a significant event that took place five years ago at a conclave.\n5. PM Modi speaks about the Rising Bharat phenomenon during the Network18 Rising Bharat Summit 2024."}, {"id": "bd8b4ccc-2637-4c6f-87c1-baa92e747951", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.46026327135311396, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- Italian frigate shoots down a Houthi drone near the Bab el-Mandeb Strait\n- US military shoots down five drones over the Red Sea"}, {"id": "0339cb1c-9d2b-4f9c-a07b-ad29320f244a", "title": "Three killed as Russia attacks Odesa with ballistic missiles for the second day in a row", "date": "2024-05-01 09:30", "url": "https://www.yahoo.com/news/three-killed-russia-attacks-odesa-081400948.html", "message": "Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30, Odesa Governor Oleh Kiper said.\n\"Three people died in Odesa,” said Presidential Office head, Andriy Yermak, on the morning of May 1.\n“Ballistic missiles hit a large, peaceful city at night.\nResidential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET.\n\"Russia is launching ballistic missiles against us for the second day in a row.”He urged civilians to pay attention to air raid alarms and stay in shelters.", "location": "Odesa", "classification": "security", "score": 0.9820033226101117, "event_breakdown": "- Russian strike on Odesa kills three, injures three; residential buildings damaged, windows shattered.\n- Odesa Governor confirms three deaths and injuries from ballistic missile attack on April 30.\n- Odesa Mayor reports damage to residential buildings due to enemy's night attack; urges civilians to heed air raid alarms and seek shelter."}, {"id": "379c6d6f-2d14-4159-be2e-c63949553d8e", "title": "Russian missile kills three in Ukrainian port of Odesa", "date": "2024-05-01 00:45", "url": "https://www.devdiscourse.com/article/law-order/2923457-russian-missile-kills-three-in-ukrainian-port-of-odesa", "message": "A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa early on Wednesday, regional Governor Oleh Kiper said.\nHe said the strike was carried out by a ballistic missile, but provided no further details.\nKiper and Odesa Mayor Hennadii Trukhanov had reported a series of loud explosions.\nOn Monday, a Russian missile struck an educational institution in the city, killing five people.\nOdesa has been a frequent target of Russian forces in the more than two-year-old war, with many attacks aimed at the city's port facilities.", "location": "Odesa", "classification": "security", "score": 0.9427670113474113, "event_breakdown": "1. Russian missile attack in Odesa kills three, injures three\n2. Loud explosions reported by Governor Oleh Kiper and Mayor Hennadii Trukhanov\n3. Previous missile strike in Odesa at an educational institution kills five people"}, {"id": "12b9241a-c140-46fb-8a8d-469f0b7b0941", "title": "Another day , another hitjob : Why American media loves to hate democratic India", "date": "2024-04-30 15:15", "url": "https://www.firstpost.com/opinion/another-day-another-hitjob-why-american-media-loves-to-hate-democratic-india-13765635.html", "message": "AdvertisementThis, however, is just one of the many hitjobs in recent times by the Western media against India and particularly the Narendra Modi government.\nAdvertisementMaybe that is the dubious nature of the Western ‘liberal’ order: They are liberal, democrat and a free speech enthusiast only when it suits them.\nAnd he remains the hero of the Western liberal world.\nIt’s unfortunate that the Western media, a self-appointed vanguard of democracy and liberalism, has become a tool in the hands of toolkit gangs and vested interests.\nThe time is ripe to further bolster this relationship, and this would be possible only when hitjobs, of the kind we are witnessing in the American media, are substantially reduced, if not completely curbed.", "location": "American media", "classification": "world", "score": 0.24896449094967515, "event_breakdown": "- Western media's recent hitjobs against India and the Narendra Modi government\n- Western 'liberal' order being liberal, democrat, and free speech enthusiast only when it suits them\n- Narendra Modi seen as the hero of the Western liberal world\n- Western media becoming a tool in the hands of toolkit gangs and vested interests\n- Need to reduce or curb hitjobs in the American media for a stronger India-West relationship"}, {"id": "ff6fefbe-68ac-4c1d-90cf-b0b44a36fea3", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5358856195628724, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels in the Red Sea damaging a ship\n- Italian frigate Virgino Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "382ec6c9-7b8a-4aa7-8c5d-61123e152ae0", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.nola.com/ap/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_428d0b4e-4be8-5026-992d-ae8f7ea21c23.html", "message": "Likely missile attack by Yemen's Houthi rebels damages a ship in the Red SeaA suspected missile attack by Yemen’s Houthi rebels targeted a ship in the Red Sea, the latest assault in their campaign against international shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.9414326694106652, "event_breakdown": "- Likely missile attack by Yemen's Houthi rebels damages a ship in the Red Sea"}, {"id": "4a2d6465-8aa9-4cbc-bca3-2dc8e32e61d9", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "Odesa", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- A day of mourning declared in Odesa after a Russian missile strike kills five and injures 32  \n- Russia claims to have shot down six U.S.-supplied ATACMS missiles  \n- Uncertainty over the number of ATACMS missiles provided to Ukraine  \n- Warning issued about undetonated submunitions scattered from ATACMS missiles  \n- ATACMS used to strike targets in Russian-occupied territory"}, {"id": "b08fefd7-09dd-455d-a4fe-52f8cc6a75bb", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-30 14:30", "url": "https://www.egyptindependent.com/my-whole-family-has-perished-22-killed-in-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza CNN —Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAbed Rahim Khatib/Anadolu/Getty ImagesAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8828711026621543, "event_breakdown": "- Israeli airstrike kills 22 people in Rafah, Gaza\n- Members of the Abu Taha family, including an infant and a toddler, killed in the airstrike\n- Some Abu Taha family members were originally displaced from Khan Younis due to a previous Israeli airstrike"}, {"id": "2c304d88-6aa1-4334-bd4e-8f5d5616e395", "title": "Ukraine war briefing : Russia making gains from slow western aid , says Nato chief", "date": "2024-04-30 01:15", "url": "https://www.theguardian.com/world/2024/apr/30/ukraine-war-briefing-russia-making-gains-from-slow-western-aid-says-nato-chief", "message": "Ukrainian navy spokesperson Dmytro Pletenchuk said the strike was conducted by an Iskander-M ballistic missile with a cluster warhead.\nA Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday, according to local officials.\nUkraine’s allies have accused North Korea of transferring weapons to Russia for use against Ukraine in violation of an arms embargo.\nThe US has accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\nRussia in March vetoed the renewal of sanctions monitoring against North Korea’s nuclear and ballistic missile programmes.", "location": "Kharkiv", "classification": "security", "score": 0.667125687365189, "event_breakdown": "- Russian strike in Kharkiv, Ukraine killing at least two and injuring six\n- Accusations of North Korea transferring weapons to Russia for use against Ukraine\n- US accusation of Russia launching North Korean-supplied ballistic missiles against Ukraine on multiple occasions\n- Russia vetoed the renewal of sanctions monitoring against North Korea's nuclear and ballistic missile programs"}, {"id": "1acb3eb5-23d7-4948-a16a-79e1a6666862", "title": "  My whole family has perished : 20 dead after Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 17:00", "url": "https://abc17news.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8657975260247653, "event_breakdown": "- Israeli airstrike over Rafah, Gaza kills 22 people, including an infant and a toddler\n- Mahmoud Abu Taha showcases baby boy's body, denouncing the targeting of civilians\n- Video shows another member of Abu Taha family revealing 10 relatives killed in airstrike\n- Some victims were originally displaced from Khan Younis, where they were previously killed in an Israeli airstrike\n- Remaining family members who fled to Rafah for safety are also killed in the overnight airstrike"}, {"id": "8ccd44dd-8904-4082-94df-28cdad66ced2", "title": "Middle East Totters on the Edge of a Cliff as two Arch enemies Confront Each Other", "date": "2024-04-30 22:00", "url": "https://thenorthlines.com/middle-east-totters-on-the-edge-of-a-cliff-as-two-arch-enemies-confront-each-other/", "message": "Syria movesto the centre stageof conflict betweenIsrael and IranBy James M DorseyMultiple overt and covert wars have pushed the Middle East to the edge of a cliff.\nIncreased tension between Iran and Israel complicates efforts to pull the Middle East back from the abyss.\nWith the two archenemies walking a fine line between waging covert or overt war, escalation between Israel and Iran has the greatest potential to push the Middle East off the cliff.\nThe US and Israeli denials followed a series of tit-for-tat attacks that threatened to suck Israel, Iran, and potentially the United States into an all-out Middle East war.\nThe Gaza war moved Syria centrestage in the covert Israeli-Iranian confrontation.", "location": "Syria", "classification": "security", "score": 0.6322685986811983, "event_breakdown": "- Syria becomes central stage in conflict between Israel and Iran.\n- Middle East pushed to edge of cliff by multiple overt and covert wars.\n- Tension escalates between Iran and Israel, complicating efforts to de-escalate.\n- Tit-for-tat attacks raise risk of all-out war involving Israel, Iran, and potentially the United States.\n- Gaza war shifts focus to covert Israeli-Iranian confrontation, with Syria playing a key role."}, {"id": "a4fa0a20-7b39-45f4-b984-677d143aa09b", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-04-30 21:30", "url": "https://www.yahoo.com/news/five-killed-russian-missile-attack-195300897.html", "message": "At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- At least five people killed and over 30 injured in a Russian missile attack on Odesa, Ukraine\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack\n- Russian military suspected of using cluster munitions to inflict large number of casualties\n- Convention on Cluster Munitions prohibits the use, transfer, and production of cluster munitions\n- Russian officials claim air defenses in Crimea intercepted a major missile and drone attack by Ukraine"}, {"id": "164cad0a-eeea-48f6-99f1-202f371144ce", "title": "Ukraine  Harry Potter castle  goes up in flames as Russian missile attack kills 5", "date": "2024-04-30 22:30", "url": "https://www.cnn.com/2024/04/30/europe/ukraine-harry-potter-castle-missile-attack-intl-latam/", "message": "CNN —At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack kills five, injures over 30 in Odesa, Ukraine.\n- Ukraine alleges Russia used Iskander ballistic missile and cluster munitions in the attack.\n- Investigation suggests Russian military deliberately used cluster munitions to cause casualties.\n- Use of cluster munitions prohibited by international treaty.\n- Russian officials claim successful interception of major missile and drone attack by Ukraine using air defenses in Crimea."}, {"id": "785630c4-8667-4243-b55d-c96c1df54ef2", "title": "Portuguese - Flagged Ship Is Hit Far in Arabian Sea , Raising Concerns over Houthi Rebel Capabilities", "date": "2024-04-30 23:00", "url": "https://www.military.com/daily-news/2024/04/30/portuguese-flagged-ship-hit-far-arabian-sea-raising-concerns-over-houthi-rebel-capabilities.html", "message": "JERUSALEM — A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nGen. Yahya Saree, a military spokesman for Yemen's Houthi rebels, claimed the attack on the Orion early Tuesday.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.", "location": "Yemen's shoreline", "classification": "security", "score": 0.8782016362926929, "event_breakdown": "- A Portuguese-flagged container ship, MSC Orion, comes under attack by a drone in the far reaches of the Arabian Sea\n- Yemen's Houthi rebels claim responsibility for assaulting the MSC Orion\n- The attack on the MSC Orion is believed to be due to its perceived Israeli affiliation\n- Gen. Yahya Saree, a military spokesman for Yemen's Houthi rebels, claims responsibility for the attack on the MSC Orion"}, {"id": "e8358e16-d467-4ec2-9d14-b6a7b273a733", "title": "Suspected missile attack by Yemen Houthi rebels damages ship in the Red Sea : authorities", "date": "2024-04-29 19:45", "url": "https://www.theglobeandmail.com/world/article-suspected-missile-attack-by-yemens-houthi-rebels-damages-ship-in-the/", "message": "Open this photo in gallery: Yemen's capital Sana'a is seen on a map.The Associated PressA suspected missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virginio Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led air strike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Sana'a", "classification": "security", "score": 0.5616577975065878, "event_breakdown": "- Suspected missile attack by Yemen’s Houthi rebels damaging a ship in the Red Sea\n- Italian frigate Virginio Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "b0b7ed56-7cbd-48f8-9fee-24bb0efc9757", "title": "Hamas alleges rocket barrage from Lebanon into northern Israel", "date": "2024-04-29 16:00", "url": "https://dailystar.com.lb/hamas-rocket-barrage-lebanon-northern-israel/", "message": "On Monday, the Ezzedine al-Qassam Brigades, the military wing of Hamas, launched a series of rockets from southern Lebanon targeting a northern Israeli military command center.\nIn response, the Israeli military reported intercepting most of the approximately 20 rockets launched from Lebanon and conducted strikes on the launch sites.\nFollowing the rocket barrage, an Israeli drone struck the town of Aita al-Shaab in southern Lebanon.\nEarlier in the year, a U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut, a Hezbollah stronghold.\nIn March, another Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre, while a Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley.", "location": "Aita al-Shaab", "classification": "security", "score": 0.997549179367563, "event_breakdown": "- Ezzedine al-Qassam Brigades launched rockets from southern Lebanon targeting northern Israeli military command center\n- Israeli military intercepted rockets launched from Lebanon and conducted strikes on launch sites\n- Israeli drone struck town of Aita al-Shaab in southern Lebanon in response\n- U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut\n- Israeli strike in March killed a Hamas operative near Rashidiyeh Palestinian refugee camp in Tyre\n- Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley"}, {"id": "09951721-8faf-45c1-ac2a-ce2f2cad58ce", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "Odesa", "classification": "security", "score": 0.3885877145857738, "event_breakdown": "- Russian missile attack targets educational institution in Odesa's seafront park, killing five and injuring 32.\n- Roof of private law academy destroyed in strike, as shown in Reuters Television footage.\n- Odesa Mayor Trukhanov expresses shock in Telegram video following the attack.\n- President of academy, former MP Serhiy Kivalov, among the injured, reports public broadcaster Suspilne.\n- Odesa continues to face frequent Russian missile and drone attacks, with port infrastructure being a particular target."}, {"id": "9dedb8f8-c786-4631-a765-20e8f04249fc", "title": "Handing Iran a Victory", "date": "2024-04-30 06:15", "url": "https://pjmedia.com/james-robbins/2024/04/29/handing-iran-a-victory-n4928600", "message": "Iran launched around 300 weapons from locations in Iran, Syria, and Yemen, including over 110 medium-range ballistic missiles, more than 30 land-attack cruise missiles, and over 150 uncrewed aerial vehicles.\nThe numbers tell us this was a concerted attack, a major effort by Iran to inflict pain on Israel.\nOnly a few of the incoming Iranian weapons got through, and they did little material damage.\n“I found few people out there who really believe Khe Sanh could be held if the North Vietnamese were determined to take it,” he reported .\nImagine if those 300 Iranian weapons had gotten through.", "location": "Iran, Syria, and Yemen", "classification": "security", "score": 0.6979940990679672, "event_breakdown": "- Iran launches around 300 weapons from Iran, Syria, and Yemen, including ballistic missiles, land-attack cruise missiles, and unmanned aerial vehicles.\n- Attack characterized as major effort by Iran to inflict pain on Israel.\n- Only a few Iranian weapons penetrate defenses, causing little material damage.\n- Hypothetical scenario raised: consequences if all 300 Iranian weapons had penetrated defenses."}, {"id": "a3ad7f5c-01f4-4b85-a121-a39fec825424", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames - LocalNews8 . com", "date": "2024-04-30 23:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "By Radina Gigova and Olga Voitovych, CNN(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Five people killed and over 30 injured in a Russian missile attack on Odesa, Ukraine\n- Ukrainian authorities suspect Russia used an Iskander ballistic missile and cluster munitions in the attack\n- Investigation suggests Russian military used cluster munitions with intent to cause significant casualties\n- Use, transfer, and production of cluster munitions prohibited by the Convention on Cluster Munitions\n- Russian officials claim successful interception of major missile and drone attack by Ukraine"}, {"id": "e34cccae-8916-48a2-99ce-bb0bb3155a47", "title": "Ship attacked by drone in Arabian Sea , Houthi rebels take responsibility", "date": "2024-05-01 02:15", "url": "https://www.foxnews.com/world/portuguese-flagged-ship-targeted-arabian-sea-drone-assault-houthi-rebels-claim-responsibility", "message": "A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses \"that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,\" the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "Arabian Sea", "classification": "security", "score": 0.838042406233834, "event_breakdown": "- A Portuguese-flagged container ship was attacked by a drone in the Arabian Sea\n- The attack corresponded with a claim by Yemen's Houthi rebels\n- The MSC Orion, associated with London-based Zodiac Maritime, was targeted due to its perceived Israeli affiliation\n- The rebel group released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier"}, {"id": "7be494b6-30f9-45a8-ab65-d35d084af387", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-05-01 01:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "Odesa", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "1. Five people killed and over 30 injured in a Russian missile attack on Odesa, Ukraine\n2. Ukrainian authorities suspect Russia used Iskander ballistic missile and cluster munitions in the attack\n3. The use of cluster munitions is prohibited by the Convention on Cluster Munitions\n4. Russian officials claim successful interception of a missile and drone attack by Ukraine"}, {"id": "64aaacb9-f2a9-445e-a9ff-e120697952d9", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.", "location": "CAIRO", "classification": "security", "score": 0.3917279483742275, "event_breakdown": "- Hamas delegation leaves Cairo after cease-fire talks"}, {"id": "3b5f8b38-edb6-4ed4-9a53-ae874a96f214", "title": "Sydney teenager charged after counter - terrorism raids texted  were going to kill , court hears | Australia news", "date": "2024-04-30 10:15", "url": "https://www.theguardian.com/australia-news/2024/apr/30/sydney-teenager-charged-after-counter-terrorism-raids-texted-were-going-to-kill-court-hears-ntwnfb", "message": "A 16-year-old Sydney boy charged with terrorism offences has been denied bail over fears for community safety after a court heard he messaged another young person “we’re going to kill”.\nSix teenagers were charged after counter-terrorism raids in Sydney last week, with two of them appearing in the children’s court at Parramatta on Tuesday.\n“We were planning big stuff bro, it’s conspiracy for a terrorist attack I think,” the court heard he wrote in a text message.\nThe court heard the 16-year-old’s parents, who were present for the hearing, wrote an affidavit describing an “excellent son” who was a good student.\nThe material allegedly included a video of an assault with the Islamic State symbol watermarked over the video.", "location": "Parramatta", "classification": "entertainment", "score": 0.41021048371286883, "event_breakdown": "- 16-year-old Sydney boy charged with terrorism offenses denied bail due to concerns for community safety.\n- Court hears boy messaged another young person stating \"we're going to kill.\"\n- Six teenagers charged after counter-terrorism raids in Sydney, two appear in children's court at Parramatta.\n- Text message presented in court suggests planning for a terrorist attack.\n- Parents of 16-year-old describe him as an \"excellent son\" and good student in affidavit.\n- Material allegedly includes video of assault with Islamic State symbol watermarked over it."}, {"id": "88e27ed7-5975-4939-a882-144ce20feee8", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.thesunchronicle.com/news/nation_world/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_21ecb329-1284-53b0-9574-d499c18dc8a3.html", "message": "Authorities said a missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea in the latest assault in their campaign against shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.7998231551022632, "event_breakdown": "- Houthi rebels from Yemen launch missile attack in Red Sea.\n- Attack damages ship in latest assault targeting maritime traffic in strategic waterway."}]