[{"id": "f3b272f4-a811-4e93-b5fb-daa0dc168287", "title": "Al - Bureij battalion Salah Jamil Muhammad Emad eliminated by Israel", "date": "2024-05-05 12:00", "url": "https://www.jpost.com/israel-hamas-war/article-799901", "message": "In the attack, several other terrorists who were with him in the terrorist infrastructure of the organization were eliminated.\nIDF airstrike targets Hamas terrorist infrastructure.\nAt the same time, Gaza Division soldiers attacked a Hamas launching area, which contained rockets that were ready to be launched to Israel's south, with artillery fire.\nIn the past day, fighter jets and aircraft of the Air Force attacked additional terror targets in Gaza, including military buildings, terrorist infrastructures, and weapons warehouses.\nAir Force aircraft directed by the Gaza Division killed three Hamas terrorists in the Jabaliya area, including a deputy company commander and two other terrorists from the organization.", "location": "Jabaliya", "classification": "security", "score": 0.9963829105454725, "event_breakdown": "- IDF airstrike targets Hamas terrorist infrastructure.\n- Gaza Division soldiers attacked a Hamas launching area with artillery fire.\n- Fighter jets and aircraft of the Air Force attacked additional terror targets in Gaza.\n- Air Force aircraft directed by the Gaza Division killed three Hamas terrorists in the Jabaliya area."}, {"id": "d5e399e4-fea5-41ad-ad23-29e2df7e1c26", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809715-Israel-attacks-Rafah-after-Hamas-claims-responsibility-for-deadly-rocket", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackWorld World Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it also struck a \"military structure\"Follow on Published On: Mon, 06 May 2024 08:44:32 PKTCAIRO (Reuters) – Three Israeli soldiers were killed in a rocket attack claimed by Hamas, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas's armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.", "location": "Rafah", "classification": "security", "score": 0.9941729451630361, "event_breakdown": "- Hamas claims responsibility for deadly rocket attack near Rafah\n- Israeli airstrike hits house in Rafah, killing three people and wounding several others\n- Israeli military confirms counter-strike, targeting launcher and military structure\n- Israeli air strike kills nine Palestinians, including a baby, in another house in Rafah"}, {"id": "94b3ad96-6d8f-49e2-91c0-672efda1fec9", "title": "19 killed in Rafah as Israel retaliates to deadly Hamas rocket attack", "date": "2024-05-06 04:00", "url": "https://www.firstpost.com/world/19-killed-in-rafah-as-israel-retaliates-to-deadly-hamas-rocket-attack-13767464.html", "message": "ReutersThree Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nThe war began after Hamas stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Rafah", "classification": "security", "score": 0.9922319617356419, "event_breakdown": "1. Three Israeli soldiers were killed in a rocket attack near the southern Gaza Strip city of Rafah.\n\n2. Hamas's armed wing claimed responsibility for an attack on the Kerem Shalom crossing into Gaza, resulting in the death of three Israeli soldiers.\n\n3. Shortly after the Hamas attack, an Israeli airstrike hit a house in Rafah, killing three people and wounding several others.\n\n4. Just before midnight, an Israeli airstrike killed nine Palestinians, including a baby, in another house in Rafah.\n\n5. The war began after a Hamas cross-border raid on October 7, in which 1,200 people were killed and 252 hostages were taken."}, {"id": "35d700ed-e012-46e9-924b-f5a993dfd920", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 04:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374065.html", "message": "The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".", "location": "The main location where the main event takes place is Kerem Shalom crossing into Gaza.", "classification": "security", "score": 0.9942941143000886, "event_breakdown": "1. The armed wing of Palestinian Islamist group Hamas claimed responsibility for an attack on the Kerem Shalom crossing into Gaza, resulting in the death of three Israeli soldiers.\n2. Hamas fired rockets at an Israeli army base near the crossing, but the exact location from where they were launched remains unconfirmed.\n3. A source close to Hamas stated that the commercial crossing was not the intended target.\n4. In response to the Hamas attack, the Israeli military conducted an airstrike on a house in Rafah, causing the deaths of three individuals and injuring several others according to Palestinian medics.\n5. The Israeli military confirmed the retaliatory strike, targeting both the launcher used in the Hamas attack and a nearby \"military structure\"."}, {"id": "e78bd333-69cb-417b-8185-e6b4811b0a5f", "title": "IDF orders Palestinians to evacuate eastern Rafah ahead of planned offensive", "date": "2024-05-06 09:00", "url": "https://www.firstpost.com/world/idf-rafah-israel-hamas-war13767512-13767512.html", "message": "ReutersThe Israeli Defense Forces (IDF) on Monday began calling on Palestinians in eastern Rafah to evacuate as Israel moves a step closer to expanding its attack in southern Gaza city.\nAccording to a report by the Times of Israel, Palestinian civilians are being ordered to move to an expanded humanitarian zone in the al-Mawasi and Khan Younis areas.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing but did not confirm where it fired them from.\n“We are observing worrying signs that Hamas does not intend to reach an agreement with us,” Gallant said.\n“This means strong military action in Rafah will begin in the very near future, and in the rest of the Strip.”AdvertisementWith inputs from Reuters", "location": "Rafah", "classification": "security", "score": 0.9711334095028176, "event_breakdown": "- Israeli Defense Forces calling on Palestinians to evacuate eastern Rafah in Gaza\n- Palestinian civilians ordered to move to an expanded humanitarian zone in al-Mawasi and Khan Younis areas\n- Hamas' armed wing firing rockets at an Israeli army base\n- Israeli official expressing concerns about Hamas' intentions and hinting at strong military action in Rafah and the rest of the Gaza Strip"}, {"id": "2f48ce1b-c0f3-423b-84fa-a8fdc837026c", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/hamas-armed-wing-claims-responsibility-for-deadly-attack-on-israel-gaza-crossing/", "message": "CAIRO (Reuters) – The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”.", "location": "Rafah", "classification": "security", "score": 0.9942941143000886, "event_breakdown": "- Hamas claims responsibility for attack on Kerem Shalom crossing into Gaza\n- Hamas fires rockets at Israeli army base near the crossing\n- Israeli airstrike hits house in Rafah, killing three people and wounding several"}, {"id": "d22a3f80-6cd0-4f0a-ad72-c1f6ff5da879", "title": "Australian police kill 16 - year - old boy after stabbing with  hallmark of terrorism", "date": "2024-05-05 09:30", "url": "https://nypost.com/2024/05/05/world-news/australian-police-kill-16-year-old-boy-after-stabbing-with-hallmarks-of-terrorism/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nAPThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.5376789944108437, "event_breakdown": "1. Australian police shot dead a boy after he stabbed a man in the suburb of Willetton, Perth, Western Australia.\n2. Authorities indicated the attack had \"hallmarks\" of terrorism but had not yet been declared a terrorist act.\n3. Western Australia Premier Roger Cook stated that the attacker appeared to have acted solely and alone.\n4. The attack on the bishop occurred shortly after a stabbing spree that killed six in the Sydney beachside suburb of Bondi."}, {"id": "49bae8ac-0b6a-40f3-b0f1-7a480adb807e", "title": "Responsible for Israel - Gaza border crossing attack , says Hamas", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/responsible-for-israel-gaza-border-crossing-attack-says-hamas", "message": "Hamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nIn response to Hamas' attack, more than 34,600 Palestinians have been killed, 29 of them in the past 24 hours, and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry.\nThe war began after a Hamas attack on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Rafah", "classification": "security", "score": 0.9877265777573967, "event_breakdown": "- A Hamas attack occurred near the Israeli army base at the Gaza border crossing, involving rocket fire.\n- Following the Hamas attack, an Israeli airstrike hit a house in Rafah, killing three people and wounding several others.\n- The Israeli military confirmed its counter-strike targeted the launcher from which the Hamas projectiles were fired and a nearby \"military structure.\"\n- Gaza's health ministry reported that more than 34,600 Palestinians have been killed and more than 77,000 wounded during Israel's assault in response to Hamas' attack.\n- The conflict began with a Hamas attack on October 7, in which 1,200 people were killed and 252 hostages were taken, according to Israeli reports."}, {"id": "2e0dd286-4c5c-4e52-ab37-f77b04058e87", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809697-Hezbollah-attacks-Israel-after-deadly-south-Lebanon-strike", "message": "Hezbollah attacks Israel after deadly south Lebanon strikeWorld World Hezbollah attacks Israel after deadly south Lebanon strikeIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "Southern Lebanon", "classification": "security", "score": 0.9740135152182403, "event_breakdown": "null"}, {"id": "d22a9730-dc0f-46ef-ab6a-2d8e63513cf3", "title": "Hamas armed wing says responsible for Israel - Gaza border crossing attack", "date": "2024-05-05 19:45", "url": "https://www.swissinfo.ch/eng/hamas-armed-wing-says-responsible-for-israel-gaza-border-crossing-attack/76969385", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack3 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Three Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.", "location": "Rafah", "classification": "security", "score": 0.9982178355996476, "event_breakdown": "- Hamas claims responsibility for deadly rocket attack near Rafah\n- Israeli soldiers killed in rocket attack near Rafah\n- At least 19 Palestinians killed by Israeli fire in Rafah\n- Israeli airstrike hits house in Rafah, killing three people\n- Israeli air strike kills nine Palestinians, including a baby, in Rafah"}, {"id": "249a29e1-a658-4bc9-8734-12b1144aa21e", "title": "Australian police shoot dead  radicalised  teenager after knife attack in Perth", "date": "2024-05-05 05:00", "url": "https://www.scmp.com/news/asia/australasia/article/3261462/australian-police-shoot-dead-radicalised-teenager-after-knife-attack-perth", "message": "The teenager “rushed” at police who responded by shooting him twice with tasers before firing a single fatal shot, they said.\nWestern Australian police shot and killed a “radicalised” 16-year-old boy with a knife who stabbed a man in a Perth car park, police and the state premier said on Sunday.\nPolice body camera images showed the teenager refused officers’ demands that he put down the knife, the police chief said.\n03:14 Authorities rule out terrorism in deadly Sydney knife attack Authorities rule out terrorism in deadly Sydney knife attackPolice believe the teenager sent “relevant messages” to some members of the Muslim community who immediately called police, he said, without giving details of the messages.\nTwo days after the mall attack an Assyrian Christian bishop was brutally stabbed during a live streamed service in western Sydney.", "location": "Perth, Western Australia", "classification": "security", "score": 0.8303601596936979, "event_breakdown": "- A teenager rushed at police and was shot with tasers before being fatally shot.\n- Western Australian police shot and killed a radicalized 16-year-old boy who had stabbed a man in a Perth car park.\n- The teenager refused officers' demands to put down the knife, as shown in police body camera images.\n- Authorities ruled out terrorism in a deadly Sydney knife attack.\n- The teenager sent relevant messages to some members of the Muslim community who immediately called the police.\n- An Assyrian Christian bishop was brutally stabbed during a live-streamed service in western Sydney."}, {"id": "4592cc82-9479-427f-b6c3-2e879b62b6b7", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 07:45", "url": "https://kathmandupost.com/world/2024/05/06/israel-attacks-rafah-after-hamas-claims-responsibility-for-deadly-rocket-attack", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”.\nMourners react near to the bodies of Palestinians killed in an Israeli strike, at Abu Yousef al-Najjar hospital in Rafah, May 5, 2024.", "location": "Rafah", "classification": "security", "score": 0.9936042470976927, "event_breakdown": "1. Israel launches an attack on Rafah in response to Hamas claiming responsibility for a deadly rocket attack.\n2. The Israeli military confirms the counter-strike, targeting the launcher and a nearby \"military structure.\"\n3. Mourners react at Abu Yousef al-Najjar hospital in Rafah to the bodies of Palestinians killed in an Israeli strike."}, {"id": "9dc49087-7373-4cd6-ac05-db0b1bd3e4d3", "title": "Hezbollah rocket barrage wounds two in Kiryat Shmona", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/breaking-news/article-799905", "message": "At least two people were lightly wounded after Hezbollah fired a barrage of several dozen rockets toward Kiryat Shmona on Sunday.\nThe Ziv Medical Center received two patients who were wounded by shock waves from the rocket fire.\nHezbollah took responsibility for the rocket fire, saying it launched dozens of Katyusha and Falaq rockets toward Kiryat Shmona in response to an earlier Israeli airstrike on Meiss El Jabal in southern Lebanon.\nA MDA ambulance hit by rocket shrapnel in Kiryat Shmona.\nNorthern residents issue demands to governmentOrganizations representing residents of northern Israel issued a joint statement on Sunday, expressing concerns about a ceasefire agreement reportedly being discussed between Hezbollah and Israel.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9834609917262499, "event_breakdown": "- Hezbollah fires barrage of rockets toward Kiryat Shmona\n- Two people lightly wounded by rocket fire in Kiryat Shmona\n- Ziv Medical Center receives two patients wounded by shock waves from rocket fire\n- Hezbollah claims responsibility for rocket fire in response to Israeli airstrike on Meiss El Jabal\n- MDA ambulance hit by rocket shrapnel in Kiryat Shmona\n- Northern residents issue demands to government in response to ceasefire concerns with Hezbollah"}, {"id": "7a187464-3ab1-43e7-8c42-062a20be31da", "title": "Police in Australia shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 07:30", "url": "https://www.yahoo.com/news/police-australia-shoot-boy-dead-062748293.html", "message": "The car park in Perth where the stabbing and shooting occurred - Australian Broadcasting Corporation vi APPolice in Western Australia have shot dead a boy after he stabbed a man in Perth, in an attack authorities said indicated terrorism.\nThe apparently random attack, in the car park of a hardware store in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nState Police Commissioner Col Blanch said when police were called to the car park, the youth lunged at officers with the knife and was shot.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton, Perth", "classification": "security", "score": 0.9039307365082059, "event_breakdown": "- Stabbing and shooting at a car park in Perth, Western Australia\n- Police shooting of a boy after he stabbed a man in the suburb of Willetton\n- Authorities indicating terrorism in the attack\n- State Police Commissioner Col Blanch's statement on the incident\n- Western Australia Premier Roger Cook's remarks about the attacker\n- Recent stabbing spree in the Sydney beachside suburb of Bondi"}, {"id": "c7e533c7-aa26-4922-9c9c-6a86219c0563", "title": "Australian police shoot 16 - year - old boy dead after stabbing", "date": "2024-05-05 05:00", "url": "https://www.theglobeandmail.com/world/article-australian-police-shoot-16-year-old-boy-dead-after-stabbing/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThere were signs the 16-year-old, armed with a kitchen knife, had been radicalized online, state authorities said, adding they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised news conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.42508576033814766, "event_breakdown": "1. Australian police shot dead a boy after he stabbed a man in the suburb of Willetton, Perth, Western Australia.\n2. Authorities indicated the attack had \"hallmarks\" of terrorism but had not yet been declared a terrorist act.\n3. There were signs that the 16-year-old attacker, armed with a kitchen knife, had been radicalized online.\n4. Concerned members of the local Muslim community had contacted state authorities before the attack occurred late on Saturday night.\n5. Western Australia Premier Roger Cook stated that it appeared the attacker acted solely and alone.\n6. The attack on the bishop occurred shortly after a stabbing spree that killed six in the Sydney beachside suburb of Bondi."}, {"id": "744b8ef7-4f96-4702-9e3e-e0cd7a9bd37d", "title": "Dogs start eating bodies of the dead in the streets of Rafah", "date": "2024-05-06 07:45", "url": "https://www.dailymail.co.uk/news/article-13386339/Dogs-start-eating-bodies-dead-streets-Rafah-Israel-begins-evacuation-city-offensive-imminent-latest-breakdown-peace-talks-Hamas.html", "message": "Animals have reportedly started eating the bodies of the dead in the street of Rafah, as Israel begins its evacuation of the city to prepare for an offensive against the last-remaining city in the Gaza Strip.\nDogs have been seen dragging corpses from the graves of people buried in Gaza, according to Palestinian civilians who spoke to the BBC.\nThe Israeli military this morning told Palestinians to evacuate eastern Rafah, amid an expected military offensive that aims to wipe out any remaining Hamas fighters in the region.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing on Saturday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields.", "location": "Rafah", "classification": "security", "score": 0.9822783184977119, "event_breakdown": "- Animals eating bodies in the streets of Rafah, Gaza Strip\n- Dogs dragging corpses from graves in Gaza\n- Israeli military ordering Palestinians to evacuate eastern Rafah\n- Expected military offensive by Israel against Hamas fighters in the region\n- Rocket attack on Kerem Shalom crossing from southern Gaza\n- Three Israeli soldiers killed and 11 injured in the rocket attack\n- Dispute over the target of the rocket attack and the use of civilians as human shields by Hamas sources."}, {"id": "0ee31a39-576b-421d-aeb6-a539c54c2e4a", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/", "message": "AMMAN (Reuters) – An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired “tens” of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "", "classification": "security", "score": 0.9914293181201302, "event_breakdown": "- Israeli airstrike killing four members of a family in a border village in southern Lebanon\n- Hezbollah firing rockets at the Israeli town of Kiryat Shmona in retaliation\n- Hezbollah members and civilians killed in Israeli strikes on Lebanon\n- Missile fire from Lebanon killing troops and civilians in Israel\n- Hamas militants conducting a cross-border raid from the Gaza Strip, resulting in casualties and hostages taken"}, {"id": "76ce0284-4568-4f9d-a159-925a0eaf2691", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 15:30", "url": "https://www.hurriyetdailynews.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike-193163", "message": "Hezbollah launches rockets at Israel after deadly south Lebanon strikeBEIRUTA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nHezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".", "location": "", "classification": "security", "score": 0.9857130395007375, "event_breakdown": "- Israeli strike on a southern village in Lebanon kills several people from the same family\n- Hezbollah announces rocket fire in retaliation towards Kiryat Shmona in northern Israel\n- Israel and Hezbollah have exchanged regular cross-border fire\n- Fighting has intensified with Israel striking deeper into Lebanese territory and Hezbollah increasing missile and drone attacks on military positions in northern Israel."}, {"id": "1539565d-7bac-4eaa-959a-a17839955996", "title": "These are the terrorists eliminated near Tulkarem", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389402", "message": "The IDF and ISA on Saturday night announced the names of the terrorists killed in a nearly 13-hour operation near Tulkarem.\n\"Over the last few hours, during a joint IDF, ISA, and Israel Police counterterrorism activity, a Hamas terrorist cell was neutralized in the area of Tulkarem,\" the statement read.\n\"As part of the counterterrorism activity, the forces located the terrorists in the town of Deir al-Ghusun and engaged in fire, eliminating four terrorists.\n\"The four terrorists who were eliminated in the area of Tulkarem were:\"1.\nTamer Abed Allatif Rajeh Rajeh - a Hamas operative from the town of Shuweika.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.964195166140549, "event_breakdown": "- IDF, ISA, and Israel Police counterterrorism operation near Tulkarem\n- Neutralization of a Hamas terrorist cell in Deir al-Ghusun\n- Elimination of four terrorists, including Tamer Abed Allatif Rajeh Rajeh"}, {"id": "6fb2e0d0-43fa-4acf-8761-539f86d6371f", "title": "IDF eliminates top PIJ commander who helped carry out October 7 attacks", "date": "2024-05-04 21:00", "url": "https://www.jpost.com/breaking-news/article-799817", "message": "A joint attack by the IDF and the Shin Bet (Israel Security Services) killed one of the top commanders of the Palestinian Islamic Jihad (PIJ), the IDF announced on Saturday.\n(credit: IDF SPOKESPERSON'S UNIT)The terrorist, Imam Zerev, was killed by Israel Air Force fighter jets in southern Gaza.\nIDF kills Imam Zerev in southern Gaza.\n(Credit: IDF Spokesperson's Unit).\nTwo other terrorists from PIJ were killed in the same air strike.", "location": "", "classification": "security", "score": 0.9793338893332181, "event_breakdown": "- Joint attack by IDF and Shin Bet kills top PIJ commander Imam Zerev in southern Gaza\n- Two other PIJ terrorists killed in the same airstrike"}, {"id": "48abaca9-feff-4eb9-9d19-8cdcabf62cc6", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 12:45", "url": "https://economictimes.indiatimes.com/news/defence/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/articleshow/109859718.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas 's unprecedented October attack on southern Israel sparked the war in Gaza.Fighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.Lebanon's state-run National News Agency said the strike in Mais al-Jabal killed \"four people from a single family\", updating an earlier reported toll of three dead in the raid it said was carried out by Israeli aircraft.It identified them as a man, a woman and their children aged 12 and 21, and said two other people were wounded.A Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".Mais al-Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.Hezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".The Lebanese movement has repeatedly declared that only a ceasefire in Gaza will put an end to its attacks on Israel, which it says are in support of Gazans and its ally Hamas.Both the United States and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.In Lebanon, at least 390 people have been killed in nearly seven months of cross-border violence, mostly militants but also more than 70 civilians, according to an AFP tally.Israel says 11 soldiers and nine civilians have been killed on its side of the border.Tens of thousands of people have been displaced on both sides.", "location": "", "classification": "security", "score": 0.9336051552163522, "event_breakdown": "- Israeli strike on southern village in Lebanon kills several people from the same family\n- Hezbollah announces rocket fire in retaliation\n- Exchange of regular cross-border fire between Israel and Lebanon's Hezbollah\n- Fighting intensifies with Israel striking deeper into Lebanese territory and Hezbollah stepping up missile and drone attacks on military positions in northern Israel\n- Strike in Mais al-Jabal kills four people from a single family\n- Hezbollah fires dozens of Katyusha and Falaq rockets at Kiryat Shmona in northern Israel\n- Diplomatic efforts by the United States and France to calm tensions on the Lebanese-Israeli border\n- 390 people killed in nearly seven months of cross-border violence in Lebanon, including militants and civilians\n- 11 soldiers and nine civilians killed on the Israeli side of the border"}, {"id": "6292c9b4-6ea6-443b-9b6f-0de46f906951", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-05 18:30", "url": "https://gazette.com/news/us-world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/article_7ef7063d-e5d5-5751-aad5-8ce8d8841378.html", "message": "AMMAN (Reuters) -An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9914293181201302, "event_breakdown": "- Israeli airstrike kills four members of a family in a house in a border village in southern Lebanon\n- Hezbollah fires \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona as retaliation\n- Over 250 Hezbollah members and 75 civilians killed in Israeli strikes on Lebanon since October\n- Missile fire from Lebanon kills around a dozen Israeli troops and several civilians\n- Hamas militants from Gaza Strip conduct a cross-border raid on Israel, resulting in the death of 1,200 people and 252 hostages taken."}, {"id": "46dfcbc8-0a87-4a11-afb7-acc73b27c0a3", "title": "Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault", "date": "2024-05-06 10:15", "url": "https://www.armenpress.am/eng/news/1136385.html", "message": "The Israeli army has told Palestinians to begin evacuating eastern Rafah, according to an Israeli Defense Force statement on Monday, signaling that a ground invasion is imminent.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\", Reuters adds.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nMore than 34,600 Palestinians have been killed and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry.", "location": "Rafah", "classification": "security", "score": 0.970686388466988, "event_breakdown": "1. The Israeli army tells Palestinians to begin evacuating eastern Rafah.\n2. An Israeli airstrike hits a house in Rafah, killing three people and injuring several others.\n3. The Israeli military confirms the counter-strike, targeting the launcher and a nearby \"military structure\".\n4. An Israeli air strike kills nine Palestinians, including a baby, in another house in Rafah.\n5. Gaza health officials report that over 34,600 Palestinians have been killed and more than 77,000 wounded in Israel's assault."}, {"id": "b6685d51-cc90-4d92-83bd-0633e6c07ca4", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/mena/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike", "message": "A soldier looks at a burning car at the site of a rocket that was fired towards Israel from Lebanon in Kiryat Shmona.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nMais Al Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.\nIt later said it fired dozens more Katyusha rockets at Israeli troops and vehicles across the border \"as part of the response\" to the Mais Al Jabal strike.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9890561852040681, "event_breakdown": "- A rocket was fired towards Israel from Lebanon in Kiryat Shmona\n- Regular cross-border fire between Israel and Lebanon's Iran-backed Hezbollah group\n- Israeli troops conducted a strike in Mais Al Jabal, Lebanon\n- Four civilians were killed in the strike, including a couple and their son\n- Dozens more Katyusha rockets were fired at Israeli troops and vehicles across the border in response to the Mais Al Jabal strike"}, {"id": "387140f8-0d10-42bb-8313-b2a09392c5b3", "title": "Four Lebanese killed in Israeli airstrike", "date": "2024-05-05 19:45", "url": "https://www.thedailystar.net/news/world/news/four-lebanese-killed-israeli-airstrike-3603006", "message": "Hezbollah launches retaliatory strikesAn Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon yesterday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nBoth the US and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9925230836851295, "event_breakdown": "- Israeli airstrike kills four members of a family in southern Lebanon\n- Hezbollah retaliates by firing \"tens\" of rockets at Kiryat Shmona, Israel\n- Over 250 Hezbollah members and 75 civilians killed in Israeli strikes on Lebanon since October\n- Missile fire from Lebanon kills around a dozen Israeli troops and several civilians\n- US and France make diplomatic efforts to ease tensions on the Lebanese-Israeli border."}, {"id": "2353791c-45d2-4d4c-b226-d946ee1287c8", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 01:15", "url": "https://www.thehindu.com/news/international/hezbollah-attacks-israel-after-deadly-south-lebanon-strike/article68143616.ece", "message": "Fighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "The main location where the main event takes place is southern Lebanon.", "classification": "security", "score": 0.9512679360047135, "event_breakdown": "- Fighting intensifies between Hezbollah and Israel\n- Israeli military strikes Lebanese territory\n- Israeli airstrike in Mais al-Jabal kills four civilians\n- Hezbollah military structures and terrorist infrastructure targeted in southern Lebanon"}, {"id": "52b52ee8-c80f-4eb0-b874-b48e690fa075", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 19:00", "url": "https://www.al-monitor.com/originals/2024/05/hezbollah-attacks-israel-after-deadly-south-lebanon-strike", "message": "May 5, 2024 — Beirut (AFP)Official media in Lebanon said an Israeli strike Sunday on a southern village killed four family members, with Hezbollah announcing retaliatory attacks, in the latest cross-border violence since the Gaza war erupted.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "Mais al-Jabal", "classification": "security", "score": 0.9554528278151891, "event_breakdown": "- May 5, 2024: Israeli strike in a southern village in Lebanon kills four family members, leading to Hezbollah announcing retaliatory attacks\n- Fighting intensifies in recent weeks between Hezbollah and Israel, with Hezbollah attacking northern Israel and Israeli military striking Lebanese territory\n- Lebanese security source confirms the strike killed \"four civilians\" and Israeli fighter jets also hit Hezbollah military structures and terrorist infrastructure in southern Lebanon"}, {"id": "1ca1f225-d913-4adc-bc7e-c2380877accd", "title": "Russo - Ukraine War - 04 May 2024", "date": "2024-05-05 06:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-04.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nLyman axis: the Ukrainian Defense Forces repelled 7x attacks in the vicinities of Serebryans'ke forestry (Luhansk oblast), Terny (Donetsk oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Nevs'ke (Luhansk oblast), Terny, Yampolivka, Tors'ke (Donetsk oblast).\nKherson axis: Russia does not abandon its intention to dislodge Ukrainian troops from their bridgeheads on the left bank of the Dnipro River.", "location": "Luhansk oblast", "classification": "security", "score": 0.8355880818225166, "event_breakdown": "- Ukraine was attacked by land, naval, and air forces of Russia on 24 February 2022\n- Ukrainian Defense Forces repelled 7 attacks in the vicinities of Serebryans'ke forestry and Terny\n- Russian forces fired artillery and mortars at more than 10 settlements including Nevs'ke, Terny, Yampolivka, Tors'ke"}, {"id": "16af43f9-3f3b-4d7b-a1ee-83db95cb8b2c", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 22:00", "url": "https://www.bssnews.net/international/187330", "message": "Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.", "location": "", "classification": "security", "score": 0.9859178568794482, "event_breakdown": "- Regular cross-border fire between Israel and Lebanon's Hezbollah group\n- Hamas's attack on southern Israel sparking war in Gaza Strip\n- Intensified fighting between Hezbollah and Israel\n- Israeli military striking deeper into Lebanese territory\n- Strike in Mais al-Jabal killing four civilians from a single family\n- Israeli aircraft carrying out the raid\n- Fighter jets striking Hezbollah military structures and terrorist infrastructure in southern Lebanon"}, {"id": "ecf80b18-870f-417c-b249-e8db74c9ccac", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:30", "url": "https://www.lbc.co.uk/world-news/82ff8645e2d8492a995683330ae7da66/", "message": "A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth.\nThe teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead.", "location": "Perth", "classification": "security", "score": 0.6087608391025592, "event_breakdown": "1. A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in Perth, Australia.\n2. The teenager attacked the man and then rushed at police officers before he was shot, according to Western Australian Premier Roger Cook.\n3. Mr. Cook stated, \"I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation.\"\n4. The local Muslim community had flagged the individual prior to the incident with the police, as mentioned by Mr. Wadood.\n5. In November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead."}, {"id": "d9012fa5-993b-4746-83a1-aa1957eb8142", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 19:45", "url": "https://www.yahoo.com/news/israeli-strike-kills-4-civilians-185339652.html", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9959154188551282, "event_breakdown": "- Israeli airstrike in Mays al Jabal, south Lebanon, killing four civilians and wounding several others\n- Israeli military targeting military infrastructure in Mays al Jabal belonging to Hezbollah\n- Israeli military targeting Hezbollah military infrastructure in other parts of southern Lebanon\n- More than 350 people killed in Lebanon due to Israeli strikes, including fighters with Hezbollah and allied groups as well as civilians\n- At least 10 civilians and 12 soldiers killed in Israel due to strikes from Lebanon"}, {"id": "26831046-5427-41b6-8e25-f194d1434c44", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:45", "url": "https://abcnews.go.com/International/wireStory/israeli-strike-kills-4-civilians-southern-lebanon-state-109941999", "message": "Lebanese state media and the town’s municipality report that an Israeli airstrike in the town of Mays al Jabal in south Lebanon has killed four civilians and wounded several othersBEIRUT -- An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nHezbollah on Sunday said it conducted at least 10 attacks targeting Israeli military positions and surveillance gear near the tense Lebanon-Israel border, while the Israeli military said it identified some 40 missiles that crossed into Israeli territory but did not cause any casualties.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9949173576989059, "event_breakdown": "- Israeli airstrike in Mays al Jabal, south Lebanon, kills four civilians and wounds several others\n- Hezbollah conducts at least 10 attacks near Lebanon-Israel border targeting Israeli military positions and surveillance gear\n- Israeli military reports targeting Hezbollah military infrastructure in southern Lebanon\n- Strikes from Lebanon into Israel kill at least 10 civilians and 12 soldiers"}, {"id": "f28bf7f5-feee-43ed-a002-c2ba778ab8cb", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:00", "url": "https://www.startribune.com/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says/600363862/", "message": "BEIRUT — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9959154188551282, "event_breakdown": "1. An Israeli airstrike in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others.\n2. The Israeli military targeted military infrastructure in the southern Lebanese town belonging to Hezbollah.\n3. The Israeli military also reported targeting Hezbollah military infrastructure in other parts of southern Lebanon.\n4. Israeli strikes in Lebanon have resulted in the deaths of more than 350 people, including fighters from Hezbollah and allied groups, as well as over 50 civilians.\n5. Strikes from Lebanon have killed at least 10 civilians and 12 soldiers in Israel."}, {"id": "d7ed6728-458c-46d5-889e-e3b8b1b6cffd", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says – Winnipeg Free Press", "date": "2024-05-05 19:15", "url": "https://www.winnipegfreepress.com/world/2024/05/05/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town’s municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "", "classification": "security", "score": 0.9961035009131601, "event_breakdown": "1. Location: Mays al Jabal, south Lebanon\n   - Date: Sunday\n   - Event: Israeli airstrike kills four civilians and wounds several others.\n   - Source: Lebanese state media and the town’s municipality\n\n2. Location: Southern Lebanon\n   - Date: Sunday\n   - Event: Israeli military targets military infrastructure belonging to Hezbollah.\n   - Source: Israeli military statement\n\n3. Location: Southern Lebanon (other parts)\n   - Date: Sunday\n   - Event: Israeli military targets Hezbollah military infrastructure.\n   - Source: Israeli military statement\n\n4. Location: Lebanon\n   - Event: Israeli strikes result in the death of over 350 people, including fighters with Hezbollah and allied groups, as well as more than 50 civilians.\n   - Source: Not specified\n\n5. Location: Israel\n   - Event: Strikes from Lebanon result in the death of at least 10 civilians and 12 soldiers.\n   - Source: Not specified"}, {"id": "8b831ebb-bf3c-4735-b3f4-ab7b24b7352e", "title": "Terror strikes IAF convoy in J & K , one soldier dead", "date": "2024-05-04 23:45", "url": "https://www.dailypioneer.com/2024/page1/terror-strikes-iaf-convoy-in-j-k--one-soldier-dead.html", "message": "The attack occurred near Shashidhar when the convoy vehicles were moving towards Sanai Top in the district's Surankote area.\nFive Indian Army personnel including two officers were \"killed in action\" in the Kalakote forest area of Rajouri on November 22.\nTwo terrorists, including a top commander of LeT identified as Quari, were also killed in the two-day long gunfight.\nQuari was said to be the mastermind behind several attacks, including the killing of 10 civilians and five Army personnel in the district.\nIn May last year, five more Army personnel were killed and a major-rank officer was injured in Chamrer forest during an anti-terrorist operation.", "location": "Rajouri", "classification": "security", "score": 0.9852075559671105, "event_breakdown": "- Attack near Shashidhar in district's Surankote area\n- Five Indian Army personnel killed in action in Kalakote forest area of Rajouri\n- Two terrorists killed, including top LeT commander Quari\n- Quari identified as mastermind behind several attacks in the district\n- Five Army personnel killed and major-rank officer injured in Chamrer forest anti-terrorist operation"}, {"id": "4109aa20-208d-414b-8dea-b3f5a3f151e3", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says | iNFOnews", "date": "2024-05-05 19:30", "url": "https://infotel.ca/newsitem/ml-lebanon-israel/cp2009476227", "message": "Israeli strike kills 4 civilians in southern Lebanon, state media saysBEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "", "classification": "security", "score": 0.9944163732244403, "event_breakdown": "- Israeli airstrike kills 4 civilians in Mays al Jabal, South Lebanon\n- Israeli military targets military infrastructure in southern Lebanon belonging to Hezbollah\n- Israeli military targets Hezbollah military infrastructure in other parts of southern Lebanon\n- More than 350 people killed in Lebanon due to Israeli strikes, including fighters and civilians\n- At least 10 civilians and 12 soldiers killed in Israel due to strikes from Lebanon"}, {"id": "a722a2de-3412-4280-97be-248b7e644701", "title": "Israeli airstrike that killed seven health workers in Lebanon used US munition , analysis reveals", "date": "2024-05-06 05:00", "url": "https://www.theguardian.com/world/article/2024/may/06/israel-airstrike-lebanon-us-weapons-international-law", "message": "Five days after the attack on healthcare workers in Lebanon, Israel killed another seven aid workers employed by the World Central Kitchen in Gaza.\nAn Israeli military spokesperson said that the airstrike in al-Habariyeh killed a “prominent terrorist belonging to Jamaa Islamiya”.\nView image in fullscreen Workers inspect the site of the Israeli airstrike in al-Habariyeh.\nView image in fullscreen Shrapnel from the Israeli airstrike is displayed along with medical equipment at the rescue workers’ funeral in Beirut, Lebanon.\nSince 7 October, Israel has killed 16 medical workers in Lebanon, including 10 in a single day at the end of March.", "location": "al-Habariyeh", "classification": "security", "score": 0.9836709984866446, "event_breakdown": ""}, {"id": "2cb8558b-5c21-4394-9b02-68878fda488b", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 04:00", "url": "https://www.siasat.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah-3021023/", "message": "Tel Aviv: The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nDefence Minister Yoav Gallant and Minister without portfolio, Benny Gantz will be participating in the war cabinet to be held later in the day.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo.", "location": "", "classification": "security", "score": 0.9698117891508292, "event_breakdown": ""}, {"id": "39aa1a47-65c6-459f-81ac-eb2ed03d0a92", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 06:30", "url": "https://www.dailyexcelsior.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah/", "message": "Tel Aviv, May 6 : The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe airstrike was in retaliation to the barrage of rockets fired by Hamas at a ground near Kerem Shalom in Southern Israel killing three Israel Defense Forces (IDF) soldiers and injuring 11 soldiers.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo.", "location": "Kerem Shalom", "classification": "security", "score": 0.9952013459894679, "event_breakdown": "- 16 people killed in Israeli air attack in Tel Aviv on May 6, according to Hamas health department\n- Media reports 9 people from one family and 7 from another family were among the victims of the air attack\n- IDF retaliates with airstrike after Hamas fires rockets at ground near Kerem Shalom in Southern Israel, killing 3 IDF soldiers and injuring 11 soldiers\n- IDF states the attack was staged from Rafah region early morning\n- Rocket and mortar firing by Hamas at Kerem Shalom crossing kills 3 IDF soldiers\n- Israel's retaliation likely to impact progress of peace talks in Cairo"}, {"id": "c429d3b8-7611-4341-a24e-36911f09d4fe", "title": "Car Bomb Kills Russian Who Tortured Ukrainian Prisoners", "date": "2024-05-06 08:30", "url": "https://www.kyivpost.com/post/32166", "message": "77 and may have been involved in the interrogation of Ukrainian military and civilian prisoners.\nIt said it was carrying out forensic investigations and had initiated a criminal procedure and instituted operational measures to identify those involved in the car bombing.\nRussia has also been attempting to develop rail links between Berdyansk and other occupied cities.\nSeveral Russian-installed officials have been killed in car explosions in occupied territories since the start of the full-scale invasion.\nOn March 6 Svitlana Samoilenko, another Kremlin-installed official who was helping to arrange activities linked to the Russian presidential elections in occupied Berdyansk was killed in a similar way.", "location": "Berdyansk", "classification": "security", "score": 0.9680974598053619, "event_breakdown": "- Russian-installed officials killed in car explosions in occupied territories\n- Svitlana Samoilenko, a Kremlin-installed official, killed in a car bombing in occupied Berdyansk"}, {"id": "15cd988e-d230-4d78-b9c8-b5724c536f5c", "title": "4 killed in Israeli strikes in S . Lebanon - Xinhua", "date": "2024-05-05 15:30", "url": "https://english.news.cn/20240505/2e6299d9a3b8480090eea4fb5e8773f9/c.html", "message": "This photo taken from Kibbutz Malkia in northern Israel bordering Lebanon shows smoke billowing above the southeast Lebanese village of Mays al-Jabal during an Israeli bombardment on May 5, 2024.\n(Ayal Margolin/JINI via Xinhua)BEIRUT, May 5 (Xinhua) -- Four people were killed and three others were injured on Sunday in an Israeli airstrike on the southeast village of Mays al-Jabal, Lebanese military sources told Xinhua.\nMeanwhile, the Lebanese armed group Hezbollah said its fighters targeted the northern Israeli city of Kiryat Shmona with dozens of rockets in retaliation to Israeli strikes in southern Lebanon without specifying the casualties.\nA Lebanese military source told Xinhua that about 20 surface-to-surface missiles were launched from southern Lebanon toward northern Israel, some of which were intercepted by Israeli Iron Dome missiles.\n■This photo taken from Kibbutz Malkia in northern Israel bordering Lebanon shows smoke billowing above the southeast Lebanese village of Mays al-Jabal during an Israeli bombardment on May 5, 2024.", "location": "Mays al-Jabal", "classification": "security", "score": 0.9933883777031085, "event_breakdown": "1. Location: Mays al-Jabal, southeast Lebanon\n   - Date: May 5, 2024\n   - Event: Israeli airstrike kills four people and injures three others.\n   - Source: Lebanese military sources\n\n2. Location: Kiryat Shmona, northern Israel\n   - Date: May 5, 2024\n   - Event: Hezbollah fighters target the city with dozens of rockets in retaliation to Israeli strikes in southern Lebanon.\n   - Source: Hezbollah statement\n\n3. Location: Southern Lebanon (launch site)\n   - Event: Hezbollah launches about 20 surface-to-surface missiles towards northern Israel.\n   - Source: Lebanese military source\n\n4. Location: Northern Israel (interception site)\n   - Event: Israeli Iron Dome intercepts some of the missiles launched from southern Lebanon.\n   - Source: Lebanese military source"}, {"id": "e88b69aa-5256-4b02-8303-4e9c8e553aa7", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.yahoo.com/news/latest-israeli-military-orders-evacuation-081150261.html", "message": "Over a million people in Rafah are huddled in tents and overcrowded apartments after fleeing Israel’s military offensive in other parts of the territory.\nCurrently:— Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault— Hamas says latest cease-fire talks have ended.\nMost of those people are huddling in tents and overcrowded apartments after fleeing Israel’s military offensive in other parts of the territory.\nThe Israeli military says it has killed 13,000 militants, without providing evidence to back up the claim.\nThe Israeli military said its fighter jets struck a Hezbollah military structure in Safri.", "location": "", "classification": "security", "score": 0.8027460479884739, "event_breakdown": "- Over a million people in Rafah are huddled in tents and overcrowded apartments after fleeing Israel's military offensive in other parts of the territory.\n- Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault.\n- Hamas says latest cease-fire talks have ended.\n- Israeli military claims to have killed 13,000 militants without providing evidence.\n- Israeli military strikes a Hezbollah military structure in Safri."}, {"id": "047343f8-d6e1-4366-9c13-6be94486515d", "title": "IDF strikes Hezbollah - Radwan base after drone strike on Metula", "date": "2024-05-06 13:00", "url": "https://www.ynetnews.com/article/s1joamlmc", "message": "The Iran-backed terror group fired a barrage of at least 30 rockets at the Golan Heights, in response to the overnight strike on a Hezbollah base deep inside Lebanon, where at least three people were injured, claiming to aim for a military position there.", "location": "Golan Heights", "classification": "security", "score": 0.9898011445093401, "event_breakdown": "- Iran-backed terror group fires at least 30 rockets at Golan Heights \n- Overnight strike on Hezbollah base in Lebanon with at least three people injured"}, {"id": "ebc9a3f6-d2e1-4da1-80c9-053fdb07c16d", "title": "  Radicalised  teenager shot dead by police after stabbing man in the back in Australia", "date": "2024-05-05 10:00", "url": "https://www.independent.co.uk/news/world/australasia/perth-australia-teenager-shot-dead-b2539883.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian city of Perth.\nHe was shot dead after Tasers failed to subdue him and he lunged towards officers while armed with a knife.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” he added.\nThe 40-year-old attacker in the mall attack was shot dead by police, who have yet to reveal the man’s motive.", "location": "Perth, Australia", "classification": "security", "score": 0.9019061572218047, "event_breakdown": "1. Location: Perth, Australia\n   - Event: A 16-year-old boy armed with a knife was shot dead by police after stabbing a man.\n   - Additional Information: The boy was shot dead after Tasers failed to subdue him and he lunged towards officers while armed with a knife.\n\n2. Location: Perth, Australia\n   - Event: The 40-year-old attacker in the mall attack was shot dead by police.\n   - Additional Information: Police have yet to reveal the man’s motive."}, {"id": "a32e7c2e-35f0-4727-b44f-5b2a629a7355", "title": "Hamas attack on aid crossing that killed Israeli troops", "date": "2024-05-06 01:30", "url": "https://www.dailymail.co.uk/news/article-13385905/Hamas-attack-aid-crossing-killed-Israeli-troops-leaves-peace-hopes-tatters.html", "message": "A Hamas attack on an aid crossing that killed Israeli troops was last night branded proof that the terror group is using Palestinians as 'human shields', dashing hopes for an end to the violence in Gaza.\nThe escalation came as the latest round of ceasefire talks were 'near to collapse', with Israeli Prime Minister Benjamin Netanyahu flatly ruling out any end to the war.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing yesterday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields.\nIt came as talks between Hamas negotiators and Egyptian and Qatari mediators in Cairo threatened to break down.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.9714955760515206, "event_breakdown": "- A Hamas attack on an aid crossing that killed Israeli troops\n- Accusations that Hamas is using Palestinians as 'human shields'\n- Collapse of ceasefire talks and Israeli Prime Minister's rejection of ending the war\n- Launch of ten rockets from southern Gaza towards the Kerem Shalom crossing, resulting in the death of three soldiers and injuries to 11\n- Denial by Hamas sources that civilians were used as human shields\n- Potential breakdown of talks between Hamas negotiators and Egyptian and Qatari mediators in Cairo"}, {"id": "d4f3be02-5d04-4587-bf7f-68267de4efca", "title": "Elevator Damaged In Poltava Region Due To Missile Attack", "date": "2024-05-05 19:45", "url": "https://menafn.com/1108175771/Elevator-Damaged-In-Poltava-Region-Due-To-Missile-Attack", "message": "(MENAFN- UkrinForm) An elevator in the Poltava region was damaged by a Russian missile attack.\nThe head of the Poltava Regional Military Administration, Philip Pronin, reported this on Telegram , according to Ukrinform.\nA missile strike damaged an elevator in the Poltava community,” he said.\nInjury toll in Russian missile strike onregion rises to 16According to Pronin, there were no casualties.\nThe RMA confirmed the sounds of an explosion in the Poltava region.", "location": "Poltava community", "classification": "security", "score": 0.8281786118933321, "event_breakdown": "1. Location: Poltava region, Ukraine\n   - Event: An elevator was damaged by a Russian missile attack.\n   - Source: Head of the Poltava Regional Military Administration, Philip Pronin, via Telegram\n\n2. Location: Poltava region, Ukraine\n   - Event: Injury toll rises to 16 due to the Russian missile strike.\n   - Source: Not specified, possibly Philip Pronin or local authorities\n\n3. Location: Poltava region, Ukraine\n   - Event: Sounds of an explosion confirmed by the Regional Military Administration.\n   - Source: Regional Military Administration"}, {"id": "357527f8-3e8e-482f-8b82-339f3478ea13", "title": "Hezbollah responds to deadly Israeli strike on south Lebanon", "date": "2024-05-06 12:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240505-irna04.htm", "message": "Hezbollah responds to deadly Israeli strike on south LebanonIRNA - Islamic Republic News AgencyMay 5, 2024Tehran, IRNA -- Lebanon's Hezbollah resistance movement has launched rockets towards northern Israeli-occupied territories after at least two civilians were killed when the Israeli regime hit a border village in southern Lebanon.\nThe Israeli military said on Sunday that sirens were sounding in Kiryat Shmona and other parts of northern occupied territories following the rocket attack by Hezbollah.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nSince October 8, a day after the Israeli regime launched its genocidal war on Gaza, Hezbollah and the Israeli military have traded fire across the border on an almost daily basis.", "location": "", "classification": "security", "score": 0.9792180740131913, "event_breakdown": "- Israeli strike on a border village in southern Lebanon\n- Hezbollah launches rockets towards northern Israeli-occupied territories in response\n- Civilians killed in the Israeli strike\n- Sirens sounding in Kiryat Shmona and other parts of northern occupied territories\n- Several Israelis injured in Hezbollah's rocket attack\n- Ongoing exchange of fire between Hezbollah and the Israeli military across the border"}, {"id": "d5582213-1c3e-4f57-9884-c870b9d0285c", "title": "Combat Terrorism in Poonch - Rajouri", "date": "2024-05-06 04:00", "url": "https://www.dailyexcelsior.com/combat-terrorism-in-poonch-rajouri/", "message": "The martyrdom of Vicky Pahade underscores the urgent need for a concerted and unified effort to combat terrorism in the troubled region.\nDespite concerted efforts by security forces, terrorists continue to find ways to perpetrate violence and sow fear among civilians by attacking security personnel.\nHowever, these cowardly acts won’t dampen the resolve of security forces, who vow to respond effectively.\nGiven the varied terror activities across different districts, security forces must reassess their strategies to counter evolving threats.\nAttacks on security forces cannot be tolerated, and the public’s cooperation in providing vital information is essential.", "location": "", "classification": "security", "score": 0.8290469359618707, "event_breakdown": "1. Event: The martyrdom of Vicky Pahade in a terrorist attack.\n   - Location: Not specified\n   - Additional Information: Underscores the urgent need for a concerted and unified effort to combat terrorism.\n\n2. Event: Terrorists continue to perpetrate violence despite security forces' efforts.\n   - Location: Troubled region (specific location not provided)\n   - Additional Information: Terrorists attack security personnel, sow fear among civilians.\n\n3. Event: Security forces vow to respond effectively to terrorist attacks.\n   - Location: Not specified\n   - Additional Information: Resolve of security forces remains strong despite attacks.\n\n4. Event: Security forces need to reassess strategies due to varied terror activities across districts.\n   - Location: Not specified\n   - Additional Information: Evolving threats require updated counter-terrorism strategies.\n\n5. Event: Public cooperation in providing vital information is crucial for combating terrorism.\n   - Location: Not specified\n   - Additional Information: Attacks on security forces cannot be tolerated, cooperation is essential."}, {"id": "9744b736-a47e-44d6-a282-0794098c7509", "title": "4 Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 04:45", "url": "https://www.asiaone.com/world/4-lebanese-civilians-killed-israeli-strike-border-village", "message": "AMMAN — An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday (May 5), civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9914890314874649, "event_breakdown": ""}, {"id": "59fd140a-1f2c-416f-ac04-fac573c2cb14", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.yahoo.com/news/latest-israeli-military-orders-evacuation-081150261.html", "message": "(AP Photo/Tsafrir Abayov)The Hamas militant group says it has accepted an Egyptian-Qatari cease-fire proposal to halt the seven-month war with Israel.\nThe announcement came hours after Israel ordered Palestinians to begin evacuating the southern Gaza town of Rafah ahead of an Israeli military operation.\nMost of those people are huddling in tents and overcrowded apartments after fleeing Israel’s military offensive in other parts of the territory.\nThe Israeli military says it has killed 13,000 militants, without providing evidence to back up the claim.\nThe Israeli military said its fighter jets struck a Hezbollah military structure in Safri.", "location": "", "classification": "security", "score": 0.9341014431022913, "event_breakdown": "- Hamas militant group accepts Egyptian-Qatari cease-fire proposal to halt war with Israel in Gaza\n- Palestinians ordered to evacuate southern Gaza town of Rafah ahead of Israeli military operation\n- Displaced people huddle in tents and overcrowded apartments after fleeing Israel's military offensive in Gaza\n- Israeli military claims to have killed 13,000 militants, without providing evidence\n- Israeli fighter jets strike Hezbollah military structure in Safri"}, {"id": "f177ef43-4966-4816-9518-9c5d119e6656", "title": "Border Crossing Where Humanitarian Aid Enters Gaza Has Been Blown Up . Guess Who Taking Credit . ", "date": "2024-05-06 18:30", "url": "https://townhall.com/tipsheet/spencerbrown/2024/05/06/hamas-blew-up-the-entry-point-for-humanitarian-aid-headed-to-gaza-n2638654", "message": "Hamas terrorists claimed credit for a rocket attack on Sunday targeting the Kerem Shalom border crossing between Israel and Gaza near the Egyptian border, the main entry point for humanitarian aid headed into the enclave.\nThey fell during a Hamas rocket attack on Kerem Shalom earlier today.\n\"Yes, they’re bombing their own lifeline of food and aid,\" he said of the rocket attack.\nYet again, however, it is Hamas terrorists who are preventing aid from making it to those who need it.\nThe IDF released footage of Hamas rocket launches at the Kerem Shalom Crossing, which is used for trucks to carry aid into Gaza.", "location": "Kerem Shalom border crossing between Israel and Gaza", "classification": "security", "score": 0.9307361974172657, "event_breakdown": "null"}, {"id": "d843a133-3378-4cf2-b5ab-f67d1944aeab", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.yahoo.com/news/latest-israeli-military-orders-evacuation-081150261.html", "message": "The United States says it opposes a Rafah invasion unless Israel provides a “credible” plan for protecting civilians there.\nIn Tel Aviv, about 1,000 protesters swelled near Israel’s military headquarters, some blocking the city’s main highway until late into the night.\nThe United States says it opposes a Rafah invasion unless Israel provides a “credible” plan for protecting civilians there.\nISRAELI OFFICIAL WARNS THAT HAMAS CEASE-FIRE PROPOSAL DOES NOT MEET ISRAELI FRAMEWORKJERUSALEM -- An official familiar with Israeli thinking says Israeli officials are examining the cease-fire proposal approved by Hamas.\nThe Israeli military said its fighter jets struck a Hezbollah military structure in Safri.", "location": "JERUSALEM", "classification": "security", "score": 0.9179799023269524, "event_breakdown": "- The United States opposes Rafah invasion without credible plan for protecting civilians\n- Protest in Tel Aviv near Israel's military headquarters\n- Israeli official warns Hamas cease-fire proposal does not meet Israeli framework\n- Israeli military strikes Hezbollah military structure in Safri"}]