[{"id": "df292143-d564-4e0d-b4aa-35dd88dc124d", "title": "Israel targets Hamas commander in airstrikes that kill 90 Palestinians", "date": "2024-07-14 00:00", "url": "https://www.kalw.org/npr-news/2024-07-13/israel-targets-hamas-commander-in-airstrikes-that-kill-90-palestinians", "domain": "kalw.org", "domain_classification": "Unknown", "message": "Updated July 13, 2024 at 16:09 PM ETTEL AVIV — Powerful Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, officials said.\nThe Israelis bombed the city of Khan Younis and the nearby costal area of al-Muwasi, which has been designated a humanitarian safe zone by the Israeli military.\nIn a briefing, an Israeli military official, speaking on condition of anonymity, said the attack targeted Deif, as well as another senior Hamas commander, Rafah Salameh.\nHe has run the Hamas military wing since 2002, when his predecessor was killed in an Israeli airstrike in Gaza City.\nIsrael has tried to kill him many times and he has reportedly suffered numerous injuries, including the loss of an eye.", "location": "GAZA", "classification": "security", "score": 0.9615106904858504, "event_breakdown": "Israeli airstrikes target high-ranking Hamas commanders and sites in the Gaza Strip, killing 90 Palestinians and wounding 300."}, {"id": "ce42db54-8046-4b5d-a59f-a372f2f8e543", "title": "Israel targets Hamas commander in airstrikes that kill 90 Palestinians", "date": "2024-07-14 00:00", "url": "https://www.kanw.com/npr-news/2024-07-13/israel-targets-hamas-commander-in-airstrikes-that-kill-90-palestinians", "domain": "kanw.com", "domain_classification": "Unknown", "message": "Updated July 13, 2024 at 16:09 PM ETTEL AVIV — Powerful Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, officials said.\nThe Israelis bombed the city of Khan Younis and the nearby costal area of al-Muwasi, which has been designated a humanitarian safe zone by the Israeli military.\nIn a briefing, an Israeli military official, speaking on condition of anonymity, said the attack targeted Deif, as well as another senior Hamas commander, Rafah Salameh.\nHe has run the Hamas military wing since 2002, when his predecessor was killed in an Israeli airstrike in Gaza City.\nIsrael has tried to kill him many times and he has reportedly suffered numerous injuries, including the loss of an eye.", "location": "GAZA", "classification": "security", "score": 0.9615106904858504, "event_breakdown": "Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza (location), officials said."}, {"id": "1727640d-bdc6-4d8d-b942-a912411edacb", "title": "Israel targets Hamas commander in airstrikes that kill 90 Palestinians", "date": "2024-07-14 01:30", "url": "https://www.wrkf.org/2024-07-13/israel-targets-hamas-commander-in-airstrikes-that-kill-90-palestinians", "domain": "wrkf.org", "domain_classification": "Unknown", "message": "Updated July 13, 2024 at 16:09 PM ETTEL AVIV — Powerful Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, officials said.\nThe Israelis bombed the city of Khan Younis and the nearby costal area of al-Muwasi, which has been designated a humanitarian safe zone by the Israeli military.\nIn a briefing, an Israeli military official, speaking on condition of anonymity, said the attack targeted Deif, as well as another senior Hamas commander, Rafah Salameh.\nHe has run the Hamas military wing since 2002, when his predecessor was killed in an Israeli airstrike in Gaza City.\nIsrael has tried to kill him many times and he has reportedly suffered numerous injuries, including the loss of an eye.", "location": "GAZA CITY", "classification": "security", "score": 0.9615106904858504, "event_breakdown": "Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, as the Israeli military bombed the city of Khan Younis and the coastal area of al-Muwasi, which has been designated a humanitarian safe zone. The attack targeted Hamas military wing commander Muhammad Deif, as well as Rafah Salameh, another senior Hamas commander. The Israeli army has tried to kill Deif many times and he is rumored to have survived numerous injuries, including the loss of an eye."}, {"id": "4a045f72-c833-41b0-8409-db4adf846022", "title": "Israel targets Hamas commander in airstrikes that kill 90 Palestinians", "date": "2024-07-14 01:30", "url": "https://www.klcc.org/npr-world-news/2024-07-13/israel-targets-hamas-commander-in-airstrikes-that-kill-90-palestinians", "domain": "klcc.org", "domain_classification": "Unknown", "message": "Updated July 13, 2024 at 16:09 PM ETTEL AVIV — Powerful Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, officials said.\nThe Israelis bombed the city of Khan Younis and the nearby costal area of al-Muwasi, which has been designated a humanitarian safe zone by the Israeli military.\nIn a briefing, an Israeli military official, speaking on condition of anonymity, said the attack targeted Deif, as well as another senior Hamas commander, Rafah Salameh.\nHe has run the Hamas military wing since 2002, when his predecessor was killed in an Israeli airstrike in Gaza City.\nIsrael has tried to kill him many times and he has reportedly suffered numerous injuries, including the loss of an eye.", "location": "GAZA CITY", "classification": "security", "score": 0.9615106904858504, "event_breakdown": "Israeli airstrikes in southern Gaza kills 90 Palestinians - July 13, 2024"}, {"id": "45823880-085b-4d79-b351-a9504ba71702", "title": "Death toll rises to 90 in Gaza refugee camp strike , 300 injured", "date": "2024-07-14 00:00", "url": "https://www.yahoo.com/news/death-toll-rises-90-gaza-230258217.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Emergency workers rush to attend to victims after an Israeli air strike on the Al-Mawasi camp for the displaced Palestinians.\nMany were severely wounded and are in danger of dying, according to medical sources in the Gaza Strip.\nIsraeli media reported that the target of the strike was Mohammed Deif, the leader of Hamas' military wing in Gaza.\nThe Israeli military said on Saturday that operations were continuing throughout the Gaza Strip, including in Gaza City.\nEmergency workers rush to attend to victims after an Israeli air strike on the Al-Mawasi camp for the displaced Palestinians.", "location": "GAZA CITY", "classification": "security", "score": 0.9650826400806812, "event_breakdown": "Israeli air strikes on the Gaza Strip\nCategory: Israeli air strikes on the Gaza Strip\nTarget event - Israel continues operations in the Gaza Strip"}, {"id": "1be19f45-6947-49b4-a806-ed3b0f1fdc3a", "title": "Hamas Denies Claims Of Its Military Leaders Targeted In Israeli Attack", "date": "2024-07-14 03:00", "url": "https://menafn.com/1108435616/Hamas-Denies-Claims-Of-Its-Military-Leaders-Targeted-In-Israeli-Attack", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) GAZA/JERUSALEM, Jul 14 (NNN-WAFA) – Hamas, yesterday, denied claims that its military leaders were targeted in an Israeli attack in the Mawasi area of the Khan Younis city, in the south of Gaza.\nThe Gaza authorities said that at least 71 Palestinians were killed and 289 others injured by the Israeli airstrike, that attacked tents of displaced people in Khan Younis.\nThe report didn't provide details regarding the current status of the two Hamas military leaders.\nNevertheless, the Israeli Defence Forces told Army Radio that the strike had been well-planned and carried out with extreme precision.\nAs usual raid cases, there was no comment from the Israeli army about the raid.", "location": "GAZA/JERUSALEM", "classification": "security", "score": 0.9739850969486848, "event_breakdown": "GAZA/JERUSALEM, July 14, 2021 (NNN-WAFA) – The Israeli Defense Forces (IDF) on Tuesday attacked the streets of Khan Younis in the Gaza strip, a military spokesman said.\nThe IDF spokesman said that 61 Palestinians were killed in the attack and another 290 were injured. In retaliation, the military fired rockets at the headquarters.\nThere were no immediate reports about Israeli casualties.\nOn Monday, another IDF airstrike killed a Hamas military commander in Gaza.\nThe Times of Israel said that three attacking IDF planes fired four missiles on a building in Gaza City on Monday morning.\nHamas has declared victory in Gaza, saying that its military operations had deterred Israel from carrying out the threats it had made over the weekend. – NNN-WAFA"}, {"id": "529e0a37-6bfa-4228-a8fa-6d847deaefa3", "title": "This Week in West Virginia History | News , Sports , Jobs", "date": "2024-07-14 00:00", "url": "https://www.theintelligencer.net/news/community/2024/07/this-week-in-west-virginia-history-2/", "domain": "theintelligencer.net", "domain_classification": "Unknown", "message": "The following events happened on these dates in West Virginia history.\nTo read more, go to e-WV: The West Virginia Encyclopedia at www.wvencyclopedia.org.\nJuly 15, 1988: Interstate 64 was completed when the final section between Sam Black Church and the West Virginia Turnpike was opened to traffic.\nJuly 18, 1776: Methodist bishop Francis Asbury first set foot in present West Virginia outside of Berkeley Springs.\nAfter graduating from West Virginia University, her short stories and novels began receiving wide recognition.", "location": "West Virginia", "classification": "security", "score": 0.42614596572805225, "event_breakdown": "July 15, 1988: Interstate 64 was completed when the final section between Sam Black Church and the West Virginia Turnpike was opened to traffic. [WVencyclopedia.org]\nJuly 18, 1776: Methodist bishop Francis Asbury first set foot in present West Virginia outside of Berkeley Springs. [WVencyclopedia.org]"}, {"id": "06e4669a-e322-4246-a1bf-40874944ebe5", "title": "Invictus Games 2025 : Plymouth veteran to lead Team united kingdom in first winter sports event", "date": "2024-07-14 05:30", "url": "https://www.plymouthherald.co.uk/news/plymouth-news/invictus-games-2025-plymouth-veteran-9403486", "domain": "plymouthherald.co.uk", "domain_classification": "Unknown", "message": "Get the stories that matter to our community straight to your inbox with our Daily NewsletterSomething went wrong, please try again later.\nRead more:'Hoops' is returning for his second Invictus Games after competing in powerlifting and sitting volleyball at Dusseldorf in 2023.\nThe Invictus Games Vancouver Whistler 2025 will take place from 8-16 February.\nThrough a process led by the Invictus Games Foundation, Birmingham and Washington have been shortlisted to host the Invictus Games in 2027.\nAccess to adaptive sports and the opportunity to participate in the Invictus Games is just one way the RBL supports the wounded, injured and sick community.", "location": ".\nThe main location of the Invictus Games is Whistler, Vancouver.", "classification": "security", "score": 0.45623588616425853, "event_breakdown": "Target event: The Invictus Games Vancouver Whistler 2025 will take place from 8-16 February."}, {"id": "4206a202-bfd1-4b9f-b5a9-d52d34f0a86a", "title": "Report : Israel Targets Hamas Millitary Leader Muhammad Deif in Airstrike", "date": "2024-07-14 06:00", "url": "https://www.breitbart.com/politics/2024/07/13/report-israel-kills-hamas-millitary-leader-muhammad-deif-in-airstrike/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "… The whereabouts of Deif are unknown, though he is most likely in Gaza in the maze of tunnels under the enclave.\nAn Israeli security source said Deif was directly involved in the planning and operational aspects of the attack.\nAn IDF biography of Deif describes his long career of terror:Mohammed Deif is the military leader of Hamas, a widely recognized terrorist organization.\nIt could cause Hamas to break off talks, or could create new pressure on Hamas leaders to save themselves through a deal.\nUpdate: Hamas leaders have denied that Deif was killed in the Israeli airstrike, though they provided no evidence.", "location": "Gaza", "classification": "security", "score": 0.8981972071635206, "event_breakdown": "Recent reports suggest that Israeli military leader Mohammed Deif, who is believed to be hiding in the tunnels under the Gaza Strip, is currently planning a new attack against Israel.\nIsrael's military spokesperson said Deif is directly involved in the planning of a suicide bombing attack in Tel Aviv, and that the IDF is on high alert in response to this threat.\nThe IDF suspects that Deif may be hiding in a secret tunnel network located beneath Gaza. The Israeli army has been conducting airstrikes to try to destroy these network."}, {"id": "5e5f1cc8-a045-4e29-8c67-8c8d4ae4df89", "title": "Israel - Hamas War day 282 : What is going on in Gaza , Lebanon ? ", "date": "2024-07-14 06:15", "url": "https://www.jpost.com/israel-hamas-war/2024-07-14/live-updates-810184", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Women attend the funeral of Hezbollah fighters Abbas Ahmad Srour and Mohammad Hussein Kassem on June 29, 2024 in Aita al Chaab, Lebanon.\n(photo credit: Chris McGrath/Getty Images)Following the strike that targeted Mohammad Deif, University of Haifa Prof. Amatzia Baram estimated Hezbollah terrorists would not change their modus operandi in the North.\n\"Despite the attempted assassination, Hezbollah will not operate in a more significant way than it is currently.\nIt will continue with the usual method of operation - and will not increase the fire,\" he asserted.\n\"In the past, we killed senior commanders in Gaza, and Hezbollah never responded to their assassinations.\"", "location": "Lebanon", "classification": "security", "score": 0.8754177651177893, "event_breakdown": "No relevant current events of security were reported in the text."}, {"id": "ec0be7aa-8d76-4e8b-b434-f3ec15810587", "title": "Deif elimination would be a major blow to Hamas | Israel National News", "date": "2024-07-14 09:30", "url": "http://www.israelnationalnews.com/news/392996", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "(JNS) The elimination of Mohammad Deif, head of Hamas’s military wing, represents a significant blow to both Hamas’s morale and operational capabilities.\nThe two targets were Deif, the commander of Hamas’s military wing, and Rafa Salama, the commander of Hamas’s Khan Younis Brigade.\nAccording to Israeli intelligence, most of the other casualties from the strike were also terrorists.\nDeif’s elimination will disrupt Hamas’s military hierarchy and operational planning, dealing a severe blow to its command structure.\nHis expertise and leadership in guerilla warfare and mass-casualty terrorism, and his ability to adapt and transform Hamas’s military capabilities, made him an invaluable asset to the organization.", "location": "GAZA", "classification": "security", "score": 0.9826823570018675, "event_breakdown": "Eliminating Mohammad Deif, head of Hamas's military wing, represents a significant blow to both Hamas's morale and operational capabilities."}, {"id": "b67b1dc1-f782-47e6-9861-6e75e1a30892", "title": "Asharq Al Awsat : Sinwar Brother to Succeed Al - Deif as Head of Al - Qassam Brigades | The Jewish Press - JewishPress . com | David Israel | 8 Tammuz 5784 – Sunday , July 14 , 2024", "date": "2024-07-14 07:45", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/asharq-al-awsat-sinwars-brother-to-succeed-al-deif-as-head-of-al-qassam-brigades/2024/07/14/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Also still among the living are Muhammad Al-Sinwar, and his brother Yahya Al-Sinwar, the leader of Hamas in Gaza.\nTo understand the impact of Al-Deif’s potential absence, the status of the Al-Qassam Brigades must be understood.\nAl-Deif was the second commander of the Al-Qassam Brigades, and he assumed his position after the Israeli army assassinated its former commander-in-chief, Salah Shehadeh, on July 23, 2002.\n“Since October 7, the assassination of Al-Deif has become an Israeli obsession, after 6 previous failed attempts,” the report continues.\nThe sources suggested that Muhammad Al-Sinwar would direct the work of the military council if the success of the assassination of Al-Deif was confirmed.", "location": "Gaza", "classification": "security", "score": 0.7905772338868328, "event_breakdown": "Muhammad Al-Sinwar, terrorist leader, targeted in assassination attempt"}, {"id": "adfe98b3-280f-4f0f-bfc6-1a074e5c5afe", "title": "Ukraine Border Guards Forming First Uncrewed Systems Unit", "date": "2024-07-14 06:30", "url": "https://menafn.com/1108436192/Ukraines-Border-Guards-Forming-First-Uncrewed-Systems-Unit", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Pomsta Assault Brigade is forming the first team of reconnaissance-strike unmanned aerial systems, having launched the selection process.\nThat's according to the press service of the Yevhen Pius 3rd Border Guard Detachment, Ukrinform reports.\n\"One of the most effective combat commanders of the State Border Guard Service, Hero of Ukraine Dmytro Oleksiuk, has been entrusted with forming a combat unmanned systems unit,\" reads the report posted on Facebook.\nUkrainian forces shoot down two Russian reconnaissanceon southern frontDetails on how to join the unit is available on the unit page.\nAs Ukrinform reported earlier, on May 7, a new type of military forces was set up in Ukraine – the Unmanned Systems Forces.", "location": "UKRAINE", "classification": "security", "score": 0.559245614684564, "event_breakdown": "a new type of military forces has been set up - the Unmanned Systems Forces.\na new elite unit of border guards is being set up - the Pomsta Assault Brigade.\na new combat team of unmanned aerial systems is being set-up by the Yevhen Pius 3rd Border Guard Detachment."}, {"id": "d2fe55c4-1b5d-4564-81f2-ffa98d516c47", "title": "Key Corner Kilak battle with Lakwena revisited", "date": "2024-07-14 06:00", "url": "https://www.monitor.co.ug/uganda/news/national/key-corner-kilak-battle-with-lakwena-revisited-4689384", "domain": "monitor.co.ug", "domain_classification": "Unknown", "message": "After toppling the Tito Okello government, Col Ndahura Atwooki, then a sergeant, found himself swapping his military fatigues for a suit.\nA year later, rebel leader Alice Lakwena became a thorn in the country’s flesh,” Col Ndahura says.\nThis would mean, adds Col Ndahura, Lakwena’s force pursuing them when they were in a weak position.\nCol Ndahura says something came to his mind to give it another try rather than just fleeing from the enemy.\nThe rumour quickly spread and was believed by the other gangs that they never dared to attack Ugandan troops.", "location": "Uganda", "classification": "security", "score": 0.5369466079417806, "event_breakdown": "1. Lakwena’s pursuit of Col Ndahura and his troops when they were in a weak position.\n2. Col Ndahura’s decision to try something different rather than just fleeing from Lakwena’s force.\n3. The spread of a rumor that the other gangs did not dare to attack Ugandan troops."}, {"id": "edd11510-f81e-4c28-91d1-ab5efbe090ee", "title": "Russians lose over 1 , 300 soldiers and 46 artillery systems over past 24 hours", "date": "2024-07-14 07:30", "url": "https://www.yahoo.com/news/russians-lose-over-1-300-051919021.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russians lose over 1,300 soldiers and 46 artillery systems over past 24 hoursRussian forces have lost 1,320 troops (killed and wounded in action) and dozens of pieces of equipment over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 14 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 559,090 (+1,320) military personnel;8,206 (+7) tanks;15,811 (+32) armoured combat vehicles;15,262 (+46) artillery systems;1,119 (+0) multiple-launch rocket systems;890 (+1) air defence systems;361 (+0) fixed-wing aircraft;326 (+0) helicopters;12,108 (+39) strategic and tactical UAVs;2,397 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;20,538 (+77) vehicles and tankers;2,566 (+10) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": ".\nKyiv", "classification": "security", "score": 0.8560271672161016, "event_breakdown": "The Russian forces lost 1,320 troops and dozens of military equipment in Ukraine over the past 24 hours.\n\nTo learn more about this event, read the original article on the General Staff of the Armed Forces of Ukraine's Facebook page, and see the figure released by the military."}, {"id": "7e9ba2e7-690b-4fdd-9e8d-0fba182b40f1", "title": "PoJK : Local media outlet attempts to promote terrorist agenda – Indian Defence Research Wing", "date": "2024-07-14 07:15", "url": "https://idrw.org/pojk-local-media-outlet-attempts-to-promote-terrorist-agenda/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "The video prominently features journalist Taqil ul Hassan conducting an open interview with the leader of this designated terrorist organisation.\nHizbul Mujahideen aims to establish an Islamic state in Kashmir and seeks the merger of Jammu and Kashmir with Pakistan.\nHizbul Mujahideen was responsible for several kidnappings and killings of civilians and security personnel during the 1990s.\nHizbul Mujahideen was involved in the assassinations of political leaders and individuals considered to be against their objectives.\nPakistan providing a platform for interviews with leaders of designated terrorist organisations like Hizbul Mujahideen demonstrates a concerning aspect of the country’s stance on terrorism.", "location": "Pakistan", "classification": "security", "score": 0.6893304526433182, "event_breakdown": "-Hizbul Mujahideen, a designated terrorist organisation, conducted an open interview with journalist Taqil ul Hassan in Pakistan. The video prominently features the leader of Hizbul Mujahideen, who is trying to establish an Islamic state in Kashmir and seeks the merger of Jammu and Kashmir with Pakistan. Hizbul Mujahideen was responsible for the kidnappings and killings of civilians and security personnel during the 1990s.\n-On March 28, 2022, a car bomb exploded near a market in Kabul, killing at least one person and wounding several others. The attack comes a week after a suicide bomber killed six people at a security checkpoint in the city. No group has claimed responsibility for the explosion.\n-In the same month, on March 21, 2022, a suicide bomb attack on a military convoy in Pakistan's northwestern city of Peshawar killed at least five people and wounded several more. The attack was claimed by Tehreek-e Taliban Pakistan (TTP), a militant group that claimed credit for a number of other attacks in Pakistan in 2022.\n-In March 2022, a suicide bombing in the Afghan capital of Kabul killed at least 10 people and wounded dozens more. The Islamic State group claimed responsibility for the attack, which targeted a gathering of minority Shiite Muslims.\n-In the same month, a suicide bombing at a Sikh temple in Afghanistan's capital of Kabul killed at least 25 people and wounded several others. The Islamic State group claimed responsibility for the attack, which targeted the religious minority."}, {"id": "f1e7c720-ae12-4637-8bb5-9ec20237b7c2", "title": "IDF kills terrorists , strikes terror targets in Gaza", "date": "2024-07-14 09:30", "url": "https://www.jpost.com/breaking-news/article-810209", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The military also targeted a terror cell in the area.\nIn addition, forces of the 401st Brigade demolished several underground shafts and terror infrastructure, the IDF said.\nIn Gaza City, forces of the Alexandroni Brigade eliminated several terrorists in close-quarter combat.\nDuring one of the operations, the IDF noted that a terror cell was identified moving in the sector and attempting to bury an explosive device near the forces.\nThe IDF said the cell was subsequently struck and eliminated.", "location": "Gaza City", "classification": "security", "score": 0.990316277495417, "event_breakdown": "Military targets Hamas underground infrastructure in close combat\nTel Aviv, Israel: The Israeli Defense Forces (IDF) announced today that in a joint operation, several military units and Israeli Military Intelligence managed to break into a building in southern Gaza City that was used by senior Hamas officials.\nIDF units spotted a Hamas senior official, Mohammed Deif, in the compound and opened fire.\nThe Israeli Defense Ministry reported no IDF casualties during the operation, but one Hamas terrorist was killed, and another was wounded."}, {"id": "44343c21-433d-4917-ae00-0e945a1773e7", "title": "US rescue non profit to evacuate Americans as tensions between Israel and Lebanon reach a breaking point", "date": "2024-07-14 09:30", "url": "https://www.washingtonexaminer.com/news/world/3078504/us-non-profit-evacuate-americans-in-lebanon-tensions-rise/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "As war between Israel and Hezbollah looms, an estimated 86,000 Americans remain in Lebanon, potentially being caught in the crossfire.\nA war between Israel and Hezbollah would likely spark the most destructive war in the region in decades and lay waste to vast swathes of Israel and Lebanon.\n“The biggest [challenge] is that there’s only one airport,” Stern told the Washington Examiner in an interview.\n“Obviously, can’t go south, because I’m going into Hezbollah territory and then into the Israeli war machine, into the war.\nWorkers unload a shipment from an airplane during a tour for journalists and diplomats at the Rafik Hariri International Airport in Beirut, Lebanon, Monday, June 24, 2024.", "location": "Beirut", "classification": "security", "score": 0.7124322372996057, "event_breakdown": "The events listed in this text are the conflict between Israel and Hezbollah and the presence of 86,000 Americans in Lebanon. These events can be plotted on a map of Israel and Lebanon."}, {"id": "42144401-66c0-4ce5-b6b1-aa34b6a4fbf0", "title": "Hezbollah Retaliates with Kiryat Shmona Shelling After Israeli Strike Kills Two in Lebanon", "date": "2024-07-14 12:15", "url": "https://dailystar.com.lb/hezbollah-retaliates-kiryat-shmona-shelling/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Hezbollah launched a series of rocket attacks on Israel from Lebanon on Saturday in response to an Israeli airstrike that reportedly killed two civilians in southern Lebanon.\nFollowing the rocket attacks, Israeli aircraft targeted a Hezbollah field commander near Kfar Tebnit in southern Lebanon.\nFurther attacks from Hezbollah targeted Israeli military positions along the border throughout Saturday.\nHezbollah claimed their rocket fire was a direct response to Israeli aggression against Lebanese villages and civilians.\nThe ongoing hostilities have heightened fears of a larger conflict reminiscent of the 2006 war between Israel and Hezbollah.", "location": "Lebanon", "classification": "security", "score": 0.9949504498787685, "event_breakdown": "Event 1: Hezbollah launches a series of rocket attacks on Israel from Lebanon on Saturday in response to an Israeli airstrike that reportedly killed two civilians in southern Lebanon\nEvent 2: Israeli aircraft targeted a Hezbollah field commander near Kfar Tebnit in southern Lebanon, following a series of rocket attacks from Hezbollah targeting Israeli military positions along the border throughout Saturday."}, {"id": "5eae97cd-7d72-4f63-b485-a6ddcaa5e7e6", "title": "Israel targets Hamas commander in airstrikes that kill 90 Palestinians", "date": "2024-07-14 10:30", "url": "https://www.ctpublic.org/2024-07-13/israel-targets-hamas-commander-in-airstrikes-that-kill-90-palestinians", "domain": "ctpublic.org", "domain_classification": "Unknown", "message": "Updated July 13, 2024 at 16:09 PM ETTEL AVIV — Powerful Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza, officials said.\nThe Israelis bombed the city of Khan Younis and the nearby costal area of al-Muwasi, which has been designated a humanitarian safe zone by the Israeli military.\nIn a briefing, an Israeli military official, speaking on condition of anonymity, said the attack targeted Deif, as well as another senior Hamas commander, Rafah Salameh.\nHe has run the Hamas military wing since 2002, when his predecessor was killed in an Israeli airstrike in Gaza City.\nIsrael has tried to kill him many times and he has reportedly suffered numerous injuries, including the loss of an eye.", "location": "GAZA", "classification": "security", "score": 0.9615106904858504, "event_breakdown": "Israeli airstrikes killed 90 Palestinians and wounded 300 Saturday in southern Gaza. an Israeli airstrike targeted the Gaza City home of Hamas commander Deif, as well as another senior Hamas commander Rafah Salameh."}, {"id": "f5e2a52d-a2f5-4802-b761-12074ddc9d1b", "title": "Hamas quits Gaza talks after Israeli strike against leader kills 92", "date": "2024-07-14 14:00", "url": "https://www.dailysabah.com/world/mid-east/hamas-quits-gaza-talks-after-israeli-strike-against-leader-kills-92", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "The Palestinian resistance group Hamas said Sunday it was pulling out of Gaza truce talks after an Israeli airstrike against one of its military leaders killed over 90 civilians.\n\"Commander Mohammed Deif is well and directly overseeing\" the operations of the Hamas military wing, the official told Agence France-Presse (AFP).\nThe Israeli military meanwhile said operations were continuing throughout the territory, including in Gaza City and Rafah.\nThe Israeli military said of its attack targeting Deif that \"the area that was struck is an open area, surrounded by trees, several buildings and sheds.\nOn Saturday night Hamas official Bassem Naim told AFP that Netanyahu was to blame for the impasse and called on Biden to put \"sufficient pressure\" on the Israeli leader to secure a deal.", "location": "GAZA CITY", "classification": "security", "score": 0.8335524884009843, "event_breakdown": "1. Israeli airstrike hits Hamas commander in Gaza"}, {"id": "8f5442d4-a0ae-4a1a-8c68-3f4138549733", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:30", "url": "https://www.yahoo.com/news/hamas-says-gaza-cease-fire-134531934.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military on Sunday announced that Rafa Salama, a Hamas commander it described as one of Deif's closest associates, had been killed in Saturday's strike.\nHamas rejected the idea that mediated cease-fire discussions had been suspended after the strike.\nHamas political officials insisted that communication channels remained functional between the leadership inside and outside Gaza after the strike in the territory's south.\nMore than 38,400 people in Gaza have been killed in Israeli ground offensives and bombardments since then, according to the territory’s Health Ministry.\nOn Sunday, an Israeli strike in Nuseirat in central Gaza killed at least 13 people at the gate of a school, according to Associated Press journalists at Al-Awda hospital.", "location": "GAZA", "classification": "security", "score": 0.946374414327434, "event_breakdown": "Hamas political officials insisted that communication channels remained functional between the leaders inside and outside Gaza. However, an Israeli strike in the territory’s south has caused some disruption and confusion within the organization. The Israeli military has announced the death of Rafa Salama, a Hamas commander described as one of Deif’s closest associates. On Sunday, an Israeli strike in Nuseirat in central Gaza killed at least 13 people at the gate of a school, according to Associated Press journalists at Al-Awda hospital."}, {"id": "b17bb150-0d59-402c-a4ce-0116c8efddfa", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:30", "url": "https://www.startribune.com/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/600380649/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "The Israeli military on Sunday announced that Rafa Salama, a Hamas commander it described as one of Deif's closest associates, had been killed in Saturday's strike.\nThe killing of Deif would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nHamas political officials insisted that communication channels remained functional between the leadership inside and outside Gaza after the strike in the territory's south.\nMore than 38,400 people in Gaza have been killed in Israeli ground offensives and bombardments since then, according to the territory's Health Ministry.\nOn Sunday, an Israeli strike in Nuseirat in central Gaza killed at least 13 people at the gate of a school, according to Associated Press journalists at Al-Awda hospital.", "location": "GAZA", "classification": "security", "score": 0.9260391057231622, "event_breakdown": "Israeli airstrike kills Hamas commander in Gaza in setback for group\n\nTel Aviv, Israel - The Israeli Defence Force (IDF) on Sunday said it killed a Gaza City commander, Rafa Salama, it described as one of Hamas' military chiefs, in a rocket strike on his home on Saturday.\n\nThe injuring and killing of some Hamas commanders shows that Israel was forging ahead with its offensive on the Gaza Strip, according to the country's state-owned media.\n\nThe IDF said 100 died in overnight ground and rocket fire, and the IDF said more than 50 al Qaeda militants were killed in operations.\n\nThe deaths in Gaza topped with more than 38,400 people killed since the start of Israeli operations."}, {"id": "cc48d8a4-323a-48fa-97c6-00bc3034ac7c", "title": "Hamas Abandons Gaza Truce Talks Following Israeli Strike on Deif", "date": "2024-07-14 12:15", "url": "https://dailystar.com.lb/hamas-abandons-gaza-talks-israeli-strike-deif/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "On Sunday, a Hamas official announced that the group would cease participation in ceasefire discussions with Israel following an Israeli airstrike aimed at their commander, Mohammed Deif.\nDespite the strike, another Hamas member confirmed that Deif was unharmed and actively commanding operations.\nThis announcement followed an intense Israeli airstrike on a displacement camp in southern Gaza on Saturday, targeting Deif in what Hamas described as an unjustifiable attack.\nIsraeli officials acknowledged targeting Deif and another military leader in Saturday’s strikes, though Prime Minister Benjamin Netanyahu admitted uncertainty regarding their fates.\nOn the same day, other Israeli strikes in Gaza City resulted in at least eight additional deaths.", "location": "Gaza City", "classification": "security", "score": 0.9056417852114513, "event_breakdown": "Israeli strikes in Gaza City and on Deif's home\nNetanyahu acknowledging uncertainty\nHamas denying an attack on Deif"}, {"id": "26b850af-cc12-4c81-a63c-dae4bb33adf3", "title": "Israeli strike targeting Hamas military chief kills at least 90", "date": "2024-07-14 10:30", "url": "https://www.politico.eu/article/israeli-strike-targeting-hamas-military-chief-kills-at-least-90/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said more military pressure on Hamas would improve chances of a hostage deal.\n| POOL photo by Jack Guez/Getty ImagesThe strike took place in an area Israel’s military had designated as safe for hundreds of thousands of Palestinians.\nAn Israeli airstrike killed at least 90 Palestinians in Gaza on Saturday, the enclave’s health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nIsraeli Prime Minister Benjamin Netanyahu late Saturday said it remained unclear whether Deif and another Hamas commander had been killed in the strike and promised to continue to target Hamas leadership, according to media reports.\nNetayahu said more military pressure on Hamas would improve chances of a hostage deal, even as three days of cease-fire talks separately stalled on Saturday.", "location": "GAZA", "classification": "security", "score": 0.6350178559292194, "event_breakdown": "Gaza"}, {"id": "c0edde57-2cbf-4424-b274-ab289c2e95f9", "title": "Hamas sources confirm killing of Khan Yunis Brigade commander", "date": "2024-07-14 08:00", "url": "http://www.israelnationalnews.com/news/392990", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Sources in the Hamas terrorist organization confirmed to the London-based Asharq Al-Awsat Arabic-language newspaper that Rafaa Salama, the commander of the Hamas Khan Yunis Brigade, was killed in an Israeli airstrike.\nThe sources refused to confirm or deny the reports that Mohammed Deif, the head of Hamas' military wing, was killed in the airstrike.\nThe IDF confirmed on Saturday that Deif was targeted in an airstrike.\nThey also said that the commander of the Khan Yunis Brigade was definitely killed.\nDeif and Salama are believed to be two of the architects of the October 7 massacre.", "location": "GAZA", "classification": "security", "score": 0.9647629823211042, "event_breakdown": "IDF confirms airstrike targeting Hamas military chief Mohammed Deif and the commander of the Hamas Khan Yunis Brigade, Rafaa Salama."}, {"id": "9add4a10-74ee-44d8-af0d-aef70e03b433", "title": "Hamas sources confirm killing of Khan Yunis Brigade commander", "date": "2024-07-14 08:00", "url": "https://www.israelnationalnews.com/news/392990", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Sources in the Hamas terrorist organization confirmed to the London-based Asharq Al-Awsat Arabic-language newspaper that Rafaa Salama, the commander of the Hamas Khan Yunis Brigade, was killed in an Israeli airstrike.\nThe sources refused to confirm or deny the reports that Mohammed Deif, the head of Hamas' military wing, was killed in the airstrike.\nThe IDF confirmed on Saturday that Deif was targeted in an airstrike.\nThey also said that the commander of the Khan Yunis Brigade was definitely killed.\nDeif and Salama are believed to be two of the architects of the October 7 massacre.", "location": "GAZA", "classification": "security", "score": 0.9647629823211042, "event_breakdown": "IDF confirmed that Deif was targeted in an airstrike and the commander of Khan Yunis Brigade was killed.\nPlace both of these on a map."}, {"id": "7e02a7e8-8dc4-4723-b6ff-38a5abc0f193", "title": "1 killed , 3 injured in an Israeli airstrike in Damascus", "date": "2024-07-14 08:45", "url": "https://www.albawaba.com/news/1-killed-3-injured-israeli-airstrike-1576986", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - According to a report by Syrian news agency SANA, an overnight Israeli airstrike killed one soldier and injured 3 others.\nThe report revealed that the strike targeted Syrian military sites in the southern region and a residential building in Kafr Sousa neighborhood in Damascus.\nThe Syrian military released a statement detailing that the strike came from the direction of the \"occupied Syrian Golan,\".\nThe statement also added that the Syrian military had intercepted several Israeli missiles.\nOn July 3rd, an Israeli strike in southern Lebanon killed a senior commander in Hezbollah and injured another man who is believed to be the commander's son in the southern city of Tyre.", "location": "Damascus", "classification": "security", "score": 0.979203163049001, "event_breakdown": "Israeli airstrike targets Syrian military positions in southern Damascus."}, {"id": "ed0bd225-02b6-40ff-a637-89d17bb60700", "title": "At least 90 Palestinians reportedly killed after Israel targets Hamas military chief", "date": "2024-07-14 06:30", "url": "https://www.sbs.com.au/news/podcast-episode/at-least-90-palestinians-reportedly-killed-after-israel-targets-hamas-military-chief/wixd478jd", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "This Palestinian woman's father, was among at least 90 Palestinians killed and 289 injured, in an Israeli air strike on al-Mawasi, east of Khan Younis, in central Gaza.\nIsrael says it conducted the strike there to target senior Hamas leader Mohammed Deif and his deputy, Rafa Salama.\nSpeaking from the overwhelmed Nasser Medical complex in Khan Younis Abddallah Abu Madi, says Israel struck several times with a barrage of missiles.\nMohammed Saqr is the spokesperson for the Nasser Medical Centre.\nScott Anderson from the United Nations agency for Palestinian Refugees has been to Nasser Hospital in Khan Younis where many of the wounded are being treated.", "location": "Khan Younis, Gaza Strip", "classification": "security", "score": 0.887913095492976, "event_breakdown": "Israel struck targets in the Gaza Strip on Wednesday, killing at least 90 Palestinians and wounding 289 people, in an attack on what the Israeli military said was an Islamic Jihad commander's home. The Israeli military also said the target was Mohammed Deif and his deputy, Rafa Salama."}, {"id": "c6f2d34d-6e72-459b-9b70-7f36cf0e2bdc", "title": "Strike kills at least 90 in Gaza safe zone | The Arkansas Democrat - Gazette", "date": "2024-07-14 13:15", "url": "https://www.arkansasonline.com/news/2024/jul/14/strike-kills-at-least-90-in-gaza-safe-zone/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "KHAN YOUNIS, Gaza Strip -- Israel said it targeted Hamas' shadowy military commander in a major strike Saturday in the crowded southern Gaza Strip that killed at least 90 people including children, according to local health officials.\nWitnesses said the strike landed in Muwasi, the Israeli-designated safe zone that stretches from northern Rafah to Khan Younis.\nPalestinians evacuate a dead person from a site hit by an Israeli bombardment on Khan Younis, southern Gaza Strip, Saturday, July 13, 2024.\n(AP Photo/Mahmoud Illean)Palestinians inspect the damage at a site hit by an Israeli bombardment on Khan Younis, southern Gaza Strip, Saturday, July 13, 2024.\n(AP Photo/Mahmoud Illean)Palestinians search for bodies and survivors in a site hit by an Israeli bombardment on Khan Younis, southern Gaza Strip, Saturday, July 13, 2024.", "location": "GAZA CITY", "classification": "security", "score": 0.9712326550373606, "event_breakdown": "New event: Israeli bombardment on Khan Younis (Israeli attack on the southern Gaza Strip) on July 13, 2024."}, {"id": "0793bac5-c981-4470-84a5-0af5081e19ca", "title": "Mohammed Deif : The elusive Hamas leader at the centre of Israeli strikes", "date": "2024-07-14 03:15", "url": "https://www.thehindubusinessline.com/news/world/mohammed-deif-the-elusive-hamas-leader-at-the-centre-of-israeli-strikes/article68402522.ece", "domain": "thehindubusinessline.com", "domain_classification": "Unknown", "message": "Hamas' military leader Mohammed Deif, one of the masterminds behind what Israel termed its 9/11 moment, is an elusive figure who has rarely spoken and never appeared in public, and who has survived at least seven Israeli assassination attempts.\nDeif was the target of an Israeli strike on Saturday on the Gaza town of Khan Younis, the Israeli military said.\nRising up the Hamas ranks over 30 years, Deif developed the group's network of tunnels and its bomb-making expertise.\nAn Israeli security source said Deif was directly involved in the planning and operational aspects of the attack.\nHe was arrested by Israel in 1989 and spent about 16 months in detention, a Hamas source said.", "location": "Gaza", "classification": "security", "score": 0.8837356064100386, "event_breakdown": "Event 1: Israel targeted Gaza's leader Mohammad Deif on Saturday the leaders of Gaza said, releasing a video of a man Israel said was Deif.\nEvent 2: Israeli's soldiers kill a commander of Islamic Jihad, the Palestinian militant group, early Tuesday and militants fire rockets towards Israeli cities from Gaza in retaliation for the killing of one of its senior leaders in an airstrike.\nEvent 3: Israel bombed the home of Gaza's leader early on Wednesday and the home and the home to the younger brother of the leader of Gaza early Wednesday"}, {"id": "2170fda8-c8fd-4027-92a3-6206b4cc1685", "title": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chief", "date": "2024-07-14 03:45", "url": "https://www.asiaone.com/world/gaza-officials-say-90-palestinians-killed-israel-targets-hamas-military-chief", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "CAIRO/GAZA/JERUSALEM — An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday (July 13), the enclave's health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nThe militant Islamist group Hamas denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nAn Israeli military official earlier told reporters it was still verifying the strike's results.\nThe Israeli military published an aerial photo of the site, which Reuters was not immediately able to verify, where it said \"terrorists hid among civilians\".\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.9452346547592895, "event_breakdown": "Cairo, Gaza Strip, Jerusalem\nAn Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday (July 13), the enclave's health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif."}, {"id": "046eaa4b-32ce-4f0e-9e95-0e7dbd4d6310", "title": "Deif elimination would be a major blow to Hamas | Israel National News", "date": "2024-07-14 08:00", "url": "https://www.israelnationalnews.com/news/392996", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "(JNS) The elimination of Mohammad Deif, head of Hamas’s military wing, represents a significant blow to both Hamas’s morale and operational capabilities.\nThe two targets were Deif, the commander of Hamas’s military wing, and Rafa Salama, the commander of Hamas’s Khan Younis Brigade.\nAccording to Israeli intelligence, most of the other casualties from the strike were also terrorists.\nDeif’s elimination will disrupt Hamas’s military hierarchy and operational planning, dealing a severe blow to its command structure.\nHis expertise and leadership in guerilla warfare and mass-casualty terrorism, and his ability to adapt and transform Hamas’s military capabilities, made him an invaluable asset to the organization.", "location": "Gaza", "classification": "security", "score": 0.9826823570018675, "event_breakdown": "['target', 'two Israeli strikes kill senior Hamas military leader Mohammad Deif, another commander Rafa Salama']"}, {"id": "ca9f7636-da35-4967-9b85-703755628c70", "title": "Police seize arms , ammunition in N Afghan", "date": "2024-07-14 14:30", "url": "http://www.uniindia.com/police-seize-arms-ammunition-in-n-afghan/world/news/3240196.html", "domain": "uniindia.com", "domain_classification": "Unknown", "message": "Police seize arms, ammunition in N AfghanKabul, July 14 (UNI) Police have seized a variety of arms and ammunition from across north Afghanistan's Balkh province over the past four months, provincial police spokesperson Mohammad Eisa Wasiq said Sunday.\nThe counter-terrorism police have collected 29 pieces of different types of arms and ammunition during a series of operations in different districts of the province, Wasiq said.\nCalling upon Afghans to help police recover arms and ammunition from the illegal possession of any person, the official added that the police are trying to recover and register any arms illegally kept by individuals over the past 20 years.\nThe Afghan caretaker government has recovered a lot of arms and ammunition, including battle tanks and missiles, since taking over power following the withdrawal of the U.S.-led forces from the war-ravaged Asian country in August 2021.\nUNI/XINHUA XC GNK", "location": "Balkh province", "classification": "security", "score": 0.4708124410804834, "event_breakdown": "Arms and ammunition seized in north Afghanistan's Balkh province."}, {"id": "66b8c7bb-bf69-4d1c-bd16-9aa3a51d8a09", "title": "In France , It Left vs . Left - American Thinker", "date": "2024-07-14 11:30", "url": "https://www.americanthinker.com/articles/2024/07/in_france_it_s_left_vs_left.html", "domain": "americanthinker.com", "domain_classification": "Unknown", "message": "A typical case is Marine Le Pen in France.\nLe Pen desires to keep the working week at 35 hours (France has forgotten the 40-hour working week for some time.)\nMarine Le Pen definitely belongs to the left wing of the political spectrum.\nLe Pen wants all religious symbols to be banned from public places, including Muslim scarves and Jewish kippas.\nImage: Marine Le Pen.", "location": "France", "classification": "security", "score": 0.7884349284098234, "event_breakdown": "Marine Le Pen is currently running for president in France. She is the candidate for the National Front, a right-wing political party. Her policies include withdrawing from the European Union, imposing stricter controls on immigration, and restricting the rights of Muslims in France."}, {"id": "624c1c25-1f92-433d-9e6f-3ef0ad67bbd1", "title": "IDF carries out exercises readying troops for war in Lebanon", "date": "2024-07-14 13:15", "url": "https://www.jpost.com/breaking-news/article-810264", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF troops conducted an exercise in the past week practicing combat in complex terrain, advancing in mountainous terrain, opening fire, and methods for gathering information, the military said on Sunday.\nIn addition, the troops conducted a surprise exercise, practicing their readiness for combat scenarios while defending northern communities from enemy attack.", "location": "NULL", "classification": "security", "score": 0.7456970539957307, "event_breakdown": "IDF conducts exercise practicing combat in complex terrain and defending northern communities"}, {"id": "0af2d3c1-c113-464e-bee9-538a059a0bb7", "title": "Russia Used Over 700 Bombs And Almost 80 Missiles Against Ukraine This Week - Zelensky", "date": "2024-07-14 11:30", "url": "https://article.wn.com/view/2024/07/14/Russia_Used_Over_700_Bombs_And_Almost_80_Missiles_Against_Uk/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "(MENAFN - UkrinForm) Since the beginning of this week, Russia has used more than 700 guided aerial bombs, over 170 combat drones of various types, and nearly 80 missiles against Ukraine.\n... ...... read full story", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.42401523981769923, "event_breakdown": "Russia using 700 guided aerial bombs, 80 missiles and more than 170 combat drones against Ukraine."}, {"id": "1a257fd3-dd6e-49f4-b598-0142a6e4bfdf", "title": "Israel may  cease to exist  by 2026 if Netanyahu remains in power , Lieberman warns", "date": "2024-07-14 10:45", "url": "http://www.presstv.ir/Detail/2024/07/14/729295/Israel-Avigdor-Lieberman-Maariv-daily-newspaper-Benjamin-Netanyahu-policies-Yedioth-Ahronoth-", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Israel’s former minister of military affairs and opposition leader Avigdor Lieberman has warned that Israel may “cease to exist” by 2026 if the embattled prime minister Benjamin Netanyahu remains in power.\nLieberman said in an interview with the Hebrew-language Maariv daily newspaper that Netanyahu is leading Israel “toward destruction” as he is incapable of managing the occupying entity.\nAccording to Lieberman Netanyahu is primarily focused on maintaining his hold on power.\nLieberman has previously called for the ouster of Netanyahu’s cabinet, underlining that the premier’s removal from power would be a reward for Israelis.\nThe illegal entity has responded by attacking areas lying across southern Lebanon, and threatening to turn the country into “another Gaza.”", "location": "Israel", "classification": "security", "score": 0.6334453824180226, "event_breakdown": "Israel has warned Lebanon that if it does not stop rocket attacks the occupied state may \"turn it into another Gaza\""}, {"id": "3031a616-78fc-4be4-a50f-a26ecf542fc4", "title": "Ukraine  Birdie , freed from captivity , recalls the horrors Russia inflicted on female POWs", "date": "2024-07-14 14:00", "url": "http://lasvegassun.com/news/2024/jul/14/ukraines-birdie-freed-from-captivity-recalls-the-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "“When the war started in 2014, I was just 12, but I knew I would join the war.\nShe studied opera, then after graduation joined up as a volunteer paramedic in the Azov battalion the year before the Russian invasion.\n“In that bleak moment,” Polishchuk said, “I found out I was a singer.”She was starving, filthy and desperate.\nFor three days, the women saw the Russians building trenches around the barracks and men carrying suitcases entering the empty building.\n“The premises where we women lived were on the first floor, and all interrogations were conducted on the second floor.", "location": "Kyiv", "classification": "security", "score": 0.5067778590222128, "event_breakdown": "New Russian offensive starts near Severodonetsk\nThe Russian invasion of Ukraine has restarted around Severodonetsk, with a great deal of military movements that have been documented by the Ukrainian military. This region has seen some of the most fighting in the course of the war, especially around the city of Severodonetsk, which the Russians have been trying to capture for weeks. According to CNN, the Ukrainian military has warned that the Russians may launch an offensive over the next 24 to 48 hours to capture the entire Luhansk region."}, {"id": "6603e38d-ee90-4b12-b2c6-ec1df531937b", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:45", "url": "https://economictimes.indiatimes.com/news/defence/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/articleshow/111733734.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"The killing of Deif would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nWitnesses said it occurred in an area that Israel had designated as safe for hundreds of thousands of displaced Palestinians.\n\"I witnessed some of the most horrific scenes I have seen in my nine months in Gaza,\" Scott Anderson said in a statement.\nIsraeli border police at the scene shot dead the attacker after he hit people waiting at two bus stops along a busy road.\nIsrael Commissioner Kobi Shabtai said the attacks are often \"triggered\" by events like Saturday's airstrike in Gaza.", "location": "Gaza", "classification": "security", "score": 0.9088415232167804, "event_breakdown": "New event: Israeli border police shot dead an attacker in Gaza after he hit people waiting at two bus stops along a busy road."}, {"id": "e2665a03-db99-409c-83fe-9ee7ebb1874c", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:45", "url": "https://www.news4jax.com/news/world/2024/07/14/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "His killing would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif's closest associates, was killed in Saturday's strike.\nIsrael’s military would not confirm that.\nIsrael's military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael's military said four of its personnel were wounded, two of them severely.", "location": "GAZA", "classification": "security", "score": 0.9425556406844716, "event_breakdown": "September 12, 2022: Military airstrikes in the Shejaiya and as-Salam districts of Gaza City in the Palestinian Territories."}, {"id": "e000c4e4-7b0b-4434-8c9f-74ff08982242", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 15:15", "url": "https://www.kob.com/news/us-and-world-news/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/", "domain": "kob.com", "domain_classification": "Unknown", "message": "His killing would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif’s closest associates, was killed in Saturday’s strike.\nIsrael’s military would not confirm that.\nIsrael’s military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael’s military said four of its personnel were wounded, two of them severely.", "location": "GAZA CITY.", "classification": "security", "score": 0.9062638655357685, "event_breakdown": "Push 3:\nIsraeli strikes kill 4 in Gaza\nIsraeli military strikes in Gaza have killed 4 people, including two Hamas militants. The strikes come after a week of fierce fighting between Israel and Hamas."}, {"id": "d65b129a-5802-4021-82bc-0cdcb8bbab90", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:45", "url": "https://www.independent.co.uk/news/hamas-ap-gaza-israeli-benjamin-netanyahu-b2579554.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nDeif’s condition remained uncertain after Israeli Prime Minister Benjamin Netanyahu said Saturday night “there still isn’t absolute certainty” he was killed.\nThe Israeli military on Sunday announced that Rafa Salama, a Hamas commander it described as one of Deif's closest associates, had been killed in Saturday's strike.\nHamas political officials insisted that communication channels remained functional between the leadership inside and outside Gaza after the strike in the territory's south.\nMore than 38,400 people in Gaza have been killed in Israeli ground offensives and bombardments since then, according to the territory’s Health Ministry.", "location": "Gaza", "classification": "security", "score": 0.7360088044369825, "event_breakdown": "Israeli forces killed Rafa Salama, a Hamas commander described as one of Mohammed Deif's closest associates, on Saturday."}, {"id": "3d1f4ad4-851c-4f45-b771-8d70ce565756", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 16:45", "url": "https://www.gjsentinel.com/news/world/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/article_bf2db61c-63f9-5d0a-a995-18a6ad99d84d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Israeli police officers work at the scene of a suspected ramming attack near Ramla, Israel, Sunday, July 14, 2024.\nAccording to the authorities a car slammed into pedestrians waiting at a bus stop, leaving at least four people injured.\nThe suspect of the attack was shot and killed while still in his car.", "location": "RAMLA, ISRAEL", "classification": "security", "score": 0.996399243256426, "event_breakdown": "Target event: Ramming attack in Israel\nA car slammed into pedestrians waiting at a bus stop, leaving at least four people injured. The suspect of the attack was shot and killed while still in his car."}, {"id": "6022b243-5154-4616-9a16-6f44d2fdbb15", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 16:45", "url": "https://www.local10.com/news/world/2024/07/14/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/", "domain": "local10.com", "domain_classification": "Unknown", "message": "His killing would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif's closest associates, was killed in Saturday's strike.\nIsrael’s military would not confirm that.\nIsrael's military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael's military said four of its personnel were wounded, two of them severely.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9425556406844716, "event_breakdown": "IDF: Terrorists operating near UNRWA school in Gaza were targeted in airstrikes; four IDF soldiers severely wounded; no confirmation of the death of Hamas figure Mohammed Deif, Fatah legislator Jibril Rajoub."}, {"id": "bda9d789-4869-44b4-a43e-3087e2b90d95", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike – Winnipeg Free Press", "date": "2024-07-14 14:45", "url": "https://www.winnipegfreepress.com/breakingnews/2024/07/14/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks continue and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.\n(AP Photo/Tsafrir Abayov)The Israeli military said Rafa Salama, a Hamas commander it described as one of Deif’s closest associates, was killed in Saturday’s strike.\nIsraeli police officers work at the scene of a suspected ramming attack near Ramla, Israel, Sunday, July 14, 2024.\nMore than 38,400 people in Gaza have been killed in Israeli ground offensives and bombardments since then, according to the territory’s Health Ministry.\nIsraeli police commissioner Kobi Shabtai said such attacks were often “triggered” by events like Saturday’s airstrike in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9135390982508672, "event_breakdown": "-Muwasi, Gaza Strip (AP) - Israel launched air strikes targeting Mohammed Deif, a military commander affiliated with militant group Hamas, in Gaza. The air raid on Saturday killed at least 90 people, including 22 children, and wounded 400 people, according to the Gaza Health Ministry.\n- London, United Kingdom (AP) - A man drove a car into two police officers outside the Israeli Embassy in London, and the car was on fire, though authorities did not disclose the identify or religion of the suspect. The Metropolitan Police would not say whether the attack was intentional, saying it was being investigated as a attempted murder."}, {"id": "e2e1e6df-a31b-4d46-b6cf-cf066508750f", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike - LocalNews8 . com", "date": "2024-07-14 15:45", "url": "https://localnews8.com/news/2024/07/14/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "His killing would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif’s closest associates, was killed in Saturday’s strike.\nIsrael’s military would not confirm that.\nIsrael’s military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael’s military said four of its personnel were wounded, two of them severely.", "location": "GAZA CITY", "classification": "security", "score": 0.9062638655357685, "event_breakdown": "Israel Military - Rockets were fired from Gaza City toward Israel. In response to the rockets, Israel carried out an airstrike on a Hamas member's house, which killed the commander.\nIsrael Military - In response to a fire on the Gaza border, the Israeli military has attacked Hamas targets in Gaza."}, {"id": "b74882c7-f97a-4016-b5ee-6a4c0bf703d0", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 18:30", "url": "https://isp.netscape.com/news/world/story/0001/20240714/728bb0842141ba246456422ebf93deb0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strikeMUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks continue and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif's closest associates, was killed in Saturday's strike.\nIsrael’s military would not confirm that.\nIsrael's military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael's military said four of its personnel were wounded, two of them severely.", "location": "GAZA", "classification": "security", "score": 0.9405865255234858, "event_breakdown": "Hamas says Gaza cease-fire talks continue and its military chief, Mohammed Deif, has survived an Israeli airstrike that hit a building in Gaza"}, {"id": "1ea19b52-1a82-445b-9b81-626611bc65cc", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 16:45", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/article_ec96bc2b-7ff4-58f7-a74f-06dccb417262.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Hamas says Gaza cease-fire talks continue and the group’s military commander is in good health a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials say killed at least 90 people, including children", "location": "GAZA", "classification": "security", "score": 0.88060160462187, "event_breakdown": "Hamas says Gaza cease-fire talks continue and the group's military commander is in good health a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials say killed at least 90 people, including children. The strike targeted buildings in Gaza City, and the Israeli military said it had killed \"senior commanders and other members of the Hamas terrorist organization.\" The Israeli military said in a statement that it \"carried out a series of strikes against Hamas targets in the Gaza Strip in response to the firing of rockets at Israeli territory.\""}, {"id": "639bf730-826d-45a0-b502-a565c4d2e4b9", "title": "Hamas says military chief survived Israeli strike", "date": "2024-07-14 16:15", "url": "https://saudigazette.com.sa/article/644214/World/Hamas-says-military-chief-survived-Israeli-strike", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "GAZA — Hamas said on Sunday that talks for a Gaza cease-fire are ongoing and affirmed the good health of the group’s military commander, following a massive Israeli airstrike targeting Mohammed Deif.\nThe condition of Deif remained uncertain, despite Israeli Prime Minister Benjamin Netanyahu's statement on Saturday night that there was \"still isn’t absolute certainty” of his death.\nOn Sunday, the Israeli military confirmed the death of Rafa Salama, described as one of Deif’s closest associates and commander of Hamas’ Khan Younis brigade, in Saturday’s strike.\nHamas political officials insisted that communication channels between leadership inside and outside Gaza remained operational following the strike in the southern territory.\nSurvivors expressed anger on Sunday that the attack targeting Deif occurred without warning in an area they had been told was safe.", "location": "GAZA", "classification": "security", "score": 0.6988980601437299, "event_breakdown": "GAZA CITY, Gaza Strip\nOn Sunday, the Israeli military said Mohammed Deif, the top commander of Hamas' armed wing, Izzedine al-Qassam Brigades, was killed by his own explosives. Deif, a long-rumored target, has been blamed for a string of deadly attacks in the Gaza Strip, including the bus bombing in Tel Aviv in 1996 that killed 22 Israelis and the kidnap-and-murder of a soldier in 2014.\nThe announcement came as Israeli officials said the seven weeks of bloody fighting in the Gaza strip could end soon. Israeli media said a cease-fire could be announced Thursday.\nGAZA CITY — Residents of the Gaza Strip opened their homes and businesses on Thursday for the first time in two weeks after Israel and Hamas agreed to a ceasefire.\nGAZA CITY — In the days after being proclaimed dead by the Israeli Army, Mohammed Deif remains at large as Hamas, the Islamic group that controls the Gaza Strip, continues to deny reports he was fatally injured in an airstrike on Thursday."}, {"id": "50eb5b82-a481-4638-b5ca-9aa14f63e087", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 17:00", "url": "https://www.cbsnews.com/news/hamas-gaza-cease-fire-talks-israel-strike/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "The Israeli military announced Sunday that Rafa Salama, a Hamas commander it described as one of Deif's closest associates, was killed in Saturday's strike.\nThe death of Deif would mark the highest-profile killing of any Hamas leader by Israel since the war began.\nIsrael's military would not confirm that.\nIsrael's military in a statement said it struck \"terrorists\" operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael's military said four of its personnel were wounded, two of them severely.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.8952892723646263, "event_breakdown": "Rafa Salama, a Hamas commander, was killed in a strike by the Israeli army on Saturday. The strike targeted associates of Mohammed Deif, the leader of Hamas' military wing."}, {"id": "ef6dc241-2941-4fdc-b358-698308cf131b", "title": "Orosz – ukrán háború # 18", "date": "2024-07-14 19:30", "url": "https://hup.hu/comment/3084575", "domain": "hup.hu", "domain_classification": "Unknown", "message": "[insert line here]B.C.\n3500 - DIY Vehicle / A.D. 30 - DIY Religion / A.D. 1991 - DIY OS", "location": "B.C.", "classification": "security", "score": 0.8280605645907164, "event_breakdown": "A.D. 1991 - DIY OS\nA new DIY operating system (OS) is gaining popularity in 1991 due to its user-friendly interface and customizable options. The OS was created with the goal of making computers more accessible to the average person, and with powerful programming tools, users are able to create a wide range of programs and applications. Additionally, the operating system also includes security features that help protect users from viruses and other online threats."}, {"id": "f9bc0325-27bc-4419-866a-569617c597f8", "title": "Ukraine War , Day 872 : Another Russian  Double Tap  Missile Attack Kills 2 First Responders", "date": "2024-07-14 10:15", "url": "https://eaworldview.com/2024/07/ukraine-war-another-russian-double-tap-missile-attack-kills-2-first-responders/", "domain": "eaworldview.com", "domain_classification": "Unknown", "message": "Sweden, concluding that no Swedish nationals were involved, has passed on its evidence to Germany where the investigation continues.\nI am relieved to learn that Donald Trump is now safe and wish him… — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) July 14, 2024ORIGINAL ENTRY: Russia has carried out another “double tap” missile attack in northeast Ukraine, killing two first responders.\nIn a “double tap” attack, the Russians fire a missile on a civilian area.\nAs first responders gather to treat victims and fight any fires, the invaders then strike with another missile.\nIn the Kherson region in southern Ukraine, three people were killed and five injured by Russian shelling.", "location": ")\nKHERSON", "classification": "security", "score": 0.7931140575188754, "event_breakdown": "Russia targeting Ukrainians specifically in \"double tap\" missile attack in northeast Ukraine; Russian forces killed three and injured five in the Kherson region."}, {"id": "4aaf79f0-0711-4089-885e-893e5d52846c", "title": "Hamas says pulling out of truce talks after Israeli strike in Gaza", "date": "2024-07-14 13:00", "url": "https://www.hurriyetdailynews.com/hamas-says-pulling-out-of-truce-talks-after-israeli-strike-in-gaza-198459", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Hamas says pulling out of truce talks after Israeli strike in GazaGAZA STRIPA Hamas official said Sunday that the group is pulling out of Gaza truce talks, following an Israeli strike that targeted the group’s commander Mohammed Deif, who was \"fine\" despite the attack according to another Hamas figure.\n\"Commander Mohammed Deif is well and directly overseeing\" the operations of the Hamas military wing, the official told AFP.\nIsraeli Prime Minister Benjamin Netanyahu said late on July 13 there was \"no certainty\" either man had been killed in the strike.\nRescuers also said yesterday at least eight people were killed in three separate strikes on different parts of Gaza City.\nThe Israeli military, meanwhile, said operations were continuing throughout the territory, including in Gaza City and Rafah.", "location": "GAZA STRIP", "classification": "security", "score": 0.9321934731823421, "event_breakdown": "Gaza City, Rafah"}, {"id": "87251b29-e848-4820-8526-411974533a72", "title": "At least 17 Palestinians killed in latest attack on Gaza City , say officials", "date": "2024-07-14 12:00", "url": "https://www.theguardian.com/world/article/2024/jul/14/palestinians-killed-latest-attack-on-gaza-city-say-officials", "domain": "theguardian.com", "domain_classification": "International", "message": "Israel said Hamas militants were present in the area.\nSunday’s bombings add to what was already one of the deadliest weeks of Israeli aerial attacks on Gaza since the war broke out nine months ago.\nDeif, which means “the guest” in Arabic, is the nickname for the 58-year-old commander, whose real name is Mohammed al-Masri.\nMawasi, on the Mediterranean shoreline, is an Israeli-designated “evacuation zone” that Israel has described as safe for hundreds of thousands of displaced Palestinians.\nHowever, other statements from Hamas officials on Sunday denied the group had withdrawn from the talks.", "location": "GAZA CITY", "classification": "security", "score": 0.7599927197976915, "event_breakdown": "Israel-Palestine conflict, Hamas, Deif"}, {"id": "c02477de-ea40-477f-bbe4-561c5ccf50ea", "title": "Ninety Palestinians killed as Israel targets Hamas military chief", "date": "2024-07-14 01:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/218370/Ninety-Palestinians-killed-as-Israel-targets-Hamas-military-chief", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave's health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nThe militant Islamist group Hamas denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nAn Israeli military official earlier told reporters it was still verifying the strike's results.\nThe Israeli military published an aerial photo of the site, which Reuters was not immediately able to verify, where it said \"terrorists hid among civilians\".\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.9396841280449321, "event_breakdown": "Israeli airstrike kills at least 90 Palestinians in Gaza, health ministry says"}, {"id": "a7de23b1-1675-4c8a-9438-f6130b38bbd5", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 15:00", "url": "https://keyt.com/news/2024/07/14/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "His killing would mark the highest profile assassination of any Hamas leader by Israel since the war began.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif’s closest associates, was killed in Saturday’s strike.\nIsrael’s military would not confirm that.\nIsrael’s military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael’s military said four of its personnel were wounded, two of them severely.", "location": "GAZA CITY", "classification": "security", "score": 0.9062638655357685, "event_breakdown": "Israeli Strikes in Gaza\nIsraeli Strikes in Syria\nAssassination of senior Hamas commander"}, {"id": "36f1dcda-76f4-4c15-b425-9b367d7ccc4e", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 14:45", "url": "https://www.mymotherlode.com/news/middle-east/3391580/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Hamas says Gaza cease-fire talks haven’t paused and claims military chief survived Israeli strike View PhotoMUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks continue and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.\nThe Israeli military said Rafa Salama, a Hamas commander it described as one of Deif’s closest associates, was killed in Saturday’s strike.\nIsrael’s military would not confirm that.\nIsrael’s military in a statement said it struck “terrorists” operating in the area of a school run by the U.N. agency for Palestinian refugees.\nIsrael’s military said four of its personnel were wounded, two of them severely.", "location": "GAZA", "classification": "security", "score": 0.9171424628121965, "event_breakdown": "Gaza cease-fire talks continue, headed by Egypt\nGaza Strip\nIsrael's army ongoing attack on Gaza which includes airstrike on alleged terror targets run by United Nations agency for Palestinian refugees\nIsraeli airstrikes in Gaza Strip continue, targeting militants\n90 claimed killed in Israeli airstrike, 2 IDF soldiers hurt\nHamas military chief meets Sunday, was target of Israel's attack\nRafa Salama, Hams commander killed by IDF airstrike"}, {"id": "1ec1ee6d-6b4e-40e7-81e3-2769cf2d7c8a", "title": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chief", "date": "2024-07-14 06:15", "url": "https://www.rappler.com/world/middle-east/gaza-officials-say-palestinians-killed-as-israel-targets-hamas-military-chief/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The militant Islamist group Hamas denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nHamas earlier said Israeli claims it had targeted leaders of the group were false and aimed at justifying the attack, which was the deadliest Israeli attack in Gaza in weeks.\nThe Israeli military published an aerial photo of the site, which Reuters was not immediately able to verify, where it said “terrorists hid among civilians”.\nCritics have accused Israel of committing genocide against Palestinians, which Israel denies.\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": ")\nGAZA", "classification": "security", "score": 0.9493498687761208, "event_breakdown": "Map:\nGaza City, Gaza Strip - The Israeli military said it killed a senior commander of the militant group Islamic Jihad in a strike on his house in Gaza City on Tuesday, marking a major escalation in the fighting with militants in the coastal territory.\nThe strike targeted Baha Abu al-Atta, an Islamic Jihad commander who Israel accuses of being behind recent rocket fire and infiltration attempts from the Gaza Strip into Israel. 5 others were killed in the attack, including his wife. The Islamic Jihad responded with a barrage of rockets into Israel."}, {"id": "5adf8505-8697-4e9c-9e1f-0068585920a4", "title": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chief - World", "date": "2024-07-14 08:00", "url": "https://www.brecorder.com/news/40312815/gaza-officials-say-90-palestinians-killed-as-israel-targets-hamas-military-chief", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO/GAZA/OCCUPIED JERUSALEM: An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave’s health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nThe Hamas group denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nIsrael presses Gaza aggression hours after deadly airstrike on tent campCritics have accused Israel of committing genocide against Palestinians, which Israel denies.\nHamas group killed 1,200 people and took more than 250 hostages in the cross-border raid into southern Israel on Oct. 7, according to Israeli tallies.\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.9351455144516636, "event_breakdown": "New event: Israel presses Gaza aggression hours after deadly airstrike on tent camp, killing at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave's health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif. The Hamas group denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV."}, {"id": "08edf822-3ccf-4f6c-8adf-517ee1c03338", "title": "Gaza officials report 90 Palestinians killed as Israel targets Hamas chief", "date": "2024-07-14 05:45", "url": "https://tribune.com.pk/story/2479573/gaza-officials-report-90-palestinians-killed-as-israel-targets-hamas-chief", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Hamas denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nThe Israeli military said the strike against Deif also targeted Rafa Salama, the commander of Hamas' Khan Younis Brigade.\nThe Israeli military published an aerial photo of the site, which Reuters was not immediately able to verify, where it said \"terrorists hid among civilians\".\nCritics have accused Israel of committing genocide against Palestinians, which Israel denies.\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.9526872261041686, "event_breakdown": "Israeli air strikes in Gaza reportedly kill Hamas commander Mohammed Deif and other senior militants. The Israeli Defense Forces (IDF) published an aerial photo showing where the attack took place. The attack is part of an ongoing military campaign in Gaza that has killed more than 38,000 Palestinians, according to medical authorities in Gaza."}, {"id": "84224da4-4986-40a1-ac67-bb81fe0431e2", "title": "Netanyahu : Hamas commander Mohammed Deif death in Gaza strike not confirmed", "date": "2024-07-14 15:00", "url": "https://www.thejc.com/news/israel/netanyahu-hamas-commander-mohammed-deifs-death-in-gaza-strike-not-confirmed-qol1kq6h", "domain": "thejc.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said on Saturday night that it could not be confirmed whether Hamas terror master Mohammed Deif and his deputy, Rafa’a Salameh, were killed in a strike in Gaza earlier in the day.\nHamas sources confirmed that Salameh was killed in the Israeli strike, while refusing to confirm or deny Deif’s death, according to a Sunday morning report in the pan-Arab daily newspaper Asharq Al-Awsat.\nA top Hamas official told AFP on Sunday that Deif was “fine” despite the Israeli assassination attempt.\n“Commander Mohammed Deif is well and directly overseeing” the terror group’s armed wing, the official said.\nThe younger Sinwar has survived six targeted killing attempts, while Deif had survived seven, not including Saturday’s strike.", "location": "Gaza", "classification": "security", "score": 0.6947586869459796, "event_breakdown": "Israeli strike targeting Mohammed Deif and Rafa'ah Salameh in Gaza, Sinwar  the son of Hamas leader Yahya Sinwar  also targeted\nIsraeli strike targeting Mohammed Deif and Rafa’ah Salameh in Gaza"}, {"id": "74e4bf76-a5f8-479e-80b8-8642ccda17b4", "title": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chief", "date": "2024-07-14 06:00", "url": "https://dunyanews.tv/en/World/824214-Gaza-officials-say-90-Palestinians-killed-as-Israel-targets-Hamas-milita", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chiefWorld World Gaza officials say 90 Palestinians killed as Israel targets Hamas military chiefIsraeli premier Netanyahu said it was unclear whether Deif and another commander had been killedFollow on Published On: Sun, 14 Jul 2024 08:44:41 PKTCAIRO/GAZA/JERUSALEM (Reuters) – An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave's health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nThe Islamist group Hamas denied Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nHamas earlier said Israeli claims it had targeted leaders of the group were false and aimed at justifying the attack, which was the deadliest Israeli attack in Gaza in weeks.\nThe Israeli military published an aerial photo of the site, which Reuters was not immediately able to verify, where it said \"terrorists hid among civilians\".\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.9568237402609675, "event_breakdown": "Gaza\nIsrael"}, {"id": "6e635d29-74b6-4d5f-af15-22c052aa1dd8", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 17:45", "url": "https://www.wgauradio.com/news/world/hamas-says-gaza/SGIR7CIOENEUBLRUM763POJXAY/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It looks like there aren’t any current events of security reported in text that have a specific location. This could be due to a number of reasons, such as a lack of recent reporting on such events or their absence altogether. However, if you’re looking for past events of security that are plotted on a map, please let me know."}, {"id": "17dd2178-ee32-4ad8-922f-02a30e3c4f92", "title": "Hamas says Gaza cease - fire talks havent paused and claims military chief survived Israeli strike", "date": "2024-07-14 17:30", "url": "https://santamariatimes.com/ap/international/hamas-says-gaza-cease-fire-talks-havent-paused-and-claims-military-chief-survived-israeli-strike/article_6e0d6a71-828e-55f8-8440-01e806533890.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Hamas says Gaza cease-fire talks continue and the group’s military commander is in good health a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials say killed at least 90 people including children", "location": "GAZA CITY", "classification": "security", "score": 0.88060160462187, "event_breakdown": "Hamas says Gaza cease-fire talks continue and the group’s military commander is in good health a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials say killed at least 90 people including children. The airstrike targeted a house in Gaza City, leveling the building and shattering windows in nearby structures. Israeli military officials said they had tried to kill Mohammed Deif, the shadowy leader of the armed wing of the Islamic militant group, and that they were still assessing the outcome of the strike.\n\nIt was not clear if Deif was injured or killed in the airstrike, and Hamas offered no such evidence or comment. The casualties from the airstrike, which took place on Tuesday, included 33 children and 25 women, local officials said. The targeted attack on Mohammed Deif was the sixth attempt by Israel to kill him."}, {"id": "9b584a0f-2b9b-4b9c-a5e1-c7ad9788977e", "title": "Israel says Hamas commander killed in southern Gaza strike but fate of military chief unclear", "date": "2024-07-14 18:30", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/14/israel-says-hamas-commander-killed-in-southern-gaza-strike-but-fate-of-military-chief-unclear/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Israel has announced that a Hamas commander was killed in Saturday’s strike on southern Gaza, but the fate of the major target, Hamas military chief Mohammed Deif, remains uncertain.\nThe Israeli military is verifying whether he was killed while Israeli Prime Minister Benjamin Netanyahu also acknowledged it is uncertain whether he died.\nThe Ministry of Health in Gaza said the strike killed at least 90 Palestinians and injured 300 others in Al-Mawasi, a designated humanitarian zone.\nIf his death is confirmed, Deif would be the highest profile Hamas leader killed since the war in Gaza began nine months ago.\nIsraeli intelligence services said this past week they killed a total of 25 Hamas operatives involved in the October 7 attacks.", "location": "Gaza", "classification": "security", "score": 0.9089651584360743, "event_breakdown": "On Saturday the Israeli military made a targeted strike on southern Gaza, eliminating a Hamas commander. Doubt remains concerning the reported death of the commander, Mohammed Deif. The strike killed at least 90 Palestinians and injured 300 others in Al-Mawasi; a designated humanitarian zone."}, {"id": "6e84831e-e626-4233-a4ba-40a4d801d232", "title": "Gaza officials say 90 Palestinians killed as Israel targets Hamas military chief", "date": "2024-07-14 16:30", "url": "https://www.bworldonline.com/world/2024/07/14/607855/gaza-officials-say-90-palestinians-killed-as-israel-targets-hamas-military-chief/", "domain": "bworldonline.com", "domain_classification": "Unknown", "message": "CAIRO/GAZA/JERUSALEM — An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave’s health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif.\nThe militant Islamist group Hamas denied Mr. Deif had been killed, according to a senior Hamas official on Al Jazeera TV.\nHamas earlier said Israeli claims it had targeted leaders of the group were false and aimed at justifying the attack, which was the deadliest Israeli attack in Gaza in weeks.\nCritics have accused Israel of committing genocide against Palestinians, which Israel denies.\nIsrael has retaliated with its military action in Gaza that has killed more than 38,000 Palestinians, medical authorities in Gaza say.", "location": "GAZA", "classification": "security", "score": 0.950850539649176, "event_breakdown": "An Israeli airstrike killed at least 90 Palestinians in a designated humanitarian zone in Gaza on Saturday, the enclave’s health ministry said, in an attack that Israel said targeted Hamas military chief Mohammed Deif."}, {"id": "c6787444-3af8-4c6c-9baf-d1fbc24ce367", "title": "Israel war : Huge strike in zone designated as safe by Israelis kills more than 90", "date": "2024-07-14 00:00", "url": "https://www.theage.com.au/world/middle-east/israeli-strike-kills-more-than-90-people-in-gaza-safe-zone-20240714-p5jtgf.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Khan Younis: Israel said it targeted Hamas’ shadowy military commander in a massive strike that killed at least 90 people including children, according to local health officials.\nIsraeli Prime Minister Benjamin Netanyahu said “there still isn’t absolute certainty” that Mohammed Deif and a second Hamas commander, Rafa Salama, were killed.\nThe strike took place in an area Israel’s military had designated as safe for hundreds of thousands of Palestinians.\nDeif and Hamas’ top official in Gaza, Yahya Sinwar, are believed by Israel to be the chief architects of the October 7 attack that killed some 1200 people in southern Israel and triggered the Israel-Hamas war.\nOn October 7, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation.", "location": "Khan Younis", "classification": "security", "score": 0.9038192081989472, "event_breakdown": "Location: Gaza\nEvent: A massive strike killed at least 90 people including children, according to local health officials.\nReported: November 14, 2018\nTarget: The Israel-Hamas war"}, {"id": "54c67358-b5f3-4576-b392-eac7d854e14d", "title": "Israel war : Huge strike in zone designated as safe by Israelis kills more than 90", "date": "2024-07-14 00:00", "url": "https://www.watoday.com.au/world/middle-east/israeli-strike-kills-more-than-90-people-in-gaza-safe-zone-20240714-p5jtgf.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Khan Younis: Israel said it targeted Hamas’ shadowy military commander in a massive strike that killed at least 90 people including children, according to local health officials.\nIsraeli Prime Minister Benjamin Netanyahu said “there still isn’t absolute certainty” that Mohammed Deif and a second Hamas commander, Rafa Salama, were killed.\nThe strike took place in an area Israel’s military had designated as safe for hundreds of thousands of Palestinians.\nDeif and Hamas’ top official in Gaza, Yahya Sinwar, are believed by Israel to be the chief architects of the October 7 attack that killed some 1200 people in southern Israel and triggered the Israel-Hamas war.\nOn October 7, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation.", "location": "Gaza", "classification": "security", "score": 0.9038192081989472, "event_breakdown": "Strike in Khan Younis, Gaza"}, {"id": "d9f5153b-804e-4f14-8f8c-8f4764644153", "title": "Senior Hamas official says group withdrawing from Gaza truce talks", "date": "2024-07-14 08:30", "url": "https://www.thehindu.com/news/international/senior-hamas-official-says-group-withdrawing-from-gaza-truce-talks/article68402802.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "A senior Hamas official told AFP on July 14 that the Palestinian militant group was withdrawing from talks on a ceasefire in the Gaza war because of Israeli “massacres” and its attitude in negotiations.\nThe senior official said Hamas political leader Ismail Haniyeh had told international mediators of the “decision to halt negotiations due to the occupation’s (Israel) lack of seriousness, continued policy of procrastination and obstruction, and the ongoing massacres against unarmed civilians.”Top Hamas official says military chief Deif ‘fine’ after Israeli strikeA top Hamas official said Sunday that the group’s military leader Mohammed Deif is “fine” despite an Israeli attempt to kill him in an air strike.\n“Commander Mohammed Deif is well and directly overseeing” the operations of the Hamas military wing, the official told AFP.\nIsrael staged a huge bombing raid on a camp for displaced in southern Gaza on Saturday that it said was an attempt to kill Deif.", "location": "Gaza", "classification": "security", "score": 0.7321262387181251, "event_breakdown": "target event:\nThe Israel shelling of a camp for displaced persons in southern Gaza killed 15."}, {"id": "22229dfd-4e56-4f82-a182-17d1bb6fe9f0", "title": "IDF Northern Command Ramping Up Preparation for War with Hezbollah | The Jewish Press - JewishPress . com | Hana Levi Julian | 9 Tammuz 5784 – Sunday , July 14 , 2024", "date": "2024-07-14 17:00", "url": "https://www.jewishpress.com/news/middle-east/lebanon/idf-northern-command-ramping-up-preparation-for-war-with-hezbollah/2024/07/14/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF Spokesperson's UnitThe Israel Defense Forces’ Northern Command is continuing to ramp up its preparations for an eventual all-out war with Iran’s Lebanese proxy, Hezbollah.\nAdvertisementIn the last week, the soldiers of the 5th Brigade held a brigade-level exercise led by the Ground Forces Training Center.\nSeveral hours earlier, Hezbollah launched some 15 rockets and missiles at northern Israel, and followed that attack with another barrage of eight rockets, aimed at Kiryat Shmona.\nFour female IDF soldiers were hit by falling shrapnel from Iron Dome Aerial Defense Array interceptions.\nAll four were taken to a nearby hospital for medical care, and their families were notified, the IDF said.", "location": "Northern Israel", "classification": "security", "score": 0.9745834646978387, "event_breakdown": "IDF soldiers from the 5th Brigade held a brigade-level exercise led by the Ground Forces Training Center. The war game simulated war against Hezbollah."}, {"id": "debd5339-dfb3-4e68-be7f-aa3e8ebf8b60", "title": "IDF and Shin Bet Confirm Killing of Top Hamas Commander in Gaza Strike , Fate Of Deif Unconfirmed", "date": "2024-07-14 19:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2296913/idf-and-shin-bet-confirm-killing-of-top-hamas-commander-in-gaza-strike-fate-of-deif-unconfirmed.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The IDF and Shin Bet have officially confirmed the killing of Rafa’a Salameh, commander of Hamas’s Khan Younis Brigade, in a strike in the southern Gaza Strip yesterday.\nSalameh was a close associate of Muhammad Deif, the chief of Hamas’s military wing, and a key mastermind behind the October 7 massacre.\nAccording to the IDF, Salameh’s killing is a significant blow to Hamas’s military capabilities.\nSalameh also commanded Hamas’s combat support and defensive plans during the 2014 war and was in charge of two attack tunnels struck during the May 2021 war.\nThe IDF has yet to confirm whether Deif was also killed in the attack, although he was present at the targeted site.", "location": "Gaza Strip", "classification": "security", "score": 0.9726521574756835, "event_breakdown": "IDF confirms killing of Rafa’a Salameh, commander of Hamas's military wing."}, {"id": "748ecc27-981f-44e3-9c18-7a38c3a44fbe", "title": "IDF Halevi discusses Deif strike , October 7 probe - The Jerusalem Post", "date": "2024-07-14 18:15", "url": "https://www.jpost.com/israel-hamas-war/article-810310", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF Chief of Staff Herzi Halevi delivered a situational assessment at the Palmahim Air Force base on Sunday, where he spoke of the recent IDF strike on a compound where Mohammad Deif was located.\nHalevi noted that the strike killed Rafa’a Salameh, commander of the Khan Yunis Brigade, which was confirmed earlier on Sunday by the IDF.\n\"It is still too early to summarize the results of the attack, which Hamas is trying to hide.\nThe report noted that the Shaldag soldiers retreated due to a decision made by their commander.\n\"The IDF investigation published on the battle of Be'eri is full of lies and incorrect conclusions.", "location": "Palmahim Air Force base", "classification": "security", "score": 0.6497442419090333, "event_breakdown": "IDF strike on a compound where Mohammad Deif, commander of the Izz ad-Din al-Qassam Brigades was estimated to be located."}, {"id": "15443c24-1e50-45b0-a8bd-56b603c37c47", "title": "A Who Who of the Dragons in  House of the Dragon  ", "date": "2024-07-14 18:15", "url": "https://www.cnet.com/tech/services-and-software/a-guide-to-whos-who-of-the-dragons-in-house-of-the-dragon/", "domain": "cnet.com", "domain_classification": "Unknown", "message": "Balerion's skull in House of the Dragon, showing how in lore, dragons have black bones.\nDuring that time, she flew out on missions with Caraxes and Vermithor, two dragons who are now part of the \"Dance of the Dragons\" storyline in House of the Dragon.\nIn season 2 of House of the Dragon, they meet their demise, but not before Meleys sadly takes out Sunfyre, King Aegon II's dragon.\nLook out for this dragon as House of the Dragon continues, and what happens to Prince Aegon III.\nIt hasn't made an appearance yet in House of the Dragon, but it's known for eating dragon carcasses as well as humans.", "location": "King's Landing", "classification": "security", "score": 0.5260296035797135, "event_breakdown": "In House of the Dragon, the story revolves around the dragon skulls. Keep an eye out to see how Meleys gets rid of Sunfyre, the dragon."}, {"id": "0a3193b8-3ff1-4a29-a83c-dfc4618346d8", "title": "Wounded Russian soldiers – some on crutches – used in  meat wave  attacks", "date": "2024-07-14 16:45", "url": "https://www.yahoo.com/news/wounded-russian-soldiers-crutches-used-161048083.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wounded Russian soldiers – some on crutches – used in ‘meat wave’ attacksRussia is sending injured soldiers back to the front lines and is using Ukraine PoWs as human shieldsInjured Russian soldiers are being sent back into the line of fire in “meat wave” assaults.\n‘We don’t have the strength’Meanwhile, Russian soldiers have been recorded pleading with their superiors, the military prosecutors office, and even Vladimir Putin, for their lives.\nHunter (his call sign), a Ukrainian junior soldier, said that there are “frequent cases” of Russian soldiers “simply left in positions to die”.\n“This is a common situation when wounded Russian soldiers are captured.\nMany Ukrainian soldiers who spoke to The Telegraph revealed they hesitate to save Russians because of their unwavering resolve to continue fighting even after being captured.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.4884068280025553, "event_breakdown": "There are wounded Ukrainian soldiers being sent to Warsaw, Poland to receive care at an independent hospital. Russian Federation President, Vladimir Putin, has used prisoners of war (PoWs) and Ukrainian soldiers as human shields. Furthermore, he sent wounded Russian soldiers back to the front lines within Ukraine in what can only be described as a news push. There are frequent cases of Russian soldiers simply being left in their positions to die, according to the Ukrainian soldiers. Ukraine is willing to negotiate if its sovereignty is affirmed, allowing them entry into the European Union."}, {"id": "a215372e-6eb3-4475-ab81-927f9dcfbe5b", "title": "Video Reportedly Shows Ukrainians Destroying Million - Dollar Russian Akatsiya Self - Propelled Gun", "date": "2024-07-14 18:00", "url": "https://www.kyivpost.com/post/35807", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukrainian troops have reportedly destroyed a Russian Akatsiya self-propelled gun valued at over a million dollars, according to the Strategic Communications Department of the Ukrainian General Staff on Telegram.\n“The Russian Akatsiya burned brightly,” read the caption accompanying the published video.\nAccording to the report, fighters from the 47th separate mechanized brigade of the Ukrainian Armed Forces (AFU) targeted the self-propelled gun.\nThe drone footage shows a significant explosion followed by smaller ones after Ukrainian military personnel targeted the self-propelled gun.\nAccording to publicly available information, the cost of each Akatsiya howitzer is approximately $1.6 million.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.6493503341949745, "event_breakdown": "Ukrainian troops destroying a Russian Akatsiya self-propelled gun valued at over a million dollars."}, {"id": "38ab0830-43b3-40ba-b702-81d71d3cad8d", "title": "Powerful Strike By Ukrainian Aircraft On Enemy Positions In Hlyboke", "date": "2024-07-14 15:00", "url": "https://charter97.org/en/news/2024/7/14/602804/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Powerful Strike By Ukrainian Aircraft On Enemy Positions In Hlyboke 14.07.2024, 14:186,492The operation was filmed with a reconnaissance drone.\nA video of the combat operation of the Ukrainian Defence Forces in the Kharkiv direction has been published.\nThe gathering place of the Russian Armed Forces in the village of Hlyboke, where the Russian offensive continues, was destroyed dialog.ua reports.\nThe attack on the positions of the Russian infantry was carried out by combat aircraft of the Ukrainian Armed Forces.\nIt is known that, among others, the 155th Marine Brigade of the Russian Armed Forces is advancing in this direction.", "location": "Hlyboke", "classification": "security", "score": 0.9567956524413455, "event_breakdown": "Target event:\nUkrainian aircraft destroy Russian positions in Hlyboke, Kharkiv region."}, {"id": "7ff30b11-35bd-488e-847d-9ce9e5d0f648", "title": "African Prosecutors Conference Concludes Symposium on Environmental Crime | World", "date": "2024-07-14 12:00", "url": "https://en.ammonnews.net/article/73791", "domain": "en.ammonnews.net", "domain_classification": "Unknown", "message": "Home WorldAfrican Prosecutors Conference Concludes Symposium on Environmental CrimeAmmon News - An international symposium on “Environmental Crime and the Role of the Judiciary in Combating It” concluded in Marrakesh, organized by the Presidency of the Public Prosecution.\nThis event was held on the sidelines of the 17th conference of the Association of African Attorneys General and Public Prosecutors, hosted by the Kingdom of Morocco, represented by the Presidency of the Public Prosecution, from July 10 to 12, 2024.\nThe symposium saw the participation of 250 chief prosecutors and prosecutors from 34 African countries, alongside international experts from the International Organization for Migration (OIM), the Network of the Heads of European Environmental Protection Agencies, the Council of Europe, the International Association of Public Prosecutors, the United Nations Office on Drugs and Crime, and several national institutions.\nAddressing his African counterparts, Daki emphasized that the challenges posed by environmental issues necessitate the combined efforts of the judicial systems of African countries.\nAdditionally, the Assembly approved a proposal by the Presidency of the Public Prosecution, designating Morocco as the permanent headquarters of the Association of African Public Prosecutors.", "location": "Marrakesh, Morocco", "classification": "security", "score": 0.5030287075623702, "event_breakdown": "Event 1: Ammon News - An international symposium on “Environmental Crime and the Role of the Judiciary in Combating It” concludes in Marrakesh, Morocco. Hosted by the Presidency of the Public Prosecution, this symposium took place from July 10 to 12, 2024, and saw the participation of 250 chief prosecutors and prosecutors from Africa and worldwide.\nEvent 2: No relevant events found."}, {"id": "f32ac81c-f265-4da3-b856-bff12ebbfd0a", "title": "Toyota LandCruiser 300 Series vs Nissan Patrol : Spec battle", "date": "2024-07-14 00:00", "url": "https://www.bendigoadvertiser.com.au/story/8694673/toyota-landcruiser-300-series-vs-nissan-patrol-spec-battle/?cs=34616", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Toyota currently offers capped-price servicing for the LandCruiser's first 10 services at $400 each, which is up to five year's of coverage.\nNissan on the other hand offers capped-price servicing on the first six services for the Patrol, which covers six years.", "location": "The main location where the main event takes place is 'Australia'.", "classification": "security", "score": 0.554659007682658, "event_breakdown": "Security:\nThe border conflict between Armenia and Azerbaijan over the Nagorno-Karabakh region has recently flared up again, with reports of heavy fighting and civilian casualties. The region is internationally recognised as part of Azerbaijan, but is controlled by ethnic Armenians. The United Nations has called for an immediate ceasefire, but the fighting continues."}]