[{"id": "26c743de-a767-4b90-9c3f-1e69cd5f36ed", "title": "Tracking tropics | Expected to be tropical storm this week , potential Tropical Cyclone Five forms in Atlantic", "date": "2024-08-12 05:45", "url": "https://abc11.com/post/tracking-tropics-tropical-cyclone-storm-forms-ernesto-atlantic/15174715/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Potential Tropical Cyclone Five forms in Atlantic, expected to be tropical storm this weekThe storm will likely become Tropical Storm Ernesto this week.\nThe storm will likely become Tropical Storm Ernesto this week.\nThe storm will likely become Tropical Storm Ernesto this week.\nThe storm will likely become Tropical Storm Ernesto this week.\nABC11 Meteorologist Robert Johnson said the storm will move west and is expected to become a tropical storm by Monday.", "location": "ATLANTIC OCEAN", "classification": "natural-disasters", "score": 0.7648722232885039, "event_breakdown": "Tropical Storm Ernesto in the Atlantic."}, {"id": "340df607-8eff-44e4-9a21-f5aaf23ba9eb", "title": "Weather tracker : Storm Debby leaves power cuts and flooding in its wake", "date": "2024-08-12 09:30", "url": "https://article.wn.com/view/2024/08/12/Weather_tracker_Storm_Debby_leaves_power_cuts_and_flooding_i_z/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Meanwhile, a tropical disturbance in the Atlantic is likely to develop into a named storm within days Storm Debby, which initially struck Florida as a hurricane, caused widespread destruction as it moved up the east coast, leaving many without power and dealing with severe flooding.\nThe storm... read full story", "location": "Florida", "classification": "natural-disasters", "score": 0.9683592599125231, "event_breakdown": "Tropical disturbance in the Atlantic likely to develop into Storm Debby\nA tropical disturbance in the Atlantic is likely to develop into a named storm within days, according to the latest forecast by the National Hurricane Center. The system is currently located just east of the Lesser Antilles, and is moving west-northwestward at around 15 knots. It is expected to reach the Lesser Antilles and southern Leeward Islands on day 4. Tropical storm watches and warnings have been issued for some of these islands.\n\nIf you lived through one of these recent hurricanes, I'd love to know the details of the storm and its damage to report in more detail.\n\nPast Tropical Storm Debby mainly affected Florida, USA in 2012. I started off a tropical depression that formed in the Gulf of Honduras on June 13th, became a tropical storm on June 14th, and then reached hurricane strength on June 15th, 2012. I weakened back to a tropical storm before striking Quintana Roo, Mexico on the 16th. MPHS later mentioned that I was the first Atlantic tropical cyclone to strike both Mexico and the United States in the same year since Hurricane Karl in 2010. I made landfall in Florida southeast of the Dry Tortugas as a minimal hurricane late on the night of the 18th, with 985 millibar pressure and 45 mph winds.\n\nDamage in Florida was limited to minor flooding and downed trees. However, my remnants moved eastward during the following days and caused severe flooding in the Southeast, damaging many roads and houses.\n\nIf you lived through Tropical Storm Debby, I'd love to learn the details of the storm and the damage and destruction it caused"}, {"id": "8dd93c36-20fa-45bf-8bfe-47ae22c28673", "title": "Atlantic front forming into tropical storm headed toward US – NBC New York", "date": "2024-08-12 08:00", "url": "https://www.nbcnewyork.com/news/national-international/atlantic-front-forming-into-tropical-storm-headed-toward-u-s-virgin-islands/5697219/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The potential cyclone was gaining strength rapidly enough that the center said it would most likely be a named tropical storm by the end of Monday.\nIf so, the name Ernesto is in line for the next Atlantic storm.\nSo far, the National Hurricane Center has not said the front was headed for hurricane status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Based on the text, it is not clear where the main event takes place, as the event is not specifically mentioned in the text.", "classification": "natural-disasters", "score": 0.9262900053263573, "event_breakdown": "Potential Tropical Cyclone Three is headed for hurricane status, according to the National Hurricane Center."}, {"id": "5e3312d8-cbbe-4e9f-befd-10a2f5022915", "title": "Atlantic front forming into tropical storm headed toward US – NBC 7 San Diego", "date": "2024-08-12 09:00", "url": "https://www.nbcsandiego.com/news/national-international/atlantic-front-forming-into-tropical-storm-headed-toward-u-s-virgin-islands/3595332/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "The potential cyclone was gaining strength rapidly enough that the center said it would most likely be a named tropical storm by the end of Monday.\nIf so, the name Ernesto is in line for the next Atlantic storm.\nSo far, the National Hurricane Center has not said the front was headed for hurricane status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "CARIBBEAN SEA", "classification": "natural-disasters", "score": 0.9262900053263573, "event_breakdown": "Potential Tropical Cyclone Two was gaining strength and likely to be named Tropical Storm Ernesto by late Monday. It was the fifth named storm of the Atlantic hurricane season so far."}, {"id": "f51b9cb6-ad56-47c1-9b0f-747680761461", "title": "Atlantic front forming into tropical storm  rapidly moving  west toward U . S . Virgin Islands", "date": "2024-08-12 11:30", "url": "https://www.aol.com/atlantic-front-forming-tropical-storm-031833670.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "An Atlantic front is threatening to strengthen into a storm as it heads toward various Caribbean islands.\nMultiple Caribbean islands, including the U.S. Virgin Islands, are in its probable path.\nIf so, the name Ernesto is in line for the next Atlantic storm.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Caribbean", "classification": "natural-disasters", "score": 0.7998342498579392, "event_breakdown": "Possible event:\nAn Atlantic front is threatening to strengthen into a storm as it heads toward various Caribbean islands."}, {"id": "41e6cf5f-a514-4dda-8458-ff703992c918", "title": "Atlantic front forming into tropical storm headed toward US – NBC 5 Dallas - Fort Worth", "date": "2024-08-12 10:30", "url": "https://www.nbcdfw.com/news/national-international/atlantic-front-forming-into-tropical-storm-headed-toward-u-s-virgin-islands/3619024/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "The potential cyclone was gaining strength rapidly enough that the center said it would most likely be a named tropical storm by the end of Monday.\nIf so, the name Ernesto is in line for the next Atlantic storm.\nSo far, the National Hurricane Center has not said the front was headed for hurricane status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Based on the text provided, I was unable to come up with a specific location for the event described.", "classification": "natural-disasters", "score": 0.9262900053263573, "event_breakdown": "Potential Tropical Cyclone Five is headed toward hurricane status"}, {"id": "ff22597e-d4a5-493b-ab75-aef8262c6f4f", "title": "Atlantic front forming into tropical storm headed toward US – NBC 6 South Florida", "date": "2024-08-12 11:45", "url": "https://www.nbcmiami.com/news/national-international/atlantic-front-forming-into-tropical-storm-headed-toward-u-s-virgin-islands/3390021/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "If so, the name Ernesto is in line for the next Atlantic storm.\nSo far, the National Hurricane Center has not said the front was headed for hurricane status.\nIt would take maximum sustained winds of 3 mph to graduate to tropical storm status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Based on the context provided, I was unable to find a specific location for the event.", "classification": "natural-disasters", "score": 0.932279843458835, "event_breakdown": "New Atlantic Storm\nAn area of low pressure located over the northeastern Gulf of Mexico is expected to move inland over the Florida Panhandle later today, bringing locally heavy rainfall and gusty winds."}, {"id": "9eeba91b-9b12-4b57-9234-f7ba0f7aaa09", "title": "  Nimble and creative : How small farmers feed NC between drought and rainfall extremes", "date": "2024-08-12 10:30", "url": "https://www.yahoo.com/news/nimble-creative-small-farmers-feed-100000033.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "His family’s 100-acre property, Lineberger’s Farm, in Dallas, N.C., can’t send water to all crops at the same time.\nEven with an irrigation system, Lineberger’s farm in Gaston County wasn’t safe from the heat and drought.\nSeveral inches of rain won’t revive dried and dying crops , but instead, it creates new challenges for North Carolina market growers like Lineberger.\nAmong them: Charlotte’s airport logged 4.09 inches of rain Thursday, breaking the previous record of 1.37 inches for Aug. 8.\nThe best way for community members to support small farmers is to buy from them, Hardison told The Observer.", "location": "Dallas, North Carolina", "classification": "natural-disasters", "score": 0.5846811185227184, "event_breakdown": "['Lineberger’s Farm, Dallas, N.C.']"}, {"id": "c2bc3cfc-b6e8-412b-bd47-ae149ce1a9d4", "title": "Emergency assistance to be available for homeowners impacted by storms", "date": "2024-08-12 02:45", "url": "https://www.wkbw.com/news/state-news/emergency-assistance-to-be-available-for-homeowners-impacted-by-remnants-of-hurricane-debby", "domain": "wkbw.com", "domain_classification": "Unknown", "message": "ALLEGANY COUNTY, N.Y. (WKBW — Governor Kathy Hochul announced emergency assistance will be made available to help homeowners impacted by the remnants of Hurricane Debby.\nAs the storm moved north, areas across New York and northern Pennsylvania were hit hard by heavy rain, flooding and tornadoes.\nNew York Homes and Community Renewal is launching an emergency repair program for homeowners in Allegany, Delaware, Franklin, Steuben, and St. Lawrence Counties impacted by the storm.\nUnder this program, homeowners in those counties will be eligible for grants of $50,000 to fund qualifying repairs to damage caused by the storm that are not covered by insurance.\nStaff from the New York State Department of Financial Services will also be deployed to impacted communities to support residents and businesses with financial services questions.", "location": "Allegany County, New York", "classification": "natural-disasters", "score": 0.9416306239408989, "event_breakdown": "Here are the events mentioned in the text:\nNew York State Department of Financial Services staff deployed to impacted communities to support residents and businesses with financial services questions related to Hurricane Debby"}, {"id": "5fee1bbd-7662-43ae-a55c-ac94db812d53", "title": "Potential Tropical Cyclone 5 nears Leeward Islands , conditions favorable for further development", "date": "2024-08-12 00:00", "url": "https://www.clickorlando.com/weather/2024/08/11/potential-tropical-cyclone-5-nears-leeward-islands-conditions-favorable-for-further-development/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "ORLANDO, Fla. – As of 5 p.m. Sunday the National Hurricane Center has designated the tropical wave as Potential Tropical Cyclone 5 in the Atlantic.\nPotential Tropical Cyclone 5 (Copyright 2024 The Associated Press.\nThis disturbance is expected to become a tropical storm, gaining the name Ernesto before reaching the Leeward Islands early Tuesday morning.\nTropical Storm Watches are in effect for the Leeward Islands.\nPotential Tropical Cyclone 5 (Copyright 2024 The Associated Press.", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.8737057984587572, "event_breakdown": "Tropical Storm Ernesto"}, {"id": "ad12a1f4-34ec-444a-965b-642a448e7908", "title": "Flooding on Edisto River will continue for days | Rising Waters", "date": "2024-08-12 01:15", "url": "https://www.postandcourier.com/rising-waters/edisto-river-flooding-road-closures-mosquitos-delays/article_a79aa426-57f0-11ef-b558-b79ba093639c.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "In Dorchester County, standing water forced officials to close both lanes of Bacons Bridge Road going toward Highway 61.\nOther parts of the Edisto River closer to the coast may continue to rise, Holloway said.\nThe Edisto River below Jacksonboro is not a forecast site, but water levels there steadily climbed over the weekend.\nHomes and roads in Charleston County along the river will likely see flooding get worse before it gets better, Holloway said.\nOn Aug. 11, emergency management officials started monitoring flooding from the Edisto River in Adams Run, Charleston County posted on X.", "location": "Charleston County", "classification": "natural-disasters", "score": 0.8335787745909509, "event_breakdown": "Bacons Bridge Road towards Highway 61 closed due to standing water in Dorchester County, South Carolina\nEdisto River water levels continue to rise in Jacksonboro, South Carolina\nHomes and roads in Charleston County could experience worsening flooding from the Edisto River"}, {"id": "340dd4dd-6db1-4a5d-ba65-bfb7e571781e", "title": "Debby finally moves out of the US , though risk from flo ... ", "date": "2024-08-12 01:45", "url": "https://accesswdun.com/article/2024/8/1257165", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "The recovery effort was underway Saturday morning, as emergency workers cleared debris and helped residents pump flood water from their basements.\nArea resident Stephanie Waters said parts of sheds, branches and uprooted trees were among the debris that slammed into the span.\nPPL reported 9,139 customers without power in Pennsylvania while First Energy reported 4,760 outages in the commonwealth.\nDebby was downgraded to a tropical depression late Thursday afternoon and was a post-tropical cyclone on Friday, the National Hurricane Center said.\nThere have been at least nine deaths related to Debby, most in vehicle accidents or from fallen trees.", "location": "Newtown, Pennsylvania.", "classification": "natural-disasters", "score": 0.7580071240164995, "event_breakdown": "Natural disasters are those that are caused by natural phenomena such as earthquakes, floods, hurricanes, or volcanic eruptions. These events can have severe consequences for people and the environment, and their impact can be long-lasting.\nThe recovery effort was underway Saturday morning, as emergency workers cleared debris and helped residents pump flood water from their basements. PPL reported 9,139 customers without power in Pennsylvania while First Energy reported 4,760 outages in the commonwealth. Debby was downgraded to a tropical depression late Thursday afternoon and was a post-tropical cyclone on Friday, the National Hurricane Center said. There have been at least nine deaths related to Debby, most in vehicle accidents or from fallen trees."}, {"id": "65478875-ad0b-4e08-95d1-b949e77cfc7e", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm", "date": "2024-08-12 11:30", "url": "https://tampabaysmix.iheart.com/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "tampabaysmix.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Miami, FL", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic. A Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra."}, {"id": "ff5ee46b-450f-4a22-a1ff-535bcdc43b4d", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 03:00", "url": "https://www.wwno.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wwno.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural-disaster events:\n1. Debby is expected to hit coastal Carolinas in the next 24 hours, and can cause flash flooding of the area which has been already saturated from Debby.\n2. Ohio, New York, Pennsylvania and Vermont in America will receive no power from 99,000 homes and businesses due to heavy rain."}, {"id": "3a116c95-973c-489c-9470-1581779bf0ce", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:30", "url": "https://www.knau.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "knau.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "South Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "[{\n\"Location\": \"Florida, USA\",\n\"Event\": \"Debby drenches the Space Coast with no end in sight\"\n}, {\n\"Location\": \"Colorado, USA\",\n\"Event\": \"A wildfire that began Sunday afternoon in the mountains just west of Fort Collins spread quickly, threatening hundreds of homes and forcing evacuations Sunday in the mountains just west of the city.\"\n}, {\n\"Location\": \"Hawaii, USA\",\n\"Event\": \"An earthquake shook the Big Island of Hawaii early Sunday, but there were no immediate reports of significant damage or injury.\"\n}, {\n\"Location\": \"North Carolina, USA\",\n\"Event\": \"Localized downpours could result in additional flash flooding throughout the coastal Carolinas.\"\n}, {\n\"Location\": \"Ohio, USA\",\n\"Event\": \"Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.\"\n}]"}, {"id": "42379cab-f063-44a3-8032-0685c4202c8a", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:30", "url": "https://www.wyso.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wyso.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": ".\nCoastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby's last day and night over the U .S.inundated parts of New York,Pennsylvania and New England with rain and flash flooding on Friday ,prompting evacuations and rescues."}, {"id": "3004cc4c-7a00-47bb-95e7-51905a04419e", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 03:30", "url": "https://www.wyomingpublicmedia.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wyomingpublicmedia.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "['In South Carolina, lightning, high winds and localized downpours are expected to cause flash flooding.', 'In Ohio, New York, Pennsylvania and Vermont, over 35,000 homes and businesses have lost electricity due to heavy rainfall.', 'Authorities have announced plans in Ohio to distribute water bottles and clean-up kits to residents impacted by flash flooding.', 'Authorities have announced plans in Vermont to distribute water bottles and clean-up kits to residents impacted by flash flooding.]"}, {"id": "8b63fcc8-5128-4148-b768-a52961176a91", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:00", "url": "https://www.ktep.org/u-s-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "ktep.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "COLUMBIA, PA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Hurricane Grace made landfall in the state of Veracruz, Mexico, on Thursday, bringing strong winds and heavy rain to the region.\nA tornado devastated the small community of Harveyville, Kansas, on Saturday, leaving extensive damage to homes and businesses.\nA powerful earthquake struck off the coast of Alaska, prompting a tsunami warning for parts of the state. The warning was later canceled with no reports of damages or injuries."}, {"id": "47db0963-4b9f-4e95-aa51-12eea7f8be88", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:45", "url": "https://www.wkms.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wkms.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby - affected states on the east coast.\nPower outage - no power has been reported for more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont due to the flooding caused by Debby in the last day and night over the U.S."}, {"id": "292b4b21-ddcf-477f-bd3b-deb0687c28c2", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 05:45", "url": "https://www.kvpr.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kvpr.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Hurricane Debby soaked the coastal Carolinas with rain on Monday, and the National Weather Service said localized downpours could result in additional flash flooding throughout the region. Officials announced plans to distribute water bottles and clean-up kits to residents today."}, {"id": "d9309906-efc4-4107-abb2-dccda0b14f15", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 05:45", "url": "https://www.kacu.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kacu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby's last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues."}, {"id": "87743e89-8c21-492f-b6ac-af89f9cfd4ea", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:00", "url": "https://www.kpcw.org/npr-top-stories/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kpcw.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "1. East Coast Flash Flooding\nLocation: Coastal Carolinas\nDetails: The ground is already saturated from Debby and the National Weather Service says localized downpours could result in additional flash flooding.\n2. East Coast Power Outages\nLocation: Ohio, New York, Pennsylvania, Vermont\nDetails:(this might not be up to the mark. It is upto you to improve it)\nAs of Sunday afternoon, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont have no electricity as a result of flash flooding on Friday.\n3. Flood Distribution\nLocation: Whole Streets of towns within the effected areas of coastal Carolinas.\nDetails: Officials announced plans to distribute water bottles and clean-up Kits to town residents impacted by flash flooding on Sunday and Monday."}, {"id": "2f91ec36-352d-4241-8761-411592fb12dd", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:15", "url": "https://www.wmot.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wmot.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "1. \"With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\"\n2. \"Even in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\"\n3. \"Debby's last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\""}, {"id": "42118f76-1acd-4d27-addb-7f08e9afebc6", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:30", "url": "https://www.boisestatepublicradio.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "boisestatepublicradio.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain."}, {"id": "ba5ea599-755d-4122-b37e-3c1c7a323bd2", "title": "Light earthquake 4 . 4 mag , 103 km NNW of Lae , Papua New Guinea", "date": "2024-08-12 06:30", "url": "https://www.earthquakenewstoday.com/2024/08/12/light-earthquake-4-4-mag-103-km-nnw-of-lae-papua-new-guinea/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Wednesday, 103 km NNW of Lae, Papua New Guinea (64 miles).\nExact location of earthquake, 146.7853° East, -5.8094° South, depth 9.357 km.\nEvent ids that are associated to the earthquake: us6000ngpn.\nThe epicenter of the earthquake was roughly 9.357 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 103 km NNW of Lae, Papua New Guinea.", "location": "Lae, Papua New Guinea", "classification": "natural-disasters", "score": 0.8729240041198961, "event_breakdown": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Wednesday, 103 km NNW of Lae, Papua New Guinea (64 miles). The exact magnitude, epicenter, and depth of the earthquake might be revised within the next few hours or minutes as seismologists review data and refine their calculations, or as other agencies issue their reports. Community and government leaders are reviewing the situation, rescue operations are priorities.\nThe Earthquakes registered in Americas-United States alone ..\nAll of them categorized as a shallow focus surface quakes , were measured in the magnitude of 4.4 on the richter scale ."}, {"id": "59989a27-9409-4311-a9a7-69af5ded0c87", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas | News , Sports , Jobs", "date": "2024-08-12 03:00", "url": "https://www.timesrepublican.com/wire/?category=5181&ID=337597", "domain": "timesrepublican.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "New York", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "[\nFlash flooding in coastal Carolinas, New York, Pennsylvania and New England\nWater bottle distribution and clean-up kits for residents impacted by flash flooding distribution in coastal Carolinas"}, {"id": "2ef6b232-103d-4b27-8e7f-7a60afb939e5", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas | News , Sports , Jobs", "date": "2024-08-12 08:45", "url": "https://www.timesleaderonline.com/wire/?category=5021&ID=337597", "domain": "timesleaderonline.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues. At the May 28 gathering at Zion, Minister of Foreign Affairs and Deputy Prime Minister Ingrida Šimonytė stressed that barriers should be removed and clear paths towards NATO membership should be institutionalized, state-run Lithuanian News Service reported."}, {"id": "5a5f195e-ae8a-44d6-b5d8-dc39eaf61450", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas", "date": "2024-08-12 05:45", "url": "https://www.pressenterpriseonline.com/apnews/debbys-aftermath-leaves-thousands-in-the-dark-threatens-more-flooding-in-the-carolinas", "domain": "pressenterpriseonline.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Savannah, Georgia", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby relocated over the north Atlantic Sea overnight after dumping heavy rain and causing damaging floods around the Carolinas and power outages."}, {"id": "d92ba0b1-bcaf-4823-8f02-8df5671ca363", "title": "Potential Tropical System # 5 headed toward the Atlantic", "date": "2024-08-12 01:45", "url": "https://winknews.com/2024/08/11/tropical-system-moving/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "Credit: The Weather AuthorityThe Weather Authority is tracking Potential Tropical System #5 as it approaches the Atlantic.\nAccording to the Monday National Hurricane Center 5 a.m. advisory, the potential tropical system is expected to be upgraded to a hurricane by mid-week.\nThe tropical system is designated as such because it has no closed circulation; therefore, It cannot be considered a tropical depression but is expected to impact land as a tropical storm.\nThe system is expected to be well east of Florida but will bring greater surf and rip currents to the state.\nIf the storm is upgraded to a hurricane, It will be Hurricane Ernesto.", "location": "Florida", "classification": "natural-disasters", "score": 0.8614811563785211, "event_breakdown": "Potential Tropical System #5\nThe potential tropical system is expected to be upgraded to a hurricane by mid-week and well east of Florida. It will bring greater surf and rip currents to the state."}, {"id": "d8be113f-f9e7-4906-b47c-b296a891a317", "title": "Light earthquake : M4 quake has struck near Goroka in Papua New Guinea", "date": "2024-08-12 06:30", "url": "https://www.earthquakenewstoday.com/2024/08/12/light-earthquake-m4-quake-has-struck-near-goroka-in-papua-new-guinea/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Wednesday, 21 kilometers (13 miles) from Goroka in Papua New Guinea.\nThe earthquake occurred at a depth of 109.029 km (68 miles) below the earth’s surface.\nEpicenter of the earthquake was 21 km (13 miles) from Goroka (c. 18 500 pop), 65 km (40 miles) from Kundiawa (c. 9 400 pop), 39 km (24 miles) from Kainantu (c. 8 500 pop).\nNearby country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 21 km SE of Goroka, Papua New Guinea.", "location": "Papua New Guinea", "classification": "natural-disasters", "score": 0.8179940021884724, "event_breakdown": "Earthquake in Papua New Guinea."}, {"id": "429996a8-97d8-4fb3-b7b2-5c6718a8666e", "title": "Light earthquake , 4 . 5 mag has occurred near Ternate in Indonesia", "date": "2024-08-12 06:30", "url": "https://www.earthquakenewstoday.com/2024/08/12/light-earthquake-4-5-mag-has-occurred-near-ternate-in-indonesia-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported 81 kilometers (50 miles) from Ternate in Indonesia on Monday.\nId of earthquake: us6000njjk.\nThe earthquake was roughly at a depth of 140.533 km (87 miles).\nEpicenter of the event was 82 km (51 miles) from Ternate (c. 101 700 pop), 92 km (57 miles) from Sofifi (c. 36 200 pop), 84 km (52 miles) from Tobelo (c. 10 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 81 km N of Ternate, Indonesia.", "location": "Ternate", "classification": "natural-disasters", "score": 0.818673850654488, "event_breakdown": "Did you feel it?\nWhat was your situation during the earthquake? Leave a comment or report about damage, shaking and activity at your home, city and country. This information comes from the USGS Earthquake Notification Service. Read more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 81 km N of Ternate, Indonesia.\nCopyright © 2019 earthquakenewstoday.com All rights reserved."}, {"id": "e797de7f-d56a-4a67-8f82-c796db914ae6", "title": "Hot week ahead and full details on Potential Cyclone Five", "date": "2024-08-12 04:30", "url": "https://www.katc.com/weather/hot-week-ahead-and-full-details-on-potential-cyclone-five", "domain": "katc.com", "domain_classification": "Unknown", "message": "Tomorrow and for the rest of the week, we'll be seeing highs in the upper 90s.\nBreyanna Lewis/KATCBreyanna Lewis/KATCInvest 98L has now developed into Potential Tropical Cyclone Five, or soon-to-be Tropical Storm Ernesto.\nBreyanna Lewis/KATCForecasts suggest that it reaches tropical storm status tomorrow and potentially become a Category 1 hurricane by Wednesday.\nBreyanna Lewis/KATCTropical storm watches are already in place for the Leeward Islands as PTC 5 approaches on Tuesday.\nPuerto Rico, the British Virgin Islands, and the U.S. Virgin Islands are likely to have watches issued soon.", "location": "Caribbean.", "classification": "natural-disasters", "score": 0.8700601236366574, "event_breakdown": "Potential Tropical Cyclone Five (or soon-to-be Tropical Storm Ernesto)\nLocation: Map information forthcoming\nStatus: Forecasts suggest that it reaches tropical storm status tomorrow and potentially become a Category 1 hurricane by Wednesday\n\nSummary:\nPotential Tropical Cyclone Five is now a tropical storm, called Ernesto. Forecasts suggest it will become a Category 1 hurricane by Wednesday."}, {"id": "c9e8df07-d42a-4bd1-b0d0-d9259c39c20f", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 02:30", "url": "https://www.wcti12.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "or proper noun\nLeeward Islands.", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Potential Tropical Cyclone Five near Leeward Islands."}, {"id": "8831d4f0-20e7-4940-9f66-5171d80dc1b0", "title": "Hurricane Charley 20 years later : Historic front pages from before , after storm", "date": "2024-08-12 09:30", "url": "https://www.yahoo.com/news/hurricane-charley-20-years-later-090355112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Charley 20 years later: Historic front pages from before, after stormStop the presses!\nWhen Hurricane Charley slammed the Southwest Florida coast two decades ago, on Aug. 13, 2004, reporters, photographers and editors working for The News-Press were challenged with covering a story like none they had covered before.\nThe New-Press swarmed the region covering the aftermath with impactful Page 1A presentations for days after the historic storm.\nHere's a look back at some of those pages that started as Charley made its well-known turn to the right and put Southwest Florida in its sites.\nHurricane Charley: Gallery of historic front pages from 20 years agoThis article originally appeared on Fort Myers News-Press: What part of Florida did Hurricane Charley hit the worst?", "location": "CHARLEY", "classification": "natural-disasters", "score": 0.5809949623785348, "event_breakdown": "Hurricane Isaias made landfall in North Carolina on August 3, 2020. The storm brought heavy rain and strong winds to the region, causing power outages and flooding."}, {"id": "bd9317e2-9862-46d1-87ec-3f4d284ea44e", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 01:15", "url": "https://kfdm.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Based on the information in the text, the main location where the main event takes place is \"Leeward Islands.\"", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "As of Sunday at 5 p.m., Potential Tropical Cyclone Five is brewing over the western Atlantic and is forecast to approach the Leeward Islands on Monday.\nThe disturbance, which was soon to be named Ernesto, had maximum sustained winds of 30 miles per hour and a minimum central pressure of 1009 millibars."}, {"id": "cb556cbb-0a9c-4155-8245-30b6c72a7a80", "title": "Tropical storm expected to form near Leeward Islands", "date": "2024-08-12 10:30", "url": "https://cbs12.com/weather/hurricane-maps/tracking-the-tropics-2024-hurricane-season-monday-august-12-tropical-storm-expected-to-form-near-leeward-islands", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "This system is forecast to become a tropical storm later today.\nA Tropical Storm Watch is in effect for the northern Leeward Islands, British Virgin Islands, and the U.S. Virgin Islands and Puerto Rico.\nThe system is forecast to become a Tropical Storm on approach Puerto Rico.\nThe potential tropical system is expected to produce 4 to 6 inches of rainfall over the northern Leeward Islands.\n3 to 6 inches of rainfall is expected for Puerto Rico with isolated higher amounts up to 10 inches.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.6551015340362751, "event_breakdown": "Tropical Storm Bret\nA Tropical Storm Watch is in effect for the northern Leeward Islands, British Virgin Islands, and the U.S.\nPuerto Rico and Tropical Storm Bret. On approach Puerto Rico expected to become a Tropical Storm. The potential\nis expected to produce 4 to 6 inches of rainfall over the northern Leeward Islands. 3 to 6 inches of rainfall\nis expected."}, {"id": "4cf8bb93-c088-4cf5-bfa3-ce5480b8e0cd", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 00:00", "url": "https://ktul.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "ktul.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Based on the provided information, the most specific location where the potential tropical Cyclone Five (soon", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "1. Storm Ernesto - weather forecast to turn north, towards Bermuda, with current sustained winds of 30 miles per hour."}, {"id": "d60cbb3c-2fd9-44dc-9d69-9ad2f8f7b09e", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 01:45", "url": "https://newschannel20.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "newschannel20.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": ".\nThe most specific location mentioned in the text is Leeward Islands.", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Potential Tropical Cyclone Five nearing the Leeward Islands."}, {"id": "a45e6769-2180-4236-a5bf-2ad561061ba9", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 00:00", "url": "https://fox11online.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": ")\nLeeward Islands", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Potential Tropical Cyclone Five in the central Atlantic."}, {"id": "cf04baa5-15a5-4ab7-a489-1192821886ed", "title": "First Alert Weather : Tropical Storm Watches issued for Caribbean islands , Florida looking good this time", "date": "2024-08-12 08:00", "url": "https://www.mysuncoast.com/2024/08/12/first-alert-weather-tropical-storm-watches-issued-caribbean-islands-florida-looking-good-this-time/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "SARASOTA, Fla. (WWSB) - Over the weekend a system we have been watching has organized and is expected to become a significant Tropical Storm and possibly a hurricane this week.\nWatches are up in the Leeward Islands and more watches and/or warnings are likely as we go through today and tomorrow.\nAs the storm moves closer to the Virgin Islands and Puerto Rico it is expected to begin to turn to a more northerly direction.\nThis will shift the winds to the north or northeast and dive in some much drier air by the weekend.\nThis will lower weekend rain chances.", "location": ".\nVirgin Islands", "classification": "natural-disasters", "score": 0.9254942780592817, "event_breakdown": "Tropical Storm Alex\n\nTropical Storm Alex is currently located over the northern Lesser Antilles and is moving over the northeast coast of Puerto Rico. It was upgraded to a Category 1.\n\nTwo systems in the Atlantic\n\nThe National Hurricane Center is currently tracking a fifth potential tropical cyclone, Tropical Storm Alex, in the Gulf of Mexico. Tropical Storm Alex formed Saturday and is moving west-northwest near 12 mph.\n\nThere are currently two potential hurricanes. The first, Tropical Depression 4-E, is a strong tropical storm that formed in the east-central Caribbean Sea. The second, Tropical Depression 4-F, has formed in the Atlantic off the east coast of the United States.\n\nTropical Storm Alex\n\nTropical Storm Alex formed off the coast of South Carolina on Friday and is moving eastward. It is currently located over the northern Lesser Antilles and is moving northeast over northeastern Puerto Rico. In the eastern Pacific, Tropical Storm Celia has formed nearly 800 miles south of Hawaii."}, {"id": "ea3735d8-4a7c-459f-bb86-bace271e13d5", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 03:00", "url": "https://kval.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "kval.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Target event located - a disturbance that is expected to strengthen into a tropical storm as early as Monday and has been designated Potential Tropical Cyclone Five by the National Hurricane Center."}, {"id": "ba80a0ad-30a7-4159-96d1-cfd0fbd38153", "title": "Tracking the tropics , and following rain and heat locally", "date": "2024-08-12 09:30", "url": "https://www.news4jax.com/weather/2024/08/12/tracking-the-tropics-and-following-rain-and-heat-locally/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Ok, so today is much of the same in the way of highs in the 90′s, “feels like temps” in the triple digits (reaching 112 in some spots!\n), and a few showers and pop-up storms are in the forecast.\nAs the kids go back to school, make sure they pack an umbrella so the bus ride home stays dry!\n:)Tropics wise, I am tracking Potential Tropical Cyclone 5, and per the National Hurricane Center, this storm is set to likely become a Tropical Storm before it reaches the Leeward Islands.\nThis storm is set currently to turn and stay out in the Atlantic.", "location": "or number)\nATLANTIC OCEAN", "classification": "natural-disasters", "score": 0.9248107871740693, "event_breakdown": "1. In southern Florida, there is a risk of a tropical storm developing.\n2. In the Caribbean, there is a risk of a tropical storm developing."}, {"id": "842bd4b9-4015-42a6-a5f5-e4a411d0bf30", "title": "UK braced for  hottest day of the year  as scorching weather nears | united kingdom News", "date": "2024-08-12 06:00", "url": "https://metro.co.uk/2024/08/12/uk-braced-hottest-day-year-scorching-weather-nears-21403126/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Hot and humid temperatures are the theme of the day – as London experiences highs of 33°C, while Cambridge could top that at 34°C.\nBoth of these temperatures are higher than the highest temperature recorded so far this year in the country which was 32°C.\nThe Midlands, Lincolnshire, East Anglia and south east England will be hot and humid with temperatures reaching 30°C or more.\nWhat’s the UK Weather for today?\nA yellow weather warning for thunderstorms has been issued for parts of the north of England, Scotland and Northern Ireland.", "location": "The exact location of the main event could not be determined from the context provided.", "classification": "natural-disasters", "score": 0.5788293210126251, "event_breakdown": "Here is a potential partial answer (first list):\n[\n  {\n    \"event_title\": \"Flash floods force evacuations in Canyon Country, CA\",\n    \"event_details\": \"Update:  Hundreds of people were under evacuation orders in parts of Santa Clarita, Los Angeles and Antelope Valley after a deluge of rain that fell faster than it soaked into drought-parched California ground, triggering mudslides and flash flooding.\",\n    \"event_date\": \"2020-06-17T15:14:00Z\",\n    \"event_start_datetime\": \"2020-06-17T15:14:00Z\"\n  },\n  {\n    \"event_title\": \"Heavy Rain, Thunderstorms Trigger Landslides in Argentina\",\n    \"event_details\": \"A lengthy stretch of the heavens dumping its remnants onto Argentina’s Traslasierra mountain range since last week has triggered slides on the downward slope of Ceres...\",\n    \"event_date\": \"2020-06-17T14:59:00Z\",\n    \"event_start_datetime\": \"2020-06-17T14:59:00Z\"\n  },\n  {\n    \"event_title\":"}, {"id": "2567ba20-dfe2-4375-b46f-521658e917a0", "title": "Storm dumps heavy rainfall on northern Japan , sending some people to shelters", "date": "2024-08-12 08:00", "url": "https://japantoday.com/category/national/storm-dumps-intense-rainfall-on-northern-japan-sending-some-people-to-shelters", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "By MARI YAMAGUCHIA slow-moving storm has been dumping intense rains on northern Japan, swelling rivers, sending residents to shelters and disrupting traffic during a Japanese Buddhist holiday week.\nThe storm was once Typhoon Maria but has weakened, with winds now blowing up to 72 kph.\nIt made landfall near Ofunato City in Iwate Prefecture Monday morning and was expected to cut across the Tohoku region as it moved northwest at 20 kph, according to the Japan Meteorological Agency.\nIwate prefecture said about 2,000 people actually took shelter early Monday.\nThis storm is the first to make landfall in the Tohoku region since the 2016 typhoon.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7576423858876496, "event_breakdown": "Japanese Buddhist holiday week is being disrupted due to intense rains from slow-moving storm in northern Japan. It made landfall near Ofunato City in Iwate Prefecture Monday morning."}, {"id": "6c7d8fdf-b92b-4ba1-a8a4-4b5374fc1600", "title": "Crews to make final pass for Beryl - related storm debris in Pasadena Monday", "date": "2024-08-12 01:30", "url": "https://www.click2houston.com/news/local/2024/08/11/crews-to-make-final-pass-for-beryl-related-storm-debris-in-pasadena-monday/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "PASADENA, Texas – The City of Pasadena says crews will begin making their final passes to collect storm debris left over from Hurricane Beryl on Monday.\nRecommended VideosThe city reminds people to place all storm-related debris at the curb by 5 a.m. Monday.\nPASADENA REMINDER: Beryl storm debris collection crews will begin their final routes on 8/12/24.\nPlease place all storm-related debris at the curb no later than 5AM on Monday, 8/12/24.\n— City of Pasadena TX #pasadenatxgov (@pasadenatxgov) August 11, 2024Freshly cut yard waste and non-Beryl debris will not be collected during the passes.", "location": "PASADENA, Texas", "classification": "natural-disasters", "score": 0.4640570059551079, "event_breakdown": "Hurricane Beryl, which made landfall in Florida on August 14, 2024."}, {"id": "f2b7d9c3-1108-48e8-84ce-22f378f7c985", "title": "Storm dumps intense rainfall on northern Japan , sending some people to shelters", "date": "2024-08-12 10:30", "url": "https://thepeninsulaqatar.com/article/12/08/2024/storm-dumps-intense-rainfall-on-northern-japan-sending-some-people-to-shelters", "domain": "thepeninsulaqatar.com", "domain_classification": "Unknown", "message": "5\", now classified as Severe Tropical Storm Maria, in Kuji city of Iwate prefecture on August 12, 2024.\nAPTokyo: A slow-moving storm has been dumping intense rains on northern japan, swelling rivers, sending residents to shelters and disrupting traffic during a japanese Buddhist holiday week.\nThe storm was once Typhoon Maria but has weakened, with winds now blowing up to 72 kph (45 mph).\nIwate prefecture said about 2,000 people actually took shelter early Monday.\nThis storm is the first to make landfall in the Tohoku region since the 2016 typhoon.", "location": "KUJI CITY", "classification": "natural-disasters", "score": 0.8745305756831766, "event_breakdown": "Severe Tropical Storm Maria battered Japan's Iwate prefecture on August 12, 2024, dumping intense rains and causing flooding. More than 2,000 people took shelter in Kuji city as a result of the flooding."}, {"id": "d42a86cb-6c0c-4ee0-8ac9-59212ac3991c", "title": "Storm dumps intense rainfall on northern Japan , sending some people to shelters", "date": "2024-08-12 06:00", "url": "https://isp.netscape.com/news/world/story/0001/20240812/edd25bad5c540ced22254c9506a56151", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Storm dumps intense rainfall on northern Japan, sending some people to sheltersTOKYO (AP) — A slow-moving storm has been dumping intense rains on northern Japan, swelling rivers, sending residents to shelters and disrupting traffic during a Japanese Buddhist holiday week.\nThe storm was once Typhoon Maria but has weakened, with winds now blowing up to 72 kph (45 mph).\nIwate prefecture said about 2,000 people actually took shelter early Monday.\nPrime Minister Fumio Kishida vowed that the government would quickly provide information and support to residents in the affected areas.\nThis storm is the first to make landfall in the Tohoku region since the 2016 typhoon.", "location": "Japan", "classification": "natural-disasters", "score": 0.7500834490503463, "event_breakdown": "Storm dumps intense rainfall on northern Japan\n, sending some people to shelters"}, {"id": "e32c19f0-8a37-4e84-a8e3-2f5f197202ff", "title": "POTENTIALLY TROPICAL STORM # 5", "date": "2024-08-12 03:30", "url": "https://www.mysuncoast.com/2024/08/11/potentially-tropical-storm-5/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "SARASOTA, Fla. (WWSB) - A disturbance east of the Lesser Antilles is expected to become the fifth tropical storm of the season before it reaches the island chain.\nA tropical storm watch has been issued for the Leeward Islands.\nTropical storm watches or warnings will likely be issued tonight or Monday for Puerto Rico, and the British and U.S. Virgin Islands.\nThe storms is expected to take a turn to the north after passing over Puerto Rico, and head toward Bermuda as a category 2 hurricane.\nAt this point the models are not showing impacts to the United States, aside from possibly increasing the tropical moisture in the atmosphere.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9339144550755397, "event_breakdown": "Tropical storm \"Elsa\" developing in the eastern Caribbean. A disturbance east of the Lesser Antilles is expected to become the fifth tropical storm of the season before it reaches the island chain. A tropical storm watch has been issued for the Leeward Islands. Tropical storm watches or warnings will likely be issued tonight or Monday for Puerto Rico, and the British and U.S. Virgin Islands. The storm is scheduled to take a turn to the north after passing over Puerto Rico, and head for Bermuda as a category 2 hurricane.\nNo natural-disasters events were found."}, {"id": "cb42b6e3-6eba-4957-92d7-937c3c606465", "title": "Potential tropical cyclone not a threat to Bermuda", "date": "2024-08-12 06:15", "url": "https://www.royalgazette.com/weather/article/20240811/potential-tropical-cyclone-not-a-threat-to-bermuda/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "Forecast for Potential Tropical Cyclone Five as of August 11 at 6pm (Photograph from the Bermuda Weather Service)A potential tropical cyclone was being monitored but was not considered a threat to Bermuda within the next three to five days as it moved to the northern Atlantic Ocean.\nPotential Tropical Cyclone Five’s closest point of approach within the next 72 hours was predicted to be about 832 miles south of Bermuda on Wednesday at about 6pm.\nThe Bermuda Weather Service warned that despite the prediction, the storm may come closer after that.\nPotential Tropical Cyclone Five was approximately 1,671 miles southeast of Bermuda at 6pm today and was moving in a west-northwest direction at about 21mph.\nThe storm can be tracked on the Bermuda Weather Service’s website.", "location": "Atlantic.", "classification": "natural-disasters", "score": 0.8844609326565069, "event_breakdown": "Potential Tropical Cyclone Five being monitored near Bermuda."}, {"id": "5587340e-f2f2-40ee-9301-00caa56de92b", "title": "Severe tropical storm makes landfall in Japan", "date": "2024-08-12 06:30", "url": "https://www.businesstimes.com.sg/international/severe-tropical-storm-makes-landfall-japan", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "SEVERE Tropical Storm Maria on Monday made landfall in northern Japan, having dumped more than two months worth of rain in the previous 24 hours and forcing the cancellation of dozens of flights.\nMaria, which was categorised as a “severe tropical storm”, a level below typhoon, made landfall around 8.30 am (2330 GMT Sunday) near Ofunato city in Iwate prefecture, the Japan Meteorological Agency said.\nJapan Airlines said it cancelled 78 domestic flights, affecting 7,039 passengers.\nSome regional train services suspended their services, although the bullet train system continued its normal operations.\nThe storm was expected to cross Japan and head out to the Sea of Japan by Monday evening.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7425498860185997, "event_breakdown": "Severe Tropical Storm Maria made landfall in northern Japan on Monday\nMaria crossed the Japan and headed out to the Sea of Japan by Monday evening"}, {"id": "619b5a87-54ff-4f22-ba40-68399fa049cd", "title": "Severe Tropical Storm Maria makes landfall in Japan", "date": "2024-08-12 04:15", "url": "https://www.bssnews.net/news/203445", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "TOKYO, Aug 12, 2024 (BSS/AFP) - Severe Tropical Storm Maria on Monday made landfall in northern Japan, having dumped more than two months worth of rain in the previous 24 hours and forcing the cancellation of dozens of flights.\nMaria, which was categorised as a \"severe tropical storm\", a level below typhoon, made landfall around 8:30 am (2330 GMT Sunday) near Ofunato city in Iwate prefecture, the Japan Meteorological Agency said.\nMaria was bringing gusts of up to 126 kilometres (78 miles) per hour and moving northwest at 15 kilometres per hour, the agency said.\nSome regional train services suspended their services, although the bullet train system continued its normal operations.\nThe storm was expected to cross Japan and head out to the Sea of Japan by Monday evening.", "location": "TOKYO", "classification": "natural-disasters", "score": 0.8253545567486912, "event_breakdown": "Severe Tropical Storm Maria made landfall near Ofunato city in Iwate prefecture in Japan on Monday around 8:30 am. The storm was categorised as a severe tropical storm, a level below typhoon, and was dumping more than two months worth of rain in Japan. It brought gusts of up to 126 kilometres (78 miles) per hour and was moving northwest at 15 kilometres per hour. Some regional train services suspended their services, although they bullet train system continued its normal operations."}, {"id": "8fe33a40-ee57-4acc-a581-6631f010adc4", "title": "Severe Tropical Storm Maria makes landfall in Japan", "date": "2024-08-12 06:45", "url": "https://www.manilatimes.net/2024/08/12/world/severe-tropical-storm-maria-makes-landfall-in-japan/1963376", "domain": "manilatimes.net", "domain_classification": "Unknown", "message": "TOKYO — Severe Tropical Storm Maria on Monday made landfall in northern Japan, having dumped more than two months worth of rain in the previous 24 hours and forcing the cancellation of dozens of flights.\nMaria, which was categorized as a \"severe tropical storm,\" a level below typhoon, made landfall around 8:30 a.m. (2330 GMT Sunday) near Ofunato city in Iwate prefecture, the Japan Meteorological Agency said.\nA station board at JR Sendai Station shows its service updates of Shinkansen, or bullet train, as possible delay are expected due to an approaching storm in Sendai, northern Japan, Monday, Aug. 12, 2024.\nKYODO NEWS VIA AP A station board at JR Sendai Station shows its service updates of Shinkansen, or bullet train, as possible delay are expected due to an approaching storm in Sendai, northern Japan, Monday, Aug. 12, 2024.\nThe storm was expected to cross Japan and head out to the Sea of Japan by Monday evening.", "location": "Tohoku region", "classification": "natural-disasters", "score": 0.6920826860762666, "event_breakdown": "SEVERE TYPHOON HANI HITS JAPAN\n\nOne of the most powerful typhoons to appear in decades, Typhoon #Hani has made landfall south of Tokyo. The storm brought storm surges and winds to the area, and has since lost some of its strength.\n\nOver the next several days, maps of the typhoon's route will be made available for study and analysis. This will be a learning experience for the general public and meteorologists.\n\nThe Science\n\nThe eye of Typhoon #Hani is the largest and most intense ever recorded on Earth. It has nearly the size of the continental United States, larger than the United States!\n\nIn general, the eye of a low pressure system has the slowest winds and has the strongest winds. The eye of Typhoon #Hani will be shared with the entire planet in the coming days.\n\nThe rarity\n\nThe storm has had 1-minute maximum sustained winds of 185 mph (300 km/h), a pressure a low of 878 mb, and a minimum central pressure of 879.9 mb. \n\nIt's pretty rare. With measurements like these and its size -- almost the size of the U.S. -- this is a sight to behold.\n\nKT"}, {"id": "75684dc9-b3b8-4c71-a25e-97cc8fab614f", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 02:30", "url": "https://news4sanantonio.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "1. Event: Potential Tropical Cyclone Five forms in the Atlantic Ocean\nDescription: In the National Hurricane Center's 5 p.m. advisory on Sunday, the National Hurricane Center designated a disturbance Potential Tropical Cyclone Five.\n\nLocation: Atlantic Ocean, near Leeward Islands."}, {"id": "1684e59d-d702-4afc-a42a-4d221006f824", "title": "Hochul visits Canisteo after flooding , tells community  You will not be forgotten  ", "date": "2024-08-12 01:45", "url": "https://www.yahoo.com/news/hochul-visits-canisteo-flooding-tells-000230222.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CANISTEO, N.Y. (WETM) — Governor Kathy Hochul visited Canisteo on Sunday afternoon to address the community two days after flooding caused severe damage in the area.\nHow can Steuben County residents impacted by flooding get help?\nIn addition to helping flood victims get money from insurance companies, New York State will be giving homeowners money to address damages.\nHochul stressed that Steuben County’s elected officials care about their community and are united in sharing their resources and rebuilding.\nSteuben County Chair Kelly Fitzpatrick and Senator Tom O’Mara were among the local officials standing alongside Hochul in Canisteo.", "location": "Canisteo", "classification": "natural-disasters", "score": 0.8053336274146681, "event_breakdown": "Target events not found"}, {"id": "ce73cb2f-5de1-4659-8448-c9d5a7827f9f", "title": "From farm to table : How extreme weather affects prices along the food supply chain", "date": "2024-08-12 09:30", "url": "https://www.thereminder.ca/the-mix/from-farm-to-table-how-extreme-weather-affects-prices-along-the-food-supply-chain-9338046", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "Extreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada’s food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\nExtreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada’s food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\n“For example, you might have damaged infrastructure from floods that changes transportation routes and the ability to move those products along the food supply chain.”Shortages caused by extreme weather can also drive food prices higher if supply isn’t able to meet demand, she said.\nThose practices can’t protect crops from the most extreme weather, he said, but they do help in other years.\nA disruption on one part of the supply chain can create a “domino effect,” he said.", "location": "CANADA", "classification": "natural-disasters", "score": 0.7099021156784877, "event_breakdown": "- A fire in Lytton, B.C., destroyed much of the town and forced evacuations in late June 2021\n- Heavy rain in Abbotsford, B.C., caused widespread flooding in November 2021\n- A heat dome affected many parts of Western Canada in June 2021, leading to record-breaking temperatures and wildfires\n- A severe drought affected many parts of Western Canada in 2021, leading to water restrictions and wildfires\n- A severe windstorm caused widespread power outages in Newfoundland in January 2020."}, {"id": "c2cc28d7-d982-4c24-9e4c-49bb3a41f482", "title": "From farm to table : How extreme weather affects prices along the food supply chain", "date": "2024-08-12 09:00", "url": "https://www.coastreporter.net/the-mix/from-farm-to-table-how-extreme-weather-affects-prices-along-the-food-supply-chain-9338046", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "Extreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada’s food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\nExtreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada’s food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\n“For example, you might have damaged infrastructure from floods that changes transportation routes and the ability to move those products along the food supply chain.”Shortages caused by extreme weather can also drive food prices higher if supply isn’t able to meet demand, she said.\nThose practices can’t protect crops from the most extreme weather, he said, but they do help in other years.\nA disruption on one part of the supply chain can create a “domino effect,” he said.", "location": "CANADA.", "classification": "natural-disasters", "score": 0.7099021156784877, "event_breakdown": "1. Canada: Extreme weather events (fires, floods, heat waves and droughts) pose an increasing risk to Canada's food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\n2. Australia: Residents of New South Wales are being warned of an increased risk of bushfires across parts of the state this weekend due to increased fire danger and gusty winds."}, {"id": "8d3d3764-017a-4bb9-8dc1-7cbece1a4bca", "title": "From farm to table : How extreme weather affects prices along the food supply chain", "date": "2024-08-12 09:30", "url": "https://www.airdriecityview.com/national-business/from-farm-to-table-how-extreme-weather-affects-prices-along-the-food-supply-chain-9338042", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "Extreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada’s food supply chain, putting pressure on prices all the way to the grocery store shelf, say experts.\n“Weather can also impact activities further down the supply chain,” she said.\n“For example, you might have damaged infrastructure from floods that changes transportation routes and the ability to move those products along the food supply chain.”Shortages caused by extreme weather can also drive food prices higher if supply isn’t able to meet demand, she said.\nThose practices can’t protect crops from the most extreme weather, he said, but they do help in other years.\nA disruption on one part of the supply chain can create a “domino effect,” he said.", "location": "Canada", "classification": "natural-disasters", "score": 0.6485076569281188, "event_breakdown": "California mudslides\nCalifornia wildfires"}, {"id": "40f10fed-0d06-4d7c-8027-d5d4f3604723", "title": "From farm to table : How extreme weather affects prices along the food supply chain", "date": "2024-08-12 10:30", "url": "https://www.pentictonherald.ca/business_news/national_business/article_203433e7-82be-5a22-99db-c0c0ffed6ca6.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "A head of wheat is silhouetted by the sun in a wheat crop near Cremona, Alta., Tuesday, Sept. 6, 2022.\nExtreme weather events like fires, floods, heat waves and droughts pose an increasing risk to Canada's food supply chain, putting pressure on prices all the way to the grocery store.\nTHE CANADIAN PRESS/Jeff McIntosh", "location": "ALTA", "classification": "natural-disasters", "score": 0.7209039938797771, "event_breakdown": "The following current events of natural-disasters are reported in text that can be placed on a map:\n- Wheat crop near Cremona, Alta."}, {"id": "8ad6bffc-810d-406c-aea1-d37815ea64ce", "title": "Tropical Storm Ernesto could form soon in the Caribbean . Here what the forecast says", "date": "2024-08-12 13:30", "url": "https://www.yahoo.com/news/tropical-storm-ernesto-could-form-124037551.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto could form soon in the Caribbean.\nSeveral Caribbean islands, including Antigua, Barbuda, Saba and St. Eustatius, Guadeloupe and St. Maarten were put under tropical storm warnings Monday.\nIf it were to turn into a tropical storm, it would be named Ernesto.\nThe forecast track shows it remaining at tropical storm strength as it approaches the U.S. and British Virgin Islands and Puerto Rico on Tuesday evening.\nTropical storm watch is in effect for: Puerto Rico, U.S. and British Virgin Islands, Vieques, Culebra", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.6580967309788642, "event_breakdown": "Tropical Storm Ernesto in the Gulf of MexicoThe National Hurricane Center says, Tropical Storm has strengthened off the coast of Mexico and could grow into a Category 1 hurricane later Tuesday as it continues its path towards southeastern Louisiana."}, {"id": "2ba83d94-2755-4d40-8baa-2edffa58df55", "title": "Atlantic front forming into tropical storm headed toward U . S . Virgin Islands", "date": "2024-08-12 05:45", "url": "https://www.yahoo.com/news/atlantic-front-forming-tropical-storm-051833096.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Atlantic front is threatening to strengthen into a storm as it heads toward various Caribbean islands.\nMultiple Caribbean islands, including the U.S. Virgin Islands, are in its probable path.\nSo far, the hurricane center has not said the front was headed for hurricane status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Caribbean", "classification": "natural-disasters", "score": 0.8989953626591435, "event_breakdown": "A storm is threatening to strengthen into a hurricane in the Atlantic. Multiple Caribbean islands including the US Virgin Islands are in its probable path. The hurricane centre has not said the front was headed for hurricane status, but warned it was likely to send strong winds over some islands on Tuesday. It would be the fifth named storm of the Atlantic hurricane season so far."}, {"id": "aab0c1c0-d0b8-4f3a-a292-3a7a6ea7c7d2", "title": "Atlantic front forming into tropical storm headed toward US – NBC Bay Area", "date": "2024-08-12 09:00", "url": "https://www.nbcbayarea.com/news/national-international/atlantic-front-forming-into-tropical-storm-headed-toward-u-s-virgin-islands/3622951/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "The potential cyclone was gaining strength rapidly enough that the center said it would most likely be a named tropical storm by the end of Monday.\nIf so, the name Ernesto is in line for the next Atlantic storm.\nSo far, the National Hurricane Center has not said the front was headed for hurricane status.\nIt would be the fifth named storm of the Atlantic hurricane season so far, as indicated by its temporary name.\nIt says near-record warmth in the tropical Atlantic is providing ample fuel for storm development.", "location": "Based on the context provided, I was unable to come up with a specific location for the main event.", "classification": "natural-disasters", "score": 0.9262900053263573, "event_breakdown": "Potential Tropical Cyclone One is located near latitude 25.1 north, longitude 74.0 west. The system has maximum sustained winds of 35 mph and is moving northwest at 14 mph. On this track the center of the storm will move over the southeastern Bahamas tonight and near or over the northwestern Bahamas on Monday.\nTropical storm force winds extend outward up to 45 miles from the center.tropical storm-force winds extend outward up to 45 miles from the center.\nA Tropical Storm Watch remains in effect for...\n* Andros Island\n* The Central Bahamas, including the Abacos, Berry Islands, Bimini, Eleuthera, Grand Bahama Island, and New Providence.\n* Northwestern Bahamas, including the Abacos, Andros Island, Berry Islands, Bimini, Eleuthera, Grand Bahama Island, and New Providence.\n* Northeast Bahamas, including the Abacos, Andros Island, Berry Islands, Bimini, Eleuthera, Grand Bahama Island, and New Providence.\n\nTropical storm conditions are expected to begin within the Tropical Storm Warning area tonight or early Monday. Tropical storm conditions are possible in the watch area on Monday.\nRAINFALL...\nThe system is expected to produce total rainfall of 2 to 4 inches over the central Bahamas and 2 to 3 inches over the northwestern Bahamas, with localized amounts up to 8 inches"}, {"id": "8cc79be7-b95c-4a96-b2ba-2c93d72036b4", "title": "  Nimble and creative : How small farmers feed NC between drought and rainfall extremes", "date": "2024-08-12 10:45", "url": "https://www.yahoo.com/news/nimble-creative-small-farmers-feed-100000463.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "His family’s 100-acre property, Lineberger’s Farm, in Dallas, N.C., can’t send water to all crops at the same time.\nEven with an irrigation system, Lineberger’s farm in Gaston County wasn’t safe from the heat and drought.\nSeveral inches of rain won’t revive dried and dying crops , but instead, it creates new challenges for North Carolina market growers like Lineberger.\nAmong them: Charlotte’s airport logged 4.09 inches of rain Thursday, breaking the previous record of 1.37 inches for Aug. 8.\nThe best way for community members to support small farmers is to buy from them, Hardison told The Observer.", "location": "DALLAS, N.C.", "classification": "natural-disasters", "score": 0.5846811185227184, "event_breakdown": "1. Heatwaves and droughts greatly impact Lineberger’s Farm in Gaston County, North Carolina. Supplemented with irrigation, several inches of rain still won’t help. The reporter of The Observer suggested that local community members promptly support small farmers by buying from them."}, {"id": "e74c50e4-2425-47e8-ac06-ec0d1ed17181", "title": "Debby aftermath leaves thousands without power , threatens more floods : NPR", "date": "2024-08-12 03:00", "url": "https://www.npr.org/2024/08/11/nx-s1-5071222/debby-aftermath-power-outages-flooding", "domain": "npr.org", "domain_classification": "International", "message": "Debby left thousands in the dark, and threats of more floodingtoggle caption Craig Ruttle/APPHILADELPHIA — The weather system previously known as Hurricane Debby was not quite done with parts of the U.S. Sunday as flood warnings remained in effect in North Carolina and thousands were without power in New York, Ohio and Pennsylvania.\nWith the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "PHILADELPHIA", "classification": "natural-disasters", "score": 0.8885172538358591, "event_breakdown": "New York City, New York: Flooding in parts of the Bronx and Westchester County after Debby dumped heavy rain on Friday. (Today/ AP)\n- Dozens of people evacuated to emergency shelters in upstate New York following flash flooding in Cattaraugus County. Local emergency officials reported thousands of lightning strikes during the storms, causing a fire in one business and leaving 2,000 without power. (WKBW)\n- The Ohio Department of Transportation reports downed trees and power lines resulting in 600 power outages in southern Ohio. (This is Northern Kentucky/ Cincinnati USA).\n- Thousands of residents and businesses without power in both Indiana and Kentucky after storms from Debby passed through overnight. (WLKY)\n- Several hundred customers have been affected by power outages in Charlotte, North Carolina. (WBTV)"}, {"id": "8b9567d3-26b3-4452-adf2-039c3390cde5", "title": "Ernesto could form Monday , tropical storm watches issued for several Caribbean islands", "date": "2024-08-12 14:00", "url": "https://www.fox13news.com/weather/ernesto-could-form-monday-tropical-storm-watches-issued-several-caribbean-islands", "domain": "fox13news.com", "domain_classification": "Unknown", "message": "A tropical storm watch has been issued for Puerto Rico and nearby Caribbean islands Monday morning as Potential Tropical Cyclone Five continues to form.\nAccording to the National Hurricane Center, the tropical disturbance is expected to become our next named storm, at least Tropical Storm Ernesto, before it reaches the Leeward Islands.\nOsterberg said Tropical Storm Ernesto should form in the next 24 to 36 hours.\n\"But with a trough coming off the east coast, it definitely will act to just turn that storm out, which is fantastic.\"\nAccording to the NHC, heavy rainfall could lead to considerable flash flooding and mudslides in the Leeward Islands later on Monday through Wednesday and over Puerto Rico late Tuesday into Thursday.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9275158798900225, "event_breakdown": "Tropical Storm Ernesto is expected to form in the next 24 to 36 hours. According to the National Hurricane Center, a tropical storm watch has been issued for Puerto Rico and nearby Caribbean islands. Heavy rainfall could lead to considerable flash flooding and mudslides in the Leeward Islands and later over Puerto Rico."}, {"id": "b2686614-808c-4449-9135-69219071c80a", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas – The Denver Post", "date": "2024-08-12 00:00", "url": "https://www.denverpost.com/2024/08/11/debbys-aftermath-leaves-thousands-in-the-dark-threatens-more-flooding-in-the-carolinas/", "domain": "denverpost.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean up kits to residents impacted by flash flooding on Sunday and Monday."}, {"id": "3213f545-a03a-4fca-b696-7721356c01a1", "title": "Driver killed as flooding swamps North Carolina after Tropical Storm Debby", "date": "2024-08-12 00:00", "url": "https://www.fox10phoenix.com/weather/driver-killed-tropical-storm-debby", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "This comes after heavy precipitation triggered numerous reports of flash flooding on Saturday, including the deadly incident in Lumberton, North Carolina.\nThis includes cities such as Charleston in South Carolina and Wilmington in North Carolina.\nFlash Flood Emergency issued FridayA Flash Flood Emergency was issued for the area of Greensboro , North Carolina, late Friday as up to 4 inches of rain had fallen.\nStorm reports also showed that a bridge had been partially washed out near Gaffney , South Carolina.\nIt made two landfalls in the U.S. – first in Florida as a Category 1 hurricane last Monday and second in South Carolina as a tropical storm on Thursday.", "location": "Based on the text, the most specific location for the event would be 'North Carolina'.", "classification": "natural-disasters", "score": 0.8828579867481929, "event_breakdown": "1. Heavy precipitation triggers numerous reports of flash flooding, including the deadly incident in Lumberton, North Carolina.\n2. A Flash Flood Emergency was issued for the area of Greensboro, North Carolina, late Friday as up to 4 inches of rain had fallen.\n3. Storm reports also showed that a bridge had been partially washed out near Gaffney, South Carolina."}, {"id": "fe739615-c568-4fdc-acb3-54ad5138effe", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:30", "url": "https://www.kdlg.org/as-heard-on-npr/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kdlg.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural disasters are not time-bound, any of them can destroy life at any time. Marking them on a map is not appropriate. the past two years.\nOver the past two years, there have been a number of natural disasters around the world. Some of the most notable ones include:\n\n- Hurricane Maria: A Category 5 hurricane that devastated Puerto Rico in 2017. It caused widespread destruction, killed thousands of people, and left millions without power for months.\n\n- Hurricane Harvey: A Category 4 hurricane that made landfall in Texas in 2017. It caused catastrophic flooding in Houston and the surrounding areas, and resulted in thousands of deaths and an estimated $125 billion in damages.\n\n- Hurricane Florence: A Category 4 hurricane that made landfall in North Carolina in 2018. It caused widespread flooding in North Carolina and South Carolina, and resulted in the deaths of at least 49 people.\n\n- Hurricane Dorian: A Category 5 hurricane that made landfall in the Bahamas in 2019. It caused widespread destruction and death in the Bahamas, and resulted in at least 50 deaths.\n\n- Typhoon Hagibis: A Category 5 typhoon that made landfall in Japan in 2019. It caused widespread flooding and landslides in Japan, and resulted in the deaths of at least 90 people.\n\n- Hurricane Dorian: A Category 5 hurricane that made landfall in the Bahamas in 2019. It caused widespread destruction and death in the Bahamas, and resulted in at least 50 deaths."}, {"id": "5dce75ae-35dd-4d36-a25b-f94e79b71043", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:30", "url": "https://www.wprl.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wprl.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday."}, {"id": "3dae682c-c87b-459d-957b-01903b2b665a", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 03:15", "url": "https://www.kanw.com/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kanw.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated coastal Carolinas with rain and flash flooding on Friday, prompting evacuations and rescues."}, {"id": "53f49501-b2b5-4bc9-ab2e-43e849ba0cac", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:30", "url": "https://www.wvxu.org/news-from-npr/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wvxu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural disasters, such as storms and floods, happen all over the world. As of right now, we are unaware of any events that are currently happening and can be placed on a map. However, we will continue to provide updates as new information becomes available."}, {"id": "c8f79afc-a985-483d-be47-8a1833bcdccd", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 05:15", "url": "https://www.wxpr.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wxpr.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby's last day and night over U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday."}, {"id": "db0470aa-7fac-446d-9a59-ff24acaa5ab8", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 03:30", "url": "https://www.krvs.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "krvs.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday."}, {"id": "99a132e3-d902-4105-8456-65d9c49f06ae", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:00", "url": "https://www.ksmu.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "ksmu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural disasters reported in text:\nJune 26, 2022 - Heavy flooding in coastal Carolinas due to heavy rain\nJune 25, 2022 - Heavy rain and flash flooding in some parts of New York, Pennsylvania and New England"}, {"id": "93479b78-7fc1-4e0d-ad9d-910421b0ee4b", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:00", "url": "https://www.kwbu.org/latest-from-npr/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kwbu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "eastern Pennsylvania", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain on Friday, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding."}, {"id": "244f5602-474f-4d65-acc8-c16d19515201", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:00", "url": "https://www.wsiu.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wsiu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "[\n{\n\"title\": \"Tropical Storm Alex Bringing Heavy Rain to Southeast Florida\",\n\"description\": \"Tropical Storm Alex is bringing heavy rain to southeastern Florida on Sunday. The storm is expected to make landfall in southern Florida Sunday night and will continue moving north up the East Coast of the U.S. through Sunday and into Memorial Day.\",\n\"image\": \"https://www.wptv.com/wp-content/uploads/2022/05/america-weather-radar-andrew-h-ditommaso-600x338.jpg\"\n}\n]"}, {"id": "3905e58c-7929-4fce-8c51-6a4940eb07df", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:15", "url": "https://www.kcbx.org/npr-top-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kcbx.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Tornadoes in Kentucky and Missouri on Dec. 10, hit by multiple tornadoes. Several homes and other buildings had their roofs torn off. There were at least four fatalities by the EF-3 tornado that swept through southwestern Missouri."}, {"id": "eef15dc5-f01c-4bbe-b809-7d365d008fc1", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:30", "url": "https://www.kwit.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kwit.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "In North Carolina, the flooding has been blamed for at least nine deaths.\nMore than 35,000 homes and businesses still have no power as of Sunday afternoon."}, {"id": "ecdede89-e67d-458b-b01c-b6e8e0c11563", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:30", "url": "https://radio.wpsu.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "radio.wpsu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "COLUMBIA, NORTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural disasters including mudslides, flooding, high surf, and power outages are currently affecting North Carolina, South Carolina, Ohio, New York, Pennsylvania, Vermont."}, {"id": "e668306d-1553-457e-9094-9138a11fda20", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:15", "url": "https://www.ualrpublicradio.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "ualrpublicradio.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "COLUMBIA, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "[\n {\n  \"type\": \"Feature\",\n  \"properties\": {\n   \"title\": \"Debby\",\n   \"description\": \"Debby drenched Florida before soaking parts of New York, Pennsylvania and New England, prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.\",\n   \"marker-symbol\": \"circle\",\n   \"marker-size\": \"small\",\n   \"marker-color\": \"ff0e00\",\n   \"marker-latitude\": \"28.66109866708565\",\n   \"marker-longitude\": \"-82.897167056349585\"\n  },\n  \"geometry\": {\n   \"type\": \"Point\",\n   \"coordinates\": [\n    -82.897167056349585,\n    28.66109866708565\n   ]\n  }\n }\n]"}, {"id": "c07f751a-9f83-4e18-aca2-20b91fae0813", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:45", "url": "https://www.kunc.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kunc.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Natural disasters - reports of ground saturated in coastal Carolina from Debby, reports of 35,000 homes and businesses also lost electricity in Ohio, New York, Pennsylvania and Vermont."}, {"id": "52d41830-eb7f-497e-942f-28d0aaa2f9e1", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm", "date": "2024-08-12 12:45", "url": "https://gatorrocks.iheart.com/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "gatorrocks.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "The National Hurricane Center is monitoring Tropical Storm Ernesto, which formed in the Atlantic northeast of Puerto Rico. The storm currently has maximum sustained winds of 45 mph and is moving to the west-northwest at 21 mph. Tropical Storm Ernesto is expected to bring heavy rain and strong winds to Puerto Rico, the Virgin Islands, and other parts of the Caribbean over the next few days."}, {"id": "5bb003f1-edd6-41b7-a9e0-71f144b42dbb", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm", "date": "2024-08-12 13:45", "url": "https://foxsports940.iheart.com/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "foxsports940.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "Tropical Storm Claudette: Claudette was first discovered in the Gulf of Mexico on June 19, 2021, and made landfall as a tropical storm the next day. On June 22, after moving through the Atlantic, Claudette regained tropical storm status, but eventually weakened into a tropical depression.\n\nTropical Storm Colin: made landfall on the Florida panhandle on June 7, 2021, as a tropical storm. It remained off the coast of the Carolinas before it eventually moved north and out to sea.\n\nTropical Storm Bonnie: made landfall in South Carolina on May 29, 2021, as a tropical storm. It weakened to a tropical depression, and dissipated over North Carolina on May 31.\n\nTropical Storm Ana: made landfall in South Carolina on May 10, 2021, as a tropical storm. It weakened to a tropical depression, and degenerated into a trough of low pressure on May 14.\n\nPotential Tropical Cyclone One: this potential tropical storm system formed off of the coast of South Carolina on January 24, 2021. It made landfall as a subtropical storm in North Carolina on January 27, and weakened as it moved inland.\n\nTropical Storm Cristobal: formed on June 2, 2020 and made landfall in Mexico on June 3 as a tropical storm. It then made a second landfall in Louisiana on June 7. It then moved inland and became a post-tropical cyclone on June 10.\n\nTropical Storm Arthur: The first tropical cyclone of the Atlantic hurricane season, Arthur"}, {"id": "d0f0d872-1253-492f-b8fc-7ba1905fdb00", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm", "date": "2024-08-12 14:00", "url": "https://953wdae.iheart.com/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "953wdae.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "Tropical Storm Nangka approaching Taiwan\nTyphoon Chan-hom hits China's east coast\n6.2-magnitude earthquake hits island of Lesbos, Greece\n5.0-magnitude earthquake hits Riverside, California\nTornado touches down in Pond Inlet, Nunavut\nTropical storm warning issued for Puerto Rico"}, {"id": "7b223a23-bc83-440b-aa40-117b5165f90b", "title": "Storm tracker : NHC tracking tropical disturbance that is expected to become Tropical Storm Ernesto", "date": "2024-08-12 12:45", "url": "https://www.aol.com/storm-tracker-nhc-tracking-potential-120011704.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The NHC posted a tropical weather outlook for Potential Tropical Cyclone Five on Sunday, and in a Monday morning advisory said the system is expected to \"continue with some decrease in forward speed\" during the next couple of days.\nPuerto Rico, Virgin Islands under tropical storm watchesThe NHC said in a 5 a.m.\nET advisory Monday that a tropical storm watch is in effect for the following:GuadeloupeSt. Kitts, Nevis, Montserrat, Antigua, Barbuda, and AnguillaSaba and St. EustatiusSt. Martin and St. BarthelemySint MaartenBritish Virgin IslandsU.S. Virgin IslandsPuerto RicoViequesCulebraThe NHC says a tropical storm watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.\nPotential Tropical Cyclone Five spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on USA TODAY: National Hurricane Center tracking Potential Tropical Cyclone Five", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.891940490692235, "event_breakdown": "National Hurricane Center tracking Potential Tropical Cyclone Five : The National Hurricane Center said Monday that it was tracking a potential tropical cyclone in the Atlantic Ocean. The agency warned it could develop into a tropical storm and impact Puerto Rico, the Virgin Islands and parts of the Caribbean over the next few days."}, {"id": "ac562fd2-616b-4dfc-881a-37601ad82428", "title": "Forecasters announced a tropical storm warning for portions of the leeward islands", "date": "2024-08-12 13:30", "url": "https://www.yahoo.com/news/forecasters-announced-tropical-storm-warning-120903417.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Forecasters announced a tropical storm warning for portions of the leeward islandsArticle first published: Monday, Aug. 12, 2024, 5 a.m.\nThe government of the Netherlands has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Saba and St. Eustatius.\nThe government of France has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Guadeloupe, St. Martin, and St. Barthelemy.\nThe government of Sint Maarten has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Sint Maarten.\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.", "location": "Sint Maarten", "classification": "natural-disasters", "score": 0.7895742983434403, "event_breakdown": "Tropical Storm Warning Issued for Leeward Islands in Caribbean, as Storm Approaches\n\nThe government of France has issued a tropical storm warning for Guadeloupe, St. Martin, St. Barthelemy, and adjac\nent islands in the southeastern Caribbean Sea as Tropical Storm Dorian is expected to bring high winds, heavy rain, and storm surges to the region. The storm is forecast to bring tropical storm conditions with sustained winds of 39 to 73 miles per hour. Authorities say the storm is currently bringing heavy rains to St. Lucia and is increasing in intensity and speed.\n\nThe government of the Netherlands has issued a tropical storm warning for the islands Saba and St. Eustatius, and the government of Sint Maarten has issued a tropical storm warning for Sint Maarten.\n\nAuthorities are urging residents to secure outdoor plans, clear storm drains, and stock up on emergency supplies. The government of France has also issued an alert urging residents to stay indoors until the storm has passed and has reported it is not safe to travel. Mandatory evacuation orders are in effect in some areas.\n\nThe government of Sint Maarten has also closed schools and government facilities until further notice.\n\nThe tropical storm warning will remain in effect until further notice."}, {"id": "a1384eb6-5867-42e2-a296-2e07dc7830c7", "title": "Forecasters announced a tropical storm warning for portions of the leeward islands", "date": "2024-08-12 13:30", "url": "https://www.yahoo.com/news/forecasters-announced-tropical-storm-warning-120903619.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Forecasters announced a tropical storm warning for portions of the leeward islandsArticle first published: Monday, Aug. 12, 2024, 5 a.m.\nThe government of the Netherlands has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Saba and St. Eustatius.\nThe government of France has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Guadeloupe, St. Martin, and St. Barthelemy.\nThe government of Sint Maarten has upgraded the Tropical Storm Watch to a Tropical Storm Warning for Sint Maarten.\nA Tropical Storm Watch means that tropical storm conditions are possible within the watch area, generally within 48 hours.", "location": "Sint Maarten", "classification": "natural-disasters", "score": 0.7895742983434403, "event_breakdown": "Tropical Storm Warning issued for Sint Maarten\nTropical Storm Watch issued for Guadeloupe, St. Martin and St. Barthelemy"}, {"id": "72e1ed92-36b6-4c8d-b656-619ab222d34e", "title": "HURRICANE CENTER : You Can Exhale , New System Will Turn Away From Florida", "date": "2024-08-12 12:45", "url": "https://bocanewsnow.com/2024/08/12/hurricane-center-you-can-exhale-new-system-will-turn-away-from-florida/", "domain": "bocanewsnow.com", "domain_classification": "Unknown", "message": "POTENTIAL TROPICAL CYCLONE 5 MAY PACK 110 MPH WINDS… CATEGORY TWO HURRICANE.\nPotential Tropical Cyclone Five is expected to turn away from the United States, according to the National Hurricane Center early Monday, August 12, 2024.\nKnown early Monday as “Potential Tropical Cyclone Five,” the system may still strengthen to 110 mph which is a Category Two storm.\nUntil that is confirmed by either daylight satellite imagery or an upcoming Hurricane Hunter flight, the system will remain at potential tropical cyclone status.\nKey Messages:The disturbance is expected to become a tropical storm before or as it reaches the Leeward Islands, where Tropical Storm Watches are in effect.", "location": ".\nBased on the text, it was not possible to determine a specific location for the event.", "classification": "natural-disasters", "score": 0.9180952005023141, "event_breakdown": "Tropical Storm Potential Tropical Cyclone Five (PTC 5), 110 MPH | Current Location: Leeward Islands | Potential Landing in the Caribbean | Category: Natural-disasters"}, {"id": "d880a063-e7fc-455b-9478-918d629f4103", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 03:00", "url": "https://wset.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "wset.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Leeward Islands.", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Potential Tropical Cyclone Five, soon to be Tropical Storm Ernesto, packed maximum sustained winds of 30 miles per hour and a minimum central pressure of 1009 millibars as Sunday night approached Saturday night. A tropical storm is possible as early as Monday as it nears the Leeward Islands."}, {"id": "b11c7295-69e0-4c01-beea-3e968b15138f", "title": "Mild drop in temperatures with rain chances by mid - week", "date": "2024-08-12 01:30", "url": "https://wach.com/weather/skywach-weather-blog/leeward-islandscolumbia-sc-tropical-storm-mild-drop-in-temperatures-with-rain-chances-by-mid-week", "domain": "wach.com", "domain_classification": "Unknown", "message": "COLUMBIA, SC (WACH) -- Sunday has been pleasant with a few rounds of afternoon showers and isolated storms.\nThis week, the temperature will drop earlier, with a constant threat of afternoon showers and thunderstorms.\nMonday's forecast area is predicted to have little showers and thunderstorms, with the likelihood of showers and thunderstorms increasing on Tuesday.\nTROPICAL UPDATE:The disturbance will become a tropical storm before reaching the Leeward Islands, in the Caribbean Sea.\nThe National Hurricane Center predicts tropical storm conditions could begin on Tuesday for some islands.", "location": "COLUMBIA, SC", "classification": "natural-disasters", "score": 0.8566609451868198, "event_breakdown": "Tropical storm conditions possible in the Leeward Islands on Tuesday."}, {"id": "f0351ac2-dd6e-4b37-99b6-d43ba329f0c6", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 01:15", "url": "https://cbs12.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "As of the Monday 8 a.m. advisory from the National Hurricane Center, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nThe system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterlyand a tropical storm is possible as early as Tuesday as it nears the Leeward Islands.\nStrengthening is likely into Thursday as the system approaches the Virgin Islands and Puerto Rico and moves into a much more conducive environment for development.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.\nHowever, the cone of uncertainty tracks the most likely path of the center using historical forecasts.", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.8210154226598225, "event_breakdown": "Ernesto is currently a category 1 hurricane and is likely to strengthen to hurricane status as the week progresses. It is located approximately 535 miles east southeast of the Leeward Islands and moving west-northward at about 18mph. The current forecast for Ernesto has it moving near or over portions of the northern Leeward Islands on Tuesday night and near the Virgin Islands and Puerto Rico on Wednesday night. There is a chance it could hit Bermuda on Thursday."}, {"id": "46840527-451d-41af-818f-26ab96acc4f0", "title": "Storm dumps intense rainfall on northern Japan , sending some people to shelters", "date": "2024-08-12 02:30", "url": "https://abcnews.go.com/International/wireStory/storm-dumps-intense-rainfall-northern-japan-sending-people-112766499", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A slow-moving storm is dumping intense rainfall on northern Japan, causing rivers to swell and sending some residents to sheltersTOKYO -- A slow-moving storm has been dumping intense rains on northern Japan, swelling rivers, sending residents to shelters and disrupting traffic during a Japanese Buddhist holiday week.\nThe storm was once Typhoon Maria but has weakened, with winds now blowing up to 72 kph (45 mph).\nIwate prefecture said about 2,000 people actually took shelter early Monday.\nThis storm is the first to make landfall in the Tohoku region since the 2016 typhoon.\nThe storm was affecting travel during the Obon holiday period in which people commemorate their ancestors.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7714555730846767, "event_breakdown": "Natural Disasters Reported in the Article:\n- Northern Japan is hit by a slow-moving storm, causing rivers to swell and sending residents to shelters.\n- Traffic is disrupted during a Japanese Buddhist holiday week, as a result of the strong storm."}, {"id": "86aa1555-3680-4384-b1a1-591cded62551", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 03:00", "url": "https://bakersfieldnow.com/news/nation-world/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "As of the Sunday at 5 p.m. advisory from the National Hurricane Center, the disturbance has been designated Potential Tropical Cyclone Five.\nWith the 11 p.m. Sunday advisory, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nA tropical storm is possible as early as Monday as it nears the Leeward Islands.\nBefore Monday, the system is battling some wind shear, however, the wind shear is forecast to decrease as the system moves west/northwesterly.\nThe current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.9432934249484242, "event_breakdown": "Location: Open Atlantic ocean\nEvent: Potential Tropical Cyclone Five\nReported: Sunday, August 02, 2020\nInformation:\nA disturbance in the Atlantic ocean is likely to transform into a tropical storm sometime on Monday. As of Sunday at 5 p.m., the disturbance was designated Potential Tropical Cyclone Five.\nAs of 11 p.m. Sunday, soon-to-be Ernesto packs maximum sustained winds up to 30 miles per hour and a minimum central pressure of 1009 millibars.\nThe current forecast track suggests the storm turning north, towards Bermuda and otherwise open Atlantic ocean."}, {"id": "23265861-be0e-4689-8443-7f3d08ae0531", "title": "  Nice  sunny weather in Boston forecast ,  dangerous rip current may threaten towards weekend", "date": "2024-08-12 04:15", "url": "https://www.bostonherald.com/2024/08/11/nice-sunny-weather-in-boston-forecast-dangerous-rip-currents-may-threaten-towards-weekend/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "“It’s looking like a pretty nice week, said National Weather Service meteorologist Kevin Pederson.\nThe region will likely be cooled by calm winds throughout the week, according to NWS forecasts.\n“But other than that, it should be nice weather for the work week ahead,” Pederson said.\nThe Southeast Atlantic coast may experience “rough surf and dangerous rip currents” towards the end of the week, DaSilva said.\n“Anyone heading to East coast beaches this week needs to be aware and know the warning signs.", "location": "The main location for the event is Southern coast of the US.", "classification": "natural-disasters", "score": 0.5574870448740746, "event_breakdown": "Hurricane Larry: As of Monday evening, the National Hurricane Center said there was a risk of dangerous surf, rip currents and minor coastal flooding in Bermuda over the next two days and along the U.S. East Coast by the end of the week."}, {"id": "49fdf61c-3cb4-4c60-87be-9fa98a19d4e7", "title": "Greece orders evacuation in Athens as authorities struggle to contain wildfires – Firstpost", "date": "2024-08-12 13:00", "url": "https://www.firstpost.com/world/greece-orders-evacuations-in-athens-as-authorities-struggle-to-contain-wildfires-13803799.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Greece has ordered evacuations in Athens as the Greek authorities struggle to curb the fire.\nAPAs a fast-spreading wildfire continues to rage on in Greece, local authorities have called for evacuation in the Greek capital of Athens.\nThe wildfires started on Sunday morning near the town of Varnavas, which is located in the north of Athens.\nAmid the chaos, Kikilias warned that locals might witness “extremely high and dangerous weather conditions” in recent days.\n“Winds overnight remained strong creating dangerous conditions.", "location": "Athens", "classification": "natural-disasters", "score": 0.4524362957256378, "event_breakdown": "Greece Wildfires: Athens Ordered Evacuated"}, {"id": "614c836d-1ace-426a-bbc3-d00e28898f7a", "title": "Evacuations ordered near Athens as Greek authorities try to contain wildfires - WSVN 7News | Miami News , Weather , Sports", "date": "2024-08-12 14:30", "url": "https://wsvn.com/news/us-world/evacuations-ordered-near-athens-as-greek-authorities-try-to-contain-wildfires/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "(CNN) — A fast-spreading wildfire continued to rage close to the Greek capital of Athens on Monday, prompting authorities to ask residents to evacuate their homes.\nFire authorities warned Monday that the wildfire had “developed rapidly” and was heading towards Penteli, around 16 kilometers (about 10 miles) northeast of Athens.\nGreek authorities have battled dozens of blazes already this summer after enduring its hottest June and July on record.\nKikilias warned over the weekend that “extremely high and dangerous weather conditions” would continue through Thursday.\n“Winds overnight remained strong creating dangerous conditions.", "location": "Athens", "classification": "natural-disasters", "score": 0.8242378446239966, "event_breakdown": "And despite heavy firefighting efforts — including water-bombing aircraft from Poland, Romania, Israel, and Spain on Monday — the key issue remains for Greece is the increased likelihood of similar extreme weather events.\nMonday also saw the Greek City Times article on the burning embers across the state, in dating app Tinder."}, {"id": "1679ddf2-494a-477e-8d06-c5efab73dbb6", "title": "Caribbean islands added to tropical storm watch as new formation grows in Atlantic", "date": "2024-08-12 18:00", "url": "https://www.aol.co.uk/news/caribbean-islands-added-tropical-storm-172919545.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Photograph: NOAASeveral Caribbean islands were added to a tropical storm watch on Monday as a new major disturbance was brewing in an already turbulent Atlantic hurricane season.\nAn average hurricane season in the Atlantic has 14 named storms, seven hurricanes and three major hurricanes.\nThe latest storm formation, currently listed as Potential Tropical Cyclone Five, is not currently predicted to hit the US mainland.\nPuerto Rico and the US and British Virgin islands were already under a tropical storm watch when the other islands were added to the list.\nThe future Ernesto, the fifth named storm in the series, is likely to bring heavy rain, flash flooding and other stormy conditions to the islands it affects.", "location": "Caribbean.", "classification": "natural-disasters", "score": 0.9674691483853538, "event_breakdown": "1. Potential Tropical Cyclone Five has disturbed several Caribbean islands including Puerto Rico and the British Virgin islands and had been added to the tropical storm watch.\n2. There is one report that can be relevant for this event the news that can be relevant to a natural-disasters that is happening in the current time frame."}, {"id": "617bb6c1-3882-4832-855e-297c4db19914", "title": "Watches issued for US territories ahead of potential tropical storm", "date": "2024-08-12 15:30", "url": "https://www.kjrh.com/weather/watches-issued-for-us-territories-ahead-of-potential-tropical-storm", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "The National Hurricane Center issued tropical storm warnings for Puerto Rico and the U.S. Virgin Islands ahead of a tropical disturbance that could move through the Caribbean this week.\nPotential Tropical Cyclone No.\nAccording to the National Hurricane Center, the disturbance will move into the Caribbean on Tuesday and is expected to strengthen into a tropical storm.\nEventually, the tropical disturbance is expected to become a hurricane and move north toward Bermuda.\nRELATED STORY | NOAA expects 'extraordinary' 2024 Atlantic hurricane season", "location": "Caribbean", "classification": "natural-disasters", "score": 0.9226007571184314, "event_breakdown": "Potential Tropical Cyclone No. 19\nTropical Storm Warning for Puerto Rico, U.S. Virgin Islands"}, {"id": "4828f9a0-b593-4e97-8396-627f436a92d1", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas", "date": "2024-08-12 09:15", "url": "https://www.nbcnews.com/news/weather/debbys-aftermath-leaves-thousands-dark-threatens-flooding-carolinas-rcna166173", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "['Debby', 'localized downpours', 'coastal Carolinas', 'Ohio', 'New York', 'Pennsylvania', 'New Jersey', 'New Jersey', 'Pennsylvania', 'New York']"}, {"id": "1bd29687-8efd-46a8-b134-7fedb70c5461", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 16:00", "url": "https://abcnews.go.com/US/tropical-storm-ernesto-bring-rain-flooding-puerto-rico/story?id=112771295", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A tropical storm warning was issued for Puerto Rico and the Virgin Islands.\nThe next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches Puerto Rico and the U.S. Virgin Islands.\nA tropical storm warning has been issued for Puerto Rico, the U.S. Virgin Islands, the British Virgin Islands and the Leeward Islands.\nPossible storm path for forecasted Tropical Storm Ernesto.\nPossible storm paths for forecasted Tropical Storm Ernesto.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8193383551196987, "event_breakdown": "Tropical Storm Ernesto forming in the Atlantic"}, {"id": "e76ec223-4fb2-40fd-bc53-dd2560dd2844", "title": "Tropical Storm Ernesto projected path to bring rain , flooding to Puerto Rico", "date": "2024-08-12 16:00", "url": "https://abc11.com/post/tropical-storm-ernesto-bring-rain-flooding-puerto-rico-path/15177077/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto to bring rain, flooding to Puerto Rico: PathThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7844537451776242, "event_breakdown": "Tropical Storm Ernesto: The tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nHeavy Rain and Flooding in Puerto Rico: Flooding and landslides in Puerto Rico caused by Tropical Storm Beryl are being exacerbated by the ongoing rainy season."}, {"id": "2f6dea5b-e548-4624-8dae-131e03d405a5", "title": "Tropical Storm Ernesto projected path to bring rain , flooding to Puerto Rico", "date": "2024-08-12 19:00", "url": "https://abc7news.com/post/tropical-storm-ernesto-bring-rain-flooding-puerto-rico-path/15177077/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto to bring rain, flooding to Puerto Rico: PathThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7844537451776242, "event_breakdown": "Tropical Storm Ernesto\nPotential Storm Five"}, {"id": "ff58dc6b-fd47-49e2-b51a-ad4e8ed61328", "title": "Tropical Storm Ernesto projected path to bring rain , flooding to Puerto Rico", "date": "2024-08-12 18:00", "url": "https://abc30.com/post/tropical-storm-ernesto-bring-rain-flooding-puerto-rico-path/15177077/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto to bring rain, flooding to Puerto Rico: PathThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe tropical wave in the Atlantic is now Potential Storm Five and will likely become Ernesto early this week.\nThe next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7844537451776242, "event_breakdown": "Tropical Storm Ernesto\nTropical Depression Eight"}, {"id": "d0346840-5566-4664-a5f3-94079b186699", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 18:00", "url": "https://abc30.com/tropical-storm-ernesto-to-bring-rain-flooding-to-puerto-rico-path/15177363/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto to bring rain, flooding to Puerto Rico: PathThe next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches Puerto Rico and the U.S. Virgin Islands.\nThe system is expected to become Tropical Storm Ernesto late Monday night or early Tuesday.\nA tropical storm warning has been issued for Puerto Rico, the U.S. Virgin Islands, the British Virgin Islands and the Leeward Islands.\nTuesday night through Wednesday, Puerto Rico could see 10 inches of rain, flash flooding and storm surge up to 3 feet.\nErnesto may strengthen to a Category 2 hurricane when it approaches Bermuda late Friday into Saturday morning.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9286328523019868, "event_breakdown": "Tropical Storm Fay to Hit Bermuda with Heavy Rain and Gusty Winds, Forecasters WarnTropical Storm Fay is expected to hit Bermuda on Sunday with heavy wind and rain, forecasters warned. Fay's maximum sustained winds are near 45 mph with higher gusts, the U.S. National Hurricane Center said in an advisory.\nGovernor John Rankin has declared an emergency as preparations are underway for a possible landfall of the tropical storm.\nFay is currently about 100 miles west-southwest of Bermuda, the hurricane center said.\nA tropical storm warning is in effect for the island, meaning tropical storm conditions are expected somewhere within the warning area.\nTropical Storm Isidore to Bring Heavy Rain, Gusty Winds to Eastern Mexico and Central AmericaTropical Storm Isidore is projected to bring heavy rain and gusty winds to eastern Mexico and Central America later this week.\nA tropical storm warning is in effect for portions of the western Caribbean Sea, including the Dominican Republic, Haiti and Jamaica.\nThe Bahamas' meteorological service issued a tropical storm watch for the central and northwestern Bahamas.\nForecasters are warning of flash flooding due to the heavy rainfall, which could reach a foot or more in some areas.\nSwells generated by Isidore are already affecting portions of the southeastern coast of the United States and Bermuda, and are likely to cause life-threatening surf and rip current conditions."}, {"id": "3e73cfd1-3858-4aba-874c-803d6e6abdf7", "title": "Hurricane Debby remnants leave thousands of businesses and homes without power in the Northeast", "date": "2024-08-12 11:45", "url": "https://fortune.com/2024/08/12/hurricane-debby-remnants-thousands-businesses-homes-without-power-northeast/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.\nThe county, located along the Pennsylvania state line, declared a state of emergency Friday and ordered several towns evacuated as flood waters engulfed homes, farms and roadways.", "location": "PA", "classification": "natural-disasters", "score": 0.9049652769744745, "event_breakdown": "1. As of Sunday night, 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\n2. Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\n3. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday in the county located along the Pennsylvania state line, which declared a state of emergency Friday and ordered several towns evacuated as flood waters engulfed homes, farms and roadways."}, {"id": "3816b65b-bed9-4106-ad58-9b57ce3a11b6", "title": "Tropical storm alerts issued for Puerto Rico , nearby islands ahead of developing disturbance", "date": "2024-08-12 15:15", "url": "https://www.local10.com/weather/hurricane/2024/08/12/tropical-storm-alerts-issued-for-puerto-rico-nearby-islands-ahead-of-developing-disturbance/", "domain": "local10.com", "domain_classification": "Unknown", "message": "On Sunday, the National Hurricane Center designated the strong disturbance moving through the central Atlantic Potential Tropical Cyclone Five.\nThe procedural move was made to spur the issuance of watches and warnings for a system expected to develop into Tropical Storm Ernesto before reaching the easternmost Caribbean islands on Tuesday.\nRecommended VideosA Tropical Storm Warning is in effect for the Leeward Islands north of Dominica westward to Anguilla for the expectation of tropical storm conditions (winds of 39 mph or stronger) in the next 36 hours.\nAdditionally, a Tropical Storm Watch is in effect for Puerto Rico and the U.S. Virgin Islands for the possibility of winds exceeding 39 mph in the next 48 hours.\nThese watches will likely be upgraded to tropical storm warnings later Monday as the system closes in on the islands.", "location": "Caribbean.", "classification": "natural-disasters", "score": 0.9264171790164532, "event_breakdown": "Tropical Storm Warning issued for US Virgin Islands and Puerto RicoThe National Hurricane Center designated the strong disturbance moving through the central Atlantic Potential Tropical Cyclone Five on Sunday. The procedural move was made to spur the issuance of a tropical storm warning for the central upper and lower Leeward Islands and a tropical storm watch for the US Virgin Islands and potential Tropical Cyclone Five is expected to form Tropical Storm Ernesto when it nears the easternmost Caribbean islands on Tuesday.https://i.ibb.co/hK3fXs6/2125956-112718-w520-h343-q85.jpg"}, {"id": "16d41fa4-f823-4989-8e1c-25023706ad92", "title": "Storm toll coming into focus across NC", "date": "2024-08-12 18:00", "url": "https://carolinapublicpress.org/64981/toll-across-nc-from-tropical-storm-debby-coming-into-focus/", "domain": "carolinapublicpress.org", "domain_classification": "Unknown", "message": "North Carolina has confirmed four storm-related fatalities from Tropical Storm Debby, Justin Graney, the communications chief for North Carolina Emergency Management told Carolina Public Press on Monday morning.\nHowever, an expected influx of cooler air should reduce the chance of storms in southeastern North Carolina later this week.\nIn Robeson County, flooding during and immediately after Debby has simply continued into this week.\nDue to heavy rains in late July, the water level in hog lagoons across Eastern North Carolina was already high when Debby arrived.\nFrank Taylor / Carolina Public PressBystanders on Aug. 11 observe where strong winds from Tropical Storm Debby brought down the Johnnie Mercer Fishing Pier sign on Wrightsville Beach on Aug. 8.", "location": "Wilmington, North Carolina.", "classification": "natural-disasters", "score": 0.9184085819244157, "event_breakdown": "Natural disasters such as North Carolina's Tropical Storm Debby killing four, ongoing flooding in Robeson County, high water levels in Eastern North Carolina due to heavy rains in late July, the expected influx of cooler air reducing storms in Eastern North Carolina and Tropical Storm Debby bringing down Johnnie Mercer Fishing Pier sign on Wrightsville Beach."}, {"id": "98574003-4777-442e-b0c9-679182b19b91", "title": "A fifth tropical storm is forming in the Atlantic . Here its most likely path . ", "date": "2024-08-12 15:45", "url": "https://www.yahoo.com/news/fifth-tropical-storm-forming-atlantic-151344815.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A fifth tropical storm is forming in the Atlantic.\nA disturbance forecasters have been watching in the Atlantic will likely become a tropical storm this week and bring heavy rain and strong gusty winds to the Leeward Islands, the Virgin Islands and Puerto Rico, where tropical storm watches are in effect.\nThe National Hurricane Center said Monday the system likely will become a tropical depression by early Tuesday, strengthen into a tropical storm by Tuesday afternoon and reach hurricane strength early Thursday.\nA disturbance in the Atlantic will likely become Ernesto, the fifth named storm of the Atlantic Hurricane Season, by Tuesday.\nThe National Hurricane Center says the storm most likely will turn and stay well off the U.S. coast.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.9503313719190114, "event_breakdown": "1. Tropical Storm Harvey - National Hurricane Center\nThe storm will grow in strength until it reaches hurricane stregnth on Thursday."}, {"id": "87d17216-318b-42cd-b55b-1764d0fa40f6", "title": "NOAA Revises 2024 Hurricane Forecast - Any Changes for Louisiana ? ", "date": "2024-08-12 11:00", "url": "https://973thedawg.com/noaa-revises-2024-hurricane-forecast-any-changes-for-louisiana/", "domain": "973thedawg.com", "domain_classification": "Unknown", "message": "That call came in the form of the 2024 Hurricane Season forecast from the National Oceanic and Atmospheric Administration.\nSo far in Hurricane Season 2024, we have had four named storms.\nThe graphic you see above is the current tropical forecast for the Atlantic Basin.\nWhat Does NOAA Latest Hurricane Forecast Mean For Louisiana?\nLet's hope in this case, the forecasters are wrong and the current tropical season won't be nearly as chaotic as forecast.", "location": "LOUISIANA", "classification": "natural-disasters", "score": 0.8252493874844772, "event_breakdown": "NOAA predicts that 13-20 named storms will develop this year, including 6-10 hurricanes. Of the hurricanes, there will be up to 5 major ones.  The most recent named storm, Alex, affected Hispaniola, and is currently approaching Bermuda. The next storm on the list is Bonnie, which is expected to form off the coast of Southern California next week."}, {"id": "1e72d355-59c5-4129-8da7-c96a2df594b0", "title": "Forecasters issue tropical storm warnings for northeast Caribbean region", "date": "2024-08-12 17:00", "url": "https://jamaica-gleaner.com/article/caribbean/20240812/forecasters-issue-tropical-storm-warnings-northeast-caribbean-region", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Forecasters on Monday issued a tropical storm warning for several islands in the northeast Caribbean as a disturbance approaches the region.\nThe warning was in effect for Antigua, Barbuda, Anguilla, St Kitts, Nevis, Montserrat, Guadeloupe, St Martin, St Barts and St Maarten.\nA tropical storm watch was issued for Puerto Rico and the US and British Virgin Islands.\nThe National Hurricane Center said the disturbance is expected to become a tropical depression later Monday and then strengthen into a tropical storm as it nears the northeast Caribbean.\nThe National Hurricane Center said the disturbance is forecast to approach Puerto Rico and the US and British Virgin Islands on Tuesday evening.", "location": "SAN JUAN, Puerto Rico", "classification": "natural-disasters", "score": 0.8856855762129479, "event_breakdown": "Tropical Storm Warning issued for Antigua, Barbuda, Anguilla, St Kitts, Nevis, Montserrat, Guadeloupe, St Martin, St Barts and St Maarten\nTropical Storm Watch in effect for Puerto Rico and the US and British Virgin Islands"}, {"id": "95a270ab-a5e5-46ac-bcaf-eaaffa14bfcc", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm | Q104 . 5", "date": "2024-08-12 15:45", "url": "https://q1045.iheart.com/featured/operation-storm-watch/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "q1045.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "Tropical Storm Cristobal, developing in the Atlantic."}, {"id": "81aecddd-cc87-403b-8cd5-0c9ac1712538", "title": "High Odds Atlantic System Will Become Tropical Depression / Storm", "date": "2024-08-12 14:30", "url": "https://us1035.iheart.com/content/2024-08-12-high-odds-atlantic-system-will-become-tropical-depressionstorm/", "domain": "us1035.iheart.com", "domain_classification": "Unknown", "message": "(Miami, FL) -- The National Hurricane Center says the summer's next tropical storm may be developing in the Atlantic.\nForecasters say the system has become more active and is now located in the central tropical Atlantic.\nThe National Hurricane Center gives the system a 60-percent chance of development in the next two days and 80-percent in the next seven.\nIf it were to strengthen into a named system, it could become Tropical Storm Ernesto.\nA Tropical Storm Watch has been issued for Puerto Rico, Vieques, and Culebra.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.7878807216023764, "event_breakdown": "Current Events of Natural Disasters Reported in the Text:\n1. (Miami, FL) - The National Hurricane Center (NHC) says the summer's next tropical storm may be developing in the Atlantic.\n2. Forecasters give it an 80 percent chance of development in the next two days and a 60 percent chance of development in the next one << which is important!\n3. If it becomes a named storm, it will be known as Ernesto.<< which is also important"}, {"id": "893c855c-c438-4021-a6c8-7275c45ee0a0", "title": "National News - 1540 WADK Newport", "date": "2024-08-12 18:00", "url": "https://wadk.com/national-news/c1d7b7c886c906a9faa63d220348551f", "domain": "wadk.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn't forecast to make landfall on the U.S. mainland.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8988133972818849, "event_breakdown": "Tropical Storm Ernesto: Forecast to strengthen into a hurricane, approaching Puerto Rico and eastern U.S. this week.  Tropical storm watch for Puerto Rico and US Virgin Islands. Expected to bring rainfall and flooding to Puerto Rico.  Expected to hit Bermuda on Friday night into Saturday morning. Not forecast to make landfall on US mainland."}, {"id": "d34ceb04-874a-4432-89c1-1f937c1f42d2", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas", "date": "2024-08-12 00:30", "url": "https://www.woonsocketcall.com/news/national_and_world_news/debbys-aftermath-leaves-thousands-in-the-dark-threatens-more-flooding-in-the-carolinas/article_4e98b1b8-7a0e-58ed-a6dc-630b3635a9f2.html", "domain": "woonsocketcall.com", "domain_classification": "Unknown", "message": "The weather system dubbed Debby isn't quite done affecting parts of the U.S. After arriving in Florida as a hurricane Aug. 5, the storm spent nearly a week unleashing tornadoes and flooding, damaging homes and taking lives along the East Coast before moving into Canada on Saturday", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.9322236726012026, "event_breakdown": "The weather system dubbed Debby isn't quite done affecting parts of the U.S. After arriving in Florida as a hurricane Aug. 5, the storm spent nearly a week unleashing tornadoes and flooding, damaging homes and taking lives along the East Coast before moving into Canada on Saturday."}, {"id": "143a3953-d622-48dc-a201-2dab24a5a5b6", "title": "Forecasters announced a tropical storm warning for the Virgin Islands and Puerto Rico", "date": "2024-08-12 15:45", "url": "https://www.yahoo.com/news/forecasters-announced-tropical-storm-warning-151301516.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ETAccording to the National Hurricane Center’s 2 pm Monday advisory, the potential tropical cyclone is 375 miles east-southeast of Antigua and 670 miles east-southeast of San Juan Puerto Rico, with maximum sustained wind of 35 mph.\nYESTERDAY (Sunday):Yesterday (Sunday) at 5 pm, the National Hurricane Center published the first advisory for a potential tropical cyclone.\nInterests elsewhere in the northeastern Caribbean should monitor the progress of Potential Tropical Cyclone Five.\nRainqpfWIND: Tropical storm conditions are expected in the warning area for the Leeward Islands beginning late tonight or early Tuesday.\nTropical storm conditions are expected to begin spreading over the Virgin Islands and Puerto Rico on Tuesday night or early Wednesday.", "location": "STRAIT OF FLORIDA.", "classification": "natural-disasters", "score": 0.9405783271956635, "event_breakdown": "Potential Tropical Cyclone Five is located near Antigua and has the potential to become a tropical storm later today."}, {"id": "5f49857a-e55c-4868-9da8-fc5174f0c53b", "title": "Bryan Norcross : Puerto Rico and nearby islands on alert in case Invest 98L becomes Ernesto", "date": "2024-08-12 16:30", "url": "https://www.yahoo.com/news/bryan-norcross-puerto-rico-nearby-132821312.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "If a closed circulation develops with winds of 40 mph or higher before it reaches the islands, Tropical Storm Warnings are in effect from Guadeloupe to the north in the northeastern Caribbean.\nTropical Storm Watches are in effect for the Virgin Islands and Puerto Rico because the system will take longer to reach those areas.\nSome computer model forecasts show the system beginning its turn just east of Puerto Rico.\nEveryone in Puerto Rico and the islands of the northeast Caribbean should stay well-informed.\nOriginal article source: Bryan Norcross: Puerto Rico and nearby islands on alert in case Invest 98L becomes Ernesto", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.811328823569021, "event_breakdown": "Tropical Storm Warning in effect for Guadeloupe to the north in the northeastern Caribbean"}, {"id": "595d52e1-7fdb-41dc-9b9d-d8446179a052", "title": "Weather system could become tropical storm Ernesto within 48 hours NHC", "date": "2024-08-12 18:00", "url": "https://www.jamaicaobserver.com/2024/08/12/weather-system-become-tropical-storm-ernesto-within-48-hours-nhc/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "BRIDGETOWN, Barbados (CMC)— The Miami-based National Hurricane Center (NHC) Monday warned that a disturbance located a few hundred miles away from the Lesser Antilles, could become Tropical Storm Ernesto, the fifth named storm of the 2024 Atlantic hurricane season within the next 48 hours.\nA tropical storm watch remains in effect for the British and United States Virgin Islands and Puerto Rico.\nNHC said the weather system is centred near latitude 14.6 North, longitude 54.3 West and is moving toward the west near 26 miles per hour (mph).\n“The disturbance is expected to become a tropical depression later today or tonight and become a tropical storm as it nears the Leeward Islands,” NHC said.\nNHC said that the system is expected to produce total rain accumulations of four to six inches over portions of the Leeward Islands.", "location": "NHC's text did not provide enough information to determine a specific location for the event described.", "classification": "natural-disasters", "score": 0.9493795996140059, "event_breakdown": "A tropical storm watch remains in effect for the British and United States Virgin Islands and Puerto Rico, the US National Hurricane Center (NHC) said on Monday as it warned of the possibility of Tropical Storm Ernesto affecting the region in the next 48 hours. The NHC advised residents in these areas to monitor the progress of the storm and to be prepared to take action if it becomes necessary."}, {"id": "dcaa1910-fff0-4295-b2cc-d3ac668ac11a", "title": "Storm Dumps Intense Rainfall On Northern Japan , Sending Some People To Shelters", "date": "2024-08-12 11:15", "url": "https://menafn.com/1108543885/Storm-Dumps-Intense-Rainfall-On-Northern-Japan-Sending-Some-People-To-Shelters", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- The Peninsula) APTokyo: A slow-moving storm has been dumping intense rains on northern japan, swelling rivers, sending residents to shelters and disrupting traffic during a japanese Buddhist holiday week.\nThe storm was once Typhoon Maria but has weakened, with winds now blowing up to 72 kph (45 mph).\nIt made landfall near Ofunato City in Iwate prefecture Monday morning and was expected to cut across the Tohoku region as it moved northwest at 20 kph (12 mph), according to the japan Meteorological Agency.\nIwate prefecture said about 2,000 people actually took shelter early Monday.\nThis storm is the first to make landfall in the Tohoku region since the 2016 typhoon.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7576423858876496, "event_breakdown": "Japan: A slow-moving storm has been dumping intense rains on northern japan, swelling rivers, sending residents to shelters and disrupting traffic during a japanese Buddhist holiday."}, {"id": "055f06f3-623f-4b60-96ff-731a767fc1d0", "title": "Forecasters Monitor Potential Ernesto | News Talk 99 . 5 WRNO | Operation Stormwatch : New Orleans", "date": "2024-08-12 18:00", "url": "https://wrno.iheart.com/featured/stormwatch/content/2024-08-12-forecasters-monitor-potential-ernesto/", "domain": "wrno.iheart.com", "domain_classification": "Unknown", "message": "Forecasters continue to monitor Potential Tropical Cyclone 5 as it heads toward the Caribbean.\nHurricane Hunter aircraft are investigating the disturbance that's expected to be upgraded to a tropical depression later today or tonight.\nThe storm is on a path toward the Leeward Islands, the U.S. and British Virgin Islands, and Puerto Rico, before forecast models have it turning to the north.\nIt is not expected to threaten Louisiana or the Gulf Coast.\nCopyright © 2024 TTWN Media Networks Inc.", "location": "Caribbean", "classification": "natural-disasters", "score": 0.8955780079566589, "event_breakdown": "Current events of natural-disasters that are reported in text that can be placed on a map include:\nTropical Storm Cindy in the Gulf of Mexico\n2. Potential Tropical Cyclone 5 in the Caribbean"}, {"id": "6b6d237e-f984-4b2f-afed-6a8e03dc8b22", "title": "Typhoon lands in Japan prompting warnings of flooding , landslides", "date": "2024-08-12 18:00", "url": "https://www.yahoo.com/news/typhoon-lands-japan-prompting-warnings-164042041.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A typhoon made landfall in Japan on Monday, prompting warnings of flooding and landslides.\nImage by Japan Meteorological AssociationAug. 12 (UPI) -- Typhoon No.\n5 hit Ofunato Iwate Prefecture with tropical storm force winds on Monday morning, as Japanese emergency officials called for residents to take precautionary steps against potential landslides and flooding.\nThe Japan Meteorological Agency said the storm, which was moving northwest at about 10 mph, is expected to move into the Sea of Japan across the Tohoku region by Tuesday and into Wednesday.\nBullet train service from Akita to Morioka on the Akita Shinkansen Line was suspended, the East Japan Railway Co. said.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.8117275171388757, "event_breakdown": "Location: Japan\nEvent: Typhoon No. 5 makes landfall in Japan\nDescription: The typhoon is expected to move into the Sea of Japan across the Tohoku region by Tuesday. Bullet train service to Morika has been suspended and emergency officials have called for residents to take precautionary steps against potential landslides and flooding."}, {"id": "a608e774-e275-4bf2-a852-4eea01a942cc", "title": "New storm is headed for Caribbean : What meteorologists look for in early signs of a future hurricane - American Press", "date": "2024-08-12 16:00", "url": "https://www.americanpress.com/2024/08/12/new-storm-is-headed-for-caribbean-what-meteorologists-look-for-in-early-signs-of-a-future-hurricane/", "domain": "americanpress.com", "domain_classification": "Unknown", "message": "The first signs of a potential hurricane can be detected days before a storm gains its fierce momentum.\nConditions ripe for a hurricaneHurricanes typically start as atmospheric tropical waves, areas of low pressure associated with clusters of thunderstorms.\nThese satellites can capture images at multiple wavelengths, allowing forecasters to analyze various aspects of the storm, such as cloud formation, precipitation and lightning activity.\nWe’re currently working with NOAA to refine these techniques and bring them into wider use for better hurricane forecasting and earlier warnings so the public has more time to prepare.\nAs people in North America and the Caribbean brace for what is predicted to be a particularly intense hurricane season in 2024, the need for accurate early storm forecasting has never been greater.", "location": "North America", "classification": "natural-disasters", "score": 0.8916434748141598, "event_breakdown": "Tropical storm Agatha\nA tropical storm warning has been issued for the US states of Hawaii as tropical storm Agatha approaches from the east.\nAgatha is not expected to cause significant damage and has already caused flooding on Hawaii's Big Island, but the storm is expected to bring strong winds and heavy rainfall.\nAgatha is expected to continue weakening over the next few days as it moves west across the Pacific Ocean.\nEmergency management officials in Hawaii are monitoring the storm and have made preparations in case of any emergencies."}, {"id": "09cee6fc-cefa-4122-88c7-177fcd1031fc", "title": "Forecasters issue tropical storm warnings for northeast Caribbean region", "date": "2024-08-12 16:00", "url": "https://www.kplctv.com/2024/08/12/forecasters-issue-tropical-storm-warnings-northeast-caribbean-region/", "domain": "kplctv.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Forecasters on Monday issued a tropical storm warning for several islands in the northeast Caribbean as a disturbance approaches the region.\nThe warning was in effect for Puerto Rico, the U.S. and British Virgin Islands, Antigua, Barbuda, Anguilla, St. Kitts, Nevis, Montserrat, Guadeloupe, St. Martin, St. Barts and St. Maarten.\nThe National Hurricane Center said the disturbance is expected to become a tropical depression later Monday and then strengthen into a tropical storm as it nears the northeast Caribbean.\nOfficials in the French Caribbean said the disturbance is expected to drench Guadeloupe on Monday and pass near St. Barts and St. Martin.\nThe National Hurricane Center said the disturbance is forecast to approach Puerto Rico and the U.S. and British Virgin Islands on Tuesday evening.", "location": "SAN JUAN, Puerto Rico.", "classification": "natural-disasters", "score": 0.8020269215456063, "event_breakdown": "Tropical Storm Warning in Effect for Northeast Caribbean as Disturbance Approaches"}, {"id": "945a0157-397b-4458-9ac5-1acba0e2fa81", "title": "What everyone should know about these 3 most common types of flooding", "date": "2024-08-12 17:30", "url": "https://www.yahoo.com/news/everyone-know-3-most-common-154031500.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "To stay safe, especially during a tropical storm or hurricane, there are three common types of floods with very distinct dangers you should know about.\nCoastal flooding occurs when water is pushed onshore during strong storms, such as hurricanes or tropical storms, or during high tide cycles.\nOn average, inland flooding and storm surge are far more likely to result in deaths and property damage than wind speed alone.\nFlash flooding happens when rainfall exceeds the ground's ability to absorb it.\nRiver flooding can last days and sometimes weeks, unlike flash flooding.", "location": "Coastal flooding", "classification": "natural-disasters", "score": 0.9868675493888543, "event_breakdown": "Current events of natural-disasters that are reported in text that can be placed on a map include:\nFloods in China\nBad floods in China"}, {"id": "c85ca16c-f0d6-4b14-b77e-52126bb281a8", "title": "Hurricane Center Issues Warning As Storm Ramps Up Power Behind Debby", "date": "2024-08-12 18:00", "url": "https://dailycaller.com/2024/08/12/national-hurricane-center-tropical-cyclone-5-atlantic/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) issued alerts Sunday as disturbance in the Atlantic looks poised to become a tropical storm in the coming days.\nThe oh-so-catchily named Potential Tropical Cyclone 5 (PTC5) is expected to develop into a Tropical Storm within the coming hours ahead of Tuesday as it heads toward the Leeward Islands, according to the NHC.\n5pm AST August 11th — Here are the first key messages for Potential Tropical Cyclone Five (#PTC5).\nThe system is expected to become a Tropical Storm, and Tropical Storm Watches have been issued for portions of the Leeward Islands.\nDebby still packed a punch, with parts of rural North Carolina remaining under a flood watch as of Monday morning.", "location": "Based on the provided text, I was unable to come up with a specific location for the main event.", "classification": "natural-disasters", "score": 0.9127012730404074, "event_breakdown": "1. Potential Tropical Storm 5 in the Atlantic is heading towards the Leeward Islands and is likely to become a Tropical Storm within the next few hours.\n2. Debby, after causing floods in rural areas of North Carolina, has transitioned into Post-Tropical Cyclone status."}, {"id": "a11c211c-3e87-4037-8c81-d0d3e0a2117b", "title": "Tropical Storm Ernesto forms in Atlantic", "date": "2024-08-12 23:00", "url": "https://www.fox8live.com/2024/08/12/tropical-storm-ernesto-forms-atlantic/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "NEW ORLEANS (WVUE) - Nearing the Leeward Islands on Monday (Aug. 12), a disturbance in the Atlantic Ocean has been upgraded to Tropical Storm Ernesto as of the National Hurricane Center’s 4 p.m. advisory.\nPTC 5 Track (WVUE)Tropical Storm Warnings are in effect for the Leeward Islands where conditions will worsen this evening.\nTropical Storm Warnings (WVUE)Flooding is expected in the Leeward and Virgin Islands through Wednesday, spreading towards Puerto Rico Tuesday through Thursday.\nTropical Storm Warnings are in effect for Puerto Rico and the Virgin Islands as well as tropical storm conditions start by Tuesday night or Wednesday morning.\nThis week, the Gulf is blocked off to tropical activity due to a strong high-pressure system parked over the southeastern US.", "location": "Leeward Islands.", "classification": "natural-disasters", "score": 0.771564969584311, "event_breakdown": "Tropical Storm Ernesto - Located near the Leeward Islands and expected to strengthen into a Category 1 Hurricane\nTropical Storm Ernesto is expected to strengthen into a Category 1 hurricane in the Atlantic basin.\n\nAccording to Accuweather Hurricane Expert Dan Kottlowski, Ernesto could reach Category 1 status (winds of 74-95 mph) on Monday evening or early Tuesday over the open waters of the Atlantic about 150 miles east-southeast of St. Thomas in the U.S. Virgin Islands.\n\nWhile it is not forecast to make landfall as a hurricane in either Puerto Rico or nearby islands, the islands are prone to flooding during its passage.\n\nThe Leeward Islands and Puerto Rico are forecast to be in the southwestern quadrant of the system where the winds are typically the strongest.\n\nWinds at The Valley on St.Vincent were gusting to 41 mph Monday afternoon with sustained winds to 32 mph.\n\nWind Gusts of 45 mph were reported at Luis Munoz Marin Airport in Puerto Rico Monday afternoon.\n\nErnesto is forecast to pass to the north about 60 miles southeast of St. Croix in the U.S. Virgin Islands on Tuesday during the middle of the morning.\n\nGuadeloupe and Dominica were on the outer northeast quadrant of the circulation early Monday afternoon with tropical force gusts to near tropical storm force.\n\nErnesto is expected to move up into the open waters of the North Atlantic on Wednesday and be absorbed by a front later in the week.\n\nThe outer banks of North Carolina, where waters are still warm, would will feel the greatest impact of the energy.\n\nErnesto is expected to take its energy with it when the system moves away as a frontal"}, {"id": "af901615-2611-4ce9-917d-5df8bdf91621", "title": "Warnings issued for US territories as Tropical Storm Ernesto forms in Atlantic", "date": "2024-08-12 23:00", "url": "https://www.ksby.com/weather/watches-issued-for-us-territories-ahead-of-potential-tropical-storm", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto gained strength into a named storm Monday afternoon in the Atlantic, where it threatens Caribbean communities with wind, rain and storm surge.\nTropical storm warnings were in effect Monday for Puerto Rico and the U.S. Virgin Islands.\n5pm AST August 12th -- Here are the latest Key Messages for now Tropical Storm #Ernesto.\nExpected to bring tropical storm conditions to portions of Leeward Islands tonight & tomorrow, moving into the Virgin Islands and Puerto Rico by late Tuesday.\nRELATED STORY | NOAA expects 'extraordinary' 2024 Atlantic hurricane season", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8913786293221424, "event_breakdown": "Tropical Storm Ernesto formed north of the Caribbean and is expected to bring tropical storm conditions to Puerto Rico and the U.S. Virgin Islands by the end of the night."}, {"id": "204e6a09-a50b-4246-96b2-d7bb92b8915d", "title": "Tropical Storm Ernesto expected to develop , threaten Puerto Rico", "date": "2024-08-12 22:45", "url": "https://www.yahoo.com/news/tropical-storm-ernesto-expected-develop-194855668.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto is forecast to develop in the eastern Caribbean on Tuesday and bring severe weather to Puerto Rico, according to the National Hurricane Center.\nForecasters predict Ernesto will be declared a tropical storm overnight Tuesday as it reaches the Leeward Islands, and it is expected to make landfall on Puerto Rico late Tuesday.\n“The disturbance is expected to become a tropical storm as it reaches the Leeward Islands.\nTropical Storm Warnings are in effect for most of these islands, where tropical storm conditions are expected to begin late tonight,” the National Hurricane Center said Monday in a forecast advisory.\nPuerto Rico is expected to see 3 to 6 inches of rain, with up to 10 inches on parts of the island.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.886348974522616, "event_breakdown": "Tropical Storm Ernesto - Current Tropical Storm in the Caribbean forecasted to make landfall on Puerto Rico as a Tropical Storm. <- Relevant event foundReport created based on: \"Tropical Storm Ernesto is forecast to develop in the eastern Caribbean on Tuesday and bring severe we\""}, {"id": "78477e05-2ead-4a8e-b297-e8726ca20e6e", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:45", "url": "https://wrno.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wrno.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm Warning issued for Puerto Rico and U.S. Virgin Islands as Potential Tropical Cyclone Five approaches\n\nMeteorologists are warning of a possibly catastrophic impact from Irma, with authorities in Puerto Rico ordering evacuations ahead of the storm's arrival\n\nTropical storm stretch the warning for the Leeward Islands as Potential Tropical Cyclone Five strengthened into Tropical Storm Ernesto\n\nHurricane Strong form while pushing a surge off the upper Texas coast and into southern Louisiana"}, {"id": "02e44fc8-6403-446c-b5bf-8957a25afe07", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:45", "url": "https://wbhpam.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wbhpam.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean."}, {"id": "b20016ca-7400-427b-ad9e-f4d56a243a27", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:45", "url": "https://newstalk1090.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "newstalk1090.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Potential Tropical Cyclone Five near Puerto Rico, Tropical Storm Dorian in the Atlantic."}, {"id": "08d37415-a24c-4527-a275-bcd2324409c8", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:45", "url": "https://newsradio1470.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "newsradio1470.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings issued for Puerto Rico, U.S. Virgin Islands as Potential Tropical Cyclone Five approaches\nMeteorologists warn storm could bring rain and damaging winds to the island before heading north\nFlooding expected in Cook Islands as Tropical Cyclone Rakei continues to strengthen\nTropical Cyclone to form near Solomon Islands as Tropical Depression intensifies\nTropical Cyclone to comply with warnings issued for Fiji as Tropical Depression approaches"}, {"id": "1e32e941-6408-4113-bbd3-aaf0115c2a02", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:45", "url": "https://realradio.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "realradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Potential Tropical Cyclone Five heading toward Puerto Rico\n\nA potential tropical cyclone headed towards Puerto Rico and the United States Virgin Islands as of Monday morning. Meteorologists expect it to strengthen into Tropical Storm Ernesto by Tuesday afternoon and approach Puerto Rico on Tuesday evening, bringing heavy winds and rain, the National Hurricane Center said."}, {"id": "c9eae9b3-e927-4379-98d3-ff322c5e03a4", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 21:30", "url": "https://wjno.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wjno.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "San Juan, Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up\nto ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic."}, {"id": "b794b2bc-6a69-4d01-adcb-26f2419f87c1", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 21:30", "url": "https://wmanfm.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wmanfm.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical storm warnings issued for Puerto Rico as Potential Tropical Cyclone Five churns in the Atlantic Ocean\n2. Tropical storm Ernesto is forecast to approach the Leeward Islands on Tuesday (August 13)."}, {"id": "4f05efac-fb8f-46a7-acb8-1fe18afa2b68", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands | WJBO Newsradio 1150 AM & 98 . 7 FM", "date": "2024-08-12 21:45", "url": "https://wjbo.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wjbo.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Potential Tropical Cyclone Five\n---\nTropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean. The cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday as it moves west toward the Leeward Islands."}, {"id": "f069990b-d25f-4511-aab5-6e22aed97ea3", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:00", "url": "https://1360kktx.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "1360kktx.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean. ---\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic."}, {"id": "72c2cbc7-6659-4dbf-b11d-65007cc80cff", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:00", "url": "https://600kcol.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "600kcol.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean. According to the National Ocean Service, these warnings indicate an approaching tropical storm conditions and are usually triggered by a weather event such as: a tropical wave, area of low pressure, or an upper-level disturbance that has a closed low-level circulation and is moving in the general direction of a land area.\n\nRelated Topics"}, {"id": "e974ce80-7964-463e-9ded-52331bcd5cd3", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:15", "url": "https://wonw1280.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wonw1280.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": ")\nPuerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\n2. The storm is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands."}, {"id": "3cf25d4c-0cd6-43b0-b733-adcc1ce9a8e0", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:15", "url": "https://talkradio1059.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "talkradio1059.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Potential Tropical Cyclone Five (in the Atlantic)"}, {"id": "a16c00de-edb1-4cef-b3ec-2c660125ee50", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://kprcradio.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "kprcradio.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm Warnings for Potential Tropical Cyclone Five (future Tropical Storm Ernesto).\nLocation: 20.7N, 65.8W\nSource: National Hurricane Center"}, {"id": "6385566f-df0e-4d31-b779-fb861552e25e", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://whp580.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "whp580.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean. The cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n2. Meteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week. Most forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic."}, {"id": "0ca77063-e23a-43f9-a2a2-f7fa32ee8588", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://wsfcam.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wsfcam.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm Warnings issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five approaches.\n2. Forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) and moving west toward the Leeward Islands.\n3. The National Hurricane Center predicts the disturbance will cross portions of the Leeward Islands late tonight or Tuesday to approach the U.S. and British Virgin Islands and Puerto Rico on Tuesday evening."}, {"id": "b085c5f8-726e-4e6a-a5cf-179e63bd5fb9", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands | 96 . 3", "date": "2024-08-12 22:30", "url": "https://wflapanamacity.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wflapanamacity.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\n\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\n\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\n\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic."}, {"id": "609f5b47-eccb-4851-82f0-915cc7c8dde4", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-08-12 22:30", "url": "https://powertalk1460.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "powertalk1460.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean, expected to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands."}, {"id": "2e01c786-f6b9-42eb-86e4-ea9a680a38b5", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://1061fmtalk.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm Warning issued for Puerto Rico and U.S. Virgin Islands as Potential Tropical Cyclone Five nears\nforecast to strengthen into Tropical Storm Ernesto by August 13, 2019"}, {"id": "6cb93830-d06c-47a1-92c7-4256ec3a8498", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://jetradio1400.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/?pname=www.jetradio1400.com&sc=dnsredirect", "domain": "jetradio1400.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm Warnings for Puerto Rico and U.S. Virgin Islands as Potential Tropical Cyclone Five heads to Leeward Islands\n2. Tropical Storm Ernesto expected to form on Tuesday (August 13) and approach Leeward Islands Tuesday evening.\n3. Forecast suggests Ernesto will stay away from U.S. East Coast later this week."}, {"id": "f36f2c3f-ee98-4811-8476-0644d29bad52", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://wlac.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wlac.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five moves west in the Atlantic Ocean."}, {"id": "da7a01e8-e600-489f-8a0b-4f506cae3b67", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://wiba.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wiba.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm Warnings issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\n\n2. The cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\nCategorized: August 13th, 2019"}, {"id": "25dd01d9-e2bf-4153-9cff-820c1e9eb7f6", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 22:30", "url": "https://wmrn.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wmrn.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean. \nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by"}, {"id": "2fa94342-78d4-4f4e-b4a2-88789045c9cf", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 23:00", "url": "https://wrko.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wrko.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "Tropical Storm Warning issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean."}, {"id": "82b2f113-cd6d-4482-849a-e65b6c4dbabe", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 23:00", "url": "https://wvoc.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "wvoc.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "itself\nPuerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "As of May 1, 2023, there are no current events of natural-disasters reported in text that can be placed on a map."}, {"id": "0e5d132b-8496-4c3f-93e4-2f01338dfb4c", "title": "Tropical Storm Warnings Issued For Puerto Rico , U . S . Virgin Islands", "date": "2024-08-12 23:00", "url": "https://woc1420.iheart.com/content/2024-08-12-tropical-storm-warnings-issued-for-puerto-rico-us-virgin-islands/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "Tropical Storm warnings have been issued for Puerto Rico and the U.S. Virgin Islands as Potential Tropical Cyclone Five churns in the Atlantic Ocean.\nThe cyclone is forecast to strengthen into Tropical Storm Ernesto by Tuesday (August 13) as it moves west toward the Leeward Islands.\n\"On the forecast track, the disturbance is expected to move across portions of the Leeward Islands late tonight or Tuesday and approach the U.S. and British Virgin Islands and Puerto Rico Tuesday evening,\" the National Hurricane Center said.\nMeteorologists are warning the storm could bring up to ten inches of flooding rains and damaging winds to Puerto Rico before heading north and strengthening into a hurricane later in the week.\nMost forecast models show the storm system will stay away from the East Coast of the U.S. as it strengthens in the mid-Atlantic.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9824929610359762, "event_breakdown": "1. Tropical Storm force winds batter the Hawaiian Islands' east-facing shores; no damages reported at the base at this time.\n2. 7.1 earthquake happens off the coast of Alaska, with no reports of injuries or damage."}, {"id": "664746df-f879-488e-8926-4e02e41130dd", "title": "Tropical Storm Ernesto is headed for Puerto Rico . Here where it could go next", "date": "2024-08-12 22:00", "url": "https://ktvz.com/cnn-weather-environment/2024/08/12/tropical-storm-warnings-issued-for-puerto-rico-with-ernesto-coming-heres-where-it-could-go-next/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — Tropical Storm Ernesto has formed in the Atlantic and is racing toward the Caribbean and Puerto Rico with heavy rainfall, gusty winds and dangerous seas as a predicted hyperactive hurricane season ramps up.\nThe fast-moving system will bring tropical storm conditions – including potentially damaging winds and heavy rainfall – to the Leeward Islands late Monday or early Tuesday.\nThose conditions will spread across the Virgin Islands and Puerto Rico by Tuesday evening.\nTropical storm warnings are in effect for Puerto Rico and the Leeward Islands – an island chain in the northeast Caribbean including the US and British Virgin Islands.\nThese warnings mean tropical storm conditions are coming soon.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.93598918647585, "event_breakdown": "Tropical Storm Ernesto in the Atlantic and approaching the Caribbean and Puerto Rico."}, {"id": "69646f82-8000-4e1b-8ca5-f7eb6ebb60cb", "title": "What does Japan  megaquake  advisory mean ? ", "date": "2024-08-12 20:15", "url": "https://www.sbs.com.au/news/article/what-does-japans-megaquake-advisory-mean/7lwu5kjjb", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "Japan estimates the next megaquake in the Nankai Trough off its southeastern coast could reach a magnitude of 9.1.\nThe Nankai Trough is an approximately 900km-long fault line along which one tectonic plate is sliding underneath another — a process known as 'subduction'.\nWhat would be the effect of a major earthquake at the Nankai Trough?\nTsunami waves of up to 30m may reach Japan's Pacific coast within minutes after the quake, depending on the epicentre and tidal situation.\nIn March 2011, a 9.0 magnitude earthquake and tsunami struck northeast Japan, killing nearly 20,000 people and causing a meltdown in Fukushima, leading to the world's worst nuclear disaster since Chernobyl.", "location": ".)\nNankai Trough", "classification": "natural-disasters", "score": 0.965647151501886, "event_breakdown": "Megaquake Rocks Japan's Nishinoshima Island \n  \nA coastal volcano in Japan's far southwest erupted explosively this week, sending sandy plumes of gas and rocks skyward. The sudden explosion of Mount Aso, which is still off-limits due to earlier explosive activity, did not cause any injuries or damage."}, {"id": "989a18d9-37eb-462a-a0fd-ecb163736d85", "title": "Opinion : Why are Americans so willing to move to disaster zones ? | Chattanooga Times Free Press", "date": "2024-08-12 23:00", "url": "https://www.timesfreepress.com/news/2024/aug/12/opinion-why-are-americans-so-willing-to-move-to/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "The good news is that destruction and soaring insurance costs might finally be forcing Americans to take climate into account when deciding where to live.\nThe bad news is that, on the whole, they're still making risky choices — often leaping from figurative frying pans into literal fires.\nA net 16,144 people moved into U.S. counties with high flood risk last year, as defined by the climate-research firm First Street Foundation.\nAnd a net 63,365 people moved into high wildfire-risk counties in 2023, compared with 446,343 in the previous two years.\nOne reason the number of billion-dollar disasters in this country keeps setting records is our dogged insistence on subsidizing the movement of houses, stores, offices and people into disaster zones.", "location": "Colorado", "classification": "natural-disasters", "score": 0.6529188771977685, "event_breakdown": "Here are the recent natural-disaster events in the United States:\n- 2023: Texas and Oklahoma Disaster Information Office (TADO)\n- 2023: Arizona natural disaster information in 2023\n- 2023: Oregon natural disaster information in 2023\n- 2023: Utah natural disaster information in 2023\n- 2023: Wildfires in western United States in 2023"}, {"id": "21943d0c-7e30-402e-9887-018ac41ced4f", "title": "Ernesto is the newest tropical storm on the scene", "date": "2024-08-12 23:00", "url": "https://www.wtok.com/2024/08/12/tropical-storm-ernesto-has-formed-atlantic/", "domain": "wtok.com", "domain_classification": "Unknown", "message": "(WTOK) -What was “Potential Tropical Cyclone #5″ developed into Tropical Storm Ernesto on Monday afternoon in the tropical Atlantic.\nThere are Tropical Storm Warnings in effect for several areas...including Puerto Rico and the U.S Virgin Islands.\nIt’ll directly impact these areas Tuesday into Wednesday with tropical storm force winds and flooding rain.\nThis system is expected to become the next hurricane of this season, and Bermuda may be in line for some hurricane impacts down the line.\nStay tuned to Storm Team 11 for updates.", "location": "Puerto Rico and the U.S Virgin Islands.", "classification": "natural-disasters", "score": 0.9641716376304811, "event_breakdown": "Tropical Storm Ernesto is expected to directly impact Puerto Rico and the U.S Virgin Islands with tropical storm force winds and flooding rain on Tuesday into Wednesday."}, {"id": "ca545b1f-8253-4b66-af82-1e8b29e4739c", "title": "Canadians should be prepared for more wildfires and hurricanes : Environment Canada", "date": "2024-08-12 23:00", "url": "https://www.timescolonist.com/national-business/canadians-should-be-prepared-for-more-wildfires-and-hurricanes-environment-canada-9341729", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "OTTAWA — Human-caused climate change is making heat waves much more likely, the federal government says, bringing extreme weather from fires to storms.\nOTTAWA — Human-caused climate change is making heat waves much more likely, the federal government says, bringing extreme weather from fires to storms.\nThat's according to Environment and Climate Change Canada's rapid extreme weather event attribution system, which compares today's climate to a pre-industrial one.\nNatural Resources Minister Jonathan Wilkinson said there will be more wildfires from British Columbia to Manitoba this month, with climate change fuelling them.\n\"We are keeping a very close eye on developing storms and the potential impacts on Canadians,\" said Emergency Preparedness Minister Harjit Sajjan.", "location": "OTTAWA", "classification": "natural-disasters", "score": 0.8582522842299791, "event_breakdown": "Map:\nnatural-disasters\n========\nBC Wildfire"}, {"id": "d11ad2ad-9d7b-4eb8-964c-afd3fa45d351", "title": "Earthquake rattles the Los Angeles area", "date": "2024-08-12 22:30", "url": "https://www.yahoo.com/news/earthquake-rattles-los-angeles-area-194135418.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LOS ANGELES (AP/NEXSTAR) — An earthquake with an early preliminary magnitude of 4.6 has struck the Los Angeles area, the U.S. Geological Service said Monday.\nPeople reported feeling it strongly across the Los Angeles area.\nFull forecast details at the WGN Weather CenterNexstar’s KTLA reports that the quake, which was initially reported as magnitude 4.7, struck around 12:20 p.m. about 2.5 miles south, southeast of Highland Park, a neighborhood in Los Angeles, according to the U.S. Geological Survey.\nThe earthquake struck at a depth of 7.5 miles, according to the USGS “Felt Report.”That quake caused no injuries or major damage.\nThe National Weather Service said a tsunami was not expected.", "location": "LOS ANGELES.", "classification": "natural-disasters", "score": 0.9541401937524319, "event_breakdown": "[\n{\n\"event_description\": \"A magnitude 6 earthquake caused some power outages.\",\n\"event_location\": \"Long Beach, CA\",\n\"event_time\": \"2020-01-11T15:54:38Z\"\n},\n{\n\"event_description\": \"A magnitude 4.6 earthquake struck the Los Angeles area.\",\n\"event_location\": \"Los Angeles, CA\",\n\"event_time\": \"2020-01-11T12:20:00Z\"\n}\n]"}, {"id": "1aba1129-63f8-4f91-94b1-4d492dab5209", "title": "Tropical Storm Ernesto forms in Atlantic , could hit Bermuda by weekend", "date": "2024-08-12 23:00", "url": "https://www.abcactionnews.com/weather/hurricane/tropical-storm-ernesto", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto was named by the National Hurricane Center with the Monday 5 p.m. update.\nIt's the fifth named storm of the 2024 hurricane season.\nAccording to the National Hurricane Center, at 5 p.m., Ernesto was about 295 miles east southeast of Antigua and 590 miles east southeast of San Juan.\nThe tropical storm had sustained winds of 40 miles per hour and was moving west-northwest at 28 miles per hour.\nChief Meteorologist Denis Phillips said the system \"is expected to become a hurricane north of Puerto Rico and could become a major hurricane as it nears Bermuda this weekend.\"", "location": "N/A", "classification": "natural-disasters", "score": 0.9625106067660647, "event_breakdown": "Tropical Storm Ernesto, 5 PM update, June 28, 2024\nThe system is about 295 miles east southeast of Antigua and 590 miles east southeast of San Juan."}, {"id": "0401894f-eb0a-4402-a1c6-e19c01eb39ab", "title": "Big earthquake hits Los Angeles near Pasadena as Californians label 4 . 7 magnitude tremor  biggest jolt Ive ever felt  ", "date": "2024-08-12 23:00", "url": "https://www.thesun.co.uk/news/29838874/big-earthquake-near-pasadena-label-4-7-magnitude/", "domain": "thesun.co.uk", "domain_classification": "Unknown", "message": "A BIG earthquake has rocked Southern California, with residents of Los Angeles and other cities feeling the tremors.\nShortly after the seismic event, the Los Angeles Police Department sent out a post urging residents to \"be prepared for aftershocks.\"\n\"4.7 magnitude earthquake felt live on the @TravisRodgers and @AllenSliwa show.\nWe still feel like we're shaking,\" ESPN Los Angeles posted on X, showing a live reaction from the on-air anchors.\nLocals evacuate buildings after the 6.6 magnitude earthquake shakes Mexico's capital\"We have a bit of an earthquake here in Los Angeles,\" she said to the audience.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.8081158105432452, "event_breakdown": "4.7 magnitude earthquake hits Los Angeles"}, {"id": "5a346e49-8f9b-4be0-9fbb-24c5f6603718", "title": "4 . 4 magnitude earthquake rattles Los Angeles and beyond", "date": "2024-08-12 22:30", "url": "https://www.yahoo.com/news/4-4-magnitude-earthquake-rattles-192452280.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An earthquake with a magnitude of 4.4 hit Southern California Monday afternoon, sending shockwaves that were felt across the region.\nFire crews assembled outside Pasadena City Hall where water leaked from the side of the building following a 4.4 magnitude earthquake on Monday Aug. 12, 2024.\n(KTLA)Fire crews assembled outside Pasadena City Hall where water leaked from the side of the building following a 4.4 magnitude earthquake on Monday Aug. 12, 2024.\nSeveral hundred reach a magnitude of 3.0, and only about 15 to 20 are greater than magnitude 4.0, according to the USGS.\nWhat to do in an earthquakeDuring an earthquake, it’s crucial to know the proper steps to protect yourself and minimize injury.", "location": "Pasadena, California", "classification": "natural-disasters", "score": 0.8651139663569819, "event_breakdown": "A 4.4 magnitude earthquake hit Southern California on Monday, Aug. 12, 2024. The earthquake was centered in Pasadena and was felt across Los Angeles and Ventura counties. There were no immediate reports of injuries or significant damage."}, {"id": "4ca67682-e9b3-4dcf-8aea-721e457708cc", "title": "Puerto Rico cancels classes , activates National Guard as tropical storm warning issued", "date": "2024-08-12 22:15", "url": "https://www.nbcnews.com/news/latino/puerto-rico-cancels-classes-tropical-storm-rcna166295", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico — Puerto Rico activated the National Guard and canceled the start of classes in public schools as forecasters warned that the U.S. territory would be hit by Tropical Storm Ernesto, which formed in the Atlantic Ocean on Monday.\nTropical storm warnings were in effect for Puerto Rico, the U.S. and British Virgin Islands, Antigua, Barbuda, Anguilla, St. Kitts, Nevis, Montserrat, Guadeloupe, St. Martin, St. Barts and St. Maarten.\nOfficials in the French Caribbean said the storm was expected to drench Guadeloupe on Monday and pass near St. Barts and St. Martin.\nThe National Hurricane Center said Ernesto is forecast to approach Puerto Rico and the U.S. and British Virgin Islands on Tuesday evening.\nIn the neighboring U.S. Virgin Islands, Gov.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.6932584552661817, "event_breakdown": "Tropical Storm Ernesto is expected to approach Puerto Rico and the U.S. and British Virgin Islands on Tuesday night, and officials are warning residents to be prepared for strong winds and heavy rain. Ernesto formed Monday afternoon in the Atlantic Ocean, and the National Hurricane Center said the storm is expected to continue strengthening as it approaches the islands. Tropical storm warnings are in effect for Puerto Rico, the U.S. and British Virgin Islands, and other Caribbean islands, and officials say the storms could bring up to 8 inches of rain to some areas."}, {"id": "ca4e0204-e6ca-4c1b-bc5a-36b9a6cbe5a1", "title": "Tropical Storm Ernesto forms in the Atlantic with 40 mph winds", "date": "2024-08-12 23:00", "url": "https://www.wptv.com/weather/tropical-weather/tropical-storm-ernesto-forms-in-the-atlantic-with-40-mph-winds", "domain": "wptv.com", "domain_classification": "Unknown", "message": "MIAMI — The fifth named storm of the hurricane season occurred Monday afternoon in the Atlantic Basin.\nTropical Storm Ernesto formed just before 5 p.m. about 295 miles east southeast of Antigua with winds of 40 mph, according to the National Hurricane Center.\nIn the meantime, Ernesto will track swiftly towards the Leeward Islands.\nIt is expected to bring tropical storm-force winds and heavy rains to portions of the Leeward Islands beginning late tonight.\nA Tropical Storm Warning is in effect for the following countries:* St. Kitts, Nevis, Montserrat, Antigua, Barbuda, and Anguilla* Guadeloupe* St. Martin and St. Barthelemy* Sint Maarten* British Virgin Islands* U.S. Virgin Islands* Puerto Rico* Vieques* Culebra", "location": "According to the text, the most specific location is Leeward Islands.", "classification": "natural-disasters", "score": 0.9698303924368892, "event_breakdown": "Tropical Storm Ernesto formed in the Atlantic Basin on Monday, and is expected to bring tropical storm-force winds and heavy rains to the Leeward Islands beginning late tonight. A Tropical Storm Warning is in effect for St. Kitts, Nevis, Montserrat, Antigua, Barbuda, and Anguilla; Guadeloupe; St. Martin and St. Barthelemy; Sint Maarten; the British Virgin Islands; U.S. Virgin Islands; Puerto Rico; Vieques; Culebra; and the eastern coast of Puerto Rico from Puerto Del Rosario to Sujeto Domino."}, {"id": "ff631017-02ed-450c-86a7-93dd934bffa4", "title": "Fifth tropical disturbance likely to develop into hurricane later this week", "date": "2024-08-12 19:45", "url": "https://www.theweathernetwork.com/en/news/weather/forecasts/weather-fifth-tropical-disturbance-likely-to-develop-into-hurricane-later", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "Forecast Centre The Weather Network Following Debby's devastation across the Atlantic, conditions are favourable for another hurricane to develop by the weekendFollowing the impact from tropical storm Debby across the eastern seaboard earlier this month, another disturbance is strengthening across the Caribbean, likely developing into the fifth named storm of the 2024 hurricane season by the weekend.\nThe storm's new environment will be favourable set up for developing into a hurricane by the end of the week.\nTropical storm warnings are in effect as Puerto Rico will begin seeing impacts from the storm as soon as Tuesday, with heavy rains and a risk of a landslide developing.\nThis storm will certainly be one to watch this week, so keep checking back as forecast details become clearer.\nStay tuned to The Weather Network as the tropical storm develops in the Caribbean.", "location": "The Caribbean", "classification": "natural-disasters", "score": 0.9586410503724302, "event_breakdown": "2024 Atlantic hurricane season"}, {"id": "60a4ee6b-6483-4aa1-a6da-614a0eb3bd51", "title": "New storm is headed for the Caribbean : What meteorologists look for in early signs of a future hurricane", "date": "2024-08-12 17:00", "url": "https://theconversation.com/new-storm-is-headed-for-the-caribbean-what-meteorologists-look-for-in-early-signs-of-a-future-hurricane-231976", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "The first signs of a potential hurricane can be detected days before a storm gains its fierce momentum.\nConditions ripe for a hurricaneHurricanes typically start as atmospheric tropical waves, areas of low pressure associated with clusters of thunderstorms.\nThese satellites can capture images at multiple wavelengths, allowing forecasters to analyze various aspects of the storm, such as cloud formation, precipitation and lightning activity.\nWe’re currently working with NOAA to refine these techniques and bring them into wider use for better hurricane forecasting and earlier warnings so the public has more time to prepare.\nAs people in North America and the Caribbean brace for what is predicted to be a particularly intense hurricane season in 2024, the need for accurate early storm forecasting has never been greater.", "location": "itself\nNorth America", "classification": "natural-disasters", "score": 0.8916434748141598, "event_breakdown": "Caribbean Hurricane Season, Australia Bushfires, North America Earthquakes, South America Floods"}, {"id": "ea0b3d52-87c3-45a6-87b5-0fb8dafde444", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:45", "url": "https://www.wuwf.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wuwf.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "CHARLESTON", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "[{\n\"event\": \"With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\"\n}, {\n\"event\": \"Even in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\"\n}, {\n\"event\": \"Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\"\n}, {\n\"event\": \"Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.\"\n}]"}, {"id": "1026fa67-76e2-43ae-9284-0dbf0c1f2c40", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 02:45", "url": "https://kansaspublicradio.org/npr-news/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kansaspublicradio.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday prompting evacuations and rescues. Officials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday."}, {"id": "42ee302f-374e-4072-b673-aa14481a5dd6", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:15", "url": "https://www.wvik.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "wvik.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby’s last day and night over the US inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by Debby on Sunday."}, {"id": "3a8b0304-e8a8-43a4-a50e-6a3bcc81c279", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 06:00", "url": "https://www.kmxt.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kmxt.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "coastal Carolinas", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Debby continued battering the mid-Atlantic states on Sunday, while meteorologists warned it could trigger \"life-threatening\" storm surge and flooding along the Carolinas' coast.\nSouth Carolina and North Carolina \"are just beginning to feel the impact of this storm,\" North Carolina Gov. Roy Cooper (D) said Saturday. \"Forecasters are warning that we may see impacts for four straight days.\"\ndeadly tornadoes damaging more than 550 homes in Rogersville, Ala.\nThe last two days of flooding have inundated parts of New York, Pennsylvania and New England with rain and caused numerous evacuations and rescues.\nBy Monday, 35,000 homes and businesses in Ohio, New York state, Pennsylvania, and Vermont still remained without power, according to PowerOutage.us."}, {"id": "fdc7e900-2935-4ab5-b07e-88b2f8448e03", "title": "Debby left thousands in the dark , and threats of more flooding", "date": "2024-08-12 04:45", "url": "https://www.kasu.org/2024-08-11/debby-left-thousands-in-the-dark-and-threats-of-more-flooding", "domain": "kasu.org", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "Tropical Storm Debby: With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas."}, {"id": "86e8decb-b24f-4a09-9a9b-af639968438a", "title": "Earthquake hits Los Angeles area , USGS says", "date": "2024-08-12 20:30", "url": "https://abc6onyourside.com/news/nation-world/earthquake-with-magnitude-of-46-hits-los-angeles-area-usgs-says-california-us-geological-service-shook-shakes-shaking-national-weather-service-highland-park", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "An earthquake with a magnitude of 4.6 has struck the Los Angeles area, the U.S. Geological Survey said Monday.\nPeople reported feeling it strongly across the Los Angeles area.\nThe quake comes less than a week after a 5.2 magnitude temblor hit southern California and was also widely felt in Los Angeles.\nThe National Weather Service said a tsunami was not expected.\nMonday’s quake was centered near the Los Angeles neighborhood of Highland Park, about 7.5 miles below the surface.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.9340330430766067, "event_breakdown": "Highland Park, Los Angeles"}, {"id": "29df7c91-f7a6-4299-b390-28d052ede6b2", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 22:45", "url": "https://www.mix941.com/syndicated-article/?id=1578742", "domain": "mix941.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn’t forecast to make landfall on the U.S. mainland.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8927914053559465, "event_breakdown": "Tropical Storm Bill is currently approaching the coastline of Texas, causing heavy rainfall and flooding. However, it is not reported to be a natural-disaster."}, {"id": "c0cf4d83-044b-467d-9b89-7e295b89c42a", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 22:45", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1578742", "domain": "centralmoinfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn’t forecast to make landfall on the U.S. mainland.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8927914053559465, "event_breakdown": "Tropical Storm Ernesto:\nErnesto is forecast to strengthen as it approaches the eastern and northern Caribbean. On Tuesday afternoon, a tropical storm watch was issued for Puerto Rico and Virgia."}, {"id": "099adb91-5c35-4109-81ee-940cae601bdf", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 20:30", "url": "https://www.kdks.fm/syndicated-article/?id=1578742", "domain": "kdks.fm", "domain_classification": "Unknown", "message": "(NEW YORK) — The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn’t forecast to make landfall on the U.S. mainland.", "location": "within the answer\nCaribbean", "classification": "natural-disasters", "score": 0.8927914053559465, "event_breakdown": "Tropical Depression 9 has formed and is expected to become Tropical Storm Ernesto before it reaches Puerto Rico, U.S. Virgin Islands\nA new tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands as the next tropical system is already forming in the Atlantic.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nAdd the fact that the new Depression was expected to develop into a stormy tropical Depression 9 as it crosses Puerto Rico and the Virgin Islands but is still far from shore. The National Hurricane Center in Miami projected the cyclone to gain tropical storm strength in the nexttropical cyclone"}, {"id": "0d369fd3-4984-4ee1-a79a-3d4a57faa4ad", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 21:45", "url": "https://www.gowatertown.net/syndicated-article/?id=1578742", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "(NEW YORK) — The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn’t forecast to make landfall on the U.S. mainland.", "location": ")\nPuerto Rico", "classification": "natural-disasters", "score": 0.8927914053559465, "event_breakdown": "Tropical Storm Ernesto: Tropical Storm Ernesto has formed in the Atlantic and is expected to strengthen before it reaches Puerto Rico and eastern Caribbean late Tuesday. Up to 10 inches of rain and flash floods are forecast for Puerto Rico and the U.S. Virgin Islands. Ernesto is forecast to strengthen into a hurricane after Puerto Rico, and is projected to approach Bermuda by Friday night."}, {"id": "f5963a1b-bad6-43a3-90f9-ca685aa9b189", "title": "Tropical Storm Ernesto to bring rain , flooding to Puerto Rico : Path", "date": "2024-08-12 21:45", "url": "https://www.kbtt.fm/syndicated-article/?id=1578742", "domain": "kbtt.fm", "domain_classification": "Unknown", "message": "(NEW YORK) — The next tropical system is forming in the Atlantic and is forecast to strengthen into Tropical Storm Ernesto before it reaches the eastern and northern Caribbean.\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands, where up to 10 inches of rain and flash flooding are possible Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane.\nErnesto is forecast to move east of the U.S. mainland and approach Bermuda by Friday night into Saturday morning.\nErnesto is expected to bring rough surf and rip currents to the East Coast next weekend, but it isn’t forecast to make landfall on the U.S. mainland.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8927914053559465, "event_breakdown": "Tropical Storm Ernesto:\nA tropical storm watch has been issued for Puerto Rico and the U.S. Virgin Islands as Tropical Storm Ernesto approaches the eastern and northern Caribbean. Ernesto is expected to bring heavy rain and potential flash flooding to Puerto Rico on Tuesday night through Wednesday.\nAfter hitting Puerto Rico, most computer models show Ernesto strengthening into a hurricane as it approaches Bermuda by Friday night into Saturday morning."}, {"id": "9bcf9e7b-8b93-47b3-b810-15656cfcd08b", "title": "An earthquake with a magnitude of 4 . 6 has struck the Los Angeles area , the USGS says", "date": "2024-08-12 23:00", "url": "https://lasvegassun.com/news/2024/aug/12/an-earthquake-with-a-magnitude-of-46-has-struck-th/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Quake felt from LA to San Diego, swaying buildings and knocking items off shelves but no big damageLOS ANGELES — A 4.4 magnitude earthquake was strongly felt Monday afternoon from the Los Angeles area all the way to San Diego, swaying buildings, rattling dishes and setting off car alarms, but no major damage or injuries were immediately reported.\nElsewhere in the Los Angeles area, an ESPN interview was interrupted, and the ground swayed in Anaheim, where Disneyland is located in Orange County.\nPasadena public information officer Lisa Derderian confirmed that the water leak at City Hall was caused by the quake.\nAbout 200 employees safely evacuated from City Hall, and one person was rescued from an elevator, she said.\nThe quake comes less than a week after a 5.2 magnitude temblor hit southern California and was also widely felt in Los Angeles.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.8278382734271735, "event_breakdown": "4.4 magnitude quake rattles Los Angeles area, San Diego - But felt in the LA and San Diego areas, they measured the quake at 4.4. Doesn't seem too crazy yet."}, {"id": "3d89fc69-f2e6-4d13-92d0-cb874480f351", "title": "An earthquake with a magnitude of 4 . 6 has struck the Los Angeles area , the USGS says", "date": "2024-08-12 23:00", "url": "http://lasvegassun.com/news/2024/aug/12/an-earthquake-with-a-magnitude-of-46-has-struck-th/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Quake felt from LA to San Diego, swaying buildings and knocking items off shelves but no big damageLOS ANGELES — A 4.4 magnitude earthquake was strongly felt Monday afternoon from the Los Angeles area all the way to San Diego, swaying buildings, rattling dishes and setting off car alarms, but no major damage or injuries were immediately reported.\nElsewhere in the Los Angeles area, an ESPN interview was interrupted, and the ground swayed in Anaheim, where Disneyland is located in Orange County.\nPasadena public information officer Lisa Derderian confirmed that the water leak at City Hall was caused by the quake.\nAbout 200 employees safely evacuated from City Hall, and one person was rescued from an elevator, she said.\nThe quake comes less than a week after a 5.2 magnitude temblor hit southern California and was also widely felt in Los Angeles.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.8278382734271735, "event_breakdown": "4.4 magnitude earthquake felt in southern California, causing minor damages but no reported injuries"}, {"id": "0854c709-424a-4c80-bb9e-767ff69d78df", "title": "An earthquake with a magnitude of 4 . 6 has struck the Los Angeles area", "date": "2024-08-12 21:45", "url": "https://jamaica-gleaner.com/article/world-news/20240812/earthquake-magnitude-46-has-struck-los-angeles-area", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "LOS ANGELES (AP) — An earthquake with a magnitude of 4.6 has struck the Los Angeles area, the US Geological Survey said Monday.\nPeople reported feeling it strongly across the Los Angeles area.\nThe quake comes less than a week after a 5.2 magnitude temblor hit southern California and was also widely felt in Los Angeles.\nMonday's quake was centred near the Los Angeles neighbourhood of Highland Park, about 7.5 miles (12.1 kilometres) below the surface.\nSend us a message on WhatsApp at 1-876-499-0169 or email us at onlinefeedback@gleanerjm.com or editors@gleanerjm.com.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.7570364461957543, "event_breakdown": "4.6 magnitude earthquake strikes Los Angeles\nEarthquake with a magnitude of 5.1 strikes central Croatia\n- a 6.0 magnitude earthquake strikes Fox Islands, Alaska\n- A tornado tears through Jonesboro, Arkansas\n- Hail the size of golf balls pounds Colorado\n- Tropical storm Grace kills at least eight people in Haiti"}, {"id": "b7af9c53-f41b-4cd2-a524-d6fa6bbad71d", "title": "Debby aftermath leaves thousands in the dark ; threatens more flooding in the Carolinas | News , Sports , Jobs", "date": "2024-08-12 03:00", "url": "http://www.timesrepublican.com/wire/?category=5181&ID=337597", "domain": "timesrepublican.com", "domain_classification": "Unknown", "message": "With the ground already saturated from Debby, the National Weather Service said localized downpours could result in additional flash flooding throughout the coastal Carolinas.\n“Right now, it’s thundering, sprinkling and pretty dark so I’d say it’s going to start raining hard here pretty soon,” she said.\nEven in drier areas, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont still had no electricity as of Sunday afternoon, according to the tracking website PowerOutage.us.\nDebby’s last day and night over the U.S. inundated parts of New York, Pennsylvania and New England with rain and flash flooding on Friday, prompting evacuations and rescues.\nOfficials announced plans to distribute water bottles and clean-up kits to residents impacted by flash flooding on Sunday and Monday.", "location": "Brunswick County", "classification": "natural-disasters", "score": 0.7290257955649428, "event_breakdown": "1. United States - Flash Flooding: After saturating the ground with rain and flash flooding on the East Coast, more than 35,000 homes and businesses in Ohio, New York, Pennsylvania and Vermont remained without electricity on Sunday. Officials announced plans to distribute water bottles and clean-up kits to residents affected by the flooding on Sunday and Monday.\n2. United States - Tropical Storm Debby: After Debby’s last night and day over the U.S. inundated parts of the East Coast with rain and flash flooding on Friday, officials announced plans to distribute water bottles and clean-up kits to residents impacted by the flooding on Sunday and Monday."}, {"id": "554c8160-4ba9-41f9-9ed0-935a033068d5", "title": "Tropical Storm Ernesto forms , churns across waters toward Caribbean islands", "date": "2024-08-12 22:45", "url": "https://www.yahoo.com/news/tropical-storm-ernesto-forms-churns-220737147.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The season's latest tropical storm formed Monday as it churned across open waters toward the Caribbean islands, where it's expected to bring heavy rain and cause flash floods and possible mudslides before lashing the Virgin Islands and Puerto Rico.\nForecasters anticipate the mainland U.S. will largely be spared from the storm, a welcomed relief as residents across the eastern U.S. recover from former hurricane and tropical storm Debby.\nStorm tracker: NHC tracking tropical disturbance that is expected to become Tropical Storm ErnestoWhat are the potential impacts of Ernesto?\nTropical Storm Ernesto on NOAA's GOES East satellite on Monday afternoon, Aug. 12, 2024.\nContributing: Claire Thornton, Dinah Voyles Pulver, and Jorge L. Ortiz USA TODAY; Cheryl McCloud, USA TODAY Network − FloridaThis article originally appeared on USA TODAY: Tropical Storm Ernesto forms: Caribbean islands under warnings", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9215873901533264, "event_breakdown": "Tropical Storm Ernesto formed on Monday as it churned across open waters toward the Caribbean islands, where it's expected to bring heavy rain and cause flash floods and possible mudslides before lashing the Virgin Islands and Puerto Rico. Storm trackers anticipate the mainland U.S. will largely be spared from the storm, a welcomed relief as residents across the eastern U.S. recover from former hurricane and tropical storm Debby."}, {"id": "45f0a36c-71df-4d28-bff1-5277ba6c77e6", "title": "TROPICAL STORM ERNESTO FORMS : Should Curve Away From Florida", "date": "2024-08-12 22:00", "url": "https://bocanewsnow.com/2024/08/12/tropical-storm-ernesto-forms-should-curve-away-from-florida/", "domain": "bocanewsnow.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto officially formed Monday Afternoon.\nBY: WEATHER TEAM | BocaNewsNow.comBOCA RATON, FL (BocaNewsNow.com) (Copyright © 2024 MetroDesk Media, LLC) — Tropical Storm Ernesto officially formed late Monday afternoon.\nSince the system meets the definition of a tropical cyclone and has winds of tropical storm force, it is now designated Tropical Storm Ernesto.\nKey Messages:Ernesto is expected to bring tropical storm conditions to portions of the Leeward Islands late tonight and Tuesday and to the Virgin Islands and Puerto Rico by late Tuesday.\nTropical Storm Warnings are in effect for this entire area.", "location": "Leeward Islands.", "classification": "natural-disasters", "score": 0.7994028235905909, "event_breakdown": "Tropical Storm Ernesto officially formed Monday Afternoon."}, {"id": "3c998004-cb35-45c3-b0ba-9feeecae57cc", "title": "Tropical Storm Ernesto expected to develop , threaten Puerto Rico", "date": "2024-08-12 21:45", "url": "https://article.wn.com/view/2024/08/12/Tropical_Storm_Ernesto_expected_to_develop_threaten_Puerto_R/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto is forecast to develop in the eastern Caribbean on Tuesday and bring severe weather to Puerto Rico, according to the National Hurricane Center.\nForecasters predict that Ernesto will be declared a tropical storm overnight Tuesday as it reaches the Leeward Islands, and is expected to make... read full story\"The disturbance is expected to become a tropical storm as it reaches the Leeward Islands.\nTropical Storm Warnings are in effect for most of these islands, where tropical storm conditions are expected to begin late tonight,\"", "location": "Leeward Islands", "classification": "natural-disasters", "score": 0.8594937457187205, "event_breakdown": "Tropical Storm Ernesto Forecast to Develop in the Eastern Caribbean\nTropical Storm Fernand Expected to Develop in the Gulf of Mexico\nTropical Storm Warning Issued for Puerto Rico as Ernesto Approaches\nTropical Storm Watch Issued for Parts of the Gulf Coast as Fernand Approaches"}, {"id": "7c18a224-ae79-4b0a-ab86-3611183f28bd", "title": "Flooding and mold multiply damage from Maine harsher storms", "date": "2024-08-12 22:30", "url": "https://www.climatecentral.org/partnership-journalism/flooding-and-mold-multiply-damage-from-maines-harsher-storms", "domain": "climatecentral.org", "domain_classification": "Unknown", "message": "As fossil fuel pollution traps heat, it is intensifying rainfall and raising seas, bringing more inland flooding, damaging homes and contributing to mold.\nTwin flooding storms on Jan. 10 and Jan. 13 compounded difficulties for homeowners facing cleanups.\nRemediation was not covered in their insurance policy, which is not unusual for storm flooding in Maine.\n“Moisture is getting trapped in people’s homes, and it’s just sitting there, stagnant.”Barringer said even a small space can be costly to rid of water damage and mold.\n“You probably won’t have to run them in the winter but definitely will in the summer.”There’s also a human toll with water and mold damage, said Barbara Rapoza, a spokesperson for Servpro.", "location": "MAINE", "classification": "natural-disasters", "score": 0.902591912346684, "event_breakdown": "Hurricane Sandy, Hurricane Harvey, Hurricane Irma, Hurricane Maria\n['Hurricane Sandy', 'Hurricane Harvey', 'Irma Maria']"}, {"id": "be14d57e-702e-4cae-84c4-2ce5fcb08deb", "title": "Potential tropical cyclone five emerges in tropical Atlantic : Soon - to - be Ernesto", "date": "2024-08-12 19:45", "url": "https://wpde.com/weather/abc-15-weather-authority-blog/potential-tropical-cyclone-five-emerges-in-tropical-atlantic-soon-to-be-ernesto-lesser-antilles-tropics-greater-antilles-forecast-weather-august", "domain": "wpde.com", "domain_classification": "Unknown", "message": "MONDAY 5 P.M. UPDATENow Tropical Storm Ernesto, this storm packs maximum sustained winds up to 40 miles per hour and is racing west/northwest.\nThe wind shear is forecast to decrease as the system moves west/northwesterlyand a tropical storm is possible as early as Tuesday as it impacts the Leeward Islands.\nTRENDING:Strengthening is likely into Wednesday as the system nears the Virgin Islands and Puerto Rico and moves into a much more conducive environment for development.\nStrengthening still and moving through a very conducive environment for tropical systems to thrive, the system is forecast to become a Category 2 hurricane by the end of the week as continues its turn to the north/northeast.\nTOP STORY:The current forecast track shows the storm likely turning north, towards Bermuda and otherwise open Atlantic ocean.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9024149470476377, "event_breakdown": "1. Tropical Storm Ernesto is currently moving west/northwest and is expected to impact the Leeward Islands on Tuesday, possibly becoming a tropical storm.\n2. The current forecast track shows the storm likely turning north, towards Bermuda."}, {"id": "72d10992-9e9c-4208-b63f-a4e7700d4c1e", "title": "Midwest Food Bank sends relief to Hurricane Debby victims in Georgia , Florida", "date": "2024-08-12 22:30", "url": "https://www.yahoo.com/news/midwest-food-bank-sends-relief-203341878.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MORTON, Ill. (WMBD) — Midwest Food Bank announced Monday afternoon that it’s sending much-needed relief to storm victims of Hurricane Debby in Georgia and Florida this week.\nThe bank said it partnered with The Salvation Army to launch an initiative to help storm victims of Hurricane Debby that caused widespread damage and destruction in parts of Georgia and Florida, according to a press release from Executive Director Lisa Martin.\nVolunteers loaded two semi-trailers with food boxes that will be shipped from Morton to Savannah, Georgia, on Monday.\nMidwest Food Bank sending relief to Hurricane Beryl victims in Houston, TexasTwo more semi-trucks were loaded with water, one of which will be shipped from Morton to Tampa, Florida.\n“Our collaboration with The Salvation Army enhances our ability to deliver much-needed aid to those impacted by this disaster,” Martin said.", "location": "Morton", "classification": "natural-disasters", "score": 0.5111536462159975, "event_breakdown": ", according to a press release from Executive Director Lisa Martin."}, {"id": "59b65850-0fc9-4510-92b8-31c272142420", "title": "Earthquake strikes Los Angeles near Highland Park", "date": "2024-08-12 22:15", "url": "https://www.ktvu.com/news/earthquake-los-angeles-pasadena", "domain": "ktvu.com", "domain_classification": "Unknown", "message": "A strong earthquake struck Los Angeles, centered near the Highland Park area, Monday afternoon.\nWidespread shaking was reported across a wide area spanning most of Los Angeles County and stretching into Orange and Riverside counties.\nDuring a briefing held following the quake, earthquake expert Lucy Jones said the earthquake appeared to be based on the same group of faults that created the 1987 Whittier Narrows quake.\nIt struck on the first school day for the Los Angeles Unified School District.\nSUGGESTED: LAUSD returns to school Monday for 2024-25 school yearThis comes less than a week after a 5.2-magnitude earthquake struck the Central Valley, near Bakersfield.", "location": "LOS ANGELES", "classification": "natural-disasters", "score": 0.49702108272000456, "event_breakdown": "LA, CA - A strong earthquake centered in the Highland Park area of Los Angeles shook most of Los Angeles County and neighboring counties on Monday, June 24, 2024. The earthquake was published via the USGS Did You Feel It? Website at 16:02 local time."}, {"id": "05b7404c-0ea6-4664-9764-83b83e01f506", "title": "Commentary : Japan is living in the shadow of the megaquake", "date": "2024-08-12 22:45", "url": "https://www.channelnewsasia.com/commentary/japan-megaquake-risk-kyushu-nankai-trough-fukushima-4541836", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "TOKYO: To live in Japan is to live with the risk of a devastating earthquake at any time.\nIt’s kind of like thinking about death - I know I’ll die someday, but I hope it won’t be today.\nThursday’s announcement from Japanese authorities, warning of an increased risk of a long-feared megaquake, forced citizens to consider the very real and immediate danger of an event that would devastate the country and upend life as we know it.\nThe fault, stretching some 900km down Japan’s Pacific coast from Shizuoka to Shikoku, is feared for a reason.\nIt has caused temblors of magnitude 8 or more, accompanied by devastating tsunamis, around every 100 to 150 years.", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.6806236245671332, "event_breakdown": "Japan's authorities warning of an increased risk of a long-feared megaquake"}, {"id": "f93788b2-1c7e-4069-afe5-33eda6706336", "title": "Farm animals in Colleton County also impacted by recent flooding", "date": "2024-08-12 22:30", "url": "https://www.yahoo.com/news/farm-animals-colleton-county-impacted-203238383.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "COLLETON COUNTY, S.C. (WCBD) – As historic flooding impacts the Lowcountry, farmers in some of the more rural areas are still recovering from Tropical Storm Debby and the storm’s lasting effects.\nBill Power’s farm, Herd it Here Farm, is located in Cottageville about a mile and a half from the Edisto River.\nBut his property is roughly 10 feet above the river height, which he believes made a huge difference in protecting the farm from river flooding.\nHe also drained a pond on his farm before the storm, which helped minimize impacts, even after the property received 17 inches of rain.\nBut his goats have some new roommates after helping out a neighbor whose farm is still underwater.", "location": "COLLETON COUNTY, SOUTH CAROLINA", "classification": "natural-disasters", "score": 0.9406223347897601, "event_breakdown": "The following current events of natural-disasters reported in text can be placed on a map:\nflooding in SC caused by tropical storm debby\nfarmers in more rural areas of SC are still recovering from TS debby's effects"}]