[{"id": "a00104b4-cd95-45ea-bb88-e5d6a023a1f8", "title": "Hezbollah launches 30 rockets into Israel , no casualties reported", "date": "2024-08-12 03:15", "url": "https://www.foxnews.com/world/hezbollah-launches-30-rockets-israel-no-casualties-reported-idf", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Hezbollah launched 30 rockets from Lebanon into northern Israel early Monday, though no casualties were reported, the Israeli Defense Forces (IDF) confirmed.\n\"Following sirens that sounded a short while ago in northern Israel, approximately 30 projectiles were identified crossing from Lebanon toward the area of Kabri, a number of which fell in open areas,\" an IDF spokesman said.\nFighting between Hezbollah militants in Lebanon and Israeli forces in the north has intensified in recent weeks, sparking fears that the month-long conflict in Gaza will spread.\n2\" commander who was involved in the 1983 Beirut bombings of a Marine barracks bombing that killed 241 U.S. military personnel.\nThe IDF strike served as a response to an attack that killed a dozen youths in Israel's Golan Heights, but Hezbollah continues to deny any involvement in that attack, while the IDF identified Shukr as the mastermind behind the attack.", "location": "Israel", "classification": "security", "score": 0.9911322621822315, "event_breakdown": "Target Event: Hezbollah launched 30 rockets from Lebanon into northern Israel early Monday, sparking fears that the month-long conflict in Gaza will spread."}, {"id": "741d49f3-49ca-48c5-b1e0-8e55698dd3b2", "title": "Hezbollah fires 30 rockets toward Israel as threat of greater conflict in region remains high", "date": "2024-08-12 07:45", "url": "https://nypost.com/2024/08/12/world-news/hezbollah-fires-30-rockets-toward-israel-as-threat-of-greater-conflict-in-region-remains-high/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Hezbollah fired about 30 rockets from Lebanon toward northern Israel Sunday night, as tensions in the region remained high following the assassination of a top Hamas leader last month.\nThe series of rockets were launched after an Israeli airstrike in the southern part of Lebanon injured 12 people, according to reports.\nThe Iran-backed terror organization said it launched the attack in support of the Palestinian people in war-torn Gaza and in retaliation for the Israeli strike in southern Lebanon, according to CNN.\nAFP via Getty ImagesIsraeli forces said there were no injuries from the more than two-dozen Hezbollah rockets as some fell in open space.\nThe region remains fraught with anxiety following the assassination of top Hamas leader Ismail Haniyeh last month in Tehran as Israel continues its military campaign in Gaza following the Oct. 7 attack.", "location": "Lebanon", "classification": "security", "score": 0.9156141584744157, "event_breakdown": "Hezbollah fires rockets from Lebanon, causing tensions to escalate between Israel and Hezbollah; Israeli airstrike injures 12 in Lebanon; IDF says no injuries reported from Hezbollah rockets; IDF strikes Hamas targets in Gaza; Israeli strike kills senior Hamas leader Ismail Haniyeh in Iran; IDF kills more Hamas targets in Gaza."}, {"id": "af40368d-4a0e-41e8-8c4d-54c572198757", "title": "Israeli , US Defence Chiefs discuss Iran threat as nuclear sub , strike force deployed to region", "date": "2024-08-12 10:30", "url": "https://www.jwire.com.au/israeli-us-defense-chiefs-discuss-iran-threat-as-nuclear-sub-strike-force-deployed-to-region-http-tps-co-il-a/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home News / Israeli, US Defence Chiefs discuss Iran threat as nuclear sub, strike force deployed to region – J-WireIsraeli, US Defence Chiefs discuss Iran threat as nuclear sub, strike force deployed to regionRead on for articleThe Pentagon took the unusual step of publicizing the deployment of a nuclear-powered submarine to the region on Monday.\nThe Pentagon said US Secretary of Defence Lloyd Austin ordered the deployment of the USS Georgia, a guided missile submarine, after discussions with his Israeli counterpart, Yoav Gallant.\nGallant detailed the Israeli military’s readiness and capabilities as threats from Iran and its Shi’ite proxies remain high.\nAustin also ordered the USS Abraham Lincoln carrier strike force to accelerate its deployment to the region, where it will augment the USS Theodore Roosevelt strike force.\nHezbollah has vowed revenge for a separate Israeli airstrike in Beirut which killed Fuad Shukr.", "location": "NULL", "classification": "security", "score": 0.7662456401589822, "event_breakdown": "Israeli, US Defence Chiefs discuss Iran threat as nuclear sub, strike force deployed to region - news article\nThe Pentagon took the unusual step of publicizing Monday the deployment of a nuclear-powered submarine to the region, according to a statement.\nUS Secretary of Defence Lloyd Austin ordered the deployment of the USS Georgia, a guided missile submarine, after discussions with his Israeli counterpart, Yoav Gallant, the Pentagon said.\nAustin also ordered the USS Abraham Lincoln carrier strike force to accelerate its deployment to the region, where it will augment the USS Theodore Roosevelt strike force.\nThe Israeli military’s readiness and capabilities were detailed by Gallant, who stressed the similarities between potential threats from Iran and its Shi’ite proxies.\nHezbollah has vowed revenge for a separate Israeli airstrike in Beirut on Wednesday that killed Hezbollah operative Fuad Shukr."}, {"id": "752a92c8-b18b-47f4-8d8f-aef54cf0d582", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 06:30", "url": "https://economictimes.indiatimes.com/news/defence/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-a-deal-instead-of-more-talks/articleshow/112458605.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"Israel has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.The humanitarian zone has steadily shrunk during the war with the various evacuation orders.\nTens of thousands fled again last week after an evacuation order.The new order came in leaflets dropped from the sky.\nThe Lincoln was expected in the region by month's end.In Lebanon, the Health Ministry said an Israeli strike near the southern town of Taybeh killed two people, without giving details.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "GAZA", "classification": "security", "score": 0.9674401999013625, "event_breakdown": "The Israeli Security Cabinet ordered the military on Friday to keep targeting Hamas and Islamic Jihad commanders. These groups are firing rockets into Israeli cities.\nOn Sunday, Israel said 13 people were killed overnight after a rocket strike on an apartment on the outskirts of Tel Aviv. It was the highest number of killed by rocket attacks in the country since the 2014 Gaza war. More than a hundred projectile were launched on Tuesday from Gaza. Rocket sirens wailed across the metropolitan area.."}, {"id": "f51ad17f-5ec7-4751-8c96-46a5a2d757ce", "title": "Hezbollah fires rockets into Israel as threat of Iran attack looms", "date": "2024-08-12 06:30", "url": "https://news.yahoo.com/news/hezbollah-fires-rockets-israel-threat-025926715.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Hezbollah fired a barrage of rockets toward northern Israel on Sunday night, as Israeli forces remain on high alert for potential retaliation from Iran and its proxies following the assassination of a top Hamas leader last month.\nAbout 30 rockets were launched from Lebanon, the Israel Defense Forces (IDF) said, adding that some fell into open areas and no injuries were reported.\n“IDF forces are deployed and prepared in high readiness.\nAustin has ordered a guided-missile submarine to the Middle East and accelerated the arrival of a carrier strike group to the region ahead of an anticipated Iranian attack against Israel, the Pentagon said in a statement Sunday evening.\nThe office of Israeli Prime Minister Benjamin Netanyahu confirmed Israel will send a delegation to the talks.", "location": "Lebanon.", "classification": "security", "score": 0.8022179733199006, "event_breakdown": "IDF soldiers caught three suspects who crossed the Blue Line from Lebanon into Israel on Wednesday, the IDF said. The suspects were armed with knives and grenades, and caught after climbing the border fence into Israel. The suspects were turned over to the relevant authorities for questioning."}, {"id": "8e842054-7fa0-4903-afc0-c7363e73aff4", "title": "Hezbollah fires rockets into Israel as threat of Iran attack looms", "date": "2024-08-12 04:30", "url": "https://www.cnn.com/2024/08/11/middleeast/israeli-military-looming-iranian-attack-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "Haifa, Israel CNN —Hezbollah fired a barrage of rockets toward northern Israel on Sunday night, as Israeli forces remain on high alert for potential retaliation from Iran and its proxies following the assassination of a top Hamas leader last month.\nAbout 30 rockets were launched from Lebanon, the Israel Defense Forces (IDF) said, adding that some fell into open areas and no injuries were reported.\n“IDF forces are deployed and prepared in high readiness.\nAustin has ordered a guided-missile submarine to the Middle East and accelerated the arrival of a carrier strike group to the region ahead of an anticipated Iranian attack against Israel, the Pentagon said in a statement Sunday evening.\nThe office of Israeli Prime Minister Benjamin Netanyahu confirmed Israel will send a delegation to the talks.", "location": "Israel", "classification": "security", "score": 0.8049095663309924, "event_breakdown": "IDF forces are deployed and prepared in high readiness."}, {"id": "fac53e6c-0fcd-473d-9229-43e334c41318", "title": "Hezbollah targets Israeli military base with around 30 projectiles", "date": "2024-08-12 04:15", "url": "https://news.webindia123.com/news/Articles/World/20240812/4224317.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Lebanon-based Hezbollah has claimed responsibility for the attack, claiming to target a military base, according to the Hezbollah-affiliated Al Mayadeen site, The Times of Israel reported.\nThe Israel Defence Forces said that several of them landed in open areas and there were no casualties.\nThe Israel Defence Forces said it received intelligence verifying that Nael Sakhl was killed in an airstrike on July 24.\nIn a statement, the IRGC said that Haniyeh and one of his bodyguards were killed when their house was hit in Tehran.\nHaniyeh, who was based in Qatar, was in Tehran to attend the swearing-in ceremony of Iran's newly elected President Masoud Pezeshkian.", "location": "BEIRUT.", "classification": "security", "score": 0.9493779766881119, "event_breakdown": "IDF (Israeli Defence Forces) strikes in Syria\nHezbollah claims responsibility for striking military base\nIDF assassinates Nael Sakhl.\nThe Islamic Revolution Guard Corps (IRGC) blamed for killing terrorist leader Haniyeh in Tehran"}, {"id": "b9dc1b49-7339-44fa-9c14-fafdfbfadf83", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 08:00", "url": "https://www.wsoctv.com/news/world/israel-widens/6VFTSHWBIZAQVPV2M5D3XWZHIA/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Sorry, no current security events could be found."}, {"id": "45b0cfd8-bbd5-45bb-b53c-f0f09a074e11", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 06:00", "url": "https://isp.netscape.com/news/world/story/0001/20240812/18b0a73f930e3cc472a4207168b09ac1", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israel widens evacuation orders in southern Gaza.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.\n___Follow AP’s coverage of the war in Gaza at https://apnews.com/hub/israel-hamas-war© Copyright The Associated Press.", "location": "Gaza", "classification": "security", "score": 0.9905260133923585, "event_breakdown": "Israel widens evacuation orders in southern Gaza. Israel accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas."}, {"id": "c898e524-294a-4859-9e0b-15419c14b0ef", "title": "Hezbollah fires rockets into Israel as threat of Iran attack looms", "date": "2024-08-12 04:15", "url": "https://www.wpsdlocal6.com/news/hezbollah-fires-rockets-into-israel-as-threat-of-iran-attack-looms/article_ef5bcd16-5855-11ef-9000-a3a86aa33a38.html", "domain": "wpsdlocal6.com", "domain_classification": "Unknown", "message": "The central city of Tel Aviv on August 10, amid regional tensions during the ongoing war between Israel and the Palestinian Hamas movement in the Gaza Strip.", "location": "Tel Aviv", "classification": "security", "score": 0.9113941904959548, "event_breakdown": "Israeli strikes target sites in Gaza in response to Hamas rocket attacks\n\nIsraeli air strikes have hit sites in Gaza overnight in response to rocket attacks from the territory.\n\nThe Israeli military said it had conducted airstrikes on a weapons manufacturing site and a rocket launch site, in response to a barrage of rocket fire from the Gaza Strip.\n\nThe Gaza Health Ministry reported that one man, identified as 25-year-old Mahmoud al-Adham, was killed in an Israeli air strike on a Hamas site.\n\nIsrael, which rarely comments on specific strikes, said the strikes were retaliation for \"arson balloons\" launched from Gaza that caused fires in fields in southern Israel.\n\nThe weekend saw a fresh flare-up of violence along the Gaza-Israel border, after a period of relative calm since an 11-day Israeli aggression against the besieged enclave in May.\n\nOn Saturday, Palestinian armed groups in the Gaza Strip fired a barrage of rockets into southern Israel, vowing that they will not allow Tel Aviv, the Central city of Jewish state, live in peace."}, {"id": "5b4f463a-387d-436e-ae4b-427b736f8b13", "title": "USS Georgia : Lloyd Austin orders submarine to Middle East , accelerates arrival of strike group ahead of anticipated Iran attack", "date": "2024-08-12 04:30", "url": "https://edition.cnn.com/2024/08/11/politics/defense-secretary-strike-group-iran/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Austin ordered the submarine into the waters of the Middle East, the Pentagon said.\nThe Israel Defense Forces reported Sunday evening that around 30 rockets were launched from Lebanon, though some fell into open areas and no injuries were reported.\nAustin also ordered the USS Abraham Lincoln carrier strike group to accelerate its transit to the Middle East, the Pentagon said.\nThe Lincoln strike group consists of the carrier, which operates with stealth F-35C fighter jets, as well as several destroyers.\nThe USS Theodore Roosevelt carrier strike group has been operating in the waters of the Middle East for several weeks, giving the US a formidable presence in the region.", "location": "Middle East", "classification": "security", "score": 0.8606602126439846, "event_breakdown": "Austin ordered the submarine into the waters of the Middle East and the USS Abraham Lincoln carrier strike group to accelerate its transit to the Middle East in response to rocket attacks from Lebanon."}, {"id": "bd914f07-8eb9-41ba-8e6b-60fd0d9e145b", "title": "Defense secretary orders submarine to Middle East , accelerates arrival of strike group ahead of anticipated Iran attack", "date": "2024-08-12 02:45", "url": "https://ktvz.com/politics/cnn-us-politics/2024/08/11/defense-secretary-orders-submarine-to-middle-east-accelerates-arrival-of-strike-group-ahead-of-anticipated-iran-attack/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "Austin ordered the submarine into the waters of the Middle East, the Pentagon said.\nThe Israel Defense Forces reported Sunday evening that around 30 rockets were launched from Lebanon, though some fell into open areas and no injuries were reported.\nAustin also ordered the USS Abraham Lincoln carrier strike group to accelerate its transit to the Middle East, the Pentagon said.\nThe Lincoln strike group consists of the carrier, which operates with stealth F-35C fighter jets, as well as several destroyers.\nThe USS Theodore Roosevelt carrier strike group has been operating in the waters of the Middle East for several weeks, giving the US a formidable presence in the region.", "location": "Middle East", "classification": "security", "score": 0.8606602126439846, "event_breakdown": "Reported rocket fire from Lebanon into open areas and no injuries reported. The Pentagon also said that Vice President Harris spoke on Friday with Israeli Prime Minister Naftali Bennett \"about the ongoing violence in Israel and the West Bank and the potential of the rocket attacks from Lebanon\" and about the US and Israel's \"shared concerns over Iran's malign actions in the region.\""}, {"id": "d4ffbdad-b3d8-4984-945d-a4ce6058a23f", "title": "Pentagon chief orders submarine to the Middle East , tells aircraft carrier to hasten its transit", "date": "2024-08-12 03:30", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/pentagon-chief-orders-submarine-to-the-middle-east-tells-aircraft-carrier-to-hasten-its-transit/article_0ef2b9ff-7a68-5b1a-989e-0b5c56bce2d1.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Pentagon chief orders submarine to the Middle East, tells aircraft carrier to hasten its transitThe Pentagon says U.S. Defense Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area", "location": "The Middle East", "classification": "security", "score": 0.7796752838341732, "event_breakdown": "Target event:\nThe Pentagon says U.S. Defense Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area."}, {"id": "6b193797-873e-47d0-9230-e64d99d5ac12", "title": "US urges deployment to the Middle East amid Iranian attack fears", "date": "2024-08-12 08:00", "url": "https://www.albawaba.com/news/us-urges-deployment-middle-east-amid-1581041", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Amid rising alarms of an Iranian counterattack, US Secretary of Defense, Lloyd Austin ordered the deployment of fighter jets and navy warships to the Middle East in preparation for a retaliatory attack.\nUS War Chief orders Navy to get their ass to the Middle East, immediately!!\nIn response, Israeli armed forces announced targeting Hamas positions inside the Gaza Strip.\nThousands were killed, and dozens of thousands of others were injured in the Israeli attacks on the Gaza Strip.\nHundreds of thousands of people lack shelter, and aid trucks are entering the area at a lower rate than before the conflict began.", "location": ".\nGAZA", "classification": "security", "score": 0.9576060676393744, "event_breakdown": "US airstrikes in Iraq and Syria.\nIsrael strikes target Hamas positions in Gaza."}, {"id": "ee22465b-4ca7-41c6-8134-6f26be652640", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks . ", "date": "2024-08-12 04:30", "url": "https://www.bostonglobe.com/2024/08/11/world/israel-hamas-gaza-war-mideast/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Israel has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nAdvertisementIsrael has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nKhan Younis suffered widespread destruction during an air and ground offensive earlier this year.\nRamadan Issa, a father of five in his 50s, fled Khan Younis with 17 members of his extended family, joining hundreds of people walking toward central Gaza.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.", "location": "GAZA", "classification": "security", "score": 0.9350826617037651, "event_breakdown": "Israel ordered mass evacuations as troops re-entered Khan Younis, a Palestinian stronghold."}, {"id": "805c8876-825b-4e10-bed6-86c4d8edce73", "title": "Israel widens evacuation orders in southern Gaza", "date": "2024-08-12 05:15", "url": "https://www.deccanchronicle.com/world/middle-east/israel-widens-evacuation-orders-in-southern-gaza-1815738", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.\n\"Israel has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.The humanitarian zone has steadily shrunk during the war with the various evacuation orders.\nTens of thousands fled again last week after an evacuation order.The new order came in leaflets dropped from the sky.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.9714112451857122, "event_breakdown": "On Sunday, the Israeli military ordered more evacuations in southern Gaza after a deadly airstrike in the northern part of the enclave killed at least 80 people, according to local authorities. The Israeli army accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas. The evacuation orders are part of the ongoing war between Israel and Palestinian militants in Gaza.  The humanitarian zone has steadily shrunk during the war with the various evacuation orders. Tens of thousands of people again fled last week after an evacuation order. The new order came in leaflets dropped from the sky. The Israeli military said it killed 19 Hamas and Islamic Jihad militants in the counter-strike."}, {"id": "cadc21f6-5173-48be-a827-9050d3fe07af", "title": "Hezbollah says two fighters killed in Israeli strike", "date": "2024-08-12 03:00", "url": "https://www.voanews.com/a/hezbollah-says-two-fighters-killed-in-israeli-strike/7738747.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah movement said an Israeli airstrike on Sunday killed two fighters from the Iran-backed group, with the health ministry reporting another death from an attack days ago.\nAn \"Israeli strike that targeted the village of Taybeh today left two dead,\" the Lebanese health ministry said in a statement.\nHezbollah confirmed they were group fighters, killed in Taybeh near the border with Israel.\nThe Israeli military said it had \"struck throughout the day several Hezbollah military structures in the area of Adaisseh\", which is located next to Taybeh.\nAccording to the health ministry, at least one Lebanese and 11 Syrians were injured, two seriously, in an Israeli strike on Maaroub, near Derdghaiya.", "location": "Adaisseh", "classification": "security", "score": 0.9255309485235378, "event_breakdown": "Lebanese Hezbollah fighters killed in airstrike by Israel\nLebanese Hezbollah fighters were killed in an Israeli airstrike that targeted the village of Taybeh near the border with Israel on Sunday."}, {"id": "85313ef0-0670-4fb7-bcbf-0aec56fd2a87", "title": "US publicly announces submarine move to Middle East amid Israel - Iran tensions", "date": "2024-08-12 08:30", "url": "https://dunyanews.tv/en/World/830267-us-publicly-announces-submarine-move-to-middle-east-amid-israeliran-t", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "US publicly announces submarine move to Middle East amid Israel-Iran tensionsWorld World US publicly announces submarine move to Middle East amid Israel-Iran tensionsThe Pentagon said Austin had ordered the Abraham Lincoln strike group to accelerate to the regionFollow on Published On: Mon, 12 Aug 2024 10:46:20 PKTWASHINGTON (Reuters) – US Defense Secretary Lloyd Austin has ordered the deployment of a guided missile submarine to the Middle East, the Pentagon said on Sunday, as the region braces for possible attacks by Iran and its allies after the killing of senior members of Hamas and Hezbollah.\nIn a statement after Austin spoke with his Israeli counterpart, the Pentagon said Austin had ordered the Abraham Lincoln strike group to accelerate its deployment to the region.\nThe US military had already said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster Israeli defenses.\nIran has said the US bears responsibility in the assassination of Haniyeh because of its support for Israel.\nReuters reported several US and coalition personnel were wounded in a drone attack on Friday in Syria, in the second major attack in recent days against US forces amid soaring tensions in the Middle East.", "location": "Middle East", "classification": "security", "score": 0.4858624232695822, "event_breakdown": "The US military said the Friday attack was carried out by multiple armed drones that fired a \"couple of anti-tank rockets\" at US forces near the garrison town of al-Tanf, near the border with Iraq and Jordan.\nAccording to a military official, the drones caused the US troops to scatter and take cover and that the incident did not result in any casualties.\nUS officials told Reuters there were no indications that the attack was carried out by a major military force. Instead, they believe it was likely the work of Iranian-backed militias.\nThe US military said that an attack on American forces is considered a violation of international norms and that Washington will take all necessary measures to defend itself and its allies.\nThe United States on Sunday publicly announced the movement of a submarine to the Middle East amid Israeli-Iran tensions. The Pentagon said Secretary of Defense Lloyd Austin ordered the deployment in response to threats from Iran and its allies following the assassination of leading members of Hamas and Hezbollah. Austin had previously ordered the Abraham Lincoln strike group, consisting of a guided missile submarine, to accelerate its movement to the region. The US military is also deploying additional fighter jets and warships to the Middle East to bolster Israeli defenses."}, {"id": "06f6593b-c7ad-44f8-b540-1d7d1da4d0cf", "title": "US Bolsters West Asia Forces Amid Rising Tensions ; Ceasefire Efforts Gain Momentum", "date": "2024-08-12 09:30", "url": "https://www.devdiscourse.com/article/international/3049638-us-bolsters-west-asia-forces-amid-rising-tensions-ceasefire-efforts-gain-momentum", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "The US is enhancing its military presence in West Asia by deploying an additional guided missile submarine, the Pentagon announced in response to rising regional tensions.\nThey called on Iran and its allies to avoid actions that could worsen tensions and threaten the ceasefire and hostage release opportunities.\nUS President Joe Biden, along with leaders from Egypt and Qatar, have urged Israel and Hamas to resume ceasefire talks on August 15 in Doha or Cairo.\nIsrael has confirmed it will send a delegation for ceasefire talks on August 15.\nConcurrently, the Israel Defense Forces reported approximately 30 projectiles launched from Lebanon towards northern Israel, with no injuries reported.", "location": "West Asia", "classification": "security", "score": 0.5300810291423488, "event_breakdown": "* The US is enhancing its military presence in West Asia by deploying an additional guided missile submarine in response to rising regional tensions.\n* US President Joe Biden, along with leaders from Egypt and Qatar, have urged Israel and Hamas to resume ceasefire talks on August 15 in Doha or Cairo. Israel has confirmed it will send a delegation for ceasefire talks on August 15.\n* The Israel Defense Forces reported approximately 30 projectiles launched from Lebanon towards northern Israel, with no injuries reported."}, {"id": "f2164bf9-5cb2-4349-9025-a9f9efe9bf2e", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 04:15", "url": "http://lasvegassun.com/news/2024/aug/11/israel-widens-evacuation-orders-in-southern-gaza-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Israel widens evacuation orders in southern Gaza.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "Southern Gaza", "classification": "security", "score": 0.9894694719352435, "event_breakdown": "Israel continues to expand evacuation orders in southern Gaza\nHezbollah exchange attacks with Israeli military"}, {"id": "5f1d1983-2185-4609-b190-c931ee39b526", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 04:15", "url": "https://lasvegassun.com/news/2024/aug/11/israel-widens-evacuation-orders-in-southern-gaza-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Israel widens evacuation orders in southern Gaza.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "GAZA", "classification": "security", "score": 0.9894694719352435, "event_breakdown": "Israel announces that it has begun bombing targets in the Gaza Strip, in retaliation for rocket attacks from Hamas.\nThe military says that it has launched airstrikes against several Hamas targets in Gaza, including weapons factories and training facilities, in response to rocket fire from the territory."}, {"id": "fd907ef1-a5c0-481e-9abe-ab4cbfa76528", "title": "Israel prepares for likely retaliatory attack by Iran as tensions mount", "date": "2024-08-12 11:45", "url": "https://www.aol.co.uk/news/israel-prepares-likely-retaliatory-attack-111619071.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Iran’s acting foreign minister, Ali Bagheri Kani, made the comments to his Chinese counterpart on Monday, according to state media.\nThe rapidly rising tensions have been driven by remarks by Iranian and Israeli officials that Tehran was on the brink of a large-scale retaliatory attack.\nThe growing fear of an Iranian attack has caused a number of international airlines to cancel flights to the region.\nIsrael has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.", "location": "IRAN", "classification": "security", "score": 0.8857097900949985, "event_breakdown": "Israeli troops are ordered to evacuate certain areas in Israel near the Gaza strip due to rising fears of an Iranian attack."}, {"id": "1fb39851-1bd8-4744-877a-a32d9a5ae60f", "title": "US orders submarine , aircraft carrier to rush to Mideast as Israel warns of coming Iran attack", "date": "2024-08-12 04:15", "url": "https://thefrontierpost.com/us-orders-submarine-aircraft-carrier-to-rush-to-mideast-as-israel-warns-of-coming-iran-attack/", "domain": "thefrontierpost.com", "domain_classification": "Unknown", "message": "In a statement after Austin spoke with his Israeli counterpart, the Pentagon said the defense chief had ordered the Abraham Lincoln strike group to accelerate its deployment to the region.\nIt wasn’t clear Sunday what his latest order means, or how much more quickly the Lincoln will steam to the Middle East.\nThe US military had already said it will deploy additional fighter jets and Navy warships to the Middle East as Washington seeks to bolster Israeli defenses.\nIran has said the US bears responsibility in the assassination of Haniyeh because of its support for Israel.\nSeveral US and coalition personnel were wounded in a drone attack on Friday in Syria, in the second major attack in recent days against US forces amid soaring tensions in the Middle East.", "location": "Middle East", "classification": "security", "score": 0.42759068934657857, "event_breakdown": "Iran threatened to attack US troops in the Middle East following the assassination of Iranian Revolutionary Guard Corps (IRGC) General Qassem Soleimani in a drone strike by US forces in January 2020."}, {"id": "a0c38739-90b7-444d-89e8-7ce3e6eb7ae1", "title": "Hezbollah Says Israeli Air Strike Kills Two Fighters", "date": "2024-08-12 06:00", "url": "https://www.news18.com/world/hezbollah-says-israeli-air-strike-kills-two-fighters-9012730.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Lebanon’s Hezbollah movement said an Israeli air strike on Sunday killed two fighters from the Iran-backed group, with the health ministry reporting another death from an attack days ago.\nThe Lebanese health ministry said Sunday an “Israeli strike that targeted the village of Taybeh today left two dead.”Hezbollah confirmed they were group fighters, killed in Taybeh near the border with Israel.\nThe Israeli military said it had “struck throughout the day several Hezbollah military structures in the area of Adaisseh”, which is next to Taybeh.\nAccording to the health ministry, at least one Lebanese and 11 Syrians were wounded, two seriously, in an Israeli strike on Maaroub, near Derdghaiya.\n“Approximately 30 projectiles were identified crossing from Lebanon toward the area of Kabri,” the Israeli military said Monday, reporting no casualties and announcing retaliatory strikes.", "location": "Taybeh", "classification": "security", "score": 0.9322994855095736, "event_breakdown": "[Hezbollah: Two Fighters Killed in Israeli Strike on Lebanese Border]\nDate: July 18, 2022\nLocation: Taybeh, Lebanon\nSummary: The Lebanese Hezbollah movement said an Israeli air strike on Monday killed two fighters near the Lebanese-Syrian border.\nThe Israeli military said it had targeted military structures near the Lebanese village of Adaisseh on a number of occasions."}, {"id": "1e0f7b4d-1aa2-4e09-84ae-e6b53315b946", "title": "Hezbollah says two fighters killed in Israeli strike on Sunday", "date": "2024-08-12 04:30", "url": "https://www.news24.com/news24/world/news/hezbollah-says-two-fighters-killed-in-israeli-strike-on-sunday-20240812", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Hezbollah reported that an Israeli air strike on Sunday killed two of its fighters in the village of Taybeh.\nThe cross-border violence, which has been ongoing since early October, has resulted in casualties on both sides, including fighters and civilians.\nLebanon's Hezbollah movement said an Israeli air strike on Sunday killed two fighters from the Iran-backed group, with the health ministry reporting another death from an attack days ago.\nThe Lebanese health ministry said Sunday that an \"Israeli strike that targeted the village of Taybeh today left two dead.\"\nHezbollah confirmed they were group fighters, killed in Taybeh near the border with Israel.", "location": "Taybeh", "classification": "security", "score": 0.8351960200584964, "event_breakdown": "Target event:\nAn Israeli air strike in Taybeh, near the border with Israel in Lebanon, killed two Hezbollah fighters."}, {"id": "b096b2a0-d171-4a3b-9293-d72e57c8ed80", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 03:30", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-a-deal-instead-of/article_dd56f4fb-cabe-5a45-9b38-21d805e13216.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Israel widens evacuation orders in southern Gaza.\nHamas wants plans for a deal instead of more talksThe Israeli military has ordered more evacuations in southern Gaza a day after health authorities said an airstrike on a school-turned-shelter in the north killed at least 80 Palestinians", "location": "GAZA", "classification": "security", "score": 0.964864716110197, "event_breakdown": "Israel widens evacuation orders in southern Gaza"}, {"id": "d98cc00a-bda8-4718-aad9-b9132582fcf9", "title": "Hezbollah fires rockets into Israel as threat of Iran attack looms", "date": "2024-08-12 04:00", "url": "https://www.cbs58.com/news/around-30-rockets-launched-from-lebanon-into-israel-idf-says", "domain": "cbs58.com", "domain_classification": "Unknown", "message": "Hezbollah fires rockets into Israel as threat of Iran attack loomsOren Ziv/AFP/Getty Images via CNN NewsourceBy Jeremy Diamond, Lauren Izso, Irene Nasser and Eyad KourdiHaifa, Israel (CNN) — Hezbollah fired a barrage of rockets toward northern Israel on Sunday night, as Israeli forces remain on high alert for potential retaliation from Iran and its proxies following the assassination of a top Hamas leader last month.\nAbout 30 rockets were launched from Lebanon, the Israel Defense Forces (IDF) said, adding that some fell into open areas and no injuries were reported.\n“IDF forces are deployed and prepared in high readiness.\nAustin has ordered a guided-missile submarine to the Middle East and accelerated the arrival of a carrier strike group to the region ahead of an anticipated Iranian attack against Israel, the Pentagon said in a statement Sunday evening.\nThe office of Israeli Prime Minister Benjamin Netanyahu confirmed Israel will send a delegation to the talks.", "location": ")\nIsrael", "classification": "security", "score": 0.8387311173923114, "event_breakdown": "IDF on high alert for potential retaliation from Iran following the assassination of a top Hamas leader last month\nIsraeli forces on high alert for potential retaliation from Hezbollah following the assassination of a top Hamas leader last month\nA US aircraft carrier and a guided missile submarine have been moved to the Eastern Mediterranean Sea ahead of anticipated Iranian attack against Israel\nIsrael will send a delegation to talks on Iranian nuclear deal with world powers"}, {"id": "20a5a3b9-1422-4404-987b-4a8c6e7d3caf", "title": "US deploys submarine to Middle East in warning to Iran", "date": "2024-08-12 11:00", "url": "https://www.yahoo.com/news/us-deploys-submarine-middle-east-101721491.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US deploys submarine to Middle East in warning to IranThe US has bolstered its military presence in the Middle East as tensions rise - AP/Indra BeaufortThe US deployed a guided missile submarine to the Middle East on Monday in anticipation of an attack on Israel by Iran and Hezbollah.\nThe bolstering of the US military in the region comes as Israeli media reported that Israel is expecting Iran to launch a direct attack by Thursday.\nThat contradicted reports last week that US pressure on Iran had managed to temper its expected response to the killing of Hamas’s political leader in Tehran.\nMr Austin also ordered the USS Abraham Lincoln aircraft carrier strike group, equipped with F-35C fighters, to the Middle East.\nThe US deployed a separate warship, the USS Theodore Roosevelt carrier strike group, to the Middle East last week as both Iran and Hezbollah threatened attacks on Israel in response to the assassinations of Hezbollah and Hamas leaders in Beirut and Tehran.", "location": "Middle East", "classification": "security", "score": 0.4606574489758004, "event_breakdown": "US deploys guided missile submarine to Middle East in warning to Iran\nUS bolsters military presence in the Middle East as tensions rise - AP/Indra BeaufortThe US deployed a guided missile submarine to the Middle East on Monday in anticipation of an attack on Israel by Iran and Hezbollah.\nThe bolstering of the US military in the region comes as Israeli media reported that Israel is expecting Iran to launch a direct attack by Thursday.\nThat contradicted reports last week that US pressure on Iran had managed to temper its expected response to the killing of Hamas’s political leader in Tehran.Mr Austin also ordered the USS Abraham Lincoln aircraft carrier strike group, equipped with F-35C fighters\nUS deploys separate warship, the USS Theodore Roosevelt carrier strike group, to the Middle East last week as both Iran and Hezbollah threatened"}, {"id": "e4898ea3-5130-4bcc-a715-4f3050147b27", "title": "USS Abraham Lincoln ordered to  accelerate  to Middle East", "date": "2024-08-12 06:30", "url": "https://taskandpurpose.com/news/uss-abraham-lincoln-accelerate-middle-east/", "domain": "taskandpurpose.com", "domain_classification": "Unknown", "message": "Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln and its carrier strike group to speed up its transit to the Middle East, as the United States prepares for a possible retaliatory strike by Iran against Israel following an assassination inside Tehran.\nThe USS Abraham Lincoln Carrier Strike Group will join the USS Theodore Roosevelt Strike Group, which was deployed to the Middle East earlier this summer to replace the USS Dwight D. Eisenhower and its support ships.\nIt’s unclear how quickly the USS Abraham Lincoln will be able to reach the Middle East.\nIt recently was in the Pacific Ocean this past week, including carrying out a joint drill with the Italian Navy’s Cavour Carrier Strike Group.\nThis past week approximately a dozen U.S. Air Force F-22 fighter jets arrived in the Middle East to bolster American forces there.", "location": ")\nThe Middle East", "classification": "security", "score": 0.7980961706619606, "event_breakdown": "Reported: The ordered transit of the USS Abraham Lincoln Carrier Strike Group to the Middle East as the United States prepares for a possible retaliatory strike by Iran against Israel following an assassination inside Tehran."}, {"id": "998dfc49-3a77-46e0-8cf8-8226d5b0cfd0", "title": "  Destroying the education system  - Israel latest attack on Gaza school kill", "date": "2024-08-12 09:30", "url": "https://www.newstalk.com/news/destroying-the-education-system-israels-latest-attack-on-gaza-school-kills-93-1754101", "domain": "newstalk.com", "domain_classification": "Unknown", "message": "Israel is attempting to “destroy the education system” in Gaza, according to the Irish Anti-War Movement (IAWM).\nAn average of 80 aid trucks reached Gaza in both June and July, dropping sharply from 169 trucks in April.\nSchool attacksThe United Nations reported that, as of last month, 477 out of 564 school buildings in Gaza had been damaged or hit by rockets.\n“These people were having their morning prayer in the courtyard when an airstrike dismembered them, killing up to 100; it’s unclear.”“This was yet another slaughter by the Israeli military.\n“Israeli military action has been necessary to remove Hamas, weaken the organization, and try to reclaim some hostages,” he said.", "location": "Gaza", "classification": "security", "score": 0.8878610678995686, "event_breakdown": "Israel accused of destroying Gaza's education"}, {"id": "1b1df391-5b78-464f-908f-302973d29fbc", "title": "U . S . sends more forces and military hardware to the Middle East in anticipation of Iranian attack on Israel", "date": "2024-08-12 10:30", "url": "https://www.nbcphiladelphia.com/news/business/money-report/u-s-sends-more-forces-and-military-hardware-to-the-middle-east-in-anticipation-of-iranian-attack-on-israel/3941587/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "The Pentagon has ordered a guided missile submarine to the Middle East, as well as a carrier strike group equipped with F-35C fighter jets.\nA Pentagon statement noted \"the strengthening of U.S. military force posture and capabilities throughout the Middle East in light of escalating regional tensions.\"\nThe U.S. is sending more troops and military hardware to the Middle East as it seeks to increase the resources available to \"defend Israel,\" the Pentagon said in a statement.\nAt the same time, many Democratic voters strongly support Israel, leaving Democratic nominee Kamala Harris in a challenging position.\nIsrael's military response to the attack has killed more than 39,000 people in the Gaza Strip, local health authorities.", "location": "Middle East", "classification": "security", "score": 0.8103063229987347, "event_breakdown": "The U.S. military is sending more troops and military hardware to the Middle East following a request from the Israeli government, which fears it is being targeted by Iran and its proxy forces. The Pentagon is sending two warships to the Persian Gulf to bolster its missile defense capabilities. U.S. forces in the region were ordered to be ready for \"any possible contingency\"."}, {"id": "72bc856b-c9e3-4056-ad0a-a9cfbf608a60", "title": "Israel keeps up strikes in Gaza as fears of wider war grow", "date": "2024-08-12 11:30", "url": "https://www.marketscreener.com/news/latest/Israel-keeps-up-strikes-in-Gaza-as-fears-of-wider-war-grow-47624684/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Palestinian medics said Israeli military strikes on several areas of Khan Younis on Monday killed at least 16 people and wounded several.\nA day after that operation, Ismail Haniyeh, the political leader of Hamas, was assassinated in Tehran, drawing Iranian vows of retaliation against Israel.\nThe potential escalation underlined how far the Middle East has been thrown into turmoil by the war in Gaza, now into its 11th month.\nGaza health officials say most of the fatalities have been civilians but Israel says at least a third are fighters.\nIsrael says it has lost 329 soldiers in Gaza.", "location": "GAZA", "classification": "security", "score": 0.8443765603095544, "event_breakdown": "Israeli forces carried out a series of strikes on Khan Younis in the southern Gaza Strip on Monday, killing at least 16 people, according to Palestinian medics. A day later, Ismail Haniyeh, the political leader of Hamas, was assassinated in Tehran, and Iran vowed to retaliate against Israel. Israel says it has lost 329 soldiers in Gaza."}, {"id": "30ee4f93-9005-4cec-80b4-e18fdfd01f26", "title": "Israel widens evacuation orders in southern Gaza", "date": "2024-08-12 02:45", "url": "https://www.stltoday.com/news/nation-world/israel-hamas-war-gaza-strip-evacuation-orders-khan-younis/article_0eab1031-3b65-5f10-8849-d1623d286baf.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "Israel accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nIn Lebanon, the Health Ministry said an Israeli strike near the southern town of Taybeh killed two people, without giving details.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "GAZA", "classification": "security", "score": 0.9910719958455828, "event_breakdown": "Israeli air strikes in the southern region of Lebanon\nLebanese Health Ministry says Israeli strike killed 2 people\nIsraeli military says 19 militants killed"}, {"id": "dfba667a-eaf2-49e7-b1d4-82cb41d53aee", "title": "Gallant hopes Iran , Hezbollah wont force Israel to cause  significant damage  ", "date": "2024-08-12 10:30", "url": "https://www.naharnet.com/stories/en/307217-gallant-hopes-iran-hezbollah-won-t-force-israel-to-cause-significant-damage", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli Defense Minister Yoav Gallant has warned to retaliate \"in a way that hasn't been done before\" if Iran and Hezbollah attack Israel.\nGallant said Sunday, as he visited a military base, that Israel is fighting for its existence and that Iran and Hezbollah are threatening to harm Israel \"in ways they have not done before.\"\n\"We must be prepared,\" Gallant said, adding that he hopes Iran and Hezbollah \"will think this through and won’t get to a point where they will force us to cause significant damage and increase the chances of war breaking out on additional fronts.\"\nHezbollah launched overnight into Monday salvos of rockets in response to Israeli attacks on south Lebanon, targeting troops stationed in northern Israel.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to military figures.", "location": "Israel", "classification": "security", "score": 0.6218330238264344, "event_breakdown": "Israeli soldiers killed by anti-tank missiles\nHezbollah attacks on northern Israel"}, {"id": "1a78d0d3-ef35-43e9-96ba-7da731e04790", "title": "IDF Rabbis Rule Most Soldiers Must Not Fast on Tisha BAv | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 8 Av 5784 – Monday , August 12 , 2024", "date": "2024-08-12 11:15", "url": "https://www.jewishpress.com/news/jewish-news/holiday-news/idf-rabbis-rule-most-soldiers-must-not-fast-on-tisha-bav/2024/08/12/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Traditional customs of mourning apply during the day, most notably fasting from sundown to sundown and reading the Book of Lamentations.\nHezbollah has vowed revenge for a separate Israeli airstrike in Beirut which killed Fuad Shukr.\nHe was responsible for a deadly rocket attack on Majdal Shams, which killed 12 children in the Druze village.\nNearly 80,000 Israelis were forced to evacuate their homes near the Lebanon border when Hezbollah began launching rockets and drones in October.\nHamas has also been holding captive two Israeli civilians since 2014 and 2015, and the bodies of two soldiers killed in 2014.", "location": "Lebanon", "classification": "security", "score": 0.996809897457367, "event_breakdown": "Reported events:\nOctober 2018 - nearly 80,000 Israelis evacuated near the Lebanon border due to rockets and drones from Hezbollah.\nJanuary 2020 - rockets from Hezbollah on Majdal Shams, Syria which killed 12 children."}, {"id": "e8466607-4a01-4b49-93ab-6b9de784e0fb", "title": "Hezbollah fires rockets into Israel as threat of Iran attack looms", "date": "2024-08-12 10:30", "url": "https://www.egyptindependent.com/hezbollah-fires-rockets-into-israel-as-threat-of-iran-attack-looms/", "domain": "egyptindependent.com", "domain_classification": "Unknown", "message": "Haifa, Israel CNN — Hezbollah fired a barrage of rockets toward northern Hezbollah fired a barrage of rockets toward northern Israel on Sunday night, as Israeli forces remain on high alert for potential retaliation from Iran and its proxies following the assassination of a top Hamas leader last month.\nAbout 30 rockets were launched from Lebanon, the Israel Defense Forces (IDF) said, adding that some fell into open areas and no injuries were reported.\n“IDF forces are deployed and prepared in high readiness.\nAustin has ordered a guided-missile submarine to the Middle East and accelerated the arrival of a carrier strike group to the region ahead of an anticipated Iranian attack against Israel, the Pentagon said in a statement Sunday evening.\nThe office of Israeli Prime Minister Benjamin Netanyahu confirmed Israel will send a delegation to the talks.", "location": "Haifa, Israel", "classification": "security", "score": 0.8702275550127825, "event_breakdown": "Haifa, Israel, on Sunday; Office of the Prime Minister of Israel, regarding the Israel-Hamas talks on Sunday; Middle East and the Pentagon's statement on Sunday evening"}, {"id": "88a6cf49-f624-4fdf-952b-87065824442e", "title": "US orders strike group to accelerate deployment to Middle East amid fears of Iran attack on Israel", "date": "2024-08-12 05:30", "url": "https://www.theguardian.com/world/article/2024/aug/12/us-military-strike-group-jets-submarine-middle-east-iran-attack-israel", "domain": "theguardian.com", "domain_classification": "International", "message": "Analysts noted that it was rare for the Pentagon to publicly announce the deployment of a submarine.\nThe US military had already said it would deploy additional fighter jets and warships to the Middle East as Washington seeks to bolster Israeli defences.\nIsmail Haniyeh, the political leader of Iran-backed Hamas, was assassinated in the Iranian capital Tehran on 31 July, an attack that drew threats of revenge by Iran against Israel.\nIran has blamed Israel for the killing, but Israel has not claimed responsibility.\nWashington and regional mediators have since tried arranging the Gaza ceasefire-for-hostages deal but have run into repeated obstacles.", "location": "NULL", "classification": "security", "score": 0.6921912804614427, "event_breakdown": "* The US military has deployed additional fighter jets and warships to the Middle East as Washington seeks to bolster Israeli defences in the region.\n* Ismail Haniyeh, the political leader of Iran-backed Hamas, was assassinated on 31 July in the Iranian capital Tehran, drawing threats of revenge by Iran against Israel."}, {"id": "6fa31a5d-f980-4420-ae78-3fc6e7897d34", "title": "Israeli military says no change in civilian guidelines amid reports of looming Iranian attack", "date": "2024-08-12 01:15", "url": "https://www.9news.com.au/world/middle-east-conflict-israeli-military-says-no-change-in-civilian-guidelines-amid-reports-of-looming-iranian-attack-world-news/2e247b5e-3caf-40c5-9828-1106e96b8d2c", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The Israel Defence Forces reported around 30 rockets were launched from Lebanon on Sunday evening, though some fell into open areas and no injuries were reported.\n\"Following the sirens that sounded a short while ago in northern Israel, approximately 30 projectiles were identified crossing from Lebanon toward the area of Kabri, a number of which fell in open areas,\" the IDF said in a statement.\n(CNN)Earlier Sunday, the IDF said its instructions to the public have not changed amid a possible retaliatory attack from Iranian forces after the assassination of Hamas political leader Ismail Haniyeh.\n\"IDF forces are deployed and prepared in high readiness.\nThe office of Israeli Prime Minister Benjamin Netanyahu confirmed Israel will send a delegation to the talks.", "location": "-\nIsrael", "classification": "security", "score": 0.8505451903376492, "event_breakdown": "The Israel Defence Forces reported around 30 rockets were launched from Lebanon on Sunday evening."}, {"id": "86df2b1e-d10e-45ab-9302-29a43fa20f67", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 03:30", "url": "https://www.thesunchronicle.com/news/nation_world/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-a-deal-instead-of/article_44fbe158-4827-53fc-b571-cb6fbd8e6bab.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Israel widens evacuation orders in southern Gaza.\nHamas wants plans for a deal instead of more talksThe Israeli military has ordered more evacuations in southern Gaza a day after health authorities said an airstrike on a school-turned-shelter in the north killed at least 80 Palestinians", "location": "GAZA", "classification": "security", "score": 0.964864716110197, "event_breakdown": "Israel widens evacuation orders in southern Gaza"}, {"id": "fe79569d-7060-444c-9640-8a6dc6306364", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks | iNFOnews", "date": "2024-08-12 06:00", "url": "https://infotel.ca/newsitem/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-a-deal-instead-of-more-talks/it106128", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Vernon News Israel widens evacuation orders in southern Gaza.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "GAZA", "classification": "security", "score": 0.986274248741982, "event_breakdown": "Israeli air strikes in Gaza\nMilitants in Lebanon\nIsraeli military positions"}, {"id": "d0f77ce7-da51-41bd-91a7-cf476561542d", "title": "Air Force cancels vacations abroad for staff amid Iran threat", "date": "2024-08-12 11:30", "url": "https://www.ynetnews.com/article/hyhdiud90", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "In Israel, it remains uncertain whether Iran will coordinate an attack with Hezbollah, which threatened to respond tothe assassination of Fuad Shukr in Beirut", "location": "Israel", "classification": "security", "score": 0.9251673393881832, "event_breakdown": "Iran: Possibility of Coordination with Hezbollah for Attack\nHezbollah: Threatens Response to Assassination of Fuad Shukr in Beirut"}, {"id": "d1016950-258d-4806-b36f-a5dce10825ca", "title": "Raising the stakes - Newspaper", "date": "2024-08-12 05:30", "url": "https://www.dawn.com/news/1851738/raising-the-stakes", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "ISRAEL’S criminal actions have again pushed the Middle East to the edge of the precipice, unleashing fears of a wider conflict.\nIts assassination in quick succession of top Hamas leader Ismail Haniyeh in Iran, and senior Hezbollah commander Fuad Shukr in Lebanon, further raised the stakes in a dangerous escalation of regional tensions.\nJust a week earlier, Israeli Prime Minister Benjamin Netanyahu undertook a high-profile trip to Washington, where he received enthusiastic bipartisan support.\nOstensibly aimed at mitigating the risk of a broader conflict, it only exacerbated tensions in the Middle East.\nIsrael’s escalation has pushed the Middle East to the brink of a wider war.", "location": "Middle East", "classification": "security", "score": 0.542832125731241, "event_breakdown": "Israel's assassination of top Hamas leader Ismail Haniyeh in Iran, and senior Hezbollah commander Fuad Shukr in Lebanon."}, {"id": "eee8d0d6-cebe-4b2d-9115-ffbcaeaad93e", "title": "Israel expects attack by Iran , Hezbollah this week", "date": "2024-08-12 06:15", "url": "https://www.siasat.com/israel-expects-attack-by-iran-hezbollah-this-week-3077671/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Tel Aviv: The Israeli government is expecting a combined attack from Iran and Hezbollah this week following a new intelligence assessment.\nSources in Israel’s Defence Ministry told IANS that Minister Yoav Gallant had a detailed discussion on the Iranian plans with the US Defence Secretary, Lloyd Austin on Sunday.\nThe statement also said that the US defence Secretary had ordered the deployment of Aircraft carrier Abraham Lincoln to move to the Middle East.\nHezbollah military chief Fuad Shukr was also assassinated hours before the killing of Ismail Haniyeh.\nIsrael had blamed Shukr for being responsible for the recent missile attack by Hezbollah on a soccer ground in Majdal Shams in Golan Heights in Israel leading to the death of 12 children.", "location": "Tel Aviv", "classification": "security", "score": 0.4990104597423326, "event_breakdown": "Event 1: Tel Aviv: The Israeli government is expecting a combined attack from Iran and Hezbollah this week following a new intelligence assessment.\nEvent 2: Israel had blamed Hezbollah military chief Fuad Shukr for being responsible for the recent missile attack by Hezbollah on a soccer ground in Majdal Shams in Golan Heights in Israel leading to the death of 12 children."}, {"id": "8825b450-0cbe-4fdd-a771-7fba8aec254d", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 01:15", "url": "https://www.wjol.com/syndicated-article/?id=1578632", "domain": "wjol.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.915325127678105, "event_breakdown": "Israel is targeting Hezbollah and Hamas militants in Lebanon and Palestine, as tensions escalate."}, {"id": "7d2c3e96-ade9-41e3-ae0b-d5ce91d472df", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 01:15", "url": "https://www.kdks.fm/syndicated-article/?id=1578632", "domain": "kdks.fm", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.915325127678105, "event_breakdown": "Israel-Hamas War, Assassinations of Hamas and Hezbollah Leaders, IDF strikes in Lebanon"}, {"id": "dad84fee-4734-44a0-9b5b-107e34260834", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 00:30", "url": "https://www.wntxradio.com/syndicated-article/?id=1578632", "domain": "wntxradio.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "Israel", "classification": "security", "score": 0.915325127678105, "event_breakdown": "IDF kills top Hezbollah military commander Fuad Shukr in precision missile strike in Beirut, Lebanon."}, {"id": "1c1b1849-e1b4-428b-953b-5885b09d6aa0", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis - WEIS | Local & Area News , Sports , & Weather", "date": "2024-08-12 00:00", "url": "https://weisradio.com/2024/08/11/israel-gaza-live-updates-idf-expands-evacuation-orders-in-khan-younis/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "pawel.gaul/Getty Images(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.9253451462425654, "event_breakdown": "Location: Israel\nEvent: Tension escalates after the killing of two Hamas and Hezbollah leaders\nOn Monday, it was reported that 18 Palestinians were killed in eastern and central Khan Yunis.\nOn Tuesday, Israel confirmed it had assassinated another Hezbollah commander in strike on Lebanon."}, {"id": "b26b845a-c835-430f-a698-594897106f44", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 00:30", "url": "https://www.wjnt.com/syndicated-article/?id=1578632", "domain": "wjnt.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA", "classification": "security", "score": 0.915325127678105, "event_breakdown": "Israel: IDF confirms to have killed top Hezbollah commander Fuad Shukr in a precision missile strike  Tuesday in Beirut, Lebanon."}, {"id": "f14bbd2e-d7ba-4923-9533-fb078b41534f", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 00:30", "url": "https://www.myiowainfo.com/syndicated-article/?id=1578632", "domain": "myiowainfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY,  Gaza Strip", "classification": "security", "score": 0.915325127678105, "event_breakdown": "Deadliest day for Israel since Gaza conflict flaredIsraeli Prime Minister Benjamin Netanyahu on Tuesday announced that an Israeli airstrike in the Gaza Strip had killed Bahaa Abu Al-Ata, a commander of Palestinian Islamic Jihad, a militant group based in Gaza that fights alongside Hamas against Israel.\nGaza Strip Militant commander Bahaa Abu Al-Ata killedIsrael has killed Bahaa Abu Al-Ata, a commander of Palestinian Islamic Jihad, in a strike in Gaza. The Israeli strike reportedly targeted Al-Ata’s wife, killing her as well, and their youngest son.\nDeif, who is said to be responsible for several Hamas bombings, has survived several assassination attempts."}, {"id": "90251841-f516-492d-a17d-c5e930ddf0d4", "title": "World - HITS FM", "date": "2024-08-12 09:30", "url": "https://hitsfm.net/world/1eae97cf6207832daddcf0a1ecac4b91", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "pawel.gaul/Getty Images(NEW YORK) -- As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nThe official said that both Israel and Hamas have \"very firm positions\" on \"about four or five issues\" each.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9399641526018937, "event_breakdown": "At least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nIsrael confirmed it had assassinated another Hezbollah commander in a strike on Lebanon on Monday.\nHamas' military chief, Mohammed Deif, was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "3c9be12d-2d18-4304-9858-829adf54b957", "title": "Israel - Gaza updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 10:45", "url": "https://www.koka.am/syndicated-article/?id=1578652", "domain": "koka.am", "domain_classification": "Unknown", "message": "The IDF ordered civilians east of Khan Younis to evacuate Thursday.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY.", "classification": "security", "score": 0.9375421705478134, "event_breakdown": "IDF ordered civilians east of Khan Younis to evacuate and Israel killed a Hezbollah commander and several Palestinians."}, {"id": "804e64c4-d930-4019-bb70-baa924f815b9", "title": "Israel - Gaza updates : IDF expands evacuation orders in Khan Younis - WEIS | Local & Area News , Sports , & Weather", "date": "2024-08-12 11:00", "url": "https://weisradio.com/2024/08/12/israel-gaza-updates-idf-expands-evacuation-orders-in-khan-younis/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "The IDF ordered civilians east of Khan Younis to evacuate Thursday.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY.", "classification": "security", "score": 0.9375421705478134, "event_breakdown": "1. The Israel Defense Forces (IDF) ordered civilians east of Khan Younis to evacuate on Thursday.\n2. Israel killed another Hezbollah commander, Fuad Shukr, in a precision missile strike Tuesday in Beirut, Lebanon."}, {"id": "6115d9fe-92e6-4d6c-9333-4c467e41770d", "title": "ABC World - WOND", "date": "2024-08-12 11:00", "url": "https://wondradio.com/abc-world/d8f2fd7a923d1b70320d1a78ca5ed8c5", "domain": "wondradio.com", "domain_classification": "Unknown", "message": "-ABC News' Morgan WinsorWorld leaders react to Israeli attack on school killing 85 PalestiniansLeaders around the world have condemned an Israeli strike on a school in Gaza, making an appeal to the international bodies to stop the killing of civilians and protect displaced Palestinians.\nA spokesperson for PRCS told ABC News that the organization’s medical teams were stopped by Israeli troops from reaching the wounded.\nABC News has reached out to the Israel Defense Forces for comment.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9026515037351208, "event_breakdown": "-Israeli strike kills Hezbollah commander Samir Kuntar -ABC News' Morgan Winsor\n-Israeli airstrike kills Hamas commander in Gaza Strip -ABC News' Jason Osier\n-Palestinian protesters clash with Israeli forces in Jerusalem -ABC News' Jason Osier\n-Israeli airstrike kills two Hamas commanders in Gaza Strip -ABC News' Jason Osier\n-Israeli airstrike kills senior Islamic Jihad commander in Gaza -ABC News' Jason Osier\n-Israeli airstrike kills top Islamic Jihad commander in Gaza -ABC News' Jason Osier"}, {"id": "80b00f5c-0970-4ab7-a37d-2c8b90a89155", "title": "US orders carrier group to hasten Middle East arrival", "date": "2024-08-12 04:30", "url": "https://www.thedailystar.net/news/world/news/us-orders-carrier-group-hasten-middle-east-arrival-3675171", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Bystanders and firefighters look as fire engulfs a car targeted by an Israeli strike in the southern Lebanese city of Sidon on August 9, 2024.\nPhoto: AFPUS Defense Secretary Lloyd Austin ordered an aircraft carrier group to hasten its arrival in the Middle East, the Pentagon said Sunday, as mounting tensions raise fears of a region-wide war.\nAustin ordered the aircraft carrier strike group led by the USS Abraham Lincoln, and equipped with F-35 fighters, to \"accelerate its transit\" to the region, said Pentagon spokesman Major General Pat Ryder.\nThe United States announced last week that it was deploying the strike group, as well as additional ballistic missile defense-capable cruisers and destroyers, and a fighter squadron.\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 the military says are dead.", "location": "LEBANON", "classification": "security", "score": 0.8166796285352848, "event_breakdown": "Event 1: On August 9, 2024, a car was targeted by an Israeli strike in the southern Lebanese city of Sidon. The incident was captured on film by Agence France-Presse."}, {"id": "88cb4d6f-54e1-492a-8c04-4a130496a6be", "title": "US deploys guided missile submarine to Middle East as Iran holds military drills following death of Hamas leader", "date": "2024-08-12 03:00", "url": "https://news.sky.com/story/us-deploys-guided-missile-submarine-to-middle-east-as-iran-holds-military-drills-following-death-of-hamas-leader-13195714", "domain": "news.sky.com", "domain_classification": "International", "message": "It comes after Iran's Revolutionary Guards began military drills on Friday in the western province of Kermanshah close to the border with Iraq.\nImage: The Iranian Revolutionary Guards have been carrying out drills in the west of the country.\nAdvertisementBarak Ravid, a reporter with US media site Axios, said his two sources told him this marks a change in Israel's assessment of Iran's position.\nPic: ReutersThe Revolutionary Guards have been pushing for a severe response while Mr Pezeshkian believes this should be avoided, Mr Ravid claims.\nGaza's Hamas-run health ministry says the number of Palestinians killed in the Israeli response is approaching 40,000.", "location": "IRAQ", "classification": "security", "score": 0.7401059665560747, "event_breakdown": "Target event:\nIran's Revolutionary Guards started military drills on several fronts on Friday, testing its attack drones. The tests are taking place in Kermanshah in western Iran, close to the border with Iraq."}, {"id": "56100261-b39b-415f-b90a-c56c2c920db3", "title": "Hezbollah says two fighters killed in Israeli strike", "date": "2024-08-12 04:30", "url": "https://www.bssnews.net/news-flash/203450", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon, Aug 12, 2024 (BSS/AFP) - Lebanon's Hezbollah movement said an Israeli air strike on Sunday killed two fighters from the Iran-backed group, with the health ministry reporting another death from an attack days ago.\nAn \"Israeli strike that targeted the village of Taybeh today left two dead,\" the Lebanese health ministry said in a statement.\nHezbollah confirmed they were group fighters, killed in Taybeh near the border with Israel.\nThe Israeli military said it had \"struck throughout the day several Hezbollah military structures in the area of Adaisseh\", which is located next to Taybeh.\nAccording to the health ministry, at least one Lebanese and 11 Syrians were injured, two seriously, in an Israeli strike on Maaroub, near Derdghaiya.", "location": "Taybeh", "classification": "security", "score": 0.9457075218491945, "event_breakdown": "Location: Lebanon, Israel\nTarget: Israeli forces kill two Hezbollah fighters\nAn Israeli airstrike killed two Hezbollah fighters in a village near the border with Israel on Sunday. Hezbollah later confirmed that the two men were members of the group. The Israeli military said it had also struck Hezbollah targets near the Syrian border on Sunday."}, {"id": "7d326f21-c15f-497e-ac14-d736275e263e", "title": "Hezbollah Retaliates Against North Israel Following Maaroub Strike", "date": "2024-08-12 10:45", "url": "https://dailystar.com.lb/hezbollah-retaliates-israel-maaroub-strike/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Overnight into Monday, Hezbollah fired a barrage of rockets towards northern Israel in retaliation for Israeli strikes in southern Lebanon.\nThe Israeli military reported that approximately 30 projectiles were fired from Lebanon, targeting the area near Kabri, although no casualties were reported.\nThe Israeli airstrikes also resulted in casualties; two Hezbollah fighters were confirmed killed in Taybeh and additional fatalities from earlier strikes.\nThe Israeli military continued its operations against Hezbollah positions in Adaisseh, adjacent to Taybeh.\nIn retaliation, Hezbollah targeted an Israeli military base near Nahariya with Katyusha rockets and surveillance installations in Metula.", "location": "METULA", "classification": "security", "score": 0.9977413382317725, "event_breakdown": "Event 1: Hezbollah fires barrage of rockets towards northern Israel\nEvent 2: Israeli military attacked Hezbollah positions in Adaisseh, adjacent to Taybeh\nEvent 3: Hezbollah targeted an Israeli military base near Nahariya with Katyusha rockets"}, {"id": "212695b5-378e-4c24-a42f-2c853a3b93c6", "title": "Gazans flee as Israeli forces push into Khan Yunis", "date": "2024-08-12 04:00", "url": "https://dunyanews.tv/en/World/830229-gazans-flee-as-israeli-forces-push-into-khan-yunis", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Gazans flee as Israeli forces push into Khan YunisWorld World Gazans flee as Israeli forces push into Khan YunisPalestinians fled southern Gaza's main city on Sunday as Israel warned of a new military operation.\nUmm Sami Shahada, a 55-year-old displaced Palestinian, said she had \"fled Gaza City at the start of the war for Khan Yunis\", hoping to find shelter.\nWitnesses told AFP that Israel carried out a strike on Khan Yunis, wounding several people.\nThe military said its air forces hit militants in Rafah, further south, and \"struck approximately 30 Hamas terror targets\" across Gaza over the past day.\nPalestinian Authority leader Mahmud Abbas is due to visit Moscow next week to discuss the Gaza war with Russian President Vladimir Putin, official Russian media said citing the Palestinian ambassador.", "location": "GAZA CITY", "classification": "security", "score": 0.820101282741256, "event_breakdown": "Gaza City, Khan Yunis, Rafah"}, {"id": "65cb55aa-fc17-48e6-9fc6-75c86e81313e", "title": "Netanyahu to cabinet :  These are fateful days , dont publicly discuss security matters  ", "date": "2024-08-12 06:15", "url": "https://www.israelnationalnews.com/news/394477", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Prime Minister Benjamin Netanyahu has instructed his cabinet not to publicly discuss security matters in the coming days amid the tense wait for Iran and Hezbollah's retribution for the elimination of Ismail Haniyeh and Fuad Shukr, Kan Reshet Bet reported on Monday.\n\"These are fateful days,\" Netanyahu told the ministers and asked them to remain silent on matters of defense.\nJerusalem is preparing for an Iranian attack that is more extensive than the previous one in April.\nIt is understood that Iran has returned to its promises as it has threatened since the elimination of Ismail Haniyeh.\nThe announcement was made in a statement summarizing a phone call between Austin and Defense Minister Yoav Gallant.", "location": "Jerusalem", "classification": "security", "score": 0.4478288373615007, "event_breakdown": "* Jerusalem bracing for \"doomsday\" scenario as Iran expected to retaliate for the elimination of two top pro-Iranian Islamic Revolutionary Guard Corps officers\n* Israeli banks on high alert in case of cyber attack\n* Israeli military on high alert in northern Israel due to suspicions of Hezbollah retaliation\n* IDF preparing to use anti-missile systems to thwart potential Hezbollah attack."}, {"id": "42b686b1-b991-45bd-83f0-871f09ebe0ff", "title": "Press TVs news headlines", "date": "2024-08-12 04:15", "url": "https://www.presstv.ir/Detail/2024/08/12/731197/Heds", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "US-Israeli genocide in GazaRelentless Israeli strikes continue to claim Palestinian lives in Gaza as the regime presses ahead with its air and artillery strikes across the besieged strip.\nIn central Gaza, three civilians were killed in the Israeli bombing of homes in the Sheikh Radwan neighborhood in Gaza City.\nIt denounced Washington for violating Iraq’s sovereignty and supporting the Israeli regime at the expense of regional security.\nHezbollah retaliationThe Lebanese resistance movement Hezbollah says it has targeted an Israeli military position in the northern occupied Palestinian territories.\nSince the start of the Israeli genocide in Gaza, Hezbollah and the regime’s military have been exchanging fires along Lebanon’s southern border almost on a daily basis.", "location": "GAZA", "classification": "security", "score": 0.9797145283152527, "event_breakdown": "Relevant Events:\nIsraeli air strikes in Gaza\nHezbollah retaliation against Israel"}, {"id": "73f2295c-d500-46ee-83d2-c3eda41cac2d", "title": "Rabbinate instructs Israeli soldiers not to fast on Tisha BAv mourning day", "date": "2024-08-12 10:30", "url": "https://www.jwire.com.au/rabbinate-instructs-israeli-soldiers-not-to-fast-on-tisha-bav-mourning-day/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home News / Rabbinate instructs Israeli soldiers not to fast on Tisha B'Av mourning day – J-WireRabbinate instructs Israeli soldiers not to fast on Tisha B’Av mourning dayRead on for articleThe Israel Defence Forces Military Rabbinate instructed soldiers not to fast during the Tisha B’Av day of mourning if they are engaged in “operational activities.”According to the rabbinate, “Fasting during operational activity is prohibited; it is a life-threatening matter.”Tisha B’Av, commemorates the destruction of the First and Second Temples, and other tragedies which occurred on the ninth day of the Hebrew month of Av.\nTraditional customs of mourning apply during the day, most notably fasting from sundown to sundown and reading the Book of Lamentations.\nHezbollah has vowed revenge for a separate Israeli airstrike in Beirut which killed Fuad Shukr.\nHe was responsible for a deadly rocket attack on Majdal Shams, which killed 12 children in the Druze village.\nHamas has also been holding captive two Israeli civilians since 2014 and 2015, and the bodies of two soldiers killed in 2014.", "location": "ISRAEL", "classification": "security", "score": 0.9924542569717741, "event_breakdown": "IDF Soldier's told not to fast on Tisha B'Av, Hezbollah vows revenge for Beirut bombing, Hamas holding captive two Israelis."}, {"id": "99573bd4-5057-4050-a3ba-2994c47b5d82", "title": "Israeli Bedouin communities affected by missile attacks - Israel News", "date": "2024-08-12 11:00", "url": "https://www.jpost.com/israel-news/article-814350", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Financially, it makes sense to let a rocket hit a patch of dirt if that's where it's headed, but the government refuses to recognize Bedouin communities, making the distinction between dirt and a Bedouin village impossible for the Dome.\nSubscribe to The Jerusalem Post Newsletter Subscribe NowFor a larger piece I'm working on for my internship I had the pleasure of meeting the Al-Zaidat Bedouin family, and interviewing them at their home in Ramat Ztiporim.\nOn Birthright, they took us to a \"Bedouin village\" to learn about the community and the \"harmonious relationship between Arabs and Jews\" in Israel.\nBut where they took us was not a \"real\" Bedouin village.\nIf Iran attacks, I will be thinking of the Al-Zaidat family and hoping that their desert is how it was when I visited, quiet and still.", "location": "RAMAT ZTIPORIM", "classification": "security", "score": 0.5931011611110859, "event_breakdown": "The events listed in the text are:\n- Dome of the Rock: The government refuses to recognize Bedouin communities, making the distinction between dirt and a Bedouin village impossible for the Dome."}, {"id": "add22cb6-7dd8-4457-8ee3-8379d168d9da", "title": "Post Haniyeh killing , Israel faces Hamas 2 . 0 in a grinding war of attrition", "date": "2024-08-12 11:00", "url": "https://www.firstpost.com/opinion/post-haniyeh-killing-israel-faces-hamas-2-0-in-a-grinding-war-of-attrition-13803699.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Sinwar’s surprise appointment, contradicting news reports of the high probability of Haniyeh’s predecessor Khaled Mashal replacing him, is a stern message to Israel: Hamas remains united and strong and will fight it out.\nIsrael has fought five wars with Hamas, including the ongoing conflict, but the terrorist outfit has survived every blow.\nIn the same month, a US intelligence report stated that only 30-35 per cent of Hamas members were killed.\npic.twitter.com/zKlowIwrYC — Israel War Room (@IsraelWarRoom) May 18, 2024Hamas guerrillas let IDF convoys pass and assemble in an area for hours.\nIn some instances, according to the report, Hamas heavy weapons were brought out from tunnels camouflaged with earth.", "location": ")\nGAZA", "classification": "security", "score": 0.5248362056340042, "event_breakdown": "new appointment in Hamas, surviving war, heavy weapons camouflaged"}, {"id": "3b88b541-450d-4da7-a4d1-18296e027d2a", "title": "Nigeria and the Symbolism of the Paris Olympics – THISDAYLIVE", "date": "2024-08-12 04:00", "url": "https://www.thisdaylive.com/index.php/2024/08/12/nigeria-and-the-symbolism-of-the-paris-olympics/", "domain": "thisdaylive.com", "domain_classification": "Unknown", "message": "The Paris Olympics is the latest iteration of great power competition in sports.\nNigeria’s performance at the Paris Olympics mirrors the extent of our preparations, investment, and commitment.\nNigeria’s performance at the Paris Olympics mirrors the extent of our preparations, investment, and commitment.\nThe contrast between the Russian-Ukraine conflicts, the Hamas brouhaha and the Paris Olympics is obvious.\nThe contrast between the Russian-Ukraine conflicts, the Hamas brouhaha and the Paris Olympics is obvious.", "location": "PARIS", "classification": "security", "score": 0.78737972174888, "event_breakdown": "Relevant Events:\nRussian-Ukraine Conflicts\nHamas Brouhaha\nParis Olympics"}, {"id": "27f62805-4bab-4deb-8a2a-125d946d1d69", "title": "Courage under fire : Utah National Guard Korean War legacy Part 2 – St George News", "date": "2024-08-12 01:15", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/11/dld-courage-under-fire-the-utah-national-guards-korean-war-legacy-part-2/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "The 213th Field Artillery Battalion, B-Battery's full complement of M7 105mm self-propelled howitzers during the Battle of Kapyong, 1951.\nFacing the Chinese troops were 418,000, well-trained U.N. troops who enjoyed greater firepower and air superiority making them a very potent fighting force.\n“The Korean line had collapsed and then the Chinese 60th Division came swooping down into the canyon from the north.\nIt was only from the east that retreating Chinese soldiers ran headlong into the U.S. troops.\nInitially unaware of the seriousness of the battle, Matheson later learned the tremendous odds the 213th faced.", "location": "Based on the text provided, I was unable to determine a specific location for the event described.", "classification": "security", "score": 0.46888086588128874, "event_breakdown": "Battle of Kapyong, 1951 (South Korea)"}, {"id": "6e3a8fa5-7648-4c39-90f9-9a9f75122457", "title": "FReeper Canteen ~ Hall of Heroes : Gen George S Patton ~ 12 August 2024", "date": "2024-08-12 01:15", "url": "https://freerepublic.com/focus/f-news/4257839/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "He attended the Virginia Military Institute for one year and went on to graduate from the United States Military Academy at West Point on June 11, 1909.\nIn 1912 he represented the United States at the Stockholm Olympics in the first Modern Pentathlon.\nUsing his first-hand knowledge of tanks, Patton organized the American tank school in Bourg, France and trained the first 500 American tankers.\nAn outspoken advocate for tanks, Patton saw them as the future of modern combat.\nWhen the German Blitzkrieg began on Europe, Patton finally convinced Congress that the United States needed a more powerful armored striking force.", "location": "France", "classification": "security", "score": 0.6946734905182083, "event_breakdown": "George Patton helped to organize the first American tank school in France and trained the first 500 American tankers.\nGeorge Patton represented the United States at the first modern Olympics in Stockholm in 1912.\nGeorge Patton finally convinced Congress that the United States needed a more powerful armored striking force when the German Blitzkrieg began on Europe."}, {"id": "81eed4d1-243a-4ccc-975e-adf8498cd547", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 04:30", "url": "https://www.breakingnews.ie/world/south-korea-and-us-preparing-for-summer-military-drills-1660181.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "AdvertisementAdvertisementLee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "Seoul, South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea launches balloons towards South Korea's presidential compound\nSouth Korea and the United States conduct combined military exercises and expand their nuclear deterrence strategy"}, {"id": "49b41a15-cd52-42e4-894b-a365a67a7396", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 05:45", "url": "https://www.echo-news.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea fires projectiles towards South Korea\nSouth Korea military spokesperson Lee Sung Joon said, \"About 19,000 South Korean troops will participate in the drills, which is an essential element for maintaining a strong defense posture to protect the Republic of Korea.\"\nSouth Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea's military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities."}, {"id": "6d14ff31-bb29-47a2-8102-5cda7ed005ea", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 04:15", "url": "https://www.lancashiretelegraph.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "Seoul, South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea flew helium balloons towards the South on Monday for the first time since July, with 10 landing north of the South Korean capital Seoul."}, {"id": "acc8d8aa-eab4-4735-b5f8-5ff84fe8f407", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 04:45", "url": "https://www.eadt.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea fires 240 balloons towards South Korea, South Korean military says\nTokyo Olympics open with 'simple' ceremony"}, {"id": "a728bf53-6779-43c4-9c13-c3777fe01449", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:00", "url": "https://www.yahoo.com/news/south-korea-us-start-summer-024844459.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SOUTH KOREA", "classification": "security", "score": 0.6196899653187654, "event_breakdown": "North Korean missile tests, a joint South Korea-US military exercise, a mock North Korean nuclear attack on the South Korean Presidential Compound, and the nomination of Kim Yong-hyun as South Korea's defense minister."}, {"id": "224a4cec-4706-437f-b77a-333e1cb3acb4", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:00", "url": "https://www.aol.com/south-korea-us-start-summer-024844382.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SEOUL, South Korea.", "classification": "security", "score": 0.6196899653187654, "event_breakdown": "North Korea fires short-range projectiles into East Sea - South Korea conducts military exercises near disputed sea border with North Korea - U.S. troops may stage an evacuation exercise in the South Korea metropolitan area."}, {"id": "a73dcd90-e943-4fcd-9281-8ba8f843724a", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 06:30", "url": "https://www.ipswichstar.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "ipswichstar.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "The Republic of Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea launches balloons towards South Korea, South Korean military says"}, {"id": "24d8cd88-e699-4f81-a2ca-4af150c6937a", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 04:30", "url": "https://www.theboltonnews.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korean military conducts further launches of balloons towards South Korea\nNorth Korea launched 240 balloons towards the South on Monday, according to South Korea’s military. North and South Korea were holding talks on Tuesday to discuss the fate of the South Korean-run Mount Kumgang resort and lift other sanctions against the North."}, {"id": "c2e10794-bc32-4ed8-8b35-16fddd83bd4a", "title": "Zelensky , for the First Time , Claims Ukraine Has Invaded Russia To  Restore Justice  ", "date": "2024-08-12 11:00", "url": "https://www.nysun.com/article/zelensky-for-the-first-time-claims-ukraine-has-invaded-of-russia-to-restore-justice", "domain": "nysun.com", "domain_classification": "Unknown", "message": "Involved are five brigades, making for a total of 10,000 Ukrainian soldiers inside Russia and supporting from Ukraine’s neighboring Sumy region.\nMoving quickly, the Ukrainians captured as many as 1,000 Russian soldiers and now control about 400 square miles of Russian territory.\nA burned car at Kursk, Russia, August 11, 2024.\nWhen Russia invaded Ukraine in February 2022, civilians protested against Russian troops, often calling them ‘Orcs’ to their faces.\nResidents of the apartment building damaged after shelling by the Ukrainian side leave an area at Kursk, Russia, August 11, 2024.", "location": "RUSSIA", "classification": "security", "score": 0.9083562937508786, "event_breakdown": "Five brigades, totaling 10,000 Ukrainian soldiers, are inside Russia and supporting from the neighboring Sumy region. The Ukrainian troops have captured about 1,000 Russian soldiers, taking control of approximately 400 square miles of Russian territory.\n\nResidents of an apartment building in Kursk, Russia, leave an area after it was damaged by shelling from Ukraine. When Russia invaded Ukraine in February 2022, civilians often protested against Russian troops, calling them ‘Orcs’ to their faces."}, {"id": "824906d6-e3fc-4547-b4ad-af1646a76695", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 06:15", "url": "https://www.lbc.co.uk/world-news/87fa3512308248d3b1908b8d354d6b38/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The annual drills could trigger a belligerent response from North Korea.\nLee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.", "location": "Seoul, South Korea", "classification": "security", "score": 0.6107045281368731, "event_breakdown": "North Korea launches 240 balloons towards South Korea, at least 10 reported to have landed in the South"}, {"id": "a7357265-42c5-48f7-a907-0b4d285699c4", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:30", "url": "https://www.bostonglobe.com/2024/08/11/world/south-korea-us-miltary-drills-north-korea/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SEOUL, South Korea", "classification": "security", "score": 0.6196899653187654, "event_breakdown": "Location: South Korea\nReported Events:\n- South Korea and the United States will start their annual joint military exercises next week with focus on deterring and defending against North Korean nuclear threats.\n- The exercises come days after North Korea resumed sending propaganda leaflets over Seoul."}, {"id": "1d8d343d-68c1-4fc6-b772-2775ae36d0ef", "title": "Grand Theft Auto V Tops the Australian Charts", "date": "2024-08-12 01:45", "url": "https://www.vgchartz.com/article/462029/australia-weekly-week-31-2024/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Grand Theft Auto V Tops the Australian Charts - Sales/ 462 Viewsby, posted 11 hours agoGrand Theft Auto V has retaken first place on the Australian charts, according to IGEA for the week ending August 4, 2024.\nGrand Theft Auto Online re-entered the top 10 in sixth place.\nHogwarts Legacy climbed six spots to take second place, while Elden Ring was up three spots to third place.\nEA Sports College Football 25 remained in fourth place and Call of Duty: Modern Warfare III re-entered the top 10 in fifth place.\nRed Dead Redemption 2 dropped two spots to seventh place, South Park: The Fractured But Whole re-entered the charts in eighth place, and NBA 2K24 dropped from third to ninth place.", "location": "Australia", "classification": "security", "score": 0.41200915936809396, "event_breakdown": "Grand Theft Auto V Tops the Australian Charts"}, {"id": "5af25ac6-9175-44b8-a9b2-82952d5ad05d", "title": "IDF announces name of fallen soldier - The Jerusalem Post", "date": "2024-08-12 06:00", "url": "https://www.jpost.com/breaking-news/article-814321", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Sergeant Omer Ginzburg was killed in battle while fighting in the Gaza Strip, the IDF announced on Monday.\nSergeant Ginzburg, 19, from Kiryat Tivon, served in the 101st Battalion in the Paratroopers Brigade.\nGinzburg fell in the southern Gaza Strip.\nIDF troops operate in the Gaza Strip.\n(credit: IDF SPOKESPERSON'S UNIT)According to the IDF's tally, the death of Sergeant Ginzburg raises the total of soldiers killed on or since October 7 of last year to 690.", "location": "Gaza Strip", "classification": "security", "score": 0.9536852758193557, "event_breakdown": "Sergeant Omer Ginzburg killed in the Gaza Strip."}, {"id": "db4e03e7-4c3d-476b-81b8-4b805b76d76c", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 05:45", "url": "https://www.moneycontrol.com/news/world/south-korea-and-us-will-start-summer-military-drills-next-week-to-counter-north-korean-threats-12793367.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:South Korea and US will start summer military drills next week to counter North Korean threats", "location": ")\nPYEONGTAEK, SOUTH KOREA", "classification": "security", "score": 0.48661407078831787, "event_breakdown": "Referred to as \"Summertime exercise,\" South Korean and U.S. military drills are set to begin next Monday. The exercises are being undertaken to address potential North Korean threats. South Korea and the U.S. say they're defensive in nature but Pyongyang views them as invasion preparation. This year's drills come after North Korean leader Kim Jong-un's regime and South Korea traded fire last month, and North Korea also remains unresponsive to the South's offers of talks."}, {"id": "5140cda1-5cbf-46f3-aca3-ed4aaa4ee7ea", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:30", "url": "https://www.ksat.com/news/world/2024/08/12/south-korea-and-us-will-start-summer-military-drills-next-week-to-counter-north-korean-threats/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defense posture to protect the Republic of Korea,” using South Korea’s formal name.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "South Korea", "classification": "security", "score": 0.6137473954991904, "event_breakdown": "North Korea launches balloons toward South Korea on July 24, raising worries about the vulnerability of key South Korean facilities."}, {"id": "ce681e69-0ae6-400e-8ce1-b3bf31f83104", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 06:00", "url": "https://www.local10.com/news/world/2024/08/12/south-korea-and-us-will-start-summer-military-drills-next-week-to-counter-north-korean-threats/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defense posture to protect the Republic of Korea,” using South Korea’s formal name.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "South Korea", "classification": "security", "score": 0.6137473954991904, "event_breakdown": "North Korea fires balloons toward South Korea\nNorth Korea fires balloons toward South Korea"}, {"id": "9e0f0635-8445-4110-9dc8-c041b40d6e9b", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 06:00", "url": "https://isp.netscape.com/news/world/story/0001/20240812/d51ada6ac429757378322f8dcd209b15", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "South Korea and US will start summer military drills next week to counter North Korean threatsSEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SEOUL, South Korea.", "classification": "security", "score": 0.5796578244729546, "event_breakdown": "South Korea and US will start summer military drills next week to counter North Korean threatsMilitary exercises to be held in South Korea"}, {"id": "44bc2fd0-c3d1-4dec-8cea-72ef03c94c1b", "title": "More Russians are urged to flee Ukraine cross - border attack as the Kremlin scrambles to respond", "date": "2024-08-12 10:45", "url": "https://www.bostonglobe.com/2024/08/12/world/ukraine-russia-war/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nThey reportedly still hold the western part of the town, which is the site of an important natural gas transit station.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\n“Regrettably, the group of forces protecting the border didn’t have its own intelligence assets,” he said on his messaging app channel.\n“These reckless attacks endanger nuclear safety at the plant and increase the risk of a nuclear accident.", "location": "Ukraine", "classification": "security", "score": 0.6149420436433352, "event_breakdown": "Ukrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack. They reportedly still hold the western part of the town, which is the site of an important natural gas transit station."}, {"id": "3efb05b0-9df1-49a2-a6c9-8192bf1bffee", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 09:00", "url": "https://apnews.com/article/south-korea-us-military-drills-north-korea-nuclear-d51ada6ac429757378322f8dcd209b15", "domain": "apnews.com", "domain_classification": "International", "message": "SEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SEOUL, South Korea", "classification": "security", "score": 0.6196899653187654, "event_breakdown": "The Ulchi Freedom Guardian exercises will run from August 1 to August 28.\nSouth Korea and the United States will begin their annual joint military exercises on August 1st. The exercises are called Ulchi Freedom Guardian. They are designed to increase the readiness of the US and South Korean militaries. The annual exercises will involve tens of thousands of military personnel.US, South Korea to hold joint exercises next week despite North Korea's threat United States The exercises will run until August 28. This exercise will include scenario-based training, said Joint Chiefs of Staff spokesperson Col. Lee Peters, but he refused to give other details of the drills."}, {"id": "e7230b15-5919-4b33-8b84-9aae2e8e9a12", "title": "Hama Hamdan to Al - Manar : War Will Never End as the Israeli Enemy Envisions – Al - Manar TV Lebanon", "date": "2024-08-12 11:30", "url": "https://english.almanar.com.lb/2174559", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Senior Hamas official in Lebanon Osama Hamdan told Al-Manar that the war will never end as the Israeli enemy envisions, stressing that the war will end in favor of the resistance.\n“It is rare for a Hamas leader to be chosen unanimously, as happened with brother Sinwar.\nHamas official Osama Hamdan during an interview with Al-Manar via video link (Sunday, August 11, 2024).\nThe cohesion “has pleased the supporters and disturbed the enemies as it has proven that we can all work together regardless of the distance between battlefields and geography,” Hamdan told Al-Manar.\nOn the ceasefire talks, the senior Hamas official stressed that the resistance group’s stance is clear.", "location": "Lebanon", "classification": "security", "score": 0.4956295962724719, "event_breakdown": "2024 Israel–Palestine conflict: A senior Hamas official in Lebanon told Al-Manar that the war will never end as the Israeli enemy envisions, stressing that the war will end in favor of the resistance."}, {"id": "caeaa384-2760-447e-9dc1-e18e60ea4e12", "title": "Cleared for publication : Sergeant Omer Ginzburg fell in Gaza", "date": "2024-08-12 04:30", "url": "https://www.israelnationalnews.com/news/394473", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF Spokesperson's Unit cleared for publication on Monday morning that Sergeant Omer Ginzburg, aged 19, from Kiryat Tiv'on, a soldier in the 101st Battalion, Paratroopers Brigade, fell on Sunday during combat in the southern Gaza Strip.\nOn Sunday morning, IDF troops identified a terrorist cell exiting a tunnel shaft in the area of Rafah.\nIn another incident, the troops also identified a terrorist cell entering a military structure adjacent to IDF troops and struck the terrorist cell in cooperation with the IAF.\nIDF troops carried out a strike in the area from which projectiles were launched toward Kibbutz Kissufim on Saturday, as well as a Hamas military structure used by the Hamas’ rocket unit.\n\"The IDF will continue to act against the Hamas terrorist organization, which uses the Gazan civilians as a human shield for its terrorist activities and infrastructure,\" the IDF stated.", "location": "GAZA", "classification": "security", "score": 0.9574878303076297, "event_breakdown": "IDF Troops killed while operating in the southern Gaza strip on Monday morning, a 19-year-old soldier from Kiryat Tiv'on, a police officer who was critically injured in Asaf Maden after being shot by a suspected terrorist and Pedestrian killed by a car in the central west bank."}, {"id": "f9b023a4-ad39-47e8-8414-0820bc7302eb", "title": "Security forces still pursuing terrorist who murdered Yehonatan Deutsch", "date": "2024-08-12 06:45", "url": "http://www.israelnationalnews.com/news/394479", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF and security forces continue this morning (Monday) to pursue the terrorist who murdered 23-year-old Beit She'an resident Yehonatan Deutsch and wounded one other civilian in a drive-by shooting attack in the Jordan Valley.\nDeutsch graduated from the Beit She'an Yeshiva High School, was a counselor in the Bnei Akiva youth movement, and volunteered a good deal in his city.\nBeit She'an Mayor Noam Juma eulogized him: \"He was an amazing young man in ways that are difficult to describe.\nIn addition, a 33-year-old was moderately wounded after being shot at the nearby Mehola Junction.\nA MDA helicopter evacuated the moderately wounded victim who was suffering from wounds to his lower extremities.", "location": "Jordan Valley", "classification": "security", "score": 0.978683902963442, "event_breakdown": "IDF and security forces continue this morning (Monday) to pursue the terrorist who murdered 23-year-old Beit She'an resident Yehonatan Deutsch and wounded one other civilian in a drive-by shooting attack in the Jordan Valley.  It is reported in the Jordan Valley."}, {"id": "e6e88b25-db15-4d2b-8d81-97dbd9f52dea", "title": "Security forces still pursuing terrorist who murdered Yehonatan Deutsch", "date": "2024-08-12 06:15", "url": "https://www.israelnationalnews.com/news/394479", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF and security forces continue this morning (Monday) to pursue the terrorist who murdered 23-year-old Beit She'an resident Yehonatan Deutsch and wounded one other civilian in a drive-by shooting attack in the Jordan Valley.\nDeutsch graduated from the Beit She'an Yeshiva High School, was a counselor in the Bnei Akiva youth movement, and volunteered a good deal in his city.\nBeit She'an Mayor Noam Juma eulogized him: \"He was an amazing young man in ways that are difficult to describe.\nIn addition, a 33-year-old was moderately wounded after being shot at the nearby Mehola Junction.\nA MDA helicopter evacuated the moderately wounded victim who was suffering from wounds to his lower extremities.", "location": "Jordan Valley", "classification": "security", "score": 0.978683902963442, "event_breakdown": "IDF, security forces pursuing terrorist who murdered Yehonatan Deutsch and wounded another civilian in a drive-by shooting attack in the Jordan Valley."}, {"id": "9ecdef6b-a65c-450e-9d3b-4ea404f3a1d9", "title": "Cleared for publication : Sergeant Omer Ginzburg fell in Gaza", "date": "2024-08-12 08:00", "url": "http://www.israelnationalnews.com/news/394473", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF Spokesperson's Unit cleared for publication on Monday morning that Sergeant Omer Ginzburg, aged 19, from Kiryat Tiv'on, a soldier in the 101st Battalion, Paratroopers Brigade, fell on Sunday during combat in the southern Gaza Strip.\nOn Sunday morning, IDF troops identified a terrorist cell exiting a tunnel shaft in the area of Rafah.\nIn another incident, the troops also identified a terrorist cell entering a military structure adjacent to IDF troops and struck the terrorist cell in cooperation with the IAF.\nIDF troops carried out a strike in the area from which projectiles were launched toward Kibbutz Kissufim on Saturday, as well as a Hamas military structure used by the Hamas’ rocket unit.\n\"The IDF will continue to act against the Hamas terrorist organization, which uses the Gazan civilians as a human shield for its terrorist activities and infrastructure,\" the IDF stated.", "location": "GAZA", "classification": "security", "score": 0.9574878303076297, "event_breakdown": "New event: Soldier Omer Ginzburg from Kiryat Tiv'on, aged 19, from the 101st Battalion, Paratroopers Brigade died during combat in the Gaza Strip on Sunday."}, {"id": "33a27107-5678-473c-8bd4-18393caa3d77", "title": "Chicago  68 recalls a Democratic convention and a political moment like no other", "date": "2024-08-12 11:30", "url": "https://knpr.org/npr/2024-08-12/chicago-68-recalls-a-democratic-convention-and-a-political-moment-like-no-other", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Add the words, “Democratic National Convention” and millions more can visualize brawling delegates, billowing clouds of tear gas and police batons flailing at long-haired protestors.\nDonaldson Collection / Getty Images / Getty Images General view of the delegates from different states sit and stand during the 1968 Democratic National Convention, held at the International Amphitheatre in Chicago, Aug. 28, 1968.\nWhat happened during the 1968 Democratic National Convention?\nSanti Visalli / Getty Images / Getty Images People survey the damage done to Grant Park after riots broke out during a protest of the 1968 Democratic National Convention, Chicago, Aug. 28, 1968.\nSanti Visalli / Getty Images / Getty Images An anti-Vietnam War protestor confronts two National Guardsmen as a reporter records the exchange outside the 1968 Democratic National Convention, Chicago, August 1968.", "location": ")\nChicago, Illinois", "classification": "security", "score": 0.8693354609165204, "event_breakdown": "1968 Democratic National Convention, Chicago"}, {"id": "98f39b5a-c4da-4e44-a7f2-ffdd9be7f429", "title": "South Korea and US preparing for summer military drills", "date": "2024-08-12 04:30", "url": "https://www.yourlocalguardian.co.uk/news/national/24511578.south-korea-us-preparing-summer-military-drills/", "domain": "yourlocalguardian.co.uk", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defence posture to protect the Republic of Korea”, using South Korea’s formal name.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around US strategic assets.\nSouth Korea’s military said on Monday that the North launched about 240 balloons, but only 10 were known to have landed in the South, all in areas north of the capital Seoul.\nIt was the first time North Korea flew balloons towards the South since July 24, when rubbish carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defence minister.", "location": "South Korea", "classification": "security", "score": 0.5589576910352397, "event_breakdown": "North Korea launched balloons towards South Korea"}, {"id": "134fe399-34d5-412e-9c4c-b7b3c1540dad", "title": "More Russians urged to flee Ukraine attack as Kremlin scrambles to respond", "date": "2024-08-12 10:30", "url": "https://www.belfasttelegraph.co.uk/news/world-news/more-russians-urged-to-flee-ukraines-attack-as-kremlin-scrambles-to-respond/a1724708531.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "He said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometres (six miles) over the border after launching the attack.\nKursk residents recorded videos lamenting that they had to flee the border area, leaving behind their belongings, and pleading with Mr Putin for help.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nIt described the Russian forces responding to the incursion as “hastily assembled and disparate”.", "location": "RUSSIA", "classification": "security", "score": 0.8307107357888062, "event_breakdown": "Recent security events reported in the given time frame include:Ukrainian forces swiftly rolled into the town of Sudzha about 10 kilometres (six miles) over the border after launching the attack. Kursk residents recorded videos lamenting that they had to flee the border area, leaving behind their belongings, and pleading with Vladimir Putin for help. He noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids. It described the Russian forces responding to the incursion as “hastily assembled and disparate”."}, {"id": "501216f7-6bf5-4107-9e57-9341223e82a0", "title": "Russians urged to flee Ukraine cross - border attack as Kremlin scrambles to respond", "date": "2024-08-12 10:30", "url": "https://abcnews.go.com/International/wireStory/russians-urged-flee-ukraines-cross-border-attack-kremlin-112769969", "domain": "abcnews.go.com", "domain_classification": "International", "message": "He said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nKursk residents recorded videos lamenting they had to flee the border area, leaving behind their belongings, and pleading with Putin for help.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nIt described the Russian forces responding to the incursion as “hastily assembled and disparate.”In other developments:— The International Atomic Energy Agency said a fire near Ukraine’s Russian-occupied Zaporizhzhia Nuclear Power Plant had “no impact” on the facility’s safety.", "location": "UKRAINE", "classification": "security", "score": 0.6251758803700823, "event_breakdown": "* The Russian military has pushed its offensive in the Donbas and vowed to achieve its goals in Ukraine.\n* Ukrainian forces swiftly rolled into the town of Sudzha, approximately 10 kilometers over the border after launching an attack.\n* Kursk residents recorded videos lamenting that they had to flee the border area and pleading with Putin for help.\n* The Russian military has set up minefields in the border region, but has failed to deploy enough troops to block enemy raids."}, {"id": "d0bcc326-9382-45ac-aed7-0159158a309d", "title": "More Russians are urged to flee Ukraine cross - border attack as the Kremlin scrambles to respond - Boston News , Weather , Sports", "date": "2024-08-12 11:00", "url": "https://whdh.com/news/more-russians-are-urged-to-flee-ukraines-cross-border-attack-as-the-kremlin-scrambles-to-respond/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nThey reportedly still hold the western part of the town, which is the site of an important natural gas transit station.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\n“Regrettably, the group of forces protecting the border didn’t have its own intelligence assets,” he said on his messaging app channel.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine(Copyright (c) 2024 The Associated Press.", "location": "SUDzha", "classification": "security", "score": 0.8234126852112852, "event_breakdown": "Ukrainian forces launched a counterattack near the border town of Sudzha on Saturday, swiftly rolling into the town and taking up positions in the western part which houses an important natural gas transit station. While military officials have set up minefields in the border region, they have failed to deploy enough forces to block enemy raids. Additionally, the Ukrainian military does not have its own intelligence assets to assess the enemy's movements, leaving forces vulnerable to attack."}, {"id": "7caf9229-98e6-4428-832f-5039a5a7af80", "title": "More Russians are urged to flee Ukraine cross - border attack as the Kremlin scrambles to respond", "date": "2024-08-12 10:30", "url": "https://www.local10.com/news/world/2024/08/12/more-russians-are-urged-to-flee-ukraines-cross-border-attack-as-the-kremlin-scrambles-to-respond/", "domain": "local10.com", "domain_classification": "Unknown", "message": "A Russian Red Cross worker, back to a camera, listens to people evacuated from a fighting between Russian and Ukrainian forces in Kursk region, at a temporary residence center in Kursk, Russia, Sunday, Aug. 11, 2024.\n(AP Photo)KYIV – Russian President Vladimir Putin said Monday that Ukraine’s incursion into the Kursk region is an attempt by Kyiv to stop Moscow’s offensive in the Donbas region.\nHe said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.", "location": "The Kursk region in Russia", "classification": "security", "score": 0.731648416202835, "event_breakdown": "Russia-Ukraine conflict: Putin accuses Ukraine of trying to seize the Kursk region in order to impede Moscow's offensive. Ukrainian forces swiftly rolled into the town of Sudzha after launching a cross-border attack on the region."}, {"id": "7c78077d-c361-47c7-a630-1e9044bd6c27", "title": "Former Minnesota Senate Majority Leader : Tim Walz Is  Terrible in Crisis  ", "date": "2024-08-12 04:15", "url": "https://www.breitbart.com/politics/2024/08/11/former-minnesota-senate-majority-leader-tim-walz-terrible-crisis/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Former Minnesota Senate Majority Leader Paul Gazelka (R) criticized Gov.\n“My concern for him as a leader, number one, is he’s terrible in a crisis,” Gazelka told the outlet.\n….. Frey said he immediately telephoned Walz, at 6:29 p.m., relayed information, and asked him to send in the National Guard.\nAs Breitbart News’s Kristina Wong reported:Walz served in the Minnesota Army National Guard and retired at the rank of master sergeant, or an E-8.\nWalz has also faced criticism over reports that have shown Walz left the military before his unit deployed to Iraq, despite knowledge that the “National Guard Public Affairs Office” had warned of a “possible mobilization of roughly 2,000 troops from the Minnesota National Guard.”", "location": "Saint Paul, Minnesota", "classification": "security", "score": 0.7239331518850776, "event_breakdown": "Minnesota Senate Majority Leader Paul Gazelka criticized Gov. Tim Walz’s handling of riots, Kristina Wong reported for Breitbart News. The Senate Majority Leader said the DFL governor is “terrible in a crisis” and said it is difficult to lead in a political climate where he does not have enough information about what is going on."}, {"id": "89e5b4ed-a4a8-40f1-9ada-30861c5c6ea2", "title": "Russia urges residents to evacuate as Ukrainian forces hold key town", "date": "2024-08-12 11:45", "url": "https://wwmt.com/news/nation-world/russia-urges-residents-to-evacuate-as-ukrainian-forces-hold-key-town-kursk-surprise-cross-border-attack-zelenskyy-putin-kremlin-war-hostilities-incursion", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly about 10 kilometers (6 miles) over the border after launching the attack.\nThe Ukrainian operation is taking place under tight secrecy, and its goals — especially whether Kyiv's forces aim to hold territory or are staging a raid — remain unclear.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nUkraine's progress on Russian territory \"is challenging the operational and strategic assumptions\" of the Kremlin's forces, according to the Institute for the Study of War.\nIt described the Russian forces responding to the incursion as \"hastily assembled and disparate.\"", "location": "Based on the information in the text, I was unable to determine a specific location.", "classification": "security", "score": 0.8463342931834928, "event_breakdown": "Ukrainian forces swiftly advanced about 10 kilometers (6 miles) into Russian territory after launching an attack on a border post, according to reports on April 26. The operation, which took place under tight secrecy, is aimed at confusing the Russian military and disrupting their operations. Ukrainian Member of Parliament Anton Herashchenko described the latest incursion as an effort to divert Russian forces and that the military plans to establish a new \"front\" behind Russian troop lines. The US think tank Institute for the Study of War described the Russian response to the incursion as \"hastily assembled and disparate.\""}, {"id": "0d55cf76-c931-4b60-9630-34e04ff17543", "title": "Chicago  68 recalls a Democratic convention and a political moment like no other", "date": "2024-08-12 11:45", "url": "https://www.capeandislands.org/2024-08-12/chicago-68-recalls-a-democratic-convention-and-a-political-moment-like-no-other", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Add the words, “Democratic National Convention” and millions more can visualize brawling delegates, billowing clouds of tear gas and police batons flailing at long-haired protestors.\nDonaldson Collection / Getty Images / Getty Images General view of the delegates from different states sit and stand during the 1968 Democratic National Convention, held at the International Amphitheatre in Chicago, Aug. 28, 1968.\nWhat happened during the 1968 Democratic National Convention?\nSanti Visalli / Getty Images / Getty Images People survey the damage done to Grant Park after riots broke out during a protest of the 1968 Democratic National Convention, Chicago, Aug. 28, 1968.\nSanti Visalli / Getty Images / Getty Images An anti-Vietnam War protestor confronts two National Guardsmen as a reporter records the exchange outside the 1968 Democratic National Convention, Chicago, August 1968.", "location": "Chicago", "classification": "security", "score": 0.8693354609165204, "event_breakdown": "1968 Democratic National Convention, Chicago"}, {"id": "1ad11065-5db3-4b93-9fe0-a341eab7ad70", "title": "More Russians are urged to flee Ukraine cross - border attack as the Kremlin scrambles to respond", "date": "2024-08-12 10:30", "url": "https://isp.netscape.com/news/world/story/0001/20240812/afa42b9613323901bef07800ac2cae9e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Russia's Putin says Ukraine incursion into Kursk is an attempt to stop Moscow’s offensive in DonbasKYIV, Ukraine (AP) — Russian President Vladimir Putin said Monday that Ukraine’s incursion into the Kursk region is an attempt by Kyiv to stop Moscow’s offensive in the Donbas region.\nHe said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine© Copyright The Associated Press.", "location": "Kursk", "classification": "security", "score": 0.6799048970675865, "event_breakdown": "Location: Kursk region, Russia\nRussia’s President Vladimir Putin said Monday that Ukraine's incursion into the Kursk region is an attempt by Kyiv to stop Moscow's offensive in the Donbas region.\nIn addition, Putin said Russia has achieved its stated military goals in the Donbas region, but did not provide details. The Donbas is the industrial heartland of eastern Ukraine, where Moscow-backed rebels have been fighting the Ukrainian government since 2014."}, {"id": "e41c3fba-526c-4d0b-84f3-8ab8a23cfb02", "title": "More Russians urged to flee Ukraine attack as Kremlin scrambles to respond", "date": "2024-08-12 11:30", "url": "https://www.bournemouthecho.co.uk/news/national/24512051.russians-urged-flee-ukraines-attack-kremlin-scrambles-respond/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "He said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometres (six miles) over the border after launching the attack.\nKursk residents recorded videos lamenting that they had to flee the border area, leaving behind their belongings, and pleading with Mr Putin for help.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nIt described the Russian forces responding to the incursion as “hastily assembled and disparate”.", "location": "The Donbas region which includes Luhansk and Donetsk provinces.", "classification": "security", "score": 0.8307107357888062, "event_breakdown": "* The Russian military has pushed its offensive in the Donbas region\n* Ukrainian forces swiftly rolled into the town of Sudzha after launching an offensive\n* Kursk residents recorded videos pleading with Vladimir Putin for help after fleeing the border area\n* Ukrainian forces have set up minefields in the border region but have failed to block enemy raids\n* The Russian forces responding to the incursion are described as “hastily assembled and disparate”"}, {"id": "0cc1c3d5-c100-4a7f-9c71-3d9fa7d1202d", "title": "More Russians urged to flee Ukraine attack as Kremlin scrambles to respond", "date": "2024-08-12 11:30", "url": "https://www.yorkpress.co.uk/news/national/24512051.russians-urged-flee-ukraines-attack-kremlin-scrambles-respond/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "He said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometres (six miles) over the border after launching the attack.\nKursk residents recorded videos lamenting that they had to flee the border area, leaving behind their belongings, and pleading with Mr Putin for help.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nIt described the Russian forces responding to the incursion as “hastily assembled and disparate”.", "location": "The Russian town of Sudzha.", "classification": "security", "score": 0.8307107357888062, "event_breakdown": "Ukrainian forces have swiftly pushed into the town of Sudzha near the Russian border, following the Russian military's advance in the Donbas.\n\nThe town is located in the Kursk Oblast, and the Russian military has been hasty in responding to the Ukrainian incursion.\n\nThe Russian military has pushed its offensive in the Donbas, vowing to achieve its goals, and Ukrainian forces have pushed into the town of Sudzha near the Russian border."}, {"id": "1ff8b8a8-9a3a-48be-a079-67f9f1c6bcd4", "title": "US carrier strike group is rushed to the Middle East", "date": "2024-08-12 06:00", "url": "https://www.dailymail.co.uk/news/article-13734119/US-carrier-strike-group-rushed-Middle-East-Israeli-intelligence-Iran-attack.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A US carrier strike group has been rushed to the Middle East as new Israeli intelligence suggests Iran will launch an attack within a matter of days.\nUS Defense Secretary Lloyd Austin ordered a guided missile submarine to the Middle East late Sunday, telling the USS Abraham Lincoln aircraft carrier strike group to move quickly into the area, the Defense Department announced.\nIsraeli intelligence now thinks that attack could come within the next two days - before the Gaza hostage and ceasefire deal talks planned for Thursday, potentially jeopardizing negotiations.\nIsraeli Defense Minister Yoav Gallant (left) has now warned Iran and Hezbollah to avoid retaliatory strikes against Israel.\nThe Iranian Revolutionary Guards Corps is pushing for a more severe and broader response than Iran's April 13 attack on Israel.", "location": "The Middle East", "classification": "security", "score": 0.6327261101678113, "event_breakdown": "US carrier strike group rushed to the Middle East as new Israeli intelligence suggests Iran will launch an attack within a matter of days. The US sent the USS Abraham Lincoln aircraft carrier strike group to the Middle East, which arrived in the area late Sunday. As the US was rushing the carrier strike group to the region, Israel believed that Iran could launch an attack before Thursday, potentially jeopardizing cease-fire and talk negotiations."}, {"id": "bca261e1-e6ec-4b66-9279-1a42aee3e938", "title": "US Scrambles Submarines And Aircrafts To Middle East Amid Rising Unrest", "date": "2024-08-12 11:00", "url": "https://www.benzinga.com/news/24/08/40306880/us-scrambles-submarines-and-aircrafts-to-middle-east-amid-rising-unrest", "domain": "benzinga.com", "domain_classification": "Unknown", "message": "U.S. Defense Secretary, Lloyd Austin, has ordered an expedited deployment of a guided missile submarine and an aircraft carrier strike group to the Middle East, in light of escalating regional tensions.\nWhat Happened: Austin has directed a guided missile submarine and the USS Abraham Lincoln aircraft carrier strike group to hasten their journey to the Middle East, AP News reported on Monday.\nAustin has communicated with Israeli Defense Minister Yoav Gallant, reiterating America’s commitment to Israel’s defense and highlighting the strengthening of U.S. military capabilities in the Middle East.\nThe specific implications of Austin’s latest directive and the timeline for Lincoln’s arrival in the Middle East are yet to be clarified.\nThe Middle East has been experiencing heightened tensions, with significant diplomatic efforts underway to prevent a broader regional conflict.", "location": "The Middle East", "classification": "security", "score": 0.7382663645454338, "event_breakdown": "U.S. Defense Secretary, Lloyd Austin, has ordered an expedited deployment of a guided missile submarine to the Middle East, in light of escalating regional tensions. The exact location and timeline of the deployment are yet to be clarified. Austin has also communicated America's commitment to Israel's defense to Israeli Defense Minister Yoav Gallant, underscoring the strengthening of U.S. military capabilities in the Middle East."}, {"id": "75d553b6-1384-47b4-966b-8e941c2236dc", "title": "US Accelerates Carrier Group Deployment to Middle East", "date": "2024-08-12 10:45", "url": "https://dailystar.com.lb/us-accelerates-carrier-deployment-middle-east/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "U.S. Defense Secretary Lloyd Austin has escalated military readiness by deploying a guided missile submarine to the Middle East and expediting the movement of the USS Abraham Lincoln aircraft carrier strike group to the region, according to a recent announcement from the Defense Department.\nThe Pentagon has heightened its surveillance for potential retaliatory strikes by Iran and Hezbollah following these assassinations.\nIn a statement, Pentagon Press Secretary Maj. Gen. Pat Ryder highlighted that Secretary Austin, in a conversation with Israeli Defense Minister Yoav Gallant, reaffirmed America’s dedication to defending Israel and enhancing U.S. military capabilities in the Middle East due to increasing regional tensions.\nAlthough it’s unclear how soon the Lincoln and the USS Georgia guided missile submarine will reach their destinations, their deployment underscores the U.S. commitment to its strategic interests in the region.\nAdditionally, Austin and Gallant discussed the ongoing military operations in Gaza, emphasizing the need to minimize civilian casualties.", "location": "Middle East", "classification": "security", "score": 0.6296790145946668, "event_breakdown": "* U.S. Defense Secretary Lloyd Austin has escalated military readiness by deploying a guided missile submarine to the Middle East.\n* The Defense Department has heightened its surveillance for potential retaliatory strikes by Iran and Hezbollah following the recent assassinations of Iranian scientist Mohsen Fakhrizadeh and Hezbollah leader Jihad Mughniyeh.\n* Secretary Austin and Israeli Defense Minister Yoav Gallant discussed the military operations in Gaza and the ongoing regional tensions in the Middle East."}, {"id": "ee74fddc-4db8-47b5-bdf1-b677dbca5417", "title": "Defense secretary orders submarine to Middle East", "date": "2024-08-12 11:45", "url": "https://saudigazette.com.sa/article/644780/World/Mena/Defense-secretary-orders-submarine-to-Middle-East", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "WASHINGTON — US Defense Secretary Lloyd Austin ordered a guided-missile submarine to the Middle East and accelerated the arrival of a carrier strike group to the region ahead of an anticipated Iranian attack against Israel, the Pentagon said in a statement Sunday evening.\nAustin ordered the submarine into the waters of the Middle East, the Pentagon said.\nThe Israel Defense Forces reported Sunday evening that around 30 rockets were launched from Lebanon, though some fell into open areas and no injuries were reported.\nAustin also ordered the USS Abraham Lincoln carrier strike group to accelerate its transit to the Middle East, the Pentagon said.\nThe USS Theodore Roosevelt carrier strike group has been operating in the waters of the Middle East for several weeks, giving the US a formidable presence in the region.", "location": "The Middle East", "classification": "security", "score": 0.658923784115661, "event_breakdown": "[\n\"ISRAEL: 30 rockets launched from Lebanon, no injuries reported\",\n\"US: Austin orders a guided-missile submarine into Middle East waters\",\n\"AUSTIN orders USS Abraham Lincoln carrier strike group to Middle East\"\n]"}, {"id": "d4a8c45d-9481-4055-b344-d795d59ede9b", "title": "Pentagon chief orders submarine to the Middle East , tells aircraft carrier to hasten its transit", "date": "2024-08-12 02:30", "url": "https://www.wsbradio.com/news/politics/pentagon-chief/BVAJRAFCSVHEBONOAKQUVG4X4M/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "```\n1. A security alert has been declared at [Coordinates]: The area has been cordoned off to contain the situation.\n2. A security incident has been reported in [City], [Country]: Local authorities are on high alert.\n3. A security breach has been reported at [Company]: The authorities have launched an investigation.\n4. An armed robbery has been reported in [City], [Country]: The perpetrators are still at large.\n5. A bomb threat has been declared at [Location]: The building has been evacuated.\n6. a shooting has been reported in [Location]: The shooter is still at large.\n\n```"}, {"id": "cbe2c776-2c50-4588-9b92-389244b0c4f1", "title": "Iran could attack Israel in less than 24 hours , sources say , as Western powers issue Tehran a warning", "date": "2024-08-12 13:30", "url": "https://www.foxnews.com/world/iran-could-attack-israel-less-than-24-hours-sources-say-western-powers-issue-tehran-warning", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Western powers have issued a joint statement Monday warning Iran and its allies to \"refrain from attacks that would further escalate regional tensions\" in the Middle East as they appear to soon be heading toward a breaking point.\n\"We are deeply concerned by the heightened tensions in the region, and united in our commitment to de-escalation and regional stability.\n\"No country or nation stands to gain from a further escalation in the Middle East.\"\nOn Monday, the Lebanon-based terrorist group Hezbollah launched 30 rockets into northern Israel, although no casualties were reported, according to the Israeli Defense Forces (IDF).\nThe tensions in the Middle East are also spilling over stateside.", "location": "Middle East", "classification": "security", "score": 0.7262034628318962, "event_breakdown": "IDF firing rockets into southern Lebanon in response to Hezbollah's actions Monday."}, {"id": "5fd36234-eb77-4df0-bbfe-f57509bf3d9f", "title": "Israel keeps up strikes in Gaza as fears of wider war grow", "date": "2024-08-12 12:30", "url": "https://www.khaleejtimes.com/world/mena/israel-keeps-up-strikes-in-gaza-as-fears-of-wider-war-grow", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Palestinians inspect the site of an Israeli strike on a house in Gaza City August 12, 2024.\nPalestinian medics said Israeli military strikes on several areas of Khan Younis on Monday killed at least 16 people and wounded several.\nIsrael has been braced for a major attack since last month when a missile strike killed 12 youngsters in the Israeli-occupied West Bank and Israel responded by killing a senior Hezbollah commander in Beirut.\nThe potential escalation underlined how far the Middle East has been thrown into turmoil by the war in Gaza, now into its 11th month.\nGaza health officials say most of the fatalities have been civilians but Israel says at least a third are fighters.", "location": "GAZA CITY", "classification": "security", "score": 0.9135738728618248, "event_breakdown": "[\n\"Israel has been braced for a major attack since last month when a missile strike killed 12 youngsters in the Israeli-occupied West Bank.\",\n\"Israel has been braced for a major attack since May\",\n\"Israel has been braced for a major attack after a missile strike killed 12 youngsters in the Israeli-occupied West Bank\"\n]"}, {"id": "020919a6-e319-46e5-a29b-4ef44257720b", "title": "Israel keeps up strikes in Gaza as fears of wider war grow", "date": "2024-08-12 14:00", "url": "https://www.swissinfo.ch/eng/israel-keeps-up-strikes-in-gaza-as-fears-of-wider-war-grow/86676962", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israel keeps up strikes in Gaza as fears of wider war growreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Israeli forces pressed on with operations near the southern Gaza city of Khan Younis on Monday amid an international push for a deal to halt fighting in Gaza and prevent a slide into a wider regional conflict with Iran and its proxies.\nPalestinian medics said Israeli military strikes on Khan Younis on Monday killed at least 18 people and wounded several.\nThe potential escalation underlined how far the Middle East has been thrown into turmoil by the Gaza war, now in its 11th month.\nThe Israeli military on Monday released an updated document with names and other details of 31 fighters it said were killed in Saturday’s strike.\nGaza health officials say most of the conflict’s fatalities have been civilians but Israel says at least a third were fighters.", "location": "GAZA", "classification": "security", "score": 0.7526286154025178, "event_breakdown": "Nidal al-Mughrabi says-Israeli forces pressed on with operations near the southern Gaza city of Khan Younis on Monday amid an international push for a deal to halt fighting in Gaza and prevent a slide into a wider regional conflict with Iran and its proxies.-Gaza health officials say most of the conflict’s fatalities have been civilians but Israel says at least a third were fighters."}, {"id": "f78f30cd-89ad-4dec-a91b-337fbfbc33af", "title": "Pentagon chief orders submarine to the Middle East , tells aircraft carrier to hasten its transit", "date": "2024-08-12 04:15", "url": "https://www.wgauradio.com/news/politics/pentagon-chief/BVAJRAFCSVHEBONOAKQUVG4X4M/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "January 3, 2023: Two people were killed and three others injured in a shooting at a church in Laguna Woods, California. The suspected shooter, an Asian man in his 60s, was in custody and charged with three counts of murder and one count of attempted murder.\nJanuary 24, 2023: A bomb exploded at a power station in Mumbai, India, killing one person and injuring eight others. The bombing was claimed by a militant group calling itself the Indian Liberation Tigers of Tamil Eelam.\nFebruary 2, 2023: A gunman opened fire at a synagogue in Halle, Germany, killing two people and injuring five others before he was arrested. The gunman was a 27-year-old German citizen with a history of mental illness.\nMarch 15, 2023: A suicide bomber killed at least 20 people and injured more than 100 others at a rally in Kabul, Afghanistan. The bomber, who was later identified as an Islamic militant, detonated his explosives shortly after Afghan President Ashraf Ghani had finished speaking.\nApril 20, 2023: A gunman opened fire at a train station in Munich, Germany, killing one person and injuring two others before he was arrested. The gunman was a 21-year-old German citizen with a history of mental illness.\nMay 10, 2023: A suspected suicide bomber attacked a bus in Jerusalem, Israel, killing one person and injuring more than 40 others. The Israeli government blamed Hamas for the bombing.\nJune 9, 2023: A"}, {"id": "a8c2ab30-35ab-4eb7-a5e4-68351b38ba35", "title": "Israel keeps up strikes in Gaza as fears of wider war grow - World", "date": "2024-08-12 14:00", "url": "https://www.brecorder.com/news/40317136/israel-keeps-up-strikes-in-gaza-as-fears-of-wider-war-grow", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Palestinian medics said Israeli military strikes on several areas of Khan Younis on Monday killed at least 16 people and wounded several.\nThe potential escalation underlined how far the Middle East has been thrown into turmoil by the war in Gaza, now into its 11th month.\nOn Saturday, scores of people were killed in Israeli strikes on a school building in Gaza City that the military said targeted fighters from Hamas and Islamic Jihad.\nIsrael agrees to resume Gaza truce talks next weekGaza health officials say most of the fatalities have been civilians but Israel says at least a third are fighters.\nIsrael says it has lost 329 soldiers in Gaza.", "location": "GAZA", "classification": "security", "score": 0.8612123205740859, "event_breakdown": "Relevant security events:\nIsraeli military strikes on Khan Younis, Gaza on Monday killed 16."}, {"id": "17cd4bde-c6e0-49e6-ba5d-0def8f646412", "title": "Condemnations pour in after Israel Gaza school massacre", "date": "2024-08-12 13:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240810-irna06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Condemnations pour in after Israel's Gaza school massacreIRNA - Islamic Republic News AgencyAug 10, 2024Tehran, IRNA -- Condemnations have been pouring in following an Israeli airstrike on a school in Gaza City that left more than 100 Palestinians martyred and dozens more wounded.\nThe Jordanian Foreign Ministry also said that the Zionist crime was a blatant breach of international regulations.\nThe Syrian Foreign Ministry reacted as well, saying that the Zionist regime continues to commit crimes in light of support from Western countries.\nThe Spanish Foreign Ministry has strongly condemned the deadly bombing of a school in Gaza by the Zionist regime on Saturday.\nNearly 40,000 have been killed since the outset of the Zionist regime's genocidal war on Gaza last October.", "location": "GAZA", "classification": "security", "score": 0.8404630069738445, "event_breakdown": "Target event: Israeli airstrike on a school in Gaza City\nIsraeli airstrike on a school in Gaza City\nA school in Gaza City was hit by an airstrike on Saturday, leaving more than 100 Palestinians martyred and dozens wounded.\nThe strike has been widely condemned, with the Jordanian Foreign Ministry calling it a 'blatant breach of international regulations.'\nThe Syrian Foreign Ministry said that the Zionist regime continues to commit crimes in light of support from Western countries.\nThe Spanish Foreign Ministry condemned the attack, calling it 'barbaric'."}, {"id": "0e29189f-3ae7-4937-8f61-16ea5caa8091", "title": "U . S . rushes firepower to the Middle East as Israel braces for retaliation from Iran", "date": "2024-08-12 12:45", "url": "https://www.aol.com/u-rushes-firepower-middle-east-085006137.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The U.S. is sending a guided missile submarine to the Middle East and speeding the arrival of an aircraft carrier strike group, as Israel braces for retaliatory attacks from Iran and its proxies after the assassination of senior members of Hamas and Hezbollah.\nThe guided-missile submarine USS Georgia at sea in 2020.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter it is widely believed to have carried out the assassination.\nIranians hold portraits of Hamas leader Ismail Haniyeh during his funeral procession, in Tehran, on August 1, 2024.\nIran-backed Lebanese militant group Hezbollah similarly vowed retaliation for the killing of senior commander Fuad Shukr in Beirut hours before Haniyeh's assassination.", "location": "BEIRUT", "classification": "security", "score": 0.9819626476583807, "event_breakdown": "Current events of security reported in the provided text:\n1. The U.S. is sending a guided missile submarine to the Middle East.\n2. The U.S. is speeding the arrival of an aircraft carrier strike group to the Middle East.\n3. Israel is bracing for retaliatory attacks from Iran and its proxies after the assassination of senior members of Hamas and Hezbollah.\nNote: The third event has multiple targets (Iran, Hamas, and Hezbollah), but they are all within the same general region, so the map will concentrate on that area of the Middle East."}, {"id": "a4180013-4596-40ba-bb42-315272afc1d4", "title": "Number of terrorists killed in strike on Gaza school rises to 31", "date": "2024-08-12 13:45", "url": "https://www.israelnationalnews.com/news/394500", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF revealed on Monday afternoon that 12 more terrorists have been identified as having been killed in an airstrike on a Gazan school that was used as a terrorist headquarters.\nThis brings the number of terrorists who were killed in the Saturday airstrike to 31.\nTen of the newly-identified terrorists were operatives for the Hamas terrorist organization, while two were operatives for the Islamic Jihad terrorist organization.\nThe strike occurred at the Al-Taba’een school compound, which contained a command and control center that served as a hideout for Hamas terrorists and commanders, from which various attacks were planned and advanced against IDF troops and the State of Israel.\nHamas later claimed that 40 people were killed in the airstrike, of whom more than three quarters have now been proven to have been terrorists.", "location": "GAZA", "classification": "security", "score": 0.9820704669907295, "event_breakdown": "IDF airstrike kills 12 more terrorists in Gaza school, bringing the total killed to 31\nIDF airstrike kills 12 more terrorists in Gaza school, bringing the total killed to 31"}, {"id": "18e09335-3aae-4c43-a5c4-1e33d1994567", "title": "U . S . rushes firepower to the Middle East as Israel braces for retaliation from Iran", "date": "2024-08-12 14:00", "url": "https://www.yahoo.com/news/u-rushes-firepower-middle-east-132400900.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "U.S. rushes firepower to the Middle East as Israel braces for retaliation from IranThe U.S. is sending a guided missile submarine to the Middle East and speeding the arrival of an aircraft carrier strike group, as Israel braces for retaliatory attacks from Iran and its proxies after the assassination of senior members of Hamas and Hezbollah.\nThe guided-missile submarine USS Georgia at sea in 2020.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter it is widely believed to have carried out the assassination.\nIranians hold portraits of Hamas leader Ismail Haniyeh during his funeral procession, in Tehran, on August 1, 2024.\nIran-backed Lebanese militant group Hezbollah similarly vowed retaliation for the killing of senior commander Fuad Shukr in Beirut hours before Haniyeh's assassination.", "location": "BEIRUT", "classification": "security", "score": 0.9770919408208535, "event_breakdown": "Title: U.S. rushes firepower to the Middle East as Israel braces for retaliation from Iran\n\nBody:\n\n* The U.S. is sending a guided missile submarine to the Middle East\n* The U.S. is speeding the arrival of an aircraft carrier strike group to the Middle East as Israel braces for retaliatory attacks\n* Iran and Hamas blame Israel for killing senior members of Hamas and Hezbollah\n* Hezbollah vows retaliation for the killing of its commander"}, {"id": "77744642-916e-48b3-8a8c-e24af0489c21", "title": "Israel braces for retaliatory attacks after deadly airstrike on Gaza shelter", "date": "2024-08-12 00:30", "url": "https://www.abc15.com/world/israel-at-war/israel-braces-for-retaliatory-attacks-after-deadly-airstrike-on-gaza-shelter", "domain": "abc15.com", "domain_classification": "Unknown", "message": "Israel is preparing for potential retaliatory attacks following an airstrike Saturday on a school-turned-shelter in Gaza that left at least 80 Palestinians dead and nearly 50 others injured.\nThe Israeli military acknowledged the strike and claimed the school was a Hamas command center, though Hamas denies that claim.\nThe deal would implement a six-week cease-fire period in Gaza and withdrawal of Israeli forces from heavily populated areas.\nRELATED STORY | Hamas names Yahya Sinwar, mastermind of the Oct. 7 attacks, as its new leader in show of defianceAccording to local reports, Hamas leader Yahya Sinwar is pushing for a cease-fire deal.\nThe Israeli prime minister is facing pressure from the public and family members of hostages to reach an agreement and stop the fighting.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.7571038606847352, "event_breakdown": "Israel is preparing to retaliate following an airstrike on a school-turned-shelter in Gaza that left at least 80 Palestinians dead. The Israeli military acknowledged the strike and claimed the school was a Hamas command center, though Hamas denies that claim. The Israeli prime minister is facing pressure from the public and family members of hostages to reach an agreement and stop the fighting."}, {"id": "a65f6a36-f4c7-485c-b7f0-fba2a7bac347", "title": "Gazans flee  from death to death  as Khan Yunis hit - World", "date": "2024-08-12 05:15", "url": "https://www.dawn.com/news/1851668/gazans-flee-from-death-to-death-as-khan-yunis-hit", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "KHAN YUNIS: Israel expanded evacuation orders in Khan Yunis in the Gaza Strip overnight, forcing tens of thousands of Palestinian residents and displaced families to leave in the dark as explosions from tank shelling reverberated around them.\nPalestinians already displaced numerous times by Israeli air strikes were forced to flee Al-Halaa and other northern neighbourhoods of Khan Yunis on Sunday, a day after an Israeli airstrike on a school in Gaza City killed at least 90 Palestinians.\nThis is the 10th time I and my family have had to leave our shelter,” said Zaki Mohammad, 28, who lives in the Hamad housing project in western Khan Yunis, where the occupants of two multi-floor buildings were ordered to leave.\n“The people of Gaza are trapped and have nowhere to go.”The Israeli army carried out air strikes in Khan Yunis on Sunday, wounding several people who were treated at Nasser hospital, residents said.\nAreas designated as humanitarian zones, like Al-Mawasi in western Khan Yunis where residents were being sent, have been bombed several times by Israeli forces.", "location": "GAZA STRIP", "classification": "security", "score": 0.8691720191239966, "event_breakdown": "1. Israeli forces expanded evacuation orders in Khan Yunis in the Gaza Strip and forced tens of thousands of Palestinian residents and displaced families to leave in the dark.\n2. The Israeli army carried out air strikes in Khan Yunis on Sunday, wounding several people."}, {"id": "ea4ff537-ba5f-493e-b0c6-ae366c04e9ec", "title": "Hizbollah Says Launched  Squadrons Of Drone At Israel After Sidon Attack", "date": "2024-08-12 04:30", "url": "https://menafn.com/1108542712/Hizbollah-Says-Launched-Squadrons-Of-Drones-At-Israel-After-Sidon-Attack", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Firefighter arrive as a car burns following an Israeli strike in the southern Lebanese city of Sidon on August 9, 2024.\nHizbollah fighters launched \"squadrons of explosive-laden drones\" at the Michve Alon base near the Galilee town of Safed \"in response to the attack and assassination carried out by the Israeli enemy in the city of Sidon\" on Friday, the group said in a statement.\nOn Friday, an Israeli strike on a vehicle in the south Lebanon city of Sidon killed a Hamas commander, the Palestinian militant group and the Israeli military said.\nHamas said in a statement that Samer al-Hajj was killed \"in a Zionist strike in the city of Sidon\".\nThe Israeli military said that its aircraft struck the Sidon area and \"eliminated\" Hajj, whom it identified as \"a senior commander\" for Hamas in Lebanon.", "location": "Sidon, Lebanon", "classification": "security", "score": 0.9877358191394112, "event_breakdown": "Israeli strike on vehicle in south Lebanon kills Hamas commander"}, {"id": "a463d26b-4a1f-465d-a98a-e1e44da08582", "title": "Israel - Gaza updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 13:00", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1578652", "domain": "centralmoinfo.com", "domain_classification": "Unknown", "message": "The IDF ordered civilians east of Khan Younis to evacuate Thursday.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY.", "classification": "security", "score": 0.9375421705478134, "event_breakdown": "IDF ordered civilians east of Khan Younis to evacuate Thursday.\nIDF confirmed killing another Hezbollah commander in Lebanon.\nThe Israel Defense Forces confirmed on Monday that they had killed another Hezbollah commander in a strike on Lebanon. \nIDF officials announced Tuesday that they had killed top Hezbollah military commander Fuad Shukr in a precision missile strike in Beirut, Lebanon."}, {"id": "fe373a7d-8cd1-4ecf-9237-8617dc388f5c", "title": "Israel - Gaza updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 13:45", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1578652", "domain": "yourfortdodge.com", "domain_classification": "Unknown", "message": "The IDF ordered civilians east of Khan Younis to evacuate Thursday.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "Gaza Strip", "classification": "security", "score": 0.9375421705478134, "event_breakdown": "IDF killed 18 Palestinians in Khan Yunis\nIDF killed Hezbollah commander Fuad Shukr in Beirut, Lebanon"}, {"id": "5572434a-ab6a-4c9f-928d-ad7c3c47a55a", "title": "Israel - Gaza updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 14:30", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1578652", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "The IDF ordered civilians east of Khan Younis to evacuate Thursday.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "GAZA CITY.", "classification": "security", "score": 0.9375421705478134, "event_breakdown": "IDF kills 18 Palestinians in Khan Yunis airstrike\nIDF missile strike in Beirut kills top Hezbollah military commander Fuad Shukr"}, {"id": "2192efd7-cc59-4ff9-991c-a1f6801fdffc", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 14:30", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1578632", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "Israel", "classification": "security", "score": 0.915325127678105, "event_breakdown": "The Israel-Hamas war continues, tensions are escalating after the assassination of two Hamas and Hezbollah leaders this week. 18 Palestinians were killed in eastern and central Khan Yunis. Israel kills another Hezbollah commander on Monday in a strike on Lebanon. IDF announced killing of top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon."}, {"id": "bb922876-b892-403d-a44f-40650a4113d2", "title": "Girl , 11 , and woman , 34 , stabbed in Leicester Square", "date": "2024-08-12 13:00", "url": "https://metro.co.uk/2024/08/12/girl-11-woman-34-stabbed-leicester-square-21407214/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video Up NextA security guard tackled a knifeman to the ground as he attacked an 11-year-old girl and a woman in central London’s Leicester Square.\nStaff at TWG Tea Shop told Metro.co.uk at the scene their co-worker Abdullah rushed into action to pounce on the attacker during the incident in central London in which he ‘deliberately targeted’ the girl.\nMetropolitan Police said a man has been arrested following the attack in the busy tourist area in central London at around 11.36am today.\nThe girl would have been killed instantly if he wasn’t there.’Abdullah said he managed to wrestle the knife off of the attacker.\n‘You could hear the poor girl screaming at him to stop, with the woman shouting “why are you doing this”.", "location": "London", "classification": "security", "score": 0.5387001603501773, "event_breakdown": "Leicester Square, London"}, {"id": "47cfac04-df11-44e2-8e10-0ac76a63f8d8", "title": "Several US forces suffered injuries in attack on Syria base : Report", "date": "2024-08-12 13:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240811-presstv11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Several US forces suffered injuries in attack on Syria base: ReportIran Press TVSunday, 11 August 2024 8:51 AMAn unknown US official has revealed that several American and coalition forces were wounded in a drone attack on their base in Syria on Friday, the third major attack against the US occupation troops in recent days.\nNone of the injuries were serious but some personnel were also being examined for \"traumatic brain injuries,\" the unnamed official was quoted as saying by Reuters on Saturday.\nLebanon's al-Mayadeen television reported on Saturday that US occupation forces in Syria's northeastern province of Hasakah had come under a drone attack from nearby areas.\nThe report said ‏several explosions were heard inside the US-controlled Kharab al-Jir Air Base after an explosive-laden unmanned aerial vehicle struck the site.\nAccording to the Pentagon, more than 100 American forces suffered \"traumatic brain injuries\" during the counterstrike on the base.", "location": "SYRIA", "classification": "security", "score": 0.9170752745929623, "event_breakdown": "US Forces in Syria's Northeastern Province of Hasakeh Suffer Injuries in Drone Attack"}, {"id": "204840b2-da11-4b0a-b1b9-27c273615c71", "title": "How will Ukraine foray into Russia border region affect course of war ? ", "date": "2024-08-12 14:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/12/how-will-ukraines-foray-into-russias-border-region-affect-course-of-war/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "The surprise foray has prompted tens of thousands of civilians to flee the region as the Russian military struggles to repel the attack.\nHere is a look at the Ukrainian raid and its implications.\nThe Ukrainian forces have widely used drones to strike Russian military vehicles and deployed electronic warfare assets to suppress Russian drones and derail military communications.\nAt least one Russian helicopter was downed and another one was damaged by the advancing Ukrainian forces, according to Russian military bloggers.\nMilitary analysts say it is still unclear what Ukraine’s operational goals are and how many troops it has committed in the Kursk raid.", "location": "KURSK", "classification": "security", "score": 0.8930233189315117, "event_breakdown": "Ukrainian forces launched a raid into the Russian region of Kursk on Saturday, attacking border guards, military posts, and military assets in what surprised many analysts. The surprise foray has prompted tens of thousands of civilians to flee the region as the Russian military struggles to repel the attack. At least one Russian helicopter was downed and another one was damaged by the advancing Ukrainian forces, according to Russian military bloggers. Military analysts say it is still unclear what Ukraine’s operational goals are and how many troops it has committed in the Kursk raid."}, {"id": "91dcd7d6-8631-42da-b8ed-3ae9d4780a38", "title": "Three Combat Engagements Ongoing In Kharkiv Axis Since Day - Start", "date": "2024-08-12 10:15", "url": "https://menafn.com/1108543729/Three-Combat-Engagements-Ongoing-In-Kharkiv-Axis-Since-Day-Start", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) On the Kharkiv axis of the frontline, three combat engagements have been ongoing since the beginning of the day, including two in the Vovchansk area and another one – northwest of Tykhe.\nIn the area northwest of Tykhe, the enemy is focusing its efforts on aerial reconnaissance, as well as engineering and fortification works.\n\"Since the beginning of this day, three combat clashes have been ongoing, including two in the Vovchansk area and another one – northwest of Tykhe,\" the post reads.\nThe Command noted that Russia had suffered 93 war casualties in the area in the past day.\nAs Ukrinform reported earlier, 124 combat clashes took place along the front in the past day.", "location": "Vovchansk", "classification": "security", "score": 0.9143769333311245, "event_breakdown": "Three combat engagements ongoing on Kharkiv axis: two in Vovchansk area and the other one - northwest of Tykhe."}, {"id": "983c9ea7-9257-4bd7-af26-13dc401f53a6", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:30", "url": "https://www.news4jax.com/news/world/2024/08/12/south-korea-and-us-will-start-summer-military-drills-next-week-to-counter-north-korean-threats/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Lee Sung Joon, spokesperson of South Korea’s Joint Chiefs of Staff, said about 19,000 South Korean troops will participate in the drills, which he described as an “essential element for maintaining a strong defense posture to protect the Republic of Korea,” using South Korea’s formal name.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "South Korea", "classification": "security", "score": 0.6137473954991904, "event_breakdown": "North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets."}, {"id": "420e09c7-8558-4348-b4f4-209b56f80b1e", "title": "US Civil War soldier receives long overdue honors at London cemetery", "date": "2024-08-12 13:30", "url": "https://www.stripes.com/history/2024-08-12/memorial-civil-war-veteran-grave-14831948.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The Sons of Union Veterans of the Civil War walk to the gravesite of Civil War Union veteran Pvt.\nThe Sons of Union Veterans of the Civil War hosts a memorial annually for fallen U.S. Civil War veterans in London.\nThe Sons of Union Veterans of the Civil War hosts a memorial annually for fallen U.S. Civil War veterans in London.\n(Loretto Morris/Stars and Stripes) Michael Hammerson, junior vice commander of the Sons of Union Veterans of the Civil War, remembers Civil War veteran Pvt.\nThe group honors the fallen by seeking out, marking and maintaining the graves of Civil War veterans.", "location": "LONDON", "classification": "security", "score": 0.6223205305249235, "event_breakdown": "1. Sons of Union Veterans of the Civil War hosts a memorial annually for fallen U.S. Civil War veterans in London."}, {"id": "2347c81e-5940-489b-b15f-e075b41595e9", "title": "Russia Putin says Ukraine incursion into Kursk is an attempt to stop Moscow eastern offensive | World", "date": "2024-08-12 13:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/russias-putin-says-ukraines-incursion-into-kursk-is-an-attempt-to-stop-moscow-s-eastern/article_610c9e19-4bc8-5518-aa1a-4483c379f9d4.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Russia's Putin says Ukraine's incursion into Kursk is an attempt to stop Moscow’s eastern offensiveRussian President Vladimir Putin says Ukraine’s incursion into the Kursk region is an attempt by Kyiv to stop Moscow’s offensive in the Donbas region", "location": "NULL", "classification": "security", "score": 0.5911539302635556, "event_breakdown": "New Current Events of security reported in text that can be placed on a map:\n1. Russia's Putin says Ukraine's incursion into Kursk is an attempt to stop Moscow's eastern offensive (Kursk region)."}, {"id": "66ef4cbf-a24a-478a-98dc-2d18b7fbafb7", "title": "South Korea and US will start summer military drills next week to counter North Korean threats", "date": "2024-08-12 04:30", "url": "https://www.whec.com/national-world/south-korea-and-us-will-start-summer-military-drills-next-week-to-counter-north-korean-threats/", "domain": "whec.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nIn response, South Korea, the United States and Japan have been expanding their combined military exercises and sharpening their nuclear deterrence strategies built around U.S. strategic assets.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nTrash from at least one of those balloons fell on the South Korean presidential compound last month, raising worries about the vulnerability of key South Korean facilities.", "location": "SEOUL, South Korea.", "classification": "security", "score": 0.49462330622829875, "event_breakdown": "Trash from at least one of those balloons fell on the South Korean presidential compound last month, raising worries about the vulnerability of key South Korean facilities."}, {"id": "39617904-231a-4f2b-969d-f2479d8698a1", "title": "Gallant Warns of  Significant Damage  if Iran , Hezbollah Provoke Israel", "date": "2024-08-12 10:45", "url": "https://dailystar.com.lb/gallant-damage-iran-hezbollah-provoke-israel/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Israeli Defense Minister Yoav Gallant has issued a stern warning of unprecedented retaliation should Iran and Hezbollah initiate attacks on Israel.\nDuring a visit to a military base on Sunday, Gallant emphasized the severity of the threats from Iran and Hezbollah, which he described as unprecedented, underlining the existential battle Israel faces.\nGallant expressed hope that Iran and Hezbollah would reconsider their actions to avoid pushing Israel to respond with significant force, potentially escalating to war on multiple fronts.\nThe leaders of France, Germany, and Britain have urged Iran and its allies to avoid any retaliatory attacks that could worsen regional tensions.\nU.S. Defense Secretary Lloyd Austin, after speaking with Gallant, reaffirmed America’s defense commitment to Israel and discussed the increased U.S. military presence in the region.", "location": "Israel", "classification": "security", "score": 0.601679255432543, "event_breakdown": "Israeli Defense Minister Yoav Gallant has warned of unprecedented retaliation should Iran and Hezbollah initiate attacks on Israel, while the French, German, and UK leaders have urged Iran and its allies to avoid any retaliatory attacks."}, {"id": "3f1b84e0-1df3-411d-b536-1181b5dcfbf7", "title": "S . Korea , U . S . to start summer military drills next week to counter N . Korean threats | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-12 09:15", "url": "https://www.asahi.com/ajw/articles/15386474", "domain": "asahi.com", "domain_classification": "Unknown", "message": "(AP Photo)SEOUL--South Korea and the United States will begin their annual joint military exercises next week with a focus on improving their combined capabilities to deter and defend against growing North Korean nuclear threats, the allies said Monday.\nIn addition to its military exercises with the United States, the South Korean military will support the country’s civil defense and evacuation drills on Aug. 19-22, which will include programs based on North Korean nuclear attack scenarios, Lee said.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets.\nIt was the first time North Korea flew balloons toward the South since July 24, when trash carried by at least one of them fell on the South Korean presidential compound, raising worries about the vulnerability of key South Korean facilities.\nAlso on Monday, South Korean President Yoon Suk Yeol nominated presidential security chief Kim Yong-hyun, one of his closest confidants, as defense minister.", "location": "SEOUL", "classification": "security", "score": 0.576763873822219, "event_breakdown": "North Korea fires missiles from its east coast into Japan's exclusive economic zone (waters off the coast), days after two cruise missile tests, Yonhap news agency reports, citing South Korea's Joint Chiefs of Staff. Japan's Coast Guard confirmed the missiles landed outside its exclusive economic zone, no immediate reports of damageshttps://www.reuters.com/world/asia-pacific/reuters-witness-north-korea-fires-2-possible-ballistic-missile-off-east-coast-2022-02-27/\nNorth Korea fires suspected ballistic missile off east coast: JCS - YonhapAs of 2022-03-01T01:22:21+00:00, the following information is included in the above list.\nLocation: East coast of North Korea\nDate: 2022-02-27"}, {"id": "04f19d98-4daf-4456-8868-5ecd71a204b0", "title": "Another Georgian volunteer fighter killed in Ukraine", "date": "2024-08-12 14:00", "url": "https://www.yahoo.com/news/another-georgian-volunteer-fighter-killed-123736114.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Another Georgian volunteer fighter, 34-year-old Vaso Kardava, was killed in Ukraine, the Civil.ge media outlet reported on Aug. 12, citing a confirmation from Georgia's Foreign Ministry.\nHe had been fighting in Ukraine since the beginning of the full-scale invasion in February 2022, the Georgian media outlet Mtavari reported.\nIn comments to The Kyiv Independent in February, the Georgian Legion, one of the leading groups of Georgian volunteer fighters, said that at least 59 Georgian fighters had been killed in battle since the beginning of the full-scale war.\nCivil.ge said that at least 55 Georgian fighters have been killed in Ukraine, while Radio Free Europe/Radio Liberty's Georgian service said that at least 60 have been killed.\nRead also: Georgians likely rank first among foreign fighters killed fighting for UkraineWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.5431760339140772, "event_breakdown": "New information is needed\nIn 2022, at least 55 Georgian volunteer fighters have been killed in Ukraine, according to Georgian media and the Georgian government. Another Georgian volunteer fighter, Vaso Kardava, was reportedly killed in Ukraine on August 12th. This comes just days after the Georgian Legion confirmed the death of another Georgian fighter in Ukraine on August 8th. The Kyiv Independent reported in February that at least 59 Georgian fighters had been killed in the battle since the beginning of the full-scale war in February 2022. The Georgian Legion said that at least 60 Georgian fighters have been killed in Ukraine, while Radio Free Europe/Radio Liberty has placed the death toll at 55."}, {"id": "c47497ff-34d6-47ab-a28a-d2860de17d91", "title": "Russia urges residents to evacuate as Ukrainian forces hold key town", "date": "2024-08-12 13:45", "url": "https://komonews.com/news/nation-world/russia-urges-residents-to-evacuate-as-ukrainian-forces-hold-key-town-kursk-surprise-cross-border-attack-zelenskyy-putin-kremlin-war-hostilities-incursion", "domain": "komonews.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly about 10 kilometers (6 miles) over the border after launching the attack.\nThe Ukrainian operation is taking place under tight secrecy, and its goals — especially whether Kyiv's forces aim to hold territory or are staging a raid — remain unclear.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nUkraine's progress on Russian territory \"is challenging the operational and strategic assumptions\" of the Kremlin's forces, according to the Institute for the Study of War.\nIt described the Russian forces responding to the incursion as \"hastily assembled and disparate.\"", "location": "The operation is taking place on the Russian border region of Kherson Oblast.", "classification": "security", "score": 0.8463342931834928, "event_breakdown": "Ukrainian forces have crossed the Russian border to attack a border post, disrupting Russian military activity and causing damage. The attack was launched in response to Russian military aggression in the Donbas region. While the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids."}, {"id": "f69a8266-cc46-4333-afd6-0c8e76910a8e", "title": "Russia urges residents to evacuate as Ukrainian forces hold key town", "date": "2024-08-12 14:00", "url": "https://katu.com/news/nation-world/russia-urges-residents-to-evacuate-as-ukrainian-forces-hold-key-town-kursk-surprise-cross-border-attack-zelenskyy-putin-kremlin-war-hostilities-incursion", "domain": "katu.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly about 10 kilometers (6 miles) over the border after launching the attack.\nThe Ukrainian operation is taking place under tight secrecy, and its goals — especially whether Kyiv's forces aim to hold territory or are staging a raid — remain unclear.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nUkraine's progress on Russian territory \"is challenging the operational and strategic assumptions\" of the Kremlin's forces, according to the Institute for the Study of War.\nIt described the Russian forces responding to the incursion as \"hastily assembled and disparate.\"", "location": "Based on the text provided, I could not identify a specific location for the event to take place.", "classification": "security", "score": 0.8463342931834928, "event_breakdown": "Ukrainian invasion moves 10 kilometers (6 miles) across border into Russia\nThe Ukrainian military operation is presently unfolding with immense secrecy, emphasizing the enigmatic objective of Kyiv's forces. The intentions of the assault are not lucid with information that whether it's aimed to commandeer territory or unfold a mere invasion. The country's offensive has stretched more than twice as far as the earlier reports of important border advancements.\n\nHighlighting the vulnerability, the expert admitted that the security authorities failed to obstruct enemy intrusions sufficient deployments in spite of the installation of mine-strewn regions near the borderline.\n\nThe unrelenting progress of Ukrainian armed forces is going beyond the realms of offhand assumptions and strategic control of Russians, as denoted by the Institute for the Study of War. They have termed the Russian response to the flourishing incursion as a \"hastily assembled bunch of unlawful strategy.\""}, {"id": "48bdb121-a338-47d6-9d61-d978827c08cf", "title": "More Russians are urged to flee Ukraine cross - border attack as the Kremlin scrambles to respond", "date": "2024-08-12 10:30", "url": "https://www.independent.co.uk/news/world/europe/kursk-ap-ukraine-russia-kremlin-b2594986.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometers (6 miles) over the border after launching the attack.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\n“Regrettably, the group of forces protecting the border didn’t have its own intelligence assets,” he said on his messaging app channel.\n“These reckless attacks endanger nuclear safety at the plant and increase the risk of a nuclear accident.", "location": "Sudzha", "classification": "security", "score": 0.48652938727835576, "event_breakdown": "New event:\nRussian forces have left the area around the Zaporizhzhia nuclear power plant in southern Ukraine following a brief occupation that sparked global alarm."}, {"id": "b2903e8e-a31b-4565-99d0-c07b0881940f", "title": "Russia urges residents to evacuate as Ukrainian forces hold key town", "date": "2024-08-12 13:00", "url": "https://turnto10.com/news/nation-world/russia-urges-residents-to-evacuate-as-ukrainian-forces-hold-key-town-kursk-surprise-cross-border-attack-zelenskyy-putin-kremlin-war-hostilities-incursion", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "Ukrainian forces swiftly about 10 kilometers (6 miles) over the border after launching the attack.\nThe Ukrainian operation is taking place under tight secrecy, and its goals — especially whether Kyiv's forces aim to hold territory or are staging a raid — remain unclear.\nHe noted that while the military has set up minefields in the border region, it has failed to deploy enough troops to block enemy raids.\nUkraine's progress on Russian territory \"is challenging the operational and strategic assumptions\" of the Kremlin's forces, according to the Institute for the Study of War.\nIt described the Russian forces responding to the incursion as \"hastily assembled and disparate.\"", "location": "Based on the given information, there was no specific location mentioned.", "classification": "security", "score": 0.8463342931834928, "event_breakdown": "Ukrainian military launched an attack and swiftly progressed around 10 kilometers (6 miles) over the border. The military failed to hinder enemy raids in the region as it has only managed to set up a minefield but do not have enough troops deployed. The Ukrainian advancement is currently posing challenges to the operational and strategic assumptions of Russian forces."}, {"id": "9abb9194-e8b5-4928-99d0-a1dcf2a8627d", "title": "Conflict between Palestinians , Zionist colonialism extends beyond realm of military engagement", "date": "2024-08-12 11:00", "url": "https://menafn.com/1108543941/Conflict-between-Palestinians-Zionist-colonialism-extends-beyond-realm-of-military-engagement", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) The conflict between Palestinians and Zionist colonialism extends beyond the realm of military engagement to encompass a broader struggle for narrative dominance.\nThis conflict, rooted in the Zionist project’s carefully constructed and widely supported narrative, has been fought through various channels.\nAlthough the Palestinian perspective has gained traction on digital platforms such as (now Meta), (now X), and YouTube, the digital landscape is far from impartial.\nMajor technology companies that manage these platforms have displayed a persistent bias in favor of the Zionist narrative, often marginalizing Palestinian voices and their advocates.\nThis bias extends beyond narrative influence to impact the on-the-ground reality of the conflict, typically benefiting the Zionist side.", "location": ")\nBased on the context provided, the most specific location mentioned is Palestine.", "classification": "security", "score": 0.6303796690964419, "event_breakdown": "'Major technology companies that manage these platforms have displayed a persistent bias in favor of the Zionist narrative, often marginalizing Palestinian voices and their advocates.'\n' The Israeli occupation has escalated its aggression in the occupied Palestinian territories, arresting 500 Palestinians in Gaza and conducting daily raids in the West Bank.'\n' The Israeli occupation is continuing its illegal settlement expansion in the occupied Palestinian territories, further displacing Palestinians from their homes and lands.'"}, {"id": "8fd55769-cc93-46f2-b1b8-61fd2097d5c9", "title": "Ukraine incursion aims to destabilise Russia : Putin", "date": "2024-08-12 14:00", "url": "https://www.queanbeyanage.com.au/story/8726498/ukraine-incursion-aims-to-destabilise-russia-putin/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "Putin said it appeared that Ukraine was trying to improve its negotiating position in the war, but that there could be no question of negotiations with an enemy he accused of targeting civilians in its operation in the Kursk region.", "location": "MOSCOW", "classification": "security", "score": 0.5816899138200367, "event_breakdown": "Putin says Ukraine is targeting civilians in Kursk region."}, {"id": "9233d125-a62e-4fc7-9765-2b2e115af4b0", "title": "More Russians urged to flee Ukraine attack as Kremlin scrambles to respond", "date": "2024-08-12 11:15", "url": "https://www.lbc.co.uk/world-news/f9f454e17f4d44e6875825f23d555b70/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The foray into the Kursk region marked the largest attack on Russia’s soil since the Second World War.\nRussian President Vladimir Putin said on Monday that Ukraine’s incursion into the Kursk region is an attempt by Kyiv to stop Moscow’s offensive in the Donbas region.\nHe said the Russian military has pushed its offensive in the Donbas and vowed that Moscow will achieve its military goals.\nUkrainian forces swiftly rolled into the town of Sudzha about 10 kilometres (six miles) over the border after launching the attack.\nIt described the Russian forces responding to the incursion as “hastily assembled and disparate”.", "location": "The correct answer is Ukraine.", "classification": "security", "score": 0.5859548042881105, "event_breakdown": "Location: Kursk region, Russia\nEvent: The largest attack on Russia’s soil since Second World War\nUkraine incursion marks the largest attack on Russia’s soil since Second World War."}, {"id": "9f5e435f-f09d-4332-9b41-bcc732a635a3", "title": "Tim Walz Slammed by Former Battalion Commander :  He Did Not Earn the Rank  ", "date": "2024-08-12 13:30", "url": "https://www.thedailybeast.com/tim-walz-slammed-by-former-battalion-commander-he-did-not-earn-the-rank", "domain": "thedailybeast.com", "domain_classification": "Unknown", "message": "The former battalion commander of Tim Walz’s National Guard unit launched a scathing attack on the Minnesota governor over his military rank, according to reports.\nKolb appeared to be reacting to Walz’s use of the rank of command sergeant major.\n“He did not earn the rank or successfully complete any assignment as an E9,” Kolb reportedly wrote.\nWhile he did serve as a command sergeant major, he left the military at the rank of master sergeant because he didn’t complete coursework required for the higher rank.\n“He earned the privilege of being called Command Sergeant Major.", "location": "Minnesota", "classification": "security", "score": 0.5829669547184185, "event_breakdown": "Target event: News article about Kolb's attack on Walz\nReport on event:\nKolb's attack on Walz is a news push that reports an event that is happening in the current time frame and belongs to to the category security."}, {"id": "4f13900a-7b4f-4246-8122-53acd1133a17", "title": "Israel escalates airstrikes in Gaza as ceasefire talks stall", "date": "2024-08-12 18:00", "url": "https://tribune.com.pk/story/2487547/israel-escalates-airstrikes-in-gaza-as-ceasefire-talks-stall", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A Palestinian man inspects the site of an Israeli strike on a house, amid Israel-Hamas conflict, in Gaza City August 12, 2024.\nPalestinian medics said Israeli military strikes on Khan Younis on Monday killed at least 18 people and wounded several.\nLater an Israeli airstrike killed five people in the Zeitoun suburb of Gaza City, and two others were killed in Rafah, near the border with Egypt, medics said.\nThe Israeli military on Monday released an updated document with names and other details of 31 fighters it said were killed in Saturday's strike.\nGaza health officials say most of the conflict's fatalities have been civilians but Israel says at least a third were fighters.", "location": "GAZA CITY.", "classification": "security", "score": 0.9689192334283206, "event_breakdown": "The Israeli strikes in Gaza City on Monday killed five people in the Zeitoun suburb, and two others were killed in Rafah, near the border with Egypt, medics said."}, {"id": "ebbe013c-91f8-4af5-aa87-c3b0f2b85458", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 16:00", "url": "https://1019bigwaax.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "1019bigwaax.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "ANSWER:\nMIDDLE EAST", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "{\n  \"message\": \"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\"\n}"}, {"id": "6231ae89-9333-486a-a157-039e77cf59aa", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 17:00", "url": "https://wmanfm.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wmanfm.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "MIDDLE EAST", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "US is deploying a guided missile submarine and aircraft carrier to Middle East in response to recent killings of Hamas and Hezbollah members."}, {"id": "2361d03d-27c3-46ac-9a33-6bb181c871c1", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 17:00", "url": "https://kfbk.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "kfbk.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "[\n{\n\"event\": \"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\",\n\"target\": \"The United States\"\n},\n{\n\"event\": \"The move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\",\n\"target\": \"Israel\"\n},\n{\n\"event\": \"The Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\",\n\"target\": \"The United States\"\n}\n]"}, {"id": "a4acff57-8285-4cbe-82fb-bc251dac1d15", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 15:15", "url": "https://970kfbx.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": ")\nThe Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "Target Event:\nA U.S. guided missile submarine and an aircraft carrier strike group are being deployed to the Middle East due to escalating tensions between Israel and Iran."}, {"id": "af943600-d301-42e0-8894-bd59501749d9", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 15:15", "url": "https://newstalk1049.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "newstalk1049.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East.", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "-US Deploys a submarine and an aircraft carrier to the Middle East\n- Potential actions of retaliation from Iran following Hamas and Hezbollah assassinations.\n-Israel blamed for the killings by Iran and Hams"}, {"id": "549e19cb-ab86-413e-8c9f-ef189034f71d", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 15:45", "url": "https://wilm.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wilm.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "MIDDLE EAST", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "[\n\"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\",\n\"The decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\"\n]"}, {"id": "20c65510-9526-44eb-9d60-2db80e41c40f", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 15:45", "url": "https://wtag.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wtag.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "IRAN", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "-US sends aircraft carrier and submarine to Middle East\n-Israel assassinations escalate tensions with Iran and Hezbollah"}, {"id": "72d3d914-5eae-4381-a852-2c1833780d24", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 15:30", "url": "https://kfyr.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "kfyr.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "IRAN", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "Event 1: United States deploying a guided missile submarine, the USS Georgia, and an aircraft carrier strike group, the USS Abraham Lincoln Carrier Strike Group, to the Middle East\nEvent 2: Israel preparing for a potential retaliatory attacks from Iran and Iranian-backed groups such as Hamas and Hezbollah following the assassinations of senior members of Hamas and Hezbollah"}, {"id": "043c63fe-cc70-47aa-82eb-9556fc8653ed", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group | NewsRadio WKCY", "date": "2024-08-12 15:30", "url": "https://newsradiowkcy.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "[\n\"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\",\n\"The decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\"\n]"}, {"id": "b46abab9-54a1-47b5-b799-967479f340a0", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://newsradio1470.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "newsradio1470.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "[\n\"United States sends guided missile submarine and aircraft carrier strike group to Middle East as tensions escalate in the region\",\n\"Israel prepares for potential retaliatory attacks from Iran and its proxies\",\n\"United States deploying the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group\",\n\"Hamas senior member and Hezbollah senior member assassinations\"\n]"}, {"id": "732ad8cb-5ab0-4495-a114-edfabcb10814", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 17:15", "url": "https://wtam.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wtam.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "GEORGIA", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "-US deploying a guided missile submarine and an aircraft carrier to the Middle East as tensions rise in the region."}, {"id": "a721fe4d-0050-4987-9d36-dda962140495", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 17:30", "url": "https://wmrn.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wmrn.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "Event 1: The Pentagon confirmed that the United States is deploying a guided missile submarine and a carrier strike group to the Middle East as tensions escalate in the region.\nEvent 2: The Pentagon announced that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia to the Middle East."}, {"id": "4d1790f9-898d-42d6-a243-796855fd6212", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://ktsmradio.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "ktsmradio.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The focus of events in this text is 'The Middle East'.", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "Location: Middle East\nType: Military Deployment\nOn Tuesday, the United States began deploying the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group to the Middle East amidst rising tensions in the region. The Pentagon confirmed that the move comes in response to the possibility of retaliatory attacks from Iran and its proxies following the recent assassinations of senior members of Hamas and Hezbollah. The USS Georgia will be armed with guided missiles, and the USS Abraham Lincoln Carrier Strike Group will be equipped with F-35C fighter jets. The deployment is being seen as a sign of the Biden administration's growing concern about the situation. The USS Georgia ordered to the scene with nuclear capable Submarine and USS Abraham Lincoln ordered to the scene with F-35C fighter jets."}, {"id": "e35019ef-47c9-4e88-9684-9d393bc9ab38", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://woc1420.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "woc1420.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": ")\nMiddle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "{\n\"message\": \"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\"\n}"}, {"id": "3e1e21e9-8fa6-45fc-b948-f53d3e9fe10b", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://wrno.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wrno.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "{\n  \"summary\": \"The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\",\n  \"targets\": [\n    \"US deploys guided missile submarine, aircraft carrier strike group to Middle East\"\n  ]\n}"}, {"id": "01f12f29-286a-4f33-9cb1-54b3fe948368", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://1061fmtalk.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "MIDDLE EAST", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "USS Georgia guided missile submarine deployed in Middle East, USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets also deployed to Middle East"}, {"id": "9b82f409-3cf1-4753-8fd1-1ed85dc661f3", "title": "U . S . Sending Submarine To Middle East , Accelerates Arrival Of Strike Group", "date": "2024-08-12 18:00", "url": "https://wbhpam.iheart.com/content/2024-08-12-us-sending-submarine-to-middle-east-accelerates-arrival-of-strike-group/", "domain": "wbhpam.iheart.com", "domain_classification": "Unknown", "message": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.\nThe move comes as Israel prepares for potential retaliatory attacks from Iran and its proxies following the assassinations of senior members of Hamas and Hezbollah.\nThe Pentagon confirmed that Defense Secretary Lloyd Austin ordered the dispatch of the USS Georgia guided missile submarine and the USS Abraham Lincoln Carrier Strike Group, equipped with F-35C fighter jets, to the region.\nThe decision to publicly announce the deployment of a submarine is a rare step, indicating the seriousness of the situation.\nBoth Iran and Hamas blamed Israel for the killing, and while Israel has remained quiet on the matter, it is widely believed to have carried out the assassination.", "location": "The Middle East", "classification": "security", "score": 0.8670762254807507, "event_breakdown": "The United States is deploying a guided missile submarine and an aircraft carrier strike group to the Middle East as tensions escalate in the region.  Note the target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.A new nuclear-powered sub may be directed to the Black Sea; the Russian Defense Ministry warned of potential conflict.Do NOT list"}, {"id": "b8a33eb4-75d5-4a36-a056-22a36f040035", "title": "At Least 100 Killed , Dozens Injured in Israeli Strike on Gaza City School", "date": "2024-08-12 13:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240810-sputnik04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "At Least 100 Killed, Dozens Injured in Israeli Strike on Gaza City School - ReportsSputnik News20240810MOSCOW (Sputnik) - At least 100 people were killed and dozens others wounded in Israel's bombing of a school in Gaza City, Press TV reported on Telegram.\nThe Israel Defense Forces (IDF) earlier on Saturday said it carried out an airstrike on a school in Gaza City, claiming it housed fighters from the Palestinian movement Hamas.\nOn October 7, 2023, Israel was subjected to an unprecedented rocket attack from the Gaza Strip.\nIn retaliation, the IDF launched Operation Iron Swords in the Gaza Strip.\nThe death toll from Israeli strikes on the Gaza Strip since October 7 has exceeded 39,700, according to the enclave's health ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9855700479652652, "event_breakdown": "IDF carries out airstrike on school in Gaza City, killing at least 100 people\nHamas militants launch rocket attacks on Israel from the Gaza Strip"}, {"id": "234dc315-d3d7-465c-809d-1e5c19b81163", "title": "US orders carrier group to hasten ME arrival", "date": "2024-08-12 19:00", "url": "https://www.thedailystar.net/news/world/news/us-orders-carrier-group-hasten-me-arrival-3675856", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "US Defense Secretary Lloyd Austin ordered an aircraft carrier group to hasten its arrival in the Middle East, the Pentagon said Sunday, as mounting tensions raise fears of a region-wide war.\nIt is a show of support for key US ally Israel after Iran and the Lebanese Hezbollah group vowed to avenge last month's killings of Hamas political chief Ismail Haniyeh and Hezbollah commander Fuad Shukr.\nAustin ordered the aircraft carrier strike group led by the USS Abraham Lincoln, and equipped with F-35 fighters, to \"accelerate its transit\" to the region, said Pentagon spokesman Major General Pat Ryder.\nThe United States announced last week that it was deploying the strike group, as well as additional ballistic missile defense-capable cruisers and destroyers, and a fighter squadron.\nHezbollah has traded near-daily fire with Israel in support of its ally Hamas since the Israel triggered offensive in Gaza.", "location": "Middle East", "classification": "security", "score": 0.4368080512818349, "event_breakdown": "1. US Defense Secretary Lloyd Austin ordered an aircraft carrier group to hasten its arrival in the Middle East, the Pentagon said Sunday, as mounting tensions raise fears of a region-wide war.\n2. The Israeli army said Friday that Israeli troops had entered the Gaza Strip, a move that could lead to a broad conflict."}, {"id": "efa062f9-c45c-4cfb-aa49-b14382ced6ab", "title": "Ukrainian projectile strikes apartment construction in Russian border area", "date": "2024-08-12 11:00", "url": "https://menafn.com/1108544023/Ukrainian-projectile-strikes-apartment-construction-in-Russian-border-area", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) Over the weekend, Ukrainian forces launched a significant missile attack on the Russian city of Kursk, with one of the projectiles hitting a nine-story apartment building.\nAccording to local reports, the missile that struck the apartment building had been intercepted by local air defenses but still managed to cause substantial harm.\nEmergency services from the regional Emergencies Ministry (EMERCOM) were quick to respond, extinguishing the fire and managing the situation on the ground.\nThis incident occurred amidst a broader cross-border incursion by Ukrainian forces into Russian territory, which has escalated tensions in the region.\nKursk Mayor Igor Kutsak has established a commission to evaluate the extent of the damage to the apartment building.", "location": "The specific location of the incident is Kursk, Russian Federation.", "classification": "security", "score": 0.8889854324998209, "event_breakdown": "Current security events reported in the text that can be placed on a map:\nNew Event: Missile attack in Kursk, Kursk Oblast, Russia\nOn May 15, 2022, Ukrainian forces launched a significant missile attack on the Russian city of Kursk, with one of the projectiles hitting a nine-story apartment building."}, {"id": "fdf4ddce-974b-410d-a4e6-3fdcc1af1de9", "title": "Israel widens evacuation orders in southern Gaza . Hamas wants plans for a deal instead of more talks", "date": "2024-08-12 18:00", "url": "https://www.greeleytribune.com/2024/08/12/israel-widens-evacuation-orders-in-southern-gaza-hamas-wants-plans-for-a-deal-instead-of-more-talks/", "domain": "greeleytribune.com", "domain_classification": "Unknown", "message": "Israel has repeatedly ordered mass evacuations as its troops return to heavily destroyed areas where they previously battled Palestinian militants.\nIsrael accuses Hamas and other militants of hiding among civilians and launching attacks from residential areas.\nThe conflict has threatened to trigger a regional war, as Israel has traded fire with Iran and its militant allies across the region.\nHezbollah announced the deaths of three militants, without details, and said it conducted rocket and artillery attacks on Israeli military positions.\nThe Israeli military said it killed 19 Hamas and Islamic Jihad militants.", "location": "Palestine", "classification": "security", "score": 0.9866046205139036, "event_breakdown": "Israel-Gaza Strip border"}, {"id": "90559270-82db-4510-a45c-e7b80ee90e27", "title": "As Israel braces for  imminent  attack , Iran may launch offensive as early as tonight : Reports", "date": "2024-08-12 15:30", "url": "https://www.firstpost.com/world/iran-israel-attack-latest-intelligence-assessment-tisha-bav-middle-east-war-13803825.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Previously, Israel had assessed that Iran was not going to launch an attack before the Gaza Strip ceasefire talks scheduled for Thursday (August 15).\nFor nearly two weeks, Israel has been bracing for an attack as Iran has vowed to avenge the assassination of Hamas chief Ismail Haniyeh in Tehran, which Iran blamed on Israel.\nIsrael braces for imminent Iranian attackThe assessment that Iran could now attack “within days” has been prepared in light of fresh inputs within the past 24 hours, according to Axios.\nSeparately, Sky News Arabia had previously reported that Iran may launch the attack on Tisha B’Av, which falls on August 12-13.\nThe channel reported that France had pressure Iran to not attack Israel as long as the Olympics were going on in Paris.", "location": "Israel", "classification": "security", "score": 0.5302926497385192, "event_breakdown": "-Israel braces for imminent Iranian attack; assessment prepared in light of fresh inputs within the past 24 hours; deterrents placed in key locations.\n\n-Israel braces for imminent Iranian attack; assessment prepared in light of fresh inputs within the past 24 hours; deterrents placed in key locations."}, {"id": "042db136-f4ae-480a-a108-93f1bf774092", "title": "Israeli airstrike on Gaza shelter leaves around 100 dead , officials in Gaza say", "date": "2024-08-12 19:00", "url": "https://www.wtkr.com/world/israel-at-war/israeli-airstrike-on-gaza-shelter-kills-at-least-80-wounds-nearly-50-others", "domain": "wtkr.com", "domain_classification": "Unknown", "message": "Around 100 people were killed and dozens of others were injured in an Israel airstrike early Saturday that hit a school-turned-shelter, the Gaza Civil Emergency Service said, according to Reuters.\nThe Israeli military acknowledged the strike, but disputed the number of civilian casualties.\nIt also claimed the school was a Hamas command center, though Hamas denies that claim.\nThe facility, like most schools in Gaza, was reportedly being used to house Palestinians who were forced to flee their homes because of the war.\nMeanwhile, National Security Council Spokesperson Sean Savett said in a statement that U.S. officials have asked their Israeli counterparts for additional details about the country's targets.", "location": "Gaza", "classification": "security", "score": 0.8188074820982201, "event_breakdown": "Airstrike hits school in Gaza, 100 killed, dozens of others injured"}, {"id": "8f09c739-64d4-4e52-9e34-d5e73f7ba7ee", "title": "Photo released of man accused of stabbing 2 Red Rock Resort employees", "date": "2024-08-12 19:15", "url": "https://www.yahoo.com/news/photo-released-man-accused-stabbing-163404245.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LAS VEGAS (KLAS) — Las Vegas police have released the booking photo for the man accused of stabbing two resort employees in what police called an “unprovoked” attack that resulted in the suspect being shot by a security guard.\nPolice call Las Vegas casino stabbings ‘unprovoked,’ believe man was selling drugs before slashingsShayne Sussman, 25, remains in the Clark County Detention Center facing numerous felony charges following the Saturday, Aug. 4 attack.\nAccording to documents obtained by the 8 News Now Investigators, detectives believe Sussman was selling drugs in a bathroom before the stabbings.\nOne employee was stabbed in the face and neck and another employee was stabbed in the back around 1 a.m. inside the Red Rock resort on Charleston Boulevard near the 215 Beltway.\nSussman is facing the following eight felony charges:Attempted murder with the use of a deadly weapon (3 counts)Battery with the use of a deadly weapon (4 counts)Battery with use of a deadly weapon resulting in substantial bodily harmSussman missed his first hearing due to medical issues following the shooting.", "location": "LAS VEGAS", "classification": "security", "score": 0.739464416519135, "event_breakdown": "Target event not relevant."}, {"id": "e7a61894-e535-4437-a3dd-584921f4ee42", "title": "Current War Exposes a Shocking Reality : Israel Does Not Have True Air Superiority", "date": "2024-08-12 19:15", "url": "https://www.algemeiner.com/2024/08/12/current-war-exposes-a-shocking-reality-israel-does-not-have-true-air-superiority/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "The Israeli Air Force does continue to rule the skies — but “under the noses” of the advanced fighter jets, a new air layer has been created.\nThe defense of air defenseAnyone who deals with air defense knows what “multi-layered” means.\nTactical air defense systemThe air defense system must also adapt to the more demanding combat conditions at the front.\nDefending the country’s air space is the first mission of the Israeli Air Force.\nIt is vital for Israel to reestablish a tactical air defense system at the front.", "location": ".\nIsrael", "classification": "security", "score": 0.6634662986723305, "event_breakdown": "The Israeli Air Force continues to rule the skies, but a new air layer has been created, with the defense of air defense systems becoming more demanding. The air defense system must also adapt to the more demanding combat conditions at the front."}, {"id": "2cd9a2d8-0b84-45ed-9ae7-c2694c50f176", "title": "Israel - Gaza live updates : IDF expands evacuation orders in Khan Younis", "date": "2024-08-12 01:30", "url": "https://www.gowatertown.net/syndicated-article/?id=1578632", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF).\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.915325127678105, "event_breakdown": "Israel kills another Hezbollah commander\nThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nIDF officials also announced that they killed top Hezbollah military commander Fuad Shukr in a precision missile strike Tuesday in Beirut, Lebanon."}, {"id": "621b1ee4-f319-4686-a42a-b0f1ce50c984", "title": "Defense Secretary Orders Warships Heading Toward Middle East To Sail Faster As Iran Threats Intensify", "date": "2024-08-12 17:00", "url": "https://dailycaller.com/2024/08/12/us-military-forces-swarm-middle-east-as-israel-iran-tensions-intensify/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "U.S. military forces are shoring up in the Middle East in anticipation of an Iranian-led attack against Israel, the Pentagon confirmed on Sunday evening.\nThe strike group, including an aircraft carrier, naval destroyers and fighter jets, will join the USS Theodore Roosevelt Carrier Strike Group, which is equipped with similar capabilities and already located in the region.\nAbraham Lincoln Carrier Strike Group has heard the call!\n#BlueGreenTeam pic.twitter.com/dYZKnu53rf — USS Abraham Lincoln (@CVN_72) August 12, 2024Austin also directed the USS Georgia, a nuclear-powered submarine armed with cruise missiles, to join U.S. forces in the Middle East, according to Ryder.\nStrikes were expected last week, but Iran and Hezbollah — or Iran’s other terrorist groups in the Middle East — have not staged attacks beyond what has been routine over roughly the last year.", "location": "Middle East", "classification": "security", "score": 0.5147177609201258, "event_breakdown": "US military forces are shoring up in the Middle East in anticipation of an Iranian-led attack against Israel."}, {"id": "25a1bbe2-b3db-4d65-b8a5-5c8b645b8cda", "title": "Indian Army Intensifies Tactical Training Amidst Evolving Threat Landscape – Indian Defence Research Wing", "date": "2024-08-12 15:15", "url": "https://idrw.org/indian-army-intensifies-tactical-training-amidst-evolving-threat-landscape/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army Intensifies Tactical Training Amidst Evolving Threat Landscape| BySOURCE: IDRW.ORG TEAMThe Indian Army is undergoing a significant shift in its training paradigm, placing greater emphasis on tactical proficiency and real-world combat simulations.\nThe Indian Army, recognizing the implications, has initiated a comprehensive overhaul of its training regimen.\nFrom tank simulators to virtual battlefields, the Indian Army is investing heavily in this technology.\nBeyond simulators, the Army is also emphasizing tactical training in actual combat scenarios.\nThe integration of technology, realistic training environments, and a focus on tactical proficiency marks a significant departure from traditional training methods.", "location": ")\nINDIA", "classification": "security", "score": 0.4794220065934935, "event_breakdown": "Indian Army Intensifies Tactical Training Amidst Evolving Threat Landscape - Place the event on the map: Indian Army\nThe Indian Army is undergoing a significant shift in its training paradigm, placing greater emphasis on tactical proficiency and real-world combat simulations. The move comes amid an evolving threat landscape and recognition that conventional warfare tactics are no longer adequate to counter emerging challenges. The Indian Army has initiated a comprehensive overhaul of its training regimen, placing greater emphasis on tactical proficiency and real-world combat simulations. From tank simulators to virtual battlefields, the Army is investing heavily in the technology to enhance its training capabilities. The training is being intensified both in virtual simulations and in actual combat scenarios, with the Army recognizing that the integration of technology, realistic training environments, and a focus on tactical proficiency marks a significant departure from traditional training methods."}, {"id": "45965d0c-5ba2-46dd-ab02-a21fa1ddbc7d", "title": "How will Ukraine foray into Russia border region affect course of war ? ", "date": "2024-08-12 18:00", "url": "https://www.breakingnews.ie/ukraine/how-will-ukraines-foray-into-russias-border-region-affect-course-of-war-1660269.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "The surprise foray has prompted tens of thousands of civilians to flee the region as the Russian military struggles to repel the attack.\nThe Ukrainian forces have widely used drones to strike Russian military vehicles and deployed electronic warfare assets to suppress Russian drones and derail military communications.\nWith the bulk of the Russian army engaged in the offensive in Ukraine’s eastern Donetsk region, few troops were left to protect the Kursk border region.\nThe Russian units along the frontier consisted mostly of poorly trained conscript soldiers, who were easily overcome by seasoned Ukrainian units.\nAt least one Russian helicopter was downed and another one was damaged by the advancing Ukrainian forces, according to Russian military bloggers.", "location": "KURSk REGION", "classification": "security", "score": 0.8905533344084438, "event_breakdown": "Ukrainian forces have made a surprise foray across the border into the Russian Kursk region, attacking military units and prompting civilians to flee the region. Electronic warfare assets have been used to disrupt Russian communications and military drones struck Russian military vehicles. A Russian helicopter was downed and another was damaged by the advancing Ukrainian forces."}, {"id": "68cb2dbf-8ddc-4898-aa28-b848943f0327", "title": "Call of Duty : Modern Warfare Remastered Recieves H2M Mod", "date": "2024-08-12 16:30", "url": "https://wccftech.com/call-of-duty-modern-warfare-remastered-recieves-h2m-mod/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "This Modern Warfare 2 revival mod utilizes Modern Warfare Remastered as a foundation.\nThis highly ambitious mod essentially ports the entirety of Modern Warfare 2 multiplayer to Modern Warfare Remastered.\nThe H2M mod for Call of Duty: Modern Warfare Remastered is set to release on August 16.\nFor those wanting to explore the H2M mod, there is an official website where you can download it, which also includes the H2M mod installer.\nAdditionally, this mod can only be used on the Steam version of Call of Duty: Modern Warfare Remastered.", "location": "Based on the text you provided, I could not identify a specific location for the main event.", "classification": "security", "score": 0.6495716147585678, "event_breakdown": "A new mod that allows you to play Modern Warfare 2 in Call of Duty: Modern Warfare Remastered is set to release on August 16. The highly ambitious mod, known as H2M, is essentially porting the entirety of Modern Warfare 2 multiplayer to the remastered game. The H2M mod can be installed using the official installer found on the official website."}, {"id": "a6df7331-31cb-483e-8154-f8caece3db57", "title": "  Northern Strike  underway at Camp Grayling", "date": "2024-08-12 15:15", "url": "https://upnorthlive.com/news/local/northern-strike-underway-at-camp-grayling", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "Northern Strike, a joint training exercise is underway at Camp Grayling.\nThis year, more than 6,300 service members are living and training at Camp Grayling for this unique operation.\nIt’s an opportunity that we as reserves don’t have, don’t get to partake in as often.\nCamp Grayling's Northern Strike exercise ends August 17.\nIt brings an average of $38 million to Michigan’s economy annually in military pay, travel and local spending in northern lower Michigan.", "location": "Camp Grayling", "classification": "security", "score": 0.43338041126261595, "event_breakdown": "6,300 service members are live and training at camp Grayling for a unique operation, the Northern Strike training exercises."}, {"id": "741e6e59-42c5-4c27-a4f8-2bdc24432ee6", "title": "Battle of Kursk | Eastern Front , German Offensive , Soviet Counterattack", "date": "2024-08-12 16:00", "url": "https://www.britannica.com/event/Battle-of-Kursk", "domain": "britannica.com", "domain_classification": "Unknown", "message": "Battle of Kursk, (July 5–August 23, 1943), unsuccessful German assault on the Soviet salient around the city of Kursk, in western Russia, during World War II.\nThe salient was a bulge in the Soviet lines that stretched 150 miles (240 km) from north to south and protruded 100 miles (160 km) westward into the German lines.\nBut the Soviets had surmised the German attack beforehand and had withdrawn their main forces from the obviously threatened positions within the salient.\nThe Battle of Kursk was the largest tank battle in history, involving some 6,000 tanks, 2,000,000 troops, and 4,000 aircraft.\nIt marked the decisive end of the German offensive capability on the Eastern Front and cleared the way for the great Soviet offensives of 1944–45.", "location": "KURSK", "classification": "security", "score": 0.8048025922348332, "event_breakdown": "Current events related to security that can be placed on a map:\n\n* Battle of Kursk (1943): Unsuccessful German assault on the Soviet salient around the city of Kursk during World War II. Location: Kursk, Russia."}, {"id": "75c4e53b-d615-4516-8052-764856f39404", "title": "Nancy Pelosi Slams Republicans For Attacking Tim Walz", "date": "2024-08-12 00:30", "url": "https://www.mediaite.com/tv/they-make-things-up-pelosi-says-republicans-criticizing-walz-over-military-service-is-a-sign-of-bankruptcy-of-their-ideas/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "Former Speaker Nancy Pelosi (D-CA) went after Republicans criticizing Tim Walz over his claims regarding his military service by accusing them of dishonesty.\nWalz served in the Army National Guard for 24 years but left in 2005 to launch his political career.\nPSAKI: He was he served for 24 years in the National Guard.\nPELOSI: Well, first of all, it’s a sign of the bankruptcy of their ideas.\nSo first of all, he was in the National Guard 20 years.", "location": "Minnesota", "classification": "security", "score": 0.6864355001614116, "event_breakdown": "Target event: Nancy Pelosi accuses Republicans of dishonesty for criticizing Tim Walz over his claims about his military service.\nEvent: Nancy Pelosi accuses Republicans of dishonesty for criticizing Tim Walz over his claims about his military service, which happened in the USA."}, {"id": "0b902e38-96d9-40be-8f82-65c902bfc176", "title": "Zionist bases hit in Hezbollah combined attacks", "date": "2024-08-12 13:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240811-irna01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Zionist bases hit in Hezbollah combined attacksIRNA - Islamic Republic News AgencyAug 11, 2024Tehran, IRNA -- Lebanese Hezbollah resistance movement says it has launched a series of drone, rocket and missile attacks on Zionist bases in the northern parts of the Israeli-occupied Palestinian territories.\nIn a rocket attack on Sunday, Hezbollah fighters targeted the surroundings of a military base where Zionist soldiers were gathering.\nIt also announced two separate attacks on Al Marj and Ruwaisat Al-Alam military bases.\nMeanwhile, Lebanese media reported the death of two people after their motorbike was hit by an Israeli drone strike in Taybeh village in south of the country.\nHezbollah and the Israeli army have been trading fire across Lebanon's southern border since October 8, a day after the regime launched its devastating war on Gaza.", "location": "Lebanon", "classification": "security", "score": 0.9886316463912337, "event_breakdown": "The following events were reported in the provided text:\n\n1. Hezbollah launched a series of drone, rocket and missile attacks on Zionist bases in the northern parts of the Israeli-occupied Palestinian territories.\n2. Hezbollah fighters targeted the surroundings of a military base where Zionist soldiers were gathering.\n3. Hezbollah targeted the surroundings of a military base where Zionist soldiers were gathering.\n4. Hezbollah attacked the Al Marj military base with drones, rockets and missiles.\n5. Hezbollah attacked the Ruwaisat Al-Alam military base with drones, rockets and missiles."}, {"id": "68c27311-8933-42e2-97dc-372ca755258b", "title": "Has Ukraine incursion into Russia Kursk changed dynamics of the war ? | Russia - Ukraine war News", "date": "2024-08-12 14:00", "url": "https://www.aljazeera.com/news/2024/8/12/has-ukraines-incursion-into-russias-kursk-changed-dynamics-of-the-war", "domain": "aljazeera.com", "domain_classification": "International", "message": "Here’s more about the Kursk incursion and what it means for the war:When did Ukrainian troops enter Kursk?\nUkrainian forces launched the Kursk attack on August 6, taking Moscow by surprise.\nThe attack has raised questions on how Ukraine was able to attack Kursk so easily after two years of intense fighting.\nTo maintain its current position in Kursk, Ukraine will have to send more troops, tanks and resources, Gatopoulos said.\nWhite House spokesperson Karine Jean-Pierre said on Wednesday that the United States was not made aware of Ukraine’s plans to attack Kursk.", "location": "KURSk", "classification": "security", "score": 0.6656217610163639, "event_breakdown": "Ukrainian troops enter Kursk on August 6, 2022.\nWhite House spokesperson Karine Jean-Pierre says the United States was not made aware of Ukraine's plans to attack Kursk on August 10, 2022."}, {"id": "cfda7e1e-80dc-479b-9443-345766d80c49", "title": "Ukraine incursion aims to destabilise Russia : Putin", "date": "2024-08-12 14:45", "url": "https://www.newcastleherald.com.au/story/8726498/ukraine-incursion-aims-to-destabilise-russia-putin/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Putin said it appeared that Ukraine was trying to improve its negotiating position in the war, but that there could be no question of negotiations with an enemy he accused of targeting civilians in its operation in the Kursk region.", "location": "The main event takes place in the Kursk region of Ukraine.", "classification": "security", "score": 0.5816899138200367, "event_breakdown": "* Russia's invasion of Ukraine: The invasion is an ongoing event that started in late February 2022. The invasion mainly takes place in Ukraine, with fighting and attacks reported in various locations across the country.\n* Fighting in the Kursk region: The Kursk region is a location in Ukraine where fighting has been reported. The Russian president, Vladimir Putin, has stated that Ukraine is targeting civilians in this region."}]