[{"id": "c3a78f44-d471-49e6-b57f-3cbeaa1ec09f", "title": "Pentagon admits killing a shepherd with a Hellfire missile in Syria in botched drone strike after mistaking him for a senior Al Qaeda leader", "date": "2024-05-02 18:15", "url": "https://www.dailymail.co.uk/news/article-13376575/pentagon-drone-strike-syria-al-qaeda-shepherd-death.html", "message": "A botched U.S. drone strike in Syria killed a shepherd last year after he was mistakenly identified as a senior Al Qaeda operative.\nThe Pentagon has admitted a civilian and not a terrorist leader was slain on May 3, 2023 after an internal Central Command (CENTCOM) investigation.\nThe victim has since been 56-year-old father-of-10 Lufti Hasan Masto, who was killed while he was tending to his sheep.\nA MQ-9 predator drone was tracking his movements in fields around his home in the rural town of Qorqanya when a Hellfire missile was fired in his direction.\nCENTCOM 'determined U.S. forces misidentified the intended Al Qaeda target and that a civilian, Mr. Lufti Hasan Masto (Masto), was struck and killed instead'.", "location": "Qorqanya", "classification": "security", "score": 0.9847305783547525, "event_breakdown": "- Botched U.S. drone strike in Syria mistakenly kills a shepherd in Qorqanya, Syria\n- Pentagon admits civilian killed in the drone strike was 56-year-old father-of-10 Lufti Hasan Masto\n- Victim identified as Lufti Hasan Masto who was tending to his sheep when he was killed\n- MQ-9 predator drone tracking victim's movements in fields around his home in Qorqanya\n- Hellfire missile fired at victim after being mistakenly identified as a senior Al Qaeda operative"}, {"id": "fcfadb5c-385a-4c87-a04d-fde3b224351a", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated.", "location": "Masto’s home", "classification": "security", "score": 0.9311538199665129, "event_breakdown": "1. U.S. drone strike in Syria last year kills a 56-year-old shepherd, not a terrorist leader, according to United States Central Command.\n2. Hellfire missile released by U.S. forces near Masto's home kills him and several of his sheep.\n3. Central Command acknowledges and regrets civilian harm resulting from the airstrike.\n4. CENTCOM emphasizes taking reports of civilian harm seriously and employing thorough targeting and strike processes to minimize harm.\n5. Commitment expressed to learn from the incident and improve targeting processes to mitigate potential civilian harm."}, {"id": "c2fe2767-692b-4e01-98cb-fbd9431ed3f8", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say - LocalNews8 . com", "date": "2024-05-03 06:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "- Attack on the Gaza Strip that killed Shahed and 10 other children\n- Shift in Israeli military statements regarding the attack\n- Analysis of the site of the attack by a freelance journalist reveals Israeli military responsibility\n- Confirmation by Cobb-Smith that an Israeli munition was used in the attack\n- CNN pressing the Israeli military for details about the strike\n- Israeli military declining to provide additional evidence to support their claims"}, {"id": "379724d9-40d9-44b6-8316-f31259a9fc62", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say - LocalNews8 . com", "date": "2024-05-03 06:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say-2/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "1. Israeli military strike kills Shahed and 10 other children in Gaza.\n2. Israeli military's statements on the attack shift, but they do not take responsibility.\n3. Analysis of the attack site suggests Israeli military responsibility, according to a freelance journalist working for CNN in Gaza.\n4. Israeli munition believed to be used in the attack, as Palestinian militants lack such sophistication in their arsenal, according to an expert.\n5. CNN presses Israeli military for details about the strike, but they decline to provide additional evidence."}, {"id": "f50b1364-616e-4943-b582-f7aeb72fa835", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say", "date": "2024-05-03 10:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza City", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "- Israeli military’s shifting response to the attack on April 16 at about 3:40 p.m.\n- The Israeli military has not taken responsibility for the strike that killed Shahed and 10 other children.\n- Analysis of the site of the attack by a freelance journalist working for CNN in Gaza suggests Israeli military responsibility.\n- Cobb-Smith believes an Israeli munition was used in the attack, indicating sophistication beyond Palestinian militants' capabilities.\n- CNN's inquiries pressuring the Israeli military for more details about the strike."}, {"id": "bc703eef-f388-4170-a633-db7eaec3ef18", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.yahoo.com/news/u-central-command-finds-2023-184350267.html", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nFile Photo by Bonnie Cash/UPIMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"\nThe strike investigation, conducted by Army Brigadier General John P. Cogbill, wrapped up Nov. 15, 2023.", "location": "Syria", "classification": "security", "score": 0.8860074744325478, "event_breakdown": "- May 3, 2023: U.S. airstrike in Syria targeting senior Al Qaeda leader results in the killing of civilian Lufti Hasan Masto.\n- U.S. Central Command acknowledges and regrets civilian harm caused by the airstrike.\n- Investigation conducted by Army Brigadier General John P. Cogbill concludes on Nov. 15, 2023."}, {"id": "f6da020a-3c48-4627-a090-2932124626a9", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/02/CENTCOM-Syria-strike-civilian-killed/1701714674364/", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nCENTCOM said it is fully engaged in implementing Defense Secretary Lloyd Austin's (pictured) Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes.\nFile Photo by Bonnie Cash/UPI | License PhotoMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"", "location": "Syria", "classification": "security", "score": 0.8318856970406131, "event_breakdown": "- Civilian killed in a U.S. strike in Syria instead of Al Qaeda leader in May 2023 (Location: Syria)\n- U.S. Central Command fully engaged in implementing Defense Secretary Lloyd Austin's Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes (Location: Not applicable)"}, {"id": "ba46fcaa-ca24-4fd5-9dd3-2fdf86733dc1", "title": "Ukraine - Russia war latest :  Huge fire breaks out  in port city after missile strike ; Russia  shifting battlefield focus  ", "date": "2024-05-02 00:45", "url": "https://news.sky.com/story/ukraine-russia-war-latest-huge-fire-breaks-out-in-port-city-after-missile-strike-russia-shifting-battlefield-focus-12541713", "message": "Russian activist jailed for setting fire to military conscription officeA Russian activist has been sentenced to 15 years in prison for attempting to set fire to a military conscription office in protest against the war in Ukraine.\nAngel Nikolayev, 39, was convicted on charges of terrorism for placing two bottles of a flammable substance in the windows of a conscription office in the eastern city of Khabarovsk and setting them alight.\nHe was also convicted of damaging Russian flags that were put on the graves of soldiers killed in Ukraine at a local cemetery and removing symbols of Russian military action from a bus stop and several vehicles.\nSince 2022, hundreds of people have faced criminal charges in Russia over protests and remarks condemning the war in Ukraine, and thousands have been fined or briefly jailed.", "location": "Khabarovsk", "classification": "security", "score": 0.8923864133445534, "event_breakdown": "1. Russian activist sentenced to 15 years for attempting to set fire to a military conscription office in Khabarovsk.\n2. Angel Nikolayev convicted of terrorism for placing flammable substances in the windows of the conscription office and setting them alight.\n3. Nikolayev also convicted of damaging Russian flags at a local cemetery and removing symbols of Russian military action from a bus stop and vehicles.\n4. Hundreds of people in Russia have faced criminal charges over protests and remarks condemning the war in Ukraine since 2022, with thousands fined or briefly jailed."}, {"id": "fda26e7e-c2f5-42b1-a80e-687a33324cf0", "title": "U . S . military concludes airstrike in Syria last May killed a civilian , not a terrorist", "date": "2024-05-02 16:30", "url": "https://www.cbsnews.com/news/airstrike-syria-may-2023-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThen, reports quickly surfaced that the strike had killed a civilian, not a terrorist.\nIn a tweet on May 3, the same day as the strike, a group known as \"The White Helmets\" who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported.", "location": "Northwestern Syria", "classification": "security", "score": 0.899100334097146, "event_breakdown": "1. A U.S. military airstrike in northwestern Syria last May initially claimed to have killed a senior al Qaeda leader.\n2. The U.S. military later concluded that the airstrike had actually killed a civilian.\n3. Reports emerged indicating that the strike had killed a civilian rather than a terrorist.\n4. \"The White Helmets,\" a group of first responders in Syria, identified the civilian killed as Masto in a tweet on the same day as the strike.\n5. The White Helmets reported that Masto was grazing sheep at the time of the strike, which also killed several of the sheep.\n6. Defense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan following media reports revealing that U.S. military operations in Syria, Iraq, and Afghanistan had caused more civilian casualties than initially reported."}, {"id": "b9d9c74d-db84-46ba-9b62-9fbd4fdb9b0e", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "1. Two Nigerian military officers to face court martial over drone strike that killed civilians.\n2. Drone strike in northwest Kaduna State kills at least 85 civilians during Muslim festival celebration.\n3. Nigerian military acknowledges accidental strike on village.\n4. Military relies on aerial assaults to combat Islamic militants in northeast and armed kidnapping gangs in northwest.\n5. United Nations human rights office condemns drone strike, citing at least four airstrikes since 2017 causing significant civilian fatalities."}, {"id": "71167938-e4f6-4697-af21-5fb4f5808340", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 20:30", "url": "https://www.devdiscourse.com/article/law-order/2925923-us-airstrike-targeting-al-qaida-leader-in-syria-killed-a-farmer-american-military-says", "message": "A US airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, US Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nUS Central Command said an investigation into the May 3 strike concluded that US forces misidentified the intended al-Qaida target \"and that a civilian, Mr. Lufti Hasan Masto, was struck and killed.\"\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIn a statement, Central Command said much of the investigation and findings are classified but acknowledged it revealed \"several issues that could be improved.\"\nThe US also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida's second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6595479662729967, "event_breakdown": "1. US airstrike in Syria in May 2023 targeted an al-Qaida leader but killed an innocent civilian instead.\n2. US Central Command confirmed the incident, stating that civilian Mr. Lufti Hasan Masto was struck and killed.\n3. The investigation into the May 3 strike concluded that US forces misidentified the intended target.\n4. Central Command stated that much of the investigation findings are classified but revealed \"several issues that could be improved.\"\n5. The investigation was completed in November but was not released publicly until Thursday.\n6. The US continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri."}, {"id": "5575d95b-5620-426a-8277-80dc9a95b56a", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6023448210491533, "event_breakdown": "1. U.S. airstrike in Syria in May 2023 targeting an al-Qaida leader kills innocent civilian instead\n2. U.S. Central Command confirms the incident after reports from residents and family members\n3. Investigation into the strike completed in November but not released publicly until Thursday\n4. Detailed investigation and review process set up for strikes involving allegations of innocent casualties\n5. Continuous targeting of al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike killing Abu al-Kheir al-Masri"}, {"id": "679c86fd-c593-4273-b9e4-69df59141fe2", "title": "US drone strike in Syria killed civilian not terrorist leader , Pentagon probe finds", "date": "2024-05-02 20:30", "url": "https://www.stripes.com/theaters/us/2024-05-02/drone-strike-syria-terrorist-civilian-killed-military-13732627.html", "message": "(X)A U.S. military drone strike last year that targeted a top al-Qaida leader in Syria killed a civilian instead, the Pentagon admitted Thursday.\n“We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\nAfter initially expressing confidence that the strike killed its intended target — whose name was never made public — Pentagon officials by mid-May told reporters that they were no longer certain the strike killed a terrorist.\n“The protection of civilians is a strategic priority as well as a moral imperative,” Austin wrote in his 2022 civilian harm mitigation plan.\n“Our efforts to mitigate and respond to civilian harm directly reflect our values and also directly contribute to achieving mission success.”", "location": "Syria", "classification": "security", "score": 0.798536788915954, "event_breakdown": "1. U.S. military drone strike targeting a top al-Qaida leader in Syria result in civilian casualty\n2. Pentagon admits civilian casualty and takes reports seriously\n3. Initial confidence in strike's success diminishes; uncertainty about the target's status arises\n4. Secretary of Defense emphasizes the importance of protecting civilians in military operations\n5. Austin outlines civilian harm mitigation plan for 2022\n6. Emphasis on mitigating civilian harm as a strategic priority and moral imperative, contributing to mission success"}, {"id": "6a714e3b-0f52-4c51-bbb7-9daf5d96b2be", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Khuzdar", "classification": "security", "score": 0.982317040954408, "event_breakdown": "- Journalist, 2 others killed after vehicle hit with remote-controlled blast in Khuzdar on Sultan Ibrahim Khan Road, National Highway"}, {"id": "b8c0bb69-3246-481a-8c24-b34779299952", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "1. Israeli airstrike near Damascus injures eight Syrian soldiers.\n2. Strike causes material losses, according to Syrian state-run broadcaster.\n3. Israeli warplanes launch missiles from over the Golan Heights at a site near the capital, according to the Syrian defense ministry.\n4. Attack targets base of Hezbollah, southwest of Damascus International Airport, as reported by Dubai-based Al Hadath TV quoted by Russian state media TASS.\n5. No official confirmation by Israeli authorities on the reported reprisal strike."}, {"id": "fbafa287-6a0d-4d6c-8dfe-b962509ab41d", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk\n- Military training ground hit by multiple explosions typical of an ATACMS strike in drone footage\n- Footage of recent attack shows training ground as target\n- Hundreds of flashes of smoke erupting over the clearing where Russian soldiers were seen seconds earlier, caused by M74 APAM mini-bombs detonating"}, {"id": "07296b46-a9df-4769-a15c-b22fa0459c5a", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 01:45", "url": "https://www.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "1. Israeli airstrike on Al-Shaboura refugee camp in Rafah city, southern Gaza, kills two young children and injures several others.\n2. Palestinian Civil Defense in Gaza and Kuwait Hospital in Rafah confirm casualties.\n3. Um Rami, grandmother of the children, expresses grief, stating they were her \"first joy\" and mentioning previous displacements by Israeli military.\n4. Maram Abu-Shalab, children's aunt, confirms strike on family's shelter without warning."}, {"id": "c03de286-554e-49f3-bdaf-18ceb39e2d5c", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 02:00", "url": "https://us.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "- Israeli airstrike on Al-Shaboura refugee camp in southern Gaza's Rafah city kills two young children and injures several people\n- Um Rami speaks to her daughter after the airstrike, who had put her kids to bed after playing with neighbors and having dinner\n- Um Rami identifies the children in body bags as her first and only grandchildren\n- Um Rami mentions the family has been displaced multiple times but it doesn't matter to the Israeli military\n- Aunt Maram Abu-Shalab says the Israeli military struck the home without giving a warning"}, {"id": "b194d5d7-6a62-4148-851a-185af464001f", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 05:00", "url": "https://edition.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "- Israeli airstrike on Al-Shaboura refugee camp in Rafah, Gaza, killing two young children and injuring several people\n- Um Rami speaking to her daughter about putting her kids to bed after playing and having dinner\n- Um Rami pointing at the body bag, identifying her grandchildren as the ones killed\n- Um Rami mentioning being displaced multiple times by Israeli military\n- Maram Abu-Shalab stating that the Israeli military struck the home without warning"}, {"id": "19a76cef-ef20-4e73-941d-7b45a63e201f", "title": "1 killed , 3 injured in Israeli strikes on Lebanese villages", "date": "2024-05-01 22:15", "url": "https://www.prokerala.com/news/articles/a1527609.html", "message": "Beirut, May 2 : A Hezbollah fighter was killed and three civilians were injured in Israeli airstrikes on Lebanese villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Wednesday that an Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter inside the house, Xinhua news agency reported.\nAccording to the sources, another airstrike targeted the southeast village of Adaysseh, wounding three civilians.\nThe military sources added that Israeli warplanes carried out on Wednesday a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 445 people on the Lebanese side, according to Lebanese security sources.", "location": "Tayr Harfa", "classification": "security", "score": 0.9841721306046511, "event_breakdown": "1. Hezbollah fighter killed, three civilians injured in Israeli airstrikes on Lebanese villages in southern Lebanon.\n2. Israeli warplane launches two missiles in Tayr Harfa village, destroying a house and killing Hezbollah fighter.\n3. Another airstrike targets Adaysseh village, wounding three civilians.\n4. Israeli warplanes carry out series of airstrikes on three towns and villages in eastern and central sectors of border area in southern Lebanon.\n5. Confrontations between Hezbollah and Israel have resulted in 445 deaths on the Lebanese side, according to Lebanese security sources."}, {"id": "9db8c944-33dc-4e08-9a30-65787756c6b1", "title": "Military concludes airstrike in Syria last May killed civilian , not terrorist", "date": "2024-05-02 18:30", "url": "https://www.wsgw.com/military-concludes-airstrike-in-syria-last-may-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThough the investigation found several areas the command could improve on, according to the summary, it did not recommend any accountability actions for killing a civilian.\nIn a tweet on May 3, the same day as the strike, a group known as “The White Helmets” who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported.", "location": "Northwestern Syria", "classification": "security", "score": 0.8691106551687732, "event_breakdown": "1. U.S. airstrike in northwestern Syria last May kills a civilian, not a senior al Qaeda leader, as initially claimed.\n2. Investigation concludes without recommending accountability actions for the civilian death.\n3. \"The White Helmets\" identify Masto as the civilian killed during the strike while grazing sheep.\n4. Defense Secretary Lloyd Austin issues a Civilian Harm Mitigation and Response Action Plan to reduce civilian casualties in U.S. military operations."}, {"id": "2587ef9f-1fc4-4bd0-8805-385bb4bdfccb", "title": "Russo - Ukraine War - 01 May 2024", "date": "2024-05-02 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-01.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nDuring the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7x concentrations of Russian troops.", "location": "Vodolahi", "classification": "security", "score": 0.6041034177583948, "event_breakdown": "- On 24 February 2022, Ukraine was attacked by land, naval, and air forces of Russia, starting the largest European war since the Great Patriotic War.\n- Russian forces conducted air strikes in Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\n- Russian forces fired artillery and mortars at over 10 settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\n- Ukrainian Air Force launched air strikes on 1 command post and 7 concentrations of Russian troops on May 1."}, {"id": "3a080e19-c0d2-414a-b9ec-4ed740c603ad", "title": "Russia breached global chemical weapons ban in Ukraine war , US says - New Delhi Times - India Only International Newspaper", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russia-breached-global-chemical-weapons-ban-in-ukraine-war-us-says/", "message": "The United States accused Russia on Wednesday of breaching a global chemical weapons ban by deploying the choking agent chloropicrin against Ukrainian troops.\nThe State Department also accused Russia of using riot control agents “as a method of warfare” in Ukraine.\nAdditionally, Russian forces have used grenades loaded with CS and CN gases, according to the Ukrainian military.\nA guided bomb attack killed two civilians, including a 38-year-old woman and her father, Kharkiv regional Governor Oleh Syniehubov said.\nRussia’s defense ministry said Wednesday that it thwarted Ukrainian drone attacks targeting several Russian regions.", "location": "Kharkiv", "classification": "security", "score": 0.5130149429885166, "event_breakdown": "- The United States accuses Russia of deploying chloropicrin against Ukrainian troops\n- The United States accuses Russia of using riot control agents in Ukraine\n- Russian forces use grenades loaded with CS and CN gases, according to the Ukrainian military\n- Guided bomb attack kills two civilians in Kharkiv region\n- Russia thwarts Ukrainian drone attacks targeting several Russian regions"}, {"id": "867b44ff-f998-4ca2-a9ca-1a52a34fd9b9", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "- A 15-year-old boy charged in a stabbing at a church in Sydney plotted an attack against the Jewish community\n- Prosecutors argue that the boy wanted to attack Jewish community members\n- The boy's attorney claimed his talk was nothing more than boasting\n- The revelations came during a bail hearing for the youth\n- The Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack\n- The stabbing occurred at Bishop Mar Mari Emmanuel's church in Wakeley, western Sydney \n- The boy's statement about wanting to attack Jews was made in a group chat on April 20"}, {"id": "123da6e5-d292-4201-9a92-f316da2b7682", "title": "Three terrorists killed in Tank operation", "date": "2024-05-02 15:00", "url": "https://tribune.com.pk/story/2464897/three-terrorists-killed-in-tank-operation", "message": "Security forces on Thursday killed three terrorists during a joint intelligence-based operation (IBO) in Khyber-Pakhtunkhwa’s Tank district, the military said in a statement.\nAccording to the Inter-Services Public Relations (ISPR), during the operation, following a fierce exchange of gunfire, security forces successfully neutralised three terrorists, including ringleaders Azmat alias Azmati, Karamat alias Hanzla, and terrorist Rehan.\nThe slain militants remained “actively involved” in several terrorist activities in the area, including the recent abduction of a district and sessions judge of South Waziristan district, the military’s media wing stated.\nIt further asserted that the security forces remain determined to eliminate the menace of terrorism from the country.\nRead more: At least four terrorists killed in Tank IBOHe returned home safely, the Counter-Terrorism Department (CTD) confirmed on Monday.", "location": "Tank district", "classification": "security", "score": 0.9552469463617089, "event_breakdown": "- Security forces killed three terrorists in a joint intelligence-based operation (IBO) in Tank district, Khyber-Pakhtunkhwa\n- The slain militants were involved in terrorist activities, including the recent abduction of a judge in South Waziristan district\n- The Counter-Terrorism Department (CTD) confirmed the safe return of an individual"}, {"id": "66a5ebb9-f962-4c7f-9a58-1b682e90b3e0", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240502-voa01.htm", "message": "Russian missile attack injures 14 in OdesaBy VOA News May 02, 2024Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.7993261792230087, "event_breakdown": "1. Russian missile attack injures 14 people at a postal facility in Odesa, southern Ukraine, according to Ukrainian officials.\n2. Oleh Kiper, regional governor of Odesa, condemns the attack as a crime against Ukrainian civilians by Russia.\n3. Ukrainian drones attempted to attack an energy facility in Smolensk, according to Vaisly Anokhin, the regional governor.\n4. Roman Staravoit, governor of the Kursk region, reports Russian forces downing a Ukrainian drone and damaging power lines.\n5. Ukrainian military reports Russian forces using grenades loaded with CS and CN tear gases."}, {"id": "769d439d-3fd4-4f1d-9c33-f81c99838bd1", "title": "Russia Shows Off NATO Military Equipment Taken From Ukraine", "date": "2024-05-01 21:30", "url": "https://www.shtfplan.com/headline-news/russia-shows-off-nato-military-equipment-taken-from-ukraine", "message": "Russian crowds are getting to see a new exhibition in Moscow of NATO (North Atlantic Treaty Organization) military hardware that was captured by Russian forces in Ukraine.\nThe display shows off a whole lot of “trophies,” ranging from United States-made armored fighting vehicles to state-of-the-art tanks and European armored personnel carriers.\nThe military equipment has come from 12 countries including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\nRussia Has Destroyed 1/3 Of U.S.\nRussia is advancing and making mincemeat of the equipment sent to Kiev by the West.", "location": "Moscow", "classification": "security", "score": 0.557853972490328, "event_breakdown": "1. Exhibition in Moscow displays NATO military hardware captured by Russian forces in Ukraine.\n2. Display features trophies including armored fighting vehicles, tanks, and armored personnel carriers from 12 countries.\n3. Russian advancement in Ukraine results in destruction of one-third of U.S. military equipment sent to Kiev."}, {"id": "7814de0b-1c75-4587-a1e2-ac46ce9d378c", "title": "Surprise : Literal Terrorist Visits Pro - Terrorism  Encampment  at Major University in Chicago", "date": "2024-05-02 15:00", "url": "https://townhall.com/tipsheet/guybenson/2024/05/02/surprise-literal-terrorist-visits-pro-terrorism-encampment-at-major-university-in-chicago-n2638509", "message": "When I call Ayers and Dohrn 'terrorists,' I mean it quite literally.\nMr. Ayers, who is 56, calls it a memoir, somewhat coyly perhaps, since he also says some of it is fiction.\nIn his book Mr. Ayers describes the Weathermen descending into a ''whirlpool of violence.''\nBetween 1970 and 1974 the Weathermen took responsibility for 12 bombings, Mr. Ayers writes...\nAdvertisementbill ayers of the weather underground addresses students at the uchicago popular university for gaza ‼️‼️ pic.twitter.com/V7MSsS4Q8V — kxh (@halfmoonpoem) April 29, 2024A literal, unrepentant, anti-American terrorist bomber addressing a pro-terrorism crowd.", "location": "Chicago", "classification": "security", "score": 0.8025635353799333, "event_breakdown": "- Bill Ayers of the Weather Underground addresses students at the University of Chicago Popular University for Gaza\n- Mr. Ayers calls his book a memoir, suggesting some elements are fiction\n- In his book, Mr. Ayers describes the Weathermen descending into a \"whirlpool of violence\"\n- Between 1970 and 1974, the Weathermen claimed responsibility for 12 bombings"}, {"id": "9be36504-1952-41c5-ab47-c18acc5d06ef", "title": "USS Cole Anniversary Today : Media Silent", "date": "2024-05-03 13:45", "url": "https://www.newsbusters.org/blogs/nb/richard-newcomb/2007/10/12/uss-cole-anniversary-today-media-silent", "message": "On this day in the year 2000, the guided missile destroyer USS Cole was attacked by Islamic terrorists associated with Osama bin Laden's al-Quaeda group.\nToday is the seventh anniversary of that attack.\nThe most recent example occured in 1968 when North Korea attacked the USS Pueblo.\nYet not a single media organ seems to care that Americans were attacked and killed.\nThe USS Pueblo was attacked and captured by North Korea, not North Vietnam.", "location": "Yemen", "classification": "security", "score": 0.9382491564323843, "event_breakdown": "1. USS Cole, a guided missile destroyer, attacked by Islamic terrorists associated with Osama bin Laden's al-Qaeda group.\n2. Seventh anniversary of USS Cole attack observed.\n3. USS Pueblo, a United States Navy intelligence ship, attacked and captured by North Korea in 1968."}, {"id": "ececfe6b-edba-43af-add3-4f1422149fb0", "title": "Odesa Currently Seen As Key Target For Russian Strikes Air Force", "date": "2024-05-01 15:15", "url": "https://menafn.com/1108160426/Odesa-Currently-Seen-As-Key-Target-For-Russian-Strikes-Air-Force", "message": "(MENAFN- UkrinForm) The Russians have now picked the city of Odesa as the key target for their strikes.\nOvernight Wednesday, they attacked densely populated areas with three Iskander-M ballistic missiles.\nThat's according to a spokesperson for Ukraine's Air Force Ilia Yevlash, who spoke on the air of the national telethon, Ukrinform reports.\nThis is another manifestation of the bloodthirsty face of Russian terror.\nLate Tuesday night, Russian ballistic missiles hit Odesa again, killing three.", "location": "ODESA", "classification": "security", "score": 0.6152281997442713, "event_breakdown": "- Russians pick Odesa as key target for strikes\n- Overnight Wednesday, Russians attack densely populated areas with three Iskander-M ballistic missiles\n- Spokesperson for Ukraine's Air Force confirms the attacks on Odesa\n- Late Tuesday night, Russian ballistic missiles hit Odesa killing three"}, {"id": "5d71b94b-457c-445f-bc2b-158241e14fe6", "title": "Likely missile attack by Yemen Houthi rebels targets ... ", "date": "2024-05-01 22:00", "url": "https://accesswdun.com/article/2024/4/1240028", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "MOKHA, YEMEN", "classification": "security", "score": 0.7051436875164441, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels targeting a ship in the Red Sea off the coast of Mokha, Yemen\n- Decline in shipping through the Red Sea and Gulf of Aden due to the threat posed by Houthi attacks\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "c274472e-78a8-4f7a-99c2-457b93b26330", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14 – Winnipeg Free Press", "date": "2024-05-02 10:15", "url": "https://www.winnipegfreepress.com/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14", "message": "KYIV, Ukraine (AP) — The situation on the front line in eastern Ukraine is worsening but local defenders are so far holding firm against a concerted push by Russia’s bigger and better-equipped forces, a senior Ukrainian military official said Thursday.\n(Ukrainian Emergency Service via AP)Russia has pushed Ukraine onto the back foot on the battlefield as Kyiv grapples with shortages of troops and ammunition.\nUkrainian forces are now racing to build more defensive fortifications at places along the around 1,000-kilometer (600-mile) front line.\nUkraine’s difficulties have been deepening for months as the military waited for vital new military aid from the United States.\n‘’I’m not ruling anything out, because we are facing someone who is not ruling anything out,’’ he told the Economist, referring to Russian President Vladimir Putin.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.4373951667307425, "event_breakdown": "1. Worsening situation on the front line in eastern Ukraine reported by a senior Ukrainian military official.\n2. Russia's push has placed Ukraine on the back foot on the battlefield, amid shortages of troops and ammunition, according to reports.\n3. Ukrainian forces are rapidly constructing more defensive fortifications along the approximately 1,000-kilometer front line.\n4. Ukraine's difficulties have been exacerbated by delays in receiving crucial military aid from the United States.\n- Worsening situation on the front line in eastern Ukraine\n- Local defenders holding firm against Russia’s forces\n- Russia pushing Ukraine onto the back foot on the battlefield\n- Kyiv grappling with shortages of troops and ammunition\n- Ukrainian forces racing to build more defensive fortifications along the front line\n- Ukrainian military waiting for vital new military aid from the United States"}, {"id": "e0aff572-75f2-4942-bd3f-f2c54ed0e111", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel - LocalNews8 . com", "date": "2024-05-01 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "Tehran", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "1. Exhibition in western Tehran showcases Iranian missiles and drones used in the country's first-ever attack against Israel.\n2. Display features long- and medium-range ballistic missiles, cruise missiles, and drones from the Revolutionary Guard Aerospace Forces.\n3. Iran's attack on Israel involved drones, ballistic missiles, and cruise missiles.\n4. Belali asserts that NATO, the United States, and Arab countries attempted to thwart Iranian drones, missiles, and cruise missiles but failed.\n5. Israeli Defense Forces spokesperson Daniel Hagari reports ballistic missiles reaching Israel, causing only light structural damage to an airbase."}, {"id": "03c2e42a-a85f-4649-90ed-53fbd1a288e3", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "Abdirisaq Shino Shares 70TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "TALEEX, Somalia", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashes in Somalia’s Sool region\n- Debris of the cruise missile found in Taleex district, Somalia"}, {"id": "e2b5d676-d9dd-4c43-bc36-91c0c3751661", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus.\n- The strike occurred shortly before 11 p.m. and targeted a military position in the Damascus area.\n- Syrian state media reports confirmed the attack, with the Syrian Defense Ministry verifying the location.\n- Israeli warplanes reportedly launched missiles from over the Golan Heights in northern Israel during the strike.\n- Material losses were reported as a result of the attack.\n- The targeted building, located south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces.\n- The strike is seen as a development following a previous incident on April 1 where top Islamic Republic Revolutionary Guard Corps officers were killed in a similar attack attributed to Israel."}, {"id": "021f0fde-8801-4e8e-b281-6858f9ef6a01", "title": "When Tony Blair Bombed Montenegro", "date": "2024-05-02 19:45", "url": "https://consortiumnews.com/2024/05/02/when-tony-blair-bombed-montenegro/", "message": "It came amid airstrikes on Yugoslav forces in Kosovo, where Bill Clinton and Tony Blair waged a “humanitarian intervention” ostensibly to save ethnic Albanians from Serb leader Slobodan Milosevic.\nApproving Air StrikesThe Atlantic alliance did not specify which of its members had taken part in the air strikes on Montenegro at the time.\nSuch secrecy would become a common feature of future NATO air wars, making it hard for victims to hold individual states responsible.\nBut a formerly classified document reveals that Britain was heavily involved in the April 29, 1999 attack on Montenegro.\na decade on from the Kosovo war.", "location": "Montenegro", "classification": "security", "score": 0.46164487329001025, "event_breakdown": "1. Airstrikes target Yugoslav forces in Kosovo amid \"humanitarian intervention\" led by Bill Clinton and Tony Blair to protect ethnic Albanians from Slobodan Milosevic.\n2. NATO approves airstrikes on Montenegro, with participating members undisclosed initially.\n3. Secrecy surrounding NATO air operations becomes common practice, hindering accountability for victims.\n4. Declassified document reveals heavy involvement of Britain in the April 29, 1999 attack on Montenegro during the Kosovo war."}, {"id": "69604b4f-b92d-4384-9ccd-6598980c8efa", "title": "Russian missile attack injures 14 in Odesa - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russian-missile-attack-injures-14-in-odesa/", "message": "Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "ODESA", "classification": "security", "score": 0.8121557017618638, "event_breakdown": "1. Russian missile attack injures 14 people at a postal facility in Odesa, southern Ukraine, according to Ukrainian officials.\n2. Oleh Kiper, regional governor of Odesa, condemns the attack as a crime against Ukrainian civilians by Russia.\n3. Ukrainian drones attempted to attack an energy facility in Smolensk, as reported by Vaisly Anokhin, the regional governor.\n4. Roman Staravoit, governor of the Kursk region, reports Russian forces downing a Ukrainian drone and causing damage to power lines.\n5. Ukrainian military reports Russian forces using grenades loaded with CS and CN tear gases."}, {"id": "77580a51-2b85-46c3-891f-1a6f8353a067", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel", "date": "2024-05-01 18:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "Western Tehran", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "- Iran's first ever attack against Israel launched from Iranian soil\n- Display of missiles and drones at the Revolutionary Guard Aerospace Forces exhibit in western Tehran\n- Iran's attack on Israel using drones, ballistic missiles, and cruise missiles\n- Failure of NATO, the United States, and Arab countries to create barriers for Iran's drones, missiles, and cruise missiles\n- Ballistic missiles from Iran causing light structural damage at an Israeli airbase"}, {"id": "3ff74657-31ae-4c6b-8589-2fb59f346c40", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month.", "location": "Gaza", "classification": "security", "score": 0.7677629001437708, "event_breakdown": "- Gazan journalists haunted by colleagues' deaths while covering the war\n- Israel launches military assault on Gaza on October 7\n- Abu Dagga expresses desire to leave after seven months of war\n- Photojournalist for Turkish state broadcaster TRT travels through neighborhood after being displaced from local refugee camp\n- Dahman, 36, shares burden in interview with CNN last month"}, {"id": "c2b0a874-22ec-45d2-a6f5-ba29608b55a8", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged.", "location": "Saint Petersburg", "classification": "security", "score": 0.4280794057909932, "event_breakdown": "- A man was recruited by Ukraine to blow up military buildings and energy sites in Russia\n- The FSB security service killed the man who planned to commit terrorist acts in Russia\n- Planned attacks included targeting defence ministry facilities in the Moscow region, a volunteer battalion, and a volunteer center in Saint Petersburg\n- The man was also planning to attack a fuel depot in the Leningrad region"}, {"id": "b59fd916-f7fa-429b-947e-039b817a0452", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-02 15:30", "url": "https://www.naharnet.com:443/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "Odesa", "classification": "security", "score": 0.8647478397809565, "event_breakdown": "- Russia struck the southern Ukrainian port city of Odesa with ballistic missiles, injuring 14 people and starting a massive blaze\n- The third attack on Odesa hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta\n- Ukraine deployed long-range drones to target Russian infrastructure sustaining the war effort\n- Energy facilities in three Russian regions were damaged by Ukrainian drone strikes\n- Russian Defense Ministry reported Ukrainian drones shot down over Bryansk, Krasnodar, Rostov, and Belgorod regions"}, {"id": "ee088c26-120a-4fff-9b4c-d26f5ff3d35f", "title": "US military admits that air strike killed civilian in Syria last year", "date": "2024-05-02 19:30", "url": "https://us.cnn.com/2024/05/02/politics/us-military-admits-air-strike-killed-civilian-syria/", "message": "“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the summary says.\nStill, the US did not launch an official investigation of the strike until nearly 8 weeks later after the strike that killed him.\nMohammad Mesto sits next to the grave of his brother Lutfi, who was killed on May 3 in a suspected US military strike in northern Syria.\nIn that case, CENTCOM opened a formal 15-6 investigation into the strike within a week of the operation.\nMesto’s family previously told CNN that he had been out grazing his sheep when he was killed.", "location": "Northern Syria", "classification": "security", "score": 0.48503599557855004, "event_breakdown": "- May 3: Lutfi killed in a suspected US military strike in northern Syria\n- Mohammad Mesto sits next to his brother's grave\n- Nearly 8 weeks after the strike, the US launches an official investigation\n- CENTCOM opens a formal 15-6 investigation into the strike within a week of the operation"}, {"id": "dbedca9c-d72a-4ae2-a0b9-88c3e63939ef", "title": "Russia Says Mariupol Hospital Attack  Staged  By Ukraine : World News", "date": "2024-05-02 02:45", "url": "https://www.rashtranews.com/russia-says-mariupol-hospital-attack-staged-by-ukraine-world-news/", "message": "#Russia #Mariupol #Hospital #Attack #Staged #UkraineIgor Konashenkov has stated that the Mariupol hospital was staged by Ukraine.\nMoscow, Russia:The Russian army claimed Thursday that an attack on a children’s hospital in the southeastern Ukrainian port of Mariupol, which killed three including a child and caused global outrage, was a “staged provocation” by Ukraine.\n“The Russian aviation carried out absolutely no missions to hit targets on the ground in the Mariupol area,” Russian defence ministry spokesman Igor Konashenkov said.\n“The airstrike that allegedly took place is a completely staged provocation to maintain anti-Russian hype for a Western audience,” he said.\nThe bombing of the maternity hospital resulted in three deaths, including one child, according to the city’s mayor.", "location": "Mariupol", "classification": "security", "score": 0.6824509143885954, "event_breakdown": "1. Russian military claims the attack on a children's hospital in Mariupol, southeastern Ukraine, was a staged provocation by Ukraine.\n2. Russian Defense Ministry spokesman Igor Konashenkov denies Russian involvement in airstrikes targeting Mariupol, stating that the attack was fabricated to fuel anti-Russian sentiment.\n3. The bombing of the maternity hospital in Mariupol results in three deaths, including one child, according to the city's mayor."}]