[{"id": "7c325eea-a154-4b8c-bbe3-ef2ae8c5f761", "title": "US fears Middle East conflict growing as Israel and Hezbollah exchange attacks as Gaza ceasefire deal teeters", "date": "2024-06-13 02:45", "url": "https://www.independent.co.uk/news/world/middle-east/israel-hezbollah-gaza-ceasefire-hamas-b2561683.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nOn Tuesday, Israeli forces killed a senior Hezbollah commander, Taleb Sami Abdullah, known as Abu Taleb, near the Lebanon-Israel border.\nThroughout the war, Yemen’s Iran-backed Houthi militants and an Iran-aligned group in Iraq have targeted ships passing through the busy Red Sea shipping corridor, in protest of the Israeli war effort in Gaza.\n“That will take a tremendous amount of pressure out of the system.”There’s still considerable daylight between Israel, Hamas, and the US, over a proposed ceasefire deal.\nSenior Hamas official Osama Hamdan told AFP it is seeking to add provisions guaranteeing \"a permanent cease-fire and complete withdrawal\" by the IDF, demands Israel has rejected.", "location": "LEBANON", "classification": "security", "score": 0.6216855328098762, "event_breakdown": "* Israeli forces killed a senior Hezbollah commander, Taleb Sami Abdullah, known as Abu Taleb, near the Lebanon-Israel border on Tuesday.\n* Throughout the war, Yemen’s Iran-backed Houthi militants and an Iran-aligned group in Iraq have targeted ships passing through the busy Red Sea shipping corridor in protest of the Israeli war effort in Gaza."}, {"id": "55e5a12b-a4c2-485d-a051-e2ba0a903232", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-13 00:15", "url": "https://japantoday.com/category/world/hezbollah-vows-to-intensify-attacks-against-israel-after-senior-military-commander-is-killed", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "(AP Photo/Bilal Hussein)By BASSEM MROUEHezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 160 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": "Lebanon", "classification": "security", "score": 0.8538975048386656, "event_breakdown": "Event: The Israeli military said it launched strikes against Hezbollah targets in Lebanon in retaliation for an attack on its troops near the border. The strike targeted a command and control center used to direct attacks against Israel. The Israeli military said the attack was a response to the Hezbollah sniper attack that killed an IDF soldier near the border.\nEvent: A Lebanese official says Israel carried out an airstrike on a Hezbollah media center in Beirut. The official said the strike occurred at dawn on Sunday. It was not immediately clear if there were any casualties."}, {"id": "038797ac-77b0-4f29-8a17-0a8b0a3cd72e", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-13 01:30", "url": "https://www.stripes.com/theaters/middle_east/2024-06-12/hezbollah-israel-senior-military-commander-14159875.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Bilal Hussein/AP)BEIRUT — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": "Lebanon-Israel border", "classification": "security", "score": 0.8538975048386656, "event_breakdown": "BEIRUT, Lebanon: Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel.\nThe military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\nThe military said Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out a large number of attacks against Israeli civilians."}, {"id": "153242c5-09a2-4367-8007-bb0ad99d84f9", "title": "Rescue Operations Completed In Kryvyi Rih After Russian Missile Strike", "date": "2024-06-13 01:00", "url": "https://menafn.com/1108326653/Rescue-Operations-Completed-In-Kryvyi-Rih-After-Russian-Missile-Strike", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Emergency rescue operations in Kryvyi Rih after a Russian missile strike have been completed.\nThis was reported by Interior Ihor Klymenko on Telegram , Ukrinform reports.\n\"Emergency and rescue operations have been completed.\nAmong the are five children,\" Klymenko wrote.\nRussian strike at Staryi Saltov inregion, there are casualtiesAs reported, in the afternoon of 12 June, Russian troops launched a missile attack on the residential sector of Kryvyi Rih .", "location": "Kryvyi Rih", "classification": "security", "score": 0.40546827134813207, "event_breakdown": "Target event - Russian troops launched a missile attack on the residential sector of Kryvyi Rih.\nRussian troops launched a missile attack on the residential sector of Kryvyi Rih."}, {"id": "832c9205-12c7-47bd-b591-f96ea314e684", "title": "Ukraine says it struck Russian missile systems in Crimea", "date": "2024-06-13 03:30", "url": "http://www.china.org.cn/world/2024-06/13/content_117250815.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here: World视频播放位置 下载安装Flash播放器The Ukrainian military carried out missile strikes on Russian missile systems S-300 and S-400 in southern Crimea early Wednesday, the General Staff of the Ukrainian Armed Forces said in a statement.\nThe radar of the S-300 missile system stationed near the Belbek airfield was destroyed in the strike, the statement said.\nIt further said that two S-400 missile systems stationed near Belbek and the city of Sevastopol also came under attack.\nThe strikes caused a detonation of munition in all three areas where Russian anti-aircraft missile divisions are positioned, it said.\nOn Monday, the General Staff said that Ukrainian forces had struck two Russian S-300 complexes and one S-400 complex in Crimea.", "location": "NULL", "classification": "security", "score": 0.6141166971533244, "event_breakdown": "The Ukrainian military carried out missile strikes on Russian S-300 and S-400 missile systems in southern Crimea early Wednesday, the General Staff of the Ukrainian Armed Forces said in a statement."}, {"id": "32007e5a-d274-4eb4-9075-8d01619ea51f", "title": "Hezbollah launches rocket barrage on Israel after strike kills top commander", "date": "2024-06-13 01:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/hezbollah-launches-rocket-barrage-on-israel-after-strike-kills-top-commander/articleshow/110952418.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The Israeli offensive prompted Hezbollah to mount cross-border attacks in support of Hamas.\nThe Israeli military said in a statement on Wednesday that it had struck a Hezbollah command and control centre, killing Abdallah and three other Hezbollah fighters.As sirens sounded across north Israel, Israeli army radio said around 150 rockets had been launched from Lebanon in an apparent response to the Israeli strike.\nHezbollah claimed attacks on a string of military bases, including on Mount Meron, an area housing a radar station that is roughly 8km south of the border.\nHezbollah vowed to intensify its attacks.There were no immediate reports of casualties from the rocket barrages.\nIsraeli military said a number of the rockets had been intercepted, but that several had hit the ground and started fires.", "location": "Israel", "classification": "security", "score": 0.9594168991355775, "event_breakdown": "The Israeli army says it has \"successfully completed\" a \"wide-scale attack\" on the Gaza Strip, targeting various Hamas locations.\nThe Israeli army said Wednesday that it attacked Gaza \"from the air and land\" hours earlier.It was unclear if there were any casualties in the early morning attack.\nIt is intended to establish the effects of the atta\nck on Israel, the army and Hamas."}, {"id": "f0953a95-2d05-4e22-af0d-6afb81a0f8b0", "title": "Hezbollah fires most rockets yet in war after Israel kills a top commander", "date": "2024-06-13 04:00", "url": "https://www.asiaone.com/world/hezbollah-fires-most-rockets-yet-war-after-israel-kills-top-commander", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "He was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\nIn another, the group said it had attacked Israeli military headquarters in Ein Zeitim and Ami'ad, and an Israeli military air surveillance station in Meron.\nThe Israeli military earlier said Hezbollah had fired a barrage of around 50 launches from southern Lebanon into the Israeli-occupied Golan Heights.\nThe Israeli military said it fighter jets hit Hezbollah launch sites in two areas in southern Lebanon, while artillery shelled a third location.\nALSO READ: Hezbollah launches missiles and drones at northern Israel, wounding 14 Israeli soldiers", "location": "Lebanon", "classification": "security", "score": 0.9812995352305444, "event_breakdown": "Hezbollah fires missiles from Syria, Israel bombs Lebanon\nHezbollah fires missiles at northern Israel, wounding 14 Israeli soldiers"}, {"id": "4441c8c0-c14f-41ce-a669-daa079a5ce0c", "title": "Houthis attack ship in Red Sea using boat filled with explosives", "date": "2024-06-13 05:45", "url": "https://www.ynetnews.com/article/hjzp00x00h0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "The Houthis in Yemen launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.", "location": "The Houthis launched two anti-ship ballistic missiles over the Red Sea.", "classification": "security", "score": 0.6717468724090672, "event_breakdown": "Location: Red Sea\nReported events:\n1. The Houthis launched a boat-borne bomb attack against a commercial ship in the Red Sea.\n2. The U.S. military destroyed three anti-ship cruise missile launchers in Houthi-held Yemen.\n3. The Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage."}, {"id": "9632d47e-af43-4ffb-b197-ea3b77f065ea", "title": "Hezbollah vows to intensify attacks against Israel afte ... ", "date": "2024-06-13 02:45", "url": "https://accesswdun.com/article/2024/6/1247639", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": ")\nLebanon", "classification": "security", "score": 0.8704695448332581, "event_breakdown": "BEIRUT — Hezbollah vowed to intensify its attacks along the Lebanon-Israel border to avenge the death of its senior military commander by Israel on Wednesday.\nThe Israeli military said it targeted a Hezbollah command and control center, hitting a major pillar of the militant group's operations."}, {"id": "6a87ef4d-e373-4e95-b45d-563475936f3e", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea – Metro US", "date": "2024-06-13 02:15", "url": "https://www.metro.us/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/", "domain": "metro.us", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said.", "location": "The USS Laboon was in the Red Sea when the attack occurred.", "classification": "security", "score": 0.6461415547546906, "event_breakdown": "Targets identified in above map included Houthi rebels launching boat-borne bomb attack against the bulk carrier Tutor in Red Sea from Yemen, US military destroying three anti-ship cruise missile launchers and one rebel drone over the Red Sea, Houthis launching two anti-ship ballistic missiles over the Red Sea."}, {"id": "35a0bc9a-e9fe-42c6-9764-4eb13f59ede7", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 00:45", "url": "https://isp.netscape.com/news/world/story/0001/20240612/12e8bf184bfa08669bbe17b8e1f99b0f", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red SeaABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer Laboon, when the alert came in on the attack.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,” he said.", "location": "ABOARD THE USS LABOON IN THE RED SEA.", "classification": "security", "score": 0.5959490348245454, "event_breakdown": "Location: Red Sea\nTarget Event: Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red Sea"}, {"id": "32a4268d-5dbe-419b-8e78-d843cedf5e6c", "title": "Israel faces major Hezbollah escalation as Rafah battle continues", "date": "2024-06-13 01:15", "url": "https://www.longwarjournal.org/archives/2024/06/israel-faces-major-hezbollah-escalation-as-rafah-battle-continues.php", "domain": "longwarjournal.org", "domain_classification": "Unknown", "message": "(IDF image)Hezbollah launched “at least 215 rockets from Lebanon” at Israel on June 12 in the most significant escalation by the Iranian-backed terrorist group over eight months of war.\nHezbollah has been targeting Israel with rockets, drones, and missiles since October 8, 2023, when it chose to back Hamas’s war.\nHezbollah attacks usually average about a dozen or more projectiles daily, in contrast to the more than 215 launched on June 12.\nHezbollah’s attacks on Israel continued throughout June 12, and the group claimed responsibility for them to the pro-Iranian media outlet Al-Mayadeen.\nIranian media also claimed Hezbollah had targeted Israeli “spy facilities.” The terrorist group frequently claims it is able to carry out precision attacks targeting IDF posts and bases.", "location": "Lebanon", "classification": "security", "score": 0.9387676296190255, "event_breakdown": "Hezbollah fired 215 rockets at Israel targeting multiple towns and cities including Haifa, Tiberias and more. The rockets were fired from Lebanon by Hezbollah attacks on Israel. No casualties were reported. IDF responded by striking targets in Lebanon."}, {"id": "2b0d6b96-caf8-48ab-8d32-29e38916f105", "title": "Hezbollah Launches Retaliatory Strikes for Killed Commander as U . N . Accuses Hamas , Israel of War Crimes", "date": "2024-06-13 02:15", "url": "https://foreignpolicy.com/2024/06/12/hezbollah-commander-killed-israel-hamas-war-crimes-un/?tpcc=recirc_trending062921", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "Welcome back to World Brief, where we’re looking at escalations on the Israel-Lebanon border, European tariffs against Chinese electric vehicles, and Russian military drills.\nRevenge OperationHezbollah launched around 170 missiles and rockets at northern Israel on Wednesday in retaliation for the Israel Defense Forces (IDF) killing a top Hezbollah commander the day before.\nThe strikes—which targeted Israeli military factories, bases, and an air surveillance station—were one of the largest Hezbollah attacks on Israel since the Israel-Hamas war began eight months ago.\nOn Tuesday, Israeli forces killed Taleb Sami Abdullah (known as Hajj Abu Taleb), the most senior Hezbollah commander to be killed yet, along with three other Hezbollah fighters at a command-and-control center near Jouaiyya, Lebanon.\nLast month, the United States quadrupled tariffs on Chinese electric vehicles as well as semiconductors, solar cells, and advanced batteries.", "location": "Based on the context provided, I was unable to come up with a specific location for the event.", "classification": "security", "score": 0.8447795388060858, "event_breakdown": "Russian troops staged sweeping maneuvers in the Baltic Sea amid heightened tensions with NATO alliance."}, {"id": "789165dd-c455-403f-a5a1-ed9f395e14ff", "title": "Worcester police investigate shooting at WRTA bus hub", "date": "2024-06-13 00:15", "url": "https://www.yahoo.com/news/worcester-police-investigate-shooting-wrta-234607478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police investigate a shooting at the WRTA bus hub on Foster Street in Worcester.\nWORCESTER ― Police are investigating a shooting that occurred around 6:30 p.m. Wednesday at the Worcester Regional Transit Authority bus hub on Foster Street.\n11 Walmart/Fair Plaza bus, with several gun casings on the ground.\nThe shooting occurred just a few hours after a stabbing victim, a 32-year-old man, was taken to the hospital from a scene at Elm and West streets.\nThis article originally appeared on Telegram & Gazette: Worcester police investigate shooting at WRTA bus hub", "location": "WORCESTER", "classification": "security", "score": 0.9673160897951757, "event_breakdown": "Target event:\nWorcester police investigate shooting at WRTA bus hub"}, {"id": "50695376-9425-415e-8d12-711f85288e6d", "title": "Hamas calls on US to put  direct pressure  on Israel for permanent ceasefire", "date": "2024-06-13 06:15", "url": "https://www.thejournal.ie/hamas-gaza-israel-antony-blinked-ceasefire-plan-6407843-Jun2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "Meanwhile, Hamas has called for the US to put “direct pressure” on Israel to secure a permanent ceasefire.\nA senior Hamas official, Osama Hamdan, said it sought “a permanent ceasefire and complete withdrawal” of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel’s northern border with Lebanon.\nThe Gaza war broke out after Hamas’s 7 October attack which resulted in the deaths of 1,194 people, mostly civilians.\n‘Starvation’A UN investigation concluded yesterday that Israel has committed crimes against humanity during the Gaza war, including that of “extermination”.", "location": "GAZA", "classification": "security", "score": 0.8539918439884797, "event_breakdown": "Israel's air strikes on Gaza from 2019-2021, and Hezbollah rockets from Lebanon in 2022."}, {"id": "cf158580-042c-4ac1-9b19-675f3b5aa411", "title": "Mangaluru City Police : Boliyar stabbing : 7 more arrested | Mangaluru News", "date": "2024-06-13 04:00", "url": "https://timesofindia.indiatimes.com/city/mangaluru/boliyar-stabbing-7-more-arrested/articleshow/110951850.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently70-year-old man stabbed in 'revenge' in Delhi, accused heldA 42-year-old man, Amit, was arrested for stabbing a 70-year-old in north Delhi.\nCity Police Commissioner Anupam Agrawal reported the incident in front of a bar in Boliyar.\nMangaluru: The city police have arrested seven more people in connection with the stabbing of two BJP workers at Boliyar in Konaje police station limits on Sunday evening.\nWith this, the total arrested accused in the case has gone up to 13.City police commissioner Anupam Agrawal said that the arrested accused are Imran, Koli Irshad, Tajuddin alias Sadiq, Sarvan, Mubarak, Ashraf and Tallath.\nThe police had booked a case against 20 accused in the stabbing incident.Three special teams have been constituted to trace all the absconding accused.", "location": "Konaje", "classification": "security", "score": 0.4936489063991653, "event_breakdown": "Event 1: 70-year-old man stabbed in 'revenge' in Delhi, accused held\nEvent 2: Mangaluru: City police arrest seven more people in connection with stabbing of two BJP workers\nEvent 3: City police commissioner Anupam Agrawal reported the incident in front of a bar in Boliyar"}, {"id": "fe9b2e50-50e3-4b69-80ab-d54bb7e45346", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 05:30", "url": "https://www.recorderonline.com/news/national_news/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/article_d26c36b7-2cea-56dd-b6a3-8079b087c587.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have launched a boat-borne bomb attack against a commercial ship in the Red Sea, further escalating their campaign despite a U.S.-led campaign trying to protect the vital waterway", "location": "Based on the information in the text, the main location where the boat-borne bomb attack against a commercial ship in the Red Sea", "classification": "security", "score": 0.8845603705242675, "event_breakdown": "Houthi rebels launch boat-borne bomb attack against commercial ship in Red Sea"}, {"id": "50534cb0-359a-447d-9d9c-1049e600b351", "title": "World News | Yemen Houthi Rebels Launch Boat - borne Attack Against Greek - owned Ship in Red Sea", "date": "2024-06-13 01:15", "url": "https://www.latestly.com/agency-news/world-news-yemens-houthi-rebels-launch-boat-borne-attack-against-greek-owned-ship-in-red-sea-6034005.html", "domain": "latestly.com", "domain_classification": "Unknown", "message": "Dubai, Jun 13 (AP) Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a US-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the US campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe captain “reports the vessel is taking on water, and not under command of the crew,” the UKMTO said.\nThough he and others stressed at the time they were still investigating the attack, he stressed it appeared the vessel targeted had nothing to do with the war.", "location": "Dubai.", "classification": "security", "score": 0.4754026562043733, "event_breakdown": "Title: Houthi rebels launch boat-borne bomb attack against commercial ship in the Red Sea\nLocation: Off the coast of Yemen in the Red Sea\nReported By: The Associated Press\nDate: June 13, 2022"}, {"id": "4ee5f43c-c650-48a8-94ee-0cfc1e71df78", "title": "Murders & pilot errors : 6 African heads of state & govt who died in plane crashes", "date": "2024-06-13 01:00", "url": "https://www.pulse.ng/news/world/murders-and-pilot-errors-6-african-heads-of-state-and-govt-who-died-in-plane-crashes/y4pv1x2", "domain": "pulse.ng", "domain_classification": "Unknown", "message": "Mauritania Prime Minister Ahmed Ould BouceifOn May 27, 1979, a plane carrying Ahmed Ould Bouceif, the Prime Minister of Mauritania, crashed off the coast of Dakar, Senegal.\nPhoto Credit: Getty Pulse Live KenyaHowever, he died just a month later in a plane crash.\nThe situation in Burundi, however, remained peaceful, with the government declaring the plane crash an accident and appealing for calm.\nCentral African Republic Prime Minister Barthélemy BogandaADVERTISEMENTBarthélemy Boganda, the first Prime Minister of the Central African Republic, died in a plane crash on March 29, 1959, while en route from Berbérati to Bangui.\nMadagascar Prime Minister Joël RakotomalalaJoël Rakotomalala, the 9th Prime Minister of Madagascar, died in a helicopter accident on July 30, 1976.", "location": "Based on the context provided, I was not able to find a specific location for the event described.", "classification": "security", "score": 0.6374456126517598, "event_breakdown": "Event. location and date\nPlane crash off the coast of Dakar Senegal on May 27, 1979\nPlane crash in Burundi on June 25, 1979\nPlane crash in Berbérati, Central African Republic on March 29, 1959\nHelicopter accident in Madagascar on July 30, 1976"}, {"id": "3fd3ac52-739d-4d65-bbfc-9c2f0e361096", "title": "Nine killed , 29 injured , in Russian missile attack on Kryvyi Rih", "date": "2024-06-13 02:15", "url": "https://www.aljazeera.com/news/2024/6/13/nine-killed-29-injured-in-russian-missile-attack-on-kryvyi-rih", "domain": "aljazeera.com", "domain_classification": "International", "message": "Five children among those hurt after missile hit an apartment block in latest attack on Ukrainian president’s hometown.\nNine people have been killed and 29 injured, including five children, after a Russian ballistic missile struck an apartment building in Kryvyi Rih, Ukraine’s Interior Minister Ihor Klymenko said.\n“Every day and every hour, Russian terror proves that Ukraine, together with its partners, should strengthen air defences,” Ukrainian President Volodymyr Zelenskyy said after the attack.\nAbout 635,000 people lived in Kryvyi Rih before Russia launched its full-scale invasion of Ukraine in February 2022.\nIt lies in the southern industrial Dnipropetrovsk region where officials said three people, including a 13-year-old boy, were injured in a Russian drone attack on Wednesday.", "location": "KRYVYI RIH.", "classification": "security", "score": 0.5419565929108465, "event_breakdown": "Nine people have been killed and 29 others, including five children, wounded after a Russian ballistic missile hit an apartment building in the Ukrainian city of Kryvyi Rih on Thursday, Ukraine’s interior minister said.\nThe town lies in the southern industrial hub of Dnipropetrovsk region, which has been regularly targeted by Russian forces since the start of its full-scale invasion of Ukraine in February 2022.\n“Russia continues to wage a barbaric war against Ukraine, hitting residential buildings and infrastructure,” Ukraine’s president Volodymyr Zelensky said after the missile attack."}, {"id": "c0a5e68c-6d4e-41cd-8b1c-7a039824ced3", "title": "Yemen Houthi Rebels Launch Boat - Borne Attack Against Greek - Owned Ship In Red Sea", "date": "2024-06-13 04:15", "url": "https://www.outlookindia.com/international/yemens-houthi-rebels-launch-boat-borne-attack-against-greek-owned-ship-in-red-sea", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "AP journalists on an embark with the US Navy happened to be interviewing Cmdr.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer Laboon, when the alert came in on the attack.\nBlomberg took multiple calls from sailors on board the vessel giving updates on the apparent attack.\nThe Laboon is one of the destroyers accompanying the USS Dwight D. Eisenhower aircraft carrier and both has shot down Houthi fire and escorted vessels through the region.", "location": "RED SEA", "classification": "security", "score": 0.9540777858224697, "event_breakdown": "Houthi fire attack on USS Laboon and accompanying vessels in Arabian Sea"}, {"id": "08ebca70-3293-4d32-88de-dfe9f74e2045", "title": "1st LD Writethru : Yemen Houthis claim responsibility for attacking cargo ship , Israeli cities", "date": "2024-06-13 01:30", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/13/content_117250616.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA, June 12 (Xinhua) -- Yemen's Houthi group claimed responsibility on Wednesday for an attack on a cargo ship in the Red Sea and missile and drone strikes on two Israeli cities.\nHouthi military spokesman Yahya Sarea said in a televised statement that the group targeted the ship, identified as the \"Tutor,\" using \"an unmanned boat, several drones, and ballistic missiles.\"\nSarea justified the attack by accusing the cargo ship's owner of violating a Houthi ban on entering Israeli ports.\nThere has been no official statement from the Israeli side on the Houthi-claimed attacks.\nOf the 21 crew members of different nationalities aboard the ship, one has been declared missing in the first attack, the official said.", "location": "RED SEA", "classification": "security", "score": 0.8823577832407968, "event_breakdown": "Target event: Houthis attack Israeli merchant ship\nIn a first of its kind attack, Houthi rebels in Yemen launched a drone and a ballistic missile attack on an Israeli cargo ship in the Red Sea. The Houthi military spokesman said they have targeted the ship because it entered Israeli ports and had 21 crew members of different nationalities in Arabian Sea.\n[News, source: Google]"}, {"id": "cb5fd61b-7d13-434d-a44c-d53c920be54e", "title": "Kyiv Oblast enterprise ablaze for second day in a row after mass Russian attack on June 12", "date": "2024-06-13 07:45", "url": "https://www.yahoo.com/news/kyiv-oblast-enterprise-ablaze-second-062300347.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kyiv Oblast enterprise ablaze for second day in a row after mass Russian attack on June 12Firefighting efforts still ongoing in Kyiv OblastFirefighters are still making efforts to extinguish the fire occurred after Russian June 12 attack on an industrial facility in Kyiv Oblast as of June 13, Ukraine’s State Emergency Service reported.\nДСНС Київщини249 firefighters, 98 pieces of equipment, and four fire engines are involved in extinguishing the fire as of 7:00 a.m. EET.\nДСНС КиївщиниДСНС КиївщиниRussian mass attack on June 12Russia sent a mass missile and drone attack primarily directed at Kyiv using Kh-101/Kh-555/Kh-55 cruise missiles from Tu-95MS strategic bombers and Shahed drones overnight on June 12.\nKyiv and Kyiv Oblast were the key targets.\nRead the original article on The New Voice of Ukraine", "location": "KYIV OBLAST", "classification": "security", "score": 0.7319011018531913, "event_breakdown": "Firefighting efforts still ongoing in Kyiv Oblast after Russian attack on June 12"}, {"id": "a45096d9-8740-4967-8f02-df8d5e6c6265", "title": "Drone identifies , eliminates , armed terrorist", "date": "2024-06-13 07:30", "url": "https://www.israelnationalnews.com/news/391488", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "פעילות כוחות צה\"ל ברצועת עזה צילום: דובר צה\"לIDF troops are continuing intelligence-based, targeted operations in the area of Rafah.\nOver the past day, the troops conducted targeted raids in the area, located weapons, and eliminated several terrorists in close-quarters encounters.\nDuring one of the operations, IDF troops used a drone to identify and strike an armed terrorist.\nOver the past day, the troops eliminated more than ten terrorist operatives, including a terrorist who took part in the October 7th massacre in southern Israel.\nMoreover, over the past day, the IAF struck and dismantled over 45 terror targets throughout the Gaza Strip, including military structures, armed terrorist cells, rocket launchers, tunnel shafts, and additional terrorist infrastructure.", "location": "The main location where the IDF troops' activities are taking place is Rafah.", "classification": "security", "score": 0.9853816077463624, "event_breakdown": "Security event: IDF troops eliminate more than ten terrorist operatives in Gaza.\nEvent location: Gaza Strip"}, {"id": "9820fa72-1192-4c7a-a89e-9c27624ed332", "title": "Hezbollah Rains Down 160 Rockets On Northern Israel As War Expands", "date": "2024-06-13 04:45", "url": "https://www.zerohedge.com/geopolitical/hezbollah-rains-down-160-rockets-northern-israel-war-expanding", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "The Israel-Hezbollah war continues spreading and expanding along the border region, as on Wednesday the Shia paramilitary group backed by Iran fired some 160 missiles into Israel after the IDF killed a top Hezbollah commander, Taleb Sami Abdullah, in south Lebanon the day prior.\nIllustrative, via NBCThe commander oversaw all of the group's military operations in the central area of the Lebanon-Israel border, Hezbollah later confirmed.\nHe was so senior in the organization that he been active in fighting Israel even going back to the 1990s.\nAn Israeli military statement had confirmed his identity: \"Israeli Airforce aircraft eliminated Sami Taleb Abdullah, the commander of the Nasr Unit in the Hezbollah terrorist organization, last night,\" the IDF announced Wednesday.\nSlain Hezbollah commander Sami Taleb Abdullah, source: Israel HayomThe past week has also witnessed Israel's war cabinet take part in active discussion over whether to mobilize reserve forces, and whether the northern front should be expanded and an official war declaration made.", "location": "Lebanon", "classification": "security", "score": 0.6378006095629482, "event_breakdown": "IDF fires missiles into Lebanon, kills Hezbollah commander\nIDF fires missiles into Lebanon, kills Hezbollah commander"}, {"id": "770b1fed-aa61-4faf-9f7e-37f949fa7e78", "title": "Unmasking Iran strategy to take over the Middle East", "date": "2024-06-13 00:45", "url": "https://www.ynetnews.com/article/byo7jvdba", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Iran is spending billions of dollars to enact a four-part strategy to dominate the Middle East.\nThe short answer is that Iran’s money financed a highly productive strategy to project its power in the Middle East at the expense of Israel and the United States.\nIran’s money financed a highly productive strategy to project its power in the Middle East at the expense of Israel and the US.\nOperationally, Iran’s strategy is based first and foremost on the seemingly unending supply of “shahids” (martyrs) who are ready, either as true believers or because of mercenary motives, to wage jihad.\nThus, in their strategy, Iran’s terrorist armies take full advantage of the laws of warfare applying only to sovereign states.", "location": "Based on the context provided, I was unable to find a specific location for the event described.", "classification": "security", "score": 0.6127997435928835, "event_breakdown": "Iran has been known to support terrorist organizations that engage in violence such as Hizbollah. In 2022, they ratified it to join FATF, an agreement to combat terrorist financing."}, {"id": "b3bb6be0-ca47-4640-a231-93dda9912f56", "title": "Invaders Fired Seven Times At Border Of Sumy Region", "date": "2024-06-13 07:45", "url": "https://menafn.com/1108327617/Invaders-Fired-Seven-Times-At-Border-Of-Sumy-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) At night and in the morning, the Russian military fired 7 times at the border areas and settlements of Sumy region.\n\"At night and in the morning, the Russians fired 7 times at the border areas and settlements of the Sumy region.\nThe enemy fired at the Khotyn community with artillery (3 explosions).\nIn the Krasnopilska community, mortar shelling (2 explosions) and artillery (4 explosions) were recorded.\nAs Ukrinform reported earlier, Russian troops fired 14 times during the day at the border areas and settlements of Sumy region , with a total of 41 explosions recorded.", "location": "NULL", "classification": "security", "score": 0.8768563177138606, "event_breakdown": "Russian troops fired 7 times during the night and the next morning at the Sumy region villages - 3 bombs were exploded on the Khotyn community, 2 explosions in the Krasnigipilska community and 4 explosions in Krasnopilskay."}, {"id": "17c44e88-59f3-4222-b286-9a5ebcc636c6", "title": "Russian forces  deliberately starved  Ukrainians in Mariupol , new report claims", "date": "2024-06-13 06:15", "url": "https://www.independent.co.uk/news/world/europe/ukraine-war-russia-mariupol-starvation-report-b2561231.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}Russian forces deliberately starved Ukrainians in Mariupol as a tactic of war by targeting their water, food and medical facilities before taking the strategic port city in 2022, according to an investigation by an international human rights group.\nAs they lay siege to Mariupol between February and May 2022, Russian forces attacked its energy, water, food and healthcare infrastructure, Ms Murdoch said.\nSatellite imagery collected by the investigators also showed that Russian fighter aircraft deliberately attacked the Mariupol drama theatre, where hundreds of people were sheltering, with “two 500kg bombs” on 16 March.\nRussian forces hit the Neptun swimming pool complex, which has been turned into a food distribution point, despite the presence of hundreds of civilians.\nThe remaining civilians were “systematically vetted by pro-Russian forces for their loyalties to the Russian State apparatus, through a compulsory security screening process known as ‘filtration’,” the report claimed.", "location": "Mariupol", "classification": "security", "score": 0.6561543128887818, "event_breakdown": "Russian forces deliberately starved Ukrainians in Mariupol as a tactic of war by targeting their water, food and medical facilities before taking the strategic port city in 2022. According to an investigation by an international human rights group, Satellite imagery collected by the investigators also showed that Russian fighter aircraft deliberately attacked the Mariupol drama theatre.."}, {"id": "4537ae9d-7f3a-4536-a378-b1ab8c61c6c4", "title": "A view from both sides of the Israel - Lebanon border", "date": "2024-06-13 01:30", "url": "https://www.ypradio.org/2024-06-12/a-view-from-both-sides-of-the-israel-lebanon-border", "domain": "ypradio.org", "domain_classification": "Unknown", "message": "And this was just the latest escalation in fighting between Hezbollah and Israel since the war in Gaza began in October.\nKat, Jane, good to have you here.\nSHAPIRO: So I'm picturing you, Jane and Kat, on opposite sides of this border, with rockets flying back and forth.\nKat, is the Israeli military ready for a second front in the north?\nI mean, a war with Hezbollah in Lebanon would be very different from the war against Hamas in Gaza.", "location": "Lebanon", "classification": "security", "score": 0.5638659635171656, "event_breakdown": "Israeli Military - ready - (preparations for a second front)\nHezbollah - rocket fire\nGaza - war"}, {"id": "209438ef-22da-4786-b307-242be82c2231", "title": "TTC bus stabbing : one person seriously injured", "date": "2024-06-13 01:30", "url": "https://www.cp24.com/news/one-person-seriously-injured-in-stabbing-on-ttc-bus-in-etobicoke-1.6924592", "domain": "cp24.com", "domain_classification": "Unknown", "message": "An argument led to a stabbing on a TTC bus in Etobicoke that left two people injured late Wednesday afternoon, Toronto police said.\nOfficers received a call for a stabbing near Berry and Park Lawn roads, north of the Queensway, shortly before 6 p.m.Two males were reportedly having a verbal argument on a TTC bus and stabbed each other, police said.\nWhen officers arrived, they located one of the males with a stab wound.\nPolice said the second male fled the scene but was later located by officers.\nIt is unclear if the two males know each other and what led to the argument.", "location": "Etobicoke", "classification": "security", "score": 0.9357696503638723, "event_breakdown": "1. An argument led to a stabbing on a TTC bus in Etobicoke that left two people injured late Wednesday afternoon, police said.\n2. Officers received a call for a stabbing near Berry and Park Lawn roads, north of the Queensway, shortly before 6 p.m., police reported.\n3. Police said they found one male with a stab wound when they arrived to the site of a dispute between two people on a city bus in Toronto's Etobicoke area.\n4. Officers received a call for a stabbing near Berry and Park Lawn roads, north of the Queensway, shortly before 6 p.m. on Wednesday."}, {"id": "6e94ae40-6d1a-4e18-ad87-3bec8c73be86", "title": "Huthis claim attack on merchant ship in Red Sea off Yemen", "date": "2024-06-13 04:15", "url": "https://www.bssnews.net/news-flash/194894", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DUBAI, June 13, 2024 (BSS/AFP) - Yemen's Iran-backed Huthi rebels on Wednesday claimed an attack on a merchant ship in the Red Sea, part of an ongoing campaign they say is an act of solidarity with Palestinians.\nThe Huthis, who are at war with a Saudi-led coalition after ousting the government from Sanaa in 2014, have launched scores of drone and missile attacks on shipping in the Red Sea and Gulf of Aden since November.\nIn a statement on Wednesday, the rebels said they had carried out a \"military operation targeting the Tutor ship in the Red Sea, using a naval drone, aerial drones and ballistic missiles\".\nIt added that the vessel was \"hit for a second time by an unknown airborne projectile\" and that military authorities were assisting.\nCENTCOM -- which along with British forces has been conducting strikes in rebel-held Yemen in retaliation for the Red Sea attacks -- also said it had destroyed three anti-ship missile launchers and a Huthi drone over the past 24 hours.", "location": "The main focus of the event is the Red Sea.", "classification": "security", "score": 0.6283545144693771, "event_breakdown": "Location: Red Sea, Yemen\nTarget event: Yemen's Iran-backed Houthi rebels claim attack on merchant ship in the Red Sea"}, {"id": "bfcdae75-d276-4c98-8e74-1ca77410bbe8", "title": "Stabbing on TTC bus injures 2 males , 1 taken into custody", "date": "2024-06-13 06:15", "url": "https://www.cbc.ca/news/canada/toronto/ttc-bus-stabbing-1.7233448", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "A stabbing on a TTC bus in Etobicoke has left two males injured, one of whom is now in custody, police said on Wednesday.\nPolice were called to the bus at about 5:50 p.m.Police said on X, formerly Twitter, that they received a report of two males arguing on the bus and two males being stabbed.\nWhen they arrived, they found one male suffering from serious but non-life-threatening injuries.\nThe second male fled the bus, but was located later in hospital, where he was getting treatment for non-life-threatening injuries.\nPolice said they don't know if the accused and victim were known to each other, and the circumstances that led to the stabbing are unclear.", "location": "TORONTO", "classification": "security", "score": 0.8114272434446234, "event_breakdown": "Etobicoke bus stabbing"}, {"id": "25acbf88-9922-4192-8bf8-8cd85c76e457", "title": "Cargo ship attacked in Red Sea , crew member missing", "date": "2024-06-13 06:00", "url": "https://www.mangalorean.com/cargo-ship-attacked-in-red-sea-crew-member-missing/", "domain": "mangalorean.com", "domain_classification": "Unknown", "message": "Cargo ship attacked in Red Sea, crew member missingAden (Yemen): A commercial cargo ship was struck twice in attacks in the Red Sea off Yemen’s western coast, leaving one crew member missing and the vessel adrift, Yemeni and maritime officials reported.\nOf the 21 crew members of different nationalities aboard the ship, one has been declared missing in the first attack, the official said.\nThere was no immediate claim of responsibility from the Houthi group which controls the Hodeidah area.\nHowever, the group has launched numerous attacks in recent months against commercial shipping in the Red Sea.\nSince November last year, the Houthi group has launched anti-ship ballistic missiles and drones targeting what they said were Israeli-linked ships transiting the Red Sea, to show solidarity with Palestinians in the Gaza Strip.", "location": "RED SEA", "classification": "security", "score": 0.7731020773708124, "event_breakdown": "Cargo ship attacked in Red Sea, crew member missing. This can be placed off the coast of Yemen in the Red Sea."}, {"id": "7f47ae6a-4182-4987-ac79-d23d71be3719", "title": "UN Says Both Israel And Hamas Are Guilty Of War Crimes", "date": "2024-06-13 00:15", "url": "https://www.shtfplan.com/headline-news/un-says-both-israel-and-hamas-are-guilty-of-war-crimes", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "The United Nations is now saying that both Israel and Hamas have committed war crimes and both sides are guilty.\nAn independent commission has found that both Hamas and Israel are to blame for crimes against humanity.\nIsraeli authorities have committed war crimes and crimes against humanity in Gaza since October 7th, a United Nations-backed commission has found following an independent investigation.\nThe probe also found that Palestinian armed groups were responsible for war crimes committed in Israel, according to a report by RT.\n“It is imperative that all those who have committed crimes be held accountable,” said the chair of the commission, Navi Pillay.", "location": "Gaza", "classification": "security", "score": 0.7337187320553799, "event_breakdown": "Gaza, Israel"}, {"id": "6e26a7dd-6562-49aa-8b43-7b58b8a94ba6", "title": "Learning from Myanmar rebels , junta builds new Chinese drone fleet", "date": "2024-06-13 04:45", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217357/Learning-from-Myanmar", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Debris reportedly belonging to a drone, which was shot down by Myanmar resistance fighters, is pictured in southeastern Myanmar, in this handout picture released June 11, 2024.\nTwo rebel fighters in other parts of Myanmar also described similar skirmishes to Reuters.\nThe news agency interviewed four resistance fighters, two analysts and an official from a country in the region who tracks the conflict.\nHe said he obtained information on junta drones from military officials and people with knowledge of weapons production.\nTwo resistance fighters told Reuters that they had shot down drones that appeared to be originally designed for spraying crops.", "location": "Based on the text, it is not clear when and where the skirmishes took place, other than the context that they were in Myanmar.", "classification": "security", "score": 0.7626460445910652, "event_breakdown": "Debris reportedly belonging to a drone, which was shot down by Myanmar resistance fighters, is pictured in southeastern Myanmar."}, {"id": "046da668-2b5a-4046-a4b5-ca67361159b6", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-13 06:45", "url": "https://myrepublica.nagariknetwork.com/news/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes/", "domain": "myrepublica.nagariknetwork.com", "domain_classification": "Unknown", "message": "GENEVA, June 13: A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe commission found that in that attack, members of the military wings of Hamas and other Palestinian armed groups and Palestinian civilians committed war crimes, as well as violations and abuses of IHL and IHRL.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said.", "location": ")\nGAZA", "classification": "security", "score": 0.6927746373757014, "event_breakdown": "Israel-Palestine conflict"}, {"id": "9d38a811-58fa-4cec-b8e8-86343a74d99c", "title": "UN Probe Accuses Israel of Crimes Against Humanity , Hamas of War Crimes", "date": "2024-06-13 05:30", "url": "https://www.news18.com/world/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes-8931054.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "A UN investigation concluded Wednesday that Israel had committed crimes against humanity during the war in Gaza, including that of “extermination”, while Israeli and Palestinian armed groups had both committed war crimes.\nIt found that Israel “has committed war crimes, crimes against humanity” and other international law violations.\nThe commission determined that in that attack, members of the military wings of Hamas and other Palestinian armed groups, as well as Palestinian civilians, committed war crimes and other international law violations.\nThese acts were committed against civilians and members of the Israeli security forces, and constituted “war crimes”, it said.\n“Israel obstructed the commission’s investigations and prevented its access to Israel and the Occupied Palestinian Territory,” it added.", "location": "GAZA", "classification": "security", "score": 0.8173673363956726, "event_breakdown": "Target Event: Palestinian armed groups\nUN investigation recently determined Palestinian armed groups had committed war crimes and other international law violations during the armed conflict between Palestinian armed groups and Israel.\nUN claim about the military wings of Hamas and other armed groups summarily executing or causing the disappearance of at least 50 Palestinians they arrested in Gaza City."}, {"id": "c540f54d-e775-4b82-9ddd-30b8058b8210", "title": "Gaza ceasefire plan hangs in balance as Hamas seeks changes", "date": "2024-06-13 05:15", "url": "https://dunyanews.tv/en/World/818232-Gaza-ceasefire-plan-hangs-in-balance-as-Hamas-seeks-changes", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Gaza ceasefire plan hangs in balance as Hamas seeks changesWorld World Gaza ceasefire plan hangs in balance as Hamas seeks changesBlinken said Hamas had proposed numerous changes to a US-backed proposal for a ceasefire in Gaza.\nHamas also wants written guarantees from the US on the ceasefire plan, two Egyptian security sources said.\nUN FINDINGS ON WAR CRIMESThe war in Gaza began on Oct 7 when militants led by Hamas killed 1,200 Israelis and took more than 250 hostages, according to Israeli tallies.\nA UN inquiry found that both Israel and Hamas had committed war crimes early in the Gaza war and that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe evidence gathered by such UN-mandated bodies can form the basis for war crimes prosecutions.", "location": "GAZA", "classification": "security", "score": 0.7923664653615207, "event_breakdown": "Blinken said Hamas proposed numerous changes to a US-backed proposal for a ceasefire while the UN found that both did commit war crimes early in the Gaza war."}, {"id": "f81c1634-ab10-413f-9a1b-200fd62b314e", "title": "Russian ships arrive in Cuba as Cold War allies strengthen their ties", "date": "2024-06-13 07:00", "url": "https://krdo.com/news/2024/06/12/russian-ships-set-to-arrive-in-cuba-as-cold-war-allies-strengthen-their-ties/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "A CNN team on the ground saw members of the small Russian community in Cuba and Russian diplomats carrying national flags to welcome the crews.\nThe four Russian ships are now docked in berths usually occupied by cruise ships.\nUS Navy ‘monitors’ exercisesEn route to Cuba, the Russian warships conducted drills in the Atlantic, the Russian Ministry of Defense said Tuesday.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons.", "location": "Cuba", "classification": "security", "score": 0.5621866898196567, "event_breakdown": "US sends reconnaissance plane to monitor Russian warship movements en route to Cuba\nUS Navy 'monitors' exercises\nFour Russian warships are currently docked in berths usually occupied by cruise ships"}, {"id": "38bbe8fd-aa3b-4e8b-8a0b-c855afe4fb16", "title": "Morale : Drones Drive Russian Soldiers to Suicide", "date": "2024-06-13 04:45", "url": "http://www.strategypage.com/htmw/htmoral/articles/202406130251.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "There are enough old school Russian soldiers to make large scale infantry attacks possible.\nWhat this comes down to is life is considerably shorter for Russian men in peacetime and that gets worse in wartime.\nOn land the Ukrainian use of drones was so intense that droves carrying video cameras often spotted Russian soldiers committing suicide rather than waiting Ukrainian drones to find and kill them.\nUkrainian soldiers on the ground sometimes had opportunities to take cellphone photos of Russian soldiers committing suicide or finding bodies of Russian troops who had obviously killed themselves.\nUkrainian drones are an obvious cause of Russian suicides but the war in general has seen a substantial number of Russian soldiers choosing suicide over continued combat with the Ukrainians.", "location": "NULL", "classification": "security", "score": 0.6705701503523298, "event_breakdown": "Target eventUkraine:\nThere are enough old school Russian soldiers to make large scale infantry attacks possible. What this comes down to is life is considerably shorter for Russian men in peacetime and that gets worse in wartime."}, {"id": "9ebef344-5f02-480d-86ee-ee38bf1da476", "title": "Former SPAWAR civil engineer pleads guilty to government contracting bribery scheme", "date": "2024-06-13 02:15", "url": "https://www.sandiegouniontribune.com/news/courts/story/2024-06-12/former-spawar-civil-engineer-pleads-guilty-to-government-contracting-bribery-scheme", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "Soriano worked as a civilian engineer at SPAWAR and was a certified contracting officer representative.\nIn that role, he was not able to approve defense contracts himself — that was the job of a contracting officer — but he “had the ability to influence the award of defense contracts,” according to his plea agreement.\nFlores and his company, indicted alongside Soriano in November, have pleaded not guilty to the charges against them.\nCambridge International Systems pleaded guilty in April, admitting that the firm acted through Thurston to bribe Soriano in exchange for government contracts worth millions of dollars.\nLiberty Gutierrez, described in court documents as a close family friend of Soriano, pleaded guilty to a money laundering charge in 2021, admitting that she received $593,000 in salary from three contracting firms for which she did little or no actual work.", "location": "San Diego", "classification": "security", "score": 0.817608548205187, "event_breakdown": "{\n\"security_incidents\": [\n{\n\"time_frame\": \"2022\",\n\"target\": \"Press reports showed that a civilian engineer named Soriano at SPAWAR, a military research organization, pleaded guilty to accepting bribes in exchange for awarding government contracts to a company. The man, who worked as a civilian engineer, admitted that he influenced the award of defense contracts. The company that bribed the engineer has also pleaded guilty.\"\n}\n]\n}"}, {"id": "9cc9920f-0d56-43c0-998b-4d9a8942ed46", "title": "  I Should Be Dead : Gazans Recall Chaos Of Israeli Hostage Rescue Raid", "date": "2024-06-13 04:15", "url": "https://menafn.com/1108326926/I-Should-Be-Dead-Gazans-Recall-Chaos-Of-Israeli-Hostage-Rescue-Raid", "domain": "menafn.com", "domain_classification": "Unknown", "message": "'No one could move'Eyewitnesses said the Israeli raid and retreat were covered by heavy air strikes as well as drone and tank fire.\nSeveral told AFP they had seen bodies in the streets, which AFP could not independently verify.\nThe fighters also took about 251 hostages, of whom 116 hostages now remain in Gaza, although the army says 41 of them are dead.\nAlaa Al Khatib, a displaced woman living in the camp, told AFP she was walking to a market when she saw people climbing out of a refrigerated truck and exiting a small white car.\n“They were wearing clothes like Hamas and Islamic Jihad people, and some were masked,” said another local man, Mahmoud Al Assar, 27.", "location": "GAZA STRIP", "classification": "security", "score": 0.8930426752597913, "event_breakdown": "Israeli air strikes on a refugee camp in the Gaza Strip covered an Israeli raid and retreat at the site, witnesses told AFP.\nThe Israeli army said it had killed several fighters in the raid and that around 116 hostages had been taken, 41 of whom were dead."}, {"id": "f5fc5f42-de4a-4b83-a2b9-8db2b7fefb0f", "title": "Russia loses another 980 soldiers , 17 tanks and 34 artillery systems in one day", "date": "2024-06-13 07:30", "url": "https://www.yahoo.com/news/russia-loses-another-980-soldiers-044530413.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 980 soldiers, 17 tanks and 34 artillery systems in one dayThe Russians lost 980 servicemen, 17 tanks and 34 artillery systems on the battlefield over the past day.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 13 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:522,810 (+980) military personnel;7,928 (+17) tanks;15,208 (+21) armoured combat vehicles;13,770 (+34) artillery systems;1,099 (+0) multiple-launch rocket systems;846 (+2) air defence systems;359 (+0) fixed-wing aircraft;326 (+0) helicopters;11,075 (+33) strategic and tactical UAVs;2,285 (+5) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,794 (+58) vehicles and tankers;2,294 (+4) special vehicles and other equipment.\nSupport UP or become our patron!", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.8048109362606282, "event_breakdown": "Russia lost 980 servicemen, 17 tanks and 34 artillery systems in a single day, according to reports by the Ukrainian military, which have yet to be independently confirmed."}, {"id": "e6a576db-2506-4807-8e42-c0710a3cfddd", "title": "What are the rules when it comes to rescuing hostages ? ", "date": "2024-06-13 04:30", "url": "https://www.yahoo.com/news/rules-comes-rescuing-hostages-030000356.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "What are the rules when it comes to rescuing hostages?\nIsrael says it has rescued four hostages in Gaza who were kidnapped in a Hamas-led attack on Oct. 7.\nBut the mission is being questioned, and cannot be seen as an unqualified success — perhaps even by the former hostages and their families.\nIsrael is also under pressure from its own citizens, and Jews around the world, to bring the hostages home.\n“The really hard calculation is, if there’s no way you can (rescue hostages) without excessive loss of civilian life, are you prepared to sacrifice hostages or not?” Cook said.", "location": "GAZA", "classification": "security", "score": 0.5598710145313499, "event_breakdown": "Israel has rescued four hostages in Gaza who were kidnapped in a Hamas-led attack on Oct. 7.\n\nIsrael is under pressure from its own citizens, and Jews around the world, to bring the hostages home. The country is also being questioned about the operation."}, {"id": "26ed07c3-ab0a-405d-9394-ae769e2277f6", "title": "88th Air Base Wing at Wright - Patterson installs new command chief", "date": "2024-06-13 00:00", "url": "https://www.yahoo.com/news/88th-air-wing-wright-patterson-232134972.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The command chief of the Special Warfare Training Wing at Joint Base San Antonio-Lackland, Texas, is the new command chief of the 88th Air Base Wing at Wright-Patterson Air Force Base.\nCol. Dustin Richards, 88th Air Base Wing and installation commander, welcomed his new senior enlisted leader and wingman.\nThe 88th Air Base Wing command chief position was established in 2005.\nFrom 1992-2005, the position of command chief master sergeant was originally at the Aeronautical Systems Center level before coming to the Air Base Wing.\nThe wing provides support and services to the base, which includes a major acquisition center, research and development labs, major command headquarters, airlift wing and the world’s largest military air museum.", "location": "WRIGHT-PATTERSON AFB (STATES)", "classification": "security", "score": 0.834101506266631, "event_breakdown": "Target event not found"}, {"id": "95e7a2cd-e3af-4ec7-85b0-d044feb145e8", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-06-13 01:15", "url": "https://www.tvguide.co.uk/schedule/7d1f7a42-4d23-55d4-8e38-36b9992ba3ea/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "7:30 AM to 8:00 AMThursday 13 June", "location": "CARTHAGE", "classification": "security", "score": 0.8207262150489552, "event_breakdown": "7:30 AM to 8:00 AMThursday 13 JuneRemove all the reports that refer to a past event.\n7:30 AM to 8:00 AMThursday 13 JuneAdd the latitude and longitude to each event\n[\n  {\n    \"time\": \"9:05 AM\",\n    \"event\": \"A car bomb exploded in the Syrian city of Idleb. (N 36\\u00b0 34.876\\u00b0 E 36"}, {"id": "0abd0d28-a8d6-4ebc-a19c-c5ceb8ecd51e", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-13 04:30", "url": "https://www.news4jax.com/news/world/2024/06/12/hezbollah-vows-to-intensify-attacks-against-israel-after-senior-military-commander-is-killed/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "(AP Photo/Bilal Hussein)BEIRUT – Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 215 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": "Lebanon", "classification": "security", "score": 0.8538975048386656, "event_breakdown": "Target event: Helsene intensifies attacks against Lebanon-Israel border to avenge killing\nTo avenge the killing of its most senior military commander by Israel, Helsene vowed to intensify its attacks along the Lebanon-Israel border."}, {"id": "7be3351b-f3cc-4e3c-aef6-fb63375ac704", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 08:45", "url": "https://www.euronews.com/2024/06/13/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTYemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, marking another escalation in the face of a US-led campaign trying to protect the vital waterway.\nYemen's military spokesman, Brigadier General Yahya Saree, claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe US military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\nAn HSC-7 helicopter lands on the Arleigh Burke-class guided missile destroyer USS Laboon in the Red Sea.", "location": "The correct answer is:\nRED SEA", "classification": "security", "score": 0.8125177427662095, "event_breakdown": "Location: Red Sea\nHouthi rebels in Yemen launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, according to the military spokesman of the country. The attack targeted a Liberian-flagged, Greek-owned bulk carrier bearing the name \\\"Tutor\\\". The US destroyed three anti-ship cruise missile launchers in Houthi-held Yemen and a rebel drone over the Red Sea. In addition, a Houthi attack on a crude oil tanker in the Red Sea was reported. The Houthis fired two anti-ship ballistic missiles over the Red Sea, but they caused no damage and were intercepted."}, {"id": "09a5d27b-0e31-49e0-8070-6e6e716e3fb6", "title": "Hamas Urges US To Put  Pressure  On Israel For Permanent Gaza Ceasefire", "date": "2024-06-13 05:30", "url": "https://www.ndtv.com/world-news/hamas-urges-us-to-put-pressure-on-israel-for-permanent-gaza-ceasefire-5878753", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Blinken, in Doha for the last stop of a tour to promote President Joe Biden's Gaza ceasefire roadmap, said the United States would work with regional partners to \"close the deal\".\nA senior Hamas official, Osama Hamdan, said it sought \"a permanent ceasefire and complete withdrawal\" of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\nHezbollah also claimed more than 10 other attacks on the Israeli military, including one with drones.\n'Starvation'A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\".", "location": "Gaza", "classification": "security", "score": 0.5350490289699333, "event_breakdown": "* Israel-Palestine conflict: Blinken visits Doha to promote Gaza ceasefire\n* Israel-Hamas conflict: Israel-Hamas rocket attacks escalate, Israel responds with air strikes\n* Israeli-Palestinian conflict: Hezbollah rockets fire at Israel's northern border with Lebanon"}, {"id": "4aad2883-805e-45dc-a34a-0e2017472137", "title": "Cargo ship attacked in Red Sea , crew member missing", "date": "2024-06-13 01:45", "url": "https://www.prokerala.com/news/articles/a1539075.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Aden : , June 13 (IANS) A commercial cargo ship was struck twice in attacks in the Red Sea off Yemen's western coast, leaving one crew member missing and the vessel adrift, Yemeni and maritime officials reported.\nOf the 21 crew members of different nationalities aboard the ship, one has been declared missing in the first attack, the official said.\nThere was no immediate claim of responsibility from the Houthi group which controls the Hodeidah area.\nHowever, the group has launched numerous attacks in recent months against commercial shipping in the Red Sea.\nSince November last year, the Houthi group has launched anti-ship ballistic missiles and drones targeting what they said were Israeli-linked ships transiting the Red Sea, to show solidarity with Palestinians in the Gaza Strip.", "location": "RED SEA", "classification": "security", "score": 0.7514719587549318, "event_breakdown": "Commercial cargo ship struck in Red Sea off Yemen's western coast, leaving one crew member missing and vessel adrift"}, {"id": "cbd3549e-c1ea-41ee-9737-d6988311385c", "title": "CPD : Juvenile grazed in the head during drive - by shooting in East Price Hill", "date": "2024-06-13 01:15", "url": "https://www.wcpo.com/news/local-news/neighborhood-news/east-price-hill/cpd-juvenile-grazed-in-the-head-during-drive-by-shooting-in-east-price-hill", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "CINCINNATI — A juvenile was grazed by a bullet in a drive-by shooting Wednesday evening in East Price Hill, Cincinnati police said.\nCPD said a juvenile girl, who's exact age hasn't been revealed, had a graze to the head.\nAn officer on scene said a black SUV fled the scene with four male occupants in the vehicle.\nThis is the second juvenile who has been injured in a drive-by shooting in Cincinnati in the last 24 hours.\nTuesday evening around 8:30 p.m. a 15-year-old boy was injured in a drive-by shooting near South Avondale Elementary School.", "location": "CINCINNATI.", "classification": "security", "score": 0.8669671864214238, "event_breakdown": "Event 1: Cincinnati police said a juvenile girl was grazed in the head in a drive-by shooting Wednesday evening in East Price Hill. Four male occupants fled in a black SUV, according to police.\nEvent 2: About 24 hours earlier, a 15-year-old boy was wounded in a drive-by shooting near South Avondale Elementary School. Police said the teenager was an innocent bystander and added that there was no reason to believe that either incident was related."}, {"id": "f7b7a101-18b7-40f2-9380-6388f4c1677f", "title": "Russia - Ukraine war : List of key events , day 839", "date": "2024-06-13 02:15", "url": "https://www.aljazeera.com/news/2024/6/13/russia-ukraine-war-list-of-key-events-day-839", "domain": "aljazeera.com", "domain_classification": "International", "message": "Russia-Ukraine war: List of key events, day 839As the war enters its 839th day, these are the main developments.", "location": "UKRAINE", "classification": "security", "score": 0.5428428659096032, "event_breakdown": "Russia-Ukraine war: List of key events, day 840\n\nAs the war enters its 840th day, these are the main developments.\n\nUkraine: Russian forces carried out a missile strike on a strategic airport near Odesa, Ukraine's third-largest city and a key port on the Black Sea. The airport is used for military purposes and is located north of Odesa. The strike damaged the runway and destroyed several buildings."}, {"id": "6fdec804-6880-4fea-be69-601f7f2577e7", "title": "Stung by rebel drone tactics , Myanmar junta builds its own fleet", "date": "2024-06-13 04:30", "url": "https://www.japantimes.co.jp/news/2024/06/13/asia-pacific/myanmar-rebels-junta-chinese-drone/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Myanmar's resistance fighters notched decisive breakthroughs last year by relying on a scattered fleet of drones in battles against one of Southeast Asia's most feared militaries.\nBut as the civil war grinds on, the rebels increasingly find their familiar weapons — Chinese-made commercial drones modified to carry arms — in the unfamiliar hands of the country's ruling junta, according to seven people with knowledge of the matter.\n\"The battle is changing now as drones are being used by both sides,\" said a 31-year-old rebel fighter in the country's southeast, identifying himself by the nom de guerre of Ta Yoke Gyi.\nHe said the junta began using armed unmanned aerial vehicles (UAVs) to attack the rebels at around the turn of the year, and that a drone his unit recently shot down was identified as Chinese from its components and had been modified for combat.\nTwo rebel fighters in other parts of Myanmar also described similar skirmishes.", "location": "Myanmar", "classification": "security", "score": 0.5000536179995139, "event_breakdown": "List of current events of security reported in text that can be placed on a map:\n- In Myanmar, militias found their familiar weapons - Chinese-made commercial drones modified to carry arms - in the unfamiliar hands of the country's ruling junta. The popular forces trained to fight heavily armed resistance and found that they were gaining control of the drone and using it against the army."}, {"id": "5b961d64-79cf-4249-8066-bf4bfa9c9901", "title": "Islamic terrorists sacrifice children , then exploit the resulting outrage | WND", "date": "2024-06-13 00:45", "url": "https://www.wnd.com/2024/06/islamic-terrorists-sacrifice-children-exploit-resulting-outrage/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "This listing by Guterres, which includes Hamas and Palestinian Islamic Jihad terrorist organizations as well, is to be sent to the U.N. Security Council on June 14.\nObviously, this act equates the barbaric acts of Hamas in intentionally killing Israeli children and beheading babies to the unintentional killing of Palestinian children as a consequence of collateral fallout due to Hamas hiding among the innocent.\nUnwilling to sacrifice their seasoned soldiers to clear a path through the minefields, the mullahs recruited their own children to do it for them.\nMeanwhile, for the terrorists, a wounded Israeli they come across is a dead Israeli as they have been known to execute them on the spot.\nWhile such a mindset thrives for them when those dying children are infidels, it matters not if it comes to sacrificing Muslim children as well.", "location": "such as articles or prepositions.\nGAZA", "classification": "security", "score": 0.9542459700323719, "event_breakdown": "14 June 2022 - Guterres includes Hamas and Palestinian Islamic Jihad terrorist organizations in a U.N. Security Council listing.\n\nPalestine - A U.N. listing includes Hamas and Palestinian Islamic Jihad terrorist organizations. - U.N. Security Council - 14 June 2022"}, {"id": "d302b76b-2620-42e5-863e-5dcbdc8f8b67", "title": "Crowdfunding Weapons As Ukraine Soldiers Fight , Die", "date": "2024-06-13 00:00", "url": "https://menafn.com/1108326545/Crowdfunding-Weapons-As-Ukraine-Soldiers-Fight-Die", "domain": "menafn.com", "domain_classification": "Unknown", "message": "I had last visited my friends in the 109thSeparate Territorial Defense Brigade in the late summer of 2023, when their unit was stationed close to Bakhmut.\nSoldiers from the 109th Separate Territorial Defense Brigade prepared the radio-controlled car to drive it into a Russian trench later in the day after packing it with explosives.\nPhoto: David KirichenkoResigned to his fate but still there, still fightingI conducted drone warfare interviews with several soldiers from the unit, including Norman.\nWith my friends from the 109th Separate Territorial Defense Brigade.\nWhen we have to fight to defend ourselves and our loved ones, we will, but we can only take so much.", "location": "Bakhmut (city)", "classification": "security", "score": 0.8158723764931436, "event_breakdown": "2023 - Ukrainian troops from the 126th Separate Territorial Defense Brigade destroy parts of a Russian pontoon bridge over the Siverskyi Donets with a Stugna-P radio-controlled car, packed with explosives."}, {"id": "0d84f8af-d680-415c-b798-d4088893b695", "title": "The ICC actions against Israel undermine its credibility", "date": "2024-06-13 07:45", "url": "https://www.jpost.com/opinion/article-805684", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "At the end of World War II, the victorious Allies demanded unconditional surrender from both Germany and Japan.\nIn 1939, the majority of German citizens supported the Nazi party led by Adolf Hitler.\nGerman cities had been bombed into piles of rubble, Russian troops had entered Berlin, and millions of Germans were either dead or in captivity.\nWith defeat imminent, Hitler committed suicide.\nThe Nazi dream of a thousand-year Reich was over.", "location": "Berlin", "classification": "security", "score": 0.7316779198609941, "event_breakdown": "Target Event:\nThe unconditional surrender of Germany and the end of World War II. Germany's unconditional surrender to the Allies led to the end of the Nazi party and Hitler's leadership in Germany. This event marks a significant turning point in history and can be placed on the map of Berlin."}, {"id": "98f12a4d-7a12-4fe5-a229-96ac77a3c8c8", "title": "Reasi attack shows why security in Jammu and Kashmir needs more than just a military approach", "date": "2024-06-13 02:45", "url": "https://scroll.in/article/1069168/reasi-attack-shows-why-security-in-jammu-and-kashmir-needs-more-than-just-a-military-approach", "domain": "scroll.in", "domain_classification": "Unknown", "message": "The Reasi attack reiterated the fact that addressing the security challenges in Jammu and Kashmir require more than just a military approach; it must be embedded in local politics and a delicate societal equilibrium.\nIn 2023, a total of 59 people – 24 security personnel, seven civilians and 28 terrorists – were killed in Rajouri-Poonch.\nThe thinning of troops in the hilly areas of Jammu and Kashmir has had consequences.\nIn terms of geography, Rajouri-Poonch and even Reasi, which adjoins Rajouri, is an extension of Pakistan-controlled Kashmir.\nThe Reasi terror attack, which was clearly timed with Prime Minister Narendra Modi's swearing-in ceremony to get maximum attention internationally, has reinforced this fact at a great cost.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.7069616038757797, "event_breakdown": "The following events can be placed on a map:\n\n* In May 2023, a total of 59 people - 24 security personnel, seven civilians and 28 terrorists - were killed in Rajouri-Poonch.\n* In June 2023, the Reasi terror attack happened, which was clearly timed with Prime Minister Narendra Modi's swearing-in ceremony."}, {"id": "0f1251a6-3e59-427e-b855-27c33f270013", "title": "Russia Combat Losses In Ukraine Up To 522 , 810", "date": "2024-06-13 07:00", "url": "https://menafn.com/1108327507/Russias-Combat-Losses-In-Ukraine-Up-To-522810", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia's total combat losses since the invasion have reached 522,810.\nThese include 980 Russian and officers killed and wounded in the past 24 hours, Ukrinform reports with reference to the General Staff of Ukraine's Armed Forces.\nUkraine's Defense Forces have also destroyed 7,928 Russian tanks (+17 in the past day), 15,208 (+21) armored fighting vehicles, 13,770 (+34) artillery systems, 1,099 multiple rocket launchers, 846 (+2) air defense systems, 359 warplanes, 326 helicopters, 11,075 (+33) UAVs, 2,285 (+5) missiles, 28 warships/cutters, a submarine, 18,794 (+58) vehicles and fuel tankers, and 2,294 (+4) units of specialized equipment.\nThere were 89 combat engagements in frontline today, enemy is attacking in seven sectorsThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, air defenses for Ukraine will be on top agenda at 23rd Ramstein meeting, according to the Pentagon.", "location": "Ukraine", "classification": "security", "score": 0.8166634886077678, "event_breakdown": "Ukraine's general staff reports that Russia has lost 522,810 troops, 980 in the last 24 hours. They've also destroyed 7,928 tanks, 15,208 vehicles, etc.\nKyiv is the capital of Ukraine, and Kharkiv is located in the northeast of the country, so probably not relevant to this particular event."}, {"id": "690efa82-90b1-4b0c-89e0-439481ad5d83", "title": "Czech Republic approves plan to buy upto 77 Leopard tanks from Germany", "date": "2024-06-13 04:30", "url": "https://www.prokerala.com/news/articles/a1539085.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Prague, June 13 : The Czech Republic has added the purchase of up to 77 Leopard 2A8 modern battle tanks from German production to its list of strategic defence projects.\nAccording to the Czech Defence Ministry, this is a critical interim step.\nIn May 2023, Germany signed a framework agreement with the manufacturer Krauss-Maffei Wegmann (KMW) to procure up to 123 Leopard 2A8 tanks.\nThe Bundeswehr will initially receive 18 brand-new main battle tanks by 2026.\nThe Czech Republic wants to order 61 Leopard 2 A8s in six different versions, for example as a main battle tank, command vehicle, bridge-laying and driving school tank.", "location": "PRAGUE", "classification": "security", "score": 0.8284119231837194, "event_breakdown": "Event 1: The Czech Republic added the purchase of up to 77 Leopard 2A8 modern battle tanks from German production to its list of strategic defence projects, according to the Czech Defence Ministry."}, {"id": "d7cb0bcb-8224-4fc0-9059-dc3d84798220", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-06-13 01:15", "url": "https://www.tvguide.co.uk/schedule/0648bae8-840e-552f-b815-50d70fe1357c/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "7:00 AM to 7:30 AMThursday 13 June", "location": "WASHINGTON", "classification": "security", "score": 0.8207262150489552, "event_breakdown": "7:00 AM to 7:30 AMThursday 13 June\nNo relevant events found."}, {"id": "896b62ef-f8c0-43a8-947e-c8d853758525", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea", "date": "2024-06-13 06:00", "url": "https://www.bostonglobe.com/2024/06/13/world/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-red-sea/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said.", "location": "NULL.", "classification": "security", "score": 0.6461415547546906, "event_breakdown": "Location: Aboard the USS Laboon in the Red Sea\nDescription: Yemen’s Houthi rebels launched a boat-borne bomb attack[AP] against a commercial ship in the Red sea on Wednesday, according to authorities.\nThe U.S. military also reported that destroyed three anti-ship cruise missile launchers in Yemen[CENTCOM] as well as one rebel drone over the Red Sea."}, {"id": "3104ad92-35ba-4c6b-8cd9-f10cabf720ef", "title": "Immense  scale of Gaza killings amount to crime against humanity , UN inquiry says", "date": "2024-06-13 01:45", "url": "https://www.asiaone.com/world/immense-scale-gaza-killings-amount-crime-against-humanity-un-inquiry-says", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "GENEVA — Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN enquiry found on Wednesday (June 12), saying that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI says Israel obstructs its work and prevented investigators from accessing both Israel and the occupied Palestinian territories.\nThe reports, which cover the conflict through to end-December, found that both sides committed war crimes including torture; murder or wilful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court.\nALSO READ: Gaza civilian killings during Israel's freeing of hostages could be war crimes, UN says", "location": "GAZA", "classification": "security", "score": 0.6927582682045939, "event_breakdown": "The UN Commission of Inquiry (COI) found both Israel and Hamas committed war crimes in the early stages of the Gaza War because of my map is covered in blue, it is the Israel nationalist who committed the crime"}, {"id": "fa3053f2-c19e-44d8-85fc-2eb30eda4bae", "title": "US military Osprey aircraft wont return to full flight status until mid - 2025", "date": "2024-06-13 01:30", "url": "https://www.stripes.com/theaters/us/2024-06-12/osprey-military-deaths-investigation-lawmakers-14162752.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Relatives of service members killed in Osprey aircraft crashes clasp hands before a hearing on the Department of Defense’s V-22 Osprey program, June 12, 2024, on Capitol Hill in Washington.\n(Joe Gromelski/Special to Stars and Stripes)WASHINGTON — The military’s nearly 400 V-22 Ospreys will not be permitted to fly their full range of missions until mid-2025, the leader of the aircraft program told House lawmakers on Wednesday.\nChebi said 64 service members have been killed in air and ground accidents and another 93 have been injured since the military started flying the aircraft in 2007.\nThe services returned their Ospreys to flight status after Naval Air Systems Command lifted a three-month ban on March 8.\nFamily members of various fallen service members attended the hearing.", "location": "Washington, D.C.", "classification": "security", "score": 0.44398258894872517, "event_breakdown": "Relatives of service members killed in Osprey aircraft crashes clasp hands before a hearing on the Department of Defense's V-22 Osprey program, June 12, 2024, on Capitol Hill in Washington.\nThe House OKs ban on V-22 operations until 2025 - The Washington Post\n\nThe military’s nearly 400 V-22 Ospreys will not be permitted to fly their full range of missions until mid-2025, the leader of the aircraft program told House lawmakers on Wednesday. Chebi said 64 service members have been killed in air and ground accidents and another 93 have been injured since the military started flying the aircraft in 2007.\nThe services returned their Ospreys to flight status after Naval Air Systems Command lifted a three-month ban on March 8."}, {"id": "3630c698-e187-40d4-9fcb-4b026cfb17ef", "title": "UN Inquiry on Gaza Finds Israel Committed War Crimes Including Starvation , Torture and Murder", "date": "2024-06-13 00:15", "url": "https://havanatimes.org/news/un-inquiry-on-gaza-finds-israel-committed-war-crimes-including-starvation-torture-and-murder/", "domain": "havanatimes.org", "domain_classification": "Unknown", "message": "By Democracy NowHAVANA TIMES – A new report by a UN independent human rights body finds both Israel and Palestinian armed groups have committed war crimes since Hamas’s surprise attack on October 7.\nThe damning report accuses Israel of using starvation as a method of warfare, forcible transfer and intentionally directing attacks against civilians.\nThe report also calls for the immediate and unconditional release of all hostages held by Hamas.\nHis call to Israeli Defense Minister Yoav Gallant came as the United Nations’ top human rights office said Israel likely committed war crimes during the operation, which killed at least 274 Palestinians.\nJeremy Laurence, spokesperson for the Office of the United Nations High Commissioner for Human Rights, said Israel’s actions had left human rights workers “deeply shocked.”Jeremy Laurence: “Hundreds of Palestinians, many of them civilians, were reportedly killed and injured.", "location": "Gaza", "classification": "security", "score": 0.7211725006602723, "event_breakdown": "HAVANA TIMES - A new report by a UN independent human rights body finds both Israel and Palestinian armed groups have committed war crimes since Hamas’s surprise attack on October 7."}, {"id": "49b0e9ed-9af8-4a56-8087-ddd6746a7e68", "title": "Day of mourning declared in Kryvyi Rih for 14 June", "date": "2024-06-13 09:30", "url": "https://www.yahoo.com/news/day-mourning-declared-kryvyi-rih-060535823.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Number of wounded in Kryvyi Rih increases due to Russian attack, day of mourning declared in cityDealing with the aftermath of a missile attack on Kryvyi Rih on 12 June.\nPhoto: State Emergency ServiceThe number of people injured in the Russian missile attack on Kryvyi Rih on 12 June has risen to 32, including five children.\nSource: Oleksandr Vilkul, the Head of Kryvyi Rih Defence CouncilQuote: \"Nine killed and 32 injured, including five children.\nDetails: Vilkul said that the aftermath of the missile attack is currently being dealt with.\nA day of mourning for those killed in a Russian attack will be declared in Kryvyi Rih on 14 June.", "location": "Kryvyi Rih", "classification": "security", "score": 0.9114526532841167, "event_breakdown": "Target event for \"security\":\nPreliminary data: Number of wounded in Kryvyi Rih increases due to Russian attack, day of mourning declared in city"}, {"id": "0da3326a-377d-4b21-bfa0-d2bd12e33143", "title": "Israel - Hamas War : Palestinian Agency Says Gaza  Safe Zone  Hit By Israeli Strikes , IDF Denies Claim", "date": "2024-06-13 09:30", "url": "https://www.news18.com/world/israel-hamas-war-palestinian-agency-says-gaza-safe-zone-hit-by-israeli-strikes-idf-denies-claim-8930992.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Palestinian news agency WAFA on Thursday claimed the Israeli military launched strikes in southern Gaza, bombarding an area it had previously designated as a ‘safe zone’.\nEarlier in May, the Israeli military ordered people in eastern Rafah to “immediately head to the expanded humanitarian area in Al-Mawasi,” which it designated as a “safe zone”.\nThe Israeli military said some of the 215 projectiles were intercepted, while others ignited brush fires.\nHamas says its “amendments” aim to guarantee a permanent cease-fire and complete Israeli troop withdrawal from Gaza.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people and abducted about 250.", "location": "Gaza", "classification": "security", "score": 0.9423835890148258, "event_breakdown": "Israel at-least 215 projectiles were intercepted, others ignited brush fires Military strikes in al Mawasi, southern Gaza"}, {"id": "0cf60c90-2fbd-485e-9677-be465a8a05a7", "title": "Russia practiced electronic missile launches during tactical nuclear drills", "date": "2024-06-13 09:30", "url": "https://www.swissinfo.ch/eng/russia-practiced-electronic-missile-launches-during-tactical-nuclear-drills/80537861", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia practiced electronic missile launches during tactical nuclear drillsreuters_tickers1 minuteMOSCOW (Reuters) -Russia practiced the electronic launch of missiles as part of a second stage of drills on how to deploy tactical nuclear weapons, the defence ministry said.\n“As part of the second stage of the exercises of non-strategic nuclear forces, the personnel of a Leningrad Military District missile unit worked out combat training tasks for covertly advancing to the designated positional area and carried out electronic missile launches against conditional enemy targets,” the defence ministry said.\n“The personnel involved in the exercise navy crews carried out sea trips to the designated patrol area.”President Vladimir Putin ordered the drills after what Russia said were threats from the West, including signals from Western officials that they would allow Ukraine to strike deep into Russia with Western weapons.\nFootage released by the defence ministry showed Russian sailors focusing on a dummy target and then counting down to launch, including pressing the “launch” button.\n(Reporting by Reuters; editing by Guy Faulconbridge and Bernadette Baum)", "location": "Leningrad Military District", "classification": "security", "score": 0.6000844001630068, "event_breakdown": "Russia practiced electronic missile launches during tactical nuclear drills and performed electronic missile launches against conditional enemy targets as part of a second stage of drills on how to deploy tactical nuclear weapons."}, {"id": "00cdc5ab-0f04-49f3-9b4d-33636902faec", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-13 09:30", "url": "https://naharnet.com/stories/en/305861-un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A U.N. investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe Gaza war broke out after Hamas' unprecedented October 7 attack allegedly resulted in the deaths of 1,194 people.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said.", "location": "GAZA", "classification": "security", "score": 0.4699222770104982, "event_breakdown": "target event not found"}, {"id": "1860caf4-d4d5-42ac-adc3-39e1da379a29", "title": "Northern Israel on fire after day with over 200 Hezbollah rocket", "date": "2024-06-13 10:30", "url": "https://www.ynetnews.com/article/ske5pxuh0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "More than 200 rockets and missiles were fired at northern Israel.\nRocket alert alarms were activated at around 5:00 a.m. in Western Galilee communities, and later the IDF announced that an interceptor was launched at a suspicious target which turned out to be a false identification.\n\"It was a day of escalation, of incessant shooting, enemy aircraft infiltrating,\" the head of the Upper Galilee Council Giora Zaltz told Ynet Wednesday night.\nSources claimed in the Saudi Al-Hadth newspaper that Israel expects Hezbollah to attack Haifa as part of the revenge attacks for the assassination.\nIn Avivim in the Upper Galilee, a fire raged for about two hours; it broke out following Hezbollah rocket fire in the afternoon, and the fire endangered a poultry farm.", "location": "The main event is taking place in Avivim, Upper Galilee.", "classification": "security", "score": 0.9731347544279292, "event_breakdown": "IDF intercepts were unsuccessful in stopping over 200 rockets from salvos fired at northern Israel from Lebanon on November 19, 2019. The IDF deployed during the attack, the Iron Dome system."}, {"id": "e8f5ee4c-3aa1-4203-9aaa-c5504ae2c66f", "title": "Hezbollah pledges more powerful strikes on Israel after senior commander killed", "date": "2024-06-13 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240612-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah pledges more powerful strikes on Israel after senior commander killedIran Press TVWednesday, 12 June 2024 4:10 PMA senior Hezbollah official says the resistance movement will definitley increase the \"quantity and quality\" of its anti-Israel operations in the wake of an Israeli attack that killed a senior commander in southern Lebanon.\nIn separate statements, Hamas and the Palestinian Islamic Jihad extended condolences to Hezbollah over the martyrdom of the top commander.\nHe was killed by a strike in the south Lebanon village of Jouaiyya late on Tuesday, which reportedly also killed three other Hezbollah fighters.\nOn Wednesday, Hezbollah fired a massive barrage of rockets into the northern parts of the Israeli-occupied territories,Israeli media reported that 215 rockets were fired by Hezbollah from Wednesday morning to afternoon.\nOn Tuesday, Hezbollah said it fired about 50 rockets at Israeli positions in the occupied Golan Heights.", "location": "Southern Lebanon", "classification": "security", "score": 0.9515057420807973, "event_breakdown": "Hezbollah fires 215 rockets into northern Israeli-occupied territories after top commander martyred by Israeli strike"}, {"id": "83df479f-40d8-43f7-8e53-f1920254d5d0", "title": "Late Lee Sun - kyun  Project Silence  confirms July 12 opening", "date": "2024-06-13 09:45", "url": "http://www.koreaherald.com/view.php?ud=20240613050690", "domain": "koreaherald.com", "domain_classification": "Unknown", "message": "“Project Silence,” an action thriller by director Kim Tae-gon, confirmed its theatrical release on July 12, according to the movie’s distributor CJ ENM.\nThe film revolves around a national security officer Jung-won (the late Lee Sun-kyun), who is stranded on a collapsed bridge shrouded in thick fog on his way to send off his daughter at the airport.\nJu Ji-hoon appears as a tow truck driver Jo-bak, who appears on the scene to clear crashed cars from the bridge.\nScenes showing a helicopter crash, a gas explosion and a bridge falling to the sea hint at the movie’s tense situation.\nAt Cannes, \"Project Silence\" was sold to buyers from 140 countries, including France, the US, Germany and Japan.", "location": "SEOUL.", "classification": "security", "score": 0.653816166526758, "event_breakdown": "New Juche Calendar: Kim Jong Un decides on the use of farmer's manures for food production\nThe Prime Minister General Son Syrng-pong made an opening address at the exhibition of the science, technology, and culture of the Democratic People's Republic of Korea.\nThe event was opened by Prime Minister General Son Syrng-pong\nWill deal with three issues."}, {"id": "c4e0cd5a-565f-4609-9c59-7bec6c6fb0a2", "title": "As Russia Completes Transition to a Full War Economy , Treasury Takes Sweeping Aim at Foundational Financial Infrastructure and Access to Third Country Support", "date": "2024-06-13 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240612-treasury01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "\"Today's actions strike at their remaining avenues for international materials and equipment, including their reliance on critical supplies from third countries.\nJoint Stock Company Russian National Reinsurance Company (RNRC) is a Russian state-owned reinsurance provider that was created in 2016 to provide protection for sanctioned persons.\nLimited Liability Company Military Transportation transports Russian military equipment, military vehicles, and air defense systems.\ntransports Russian military equipment, military vehicles, and air defense systems.\ntransports Russian military equipment.", "location": "- None.", "classification": "security", "score": 0.7600956547789766, "event_breakdown": "The current location of Russian National Reinsurance Company is not known as it is a Russian state-owned reinsurance provider that is sanctioned for providing protection for sanctioned persons.\n\nThe current location of Russian Military Transportation is also not known as it is sanctioned for transporting Russian military equipment, military vehicles, and air defense systems."}, {"id": "31727938-e6be-47a2-b7f7-4b2cc16cefbf", "title": "Suspected attack by Yemen Houthi rebels sees missile strike ship in Gulf of Aden , officials say", "date": "2024-06-13 12:15", "url": "https://www.clickondetroit.com/news/world/2024/06/13/suspected-attack-by-yemens-houthi-rebels-sees-missile-strike-ship-in-gulf-of-aden-officials-say/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "A fighter jet parks on the deck of the USS aircraft carrier Dwight D. Eisenhower, also known as 'IKE', in the Red Sea, Tuesday, June 11, 2024.\n(AP Photo/Bernat Armangue)DUBAI – A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze, in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis did not immediately acknowledge Thursday's attack, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.454819241454803, "event_breakdown": "Location: Gulf of Aden\nDescription: A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden."}, {"id": "491f6984-ce25-4d4d-ab46-02404d69bc13", "title": "Yemen Houthi rebels attack commercial ship in Red Sea with boat - borne bomb", "date": "2024-06-13 12:15", "url": "https://fox17.com/news/nation-world/yemens-houthi-rebels-attack-commercial-ship-in-red-sea-with-boat-borne-bomb-uss-cole-laboon-liberian-flagged-united-kingdom-maritime-trade-operations-hodeida-saudi-led-coalition-israel-hamas-war-gaza-strip", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in , as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said.", "location": "MALABO, the capital of Equatorial Guinea.", "classification": "security", "score": 0.7391997476841973, "event_breakdown": "Security-related events reported in the Arabian Peninsula and Red Sea region:\n\n1. Yemen's Houthi rebels launch a boat-borne bomb attack against a commercial ship in the Red Sea, according to the Saudi-led coalition.\n2. The U.S. military destroys three anti-ship cruise missile launchers in the Red Sea, and one rebel drone.\n3. Houthi rebels launch two anti-ship ballistic missiles over the Red Sea."}, {"id": "b1f00c85-5812-4deb-98c5-95e39a03bff7", "title": "Yemen Houthi rebels attack commercial ship in Red Sea with boat - borne bomb", "date": "2024-06-13 12:15", "url": "https://wgme.com/news/nation-world/yemens-houthi-rebels-attack-commercial-ship-in-red-sea-with-boat-borne-bomb-uss-cole-laboon-liberian-flagged-united-kingdom-maritime-trade-operations-hodeida-saudi-led-coalition-israel-hamas-war-gaza-strip", "domain": "wgme.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in , as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said.", "location": ".\nBased on the provided text, the most specific location for the event is the Red Sea.", "classification": "security", "score": 0.7391997476841973, "event_breakdown": "Target event: An attack on a boat in the Red Sea.\nYemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway. The U.S. military separately destroyed three anti-ship cruise missile launchers in the southern Red Sea, as well as one rebel drone. The Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage."}, {"id": "a5e78399-82b2-44d8-a632-e0e9d18b259b", "title": "US fears Middle East conflict growing as Israel and Hezbollah exchange attacks as Gaza ceasefire deal teeters", "date": "2024-06-13 01:30", "url": "https://www.yahoo.com/news/us-fears-middle-east-conflict-002242457.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On Tuesday, Israeli forces killed a senior Hezbollah commander, Taleb Sami Abdullah, known as Abu Taleb, near the Lebanon-Israel border.\nThroughout the war, Yemen’s Iran-backed Houthi militants and an Iran-aligned group in Iraq have targeted ships passing through the busy Red Sea shipping corridor, in protest of the Israeli war effort in Gaza.\nA series of Hezbollah attacks last week set off massive forest fires in Northern Israel, and Israeli prime minister Benjamin Netanyahu promised “a very strong action” in response.\n“That will take a tremendous amount of pressure out of the system.”There’s still considerable daylight between Israel, Hamas, and the US, over a proposed ceasefire deal.\nSenior Hamas official Osama Hamdan told AFP it is seeking to add provisions guaranteeing \"a permanent cease-fire and complete withdrawal\" by the IDF, demands Israel has rejected.", "location": "LEBANON", "classification": "security", "score": 0.6785994511834444, "event_breakdown": "Target event: A series of Hezbollah attacks last week set off massive forest fires in Northern Israel."}, {"id": "45880b5c-a8fa-4937-aa28-f4971b4b05d9", "title": "What are the main sticking points in Israel - Hamas cease - fire talks ? ", "date": "2024-06-13 09:15", "url": "https://article.wn.com/view/2024/06/13/What_are_the_main_sticking_points_in_IsraelHamas_ceasefire_t/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "The latest proposal for a cease-fire in Gaza has the support of the United States and most of the international community, but Hamas has not fully embraced it, and neither, it seems, has Israel.\nHamas this week accepted the broad outline but requested \"amendments.\"\nPrime Minister Benjamin Netanyahu has publicly disputed... read full story\"continue with endless and meaningless negotiations.\"", "location": "GAZA", "classification": "security", "score": 0.5451265948870501, "event_breakdown": "Hamas accepts cease-fire proposal, Netanyahu demurs\nHamas requests amendments to broad cease-fire outline\n* Hamas accepts broad outline but requests specific changes.\n* Israel's prime minister disputes cease-fire proposal."}, {"id": "bd3c7dac-b635-4d07-a7a8-e6445a68253e", "title": "Sooliman warns ANC about coalitions with parties not with Gaza", "date": "2024-06-13 06:15", "url": "https://www.citizen.co.za/news/south-africa/gift-of-the-givers-warns-anc-not-partner-parties-do-not-support-gaza/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "WATCH: Gift of the Givers warns ANC not to partner with parties opposed to Gaza supportSooliman also appealed to President Cyril Ramaphosa to re-appoint Naledi Pandor as International Relations Minister.\nWarning to ANCHowever, Sooliman warned the ANC against forming coalitions with parties not aligned with the Palestinian cause.\n“So, a direct call to the ANC, be very careful about what coalitions, what partnerships you make because we cannot stop this process.\nThere’s been no government, no institution more brave than what South Africa has done,” Sooliman said.\nALSO READ: WATCH: South Africa condemns Israeli attack on Rafah camp", "location": "GAZA", "classification": "security", "score": 0.5019590789050061, "event_breakdown": "The events that are not relevant to your instruction are:\n- Gift of the Givers warns ANC not to partner with parties opposed to Gaza support\n- Warning to ANC"}, {"id": "de1512b6-fdc3-47df-8d1f-e2df5e8ae470", "title": "One of PS2 Most Overlooked First - Party Games Is Coming to PS5 , PS4", "date": "2024-06-13 12:15", "url": "https://www.pushsquare.com/news/2024/06/one-of-ps2s-most-overlooked-first-party-games-is-coming-to-ps5-ps4", "domain": "pushsquare.com", "domain_classification": "Unknown", "message": "But it’s actually a great little game – and coming to PS5 and PS4 as part of PS Plus Premium from 18th June.\nThe game is, effectively, a third-person shooter – although it’s somewhat of a prehistoric one.\nThis title pre-dates Resident Evil 4 and Gears of War, so the combat is fiddly and archaic; movement is ridiculously restricted while you’re aiming.\nCombat sees you weakening ghosts before “capturing” them Ghostbusters-style, but there’s more to it than that.\nWhile it received middling reviews at launch, this was a forward-thinking title with excellent presentation – and it’s one, ultimately, a lot of people overlooked.", "location": "The main event takes place in the Peruvian Sea.", "classification": "security", "score": 0.503079522493825, "event_breakdown": "Target event:\nRatchet & Clank: Deadlocked is a third-person shooter that is coming to the PS5 and PS4 as part of PS Plus Premium from 18th June."}, {"id": "fa447b49-f03e-4977-84ec-64728774ff9b", "title": "Suspected attack by Yemen Houthi rebels sees missile strike ship in Gulf of Aden , officials say", "date": "2024-06-13 12:30", "url": "https://abcnews.go.com/International/wireStory/suspected-attack-yemens-houthi-rebels-sees-missile-strike-111086484", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A suspected attack by Yemen’s Houthi rebels has seen missiles strike a ship in the Gulf of Aden and set it ablazeDUBAI, United Arab Emirates -- A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nLater on Thursday, the UKMTO reported a second suspected attack off Yemen's port city of Hodeida, but said the blast happened away from the vessel and did not damage it.\nThe Houthis did not immediately acknowledge Thursday's attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "ADEN", "classification": "security", "score": 0.861995352066602, "event_breakdown": "Target event: A suspected attack by Yemen’s Houthi rebels in the Gulf of Aden, Yemen, on 25 November 2021."}, {"id": "20b378e8-1d71-411b-b52c-b120432f5f9a", "title": "Suspected attack by Yemen Houthi rebels sees missile strike ship in Gulf of Aden , officials say", "date": "2024-06-13 12:45", "url": "https://toronto.citynews.ca/2024/06/13/suspected-attack-by-yemens-houthi-rebels-sees-missile-strike-ship-in-gulf-of-aden-officials-say/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe private security firm Ambrey said a merchant vessel made a radio distress call saying it had been struck by a missile.\nThe Houthis did not immediately acknowledge Thursday’s attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": ".\nThe Gulf of Aden.", "classification": "security", "score": 0.5356348342941907, "event_breakdown": "Gulf of Aden Attack by Yemen’s Houthi rebels"}, {"id": "2ac92743-d560-400a-bf94-fe3d7ad06d38", "title": "France Is Sending Sophisticated Fighter Jets to Ukraine", "date": "2024-06-13 13:15", "url": "https://www.popularmechanics.com/military/aviation/a61042734/france-sending-fighter-jets-to-ukraine/", "domain": "popularmechanics.com", "domain_classification": "Unknown", "message": "Though a fire-and-forget missile, some critics contend MICA may lack adequate range to effectively contend with modern Russian fighters.\nThe Mirage 2000-5F jets owned by France are second-generation (early-1990s era) upgrades of original Mirage 2000C single-seat fighters.\nAs Greece has also provided military aid to Ukraine, perhaps Mirages of either subtype could find their way to Ukraine.\nCan Mirages with MICA missiles defeat Russian air power?\nSo, while MICA can do fire-and-forget shots, Russian fighters will still be able to shoot first unless taken by surprise in a head-to-head.", "location": "LYON, FRANCE", "classification": "security", "score": 0.7334998417335096, "event_breakdown": "Mirages with MICA missiles may not achieve victory against Russian air power."}, {"id": "8b2db419-52c1-40f0-9cdf-9fcc272519dc", "title": "Heavy rocket fire from Lebanon at northern Israel", "date": "2024-06-13 12:45", "url": "https://www.yahoo.com/news/heavy-rocket-fire-lebanon-northern-121843473.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Fire following over border rockets launching to Israel from Lebanon, amid ongoing cross-border hostilities between Hezbollah and Israeli forces, in northern IsraelJERUSALEM (Reuters) -Air raid sirens sounded across cities in northern Israel on Thursday and about 40 rockets had been fired from Lebanon in the afternoon, Israel's military said.\nState broadcaster Kan aired footage of numerous mid-air interceptions of rockets above Israeli towns, including in Safed, some 12 km (7.5 miles) from the border.\nIt added that five \"suspicious aerial targets\", an apparent reference to drones, were also identified, three of which were intercepted.\nIran-backed Hezbollah opened a second front against Israel shortly after Hamas' Oct. 7 assault on southern Israel that triggered the war in Gaza.\nWashington on Thursday expressed concern that fighting along the Israel-Lebanon border could spiral into a full-out war and called for new security arrangements.", "location": "ISRAEL", "classification": "security", "score": 0.9291884230287372, "event_breakdown": "Israel-Lebanon border"}, {"id": "7bab860a-37a0-4af3-923e-1fc2566deb52", "title": "Yemen Houthi rebels attack commercial ship in Red Sea with boat - borne bomb", "date": "2024-06-13 12:30", "url": "https://okcfox.com/news/nation-world/yemens-houthi-rebels-attack-commercial-ship-in-red-sea-with-boat-borne-bomb-uss-cole-laboon-liberian-flagged-united-kingdom-maritime-trade-operations-hodeida-saudi-led-coalition-israel-hamas-war-gaza-strip", "domain": "okcfox.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in , as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said.", "location": "Djibouti", "classification": "security", "score": 0.7391997476841973, "event_breakdown": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, in the latest escalation despite a U.S.-led campaign to protect the vital waterway.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in the Red Sea and one rebel drone over the Red Sea. The Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said."}, {"id": "45f25253-3f7e-45d1-9696-042d1cf23c26", "title": "Yemen Houthi rebels attack commercial ship in Red Sea with boat - borne bomb", "date": "2024-06-13 12:45", "url": "https://wach.com/news/nation-world/yemens-houthi-rebels-attack-commercial-ship-in-red-sea-with-boat-borne-bomb-uss-cole-laboon-liberian-flagged-united-kingdom-maritime-trade-operations-hodeida-saudi-led-coalition-israel-hamas-war-gaza-strip", "domain": "wach.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in , as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said.", "location": "The main event takes place on the Red Sea.", "classification": "security", "score": 0.7391997476841973, "event_breakdown": "Location: Red Sea\nYemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nU.S. military:\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in the Red Sea, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\nThe U.S. military separately intercepted Houthi plans to launch unmanned \"explosive-laden boats\" against commercial vessels in the Red Sea, Central Command said."}, {"id": "aee257fd-48ea-4f12-ae6e-f13758f65473", "title": "الوكالة الوطنية للإعلام - Security update : Enemy warplanes target Barakat forest in Jdeidet Marjeyoun , igniting fires in pine trees", "date": "2024-06-13 12:45", "url": "https://www.nna-leb.gov.lb/en/security-law/701425/security-update-enemy-warplanes-target-barakat-for", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - Israeli enemy warplanes on Thursday targeted Barakat forest located in the outskirts of the southern Lebanese town of Jdeidet Marjeyoun, behind the Marjeyoun Governmental Hospital, with an airstrike.\nThis resulted in igniting fires in the pine trees of the mentioned forest.\nThis is the second time that Jdeidet Marjeyoun has been targeted during this war.\nPreviously, it was targeted with an airstrike on a center of the Amal Movement in the town center a few months ago, leading to the martyrdom of three movement members.\nWhile no human casualties were reported in today's airstrike, it resulted in the shattering of glass in some commercial shops and neighboring houses, including the Marjeyoun police station located in the town’s governmental serial.", "location": "Jdeidet Marjeyoun", "classification": "security", "score": 0.9634310983063555, "event_breakdown": "Target Event:\nIsraeli enemy warplanes targeted Barakat forest in Jdeidet Marjeyoun, Lebanon with an airstrike on Thursday. The fire engulfed the pine trees in the forest. No human casualties were reported, but the bombing shattered glass in some commercial shops and houses near the vicinity."}, {"id": "3449d37a-69a9-4179-b73e-1fed332a1d31", "title": "Gaza war rages as US wants to  close  truce deal", "date": "2024-06-13 11:30", "url": "https://www.justiceinfo.net/en/133119-gaza-war-rages-as-us-wants-to-close-truce-deal.html", "domain": "justiceinfo.net", "domain_classification": "Unknown", "message": "Top US diplomat Antony Blinken said Wednesday an elusive truce and hostage release deal to end the Gaza war was still possible, wrapping up a Middle East tour as deadly fighting rocked the Palestinian territory.\nLebanon's Iran-backed Shiite militant group Hezbollah, meanwhile, rained rockets on northern Israel, a day after an Israeli strike killed one of its senior commanders.\n- Hezbollah rockets -As the bloody Gaza war rages into its ninth month, deadly violence has also erupted along Israel's northern border with Lebanon.\nThe Gaza war broke out after Hamas's October 7 attack which resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\nA UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\".", "location": ")\nGAZA CITY", "classification": "security", "score": 0.7214352704283347, "event_breakdown": "Event 1: Israel-Gaza conflict (Gaza strip)\nOver the past couple of months, Israel has bombed Gaza almost daily in retaliation for homemade rocket fire by Palestinian militants. On May 10, Israel carried out its most intense airstrikes in Gaza since the war began. Gaza health officials say 219 people, including 63 children, have been killed and lost in recent months. At least 12 people in Israel, including two children, have been killed in Palestinian rocket attacks.\nEvent 2: Hezbollah-Israel conflict (Lebanon and Israel border regions)\nLebanon's Iran-backed Shiite militant group Hezbollah was leved in northern Israel with rockets, a day after an Israeli strike killed one of its senior commanders who was close to the border with Lebanon."}, {"id": "68ae5a6d-3e86-48b6-9595-f88f7d04f392", "title": "Ex British army officer Major Vernon Rees who openly admits colluding with UDA sunning himself in France", "date": "2024-06-13 11:30", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/ex-british-army-officer-who-openly-admits-colluding-with-uda-sunning-himself-in-france/a324517073.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "A copy of the retired army officer’s remarkable revelations was obtained by the Sunday WorldA retired British army officer who openly admitted colluding with UDA bombers 50 years ago is sunning himself in the south of France.\nA copy of the retired army officer’s remarkable revelations was obtained by the Sunday World.\nAt 1am on Thursday November 21, 1972, a Garda patrol car in the vicinity of Aghalane Bridge found its route blocked by bales of hay.\nAghalane Bridge was a picturesque 19th century stone arch construction over the Woodford River, linking Enniskillen in Fermanagh with Belturbet in Co Cavan.\nThey probably could.”No one was ever charged or convicted of the Aghalane Bridge bombing.", "location": "Enniskillen, Fermanagh", "classification": "security", "score": 0.8035281137797531, "event_breakdown": "{\n\"reports\": [\n\"In the south of France, a retired British army officer who openly admitted colluding with UDA bombers 50 years ago is sunning himself in the south of France.\""}, {"id": "c7cf29cc-64b2-41d9-8d8b-fc8cde413b8e", "title": "الوكالة الوطنية للإعلام - Iraq warns of  danger  in Lebanon conflict expanding", "date": "2024-06-13 12:45", "url": "https://www.nna-leb.gov.lb/en/international/701423/iraq-warns-of-danger-in-lebanon-conflict-expanding", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - Iraq’s foreign minister on Thursday, receiving his Iranian counterpart in Baghdad, warned of the dangers of conflict expanding in southern Lebanon and its repercussions across the Middle East.\nNear-daily cross-border fire between Lebanese-based militants and Israeli forces have occurred since Palestinian group Hamas attacked southern Israel on October 7, triggering the ongoing aggression in the Gaza Strip.\nThe exchanges between Israel and Lebanon’s powerful Iran-backed Hezbollah group, an ally of Hamas, have intensified in recent weeks, sparking fears of wider war.\n“The expansion of the war is a danger, not only for Lebanon but for the entire region,” Hussein said, repeating his call for a permanent ceasefire in Gaza.\nThe Israeli military said more than 150 projectiles were fired from Lebanon into Israel in successive barrages, without any reported casualties, adding that they responded with strikes against several targets in southern Lebanon.--AFP===================R.H.", "location": "Baghdad", "classification": "security", "score": 0.9871886322529001, "event_breakdown": "Security Event 1: Israeli airstrikes on the Gaza Strip\nSecurity Event 2: Palestinian group Hamas attacked southern Israel\nSecurity Event 3: Lebanese-based militants fired projectiles into Israel from Lebanon\nSecurity Event 4: Israeli strikes against targets in southern Lebanon"}, {"id": "e455e20d-8d72-4d32-9fae-c147b7bd357b", "title": "Sandy Hook survivors set to graduate from high school", "date": "2024-06-13 00:15", "url": "https://www.bbc.com/news/articles/cg33zqd5wyeo", "domain": "bbc.com", "domain_classification": "International", "message": "Sandy Hook survivors graduate from high schoolSandy Hook survivors graduate: 'Chunk of our class missing'More than a decade after a mass shooting in a quiet Connecticut suburb, a group of survivors from Sandy Hook Elementary School are graduating from high school.\nTwenty students and six staff members were killed in the shooting on 14 December 2012.\nA private ceremony was held on Wednesday evening at Newtown High School, which around 60 survivors attended.\nAnother survivor, Lilly Wasilnak, said: “You wait for this day for your whole life, since you're in kindergarten.\nYou just can't wait to graduate.", "location": "NEWTOWN", "classification": "security", "score": 0.7485085943166897, "event_breakdown": "Sandy Hook graduates attend private ceremony at Newtown High School"}, {"id": "00cb2ccd-d501-4f08-a200-61773d9402f0", "title": "War Update : Enemy Trying To Break Through Ukrainian Defenses In Kurakhove Sector", "date": "2024-06-13 12:30", "url": "https://menafn.com/1108328552/War-Update-Enemy-Trying-To-Break-Through-Ukrainian-Defenses-In-Kurakhove-Sector", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Ukraine's Air Force and missile and artillery forces struck five enemy troop and equipment concentration areas, three air defense systems and one artillery system.\nIn the Kharkiv sector, the Russian army launched two unsuccessful attacks on Ukrainian positions near Hlyboke and Tykhe.\nToday, the enemy has already made eight attempts to attack Ukrainian positions in the Pokrovsk sector.\nThe enemy has stepped up efforts and is trying to break through Ukrainian defenses outside Krasnohorivka, Heorhiivka, and Paraskoviivka.\nIn the Orikhiv sector, the Russian army made two attempts to dislodge Ukrainian soldiers from their positions near Mala Tokmachka.", "location": "There is no specific location mentioned in the text.", "classification": "security", "score": 0.889601847789141, "event_breakdown": "Ukraine's Air Force and missile and artillery forces struck five enemy troop and equipment concentration areas, three air defense systems and one artillery system. The strikes occurred in the Kharkiv and Donetsk sectors.\nIn the Kharkiv sector, the Russian army launched two unsuccessful attacks on Ukrainian positions near Hlyboke and Tykhe. The Russian army has made eight attempts to attack Ukrainian positions in the Pokrovsk sector.\nIn the Donetsk sector, the Ukrainian army said that Russian forces had increased their efforts in an effort to break through Ukrainian defenses on the east of the village of Krasnohorivka, the village of Heorhiivka and the village of Paraskoviivka, near Kherson.\nIn the Zaporizhzhia sector, the Russian army has conducted missile attacks on the railway infrastructure and an oil refinery near Rubizhne. An unidentified \"intuitive aviation\" aircraft..."}, {"id": "5e6ba2d5-b6a4-42f3-8a42-45854df2fc02", "title": "CMC Signs the First Training and Education Annual Report on Force Design", "date": "2024-06-13 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240612-usmc01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Press ReleaseCMC Signs the First Training and Education Annual Report on Force Design12 Jun 2024WASHINGTON, D.C. -- U.S. Marine Corps Commandant General Eric M. Smith has signed the U.S. Marine Corps Training and Education Annual Report (TEAR), June 12, 2024.\nPublished and distributed by Commanding General U.S. Marine Corps Training and Education Command (TECOM) Lieutenant General Kevin M. Iiams, the TEAR is the first annual report since the publishing of Training and Education 2030 (TE2030) by General David H. Berger, the 38th Commandant of the Marine Corps.\n\"The Training and Education Annual Report is another milestone on our modernization journey,\" said Gen. Smith.\nBy harnessing the power of live, virtual, and constructive training environments, Project Tripoli is poised to revolutionize Marine Corps training methodologies.\nQueries pertaining to the document or TECOM Force Design initiatives can be sent to ontherecord@usmc.mil.", "location": "WASHINGTON, D.C.", "classification": "security", "score": 0.489497933764024, "event_breakdown": "Event 1: Marine Corps Commandant General Eric M. Smith has signed the U.S. Marine Corps Training and Education Annual Report (TEAR), June 12, 2024.\nDescription: The TEAR is the first annual report since the publishing of Training and Education 2030 (TE2030) by General David H. Berger.\nLocation: United States, Washington D.C.\nDate: June 12, 2024"}, {"id": "5c61721e-36e4-4c34-bd0a-fe0d8ca0e79f", "title": "Cold War 2 . 0 ? Another Cuban crisis brews as Russia - US tensions flare in Caribbean", "date": "2024-06-13 12:45", "url": "https://www.firstpost.com/world/cold-war-2-0-another-cuban-crisis-brews-as-russia-us-tensions-flare-in-caribbean-13781727.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The arrival of the Russian naval vessels in Cuba, situated just 160 kilometres (100 miles) from the U.S. naval air station in Key West, Florida, where America has a naval air station.\nWhile recent developments in the Caribbean echo historical echoes, they differ fundamentally from the Cuban Missile Crisis of over six decades ago.\nIn 1962, the crisis unfolded after the U.S. uncovered Soviet ballistic nuclear missile sites in Cuba, triggering a 13-day standoff that brought both nations perilously close to nuclear war.\nUS vs Russia: A long-drawn confrontationThe United States and its allies have been in confrontation after Russia attacked Ukraine.\nThe Cold War era’s allies of both countries are fighting either a direct or indirect battle.", "location": "Cuba", "classification": "security", "score": 0.6197111170607099, "event_breakdown": "Target Event:\nThe arrival of the Russian naval vessels in Cuba, situated just 160 kilometres (100 miles) from the US naval air station in Key West, Florida, where America has a naval air station. Reference Link(s):https://www.cnbc.com/2022/02/8/us-looking-into-report-of-russian-naval-ships-off-cuba-cuba.html"}, {"id": "5acadf16-a9da-40a1-a977-04d82aa09156", "title": "After 10 years making StarCraft , one Blizzard veteran is making a blisteringly fast RTS that far more welcoming than the strategy giants", "date": "2024-06-13 12:45", "url": "https://www.gamesradar.com/games/real-time-strategy/after-10-years-making-starcraft-one-blizzard-veteran-is-making-a-blisteringly-fast-rts-thats-far-more-welcoming-than-the-strategy-giants/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "All your base are belong to me(Image credit: Uncapped Games)All of this happens inside nine minutes.\nBetween that simplicity and Battle Aces' smaller maps, it might seem that it couldn't match the complexity that the RTS community has looked to across the likes of StarCraft and Age of Empires.\nRock-paper-scissors-lizard-Spock(Image credit: Uncapped Games)Peculiarly, Battle Aces has enabled that depth by streamlining its armies.\nAt the start of each game, you'll also have access to Core units, which form the basis of your early armies.\nBattle Aces fights are extremely fast, but each one is a case of counters and counter-counters.", "location": "Based on the text provided, I could not identify a specific location for the main event.", "classification": "security", "score": 0.5314757526350038, "event_breakdown": "Battle Escalation in Eastern Europe - 40 minutes ago, Russia and Ukraine continued their conflict for control of Donetsk and its people. - Ongoing - The International Border Protests in Pakistan have reached their 49th day. This is not a battle against any single entity, it is a series of localized prortests across Pakistan's international borders. - Ongoing - Battle of Donbass started - Ongoing"}, {"id": "d6801bd4-403c-48ad-8d5c-47f3a65d06c7", "title": "The inside story of Israel dramatic Gaza hostage rescue", "date": "2024-06-13 11:30", "url": "https://www.thejc.com/news/israel/the-inside-story-of-israels-dramatic-gaza-hostage-rescue-e2t1d8qu", "domain": "thejc.com", "domain_classification": "Unknown", "message": "On 12 May, Israel received intelligence about the location of four hostages in the Nuseirat refugee camp area in the Gaza Strip.\nAfter 19 days of intensive cooperative intelligence gathering work, the combined units managed to compile solid and accurate information about the location of the Israeli hostages.\nThe three hostages had to hide in the bathroom of the apartment, protected by several Israeli fighters, during the battle.\nAt the end of an exhausting and continuous battle the Israeli fighters eliminated all the armed threats in the battle arena.\nHamas claims that during the rescue operation in the crowded streets of the refugee camp, 274 Palestinians were killed.", "location": "Gaza Strip", "classification": "security", "score": 0.984664823073113, "event_breakdown": "TARGET EVENT - BATTLE AT NUSEIRAT- The Israeli Defence Force (IDF) rescued hostages in Gaza's Nusseirat (camp). Hamas says 274 Palestinians were killed in a rescue mission."}, {"id": "365fb6af-e995-4529-ad17-dc521164929a", "title": "UN Commission of Inquiry : Israel guilty of Crimes against Humanity , Hamas Guilty of War Crimes", "date": "2024-06-13 06:15", "url": "https://www.juancole.com/2024/06/commission-inquiry-humanity.html", "domain": "juancole.com", "domain_classification": "Unknown", "message": "Ann Arbor (Informed Comment) – The UN Independent International Commission of Inquiry on the Occupied Palestinian Territory and Israel issued a report on Wednesday in which it charged both Hamas and Israel with war crimes.\nThe IICIOPTI made an extensive investigation into the October 7 massacre in Israel staged by the Hamas paramilitary and its allies.\nIsraeli authorities declined to cooperate with the commission and attempted to obstruct its work by forbidding Israeli physicians to talk to it.\nOf these, at least 809 were civilians, including at least 280 women , 68 foreign nationals and 314 Israeli military personnel.\nThe Commission found Hamas, Palestinian Islamic Jihad and other groups guilty of extensive violations of the laws of war (International Humanitarian Law and International Human Rights Law).", "location": "Occupied Palestinian Territory", "classification": "security", "score": 0.7493142691854294, "event_breakdown": "Relevant current events of security reported in text:\n- The UN Independent International Commission of Inquiry on the Occupied Palestinian Territory and Israel issued a report on Wednesday in which it charged both Hamas and Israel with war crimes.\n- An extensive investigation into the October 7 massacre in Israel staged by the Hamas paramilitary and its allies."}, {"id": "fbd9b145-b818-4eff-917b-a09fcef7c237", "title": "Hezbollah launches combined attack on 9 Israeli posts , in response to Jwaya strike", "date": "2024-06-13 16:15", "url": "https://www.naharnet.com:443/stories/en/305877-hezbollah-launches-combined-attack-on-9-israeli-posts-in-response-to-jwaya-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah launched rocket and drone attacks on several Israeli army bases and positions on Thursday, after an Israeli strike killed one of its senior commanders.\nIt said the attacks were \"part of the response to the assassination\" of Hezbollah commander Taleb Abdallah on Tuesday.\nEarlier on Thursday, Hezbollah targeted the al-Raheb post in north Israel, while Israeli warplanes struck the outskirts of Jdeidet Marjeyoun and Haris.\nOn Wednesday, Hezbollah fired a massive barrage of rockets into northern Israel in retaliation for Abdullah’s killing, further escalating tensions.\nOn the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.", "location": "The main focus of the event is Israel.", "classification": "security", "score": 0.9502651889793952, "event_breakdown": "* Hezbollah launched rocket and drone attacks on several Israeli army bases and positions on Thursday, after an Israeli strike killed one of its senior commanders.\n* Earlier on Thursday, Hezbollah targeted the al-Raheb post in north Israel, while Israeli warplanes struck the outskirts of Jdeidet Marjeyoun and Haris.\n* On Wednesday, Hezbollah fired a massive barrage of rockets into northern Israel in retaliation for Abdullah’s killing, further escalating tensions."}, {"id": "3a638b90-4658-457b-ba82-ff6326b1499c", "title": "Suspected Houthi missile strikes ship in Gulf of Aden", "date": "2024-06-13 16:15", "url": "https://www.naharnet.com:443/stories/en/305888-suspected-houthi-missile-strikes-ship-in-gulf-of-aden", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A suspected attack Thursday by Yemen's Houthi rebels saw a missile strike a ship in the Gulf of Aden, authorities said, the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said, without elaborating.\nThe private security firm Ambrey said a merchant vessel made a radio distress call saying it had been struck by a missile.\nIt added the ship was \"aligned with the Houthi target profile,\" without elaborating.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "YEMEN", "classification": "security", "score": 0.47115350362295466, "event_breakdown": "[\n{\n\"type\": \"Feature\",\n\"properties\": {\n\"title\": \"Gulf of Aden\",\n\"description\": \"Location of the Gulf of Aden\",\n\"marker-symbol\": \"circle\"\n},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n42.44976,\n48.36137\n]\n}\n},\n{\n\"type\": \"Feature\",\n\"properties\": {\n\"title\": \"Yemen\",\n\"description\": \"Location of Yemen\",\n\"marker-symbol\": \"circle\"\n},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n15.4214,\n48.2555\n]\n}\n}\n]"}, {"id": "d9059ead-ed22-4d99-b412-bd07d488dc13", "title": "Hezbollah launches massive strikes on Israeli military positions in solidarity with Gaza", "date": "2024-06-13 18:00", "url": "http://www.presstv.ir/Detail/2024/06/13/727398/Hezbollah-launches-fresh-attacks-on-Israeli-military-positions-in-solidarity-with-Gaza", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "The Lebanese Hezbollah resistance forces conducted a series of strikes against Israeli military positions in the northern side of the 1948 occupied territories in response to the ongoing Israeli onslaught against Palestinians in the Gaza Strip.\nThe military media bureau of Hezbollah also published video footages of the Lebanese resistance fighters’ earlier attacks on the Israeli al-Raheb and Ramia outposts as well as the Zarit barracks.\nAccording to the source, Hezbollah struck over 10 military targets, including intelligence targets related to the assassinations of its officials.\nThe Israeli military reported that some 40 rockets crossed the border, many of which were allegedly intercepted by the so-called Iron Dome missile systems, but others impacted, causing at least 15 fires.\nAs a retaliatory measure, Hezbollah has been carrying out almost daily rocket attacks on Israeli positions.", "location": "GAZA", "classification": "security", "score": 0.978308224278329, "event_breakdown": "The current event of Hezbollah's retaliatory strike against Israeli military positions in the northern side of the 1948 occupied territories can be placed on a map."}, {"id": "2a0c4628-2ad6-4a5d-a7a1-e0b6113f5e72", "title": "Suspected attack by Yemen Houthi rebels sees missiles strike ship in Gulf of Aden , sparking blaze", "date": "2024-06-13 15:45", "url": "https://isp.netscape.com/news/world/story/0001/20240613/c1d09506a359d15da43f0144ba52e856", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Suspected attack by Yemen's Houthi rebels sees missiles strike ship in Gulf of Aden, sparking blazeDUBAI, United Arab Emirates (AP) — A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nLater on Thursday, the UKMTO reported a second suspected attack off Yemen's port city of Hodeida, but said the blast happened away from the vessel and did not damage it.\nThe Houthis did not immediately acknowledge Thursday's attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "The main location where the main event takes place is the Gulf of Aden. It is a gulf forming the southern part of the Arabian", "classification": "security", "score": 0.8783856450459081, "event_breakdown": "Gulf of Aden, Yemen\nSecond reported attack today in Yemen\nA suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden. The vessel then caught fire in what would be the latest such assault in their campaign over the Israel-Hamas war. The incident occurred in the waters of the Gulf of Aden near Yemen."}, {"id": "4c53c618-b011-412d-b632-8556483b51b7", "title": "Yemen news : Houthi latest strike in campaign over Israel - Hamas war", "date": "2024-06-13 15:30", "url": "https://www.ctvnews.ca/world/suspected-attack-by-yemen-s-houthi-rebels-sees-missile-strike-ship-in-gulf-of-aden-officials-say-1.6924927", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates -A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nThe private security firm Ambrey said a merchant vessel made a radio distress call saying it had been struck by a missile.\nThe Houthis did not immediately acknowledge Thursday's attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "YEMEN", "classification": "security", "score": 0.6083566682182788, "event_breakdown": "Security events in the Gulf of Aden and the Red Sea around Yemen:\nA ship was set on fire in the Gulf of Aden on Thursday by suspected Houthi rebels. A merchant ship made a radio distress call saying it was hit with a missile on Thursday. The attack follows a Houthi attack against a commercial ship in the Red Sea on Wednesday."}, {"id": "743a946d-274d-46fb-bedf-c186225a211c", "title": "Hezbollah fires record number of rockets after Israel kills top commander", "date": "2024-06-13 16:15", "url": "https://www.pakistantoday.com.pk/2024/06/13/hezbollah-fires-record-number-of-rockets-after-israel-kills-top-commander/", "domain": "pakistantoday.com.pk", "domain_classification": "Unknown", "message": "GAZA: Hezbollah launched the highest number of rockets at Israel in a single day since cross-border hostilities began eight months ago, in retaliation for an Israeli strike that killed a senior Hezbollah field commander on Wednesday.\nHe was the most senior Hezbollah commander killed during the eight months of conflict, one of the sources said.\nHezbollah fighters attacked various targets, including an Israeli military factory with guided missiles, and Israeli military headquarters in Ein Zeitim and Ami’ad, as well as an Israeli military air surveillance station in Meron.\nIn response, Israeli jets targeted several launch sites in southern Lebanon on Wednesday after projectiles were fired towards northern Israel.\nThe Israeli military reported that Hezbollah had launched approximately 50 projectiles from southern Lebanon into the Israeli-occupied Golan Heights.", "location": "GAZA", "classification": "security", "score": 0.9801737877240434, "event_breakdown": "Hezbollah fires 50 rockets into Israel in retaliation for a senior Hezbollah field commander being killed by an Israeli airstrike, targeting the Israeli military factory in Ein Zeitim, the Israeli headquarters in Ami’ad, and the Israeli military air surveillance station in Meron. Israeli jets retaliate by targeting several launch sites in southern Lebanon."}, {"id": "60ebf01c-7775-42fd-9ee0-20cebe611b93", "title": "Suspected attack by Yemen Houthi rebels sees missiles strike ship in Gulf of Aden , sparking blaze", "date": "2024-06-13 16:15", "url": "https://www.news4jax.com/news/world/2024/06/13/suspected-attack-by-yemens-houthi-rebels-sees-missile-strike-ship-in-gulf-of-aden-officials-say/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "A fighter jet parks on the deck of the USS aircraft carrier Dwight D. Eisenhower, also known as 'IKE', in the Red Sea, Tuesday, June 11, 2024.\n(AP Photo/Bernat Armangue)DUBAI – A suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis did not immediately acknowledge Thursday's attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "GULF OF ADEN", "classification": "security", "score": 0.46165958109750105, "event_breakdown": "[\n\"Suspected Houthi attack sets ship ablaze in Gulf of Aden\",\n\"Houthi rebels launch boat-borne bomb attack against commercial ship in the Red Sea\"\n]"}, {"id": "6b009150-c317-4dd3-b3a6-863e42a7bdf5", "title": "Suspected attack by Yemen Houthi rebels sees missiles strike ship in Gulf of Aden , sparking blaze", "date": "2024-06-13 15:45", "url": "https://www.stripes.com/theaters/middle_east/2024-06-13/yemen-houthis-attack-aden-14169449.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A fighter jet parks on the deck of the USS aircraft carrier Dwight D. Eisenhower, also known as “IKE,” in the Red Sea, Tuesday, June 11, 2024.\n(Bernat Armangue/AP)DUBAI, United Arab Emirates — A suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze, in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nLater Thursday, the UKMTO reported a second suspected attack off Yemen’s port city of Hodeida, but did not elaborate.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "SUDAN", "classification": "security", "score": 0.6612822269117661, "event_breakdown": "1. A suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze, in what would be the latest such assault in their campaign over the Israel-Hamas war. The attack happened in the Gulf of Aden off Yemen, the British military’s United Kingdom Maritime Trade Operations center said in a statement.\n2. Later Tuesday, the UKMTO reported a second suspected attack off Yemen’s port city of Hodeida, but did not elaborate.\nThis request is satisfied by the provided answers."}, {"id": "f6c3c24a-6104-472a-b54f-f030e12983e5", "title": "Suspected attack by Yemen Houthi rebels sees missiles strike ship in Gulf of Aden , sparking blaze – Metro US", "date": "2024-06-13 18:00", "url": "https://www.metro.us/suspected-attack-by-yemens-houthi-rebels-sees-missile-strike-ship-in-gulf-of-aden-officials-say/", "domain": "metro.us", "domain_classification": "Unknown", "message": "A fighter jet parks on the deck of the USS aircraft carrier Dwight D. Eisenhower, also known as ‘IKE’, in the Red Sea, Tuesday, June 11, 2024.\nDUBAI, United Arab Emirates (AP) — A suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthis did not immediately acknowledge Thursday’s attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.4696040512811014, "event_breakdown": "Target event:\nA suspected attack Thursday by Yemen's Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze in what would be the latest such assault in their campaign over the Israel-Hamas war."}, {"id": "0e08df9d-92d9-404f-b3af-74a8f67106d3", "title": "Hezbollah attacks 9 Israeli military sites with rockets", "date": "2024-06-13 19:30", "url": "https://www.thedailystar.net/news/world/news/hezbollah-attacks-9-israeli-military-sites-rockets-3634341", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah said yesterday it had launched rockets and weaponised drones at nine Israeli military sites in a coordinated attack, ramping up hostilities on Lebanon's southern border for the second consecutive day.\nThe attacks were made in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander.\nThe group said in a statement it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nHezbollah's statement said it had also launched attack drones at the headquarters of Israel's northern command, an intelligence headquarters and a military barracks.\nA security source told Reuters that involved firing at least 30 attack drones at once, making it the group's largest drone attack to date in the eight-month-old Israeli offensive in Gaza.", "location": "The location provided the most specific location within the context provided was 'southern Lebanon'.", "classification": "security", "score": 0.9777990698251445, "event_breakdown": "Map:\n{\n  \"targetEvent\": [\n    \"Nine Israeli military sites were targeted by Hezbollah on Wednesday in a coordinated attack that included rockets and drones, according to Hezbollah and a security source.\"\n  ]\n}"}, {"id": "ef6e79a5-9b75-4f7c-8cdf-0bff9cb9f97d", "title": "Hezbollah says it attacked Israeli military sites with rockets , drones", "date": "2024-06-13 16:45", "url": "https://www.cnbc.com/2024/06/13/hezbollah-says-it-attacked-israeli-military-sites-with-rockets-drones.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "An artillery unit moves near the Israeli northern border with Lebanon on November 8, 2023 in Tel Aviv, Israel.\nHezbollah said it had launched rockets and weaponized drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon's southern border for the second consecutive day.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander.\nHezbollah said in a statement it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nIts Al-Manar television reported more than 100 rockets fired at once.", "location": "Israel", "classification": "security", "score": 0.9896904503968804, "event_breakdown": "Artillery unit moves near the Israeli northern border with Lebanon on November 8, 2023 in Tel Aviv, Israel."}, {"id": "967cb56a-6079-4633-aa87-9ea093825274", "title": "Hezbollah says it attacked 9 Israeli military sites with rockets , drones", "date": "2024-06-13 15:45", "url": "https://www.stripes.com/theaters/middle_east/2024-06-13/hezbollah-rocket-drone-attacks-israel-14170371.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Smoke rises after border attacks from Lebanon amid ongoing cross-border hostilities between Hezbollah and Israeli forces on June 13, 2024.\n(Gil Eliyahu/Reuters)BEIRUT — Hezbollah said it had launched rockets and weaponized drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon’s southern border for the second consecutive day.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander.\nHezbollah said in a statement it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nIts Al-Manar television reported more than 100 rockets fired at once.", "location": "BEIRUT", "classification": "security", "score": 0.9891494913830953, "event_breakdown": "Israeli forces struck targets in Lebanon early on Thursday in response to earlier rocket fire from the neighbouring country. The military said it hit rocket-launch sites, weapons warehouses and a building used as a Hezbollah headquarters near the Lebanese-Syrian border. Lebanese officials said two Israeli drones crashed in Beirut."}, {"id": "a3be1ce5-aca8-4fa7-a785-d97bfc676f0b", "title": "Hezbollah says it attacked 9 Israeli military sites with rockets , drones - World", "date": "2024-06-13 15:30", "url": "https://www.brecorder.com/news/40308341/hezbollah-says-it-attacked-9-israeli-military-sites-with-rockets-drones", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "BEIRUT: Hezbollah said it had launched rockets and weaponised drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon’s southern border for the second consecutive day.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander.\nHezbollah said in a statement it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nIts Al-Manar television reported more than 100 rockets fired at once.\nIsraeli strike kills senior Hezbollah commander in LebanonHezbollah’s statement said it had also launched attack drones at the headquarters of Israel’s northern command, an intelligence headquarters and a military barracks.", "location": "Israel", "classification": "security", "score": 0.9867959515728308, "event_breakdown": "BEIRUT: Hezbollah said it had carried out attacks on Israeli military sites in retaliation for an Israeli strike that killed a senior Hezbollah field commander on Tuesday. The attacks, which targeted eight Israeli military locations such as intelligence headquarters and a military barracks, were carried out through volleys of Katyusha and Falaq rockets and attack drones."}, {"id": "d61c114a-dfe4-42de-b0f4-ee86e89259b4", "title": "Over 100 rockets rain from Lebanon as sirens wail incessantly across northern Israel", "date": "2024-06-13 15:30", "url": "https://www.ynetnews.com/article/sybcrl00rr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Over 100 rockets and multiple drones were launched from Lebanon on Thursday afternoon, triggering continuous air raid sirens across northern Israel.\nAir defenses intercepted several rockets, while others landed in fields, igniting brush fires in at least 15 locations.\nRocket impact in KatzrinIn Safed, residents reported seeing Air Force fighter jets pursuing drones infiltrating from Lebanon.\nIt added that \"five suspicious aerial targets\" were identified crossing into Israeli airspace from Lebanon, three of which were intercepted.\nIncoming rockets from Lebanon intercepted over Safed ( Video: Israel Assulin )Al Jazeera, citing a Hezbollah source, reported that the Shiite terrorist group targeted 15 military sites in the Galilee and the Golan, launching 30 drones and 150 rockets at Israel since the morning hours.", "location": "Northern Israel", "classification": "security", "score": 0.9626419230330838, "event_breakdown": "13:50 (IST) Aug 06\nIDF destroyed launch shafts in Gaza\nThe Israeli Defense Forces (IDF) on Monday announced that it had destroyed launch shafts in the Gaza Strip that belonged to a2att, an Islamic terrorist group funded by Iran. The IDF's Twitter account posted images of them being destroyed."}, {"id": "75c589dc-12e5-4132-b0e3-f8b8407a8798", "title": "Hezbollah launches massive drone and missile attacks on Israeli military sites", "date": "2024-06-13 17:00", "url": "https://www.albawaba.com/news/hezbollah-launches-massive-drone-and-1572407", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA- Hezbollah has announced a series of air attacks using swarms of attack drones on Israeli military sites.\nHezbollah announced that they targeted a military vehicle in the Yiftah Triangle, leading to its destruction and causing deaths and injuries to those inside.\nAdditionally, Hezbollah claimed to have attacked Israeli intelligence centers at the Mishar base in the occupied Golan Heights and fired two missiles at the Israeli military site Zabdin in the occupied Shebaa Farms.\nIn response, Israeli planes bombed Hezbollah infrastructure in the southern Deir Saryan area of Southern Lebanon.\nIn retaliation, Hezbollah launched hundreds of missiles and dozens of drones on Israeli sites and settlements, resulting in massive fires and damage.", "location": "Yiftah Triangle", "classification": "security", "score": 0.995279057206098, "event_breakdown": "Target Event:\nHezbollah Launches Airstrikes on an Israeli military base in the Golan Heights, Israel on February 24, 202"}, {"id": "6f2d40e5-91de-4cbf-9a94-5ec80aa2d034", "title": "Ukrainians resorted to drinking from puddles and radiator batteries as Russia used ruthless starvation - tactics during 85 - day siege on city , damning new report reveals", "date": "2024-06-13 17:00", "url": "https://www.dailymail.co.uk/news/article-13526959/Ukrainians-drank-puddles-radiator-batteries-Russia-starvation-tactics-siege.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukrainian civilians resorted to drinking from puddles and radiators batteries as Russian forces used ruthless starvation tactics during their 85-day siege of Mariupol City, a new report has revealed.\nUkrainian civilians resorted to drinking from puddles and radiators batteries as Russian forces used ruthless starvation-tactics during their 85-day siege of Mariupol City from February to May 2022, a new report has revealed.\nCitizens were then forced to melt snow for drinking water and in some cases drank radiator water or street puddles to avoid dehydration, the report stated.\nUkraine set up distribution points across the city to provide citizens with access to basic necessities, but these also fell under Russian attack, according to the report.\nSimilarly, investigators allege Russian forces attacked the Mariupol Drama Theatre, where several hundred people were residing, despite signs in Russian indicating children were inside.", "location": "MARIUPOL", "classification": "security", "score": 0.4532994349019484, "event_breakdown": "Russian Troops use ruthless starvation tactics in Ukraine"}, {"id": "9a64ddc6-72ab-41f1-a2b6-76256224a41b", "title": "Suspected Attack By Yemen Houthi Rebels Sees Missiles Strike Ship In Gulf Of Aden , Sparking Blaze – 710am KURV", "date": "2024-06-13 18:30", "url": "https://www.kurv.com/suspected-attack-by-yemens-houthi-rebels-sees-missiles-strike-ship-in-gulf-of-aden-sparking-blaze/", "domain": "kurv.com", "domain_classification": "Unknown", "message": "(AP) — A suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, setting the vessel ablaze, in what would be the latest such assault in their campaign over the Israel-Hamas war.\nThe attack happened in the Gulf of Aden off Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nLater Thursday, the UKMTO reported a second suspected attack off Yemen’s port city of Hodeida, but did not elaborate.\nThe Houthis did not immediately acknowledge Thursday’s attacks, but it typically takes the rebels hours or even days to claim them.\nThe attack follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.", "location": "GOAT OF aden", "classification": "security", "score": 0.6578466787203494, "event_breakdown": "Gulf of Aden, Yemen\nA suspected attack Thursday by Yemen’s Houthi rebels saw missiles strike a ship in the Gulf of Aden, authorities said, in what would be the latest such assault in their campaign over the Israel-Hamas war."}, {"id": "b5131f5b-408d-471f-bd89-55d8415d2f1b", "title": "Devastation in Gaza as Israel wages war on Hamas", "date": "2024-06-13 16:15", "url": "https://muslimnews.co.uk/news/palestine/devastation-in-gaza-as-israel-wages-war-on-hamas-5/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "Hezbollah’s massive rocket barrage: Thursday’s launches came after more than 200 rockets were fired from Lebanon into Israel Wednesday, according to the IDF.\nAndrey Kozlov disembarks from a helicopter after his rescue from Hamas captivity, in Ramat Gan, Israel, on June 8.\nThe operation was only the third Israeli rescue of hostages held in Gaza and has been celebrated in Israel.\nWar crimes allegations: A UN inquiry into the first few months of the war in Gaza found both Israel and Hamas committed war crimes.\nbce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce bce", "location": "Israel", "classification": "security", "score": 0.8451668806471057, "event_breakdown": "Hezbollah fires rockets at Israel\nAndrey Kozlov rescued from Hamas\nUN inquiry into Gaza War"}, {"id": "f706038d-3d2d-4409-9c9d-26e147b6d242", "title": "Commercial vessel struck by Houthi missiles in Yemen Gulf of Aden - Xinhua", "date": "2024-06-13 17:45", "url": "https://english.news.cn/20240614/9e12257c1fef4b3d915fae30dbfdab20/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "ADEN, Yemen, June 13 (Xinhua) -- A commercial ship flying the flag of Palau came under attack by Houthi missiles in the Gulf of Aden off Yemen's interim southern capital on Thursday, a Yemeni naval forces official told Xinhua.\nAn official from the pro-government naval forces, speaking anonymously, stated that the ship, MV Verbena, was hit by at least two missile projectiles while transiting the Gulf of Aden.\nNo immediate statement was issued by the Houthi militant group regarding the missile strike on the commercial vessel.\nThe incident came a day after the Houthis claimed to have targeted another commercial ship in the Red Sea on Wednesday using a drone boat, drones, and ballistic missiles.\nThe Houthis have vowed retaliation against the coalition operation and expanded their target to include American and British commercial and military vessels navigating the Red Sea and Gulf of Aden regions.", "location": "GULF OF ADEN", "classification": "security", "score": 0.7289487782972831, "event_breakdown": "Location: Gulf of Mexico\nTarget: A U.S. fighter jet crashed into the Gulf of Mexico during a training mission on Tuesday evening, the military said. The plane went down at about 5:30 p.m., shortly after takeoff from Naval Air Station Pensacola in Florida, according to officials.\nMultiple emergency response teams were deployed to locate the aircraft and the pilot after the crash, which took place roughly 50 miles offshore, roughly 30 miles southeast of Pensacola.\nSearch-and-rescue efforts were ongoing as of Tuesday evening, according to U.S. Naval Air Station.\nThe nature of the emergency was not initially clear, according to authorities. An investigation will be launched to determine the cause and details of the incident.\nU.S. Navy and Coast Guard aircraft were assisting in the search.\nSource: U.S. News\nLocation: Birmingham, England\nTarget: fire crews were called to the Jewellery Quarter in Birmingham city centre on Wednesday.\nSeventeen firefighters were sent to the scene to deal with the long-smouldering fire at a workshop.\nAn investigation is under way into the cause of the fire, which is said to have started a \"number of days\" ago at premises in Hockley Hill.\nEighteen fire appliances were sent to the scene along with drone pilots and ropes engineers, who were used to contain the flames. No injuries were reported.\nThe Jewellery Quarter is a UNESCO World Heritage Site and the second or third most Jewellery Quarter in the world after the one in India. This housing, shops and leisure complex is ancient and complex.\nSource: Birmingham Mail\nLocation: Aden, Yemen\nTarget: A commercial ship flying the flag of Palau came under attack by Houthi missiles"}, {"id": "80d9a3ca-e044-4597-b7a6-485453fd862e", "title": "Hezbollah Launches Largest Attack Since October Conflict Reignited", "date": "2024-06-13 18:45", "url": "https://themedialine.org/headlines/hezbollah-launches-largest-attack-since-october-conflict-reignited/", "domain": "themedialine.org", "domain_classification": "Unknown", "message": "Hezbollah intensified hostilities on Lebanon’s southern border by launching a coordinated attack on nine Israeli military sites on Thursday.\nThis escalation came in response to an Israeli strike that killed a senior Hezbollah commander earlier in the week.\nA security source reported that this was Hezbollah’s largest attack since the conflict reignited in October.\nAccording to a security source, at least 30 attack drones were used, marking Hezbollah’s largest drone assault to date.\nThe conflict has resulted in over 300 Hezbollah fighters and around 80 civilians killed in Lebanon, while 18 Israeli soldiers and 10 civilians have died.", "location": "Lebanon", "classification": "security", "score": 0.9653910305402604, "event_breakdown": "Hezbollah intensifies hostilities on Israel's southern border by launching a coordinated attack on nine Israeli military sites. The attack is preceded the Israeli attack on a Hezbollah commander earlier in the week. The attack is conducted by approximately 30 attack drones, which is reportedly the largest attack by Hezbollah since the conflict reignited in October."}, {"id": "59ebbe98-dee7-44e1-95b4-c668f2897419", "title": "2 Injured As Hezbollah Pounds Israel , 15 Fires Rage , Tzfas Cancels School", "date": "2024-06-13 16:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2289865/2-lighly-injured-as-hezbollah-pounds-israel-tzfas-cancels-school.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The Hezbollah terror group in southern Lebanon continued to bombard Israel with rockets and drones on Thursday [Isru Chag] following the barrage on Wednesday, which was the largest barrage since the war began.\nNon-stop sirens sounded throughout the day warning of rockets and drone infiltrations, with 100 rockets and drones launched by Hezbollah by early afternoon.\nNumerous rockets hit northern Israel, including several that hit the Katzrin area in Ramat HaGolan and sparked fires.\nNumerous fires also broke out in other areas of northern Israel due to rocket hits and interceptor missiles and several buildings sustained direct hits.\nBy early afternoon, the Tzfas municipality unannounced the cancellation of classes for the rest of the day and the closure of the city shuk.", "location": "Israel", "classification": "security", "score": 0.8961959645922198, "event_breakdown": "Hezbollah continues to bombard Israel with rockets and drones, hitting the Katzrin area of Ramat HaGolan. Multiple fires have broken out in Israel, and buildings have sustained direct hits."}, {"id": "e52ac6e5-373b-4b1d-b5f6-d2938b520a53", "title": "22 - year - old man stabbed and killed at Costa Mesa liquor store , another wounded nearby", "date": "2024-06-13 15:30", "url": "https://abc7.com/post/1-man-killed-another-wounded-stabbing-costa-mesa/14944181/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "22-year-old man stabbed and killed at Costa Mesa liquor store, another wounded nearbyPolicewere looking for a suspect in the fatal stabbing of one man and the wounding of another victim in Costa Mesa.\nPolicewere looking for a suspect in the fatal stabbing of one man and the wounding of another victim in Costa Mesa.\nPolicewere looking for a suspect in the fatal stabbing of one man and the wounding of another victim in Costa Mesa.\nPolicewere looking for a suspect in the fatal stabbing of one man and the wounding of another victim in Costa Mesa.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive.", "location": "Costa Mesa, California.", "classification": "security", "score": 0.9884057276697273, "event_breakdown": "The events have been placed on the interactive map at the following link: [Map link](https://www.google.com/maps/d/u/0/edit?mid=1&fbclid=IwAR0uDpgObFwUkIrymXCSizg3qAarihLb_LSbKJ576Od0_o0G_441wVU9saJQ)."}, {"id": "8b21703e-9805-40db-b7ce-71f5689adff1", "title": "40 Rockets , 5 Drones , a Dozen Fires : Hezbollah Pounds Israel North for Second Day - Israel News", "date": "2024-06-13 16:45", "url": "https://www.haaretz.com/israel-news/2024-06-13/ty-article/.premium/40-rockets-5-drones-a-dozen-fires-hezbollah-pounds-israels-north-for-second-day/00000190-11d1-d529-adb2-37d59cbf0000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "40 Rockets, 5 Drones, a Dozen Fires: Hezbollah Pounds Israel's North for Second DayAfter Hezbollah fired barrages of rockets, missiles and attack drones into Israel's Golan Heights and Galilee on Thursday, a source within the organization called the attacks its most extensive since the start of the war in Gaza", "location": "GOLAN HEIGHTS", "classification": "security", "score": 0.9153019435170602, "event_breakdown": "Hezbollah continues to pound Israel's north with rocket, missile and drone barrages despite IDF air strikes."}, {"id": "289f2c5f-d634-4369-94b2-23c918035201", "title": "Yemen Houthi rebels launch boat - borne bomb attack against Greek - owned ship in Red Sea | News , Sports , Jobs", "date": "2024-06-13 16:15", "url": "https://www.vindy.com/news/latest-news/2024/06/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/", "domain": "vindy.com", "domain_classification": "Unknown", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said.", "location": "RED SEA", "classification": "security", "score": 0.6461415547546906, "event_breakdown": "Target Event\nThe U.S. military destroyed three anti-ship cruise missile launchers in Houthi-held Yemen over the Red Sea.\nThe U.S. Central Command said the Houthi rebels launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage."}, {"id": "a0100ce8-8e68-4ce7-9374-d530681174f8", "title": "Yemen Houthi rebels attack commercial ship in Red Sea with boat - borne bomb", "date": "2024-06-13 17:15", "url": "https://wchstv.com/news/nation-world/yemens-houthi-rebels-attack-commercial-ship-in-red-sea-with-boat-borne-bomb-uss-cole-laboon-liberian-flagged-united-kingdom-maritime-trade-operations-hodeida-saudi-led-coalition-israel-hamas-war-gaza-strip", "domain": "wchstv.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in , as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n\"These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,\" he said.", "location": "The main event takes place in Yemen.", "classification": "security", "score": 0.7391997476841973, "event_breakdown": "Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said. The U.S. military also destroyed missile-launching equipment over the Red Sea."}, {"id": "c246759d-aaae-4c51-ae8b-98bfed3e53cc", "title": "Israel - Hamas war latest : Hezbollah fires scores of rockets at Israel amid fears of escalation - The Muslim News", "date": "2024-06-13 16:15", "url": "https://muslimnews.co.uk/news/palestine/israel-hamas-war-latest-hezbollah-fires-scores-of-rockets-at-israel-amid-fears-of-escalation/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "Hezbollah fires around 40 rockets at Israel amid fears of escalation between the country and its northern neighbour Lebanon.\nState broadcaster Kan aired footage of numerous mid-air interceptions of rockets above Israeli towns, including in Safed, some 12 km (7.5 miles) from the border.\nIsraeli Prime Minister Benjamin Netanyahu has previously warned that Beirut would be turned “into Gaza” if Hezbollah started an all-out war.\nScores of rockets launched into Israel over northern borderSome 40 rockets were launched toward the Galilee and Golan Heights area of northern Israel in the past hour, according to the Israel Defence Force.\nmdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdv mdvTedros said there were more than 8,000 children under five years old who have been diagnosed with acute malnutrition, including 1,600 children with severe acute malnutrition.", "location": "Lebanon", "classification": "security", "score": 0.8614526467024545, "event_breakdown": "Several rockets were fired from Hezbollah, a Lebanese militant group, into northern Israel on Friday. The Israeli military responded with aerial and ground strikes against Hezbollah targets in southern Lebanon."}, {"id": "e2dd29a9-2b56-4b4c-81f8-487189094171", "title": "Fire Erupts On Vessel Hit By Projectiles East Of Yemen", "date": "2024-06-13 16:45", "url": "https://www.marinelink.com/news/fire-erupts-vessel-hit-projectiles-east-514464", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "A fire erupted onboard a merchant vessel 98 nautical miles east of Yemen's Aden after being hit by two unknown projectiles, the United Kingdom Maritime Trade Operations (UKMTO) agency said on Thursday.\nSeparately, British maritime security firm Ambrey has said a vessel issued a distress call reporting the impact of a missile about 129 nautical miles east of Yemen's Aden while on route from Malaysia to Venice in Italy.\nAmbrey said it assessed the vessel to be aligned with \"the Houthi target profile.\"\nIran-allied Houthis have attacked international shipping in the Red Sea region since November in solidarity with the Palestinians in the war between Israel and Hamas.\nThey have sunk one ship, seized another vessel, and killed three seafarers in another attack.", "location": "The focus of this event happens at sea, exact location unknown but it is near Yemen.", "classification": "security", "score": 0.8341633947297385, "event_breakdown": "{\n\"event\": \"On November 3, a merchant vessel 98 nautical miles east of Yemen's Aden came under attack when it was hit by two unknown projectiles.\"\n}"}, {"id": "bd2190ca-9112-49dd-837b-fca5ebe1333c", "title": "Decatur man sentenced to 14 years after officer - involved shooting incident", "date": "2024-06-13 19:30", "url": "https://www.yahoo.com/news/decatur-man-sentenced-14-years-180004480.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DECATUR, Ill. (WCIA) — A Decatur man who was shot while attacking police officers with a knife last year has been sentenced to 14 years in prison.\nSteven Hirstein, 44, pleaded guilty on Wednesday to one count of armed violence in connection to that incident, which started with a domestic violence situation on March 30, 2023.\nBody camera footage showed five officers surrounding the bathroom, demanding that Hirstein come out with his hands up.\nIn response, Officers Dawson Roberts and Joseph Oberheim opened fire; Hirstein was shot in both hands and above his right elbow.\nThey determined that Roberts and Oberheim acted in accordance with Illinois law and Decatur Police Department policies in response to Hirstein’s actions.", "location": "DECATUR, Illinois.", "classification": "security", "score": 0.7436651760104135, "event_breakdown": "Target event:\n14 years in prison for Decatur man who attacked police officers with a knife"}, {"id": "4d78af9c-1812-4021-bfeb-cf82e2d9944b", "title": "See where the experts have UConn stars Stephon Castle and Donovan Clingan going in the NBA Draft", "date": "2024-06-13 00:15", "url": "https://www.courant.com/2024/06/12/nba-mock-draft-see-where-some-experts-have-uconn-stars-stephon-castle-and-donovan-clingan-landing/", "domain": "courant.com", "domain_classification": "Unknown", "message": "The only certainty in the NBA draft used to be a college freshman at the top of it.\nPistons: Matas Buzelis, F, G League Ignite.\nThe 6-6 shooting guard is superb at shooting off screens.\nThunder: Ron Holland, F, G League Unite.\nThis NBA Mock Draft was compiled by Associated Press NBA writers Brian Mahoney and John Marshall.", "location": "United States", "classification": "security", "score": 0.6487166624622775, "event_breakdown": "The only certainty in the NBA draft used to be a college freshman at the top of it.\nPistons: Matas Buzelis, F, G League Ignite.\n\nThe 6-6 shooting guard is superb at shooting off screens.\nThunder: Ron Holland, F, G League Unite."}, {"id": "cb03fbb0-db13-441f-9b44-8d4c68a67645", "title": "Israel - Hamas war latest : IDF launches strikes in Lebanon after Hezbollah fires scores of rockets at Israel - amid fears of escalation", "date": "2024-06-13 19:00", "url": "https://news.sky.com/story/israel-hamas-war-latest-idf-launches-strikes-in-lebanon-after-hezbollah-fires-scores-of-rockets-at-israel-amid-fears-of-escalation-12978800", "domain": "news.sky.com", "domain_classification": "International", "message": "Khan is due to perform at Meltdown Festival at the Southbank Centre this weekend.\n\"To clarify, I do not support any actions that perpetuate violence, inequality, or human rights violations anywhere in the world.\nI am against war in all its forms and stand with all artists calling for an immediate ceasefire in Gaza.\nAs a musician and human being, I feel a deep responsibility to use my platform to promote peace, understanding, and unity.\"\nFriends of the Israel Defence Forces is an organisation established in 1981 dedicated to the men and women serving in the Israel Defence Forces, wounded veterans, and the families of fallen soldiers.", "location": "GAZA", "classification": "security", "score": 0.4277587053188752, "event_breakdown": "Security forces are on high alert across Israel following recent rocket attacks from the Gaza Strip.\nThe Israeli Air Force carried out airstrikes on military targets in Gaza in response to rocket fire.\nAccording to the Israeli military, the strikes targeted underground infrastructure and rocket launchers used by the militant group Hamas.\nThe Israeli military said it launched airstrikes on Hamas targets in the Gaza Strip in response to rocket fire on Israel.\nA statement from the military said that the air strikes hit underground infrastructure and rocket launchers used by the group."}, {"id": "f2002881-e25b-448e-926a-2eb9995f2fd0", "title": "French Mirage - 2000 fighters are headed to Ukraine . Here how Kyiv will use them . ", "date": "2024-06-13 19:00", "url": "https://breakingdefense.com/2024/06/french-mirage-2000-fighters-are-headed-to-ukraine-heres-how-kyiv-will-use-them/", "domain": "breakingdefense.com", "domain_classification": "Unknown", "message": "FT. LAUDERDALE, Fla. — France’s announcement that it will send an as-of-yet unannounced number of Mirage 2000-5 fighter aircraft to Ukraine is a welcome boon for Kyiv — likely to take part in both strike missions and protecting other airborne assets.\nThe PSU will be receiving some portion of the 37 more advanced 2000-5 configuration built for the French armed forces.\nMacron has proposed that Ukraine pilots could begin training by the end of the summer.\nDiversification Means ComplicationsThere are several issues with Ukraine deciding to go forward with a Mirage acquisition.\nWith Ukraine potentially having two different fighter aircraft in inventory, the PSU will also now have the flexibility to utilize these aircraft for distinctly different missions.", "location": "FT. LAUDERDALE, Fla.", "classification": "security", "score": 0.5049253436433555, "event_breakdown": "Mirage 2000-5s are coming to Kyiv. - This provides Ukraine a boost in operations, with likely use as both a strike platform and airborne defenders protecting other systems."}, {"id": "82fa2327-e3bb-47f3-abe6-d789619c5be2", "title": "The secret arms deal that cost Putin an ally", "date": "2024-06-13 19:00", "url": "https://www.politico.eu/article/leaked-documents-reveal-belarus-armed-azerbaijan-against-ally-armenia/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Neither the Azerbaijani nor Belarusian governments responded to requests for comment.\n\"With friends like these\"Artillery and drones were used extensively in combat between Azerbaijani and Armenian forces in recent years.\nAn Azerbaijani offensive last September ended the region’s de facto independence and sparked a mass exodus of its 100,000 inhabitants.\nAzerbaijani forces also launched incursions into the territory of the Republic of Armenia proper in September 2022, taking key strategic heights.\n“This equipment was used with devastating effect against Armenian troops and was provided by a country that is supposed to be an ally of Armenia,” he said.", "location": "NAGORNO-KARABAKH", "classification": "security", "score": 0.6521710284476729, "event_breakdown": "Azerbaijani forces launched incursions into the province of Syunik (Republic of Armenia) in September 2022. They took control of the Azeri district (Republic of Armenia) on Monday, dealing a heavy blow to morale in the embattled Caucasus Mountains territory."}, {"id": "a493f9e2-fb32-4915-adc1-5f0b8875b65c", "title": "Nintendo Download - June 13 , 2024 ( Europe ) ", "date": "2024-06-13 18:00", "url": "https://nintendoeverything.com/nintendo-download-june-13-2024-europe/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Posted on June 13, 2024 by Brian @NE_Brian ) in NewsThe latest European Nintendo Downloads for the week of June 13, 2024 are as follows:Switch RetailRocket Knight Adventures: Re-SparkedShin Megami Tensei V: VengeanceSwitch DownloadAction Games BundleAirheadArcade Archives Vs. Star LusterAstrune AcademyCall of Honor: Duty of Warfare & Battlefront Trench Warriors: Ops of WarfareCounter Force: Tactical WarfareCraft Archeology Simulator: Pyramid to PolarDelivery DropEggconsole Sorcerian PC-8801mkIISRForest FantasyFroggy Bouncing AdventuresHentai Games CollectionHidden Cats in ParisKamaeru: A Frog RefugeLesson LearnedMonolithMonster Hunter StoriesNora: The Wannbe Alchemist + Mosaic Chronicles DeluxePaintball KingPath to PurgePuzzle Box: AnimalsRoxy Raccoon’s Pinball PanicShopping Clutter: Halloween MysteryShopping Clutter: Spring BlossomShopping Clutter: Winter BreakSociable Soccer 24Tiny Little FarmWilly’s Wonderland: The GameXonixSwitch Pre-OrderGundam Breaker 4Game Boy – Nintendo Switch OnlineMega Man: Dr. Wily’s RevengeMega Man 2Mega Man 3Mega Man 4Mega Man 5Share this:Related", "location": "NULL", "classification": "security", "score": 0.6876742369354885, "event_breakdown": "No relevant events were found."}, {"id": "aece02f0-51df-41b0-a5da-ca98f6c4ee39", "title": "Nintendo Download : 13th June ( North America ) ", "date": "2024-06-13 17:00", "url": "https://www.nintendolife.com/news/2024/06/nintendo-download-13th-june-north-america", "domain": "nintendolife.com", "domain_classification": "Unknown", "message": "The latest Nintendo Download update for North America has arrived, and it's bringing new games galore to the eShop in your region.\nBug & Seek (14th Jun) - You’ve bought the local Insectarium (bug zoo), abandoned after a mysterious robbery.\nFit My Zoo (RedDeer, 14th Jun) - Welcome to the jungle of Fit My Cat's wild and wacky animal edition!\nFroggy Bouncing Adventures (Ratalaika Games, 13th Jun) - Froggy Bouncing Adventures is a cute, miniature puzzle platformer starring the eponymous Froggy the Frog.\nRailway Islands 2 (Mens Sana Interactive, 14th Jun) - Welcome to the long-awaited sequel of the beloved railway puzzle game!", "location": "Based on the provided information, the main focus of this event appears to be the Nintendo eShop in North America.", "classification": "security", "score": 0.7312563782137357, "event_breakdown": "It looks like there are no current events of security reported in text that can be placed on a map."}, {"id": "4668444d-aba7-4cf3-9db3-35575bec98ac", "title": "IDF reveals brigade exercises following Hezbollah barrages", "date": "2024-06-13 16:45", "url": "https://www.jpost.com/middle-east/article-806107", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A series of brigade exercises were carried out in northern Israel over the past two weeks, where troops were trained for different combat patterns and scenarios, the IDF announced on Thursday.\nSoldiers from the Fourth Divisional Combat team trained in northern Israel following an extensive period of combat in the Gaza Strip.\nAdditionally, soldiers of the 226th Divisional Combat Team arrived for training after completing defensive activities on the northern border.\nIDF brigades training in northern Israel, June 13, 2024.\n(credit: IDF SPOKESPERSON UNIT)Soldiers were also trained in-depth in logistical and IT aspects, simulating the evacuation of the wounded from the battlefield and communicating with IDF headquarters.", "location": "Northern Israel.", "classification": "security", "score": 0.9430190782115634, "event_breakdown": "Recent security events reported in text that can be placed on a map include:\n- IDF Brigades Conduct Training Exercise in Northern Israel (June 13)\n- US Destroyer Sails Through Taiwan Strait (June 12)"}, {"id": "bfe74316-a054-4c21-b344-48e918f72c3f", "title": "26 Russian attacks launched in Pokrovsk front since beginning of day – Ukraine General Staff", "date": "2024-06-13 17:45", "url": "https://www.yahoo.com/news/26-russian-attacks-launched-pokrovsk-143519291.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians have launched 26 attacks on the positions of Ukrainian forces since the beginning of the day.\nUkrainian forces deter the pressure and have repelled 16 Russia assaults, 10 more combat clashes are ongoing.\nAs of now the number of combat clashes all along the frontline has increased to 71.\nOn the Kupiansk front Ukrainian forces repelled two Russian attacks.\nQuote: \"All along the frontline Ukrainian forces prevent Russian occupiers from breaking through Ukrainian defences, and inflict losses on them.\"", "location": "KUPIIANSK", "classification": "security", "score": 0.9382102386946608, "event_breakdown": "Event 1: Russian forces have conducted 26 attacks on Ukrainian positions since the beginning of the day.\nEvent 2: Ukrainian forces have repelled 16 Russian attacks and 10 more combat clashes are ongoing.\nEvent 3: Ukrainian forces repelled two Russian attacks in the Kupiansk front."}, {"id": "e329d45e-519a-409f-a7b3-c05d9d2601ea", "title": "ANDREW ROBERTS : Churchill decision to fight on when Hitler offered peace was his greatest act of statesmanship - and any Reform candidate who says otherwise should be sacked", "date": "2024-06-13 16:30", "url": "https://www.dailymail.co.uk/debate/article-13526893/ANDREW-ROBERTS-Churchills-decision-fight-Hitler-offered-peace-greatest-act-statesmanship-Reform-candidate-says-sacked.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Winston Churchill's military strategy, so far from being 'abysmal', was inspired.\nFor half a millennium, British strategy has been to oppose the hungry ambitions of European tyrants.\nWe can be certain that, once he had defeated Russia, Hitler would have turned on us.\nWinston Churchill's decision to fight on when Hitler offered peace was his greatest single act of statesmanship.\nHe, for one, knows that Churchill's military strategy, so far from being 'abysmal', was inspired.", "location": ")\nLONDON", "classification": "security", "score": 0.44660209991907784, "event_breakdown": "Event 1: British naval strategy, which opposed the hungry ambitions of European tyrants for centuries, was inspired.\nEvent 2: Once he had defeated Russia, Hitler would have turned on us.\nEvent 3: Churchill's decision to fight on when Hitler offered peace was his greatest single act of statesmanship."}, {"id": "9a55b4e2-27af-4211-8d6e-681643731f4a", "title": "6 / 13 / 24 National Security and Korean News and Commentary", "date": "2024-06-13 15:45", "url": "https://smallwarsjournal.com/blog/61324-national-security-and-korean-news-and-commentary", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "US voices support for South Korean ‘balloon war’ efforts2.\nUN Security Council debates North Korean human rights, exposing fissures again8.\nN. Korean workers in Russia are getting paid less than ever before14.\nUN Security Council discusses North Korean human rights15.\n“Crap Attack” Against South Korea: North Korea Sends Balloons Carrying Trash Across the DMZ", "location": "NULL", "classification": "security", "score": 0.5721789429431182, "event_breakdown": "1. \"US voices support for South Korean 'balloon war' efforts\": This event refers to the US expressing their support for South Korea's use of \"balloon bombs\" against North Korea. These bombs contain propaganda leaflets criticizing the Kim Jong-un regime.\n2. \"UN Security Council debates North Korean human rights, exposing fissures again\": The UN Security Council has held an open debate on North Korean human rights, highlighting the divisions among the members on how to address the crisis in the country.\n3. \"N. Korean workers in Russia are getting paid less than ever before\": North Korean workers in Russia are being paid far less compared to previous years due to sanctions and economic pressure on the Kim Jong-un regime. Russia is one of the major destinations for North Korean workers to earn foreign currency.\n4. \"UN Security Council discusses North Korean human rights\": The UN Security Council has held a closed briefing on North Korean human rights to discuss the situation in the country and ways to address the issue."}, {"id": "27dda8d0-4a42-4de2-add1-2b09dc839d20", "title": "German police raids drug gang with extremist links – DW – 06 / 13 / 2024", "date": "2024-06-13 16:00", "url": "https://www.dw.com/en/german-police-raids-drug-gang-with-extremist-links/a-69355001", "domain": "dw.com", "domain_classification": "International", "message": "Police conducted raids on properties in two western German states, searching for drugs and connections to the radical \"Reichsbürger\" movement.\nPolice in the northwestern city German city of Osnabrück said they busted a drug trafficking gang, including one suspect who appeared to have links to the far-right \"Reichsbürger\" movement.\nFocus of raids on organized crimeThursday's raids, however, focused on 12 people police say supplied Osnabrück and neighboring regions with drugs.\nEarlier this year, Germany partially legalized the recreational use of cannabis, but prosecutors said Thursday's action was proof authorities were still pursuing illegal cannabis growth.\n\"Organized crime can still be very successful financially with the organized illegal cultivation of cannabis.", "location": "Osnabrück", "classification": "security", "score": 0.6427016613718333, "event_breakdown": "Police conducted raids on properties connected to organized drug trafficking in the western German states of Lower Saxony and North Rhine-Westphalia. Police in Osnabrück, Lower Saxony, said they also busted a drug trafficking gang with links to the far-right \"Reichsbürger\" movement."}, {"id": "5d26cbf4-90da-4d86-9da2-c29e08d97601", "title": "Robert Clive survived gunshot at the battle for Samayapuram", "date": "2024-06-13 19:15", "url": "https://www.thehindu.com/news/national/tamil-nadu/robert-clive-survived-gunshot-at-the-battle-for-samayapuram/article68286775.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "The third incident took place in 1752 at the Mariamman temple at Samayapuram in Tiruchi, where a fierce battle took place between the British and the French.\nRobert Clive was wounded in two places.\nThe ball missed Clive, but the two sergeants fell mortally wounded,” Hemingway writes.\nThe battle at Samayapuram also bears testimony to the fighting spirit of Clive.\nClive, who was sent to Samayapuram to intercept any French reinforcement from Pondicherry, was unaware as he was sleeping in a choultry when the French launched the attack.", "location": "Samayapuram", "classification": "security", "score": 0.962019058006974, "event_breakdown": "The third incident took place in 1752 at the Mariamman temple at Samayapuram in Tiruchi, where a fierce battle took place between the British and the French. \nRobert Clive was wounded in two places.\nThe ball missed Clive, but the two sergeants fell mortally wounded,' Hemingway writes.\nThe battle at Samayapuram also bears testimony to the fighting spirit of Clive.\nClive, who was sent to Samayapuram to intercept any French reinforcement from Pondicherry, was unaware as he was sleeping in a choultry when the French launched the attack."}, {"id": "3f247473-b8c1-4be4-a3b6-26a5a268a03f", "title": "Battles rage in Rafah after US says Gaza truce still possible", "date": "2024-06-13 17:00", "url": "https://www.al-monitor.com/originals/2024/06/battles-rage-rafah-after-us-says-gaza-truce-still-possible", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 13, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israeli helicopters struck Gaza's Rafah Thursday, residents said, with militants reporting street battles in the southern city as US President Joe Biden called Hamas the \"biggest hang-up\" to another truce.\nHamas said its fighters were battling Israeli troops on the streets of the city near the besieged Gaza Strip's border with Egypt.\nIn Italy at a G7 summit, Biden called Hamas \"the biggest hang-up so far\" to a deal on a Gaza truce and hostage release.\nFallout from the Gaza war is regularly felt on the Israeli-Lebanon frontier, where deadly cross-border exchanges have escalated.\nThe Israeli military said most launches had been intercepted while others ignited fires.", "location": "GAZA STRIP", "classification": "security", "score": 0.5565388224573997, "event_breakdown": "Israeli military jets strike \"Palestinian military sites\" in the Gaza Strip in response to incendiary balloons launched from Gaza into Israel.\nMilitants battled Israeli troops in the southern Palestinian city of Rafah, reportedly claiming control of many streets, as US President Joe Biden said Hamas has been the \"biggest hang-up\" to reaching a truce and end to this round of conflict that began over the weekend.\nThe Israeli military launched several \"wide-scale\" airstrikes on the Gaza Strip in retaliation for more than two dozen incendiary balloons launched from the besieged Palestinian enclave."}, {"id": "6c6ad767-c24a-4453-b306-939282beccaa", "title": "19 - year - old faces slew of charges in connection to Cambridge double shooting , DA says", "date": "2024-06-13 18:15", "url": "https://www.yahoo.com/news/19-old-faces-slew-charges-171908384.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "19-year-old faces slew of charges in connection to Cambridge double shooting, DA saysA second suspect was arrested in connection to a May shooting that injured two people at a Cambridge park.\nThe 22-year-old woman was believed to have been hit by a stray bullet fired from either Battle or Cruceta.\nThe shooting remains under investigation and anyone with any information related to this incident, including home surveillance or dashcam video, is strongly encouraged to call Cambridge Police.\nCPD Investigation Update: Middlesex DA Marian Ryan and Cambridge Police Commissioner Christine Elow have announced that a second suspect has been charged in connection with the May 23, 2024, double shooting in the area of Donnelly Field.\nRead more: https://t.co/vbICy8jImz https://t.co/l3tGZ4ny8L — Cambridge Police Department (@CambridgePolice) June 13, 2024This is a developing story.", "location": "Cambridge", "classification": "security", "score": 0.93473175365422, "event_breakdown": "It turns out that no relevant events were found in the given time frame."}]