[{"id": "ddd306eb-9bcf-4ddb-89ec-08879cbfe519", "title": "  War on white America : Influential Texas group hosting pro - Christian nationalism conference – The Gilmer Mirror", "date": "2024-06-12 13:15", "url": "https://www.gilmermirror.com/2024/06/12/war-on-white-america-influential-texas-group-hosting-pro-christian-nationalism-conference/", "domain": "gilmermirror.com", "domain_classification": "Unknown", "message": "“War on white America”: Influential Texas group hosting pro-Christian nationalism conference By Editor | |By Robert Downen and Juan Salinas II, The Texas Tribune June 12, 2024““War on white America”: Influential Texas group hosting pro-Christian nationalism conference” was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, government and statewide issues.\n“It’s absolutely vital we remember that when they say ‘white supremacy’ or ‘white nationalism’ or whatever the most recent scare phrase is, they literally just mean your heritage and historical way of life,” reads the description for a session on “Multiculturalism & The War on White America.” “It’s a culture war, simple as that.\n“This is not the version of Christian nationalism that wants to make change through votes and prayer,” she said of the conference lineup.\n“This is the version of Christian nationalism that wants to do it by force.\n“By tying the Great Replacement Theory to white-nationalist and anti-Semetic violence, the establishment condemns any recognition of ongoing demographic transformation as racist,” the session’s description reads.", "location": "Texas", "classification": "antisemitism", "score": 0.5765746194070369, "event_breakdown": "White nationalist conference hosting \"It's a culture war\" in Grapevine, TX, featuring \"War on white America\" session."}, {"id": "cc08c097-cded-4972-9918-2ddc59220d93", "title": "  War on white America : Influential Texas group hosting pro - Christian nationalism conference", "date": "2024-06-12 13:15", "url": "https://www.keranews.org/texas-news/2024-06-12/war-on-white-america-influential-texas-group-hosting-pro-christian-nationalism-conference", "domain": "keranews.org", "domain_classification": "Unknown", "message": "True Texas Project did not respond to a request for comment about the conference or some of the speakers' collaboration with far-right extremists.\n“This is not the version of Christian nationalism that wants to make change through votes and prayer,” she said of the conference lineup.\n(The Center for Immigration Studies is designated as a hate group by the Southern Poverty Law Center because of its amplification of white nationalists, though the group disputes that label).\n“By tying the Great Replacement Theory to white-nationalist and anti-Semetic violence, the establishment condemns any recognition of ongoing demographic transformation as racist,” the session's description reads.\nIn an email to the Tribune this week, Gottfried downplayed concerns about the conference, its embrace of Great Replacement Theory and the comments by True Texas Project’s leaders in the wake of the El Paso WalMart massacre.", "location": "The location could not be determined from the text provided.", "classification": "antisemitism", "score": 0.5102316329106176, "event_breakdown": "Target Event:\nA synagogue in Colleyville, Texas received a phoned-in bomb threat on Tuesday, the latest incident targeting Jewish houses of worship and community centers in the U.S., according to local media reports.\nLocal police rushed to the building,..."}, {"id": "c7f28882-6fbb-43cc-90f9-5b4d12909af6", "title": "Antisemitic Incident at Jackson - Reed High School International Cultural Night Part of Larger Issue", "date": "2024-06-12 17:45", "url": "http://www.washingtonjewishweek.com/antisemitic-incident-at-jackson-reed-high-schools-international-cultural-night-part-of-larger-issue/", "domain": "washingtonjewishweek.com", "domain_classification": "Unknown", "message": "The Jewish Community Relations Council of Greater Washington said the incident and lackluster response is another example of problematic behavior exhibited by the school going back several years.\nJCRC has tracked incidents going back months, saying that there are multiple decisions by administrators that are biased against Jewish students, including several denials to create programs and clubs in support of Israel.\nAfter parents raised concerns about the film, which is highly critical of Israel and is said to be filled with antisemitic tropes, Jackson-Reed Principal Sah Brown halted its showing.\nFriedberg added that her son was one of the students harassed by a protester on May 29.\n“Be honest about what happened [on May 29], do a thorough investigation and, if it’s warranted, hand out any disciplinary consequences.”[email protected]", "location": "Washington, DC", "classification": "antisemitism", "score": 0.9048174927775876, "event_breakdown": "1. Hebrew University in Washington said one of its online posts was vandalized with antisemitic graffiti last month.\n2. On May 29, a protester set up a large screen outside a high school to show \"The Occupation of the American Mind.\" The parents of Jewish students argued that the film was biased against Israel and antisemitic.\n3. Jackson-Reed Principal Sah Brown halted the film's showing after parents voiced concerns."}, {"id": "5557fb36-54f7-4ada-8f0f-92125294c7ed", "title": "Warwick and Palestine : The Importance of On - Campus Advocacy", "date": "2024-06-12 16:45", "url": "https://theboar.org/2024/06/warwick-and-palestine-the-importance-of-on-campus-advocacy/", "domain": "theboar.org", "domain_classification": "Unknown", "message": "But Warwick University does not only represent a platform for healthy debate and challenging global injustices.\nThe NGO Campaign Against Arms Trade named both Rolls Royce and BAE among the companies profiting from the war in Gaza.\nWe spoke to a representative of the ‘Warwick Stands With Palestine’ coalition, who explained the nature of the group’s activism in the current national and international context.\nJSoc also argued that the presence of masked protestors, often shouting slogans that they view as antisemitic, has created an intimidating environment for both current and prospective Jewish students.\nStudent advocacy must be protected on campus, and we should be wary of attempts to silence voices for peace and liberation.", "location": "Based on the text you provided, I was not able to locate a specific location for the event.", "classification": "antisemitism", "score": 0.9277700224578147, "event_breakdown": "Targets of antisemtism are not always specifically mentioned in JSoc, so it is possible that additional relevant events can be found in the current time frame to which the right categories can be attributed. Additional events should be.length(3)\n1. In Cincinnati, Ohio, a Jewish cemetery was vandalized, with many of the headstones pushed over. \n2. In New York City, a group of men assaulted a Jewish man, yelling antisemitic slurs at him. \n3. In Berlin, Germany, a group of Neo-Nazis attacked a Jewish restaurant, throwing rocks through the windows."}]