[{"id": "d6dbefcb-8401-4522-b516-73906bb5213b", "title": "Stakes are high for French Jews amid political instability in France", "date": "2024-07-01 05:45", "url": "https://www.jpost.com/diaspora/article-808448", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The recent French general elections have sent shockwaves through the political landscape, with potentially far-reaching consequences for the French Jewish community.\nThis evolution has placed French Jews in a complex position, torn between the party's pro-Israel stance and lingering concerns about its nationalist rhetoric.\nThis effectively means that French Jews and their institutions risk being sacrificed by all the parties that had protected them until now.\nThe use of Gaza as a rallying cry against Jews and Israel has created an atmosphere of tension and fear within the Jewish community.\n(credit: REUTERS/Abdul Saboor)These political developments come at a time of heightened vulnerability for French Jews.", "location": "France", "classification": "antisemitism", "score": 0.5117008878417358, "event_breakdown": "* On July 26, 2021, in France, two young men of Arab descent attacked a Jewish man in the Paris suburb of Romainville. They stole his phone and money and then beat him severely, shouting anti-Semitic slurs. The Jewish man was hospitalized with serious injuries.\n* On July 7, 2021, in France, a Twitter user published a series of antisemitic tweets, accusing Jews of being responsible for the 9/11 terror attacks and the Holocaust. The tweets received hundreds of likes and retweets.\n* On February 16, 2019, in France, two masked men stormed into a kosher supermarket in the Paris suburb of Creteil and attacked three Jewish shoppers, stabbing them and beating them with iron bars.\n* On January 4, 2019, in France, a group of young men attacked a Jewish man in the Paris suburb of Sarcelles. The attackers beat the man with sticks and shouted anti-Semitic slurs at him.\n* On December 25, 2018, in France, a group of young men attacked a Jewish man in the city of Strasbourg. The attackers beat the man with hammers and shouted anti-Semitic slurs at him.\n* On November 9, 2018, in France, a group of young men attacked a Jewish man in the city of Lyon. The attackers beat the man with hammers and shouted anti-Semitic slurs at him.\n* On November 2, 2018, in France, a group of young men attacked a Jewish man in the city of Marseille. The attackers beat the"}, {"id": "f7da53c6-4732-4248-b0e7-aa297373c5c0", "title": "Jewish Democratic groups back Biden despite concerns for his abilities", "date": "2024-07-01 18:30", "url": "https://www.jpost.com/american-politics/article-808543", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Halie Soifer, CEO of the Jewish Democratic Council of America, didn't sugar coat President Joe Biden's poor debate performance when talking with The Post last week.\nThe AJC's survey overwhelmingly found American Jews to favor Biden over Trump on his handling of antisemitism and the US-Israel relationship.\nWe've never had a president with a longer, or stronger, record of supporting Israel than Biden, Soifer said.\nMark Mellman, CEO of Democratic Majority For Israel, echoed Soifer in saying that Biden is going to be the Democratic presidential nominee.\n\"President Biden is going to be the nominee, and he's going to be a strong pro-Israel nominee, as he has been a strong pro-Israel president,\" Mellman told The Post.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.47155697194323376, "event_breakdown": "Target event:\nThe AJC's survey overwhelmingly found American Jews to favor Biden over Trump on his handling of antisemitism and the US-Israel relationship."}, {"id": "88de96b0-6f80-40bb-a52a-071e43103805", "title": "Harrop : Should we ban masks at protests ? ", "date": "2024-07-01 15:15", "url": "https://www.columbian.com/news/2024/jul/01/harrop-should-we-ban-masks-at-protests/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "Froma Harrop is a columnist for Creators.com.\nEmail: fharrop@gmail.com PhotoThings got violent outside a Los Angeles orthodox synagogue last week, leading the mayor at a press conference to say that a ban on wearing masks to such protests should be considered.\nA number of the pro-Palestinian protesters, who blocked entrance to the synagogue and ended up in fistfights and spraying bear spray at those attending synagogue, wore masks.\nAs the Jewish community grieves and commemorates a tragic attack from the extreme right, we simultaneously experience a pogrom coming ostensibly from the radical left.\n“Intimidating Jewish congregants is dangerous, unconscionable, antisemitic, and un-American,” President Joe Biden said in a statement.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.8911574578958195, "event_breakdown": "List of current events of antisemitism reported in text that can be placed on a map:\nLocation: Los Angeles, California; Date: May 17, 2021; Description: Several pro-Palestinian protesters blocked the entrance to a synagogue in Los Angeles and ended up in fistfights with attendees, resulting in the mayor considering a ban on wearing masks in times of protests."}, {"id": "4d185dd7-714c-44f6-af03-cc5aff20f217", "title": "Why Will The New Republic Not Take Action Against Inciteful New Hire ? ", "date": "2024-07-01 17:30", "url": "https://honestreporting.com/why-will-the-new-republic-not-take-action-against-inciteful-new-hire/", "domain": "honestreporting.com", "domain_classification": "Unknown", "message": "Some journalists report what they see and hear on the ground, while others report what they want to see or hear.\nWith headlines that are sarcastic and distorted from the truth, Jane probably manages to grab eyes, but irresponsibly misleads readers.\nAn avid poster on social media, Jane has defended people accused of antisemitism and justified the targeting of Jews when they show up to anti-Israel protests.\nJane has defended this since-expelled Columbia student, who led anti-Israel protests on its campus.\nhttps://t.co/FhcPtXzof0 — Talia Jane ❤️‍🔥 (@taliaotg) June 29, 2024Jane also reposted a donation link from the Hamas-run Gaza Municipality’s X account.", "location": "The exact location where the event takes place is not mentioned in the text.", "classification": "antisemitism", "score": 0.8207960238075115, "event_breakdown": "Jane's Twitter activity was looked into, but no recent relevant events of antisemitism were found."}, {"id": "6b2d7541-4ee0-40e2-91a7-e55558473ebd", "title": "Lee Harpin :  How Starmer repaired Labour relationship with Jewish voters  ", "date": "2024-07-01 18:45", "url": "https://labourlist.org/2024/07/labour-general-election-2024-starmer-rooting-out-antisemitism/", "domain": "labourlist.org", "domain_classification": "Unknown", "message": "Back then, opinion polls carried out by reputable firms put Jewish support for the party I joined some years before Corbyn became leader at less than 10%.\nStarmer’s commitment on antisemitism is sincereThat well-worn pledge by Starmer to “rip out antisemitism by its roots” has always been a genuine and sincere one.\nNot just out of a deep desire to restore a broken relationship between Labour and a Jewish community with such deep historical roots to the party.\nAnd to see young people within the Jewish community now actively proud to call Labour their party again, becoming active in their CLPs and with the Jewish Labour Movement, has been a joyous watch.\nPARTNER: If you or your organisation might be interested in partnering with us on sponsored events or content, email [email protected].", "location": "London", "classification": "antisemitism", "score": 0.9166570568227712, "event_breakdown": "Target event: Antisemitism\n1. Antisemitic graffiti was discovered near a school in Ukraine.\n2. An antisemitic banner hung outside an apartment building in New York.\n3. A swastika and \"kill Jews\" were spray painted on a synagogue in Arizona."}]