[{"id": "b101a5f6-7873-46e8-a7ce-f60c72b104b5", "title": "Pentagon admits killing a shepherd with a Hellfire missile in Syria in botched drone strike after mistaking him for a senior Al Qaeda leader", "date": "2024-05-02 18:15", "url": "https://www.dailymail.co.uk/news/article-13376575/pentagon-drone-strike-syria-al-qaeda-shepherd-death.html", "message": "A botched U.S. drone strike in Syria killed a shepherd last year after he was mistakenly identified as a senior Al Qaeda operative.\nThe Pentagon has admitted a civilian and not a terrorist leader was slain on May 3, 2023 after an internal Central Command (CENTCOM) investigation.\nThe victim has since been 56-year-old father-of-10 Lufti Hasan Masto, who was killed while he was tending to his sheep.\nA MQ-9 predator drone was tracking his movements in fields around his home in the rural town of Qorqanya when a Hellfire missile was fired in his direction.\nCENTCOM 'determined U.S. forces misidentified the intended Al Qaeda target and that a civilian, Mr. Lufti Hasan Masto (Masto), was struck and killed instead'.", "location": "Qorqanya", "classification": "security", "score": 0.9847305783547525, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "c51e8bff-34cb-438c-88ec-58247340a633", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated.", "location": "Syria", "classification": "security", "score": 0.9311538199665129, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "be3c48fa-aa37-480f-8d53-c0ea063c1f66", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.yahoo.com/news/u-central-command-finds-2023-184350267.html", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nFile Photo by Bonnie Cash/UPIMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"\nThe strike investigation, conducted by Army Brigadier General John P. Cogbill, wrapped up Nov. 15, 2023.", "location": "Syria", "classification": "security", "score": 0.8860074744325478, "event_breakdown": "- A U.S. airstrike in Syria on May 3, 2023, intended for a senior Al Qaeda leader resulted in the accidental killing of civilian Lufti Hasan Masto.\n- The investigation into the strike, led by Army Brigadier General John P. Cogbill, concluded on November 15, 2023."}, {"id": "3e3bbe7d-9882-4acb-a3ce-f4a534508f6c", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/02/CENTCOM-Syria-strike-civilian-killed/1701714674364/", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nCENTCOM said it is fully engaged in implementing Defense Secretary Lloyd Austin's (pictured) Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes.\nFile Photo by Bonnie Cash/UPI | License PhotoMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"", "location": "Syria", "classification": "security", "score": 0.8318856970406131, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "8da7a4c8-d1c5-4faa-8077-67f35cdd3a79", "title": "Ukraine - Russia war latest :  Huge fire breaks out  in port city after missile strike ; Russia  shifting battlefield focus  ", "date": "2024-05-02 00:45", "url": "https://news.sky.com/story/ukraine-russia-war-latest-huge-fire-breaks-out-in-port-city-after-missile-strike-russia-shifting-battlefield-focus-12541713", "message": "Russia threatens Denmark with 'retaliation' if it blocks vesselsMore now from Russian foreign ministry spokeswoman Maria Zakharova, who has been speaking to journalists this afternoon.\nShe has said any move by Denmark to restrict the freedom of navigation of Russian ships in the Baltic straits will be seen as a hostile act and draw retaliation.\nIt is unclear exactly what prompted the threat, but we'll bring you any more detail as we get it.\nDenmark has played down suggestions it will begin checking Russian tankers moving through its waters to establish whether they have the correct documentation.\nAnd the Danish Maritime Authority said in a statement in March that a tanker from Russia's shadow fleet was involved in a collision near Denmark.", "location": "Baltic straits", "classification": "security", "score": 0.4416245681212148, "event_breakdown": "- Russia threatens Denmark with 'retaliation' if it blocks vessels in the Baltic straits\n- Danish authorities play down suggestions of checking Russian tankers for documentation\n- Collision involving a tanker from Russia's shadow fleet near Denmark"}, {"id": "8bc6b0d7-8e0c-4d5c-81a4-ad1117c6097f", "title": "U . S . military concludes airstrike in Syria last May killed a civilian , not a terrorist", "date": "2024-05-02 16:30", "url": "https://www.cbsnews.com/news/airstrike-syria-may-2023-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThen, reports quickly surfaced that the strike had killed a civilian, not a terrorist.\nIn a tweet on May 3, the same day as the strike, a group known as \"The White Helmets\" who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported.", "location": "Northwestern Syria", "classification": "security", "score": 0.899100334097146, "event_breakdown": "- A U.S. airstrike in northwestern Syria last May initially claimed to have killed a senior al Qaeda leader.\n- The U.S. military concluded that the airstrike actually killed a civilian, not a terrorist.\n- Reports emerged indicating that the strike had killed a civilian rather than a terrorist.\n- \"The White Helmets\" group identified the civilian killed in the strike as Masto in a tweet on May 3, the same day as the strike.\n- According to The White Helmets, Masto was grazing sheep when the strike occurred, resulting in both his death and the death of several sheep.\n- Defense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan in response to media reports revealing that U.S. military operations in Syria, Iraq, and Afghanistan had caused more civilian casualties than originally reported."}, {"id": "344ce694-953e-42cf-8aa8-0fbd6b130eb1", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "d2a37c8c-72d9-43f7-9dca-6ac236e3478f", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6023448210491533, "event_breakdown": "- U.S. airstrike in Syria targeting an al-Qaida leader in May 2023 resulted in the death of an innocent civilian instead\n- Confirmation of the civilian casualty by U.S. Central Command following initial reports from residents and family members\n- Completion of investigation into the airstrike last November, with the findings made public on Thursday\n- Implementation of a detailed investigation and review process for strikes involving allegations of civilian casualties\n- U.S. continuing to target al-Qaida and Islamic State leaders in Syria, citing the 2017 airstrike that killed Abu al-Kheir al-Masri"}, {"id": "1b15c118-b524-48a9-aed4-9f55726d359e", "title": "US drone strike in Syria killed civilian not terrorist leader , Pentagon probe finds", "date": "2024-05-02 20:30", "url": "https://www.stripes.com/theaters/us/2024-05-02/drone-strike-syria-terrorist-civilian-killed-military-13732627.html", "message": "(X)A U.S. military drone strike last year that targeted a top al-Qaida leader in Syria killed a civilian instead, the Pentagon admitted Thursday.\n“We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\nAfter initially expressing confidence that the strike killed its intended target — whose name was never made public — Pentagon officials by mid-May told reporters that they were no longer certain the strike killed a terrorist.\n“The protection of civilians is a strategic priority as well as a moral imperative,” Austin wrote in his 2022 civilian harm mitigation plan.\n“Our efforts to mitigate and respond to civilian harm directly reflect our values and also directly contribute to achieving mission success.”", "location": "Syria", "classification": "security", "score": 0.798536788915954, "event_breakdown": "- A U.S. military drone strike in Syria targeted a top al-Qaida leader but killed a civilian instead\n- Pentagon officials admitted the mistake in targeting and clarified their commitment to minimizing civilian harm\n- Pentagon officials expressed uncertainty about whether the strike successfully killed the intended terrorist target\n- Secretary of Defense Lloyd Austin emphasized the importance of protecting civilians in military operations and outlined civilian harm mitigation efforts for 2022"}, {"id": "b771a138-81ff-4ade-ac07-4b1d2358d034", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Khuzdar, Pakistan", "classification": "security", "score": 0.982317040954408, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "1ced7d19-b541-4d93-8f1f-e6013eff6f15", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Syrian defense ministry claimed eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\n- The strike caused \"material losses\" according to The Times of Israel citing Syrian state-run broadcaster.\n- Israeli warplanes launched missiles from over the Golan Heights at a site near the capital, as reported by the Syrian defense ministry and the Syrian Arab News Agency. \n- Russian state media TASS quoted Dubai-based Al Hadath TV saying the attack targeted a Hezbollah base southwest of Damascus International Airport.\n- There was no official confirmation from Israeli authorities on the reported reprisal strike."}, {"id": "d374d95b-7196-41c8-b601-c953f7436e64", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "null"}, {"id": "67621dea-fd5a-48ab-9e18-394c9c1fd6ab", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 01:45", "url": "https://www.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "ca64b60d-53b8-4bdd-9f2b-3fa27a75c5b0", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 02:00", "url": "https://us.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "78c5d253-047a-4a8a-8fb7-99b10cc853bf", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 05:00", "url": "https://edition.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "- Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city\n- Two young children killed and several people injured\n- Um Rami spoke to her daughter about putting her kids to bed after playing with neighbors and having dinner\n- Children were Um Rami's first grandchildren\n- Um Rami mentioned being displaced multiple times by the Israeli military\n- Aunt Maram Abu-Shalab stated that the Israeli military struck the home without warning"}, {"id": "b323381d-9839-46d0-9b38-3e966c98f369", "title": "1 killed , 3 injured in Israeli strikes on Lebanese villages", "date": "2024-05-01 22:15", "url": "https://www.prokerala.com/news/articles/a1527609.html", "message": "Beirut, May 2 : A Hezbollah fighter was killed and three civilians were injured in Israeli airstrikes on Lebanese villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Wednesday that an Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter inside the house, Xinhua news agency reported.\nAccording to the sources, another airstrike targeted the southeast village of Adaysseh, wounding three civilians.\nThe military sources added that Israeli warplanes carried out on Wednesday a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 445 people on the Lebanese side, according to Lebanese security sources.", "location": "Tayr Harfa", "classification": "security", "score": 0.9841721306046511, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "7ab4b5c0-ef15-4a65-b0da-6765530e6d0c", "title": "Russo - Ukraine War - 01 May 2024", "date": "2024-05-02 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-01.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nDuring the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7x concentrations of Russian troops.", "location": "Kharkiv", "classification": "security", "score": 0.6041034177583948, "event_breakdown": "- Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia on 24 February 2022\n- Russian forces launched air strikes in the vicinities of Vodolahy, Yamne, Vesele, Kharkiv, Vovchans\\'k \n- Russian forces fired artillery and mortars at more than 10 settlements, including Makiivka, Nevs\\'ke, Terny, Yampolivka\n- Ukrainian Air Force launched air strikes on 1 command post and 7 concentrations of Russian troops on May 1"}, {"id": "b6bf4b36-0bef-48d4-9e3a-42572741c083", "title": "Russia breached global chemical weapons ban in Ukraine war , US says - New Delhi Times - India Only International Newspaper", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russia-breached-global-chemical-weapons-ban-in-ukraine-war-us-says/", "message": "The United States accused Russia on Wednesday of breaching a global chemical weapons ban by deploying the choking agent chloropicrin against Ukrainian troops.\nThe State Department also accused Russia of using riot control agents “as a method of warfare” in Ukraine.\nAdditionally, Russian forces have used grenades loaded with CS and CN gases, according to the Ukrainian military.\nA guided bomb attack killed two civilians, including a 38-year-old woman and her father, Kharkiv regional Governor Oleh Syniehubov said.\nRussia’s defense ministry said Wednesday that it thwarted Ukrainian drone attacks targeting several Russian regions.", "location": "Kharkiv", "classification": "security", "score": 0.5130149429885166, "event_breakdown": "- The United States accuses Russia of using chloropicrin against Ukrainian troops\n- The State Department accuses Russia of using riot control agents in Ukraine\n- Russian forces allegedly used grenades loaded with CS and CN gases\n- A guided bomb attack kills two civilians in Kharkiv region\n- Russia's defense ministry claims to have thwarted Ukrainian drone attacks"}, {"id": "1b230deb-1ec4-4929-9427-94d71bc6c7f6", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "30e1efb6-b787-4040-b871-9fe2ca1f43a4", "title": "Three terrorists killed in Tank operation", "date": "2024-05-02 15:00", "url": "https://tribune.com.pk/story/2464897/three-terrorists-killed-in-tank-operation", "message": "Security forces on Thursday killed three terrorists during a joint intelligence-based operation (IBO) in Khyber-Pakhtunkhwa’s Tank district, the military said in a statement.\nAccording to the Inter-Services Public Relations (ISPR), during the operation, following a fierce exchange of gunfire, security forces successfully neutralised three terrorists, including ringleaders Azmat alias Azmati, Karamat alias Hanzla, and terrorist Rehan.\nThe slain militants remained “actively involved” in several terrorist activities in the area, including the recent abduction of a district and sessions judge of South Waziristan district, the military’s media wing stated.\nIt further asserted that the security forces remain determined to eliminate the menace of terrorism from the country.\nRead more: At least four terrorists killed in Tank IBOHe returned home safely, the Counter-Terrorism Department (CTD) confirmed on Monday.", "location": "Khyber-Pakhtunkhwa’s Tank district", "classification": "security", "score": 0.9552469463617089, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "0a9f119d-fbef-4914-8279-27ba4df5ef76", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240502-voa01.htm", "message": "Russian missile attack injures 14 in OdesaBy VOA News May 02, 2024Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.7993261792230087, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "171ce22e-9aaa-480f-abdc-9f883ece456f", "title": "Russia Shows Off NATO Military Equipment Taken From Ukraine", "date": "2024-05-01 21:30", "url": "https://www.shtfplan.com/headline-news/russia-shows-off-nato-military-equipment-taken-from-ukraine", "message": "Russian crowds are getting to see a new exhibition in Moscow of NATO (North Atlantic Treaty Organization) military hardware that was captured by Russian forces in Ukraine.\nThe display shows off a whole lot of “trophies,” ranging from United States-made armored fighting vehicles to state-of-the-art tanks and European armored personnel carriers.\nThe military equipment has come from 12 countries including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\nRussia Has Destroyed 1/3 Of U.S.\nRussia is advancing and making mincemeat of the equipment sent to Kiev by the West.", "location": "Moscow", "classification": "security", "score": 0.557853972490328, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "81110311-f691-4b29-9254-5336f8302d89", "title": "Odesa Currently Seen As Key Target For Russian Strikes Air Force", "date": "2024-05-01 15:15", "url": "https://menafn.com/1108160426/Odesa-Currently-Seen-As-Key-Target-For-Russian-Strikes-Air-Force", "message": "(MENAFN- UkrinForm) The Russians have now picked the city of Odesa as the key target for their strikes.\nOvernight Wednesday, they attacked densely populated areas with three Iskander-M ballistic missiles.\nThat's according to a spokesperson for Ukraine's Air Force Ilia Yevlash, who spoke on the air of the national telethon, Ukrinform reports.\nThis is another manifestation of the bloodthirsty face of Russian terror.\nLate Tuesday night, Russian ballistic missiles hit Odesa again, killing three.", "location": "ODESA", "classification": "security", "score": 0.6152281997442713, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "3a778d5c-dd27-4fd5-a4d4-1db0714a8e5c", "title": "Likely missile attack by Yemen Houthi rebels targets ... ", "date": "2024-05-01 22:00", "url": "https://accesswdun.com/article/2024/4/1240028", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Mokha, Yemen", "classification": "security", "score": 0.7051436875164441, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "6774f3d3-cbf9-489f-b673-38a178e2911a", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14 – Winnipeg Free Press", "date": "2024-05-02 10:15", "url": "https://www.winnipegfreepress.com/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14", "message": "KYIV, Ukraine (AP) — The situation on the front line in eastern Ukraine is worsening but local defenders are so far holding firm against a concerted push by Russia’s bigger and better-equipped forces, a senior Ukrainian military official said Thursday.\n(Ukrainian Emergency Service via AP)Russia has pushed Ukraine onto the back foot on the battlefield as Kyiv grapples with shortages of troops and ammunition.\nUkrainian forces are now racing to build more defensive fortifications at places along the around 1,000-kilometer (600-mile) front line.\nUkraine’s difficulties have been deepening for months as the military waited for vital new military aid from the United States.\n‘’I’m not ruling anything out, because we are facing someone who is not ruling anything out,’’ he told the Economist, referring to Russian President Vladimir Putin.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.4373951667307425, "event_breakdown": "1. The situation on the front line in eastern Ukraine is worsening, with local defenders holding firm against a push by Russia’s forces in Kyiv, Ukraine.\n2. Russia has pushed Ukraine onto the back foot on the battlefield, leading to shortages of troops and ammunition.\n3. Ukrainian forces are rushing to build more defensive fortifications along the around 1,000-kilometer front line.\n4. Ukraine's military has been waiting for vital new military aid from the United States as their difficulties deepened over months.\n5. A senior Ukrainian military official expressed concerns about the escalating situation, stating that they are facing an adversary who is not ruling out any actions."}, {"id": "9acac758-c034-46da-9a25-ef8cc39c7368", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel - LocalNews8 . com", "date": "2024-05-01 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "The main location where the main event takes place is western Tehran.", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "- Iran displays missiles and drones used in its first-ever direct attack on Israel from Iranian soil at the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran.\n- The attack on Israel included drones, ballistic missiles, and cruise missiles.\n- IDF spokesperson Daniel Hagari confirms ballistic missiles caused only light structural damage, falling on an airbase in Israel.\n- Belali states that NATO, the United States, and Arab countries failed to create barriers for Iran's drones, missiles, and cruise missiles."}, {"id": "75a9a4a5-7561-43a2-a0e4-16f03e779ebc", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "Abdirisaq Shino Shares 70TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "Taleex district", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashes in Somalia's Sool region\n- Residents of Taleex district hear a loud explosion and discover wreckage resembling an Iranian Quds land-attack cruise missile\n- No group claims responsibility for the cruise missile launch\n- CENTCOM releases a statement regarding the incident\n- No casualties reported in Somalia from the failed cruise missile strike"}, {"id": "fd7988bd-446c-4424-acfa-6cbd17e9177c", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "9a5bf8a9-4670-459e-975e-b0a600023e9b", "title": "When Tony Blair Bombed Montenegro", "date": "2024-05-02 19:45", "url": "https://consortiumnews.com/2024/05/02/when-tony-blair-bombed-montenegro/", "message": "It came amid airstrikes on Yugoslav forces in Kosovo, where Bill Clinton and Tony Blair waged a “humanitarian intervention” ostensibly to save ethnic Albanians from Serb leader Slobodan Milosevic.\nApproving Air StrikesThe Atlantic alliance did not specify which of its members had taken part in the air strikes on Montenegro at the time.\nSuch secrecy would become a common feature of future NATO air wars, making it hard for victims to hold individual states responsible.\nBut a formerly classified document reveals that Britain was heavily involved in the April 29, 1999 attack on Montenegro.\na decade on from the Kosovo war.", "location": "Montenegro", "classification": "security", "score": 0.46164487329001025, "event_breakdown": "- Airstrikes carried out on Yugoslav forces in Kosovo by Bill Clinton and Tony Blair for a humanitarian intervention\n- Approval of the airstrikes by the Atlantic alliance without specifying participating members\n- Secrecy surrounding NATO air wars making it difficult for victims to hold individual states responsible\n- Revelation of Britain's heavy involvement in the April 29, 1999 attack on Montenegro\n- Events occurring a decade after the Kosovo war"}, {"id": "cd3f7a4b-68d8-40b5-b8ba-ab438f537cb1", "title": "Russian missile attack injures 14 in Odesa - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russian-missile-attack-injures-14-in-odesa/", "message": "Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "ODESA", "classification": "security", "score": 0.8121557017618638, "event_breakdown": "- Russian missile attack injures 14 people at a postal facility in Odesa, Ukraine\n- Ukrainian officials condemn the attack as a crime against Ukrainian civilians\n- Ukrainian drones attempt to attack an energy facility in Smolensk\n- Russian forces down a Ukrainian drone in the Kursk region, damaging power lines\n- Ukrainian military reports Russian forces using grenades loaded with CS and CN tear gases"}, {"id": "e87a1b35-7d63-4d68-9443-7e12ed17132d", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel", "date": "2024-05-01 18:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "TEHRAN", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "5b90f4a6-2d32-4413-ae22-35576efbb38f", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month.", "location": "Gaza", "classification": "security", "score": 0.7677629001437708, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "550e44a9-0443-4cbe-bce1-5a486195c8cb", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged.", "location": "Leningrad region", "classification": "security", "score": 0.4280794057909932, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "c612cf8a-3a30-4d17-b904-95dd0745e186", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-02 15:30", "url": "https://www.naharnet.com:443/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "Odesa", "classification": "security", "score": 0.8647478397809565, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "410419a9-9565-4999-b863-2c3e7f6c4806", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-03 08:45", "url": "https://naharnet.com/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "Odesa", "classification": "security", "score": 0.8647478397809565, "event_breakdown": "- Russia struck the southern Ukrainian port city of Odesa with ballistic missiles, injuring 14 people and causing a massive blaze.\n- The third attack on Odesa hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\n- Ukraine deployed long-range drones to strike targets on Russian soil, focusing on infrastructure supporting the Russian economy and war effort.\n- Energy facilities in three Russian regions were reported damaged by Ukrainian drone strikes.\n- Russian Defense Ministry announced that Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov, and Belgorod regions."}, {"id": "555e1ee5-2a9b-4f9d-a55a-c6d28b4724eb", "title": "Russia Says Mariupol Hospital Attack  Staged  By Ukraine : World News", "date": "2024-05-02 02:45", "url": "https://www.rashtranews.com/russia-says-mariupol-hospital-attack-staged-by-ukraine-world-news/", "message": "#Russia #Mariupol #Hospital #Attack #Staged #UkraineIgor Konashenkov has stated that the Mariupol hospital was staged by Ukraine.\nMoscow, Russia:The Russian army claimed Thursday that an attack on a children’s hospital in the southeastern Ukrainian port of Mariupol, which killed three including a child and caused global outrage, was a “staged provocation” by Ukraine.\n“The Russian aviation carried out absolutely no missions to hit targets on the ground in the Mariupol area,” Russian defence ministry spokesman Igor Konashenkov said.\n“The airstrike that allegedly took place is a completely staged provocation to maintain anti-Russian hype for a Western audience,” he said.\nThe bombing of the maternity hospital resulted in three deaths, including one child, according to the city’s mayor.", "location": "Mariupol", "classification": "security", "score": 0.6824509143885954, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}]