[{"id": "02117cd8-090b-46a2-991a-7182179f94f0", "title": "Boston Police investigating  anti - American  July 4 defacement of war monuments", "date": "2024-07-06 02:00", "url": "https://www.theday.com/state/20240705/boston-police-investigating-anti-american-july-4-defacement-of-war-monuments/", "domain": "theday.com", "domain_classification": "Unknown", "message": "Boston — Boston City Councilor Ed Flynn, a U.S. Navy veteran, blasted a “disgusting” hate crime that left several monuments in the Common and Public Garden defaced with “antisemitic and anti-American” graffiti on the eve of Independence Day.\n“I do believe these are hate crimes when you target the Jewish community with horrific messages and you also target American veterans,” Flynn said.\nUpon arrival, a responding officer “observed 15 benches around the Soldiers and Sailors Monument vandalized with graffiti and it said ‘Death to Amerikkka,’” the police report states.\nThose respective messages read, “End Zionism” and “Free Gaza.”Mayor Michelle Wu said police are investigating the incident, while speaking to reporters at an unrelated event on Friday.\n“Defacing monuments that are there for honoring the sacrifices of our sailors and soldiers in this case over here, it really does nobody any good.”Adding insult to injury was the war monuments were vandalized “on the eve of the birth of our country,” Santiago said.", "location": "Boston, Massachusetts.", "classification": "antisemitism", "score": 0.8070647400475026, "event_breakdown": "Boston - A U.S. veteran blasted a “disgusting” hate crime that left several monuments in the Common and Public Garden defaced with “antisemitic and anti-American” graffiti on the eve of Independence Day."}, {"id": "ae8e497d-0138-4691-a3b4-70ca8ebda752", "title": "Extreme inequality is the real threat to free speech", "date": "2024-07-06 06:00", "url": "https://www.bangordailynews.com/2024/07/06/opinion/opinion-contributor/extreme-inequality-real-threat-free-speech-joam40zk0w/", "domain": "bangordailynews.com", "domain_classification": "Unknown", "message": "Yet, a few short years later, campus protests like these became a bete noire for right-wing politicians, who produced countless diatribes against “woke mobs” and the “free speech crisis” on campus.\nProtests have never been a threat to speech — it is free speech.\nConservative politicians who’d thrown fits over free speech on campus cheered as police officers roughed up and arrested student protesters.\nFor example, after spending a fortune to buy Twitter, billionaire Elon Musk proclaimed himself a “free speech absolutist” and promptly eliminated nearly all content moderation.\nSimilarly, when the Supreme Court rules that cash payments — even bribes — are “free speech,” those of us with less cash have less free speech.", "location": "Based on the provided context, I was unable to find a specific location for the event described.", "classification": "antisemitism", "score": 0.5306350770559777, "event_breakdown": "Here is a list of current events of antisemitism reported in text that can be placed on a map:\nEVENT: Man arrested after posting antisemitic videos\nLOCATION: Salt Lake City, Utah"}]