[{"id": "b4eaf515-1e38-48f1-ba4b-5fae92b05259", "title": "Israel used US - made bomb in deadly Rafah strike , experts say", "date": "2024-05-30 03:45", "url": "https://www.stripes.com/theaters/middle_east/2024-05-29/israel-us-made-bomb-rafah-14023186.html", "message": "MUST CREDIT: Alam Sadeq (Alam Sadeq)Four weapons experts said the Israeli military used a U.S.-made precision bomb in a strike that killed at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post.\nThe findings do not contradict Israel’s assertion that it used a small munition, weapons experts said.\nSecretary of State Antony Blinken said Wednesday that the United States couldn’t confirm what weapons were used or how they were used in the strike.\nIsrael said the attack on the encampment in Rafah was a \"targeted\" strike against two Hamas militants and employed \"the smallest munition\" Israeli fighter jets can use.\nAn Israeli military spokesman reached Wednesday said he could not comment further on the munition used or what measures were taken to prevent civilian casualties.", "location": "GAZA", "classification": "security", "score": 0.7458575222809743, "event_breakdown": "The Israeli military used a U.S.-made precision bomb to kill at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post."}, {"id": "11002ea1-ea83-4618-b4ae-e1d82395fa0f", "title": "Syria reports young girl killed 10 other people hurt in alleged", "date": "2024-05-30 02:30", "url": "https://muslimnews.co.uk/news/syria/syria-reports-young-girl-killed-10-other-people-hurt-in-alleged/", "message": "Syria’s defense ministry said an Israeli airstrike Syria reports on Wednesday killed a girl and wounded 10 civilians.\nbvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvsA war monitor said a parallel strike in the same region killed three pro-Hezbollah Syrian fighters.\nThe alleged Israeli strikes targeted “at least one military site… in the eastern countryside of Homs, causing plumes of smoke to rise,” it added.\nIt said a second strike on central Syria killed three Syrian fighters working with Lebanon’s Hezbollah group.\nAccording to Syria reports, the strike was the 42nd apparent Israeli attack on Syria since the beginning of the year.", "location": "Homs countryside", "classification": "security", "score": 0.8937192537243501, "event_breakdown": "Israeli airstrike kills girl, wounds 10 civilians in Homs, Syria\nAt least three pro-Hezbollah Syrian fighters were killed in an alleged Israeli attack on Homs, Syria"}, {"id": "114ff4b5-98ae-46e5-abc3-d02a171c3393", "title": "Woman pleads guilty to stabbing , killing cousin in 2021 in York County", "date": "2024-05-30 01:15", "url": "https://www.yahoo.com/news/woman-pleads-guilty-stabbing-killing-222058569.html", "message": "Woman pleads guilty to stabbing, killing cousin in 2021 in York CountyYORK COUNTY, Pa. (WHTM) — A woman accused of stabbing and killing a relative in York County years ago pleaded guilty Tuesday.\nNinoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed.\nYork County babysitter claimed girl ‘seduced me’ during rape investigation, police sayJoselito Pagan-Ocasio, 36, was found dead at his home at the 300 block of E. King Street in York City.\nFirst responders were dispatched for a fatality that was originally reported from a shooting but turned out to be from a stabbing.\nAn autopsy found Pagan-Ocasio died from a stab wound to the chest and the manner was ruled a homicide.", "location": "York City", "classification": "security", "score": 0.6171078221343911, "event_breakdown": "Ninoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed. The crime scene is located at the 300 block of E. King Street in York City."}, {"id": "0b1e5fa8-633f-4f11-af6f-6d3f88d50423", "title": "Chicago police shooting : Family says stabbing suspect Tracey Watson fatally shot in South Austin was defending himself from attack", "date": "2024-05-30 07:00", "url": "https://abc7chicago.com/post/south-austin-chicago-police-fatal-shooting-family-speaks-out/14889006/", "message": "Police say Tracey Watson was stabbing another man before officers ordered him to drop his weaponFamily claims man fatally shot by Chicago police in South Austin was defending himself from attackRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nChicago police say the suspect, Tracey Watson, attempted to stab a man on the street around 11 p.m. in the 300-block of South Cicero Avenue in South Austin.", "location": "CHICAGO", "classification": "security", "score": 0.9212977709487788, "event_breakdown": "Target event: A news push that reports an event that is happening in the current time frame and belongs to to the category security and that has a location of Chicago\nCurrent security events in Chicago:\nChicago police say a man was shot by officers Monday night in the 300-block of South Cicero Avenue in South Austin. According to a news release, an officer in an unmarked police car tried to pull over a Ford car for a traffic violation around 11:10 p.m. The other driver then began firing shots at the officers, police said. The officers returned fire, striking the man and driving him to a hospital where he was pronounced dead at around 11:50 p.m., the release stated."}, {"id": "b9ad0b06-7ce2-46ba-940c-6666ba84db44", "title": "Street battles , Israeli strikes rock Gaza Rafah", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815140-Street-battles,-Israeli-strikes-rock-Gaza%5C", "message": "Street battles, Israeli strikes rock Gaza's RafahWorld World Street battles, Israeli strikes rock Gaza's RafahStreet fighting and Israeli bombardment rocked Gaza's far-southern Rafah on Wednesday.\nBut fighting again flared in Rafah, where an AFP reporter said street battles raged and an Israeli helicopter fired guns and missiles at targets in the city centre.\nIn the north, Israeli military vehicles unleashed intense gunfire east of Gaza City, an AFP reporter said, while residents reported air strikes on parts of Jabalia.\nUN SECURITY COUNCILNearly eight months into the deadliest Gaza war, Israel has faced ever louder opposition, as well as cases before two Netherlands-based international courts.\nTurkish President Recep Tayyip Erdogan meanwhile hit out at the United Nations after the latest deadly Israeli strikes in Rafah.", "location": "GAZA", "classification": "security", "score": 0.7805639327275631, "event_breakdown": "Hamas-Israel fighting flares as Palestinian teen killed by Israeli gunfireClashes between Israeli forces and Palestinian militants have intensified in recent days culminating in the death of a 13-year-old Palestinian boy in the West Bank.\nIn retaliation for the boy's death, Hamas fired rockets into Israel, causing no damage.\nBut the escalations were far from over. Israel Defense Forces spokesperson Lieutenant Colonel Peter Lerner said the military had bombed a second target in the Gaza Strip.\n\"We have been attacked by rockets from Hamas. Our response is an attack on a second target in the Gaza Strip,\" Lerner said.\nIsrael first bombed a Hamas target inside the Gaza Strip. Then Israel Defense Forces (IDF) also targeted some Palestinian militants it said had been firing rockets into Israel. And the IDF warned Gaza militants not to retaliate for the attack."}, {"id": "f0323e9a-319a-4fdd-8a76-e4348610d087", "title": "Israel Launches Airstrikes Deep Into Syria - Reports Of Civilians Dead & Wounded", "date": "2024-05-30 01:30", "url": "https://www.zerohedge.com/geopolitical/israel-launches-airstrikes-deep-syria-reports-civilians-dead-wounded", "message": "Israel's military on Wednesday launched a fresh attack on targets deep inside Syria, which reportedly left civilian casualties, according to state media.\nSyrian government sources said the Israeli strike killed a girl and wounded ten civilians.\n\"Syrian air defense intercepts enemy targets in the skies of the city of Homs,\" the official SANA news agency also reported.\nIsrael was also part of this covert campaign, which saw the anti-Assad axis arm, train, and fund various al-Qaeda and jihadist groups.\nIn the initial days and weeks after Oct.7, Syria had lobbed several rockets toward the Israeli-occupied Golan Heights, which left no casualties.", "location": "Homs, Syria", "classification": "security", "score": 0.9722490989051554, "event_breakdown": "Israel strikes Syria in response to rocket fire in the Golan Heights, reportedly killing a girl and wounding ten civilians."}, {"id": "86e7c6d1-090a-483a-9c7d-e47cedb8ba84", "title": "Russia Ukraine war live : Putin - backed think tank says Kremlin should consider nuclear blast to warn West", "date": "2024-05-30 06:00", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-news-putin-nuclear-war-latest-b2553638.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package.\nIt comes as Russia fired more than 50 missiles and drones into Ukraine overnight, the Ukrainian Air Forces have claimed.\nMykola Oleschuk, commander of the air force, said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details.\nHe said they had shot down seven missiles and 32 drones.", "location": "Ukraine", "classification": "security", "score": 0.5842924600621292, "event_breakdown": "Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package."}, {"id": "314108ca-01b6-44f3-a1fc-4edb4847fcb3", "title": "North Korea Flies Trash And Manure Balloons Into South As It Doubles Down On Satellite Ambitions", "date": "2024-05-30 03:15", "url": "https://www.theyeshivaworld.com/news/general/2286787/north-korea-flies-trash-and-manure-balloons-into-south-as-it-doubles-down-on-satellite-ambitions.html", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the text, it is not possible to determine a specific location for the main event.", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea fires short-range missiles toward East Sea\nSouth Korea on Sunday detected North Korea firing suspected short-range missiles twice into the sea off its east coast.\nSouth Korea’s Joint Chiefs of Staff said in a statement that the North fired two projectiles believed to be short-range ballistic missiles from North Pyongan Province early Sunday.\nThe Japanese military also said it detected the launch of what appeared to be a ballistic missile by North Korea on Sunday morning."}, {"id": "c16410dd-2ba3-40fa-8d2b-db871c0871cb", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:15", "url": "https://www.10news.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "South Korea", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea sending rubbish and spy satellites into South Korea, Russia"}, {"id": "c7d4fc89-aa5b-437f-8422-73b99d28458a", "title": "Missile attacks damage a ship in the Red Sea off Yemen coast near previous Houthi rebel assaults - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 01:30", "url": "https://www.newdelhitimes.com/missile-attacks-damage-a-ship-in-the-red-sea-off-yemens-coast-near-previous-houthi-rebel-assaults/", "message": "Missile attacks twice damaged a Marshall Islands-flagged, Greek-owned ship Tuesday in the Red Sea off the coast of Yemen, with a private security firm saying radio traffic suggested the vessel took on water after being struck.\nThe vessel reported being headed to Fujairah in the United Arab Emirates.\nCentral Command separately said it destroyed five Houthi drones over the Red Sea amid the attacks.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA.", "classification": "security", "score": 0.7007360866747084, "event_breakdown": "Target event - A Greek ship was attacked and damaged by Houthi drones in the Red Sea off the coast of Yemen."}, {"id": "39134889-faeb-4076-b091-add7dfce3c8b", "title": "Street battles , Israeli strikes rock Rafah - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836545/street-battles-israeli-strikes-rock-rafah", "message": "RAFAH: Street fighting and Israeli bombardment rocked Rafah in the Gaza Strip on Wednesday, residents and officials said, a day after Israeli tanks rolled into the centre of the city near the Egyptian border.\nIsrael’s National Security Adviser Tzachi Hanegbi said on Wednesday the war could go on until the year’s end.\nFighting has again flared in Rafah, where an AFP reporter said an Israeli helicopter fired guns and missiles at targets in the city centre.\nThe spirit of the United Nations is dead in Gaza,” Erdogan told lawmakers from his AKP party.\nThe Turkish leader also hit out at fellow Muslim-majority countries for failing to take common action over the Israeli strike.", "location": "RAFAH", "classification": "security", "score": 0.5149734493054064, "event_breakdown": "Security event 1: Street fighting and Israeli bombardment rocked Rafah on Wednesday.\nSecurity event 2: Israeli forces rolled into Rafah near the Egyptian border.\nSecurity event 3: Israeli helicopter fired guns and missiles at targets in Rafah on Wednesday."}, {"id": "de3f26db-7f58-4ede-b6e7-2eac324b8fbb", "title": "  All Eyes on Rafah : 44 Million Instagram Users , Global Celebrities Share AI Image To Draw Focus On Gaza Crisis", "date": "2024-05-30 06:00", "url": "https://www.news18.com/world/all-eyes-on-rafah-44-million-instagram-users-global-celebrities-share-ai-image-to-draw-focus-on-gaza-crisis-8909611.html", "message": "More than 44 million Instagram users have shared an AI-generated image with the caption “All eyes on Rafah” as of Thursday morning, according to a count by Instagram.\nThe area located near the Egyptian border Rafah has recently been subjected to bombing by Israeli forces.\nThe international community has criticised Israel for the deaths because Rafah was previously a humanitarian zone for civilians.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael’s retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory’s health ministry.", "location": "like full stop\nGAZA", "classification": "security", "score": 0.47841359431306485, "event_breakdown": "Target event: New international Israeli offensive in the Gaza Strip\nNew international Israeli offensive in the Gaza Strip: Israel has recently bombed the Rafah area near the Egyptian border, killing at least 36,171 people in Gaza, according to the Hamas-run territory's health ministry."}, {"id": "8a309b8a-8128-4fbc-a087-0272f4e4f00f", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 04:00", "url": "http://www.china.org.cn/world/2024-05/30/content_117223023.htm", "message": "视频播放位置 下载安装Flash播放器Houthi group said it shot down an MQ-9 Reaper drone on Wednesday over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months.\"\nHe added that \"we will continue to develop our military defense capabilities to counter the U.S.- British coalition aggression against our country.\"\n\"We will also continue to support the Palestine people against the Israeli aggression until the conflict and blockade stop,\" the spokesman stressed.\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone.", "location": "Yemen", "classification": "security", "score": 0.41426789790734747, "event_breakdown": "Target event - Houthi group said they shot down an MQ-9 Reaper drone over Yemen's central Marib."}, {"id": "d5889b98-a2ef-423b-aaf0-9dee4082f8e3", "title": "Man Pleads Guilty , Sentenced to 14 Years for DHS Hotel Stabbing", "date": "2024-05-30 04:00", "url": "https://mynewsla.com/crime/2024/05/29/man-pleads-guilty-sentenced-to-14-years-for-dhs-hotel-stabbing/", "message": "A man pleaded guilty Wednesday to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison.\nAnthony Rene Ayala, 30, pleaded guilty before Judge Jason Stone at the Larson Justice Center in Indio to assault causing great bodily injury and first-degree burglary, according to Riverside County District Attorney’s office spokesman John Hall.\nTwo other men charged in the case, 30-year-old Jose Luis Garcia and 32-year-old Moises Mazariegos, previously pleaded guilty to the same charges.\nThe stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department.\nAyala has two robbery convictions, Garcia has convictions for burglary and attempted robbery, and Reynaga and Mazariegos have convictions for burglary and robbery.", "location": "Desert Hot Springs, California", "classification": "security", "score": 0.5017162583572974, "event_breakdown": "Target Event:\nA man pleaded guilty to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison. The stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department."}, {"id": "8cf686ca-3db6-4303-a137-2d4ce2f6d95c", "title": "Israel used U . S .- made bombs to kill dozens of civilians in Rafah , weapons experts reveal , after blast sparked international outcry", "date": "2024-05-30 06:45", "url": "https://www.dailymail.co.uk/news/article-13474831/Israel-used-bombs-kill-dozens-civilians-Rafah.html", "message": "The U.S. had been pushing for leaders in the Israeli military to use GBU-39 bombs more often because they are more precise and better suited to urban environments than larger bombs.\nEarlier this month, President Biden said the United States was pausing a delivery of the larger 2000-pound bombs that Israel often uses.\n'The strike was conducted using two munitions with small warheads suited for this targeted strike,' Rear Adm. Daniel Hagari, the Israeli military spokesman, said.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.", "location": "Gaza", "classification": "security", "score": 0.7413583526990494, "event_breakdown": "Militants in the Hamas-controlled Gaza Strip fired a rocket into Israel for the first time in over a month on Monday, drawing retaliatory airstrikes and threats of further violence from the Israel Defense Forces.\nThe rocket landed in a civilian area of southern Israel, causing no injuries. The IDF responded with airstrikes on three Hamas targets in Gaza, including a military compound and a weapons manufacturing facility.\nThe rocket attack came just hours after the Israeli military announced that it was taking over the Rafah border crossing on the Gaza-Egypt border, a move which it said was aimed at preventing the smuggling of weapons into the Strip."}, {"id": "3f51a8a9-1146-4d9e-99b7-a5999697a853", "title": "Day 237 of genocide : Dozens of civilians killed , others injured | World", "date": "2024-05-30 09:30", "url": "https://en.ammonnews.net/article/72958", "message": "Home WorldDay 237 of genocide: Dozens of civilians killed, others injuredAmmon News - At least seven civilians were killed and others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens’ homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire.", "location": "GAZA CITY", "classification": "security", "score": 0.9989904892587697, "event_breakdown": "At least seven civilians were killed and seven others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens' homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire."}, {"id": "dbf1fb9a-5bb7-4391-b434-81a1e92ed3e2", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 06:00", "url": "https://www.newdelhitimes.com/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions/", "message": "It advised civilians not to touch the objects flown from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nNorth Korea hasn’t commented on when it would be ready to attempt a satellite launch again, which some experts say could take months.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the context provided, I was unable to find a specific event that took place on one particular location.", "classification": "security", "score": 0.5626074291890387, "event_breakdown": "North Korea plans to conduct a missile test in the next week or two, U.S. and South Korean officials said, a move that would violate a United Nations prohibition on the country's use of ballistic technology."}, {"id": "5b6c7edd-dc34-4eec-8d80-692db193c381", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:00", "url": "https://www.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.", "location": "GAZA", "classification": "security", "score": 0.4522691607972171, "event_breakdown": "Gaza"}, {"id": "d5c47d82-d579-4874-a4d2-1d02cac727ad", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.", "location": "GAZA", "classification": "security", "score": 0.4522691607972171, "event_breakdown": "Israeli security official Tzachi Hanegbi declared 2024 is \"defined as a year of combat\" concerning Israel's war against Hamas on Wednesday, ending speculation that the Gaza offensive would be the war's final stage."}, {"id": "993d9514-9a35-499b-96ef-05fed9562d50", "title": "Russia - Ukraine war : List of key events , day 825", "date": "2024-05-30 03:15", "url": "https://www.aljazeera.com/news/2024/5/30/russia-ukraine-war-list-of-key-events-day-825", "message": "Ukraine’s air force said its defence systems destroyed seven Russia-launched missiles and 32 drones overnight.\nThe commander said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details.", "location": "Kyiv", "classification": "security", "score": 0.7650046963206805, "event_breakdown": "* Seven missiles were destroyed by the Ukraine Air Force, though their location was not specified.\n* Ukraine said its air defense systems destroyed 32 drones overnight, without providing a location."}, {"id": "43ef0a1c-b1a7-4675-8baa-13a1ece11bae", "title": "N . J . police union calls for  real consequence for rowdy teens on boardwalk", "date": "2024-05-30 02:15", "url": "https://www.pennlive.com/crime/2024/05/nj-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n“We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest.", "location": "Ocean City, Maryland", "classification": "security", "score": 0.885389261340814, "event_breakdown": "Ocean City: Stabbing of 15-year-old boy on Memorial Day weekend\nSeaside Heights: Brief panic on the boardwalk due to false report of shooting"}, {"id": "ca6f057e-a53d-4ae2-a99a-1c248eb28569", "title": "Syria says Israeli strike kills girl , wounds 10 civilians", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815135-Syria-says-Israeli-strike-kills-girl,-wounds-10-civilians", "message": "Syria says Israeli strike kills girl, wounds 10 civiliansWorld World Syria says Israeli strike kills girl, wounds 10 civiliansIsraeli air strike targeted a central site and a residential building in Baniyas city.\nThe Britain-based Observatory also said the Israeli strike on central Syria killed three Syrian fighters working with Lebanon's Iran-backed Hezbollah group and two other non-Syrian fighters working for the same movement.\nEarlier on Wednesday, state media said air defences intercepted Israeli \"targets\" over central Syria.\nThe Observatory said the Israeli strikes targeted \"at least one military site... in the eastern countryside of Homs, causing plumes of smoke to rise\".\nOn Saturday, an Israeli drone strike in central Syria, near the border with Lebanon, killed two Hezbollah fighters, the Observatory had said.", "location": "NULL", "classification": "security", "score": 0.8727517258030179, "event_breakdown": "Israeli air strike targeted a central site and a residential building in Baniyas on Wednesday, the local governor told state media."}, {"id": "97c79d8b-9ea8-4348-9b96-40ce6fbf04cd", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after Jersey Shore boardwalk unrest – NBC New York", "date": "2024-05-30 04:00", "url": "https://www.nbcnewyork.com/news/local/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-jersey-shore-boardwalk-unrest/5458273/", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest.", "location": "Ocean City, Maryland", "classification": "security", "score": 0.885389261340814, "event_breakdown": "Ocean City, NJ and Seaside Heights, NJ"}, {"id": "9135fc94-d27d-43fb-ab0c-0795b2108373", "title": "NJ police union calls for  real consequence after Jersey Shore boardwalk unrest", "date": "2024-05-30 01:45", "url": "https://www.fox5ny.com/news/new-jersey-police-union-calls-real-consequences-drunk-rowdy-teens-after-boardwalk-unrest", "message": "Peter Andreyev, president of the New Jersey State Policemens' Benevolent Association, issued a statement calling for changes in laws and procedures governing how police interact with disorderly teens and young adults.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We wholeheartedly support the city of Wildwood Police Department in protecting this community from these nuisance crowds on our boardwalk and in the city.\"", "location": "New Jersey", "classification": "security", "score": 0.701849505328394, "event_breakdown": "Seaside Heights, New Jersey - Brief panic on the boardwalk after a false report of shooting."}, {"id": "d7e5c5c5-4b5b-41fa-b1f4-b1c1367c0c97", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:45", "url": "https://www.dnaindia.com/world/report-israel-warns-war-in-gaza-may-extend-seven-more-months-3091201", "message": "Israel warns war in Gaza may extend seven more monthsInitially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\nIn response, Israel launched a devastating offensive in Gaza, claiming the lives of over 36,000 people, according to Palestinian officials.\nThe strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported.", "location": "GAZA STRIP", "classification": "security", "score": 0.7870015635588141, "event_breakdown": "Gaza"}, {"id": "ec409e6c-eb04-4817-933b-2f1b2562453c", "title": "Pakistan : Terrorists torch girl  middle school in North Waziristan", "date": "2024-05-30 06:30", "url": "https://news.webindia123.com/news/Articles/Asia/20240530/4201651.html", "message": "Some unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan destroying furniture, computers and books, police said on Wednesday, Dawn reported.\nAbrar, a member of Shakhimar Welfare Organisation, told Dawn the school was constructed by an organisation along with Pakistan Army''s 7th Division in 2020.\nOn May 9, terrorists set fire to a girls'' private school in the Shawa area of South Waziristan.\nSimilarly, on May 17, unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan.\nAround 500 girls were enrolled in the two schools, Government Girls Middle School Noor Jannat and Government Girls Middle School Yunus Kot which were targeted by the attackers around midnight.", "location": "North Waziristan", "classification": "security", "score": 0.9591702484625455, "event_breakdown": "Event 1: Unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan.\nEvent 2: Unidentified terrorists set on fire a girls'' private school in the Shawa area of South Waziristan.\nEvent 3: Unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan."}, {"id": "8057069c-c71b-4dda-ade6-43f96a47c766", "title": "Israel undermines goals by harming civilians in Gaza , US tells UN - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836543/israel-undermines-goals-by-harming-civilians-in-gaza-us-tells-un", "message": "“The continued pattern of significant civilian harm resulting from incidents like Sunday’s airstrikes undermines Israel’s strategic goals in Gaza,” deputy US Ambassador to the UN Robert Wood told the 15-member council.\nAn airstrike on Sunday set off a blaze in a tent camp in Rafah in southern Gaza, killing at least 45 people.\nIsrael — a US ally — said it had targeted Hamas militants and had not intended to harm civilians.\nOn Wednesday, Wood told reporters that Washington was reviewing it, but UN action was unlikely to be helpful or change the situation on the ground.\nHamas chooses to exploit the civilians of Gaza as human shields,” he told the council.", "location": "Gaza", "classification": "security", "score": 0.5696576536229144, "event_breakdown": "Airstrikes in Israel\nA news push reports that Israel has told the UN it killed 45 people in an airstrike in Gaza on Sunday, after weeks of heightened violence in the city."}, {"id": "db93b4af-c978-4a99-b3fe-375df8bfe693", "title": "London shooting : Four wounded , including child , in Hackney | united kingdom | News", "date": "2024-05-30 03:00", "url": "https://www.express.co.uk/news/uk/1905183/london-shooting-hackney-four-wounded-child", "message": "Police were called following an incident in London.\nThree adults and a child have suffered serious injuries following a shooting near to a restaurant in Hackney, London.\nA major police operation was launched following an incident on Kingsland High Street, Dalston just after 9.20pm on Wednesday.\nThe Metropolitan Police confirmed all four had suffered \"gunshot injuries\" and were rushed to an east London hospital.\nOfficers have not yet arrested anyone in connection with the attack.", "location": "LONDON", "classification": "security", "score": 0.876266618803576, "event_breakdown": "Target event:\nA shooting incident in Hackney, London is causing the police concern."}, {"id": "a405ecab-ecfd-44bb-820f-96e6fee3e997", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 09:30", "url": "https://www.digitaljournal.com/world/rafah-battles-intensify-as-israel-takes-over-gaza-egypt-border-strip/article", "message": "The Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken “operational control” of the narrow border area, where he said troops had “discovered around 20 tunnels”.\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nThe United States has been among the countries urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nThe New York Times and CNN, citing weapons experts and analysis of video from the scene of the weekend Rafah strike, reported that the bomb believed to have started the fatal fire was a US-made GBU-39 guided munition.", "location": "GAZA STRIP", "classification": "security", "score": 0.8054172495107347, "event_breakdown": "Israel launches attack into Rafah, reports discovering 20 tunnels\nIsrael launches attack into Rafah, reports discovering 20 tunnels."}, {"id": "722b141c-4e8f-41d7-b762-9ff8a6f14b8f", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:00", "url": "https://www.koaa.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "itself\nNorth Korea", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea fires missiles into the sea, South Korea says - North Korea fired several short-range anti-ship cruise missiles off its east coast on Thursday, Seoul's military said, the latest in a series of military drills the North has staged in recent weeks in a show of force amid ongoing annual South Korea-U.S. military drills.  The missiles were fired from a coastal location up"}, {"id": "a8cd0cdd-106d-4cbf-8f9a-d4b5a5a7eaa8", "title": "  Dozens killed in fresh Israeli attacks on Rafah  Says Palestinian medics", "date": "2024-05-30 08:45", "url": "https://www.sentinelassam.com/more-news/international/dozens-killed-in-fresh-israeli-attacks-on-rafah-says-palestinian-medics", "message": "Gaza: Palestinian medics have said dozens of people have died in fresh Israeli attacks on the southern Gaza city of Rafah on Tuesday, two days after 45 people were reportedly killed in an airstrike which sparked international condemnation.\nThe Israeli military said it was investigating reports of an attack on a shelter for displaced persons in western Rafah.\nEarlier on Tuesday, a spokesman for the Hamas-run health authority in Gaza said a further 18 people were killed overnight in separate Israeli attacks in Rafah.\nEyewitness reports from Rafah on Tuesday suggested the Israeli army has advanced into the city centre.\n(IANS)Also Read: Gaza: ‘All Eyes on Rafah’ Campaign Gains Momentum Amidst Israeli Offensive In RafaAlso Watch:", "location": "Gaza", "classification": "security", "score": 0.9009047901237012, "event_breakdown": "Gaza: Fresh Israeli Attacks in Rafah Claim Dozens of Lives."}, {"id": "b31bb78e-7b5c-4341-9f09-50d3d818e9cc", "title": "HYD : Two IDF Soldiers Murdered In Terror Attack Near Shechem – The Yeshiva World", "date": "2024-05-30 08:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2286929/hyd-three-idf-soldiers-killed-in-gaza.html", "message": "The IDF released for publication on Thursday morning that two IDF soldiers were killed in the ramming attack near Shechem on Wednesday evening and a third soldier was killed in battle in the northern Gaza Strip on Wednesday.\nThe ramming attack occurred at an IDF checkpoint near Shechem.\nAs IDF soldiers were checking cars, the terrorist sped to the front of the line and rammed into two soldiers.\nAccording to a preliminary investigation, the ramming attack occurred in seconds and the soldiers had no time to respond by opening fire.\nThe soldier who fell in battle in northern Gaza on Wednesday was identified as Staff Sgt.", "location": "GAZA", "classification": "security", "score": 0.9753319283323145, "event_breakdown": "IDF soldiers were attacked with an explosive device while they were patrolling the Gaza border. Additionally, three security forces were injured in a separate clash between Israeli soldiers and Hamas operatives near Khan Younis."}, {"id": "137067d9-ad90-4cff-b1bc-fe81810b0796", "title": "MW3 and Warzone : How to Unlock the JAK Harbinger Kit", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499833/article/mw3-and-warzone-how-to-unlock-the-jak-harbinger-kit/", "message": "Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4.\nWeekly challenges have been reset, meaning more Conversion Kits will roll out, with the first being the JAK Harbinger Kit for the M4.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?", "location": "The main event for this text is located in Call of Duty: Warzone.", "classification": "security", "score": 0.43625640781063774, "event_breakdown": "Target event - Conversion Kit in the infinite Ward\nCurrently, the Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4. Weekly challenges have reset, meaning more Conversion Kits will roll out. The first being the JAK Harbinger Kit for the M4."}, {"id": "ad9ccc42-8584-44c0-bb6b-0e7d3866772f", "title": "Sudan : How El Fasher Went From Darfur Safe Haven to All - Out War", "date": "2024-05-30 05:30", "url": "https://allafrica.com/stories/202405300066.html", "message": "UN officials have called the situation in El Fasher \"Hell on Earth\" and are warning that genocide crimes may be committed.\nDaily interviews that I am doing with friends and human rights monitors in El Fasher suggest that neither claim is an understatement.\nThe battle for El Fasher - home to as many as two million people - started last month but had long been telegraphed.\nLocal volunteers from the Shaqra Emergency Response Room prepare food for displaced people camped just outside of El Fasher.\nThe camp is on the outskirts of El Fasher and is located close to conflict front lines.", "location": "El Fasher", "classification": "security", "score": 0.6138517515179124, "event_breakdown": "Location: El Fasher, Sudan\nDate: 2022-05-25\nVolunteers from the Shaqra Emergency Response Room in El Fasher are providing food for displaced people camped just outside of the city. The camp is located close to conflict front lines."}, {"id": "d5211026-5af5-44e9-a2e5-c2ad1d63d8bb", "title": "IDF Announces Death Of Two Soldiers In West Bank Car Ramming Attack , One In Gaza Fighting", "date": "2024-05-30 09:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-announces-death-of-two-soldiers-in-west-bank-one-in-gaza", "message": "Eliya Hilel, 20 from Tel Zion, and Staff Sergeant Diego Shvisha Harsaj, 20 from Tel Aviv, were severely injured in a car-ramming attack near Shechem.\nYedidya Azugi, 20 from the settlement of Revava, fell in a battle in the north of the Gaza Strip.\nThe death toll in the Gaza Strip since the start of the ground offensive now stands at 287.\nIDF spokespersonSergeant Yedidia Azugi, 21, from the settlement of Revava, a fighter in the 101st Battalion, Paratroopers Brigade, fell in battle in the north of the Gaza Strip.\nThe entire Revava settlement is in deep mourning.", "location": "Gaza Strip", "classification": "security", "score": 0.9859905291150356, "event_breakdown": "Relevant events:\nCar-ramming attack near Shechem: Two Israeli soldiers severely injured.\nBattle in the north of the Gaza Strip: One IDF soldier fell."}, {"id": "0e95cee5-0845-450a-b025-1f5752d08ff3", "title": "Deaths of 3 more soldiers : 2 killed in West Bank car - ramming attack , 1 fell in battle", "date": "2024-05-30 07:15", "url": "https://www.ynetnews.com/article/b17hg5h4c", "message": "The IDF spokesman announced on Thursday morning the deaths of three IDF soldiers.\nYedidya Azugi, 21, from Revava, of the Paratrooper Brigade’s 101st Battalion, was killed in battle in the northern Gaza Strip.\nSince October 7, 642 IDF soldiers have been killed, including 291 in Gaza ground operation.\n1 View gallery Staff Sgt.\nAzugi, who fell in the northern Gaza Strip, lived in the West Bank settlement of Revava.", "location": "Gaza", "classification": "security", "score": 0.9687908981354951, "event_breakdown": "IDF soldiers killed in Gaza ground operation, as number of fatalities rises to 684"}, {"id": "9476f69d-b2e9-4b14-8334-bddf7e872c8e", "title": "S Korea accuses North of sending balloons with excrement across border", "date": "2024-05-30 02:30", "url": "https://japantoday.com/category/world/s.korea-accuses-north-of-sending-balloons-with-excrement-across-border", "message": "Yonhap via REUTERS/File photoBy Jack KimSouth Korea accused North Korea on Wednesday of sending a large number of balloons across their heavily fortified border to drop objects including trash and excrement, calling the act base and dangerous.\nPhotographs released by the South Korean military showed inflated balloons with plastic bags tethered to them.\nBalloons have regularly been sent the other way by South Korean activists, often led by North Korean defectors.\nNorth Korea also attempted to jam GPS signals in South Korea on early Wednesday morning, although no damage was reported, the Donga Ilbo newspaper said, citing multiple unnamed government sources.\nThe two Koreas' large militaries face off across the military border and North Korea routinely threatens to annihilate its neighbor.", "location": "NULL", "classification": "security", "score": 0.5232638979013924, "event_breakdown": "North Korea is accused of sending a large number of balloons across its heavily fortified border with South Korea to drop objects including trash and excrement. South Korea called the act base and dangerous.\nNorth Korea also attempted to jam GPS signals in South Korea on Wednesday morning although no damage was reported, the Donga Ilbo newspaper said."}, {"id": "f4e9078f-6adc-462f-8dd8-dbd9f547a274", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 10:30", "url": "https://www.newsday.com/news/nation/Andy-Negra-World-War-II-DDay-s81979", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nHe recalled being on the road with the 6th Armored Division, part of a push to retake the French port city of Brest, when his column was strafed by five German planes.", "location": "FRANCE", "classification": "security", "score": 0.749105803113076, "event_breakdown": "Target: Fort Slocum, New York\nNews Push: 1943\nLocation: Brest, France"}, {"id": "4597658f-49aa-4695-92ed-54c21d37b62e", "title": "Splatoon 3 update announced ( version 8 . 0 . 0 ), patch notes", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/splatoon-3-update-announced-version-8-0-0-patch-notes/", "message": "Splatoon 3 is gearing up for its next big update, which will be version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um’ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode.", "location": "From the text, I was unable to determine a specific location where the main event takes place.", "classification": "security", "score": 0.46699336619345716, "event_breakdown": "It looks like there were no current events of security reported in text that can be placed on a map within the specified time frame."}, {"id": "91425bb6-9f65-4bed-afb4-56dfcbd2b190", "title": "New Zealand Defence Force disposes of World War II - era mortar bomb in Whanganui", "date": "2024-05-30 00:00", "url": "https://www.nzherald.co.nz/whanganui-chronicle/news/new-zealand-defence-force-disposes-of-world-war-ii-era-mortar-bomb-in-whanganui/B2YCZ6TRTRFP5BNPCVAPXZHMOA/", "message": "Kyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyKyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyA three-inch drill mortar bomb found by the New Zealand Defence Force (NZDF) on Landguard Rd in Whanganui came from Word War II-era training exercises.\n“The mortar was replaced by the L16 81mm mortar in the 1960s but was likely used in training until the mid-1980s.\n“Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there.", "location": "Landguard Bluff", "classification": "security", "score": 0.9001838888399193, "event_breakdown": "Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there."}, {"id": "d2510744-37c6-414b-ba1d-beab24e76fe8", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Winnipeg Free Press", "date": "2024-05-30 04:45", "url": "https://www.winnipegfreepress.com/world/2024/05/29/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nWorld War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.", "location": "FRANCE", "classification": "security", "score": 0.49976999006243855, "event_breakdown": "Andy Negra, 96, recalled the time he was drafted into the U.S. Army in 1944 during World War II. He was assigned to the 128th Armored Field Artillery Battalion of the 6th Armored Division. \n\n\"I was 18 years old,\" said Negra, now a resident of Helen, Ga. \"I didn't know what exactly war was all about.\"\n\nIn October 1943, Negra was among several draftees who boarded a train in New York City bound for Camp Fannin, Texas, the starting point for basic training. The 128th AFA Battalion was part of the 6th AD, a formation of mechanized infantry, tank and artillery units known for their effectiveness during World War II.\n\nNegra's unit was equipped with 155mm self-propelled assault guns, known as \"armored guns.\" Equipped with a .50-caliber machine gun and directed by a five-man crew, these were much like the tanks that accompanied them.\n\n\"We'd go from point A to point B, depending on where we were,\" Negra said during a March 31 interview at the Unicoi State Park and Lodge in Helen. \"We were mainly there to support the infantry on their advances, so basically we were like assault artillery.\"\n\nPart of the 6th AD, the 128th AFA Battalion was stationed near Paris and fought in the Battle of the Bulge. Negra's unit was among those ordered to relieve the 101st Airborne Division, which was surrounded in the Belgian city of Bastogne. Negra said the 6th AD headed north toward Belgium"}, {"id": "a7fb5309-30c2-4cab-aa36-dc189d3b62b7", "title": "Splatoon 3 Receives A Fresh New Update ( Version 8 . 0 . 0 ), Here Are The Full Patch Notes", "date": "2024-05-30 04:15", "url": "https://www.nintendolife.com/news/2024/05/splatoon-3-receives-a-fresh-new-update-version-8-0-0-here-are-the-full-patch-notes", "message": "Nintendo has announced its next major update for Splatoon 3, bumping the Switch title up to Version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um'ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode.", "location": "Barnacle & Dime", "classification": "security", "score": 0.5362490398288282, "event_breakdown": "Target event - Taliban ambushed a military convoy in eastern Afghanistan, killing 10 soldiers. It was an ambush.\nTaliban ambushed a military convoy in eastern Afghanistan, killing 10 soldiers."}, {"id": "dd8663e8-8fe2-47d1-a862-3252cd26243e", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:15", "url": "https://www.ksat.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "GA", "classification": "security", "score": 0.4609318985558995, "event_breakdown": "Current events of security reported in text:\n\n* World War II veteran Andy Negra sits in his home in Helen, GA, on April 10, 2024."}, {"id": "cfb1645c-f263-4750-a35a-34436c3c9091", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:00", "url": "https://www.local10.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "GA", "classification": "security", "score": 0.4609318985558995, "event_breakdown": "So far, the list is empty"}, {"id": "3776f840-cc29-4de6-a5b4-a07dfb24b2fa", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Metro US", "date": "2024-05-30 08:45", "url": "https://www.metro.us/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "Georgia, United States", "classification": "security", "score": 0.5582464399488836, "event_breakdown": "Target event: World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024."}, {"id": "ab992843-5db9-428a-8627-5121eb4df0c3", "title": "Dominican Republic : The Coup That Became a War", "date": "2024-05-30 09:45", "url": "https://time.com/archive/6833716/dominican-republic-the-coup-that-became-a-war/", "message": "Twice before, General Wessin y Wessin, 40, had relied on his planes and tank-equipped supporting troops to settle political disputes in the Dominican Republic.\nAnd for help this time, he called on the U.S. Said Wessin y Wessin: “We saved the country by only a hair.\nMost often it was in the person of Wessin y Wessin.\nIn 1962, Wessin y Wessin helped stop the Armed Forces Secretary from overthrowing the seven-man civilian Council of State that administered the country after Trujillo.\nHe called Wessin y Wessin, who immediately agreed.", "location": "SANTO DOMINGO", "classification": "security", "score": 0.5632753419390925, "event_breakdown": "1962 Dominican Civil War\nWessin y Wessin stopped the Armed Forces Secretary from overthrowing the Dominican Republic's civilian Council of State."}, {"id": "02aedb6f-f9fd-4b3b-9e32-f739df3289b2", "title": "Cleared for publication : Two soldiers murdered in attack near Shechem", "date": "2024-05-30 03:45", "url": "https://www.israelnationalnews.com/news/390786", "message": "The IDF Spokesperson's Unit on Thursday morning cleared for publication that two soldiers were murdered in the ramming attack near Shechem (Nablus) on Wednesday evening: Staff sergeant Eliya Hilel, 20, from Tel Zion, and Staff sergeant Diego Shvisha Harsaj, 20, from Tel Aviv.\nIn addition, the IDF confirmed that Staff sergeant Yedidya Azugi , 21, from Revava, fell in battle in the northern Gaza Strip.\nA soldier from the 101st Battalion of the Paratroopers Brigade was seriously injured in the battle in which Azugi fell.\nIn addition, two soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip.\nAll the soldiers were evacuated to hospital for medical treatment and their families were notified.", "location": "Gaza Strip", "classification": "security", "score": 0.9607285910133382, "event_breakdown": "IDF: 2 soldiers murdered in the ramming attack near Shechem (Nablus) Wednesday evening\nIDF: Staff sergeant Yedidya Azugi, 21, from Revava, fell in battle in the northern Gaza Strip\nTwo soldiers from the 101st Battalion of the Paratroopers Brigade were seriously injured in the battle in which Azugi fell.\nTwo soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip."}, {"id": "b481fe6a-6718-410e-bb5b-1a3fc845804d", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:15", "url": "https://www.wfmz.com/news/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_9829ce9e-f750-5f23-bbf3-940c28dbb2a6.html", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)", "location": "GA, USA", "classification": "security", "score": 0.5108491598481895, "event_breakdown": "Andy Negra, a World War II veteran, shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division at his home in Helen, Ga. on April 10, 2024. (AP Photo/Sharon Johnson)"}, {"id": "d2687874-201d-49fc-b1c7-abffba3b8885", "title": "Israel says offensive in Gaza could last for seven months", "date": "2024-05-30 00:00", "url": "https://www.pasadenastarnews.com/2024/05/29/israel-says-offensive-in-gaza-could-last-for-seven-months/", "message": "Israel says the corridor is awash in tunnels that have funneled weapons and other goods for Hamas — despite a yearslong blockade imposed by Israel and Egypt.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.\nEgypt has repeatedly expressed concerns that the Israeli offensive could push Palestinians across the border — a scenario Egypt says is unacceptable.\nThe Israeli military official said Israel has also taken “tactical control” of Tel al-Sultan, a neighborhood on Rafah’s northwest edge.", "location": "GAZA", "classification": "security", "score": 0.7168096309389312, "event_breakdown": "Israel has taken over the Rafah border crossing, the only crossing between Gaza and Egypt, as well as Tel al-Sultan, a neighborhood on Rafah's northwest edge."}]