[{"id": "908a3581-535a-4ecf-9a80-88b85da9ce68", "title": "Israel war : Pro - Palestine university camps grow at universities", "date": "2024-04-30 00:00", "url": "https://www.watoday.com.au/national/nsw/no-go-areas-for-jewish-students-pro-palestinian-university-camps-grow-20240429-p5fnee.html", "message": "The number of pro-Palestinian campsites at the nation’s universities has grown to four, as Jewish groups claim they are turning campuses into no-go areas for Jewish students and academics.\nUniversity of Sydney bachelor of science student Yasmine Johnson is the Students for Palestine organiser.\nCredit: Louie DouvisIt has been almost a week since the encampment at the University of Sydney popped up, mirroring pro-Palestinian protest camps across the United States which began at Columbia University in New York on April 17.\nSimilar encampments have also been established at the University of Melbourne and the University of Queensland.\nThe University of Sydney is carefully monitoring the campsite and has so far not moved to remove it, as was done at Columbia University when administration called the police to move protesters on.", "classification": "antisemitism", "score": 0.516619916021625, "location": "University of Sydney", "event_breakdown": "Reminder: My knowledge cut-off date is January 2022.\n\nHamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "6ea87a83-ee12-4055-9385-887f09677668", "title": "Israel war : Pro - Palestine university camps grow at universities", "date": "2024-04-30 01:45", "url": "https://www.brisbanetimes.com.au/national/nsw/no-go-areas-for-jewish-students-pro-palestinian-university-camps-grow-20240429-p5fnee.html", "message": "The number of pro-Palestinian campsites at the nation’s universities has grown to four, as Jewish groups claim they are turning campuses into no-go areas for Jewish students and academics.\nUniversity of Sydney bachelor of science student Yasmine Johnson is the Students for Palestine organiser.\nCredit: Louie DouvisIt has been almost a week since the encampment at the University of Sydney popped up, mirroring pro-Palestinian protest camps across the United States which began at Columbia University in New York on April 17.\nSimilar encampments have also been established at the University of Melbourne and the University of Queensland.\nThe University of Sydney is carefully monitoring the campsite and has so far not moved to remove it, as was done at Columbia University when administration called the police to move protesters on.", "classification": "antisemitism", "score": 0.516619916021625, "location": "University of Sydney", "event_breakdown": "- Growth of pro-Palestinian campsites at Australian universities, totaling four.\n- Yasmine Johnson, a bachelor of science student at the University of Sydney, is the organizer of Students for Palestine.\n- Establishment of pro-Palestinian encampment at the University of Sydney, following similar protests at Columbia University in New York.\n- Similar encampments established at the University of Melbourne and the University of Queensland.\n- The University of Sydney monitoring the campsite without immediate removal, contrasting with the response at Columbia University where police were called to disperse protesters."}, {"id": "b9aad59a-8334-4388-967a-08cbb85c9298", "title": "Texas GOP and UT - Austin leaders shift from championing free speech to policing protester intentions", "date": "2024-04-30 02:15", "url": "https://www.yahoo.com/news/texas-gop-ut-austin-leaders-010231821.html", "message": "Greg Abbott signed a bill that enshrined new free speech protections on campuses.\nAnd six months ago, during a celebration of Free Speech Week, University of Texas at Austin administrators touted the school’s expansive protections for free speech on campus — including speech that was anti-war or considered hate speech.\nFree speech also loses First Amendment protections when it amounts to discriminatory harassment or true threats that incite imminent violence or destruction of public property.\nPreventing unlawful assembly, as DPS described the governor’s instructions, is a slippery slope that can lead to preventing assembly altogether, free speech experts said.\nAnd rules should not dissuade or discourage people from exercising free speech, she said.", "classification": "antisemitism", "score": 0.47153004398274617, "location": "University of Texas at Austin", "event_breakdown": "- Greg Abbott signed a bill enshrining new free speech protections on campuses.\n- University of Texas at Austin administrators touted the school's expansive protections for free speech during a celebration of Free Speech Week.\n- Free speech loses First Amendment protections in cases of discriminatory harassment or true threats that incite imminent violence or destruction of public property.\n- Preventing unlawful assembly is a slippery slope that can lead to preventing assembly altogether, according to free speech experts.\n- Rules should not dissuade or discourage people from exercising free speech."}, {"id": "7c38d6e6-b2cf-44ff-a88a-8b6cb44e0195", "title": "Texas GOP and UT - Austin leaders shift from championing free speech to policing protester intentions", "date": "2024-04-30 03:30", "url": "https://www.ksat.com/news/texas/2024/04/30/texas-gop-and-ut-austin-leaders-shift-from-championing-free-speech-to-policing-protesters-intentions/", "message": "Greg Abbott signed a bill that enshrined new free speech protections on campuses.\nAnd six months ago, during a celebration of Free Speech Week, University of Texas at Austin administrators touted the school’s expansive protections for free speech on campus — including speech that was anti-war or considered hate speech.\nFree speech also loses First Amendment protections when it amounts to discriminatory harassment or true threats that incite imminent violence or destruction of public property.\nPreventing unlawful assembly, as DPS described the governor’s instructions, is a slippery slope that can lead to preventing assembly altogether, free speech experts said.\nAnd rules should not dissuade or discourage people from exercising free speech, she said.", "classification": "antisemitism", "score": 0.47153004398274617, "location": "University of Texas at Austin", "event_breakdown": "- Greg Abbott signed a bill enshrining new free speech protections on campuses in Texas\n- University of Texas at Austin administrators touted the school's expansive protections for free speech during Free Speech Week\n- Free speech loses First Amendment protections in cases of discriminatory harassment or true threats that incite violence or destruction of public property\n- DPS described preventing unlawful assembly as per the governor's instructions\n- Free speech experts warned that preventing unlawful assembly can lead to preventing assembly altogether\n- Rules should not dissuade or discourage people from exercising free speech"}, {"id": "37a862af-d42d-4966-b6a5-f94781cdfab2", "title": "Texas GOP and UT - Austin leaders shift from championing free speech to policing protester intentions", "date": "2024-04-30 15:15", "url": "https://www.kwtx.com/2024/04/30/texas-gop-ut-austin-leaders-shift-championing-free-speech-policing-protesters-intentions/", "message": "Greg Abbott signed a bill that enshrined new free speech protections on campuses.\nAnd six months ago, during a celebration of Free Speech Week, University of Texas at Austin administrators touted the school’s expansive protections for free speech on campus — including speech that was anti-war or considered hate speech.\n“Hate speech is not a category of speech the government can restrict,” Amanda Cochran-McCall, the university’s vice president for legal affairs, said at a school-affiliated Free Speech Week in October.\nFree speech also loses First Amendment protections when it amounts to discriminatory harassment or true threats that incite imminent violence or destruction of public property.\nPreventing unlawful assembly, as DPS described the governor’s instructions, is a slippery slope that can lead to preventing assembly altogether, free speech experts said.", "classification": "antisemitism", "score": 0.5453301160416117, "location": "University of Texas at Austin", "event_breakdown": "- Greg Abbott signs a bill enshrining new free speech protections on campuses.\n- University of Texas at Austin administrators tout expansive protections for free speech on campus during a celebration of Free Speech Week.\n- Amanda Cochran-McCall, the university's vice president for legal affairs, asserts that hate speech is not a category of speech the government can restrict.\n- Free speech loses First Amendment protections when it amounts to discriminatory harassment or true threats that incite imminent violence or destruction of public property.\n- Free speech experts express concern that preventing unlawful assembly, as instructed by the governor, could lead to preventing assembly altogether."}, {"id": "0f067791-c9e8-4ad1-8f2f-ea7083852f5f", "title": "McConnell likens Columbia protesters to  student Nazis of Weimar Germany  in call to restore order", "date": "2024-04-30 20:45", "url": "https://www.yahoo.com/news/mcconnell-likens-columbia-protesters-student-192738893.html", "message": "McConnell also excoriated the student protesters, comparing their behavior on Columbias campus to the brand of aggressive lawlessness shown by the student Nazis of Weimar Germany.\nBut just as the roots of this hate are not a mystery, neither is the way forward for college administrators.\nIt’s time for the leaders of America’s most elite universities to take serious action,” McConnell said.\nIt is not, as the White House press secretary described campus radicals’ motivations yesterday, a mere ‘difficult viewpoint,’” McConnell said.\nColumbia University President Minouche Shafik said on Monday that the administration was unable to reach an agreement with protesters and would move ahead with having them removed from the encampment.", "classification": "antisemitism", "score": 0.7944486720562451, "location": "Columbia University", "event_breakdown": "- McConnell criticizes student protesters at Columbia University, comparing their behavior to student Nazis of Weimar Germany\n- McConnell calls for leaders of elite universities to take serious action\n- McConnell rejects White House press secretary's description of campus radicals' motivations\n- Columbia University President Minouche Shafik announces administration's inability to reach an agreement with protesters and plans to have them removed from the encampment"}, {"id": "fce56011-6c7c-4993-988b-62732f1c897e", "title": "Arrests roil college campuses ahead of graduation as protesters demand financial ties to Israel be cut", "date": "2024-04-29 16:00", "url": "https://businessmirror.com.ph/2024/04/29/arrests-roil-college-campuses-ahead-of-graduation-as-protesters-demand-financial-ties-to-israel-be-cut/", "message": "Protests are roiling college campuses nationwide as schools with graduation ceremonies next month face demands they cut financial ties to Israel because of the Israel-Hamas war.\nAbout 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIn the northern part of the state, officials on Saturday ordered an “enforced hard closure” of California State Polytechnic University, Humboldt.\nMissouriWashington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.", "classification": "antisemitism", "score": 0.6844915763899952, "location": "California State Polytechnic University, Humboldt", "event_breakdown": "1. Protests erupt on college campuses nationwide demanding financial ties to Israel be cut due to Israel-Hamas war.\n2. Approximately 275 people arrested at various campuses including Indiana University at Bloomington, Arizona State University, and Washington University in St. Louis.\n3. California State Polytechnic University, Humboldt experiences \"enforced hard closure\" ordered by officials in the northern part of the state.\n4. Missouri's Washington University in St. Louis locks some campus buildings and arrests protesters.\n5. Israel and its supporters criticize university protests as antisemitic, while critics argue that such allegations are used to silence opponents."}, {"id": "c7783c0a-8bad-4492-8b8c-4f98ac6228ae", "title": "UVa students , faculty named in blacklist , accused of antisemitism without evidence", "date": "2024-04-29 16:00", "url": "https://richmond.com/news/state-regional/education/uva-students-faculty-named-in-blacklist-accused-of-antisemitism-without-evidence/article_e2f75d0e-6d03-5140-ba1e-2cc0c587b734.html", "message": "An anonymous University of Virginia parent has accused two professors and one student of antisemitism for organizing an Israel-Palestine film series.\nThe series is sponsored by MESALC [Middle Eastern and South Asian Languages and Cultures] and UVA Jewish Studies,” reads Item 26 of the document.\nLefkowitz hoped that people would attend the entire film series instead of individual screenings.\nOn April 3, the Jewish Leadership Advisory Board, the largest Jewish student organization in Charlottesville, penned a letter to the Board of Visitors.\n“It saddens us to see concerted efforts to exploit Jewish students as pawns for political agendas.", "classification": "antisemitism", "score": 0.8593393321089434, "location": "Charlottesville, Virginia", "event_breakdown": "1. An anonymous University of Virginia parent accuses two professors and one student of antisemitism for organizing an Israel-Palestine film series.\n2. The film series is sponsored by MESALC [Middle Eastern and South Asian Languages and Cultures] and UVA Jewish Studies.\n3. Lefkowitz encourages attendance at the entire film series instead of individual screenings.\n4. On April 3, the Jewish Leadership Advisory Board writes a letter to the Board of Visitors expressing concerns about exploiting Jewish students for political agendas."}, {"id": "34b74bd1-842e-474d-9973-5104d32df39e", "title": "UVa students , faculty named in blacklist , accused of antisemitism without evidence", "date": "2024-04-29 16:00", "url": "https://roanoke.com/news/state-regional/education/uva-students-faculty-named-in-blacklist-accused-of-antisemitism-without-evidence/article_103219c6-5f16-5227-9be7-a1d9565ddf2b.html", "message": "An anonymous University of Virginia parent has accused two professors and one student of antisemitism for organizing an Israel-Palestine film series.\nThe series is sponsored by MESALC [Middle Eastern and South Asian Languages and Cultures] and UVA Jewish Studies,” reads Item 26 of the document.\nLefkowitz hoped that people would attend the entire film series instead of individual screenings.\nOn April 3, the Jewish Leadership Advisory Board, the largest Jewish student organization in Charlottesville, penned a letter to the Board of Visitors.\n“It saddens us to see concerted efforts to exploit Jewish students as pawns for political agendas.", "classification": "antisemitism", "score": 0.8593393321089434, "location": "Charlottesville", "event_breakdown": "- An anonymous University of Virginia parent accuses two professors and one student of antisemitism for organizing an Israel-Palestine film series\n- The film series is sponsored by MESALC and UVA Jewish Studies\n- Lefkowitz encourages people to attend the entire film series instead of individual screenings\n- On April 3, the Jewish Leadership Advisory Board pens a letter to the Board of Visitors, expressing sadness at efforts to exploit Jewish students for political agendas"}, {"id": "01a0edba-19ca-4fce-86f7-37dbb4b41eb7", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over the war in Gaza", "date": "2024-04-29 13:15", "url": "https://www.newsday.com/news/nation/Israel-Palestinian-campus-student-protests-war-n35838", "message": "Some Jewish students say the protests have veered into antisemitism and made them afraid to set foot on campus.\nThe protests have even spread to Europe, with French police removing dozens of students from the Sorbonne university after pro-Palestinian protesters occupied the main courtyard.\nIn Canada, student protest camps have popped up at the University of Ottawa, McGill University in Montreal and the University of British Columbia in Vancouver, The Canadian Press reported.\nThe confrontation was an escalation on the 53,000-student campus in the state's capital, where more than 50 protesters were arrested last week.\nIn a rare case, Northwestern University said it reached an agreement with students and faculty who represent the majority of protesters on its campus near Chicago.", "classification": "antisemitism", "score": 0.8471955840852275, "location": "Chicago", "event_breakdown": "- Jewish students say protests have veered into antisemitism on some campuses\n- French police remove pro-Palestinian protesters from the Sorbonne university in Paris\n- Student protest camps reported at University of Ottawa, McGill University, and University of British Columbia in Canada\n- More than 50 protesters arrested at 53,000-student campus in a state capital\n- Northwestern University reaches agreement with majority of protesters near Chicago"}, {"id": "54df9261-8f00-4379-9f57-bf801be9866e", "title": "Anti - Israel Demonstrations Roil College Campuses", "date": "2024-04-29 15:00", "url": "https://www.newsmax.com/us/antisemitism-campus-college/2024/04/29/id/1162744/", "message": "Protests are roiling college campuses across the U.S. as upcoming graduation ceremonies are threatened by disruptive demonstrators, with students and others sparring over the war in Gaza and its mounting death toll.\nAbout 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nWashington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nAbout 102 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.7417930856315116, "location": "Washington University in St. Louis", "event_breakdown": "1. Protests erupt on college campuses in the U.S.\n2. Approximately 275 people arrested at various campuses including Indiana University, Arizona State University, and Washington University in St. Louis.\n3. Israel and its supporters label university protests as antisemitic.\n4. Critics of Israel accuse it of using allegations of anti-Semitism to silence opponents.\n5. Washington University in St. Louis locks some campus buildings and arrests protesters.\n6. Around 102 protesters are arrested and will face charges of trespassing and disorderly conduct according to the Massachusetts State Police."}, {"id": "ca2e4dd2-0412-439b-b47b-417e615edf6a", "title": "Demonstrations roil U . S . campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 09:15", "url": "https://www.reviewjournal.com/news/nation-and-world/demonstrations-roil-u-s-campuses-ahead-of-graduations-as-protesters-spar-over-gaza-conflict-3041784/", "message": "Louis Post-Dispatch via AP)A George Washington University student, who declined to give her name, works on a school assignment while joining other students in protesting the Israel-Hamas war at George Washington University in Washington, Saturday, April 27, 2024.\n(AP Photo/Andres Kudacki)A Palestinian flag is reflected in a demonstrator's mask as students protest the Israel-Hamas war at George Washington University in Washington, Sunday, April 28, 2024.\nAbout 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic.\nAbout 102 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.5703718367977971, "location": "George Washington University in Washington", "event_breakdown": "- A George Washington University student protests the Israel-Hamas war at George Washington University in Washington on Saturday, April 27, 2024.\n- Demonstrators protest the Israel-Hamas war at George Washington University in Washington on Sunday, April 28, 2024.\n- About 275 people were arrested at various campuses including Indiana University at Bloomington, Arizona State University, and Washington University in St. Louis on Saturday.\n- Israel and its supporters branded the university protests as antisemitic.\n- About 102 protesters were arrested and will be charged with trespassing and disorderly conduct, according to the Massachusetts State Police."}, {"id": "1b4fba17-302b-4cb1-89fb-72833b6cf5b9", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over the war in Gaza – Metro US", "date": "2024-04-29 13:00", "url": "https://www.metro.us/demonstrations-roil-us-campuses-ahead-of-graduations-as-protesters-spar-over-the-war-in-gaza/", "message": "Some Jewish students say the protests have veered into antisemitism and made them afraid to set foot on campus.\nThe protests have even spread to Europe, with French police removing dozens of students from the Sorbonne university after pro-Palestinian protesters occupied the main courtyard.\nIn Canada, student protest camps have popped up at the University of Ottawa, McGill University in Montreal and the University of British Columbia in Vancouver, The Canadian Press reported.\nThe confrontation was an escalation on the 53,000-student campus in the state’s capital, where more than 50 protesters were arrested last week.\nIn a rare case, Northwestern University said it reached an agreement with students and faculty who represent the majority of protesters on its campus near Chicago.", "classification": "antisemitism", "score": 0.8451291348675528, "location": "Chicago", "event_breakdown": "- Jewish students express fear over antisemitism during protests on campus\n- Pro-Palestinian protesters occupy main courtyard at Sorbonne university, leading to removal of dozens of students by French police\n- Student protest camps appear at University of Ottawa, McGill University in Montreal, and University of British Columbia in Vancouver, according to The Canadian Press\n- More than 50 protesters arrested in escalation on a 53,000-student campus in the state’s capital\n- Northwestern University reaches agreement with majority of protesters on its campus near Chicago"}, {"id": "9f674d43-65c7-4302-8443-2e322a44bf6d", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 09:30", "url": "https://www.theweek.in/wire-updates/international/2024/04/29/fgn12-us-israel-palestinians-campus-protests.html", "message": "Protesters on both sides of the rancourous debate shouted and shoved each other during duelling demonstrations Sunday at the University of California, Los Angeles.\nAbout 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nMISSOURI: Washington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nAbout 102 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.5563360898464995, "location": "University of California, Los Angeles", "event_breakdown": "- Duelling demonstrations erupt in shouting and shoving at the University of California, Los Angeles.\n- Approximately 275 people are arrested on Saturday at various campuses, including Indiana University at Bloomington, Arizona State University, and Washington University in St. Louis.\n- Israel and its supporters denounce university protests as antisemitic, while critics of Israel argue that such allegations are used to silence opponents.\n- Washington University in St. Louis locks some campus buildings and arrests protesters on Saturday.\n- Protesters clashed at the University of California, Los Angeles\n- 275 people were arrested at various campuses including Indiana University, Arizona State University, and Washington University in St. Louis\n- Washington University in St. Louis locked some campus buildings and arrested protesters\n- 102 protesters were arrested and will be charged with trespassing and disorderly conduct by the Massachusetts State Police"}, {"id": "bffe76cb-9375-426a-a200-54ba41a06243", "title": "Demonstrations Roil US Campuses Ahead Of Graduations As Protesters Spar Over Gaza Conflict", "date": "2024-04-29 11:45", "url": "https://menafn.com/1108150831/Demonstrations-Roil-US-Campuses-Ahead-Of-Graduations-As-Protesters-Spar-Over-Gaza-Conflict", "message": "About 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nHOW IT STARTEDThe nationwide campus protests began as a response by some students to Israel's offensive in Gaza after Hamas launched a deadly attack on southern Israel on October 7.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nMISSOURI: Washington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nAbout 102 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.7982344077188211, "location": "Washington University in St. Louis", "event_breakdown": "Just a reminder, my knowledge is up to date only until January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "f109da5e-d61c-4778-a7ed-2caecefc6bf5", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 13:00", "url": "https://turnto10.com/news/local/demonstrations-roil-us-campuses-ahead-of-graduations-as-protesters-spar-over-gaza-conflict-israel-hamas-war-april-29-2024", "message": "Protesters on both sides of the rancourous debate shouted and shoved each other during dueling demonstrations Sunday at the University of California, Los Angeles.\nAbout 275 people were arrested on Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nMISSOURIWashington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nAbout 102 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.5421888717805703, "location": "Washington University in St. Louis", "event_breakdown": "- Protesters on both sides clashed at UCLA in Los Angeles\n- 275 people were arrested at various campuses including Indiana University, Arizona State University, and Washington University in St. Louis\n- Washington University in St. Louis locked some campus buildings and arrested protesters\n- 102 protesters were arrested at Massachusetts State Police and will be charged with trespassing and disorderly conduct"}, {"id": "62ea2fd4-0f05-494d-9164-2130bdbe5e63", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 10:15", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/demonstrations-roil-us-campuses-ahead-of-graduations-as-protesters-spar-over-gaza-conflict/article_66b2ddf3-f5f3-5774-b872-2763ece6bf08.html", "message": "Colleges around the U.S. are imploring student protesters of the war on Gaza to clear out tent encampments with rising levels of urgency", "classification": "security", "score": 0.602662434165034, "location": "null", "event_breakdown": "- Colleges around the U.S. implore student protesters of the war on Gaza to clear out tent encampments with rising levels of urgency."}, {"id": "3c805f44-2457-419d-a5d4-0faecee62195", "title": "Pro - Palestinian demonstrations seek to intimidate", "date": "2024-04-30 11:45", "url": "https://www.baltimoresun.com/2024/04/30/pro-palestinian-protests-seek-to-intimidate/", "message": "At the University of Michigan’s honors convocation, protesters booed and jeered — drowning out University President Santa Ono and abruptly ending the event.\nThese disruptive demonstrations seek to intimidate and drown out the voices of those with whom they disagree.\nThis is no longer about protests, this is about campus safety — particularly the safety of Jewish students, faculty and staff.\nOther visibly Jewish students have been physically surrounded by these protesters, prevented from entering buildings or even continuing on their way on campus.\nAnd, most importantly, they cannot tolerate the threatening and endangering of students, Jewish or otherwise.", "classification": "antisemitism", "score": 0.9216441328240756, "location": "University of Michigan", "event_breakdown": "- Disruptive protests at University of Michigan's honors convocation with protesters booing and jeering\n- Intimidation and drowning out of voices by protesters\n- Concerns raised about campus safety, particularly for Jewish students, faculty, and staff\n- Visibly Jewish students being physically surrounded and prevented from entering buildings on campus\n- Call to end threatening and endangering behavior towards students, Jewish or otherwise"}, {"id": "1ec6a5eb-09d3-43cc-8cce-bcacb52f8b38", "title": "Israel - Hamas war : Campus protesters dig in across U . S . ", "date": "2024-04-29 15:00", "url": "https://www.ctvnews.ca/world/demonstrations-roil-u-s-campuses-ahead-of-graduations-as-protesters-spar-over-the-war-in-gaza-1.6865035", "message": "Near George Washington University, protesters at an encampment breached and dismantled the barriers Monday morning used to secure University Yard, the university said in a statement.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nNew YorkEarly protests at Columbia University in New York City, where demonstrators set up tents in the center of the campus, sparked pro-Palestinian demonstrations across the country.\nMissouriWashington University in St. Louis locked some campus buildings and arrested protesters Saturday.\nAbout 100 protesters were arrested and will be charged with trespassing and disorderly conduct, the Massachusetts State Police said.", "classification": "antisemitism", "score": 0.7246375391633839, "location": "Washington", "event_breakdown": "- Protesters at an encampment near George Washington University breached and dismantled barriers used to secure University Yard\n- Israel and its supporters labeled the university protests as antisemitic\n- Critics of Israel accused it of using such allegations to silence opponents\n- Early protests at Columbia University in New York City sparked pro-Palestinian demonstrations across the country\n- Washington University in St. Louis locked some campus buildings and arrested protesters\n- About 100 protesters were arrested and will be charged with trespassing and disorderly conduct, according to the Massachusetts State Police"}, {"id": "150beb60-1f31-4091-a213-0454654cf54a", "title": "College students in Lehigh Valley react to Israel - Gaza events on campuses", "date": "2024-05-01 06:00", "url": "https://www.wfmz.com/news/area/lehighvalley/college-students-in-lehigh-valley-react-to-israel-gaza-events-on-campuses/article_ee6f2dde-0739-11ef-9569-4769bfc5df5e.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items.", "classification": "security", "score": 0.19523866502738976, "location": "null", "event_breakdown": "It seems like the text you provided is not describing specific events, but rather a notification system for receiving email notifications on a particular subject. Therefore, there are no specific events to list based on the provided text."}, {"id": "4485015f-7fe8-448e-810e-12e639f5c93f", "title": "UVa students , faculty named in blacklist , accused of antisemitism without evidence", "date": "2024-04-29 18:15", "url": "https://godanriver.com/news/state-regional/education/uva-students-faculty-named-in-blacklist-accused-of-antisemitism-without-evidence/article_de028942-b2b8-57da-a3bc-68ab80d219f2.html", "message": "An anonymous University of Virginia parent has accused two professors and one student of antisemitism for organizing an Israel-Palestine film series.\nThe series is sponsored by MESALC [Middle Eastern and South Asian Languages and Cultures] and UVA Jewish Studies,” reads Item 26 of the document.\nLefkowitz hoped that people would attend the entire film series instead of individual screenings.\nOn April 3, the Jewish Leadership Advisory Board, the largest Jewish student organization in Charlottesville, penned a letter to the Board of Visitors.\n“It saddens us to see concerted efforts to exploit Jewish students as pawns for political agendas.", "classification": "antisemitism", "score": 0.8593393321089434, "location": "University of Virginia", "event_breakdown": "- An anonymous accusation of antisemitism against two professors and one student for organizing an Israel-Palestine film series at University of Virginia\n- The film series is sponsored by MESALC and UVA Jewish Studies\n- Professor Lefkowitz encouraged attendance to the entire film series\n- The Jewish Leadership Advisory Board wrote a letter to the Board of Visitors on April 3 expressing concerns about the treatment of Jewish students and political agendas."}, {"id": "7a35fa58-4a38-4949-ac56-a2db72fc82d0", "title": "Billboard near University of Michigan :  Stop Jew Hatred on Campus  ", "date": "2024-04-29 18:45", "url": "https://www.jewishledger.com/2024/04/billboard-near-university-of-michigan-stop-jew-hatred-on-campus/", "message": "“The university has failed to respond to concerned students, parents and alumni who have contacted U of M, urging that it take action to stop violations of their own code of conduct and infractions of the law.\nWe put up the billboard in hopes of getting their attention,” said Sheldon Freilich, president of ZOA-Michigan.\nThe situation has been exacerbated, it added, by pro-Hamas demonstrations on campus and in campus buildings calling for the end of Israel and the genocide of Jews, often punctuated by Nazi symbols and slogans.\nThis week, she was one part of the pro-Palestinian and pro-Hamas activists that set up a tent encampment on school grounds.\nPHOTO: BillboardCAP: A new billboard put up by the Michigan branch of the Zionist Organization of American near the University of Michigan in Ann Arbor is trying to draw attention to campus antisemitism.", "classification": "antisemitism", "score": 0.8721787552686313, "location": "My knowledge cut-off date is January 2022. As of that time, Hamas is designated as a terrorist organization by several countries, including the United States, Israel, and the European Union.", "event_breakdown": "Just a reminder, my knowledge is up to date only until January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "1b080f58-c2c4-4e43-810d-45077c03ae88", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 10:45", "url": "https://www.wgauradio.com/news/demonstrations-roil/SORHQHVGY3WKBYUULYRIRUUP4Q/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "classification": "security", "score": 0.8271377155631021, "location": "null", "event_breakdown": "1. Website unavailable in user's location\n2. Error 451 displayed\n3. Access denied message due to accessing website from a country outside of the United States"}, {"id": "630206ee-8248-4fb4-b59f-96c15cc73de1", "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict", "date": "2024-04-29 09:15", "url": "https://www.benningtonbanner.com/ap/national/demonstrations-roil-us-campuses-ahead-of-graduations-as-protesters-spar-over-gaza-conflict/article_0d6504e7-f8ab-5ff4-8c62-c50843fc865b.html", "message": "Bennington, VT (05201)TodayCloudy skies early will become partly cloudy later in the day.\nSlight chance of a rain shower.\nWinds light and variable..TonightA few clouds.\nSlight chance of a rain shower.\nWinds light and variable.", "classification": "natural-disasters", "score": 0.592967732591346, "location": "null", "event_breakdown": "- Weather forecast for Bennington, VT (05201):\n    - Today:\n        - Cloudy skies early becoming partly cloudy later\n        - Slight chance of a rain shower\n        - Winds light and variable\n    - Tonight:\n        - A few clouds\n        - Slight chance of a rain shower\n        - Winds light and variable"}, {"id": "9493cb98-3f68-4fb2-8b40-bbe90ce558e2", "title": "Why did Hitler have such a problem with Jews ? ", "date": "2024-04-29 18:00", "url": "https://www.fluther.com/238064/why-did-hitler-have-such-a-problem-with-jews/", "message": "Hitlers mother was being treated by a Jewish doctor, when she died suddenly.\nOther Historians, claim that the fact that the doctor was Jewish didn’t matter to Hitler.\nAfter all, they sought/accepted the help of the Jewish doctor in the first place.\nIt’s hard to see 1940’s Hitler, as having a Jewish doctor.\nAlthough it’s important to note that Hitler rose to power after Germany had suffered defeat, and signed treaties that would financially stunt Germany for years to come.", "classification": "antisemitism", "score": 0.4622289178534128, "location": "Vienna", "event_breakdown": "- Hitler's mother was being treated by a Jewish doctor when she died suddenly\n- Other historians claim that the fact that the doctor was Jewish didn't matter to Hitler\n- They sought/accepted the help of the Jewish doctor in the first place\n- It's hard to see 1940's Hitler as having a Jewish doctor\n- Hitler rose to power after Germany had suffered defeat and signed treaties that would financially stunt Germany for years to come"}, {"id": "194c5d20-1892-4f90-95d3-df8e8ee41571", "title": "College Democrats Come Out in Support of Columbia , Other College Protesters", "date": "2024-05-01 00:00", "url": "https://hotair.com/david-strom/2024/04/30/college-democrats-come-out-in-support-of-columbia-other-college-protesters-n3787504", "message": "A few hours after Columbia students broke into, entered, and vandalized buildings on multiple college campuses including Columbia University, the College Democrats of America sent out a press release endorsing the protests.\nAdvertisementAs much as the College Democrats keep repeating the word \"peaceful\" in their statement, the underlying events are anything but.\nThe statement had supermajority support from the College Democrats’ 10-member executive board, but two members voted against it.\nThe College Democrats do condemn antisemitism, they say, but they sure seem happy to ally with open antisemites.\nThose are the people the College Democrats admire and stand with.", "classification": "antisemitism", "score": 0.6028974677319578, "location": "University of California, Los Angeles", "event_breakdown": "- Columbia students broke into, entered, and vandalized buildings on multiple college campuses including Columbia University \n- The College Democrats of America sent out a press release endorsing the protests \n- The statement had supermajority support from the College Democrats’ 10-member executive board, but two members voted against it \n- The College Democrats are said to condemn antisemitism, but appeared to ally with open antisemites"}, {"id": "6ed76798-f6ea-49d3-901a-3de5ef9bb5aa", "title": "Sri Lanka : Hands off US university students ! Mobilise the working class in defense of all those protesting against genocide ! ", "date": "2024-04-30 04:45", "url": "https://www.wsws.org/en/articles/2024/04/30/sgla-a30.html", "message": "The International Youth and Students for Social Equality (IYSSE) in Sri Lanka denounces President Biden’s administration’s ongoing police repression of students protesting the Israeli genocide in Gaza.\nThese and other Sri Lankan media outlets are attempting to poison the consciousness of the masses with this misinformation.\nSri Lankan workers and students have been involved in ongoing protests against the Wickremesinghe government’s International Monetary Fund austerity measures.\nWith more than 25 percent of the population now living in extreme poverty, Sri Lankan workers and the poor are fighting to defend their social conditions.\nWe urge students, youth and workers to register for this historic event.", "classification": "antisemitism", "score": 0.2872373815904787, "location": "Sri Lanka", "event_breakdown": "- IYSSE in Sri Lanka denounces President Biden’s administration’s ongoing police repression of students protesting the Israeli genocide in Gaza \n- Sri Lankan media outlets trying to poison the consciousness of the masses with misinformation \n- Sri Lankan workers and students protesting against the Wickremesinghe government’s IMF austerity measures \n- Over 25% of the population in Sri Lanka now living in extreme poverty \n- Sri Lankan workers and the poor fighting to defend their social conditions"}, {"id": "21c4cda1-2eca-4cf4-8f8c-600e2963d646", "title": "Pro - Palestine campus group behind Columbia University protests received over $3million a year in funding from  charitie linked to Hamas", "date": "2024-04-30 20:45", "url": "https://www.dailymail.co.uk/news/article-13363943/Pro-Palestine-group-Columbia-University-protests-funding-linked-Hamas.html", "message": "The group behind pro-Palestine student protests at Columbia received 'over $3 million a year' – and is linked to organizations accused of funding terrorist organization Hamas, a new think tank has revealed.\nStudents for Justice in Palestine (SJP), a campus group with more than 250 chapters across the country, is one of the main organizers of a protest that brought the Manhattan university to a standstill.\nIn the days after the October 7 deadly terror attacks by Hamas, SJP national leaders released a 'Day of Resistance Toolkit' which encouraged 'not just slogans and rallies, but armed confrontation with oppressors' in Israel.\nA pro-Hamas protestor calling on the Al-Qasam brigade (the military wing of Hamas) to kill Jewish students.\n'ISGAP calls for SJP (and its affiliated organizations) to be banned and for Jewish students to be protected.'", "classification": "antisemitism", "score": 0.7742154753900511, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, and others.", "event_breakdown": "My knowledge is up to date only until January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "76d813e6-2eca-484b-b09e-56b9550a3b0c", "title": "Elisha Wiesel : Even amid war against Hamas , Jews must advocate for Uyghurs", "date": "2024-04-29 18:45", "url": "https://www.jewishledger.com/2024/04/elisha-wiesel-even-amid-war-against-hamas-jews-must-advocate-for-uyghurs/", "message": "There’s no crematoria,” he told JNS.\n’Unpopular causes’“My father loved unpopular causes,” Wiesel told JNS, citing Elie Wiesel’s advocacy for Soviet Jewry before theirs became a cause that American Jews embraced widely and for Bosnian Muslims.\nWiesel told JNS that the foundation hired an artist, Chris Sojka, to create an installation that tells the story of the Uyghurs.\nWiesel told JNS that he met a man who learned he was on “a list” and fled China, leaving his wife and 6-year-old daughter behind.\nCredit: Courtesy of the Elie Wiesel Foundation for Humanity.", "classification": "security", "score": 0.25182016537306423, "location": "null", "event_breakdown": "Reminder: My knowledge is up to date only until January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "af6c3f1e-5b34-41c6-aa1e-47acbe5beea1", "title": "Law enforcement standoff with protesters continues on Tulane campus", "date": "2024-05-01 03:15", "url": "https://www.wafb.com/2024/04/30/law-enforcement-standoff-with-protesters-continues-tulane-campus/", "message": "Six campus intruders were arrested by Tulane University Police, the university said, including one student.\nTulane student Yasmeen Ohebsion spoke against the demands and questioned how the protestors choice of tactics.\n“The establishment of this encampment reflects profound failures in safeguarding the well-being of Jewish students on campus,” the statement reads.\nThe university's Jewish student organizations issued a statement demanding the encampment be taken down over concerns of student safety.\nA group of Jewish students took up a position near the makeshift encampment, holding Israeli flags in their show of solidarity.", "classification": "antisemitism", "score": 0.8488525569713932, "location": "Tulane University", "event_breakdown": "1. Six campus intruders, including one student, were arrested by Tulane University Police.\n2. Tulane student Yasmeen Ohebsion criticized the protestors' tactics.\n3. The establishment of an encampment on campus was condemned for failing to safeguard the well-being of Jewish students.\n4. Jewish student organizations demanded the removal of the encampment due to safety concerns.\n5. Jewish students showed solidarity by gathering near the encampment with Israeli flags."}, {"id": "3e4e6caa-2ef3-478c-be51-c8e8cb6a0dc0", "title": "Law enforcement standoff with protesters continues on Tulane campus", "date": "2024-04-30 23:30", "url": "https://www.fox8live.com/2024/04/30/law-enforcement-standoff-with-protesters-continues-tulane-campus/", "message": "Six campus intruders were arrested by Tulane University Police, the university said, including one student.\nTulane student Yasmeen Ohebsion spoke against the demands and questioned how the protestors choice of tactics.\n“The establishment of this encampment reflects profound failures in safeguarding the well-being of Jewish students on campus,” the statement reads.\nThe university's Jewish student organizations issued a statement demanding the encampment be taken down over concerns of student safety.\nA group of Jewish students took up a position near the makeshift encampment, holding Israeli flags in their show of solidarity.", "classification": "antisemitism", "score": 0.8488525569713932, "location": "Tulane University", "event_breakdown": "- Six campus intruders were arrested by Tulane University Police, including one student.\n- Tulane student Yasmeen Ohebsion spoke against the demands and questioned the protestors' choice of tactics.\n- The university's Jewish student organizations issued a statement demanding the encampment be taken down over concerns of student safety.\n- A group of Jewish students took up a position near the makeshift encampment, holding Israeli flags in their show of solidarity."}, {"id": "c805db33-cdc7-429d-8aab-850fd33b546b", "title": "2024 March of the Living to commemorate Hungarian Jews - Israel News", "date": "2024-04-29 19:15", "url": "https://www.jpost.com/israel-news/article-799077", "message": "On May 6, 2024, for the 36th march, fifty-five Holocaust Survivors from different countries, including those who were also victims of Hamas’ October 7 attacks, will take part in the march.\nThe march will conclude with a ceremony at the Keleti Train Station, the site of the first deportation of Hungarian Jews to Auschwitz-Birkenau.\nIn total, more than 550,000 Hungarian Jews were murdered during the Holocaust, according to Yad Vashem.\nAmong the 55 Holocaust survivors leading the march are 21 Holocaust survivors from Hungary and seven survivors who were personally impacted by the October 7 attack in Israel.\n\"Together, we will rise from the ashes of this horrific attack and foster prosperity and abundance in the years ahead.\"", "classification": "antisemitism", "score": 0.7852571730280051, "location": "Keleti Train Station", "event_breakdown": "- On May 6, 2024, fifty-five Holocaust Survivors from different countries participate in the 36th march.\n- The march concludes with a ceremony at Keleti Train Station, where the first deportation of Hungarian Jews to Auschwitz-Birkenau took place.\n- More than 550,000 Hungarian Jews were murdered during the Holocaust.\n- Among the 55 Holocaust survivors leading the march, 21 are from Hungary and seven were impacted by the October 7 attack in Israel."}, {"id": "1fdc4a8b-5dbe-4621-a7a4-425f59c62a7e", "title": "How Soro Latest Agitprop Exposed The Hypocrisy Of The Right", "date": "2024-04-29 16:00", "url": "https://www.zerohedge.com/news/2024-04-28/how-soros-latest-agitprop-exposed-hypocrisy-right", "message": "blueapples on XIt should come as no surprise that the pro-Palestinian protests across college campuses nationwide have been exposed as another agitprop operation funded by none other than George Soros.\nThat unconstitutional violation of the rights to free speech and free assembly wasn't limited to targeting demonstrations defying the government response to the pandemic alone.\nPro-Palestinian protests have enabled social architects like him behind the protests to carefully craft a narrative in response that furthers their ulterior motives.\nIn recent days, pro-Palestinian protesters have been confronted by pro-Israel demonstrators who have been mobilized to oppose their counterparts.\nWhat the Marxist undertones of this coordinated attack on free speech show is how deeply ingrained Soros' influence on American politics has become.", "classification": "antisemitism", "score": 0.3373611987439566, "location": "null", "event_breakdown": "- Pro-Palestinian protests across college campuses nationwide exposed as funded by George Soros\n- Unconstitutional violation of rights to free speech and free assembly targeting various demonstrations\n- Social architects behind pro-Palestinian protests crafting a narrative to further ulterior motives\n- Pro-Palestinian protesters confronted by pro-Israel demonstrators in recent days\n- Marxist undertones of coordinated attack on free speech show Soros' deep influence on American politics"}, {"id": "16040219-9ef5-4fcd-92d4-b2a67fdce1a7", "title": "Rep . Ilhan Omar Accused of  Blood Libel  By ADL For Calling Some Jewish Students  Pro - Genocide  At Columbia Protest", "date": "2024-04-30 01:00", "url": "https://radaronline.com/p/rep-ilhan-omar-accused-of-blood-libel-adl-calling-jewish-students-pro-genocide-columbia-protest/", "message": "U.S. Rep. Ilhan Omar has been accused of \"blood libel\" by the Anti-Defamation League for calling Jewish college students \"pro-genocide\" amid escalating protests against Israel's actions in Gaza, RadarOnline.com can confirm.\nThe Democratic congresswoman made the comment while speaking to a reporter as she attended a pro-Palestine protest at Columbia University on Friday.\n\"I think it is really unfortunate that people don't care about the fact that all Jewish kids should be kept safe and that we should not have to tolerate antisemitism or bigotry for all Jewish students, whether they are pro-genocide or anti-genocide,\" Omar said at the event, where organizers were demanding peace in Gaza.", "classification": "antisemitism", "score": 0.975603613576822, "location": "Columbia University", "event_breakdown": "The event occurred at Columbia University in New York City, where U.S. Rep. Ilhan Omar attended a pro-Palestine protest and made comments regarding Jewish college students, sparking accusations of \"blood libel\" by the Anti-Defamation League."}, {"id": "73d1d915-cc7e-4977-a1a0-f5fadd1f6a89", "title": "Students Sue After CUNY Folds to Backlash Against Muslim Commencement Speakers", "date": "2024-04-30 23:45", "url": "https://truthout.org/articles/students-sue-after-cuny-folds-to-backlash-against-muslim-commencement-speakers/", "message": "Mohammed applauded CUNY’s law school for supporting students who speak out against Israel’s treatment of Palestinians, but she also had critiques.\nThe backlash was swift and largely came from outside of CUNY and its historic law school in Queens.\nOnce again, the Jewish Law Students Association publicly stood with Mohammed and her right to free speech after she too came under attack.\nAs graduation approaches, eight CUNY law students — including Horowitz — have teamed with Muslim Advocates, a civil rights group, to file a lawsuit against the school, alleging unlawful discrimination and demanding their First Amendment right to elect a commencement speaker.\nOn April 30, CUNY’s law school lost two more speakers for upcoming graduation ceremonies.", "classification": "antisemitism", "score": 0.49508700924556437, "location": "Queens", "event_breakdown": "- Mohammed applauded CUNY’s law school for supporting students speaking out against Israel's treatment of Palestinians.\n- Critiques from Mohammed towards CUNY's law school.\n- Swift backlash largely from outside sources towards CUNY and its law school.\n- Jewish Law Students Association publicly supported Mohammed and her free speech rights.\n- Eight CUNY law students, including Horowitz, teamed up with Muslim Advocates to file a lawsuit against the school alleging unlawful discrimination and demanding their First Amendment right to elect a commencement speaker.\n- On April 30, CUNY’s law school lost two more speakers for upcoming graduation ceremonies."}, {"id": "2cb1ae56-0a27-42b4-ad2e-de02b984d415", "title": "Student protests over the Israel - Hamas war roil US campuses ahead of graduations", "date": "2024-04-29 15:30", "url": "https://www.stripes.com/theaters/us/2024-04-29/student-protests-israel-hamas-war-13696989.html", "message": "University of Texas handcuff a pro-Palestinian protester on the Austin campus on April 29, 2024.\nSome Jewish students say the protests have veered into antisemitism and made them afraid to set foot on campus.\nThe protests have even spread to Europe, with French police removing dozens of students from the Sorbonne university after pro-Palestinian protesters occupied the main courtyard.\nThe confrontation was an escalation on the 53,000-student campus in the state’s capital, where more than 50 protesters were arrested last week.\nIn a rare case, Northwestern University said it reached an agreement with students and faculty who represent the majority of protesters on its campus near Chicago.", "classification": "antisemitism", "score": 0.8496597922231842, "location": "University of Texas", "event_breakdown": "- University of Texas handcuff a pro-Palestinian protester on the Austin campus on April 29, 2024.\n- Some Jewish students say the protests have veered into antisemitism and made them afraid to set foot on campus at the University of Texas.\n- French police removing dozens of students from the Sorbonne university after pro-Palestinian protesters occupied the main courtyard.\n- The confrontation at the University of Texas was an escalation on the 53,000-student campus in the state’s capital, where more than 50 protesters were arrested last week.\n- Northwestern University reached an agreement with students and faculty who represent the majority of protesters on its campus near Chicago."}, {"id": "524d07e8-3665-476d-aa5f-5fc6d74734be", "title": "Law enforcement standoff with protesters continues on Tulane campus", "date": "2024-04-30 23:00", "url": "https://www.wtok.com/2024/04/30/law-enforcement-standoff-with-protesters-continues-tulane-campus/", "message": "Six campus intruders were arrested by Tulane University Police, the university said, including one student.\nTulane student Yasmeen Ohebsion spoke against the demands and questioned how the protestors choice of tactics.\n“The establishment of this encampment reflects profound failures in safeguarding the well-being of Jewish students on campus,” the statement reads.\nThe university's Jewish student organizations issued a statement demanding the encampment be taken down over concerns of student safety.\nA group of Jewish students took up a position near the makeshift encampment, holding Israeli flags in their show of solidarity.", "classification": "antisemitism", "score": 0.8488525569713932, "location": "Tulane University", "event_breakdown": "- Six campus intruders were arrested by Tulane University Police, including one student.\n- Tulane student Yasmeen Ohebsion questioned the protestors' choice of tactics.\n- The university issued a statement reflecting failures in safeguarding Jewish students on campus.\n- Jewish student organizations demanded that the encampment be taken down over safety concerns.\n- A group of Jewish students held Israeli flags near the makeshift encampment in solidarity."}, {"id": "28fe7945-e9c6-45fc-9a5e-82b02d038db4", "title": "Student Protests over Middle East Conflict Evoke Division on College Campuses", "date": "2024-04-29 16:00", "url": "https://www.devdiscourse.com/article/education/2921658-student-protests-over-middle-east-conflict-evoke-division-on-college-campuses", "message": "Near George Washington University, protesters at an encampment breached and dismantled the barriers Monday morning used to secure University Yard, the university said in a statement.\nAt least one school, the University of Southern California, cancelled its main graduation ceremony this spring.\nAbout 275 people were arrested Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nMISSOURI Washington University in St. Louis locked some campus buildings and arrested protesters Saturday.", "classification": "antisemitism", "score": 0.4889929880165733, "location": "Washington University in St. Louis", "event_breakdown": "- Protesters breached and dismantled barriers near George Washington University\n- University of Southern California cancelled its main graduation ceremony\n- Approximately 275 people were arrested at various campuses, including Indiana University at Bloomington, Arizona State University, and Washington University in St. Louis\n- Israel and its supporters labeled the university protests as antisemitic\n- Critics of Israel accused it of using such allegations to silence opponents\n- Washington University in St. Louis locked some campus buildings and arrested protesters"}, {"id": "f97c1821-1add-4fc1-a2bf-eb78eb36edc2", "title": "A look at the protests of the war in Gaza that have emerged at US colleges", "date": "2024-04-29 18:45", "url": "https://www.smdailyjournal.com/news/national/a-look-at-the-protests-of-the-war-in-gaza-that-have-emerged-at-us/article_05876310-45d0-5ec4-99d6-2bd99d49fcfe.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.", "classification": "technology", "score": 0.2867085397201571, "location": "null", "event_breakdown": "1. The Daily Journal offers a Premium Subscription for as low as $8.25 per month.\n2. The subscription includes access to the Daily Journal's e-Edition, which is a digital replica of the daily newspaper.\n3. Subscribers can download the digital replica for offline reading and clip/download articles or images to share.\n4. The subscription grants unlimited access to the Daily Journal's award-winning online content.\n5. Subscribers gain commenting access on all stories as valued members of the DJ community.\n6. There's also access to an online-only digital crossword puzzle."}, {"id": "91fc5dec-2145-4ead-a120-eb4813316ba0", "title": "Yom HaShoah Holocaust Remembrance to be held amid war , increase in antisemitism", "date": "2024-04-29 14:30", "url": "https://qctimes.com/news/local/yom-hashoah-holocaust-remembrance-to-be-held-amid-war-increase-in-antisemitism/article_3cbe93ba-040d-11ef-b878-ffe787bbd258.html", "message": "Bertenthal said the members of the Yom HaShoah Committee were of various faiths, including Judaism, Islam and Christianity.\n“This is the most agonizing preparation of the Yom HaShoah liturgy that I’ve ever experienced.\nThe 43rd annual Quad Cities Holocaust Remembrance, or Yom HaShoah, will be held at 7 p.m. Sunday, May 5, at the Paul V. Galvin Fine Arts Center at St. Ambrose University in Davenport.\nEach year, the Yom HaShoah features essay and art contests in which young students participate, she said.\nThe winner of the essay contest gets to read their essay during the Yom HaShoah program.", "classification": "antisemitism", "score": 0.5755533307799886, "location": "St. Ambrose University in Davenport", "event_breakdown": "- Bertenthal mentioned the diverse faith backgrounds of the members of the Yom HaShoah Committee.\n- The preparation for the Yom HaShoah liturgy was described as particularly agonizing by Bertenthal.\n- The 43rd annual Quad Cities Holocaust Remembrance event, also known as Yom HaShoah, is scheduled for May 5 at the Paul V. Galvin Fine Arts Center at St. Ambrose University in Davenport.\n- The Yom HaShoah event includes essay and art contests for young students.\n- The winner of the essay contest will have the opportunity to read their essay during the Yom HaShoah program."}, {"id": "0a122543-2b7e-4588-a8e1-ab815efa6423", "title": "College protests : What to know as anti - war movement spreads", "date": "2024-04-30 12:45", "url": "https://www.stltoday.com/news/nation-world/education/gaza-war-us-colleges-campus-protests/article_4ad819aa-d21e-5c40-afb9-60362f62725d.html", "message": "Student protests over the Israel-Hamas war have popped up at many college campuses following the arrest of demonstrators this month at Columbia University.\nSome universities say outsiders have joined student protesters and caused trouble.\nPro-Palestinian student protesters set up the tent encampment at the Ivy League university in New York this month.\nThis number included 23 Washington University students and four university employees, the release stated.\nUniversity of GeorgiaPolice arrested protesters on Monday who tried to set up an encampment at the University of Georgia.", "classification": "antisemitism", "score": 0.520916142505489, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, and others.", "event_breakdown": "- Student protests at college campuses over Israel-Hamas war\n- Arrest of demonstrators at Columbia University leading to protests\n- Outsiders causing trouble at some universities during student protests\n- Pro-Palestinian student protesters setting up tent encampment at Columbia University\n- Arrest of 23 Washington University students and four employees during protest\n- Police arresting protesters attempting to set up encampment at University of Georgia"}, {"id": "93e03326-ebd7-4234-9122-da285b880db7", "title": "College protests : What to know as anti - war movement spreads", "date": "2024-04-30 15:45", "url": "https://buffalonews.com/news/nation-world/education/gaza-war-us-colleges-campus-protests/article_ce7ed723-ba2e-54eb-8777-0fc3ebf2a9c5.html", "message": "Student protests over the Israel-Hamas war have popped up at many college campuses following the arrest of demonstrators this month at Columbia University.\nSome universities say outsiders have joined student protesters and caused trouble.\nPro-Palestinian student protesters set up the tent encampment at the Ivy League university in New York this month.\nThis number included 23 Washington University students and four university employees, the release stated.\nUniversity of GeorgiaPolice arrested protesters on Monday who tried to set up an encampment at the University of Georgia.", "classification": "antisemitism", "score": 0.520916142505489, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, and others.", "event_breakdown": "- Student protests at Columbia University over Israel-Hamas war\n- Outsiders causing trouble at universities joining student protesters\n- Pro-Palestinian student protesters setting up tent encampment at Columbia University\n- Arrest of 23 Washington University students and four university employees\n- Protesters arrested at University of Georgia while trying to set up an encampment"}, {"id": "5ca89422-b530-4281-9f19-09e2c01b784b", "title": "UVa students set up  liberated zone  on Lawn , demand school divest from Israel", "date": "2024-04-30 23:15", "url": "https://richmond.com/news/state-and-regional/uva-students-set-up-liberated-zone-on-lawn-demand-school-divest-from-israel/article_72ae8d28-eaa8-5ba3-93d8-538f7eda69d4.html", "message": "Students at the University of Virginia are planning a “day-long liberated zone” on the school's Lawn Wednesday to demonstrate their solidarity with the Palestinian people as Israel continues to lay siege to the Palestinian territory of Gaza.\nIt was unclear at press time if that early encampment would remain after organizers announced police had asked them to clear the area.\n“During the ‘May Days’ strike of 1970, UVA students announced a ‘Freedom Day’ to rally students together in their opposition to the U.S. imperialist war in Vietnam,” the post reads.\nProtesters have been arrested at encampments and \"liberated zones\" at the University of Mary Washington, Virginia Tech and Virginia Commonwealth University in the past week.\nOn Tuesday, Republican Rep. Bob Good, who represents UVa and the surrounding 5th District in Congress, wrote a letter to UVa President Jim Ryan.", "classification": "antisemitism", "score": 0.731924289909173, "location": "University of Virginia", "event_breakdown": "- Students at the University of Virginia planning a “day-long liberated zone” on the school's Lawn\n- Uncertainty about the early encampment remaining after organizers were asked by police to clear the area\n- Announcement of a “Freedom Day” during the ‘May Days’ strike of 1970 in opposition to the U.S. imperialist war in Vietnam\n- Arrests of protesters at encampments and \"liberated zones\" at the University of Mary Washington, Virginia Tech, and Virginia Commonwealth University\n- Republican Rep. Bob Good writing a letter to UVa President Jim Ryan"}, {"id": "dddaef0a-34ea-4d89-8531-19d6667bb758", "title": "College protests : What to know as anti - war movement spreads | News", "date": "2024-04-30 14:00", "url": "https://www.wfmz.com/news/gaza-war-us-colleges-campus-protests/article_cd2e7e43-e2a8-55df-97d0-e99d488924af.html", "message": "Student protests over the Israel-Hamas war have popped up at many college campuses following the arrest of demonstrators this month at Columbia University.\nSome universities say outsiders have joined student protesters and caused trouble.\nPro-Palestinian student protesters set up the tent encampment at the Ivy League university in New York this month.\nThis number included 23 Washington University students and four university employees, the release stated.\nUniversity of GeorgiaPolice arrested protesters on Monday who tried to set up an encampment at the University of Georgia.", "classification": "antisemitism", "score": 0.520916142505489, "location": "New York", "event_breakdown": "1. Student protests at Columbia University following the arrest of demonstrators\n2. Outsiders causing trouble at some university protests\n3. Pro-Palestinian student protesters setting up a tent encampment at an Ivy League university in New York\n4. Arrest of 23 Washington University students and four university employees\n5. Police arresting protesters attempting to set up an encampment at the University of Georgia"}, {"id": "3a5f75aa-a4e3-4a15-b2c7-7009bcc3e321", "title": "College protests : What to know as anti - war movement spreads", "date": "2024-04-30 13:30", "url": "https://siouxcityjournal.com/news/nation-world/education/gaza-war-us-colleges-campus-protests/article_aad37442-d9ca-570a-bb78-b9c06c959bda.html", "message": "Student protests over the Israel-Hamas war have popped up at many college campuses following the arrest of demonstrators this month at Columbia University.\nSome universities say outsiders have joined student protesters and caused trouble.\nPro-Palestinian student protesters set up the tent encampment at the Ivy League university in New York this month.\nThis number included 23 Washington University students and four university employees, the release stated.\nUniversity of GeorgiaPolice arrested protesters on Monday who tried to set up an encampment at the University of Georgia.", "classification": "antisemitism", "score": 0.520916142505489, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, and others.", "event_breakdown": "- Student protests at Columbia University over Israel-Hamas conflict\n- Outsiders joining student protesters at multiple universities causing trouble\n- Pro-Palestinian student protesters setting up tent encampment at an Ivy League university in New York\n- Arrest of 23 Washington University students and four university employees\n- Police arresting protesters attempting to set up encampment at the University of Georgia"}, {"id": "f03649a4-15f3-4e53-b76f-ab8eeee7bdd2", "title": "UVa students set up  liberated zone  on Lawn , demand school divest from Israel", "date": "2024-04-30 23:30", "url": "https://dailyprogress.com/news/local/education/uva-students-set-up-liberated-zone-on-lawn-demand-school-divest-from-israel/article_0e9fc03a-073c-11ef-bce7-5b11f0e17fbe.html", "message": "“Earlier this afternoon, University officials became aware of a small group setting up tents near the UVA Chapel,” UVa said in a statement provided by spokesman Brian Coy.\nNew York police were dispatched to clear a student protest at Columbia University Tuesday night after protesters took over a university building.\nAt the University of California, Los Angeles, student protesters set up barricades blocking other students from accessing parts of campus, including a library.\n“During the ‘May Days’ strike of 1970, UVA students announced a ‘Freedom Day’ to rally students together in their opposition to the U.S. imperialist war in Vietnam,” the post reads.\nSeveral officials have voiced concern over how student protesters have treated Jewish students.", "classification": "antisemitism", "score": 0.764683011858255, "location": "Columbia University", "event_breakdown": "- University officials became aware of a small group setting up tents near the UVA Chapel at the University of Virginia.\n- New York police were dispatched to clear a student protest at Columbia University after protesters took over a university building.\n- Student protesters at the University of California, Los Angeles, set up barricades blocking other students from accessing parts of the campus, including a library.\n- UVA students announced a 'Freedom Day' during the 'May Days' strike of 1970 to rally against the U.S. imperialist war in Vietnam.\n- Several officials expressed concern over how student protesters treated Jewish students."}, {"id": "f7b604c0-68a8-4401-9215-28e8d33bfa2b", "title": "Student protests over the Israel - Hamas war roil US campuses ahead of graduations", "date": "2024-04-29 14:00", "url": "https://www.independent.co.uk/news/world/americas/israel-ap-hamas-columbia-university-los-angeles-b2536496.html", "message": "Near George Washington University, protesters at an encampment breached and dismantled the barriers Monday morning used to secure University Yard, the university said in a statement.\nAbout 275 people were arrested Saturday at various campuses including Indiana University at Bloomington, Arizona State University and Washington University in St. Louis.\nIsrael and its supporters have branded the university protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nTwo halls remained occupied by pro-Palestinian demonstrators.\nMISSOURIWashington University in St. Louis locked some campus buildings and arrested protesters Saturday.", "classification": "antisemitism", "score": 0.49180940212068813, "location": "Washington University in St. Louis", "event_breakdown": "1. Near George Washington University, protesters breached and dismantled barriers at an encampment.\n2. Approximately 275 people were arrested at various campuses including Indiana University at Bloomington, Arizona State University, and Washington University in St. Louis.\n3. Israel and its supporters have labeled the university protests as antisemitic, while critics of Israel argue it employs such accusations to silence opponents.\n4. Two halls remained occupied by pro-Palestinian demonstrators at unspecified locations."}, {"id": "5b9e1a5a-b464-4f64-8403-9728d7055b74", "title": "Law enforcement standoff with protesters continues on Tulane campus", "date": "2024-05-01 01:45", "url": "https://www.knoe.com/2024/04/30/law-enforcement-standoff-with-protesters-continues-tulane-campus/", "message": "Six campus intruders were arrested by Tulane University Police, the university said, including one student.\nTulane student Yasmeen Ohebsion spoke against the demands and questioned how the protestors choice of tactics.\n“The establishment of this encampment reflects profound failures in safeguarding the well-being of Jewish students on campus,” the statement reads.\nThe university's Jewish student organizations issued a statement demanding the encampment be taken down over concerns of student safety.\nA group of Jewish students took up a position near the makeshift encampment, holding Israeli flags in their show of solidarity.", "classification": "antisemitism", "score": 0.8488525569713932, "location": "TULANE UNIVERSITY", "event_breakdown": "- Six campus intruders arrested by Tulane University Police, including one student\n- Tulane student Yasmeen Ohebsion spoke against the demands and questioned protestor tactics\n- University's Jewish student organizations issued a statement demanding the encampment be taken down\n- Group of Jewish students took up a position near the encampment, holding Israeli flags"}, {"id": "48146f9d-5a97-4565-bf02-cf9316df4514", "title": "Student protests over the Israel - Hamas war roil US campuses ahead of graduations", "date": "2024-04-29 15:00", "url": "https://buffalonews.com/news/national/student-protests-over-the-israel-hamas-war-roil-us-campuses-ahead-of-graduations/article_e32a2d5a-bc11-5cf2-bcf2-c8075303f4e6.html", "message": "Some Jewish students say the protests have veered into antisemitism and made them afraid to set foot on campus.\nThe protests have even spread to Europe, with French police removing dozens of students from the Sorbonne university after pro-Palestinian protesters occupied the main courtyard.\nIn Canada, student protest camps have popped up at the University of Ottawa, McGill University in Montreal and the University of British Columbia in Vancouver, The Canadian Press reported.\nThe confrontation was an escalation on the 53,000-student campus in the state's capital, where more than 50 protesters were arrested last week.\nIn a rare case, Northwestern University said it reached an agreement with students and faculty who represent the majority of protesters on its campus near Chicago.", "classification": "antisemitism", "score": 0.8471955840852275, "location": "Chicago, United States", "event_breakdown": "- Jewish students report feeling afraid on campus due to protests\n- French police remove pro-Palestinian protesters from Sorbonne university in Paris\n- Student protest camps established at University of Ottawa, McGill University, and University of British Columbia in Canada\n- More than 50 protesters arrested on a 53,000-student campus in the state's capital\n- Northwestern University reaches an agreement with majority of protesters on its campus near Chicago"}, {"id": "ff4a3e74-ccb1-4841-a955-c2105b8f2d8d", "title": "Pastor Jack Graham says antisemitism due to  spiritual warfare  ", "date": "2024-04-29 23:30", "url": "https://www.christianpost.com:443/news/pastor-jack-graham-says-antisemitism-due-to-spiritual-warfare.html", "message": "I believe the hatred is because God loves the Jewish people.\nAnd Satan hates everything and everyone that God loves.\nBut according to Graham, Christians have a duty to support Israel, rooted in both faith and moral conviction.\n\"God loves Israel,\" Graham emphasized.\nAnd so, we must stand against that hatred at our church.”Recent events, such as the Oct. 7 attacks by Hamas, Graham said, have brought this struggle into sharp focus.", "classification": "antisemitism", "score": 0.8583427523810436, "location": "null", "event_breakdown": "My knowledge cut-off date is January 2022. Based on that information, Hamas was designated as a terrorist organization by several countries and organizations, including the United States, the European Union, Canada, Israel, and others."}, {"id": "e63f40a0-fc0c-473a-a534-16e57e5bd649", "title": "Here the latest on the protests at major US universities", "date": "2024-04-30 12:45", "url": "https://www.cnn.com/business/live-news/university-protests-palestine-04-30-24/h_17ce01bb6438a8ca19ede937d1c6a9bc", "message": "College campuses across the United States have been roiled by pro-Palestinian protests this month, with nearly all demonstrations calling for universities to divest from Israel in some form.\nSo far, universities have refused to yield to those demands.\nMany universities have an endowment, which is donated funds generally invested in stocks, bonds and other financial instruments to help the university earn money.\nAt Columbia, a group of students want the college to divest its $13.6 billion endowment from any company linked to Israel, including Microsoft and Amazon.\nProtesters at other schools, such as Cornell and Yale, want their universities to stop investing in weapons manufacturers.", "classification": "antisemitism", "score": 0.6030552196354334, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries and organizations, including the United States, the European Union, Israel, and others.", "event_breakdown": "- Pro-Palestinian protests on college campuses across the United States calling for divestment from Israel\n- Universities refusing to yield to divestment demands\n- Calls for universities like Columbia to divest endowment from companies linked to Israel\n- Protests at schools like Cornell and Yale demanding universities to stop investing in weapons manufacturers"}, {"id": "66001857-1e03-46f6-a2cb-83e4daa5a55c", "title": "Pro - Palestine protest encampment established at VCU campus", "date": "2024-04-30 01:15", "url": "https://richmond.com/news/local/education/palestine-protesters-vcu-campus-israel-gaza-war-ceasrefire-hostages-hamas-glenn-youngkin/article_f6452cb8-0656-11ef-886c-d3211f176ada.html", "message": "Officers, some in riot gear, charged the line of demonstrators and deployed chemical agents in an effort to disperse the crowd.\nVCU said in a statement Monday night that the gathering “violated several university policies,” but did not specify which university rules had been broken.\nRELATED COVERAGEVCU did not say how it determined that some of the protesters were not students of the school.\nFinal exams begin this week and VCU must provide students the opportunity to safely and successfully complete the semester.\npic.twitter.com/Kj13WtI4TM — VCU (@VCU) April 30, 2024Haddad said the group would remain on the lawn as long as needed — until their demands are met.", "classification": "antisemitism", "score": 0.46442306244886133, "location": "'VCU'", "event_breakdown": "- Officers, some in riot gear, charged the line of demonstrators and deployed chemical agents in an effort to disperse the crowd. (Location: unspecified)\n- VCU said in a statement Monday night that the gathering “violated several university policies,” but did not specify which university rules had been broken. (Location: unspecified)\n- VCU did not say how it determined that some of the protesters were not students of the school. (Location: unspecified)\n- Final exams begin this week and VCU must provide students the opportunity to safely and successfully complete the semester. (Location: unspecified)\n- Haddad said the group would remain on the lawn as long as needed — until their demands are met. (Location: unspecified)"}, {"id": "53674331-d9d4-4e74-b5eb-6e97a29e6a17", "title": "Student protests over the Israel - Hamas war roil US campuses ahead of graduations", "date": "2024-04-29 14:15", "url": "https://www.wsbradio.com/news/student-protests/SORHQHVGY3WKBYUULYRIRUUP4Q/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "classification": "security", "score": 0.8271377155631021, "location": "null", "event_breakdown": "1. Website unavailable in user's location\n2. Error 451: Access denied from outside the United States"}, {"id": "583beb0a-713f-4222-bb33-773f6160296d", "title": "Student protests over the Israel - Hamas war roil US campuses ahead of graduations", "date": "2024-04-29 15:30", "url": "https://www.stcatharinesstandard.ca/news/world/united-states/student-protests-over-the-israel-hamas-war-roil-us-campuses-ahead-of-graduations/article_61b33203-c0f2-5d23-97a1-6f64c09a75aa.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code", "classification": "security", "score": 0.37571814753329563, "location": "null", "event_breakdown": "1. Tornado outbreak in Alabama\n2. Wildfires in Alaska\n3. Heatwave in Arizona\n4. Flooding in Arkansas\n5. Earthquake in California\n6. Avalanche in Colorado\n7. Hurricane in Connecticut\n8. Blizzard in Delaware\n9. Tornado warning in Florida\n10. Drought in Georgia\n11. Tropical storm in Hawaii\n12. Blizzard in Idaho\n13. Hailstorm in Illinois\n14. Flash floods in Indiana\n15. Heatwave in Iowa\n16. Blizzard in Kansas\n17. Tornado outbreak in Kentucky\n18. Hurricane in Louisiana\n19. Snowstorm in Maine\n20. Earthquake in Maryland\n21. Heatwave in Massachusetts\n22. Snowstorm in Michigan\n23. Tornado warning in Minnesota\n24. Flash floods in Mississippi\n25. Thunderstorms in Missouri\n26. Avalanche in Montana\n27. Heatwave in Nebraska\n28. Earthquake in Nevada\n29. Tornado warning in New Hampshire\n30. Blizzard in New Jersey\n31. Heatwave in New Mexico\n32. Snowstorm in New York\n33. Tornado outbreak in North Carolina\n34. Blizzard in North Dakota\n35. Thunderstorms in Ohio\n36. Tornado outbreak in Oklahoma\n37. Wildfires in Oregon\n38. Flooding in Pennsylvania\n39. Blizzard in Rhode Island\n40. Hurricane in South Carolina\n41. Heatwave in South Dakota\n42. Tornado outbreak in Tennessee\n43. Hurricane in Texas\n44. Heatwave in Utah\n45. Snowstorm in Vermont\n46. Heatwave in Virginia\n47. Thunderstorms in Washington\n48. Blizzard in West Virginia\n49. Thunderstorms in Wisconsin\n50. Flooding in Wyoming"}, {"id": "33b9e4c0-3d70-4554-b635-1e325de7003a", "title": "How universities are cracking down on a swell of tension months into student protests", "date": "2024-04-30 02:00", "url": "https://abc11.com/how-universities-are-cracking-down-student-protests-israel-bombardment-of-gaza-today/14742306/", "message": "How universities are cracking down on a swell of tension months into student protestsWith tension mounting over an encampment in support of Palestinians at New York's Columbia University, police strode onto campus this month and arrested more than 100 demonstrators.\nRELATED: College protests updates: More protests, encampments pop up at Princeton, Northwestern and moreIt is a \"drastic action\" that \"should be reserved for only the most direct and severe threats to campus safety,\" Greenberg said.\nAsh told CNN he was one of 20 students arrested following a sit-in on November 8.\nSeparately, the referendum on the BDS resolution \"did not move forward because of potential conflict with federal and state laws,\" the university told CNN in a statement.\nMasked student protesters' refusal to identify themselves also was \"unacceptable,\" it said.", "classification": "antisemitism", "score": 0.7775393544099828, "location": "New York City", "event_breakdown": "- Over 100 demonstrators were arrested by police at Columbia University in New York following tension over an encampment in support of Palestinians\n- 20 students, including Ash, were arrested during a sit-in on November 8 at the university\n- A referendum on a BDS resolution did not move forward at Columbia University due to potential conflict with federal and state laws\n- The university criticized masked student protesters for refusing to identify themselves"}, {"id": "c10f2980-263f-46d5-bd52-145092f9da01", "title": "How universities are cracking down on a swell of tension months into student protests", "date": "2024-04-29 16:30", "url": "https://6abc.com/how-universities-are-cracking-down-student-protests-israel-bombardment-of-gaza-today/14742306/", "message": "How universities are cracking down on a swell of tension months into student protestsWith tension mounting over an encampment in support of Palestinians at New York's Columbia University, police strode onto campus this month and arrested more than 100 demonstrators.\nRELATED: College protests updates: More protests, encampments pop up at Princeton, Northwestern and moreIt is a \"drastic action\" that \"should be reserved for only the most direct and severe threats to campus safety,\" Greenberg said.\nAsh told CNN he was one of 20 students arrested following a sit-in on November 8.\nSeparately, the referendum on the BDS resolution \"did not move forward because of potential conflict with federal and state laws,\" the university told CNN in a statement.\nMasked student protesters' refusal to identify themselves also was \"unacceptable,\" it said.", "classification": "antisemitism", "score": 0.7775393544099828, "location": "Columbia University", "event_breakdown": "1. More than 100 demonstrators were arrested by police at Columbia University in New York during tension surrounding an encampment in support of Palestinians.\n2. The university stated that such drastic actions should be reserved for the most severe threats to campus safety.\n3. Twenty students, including Ash, were arrested during a sit-in on November 8.\n4. A referendum on the BDS resolution did not proceed due to potential conflicts with federal and state laws.\n5. The university criticized masked student protesters for refusing to identify themselves, deeming it unacceptable."}, {"id": "b54bf563-20d4-4471-8acc-ca36758f9727", "title": "How universities are cracking down on a swell of tension months into student protests", "date": "2024-04-29 15:30", "url": "https://abc7.com/how-universities-are-cracking-down-student-protests-israel-bombardment-of-gaza-today/14742306/", "message": "How universities are cracking down on a swell of tension months into student protestsWith tension mounting over an encampment in support of Palestinians at New York's Columbia University, police strode onto campus this month and arrested more than 100 demonstrators.\nRELATED: College protests updates: More protests, encampments pop up at Princeton, Northwestern and moreIt is a \"drastic action\" that \"should be reserved for only the most direct and severe threats to campus safety,\" Greenberg said.\nAsh told CNN he was one of 20 students arrested following a sit-in on November 8.\nSeparately, the referendum on the BDS resolution \"did not move forward because of potential conflict with federal and state laws,\" the university told CNN in a statement.\nMasked student protesters' refusal to identify themselves also was \"unacceptable,\" it said.", "classification": "antisemitism", "score": 0.7775393544099828, "location": "New York City", "event_breakdown": "- Police arrested more than 100 demonstrators at an encampment supporting Palestinians on Columbia University campus in New York\n- 20 students were arrested following a sit-in on November 8 at the university \n- Referendum on the BDS resolution did not move forward due to potential conflict with federal and state laws according to the university statement \n- Masked student protesters' refusal to identify themselves was deemed unacceptable"}, {"id": "499d0e32-d075-48fa-bf41-620c1bd5ccb6", "title": "Gaza Protests : College Administrators Fall For Right - Wing Trap", "date": "2024-04-30 01:45", "url": "https://flaglerlive.com/gaza-protests/", "message": "Back then, college presidents routinely caved to the demands of conservative legislators, angry taxpayers and other wellsprings of anticommunist outrage against students striking for peace and civil rights.\nIf the past is any indication, the road ahead won’t be any easier for college presidents like Shafik.\nLawfare from the rightThroughout the 1960s, students organized a host of anti-war and civil rights protests, and many conservatives characterized the demonstrators as communist sympathizers.\nThey demanded civil rights protections and racially representative curricula.\nAs the U.S. presidential election approaches, I’ll be watching to see how the Trump and Biden campaigns respond to ongoing student protests.", "classification": "antisemitism", "score": 0.4385810355425396, "location": "null", "event_breakdown": "- College presidents caving to demands of conservative legislators, angry taxpayers, and anticommunist outrage against striking students\n- Students organizing anti-war and civil rights protests throughout the 1960s\n- Conservatives characterizing protesters as communist sympathizers\n- Demands for civil rights protections and racially representative curricula\n- Monitoring Trump and Biden campaigns' responses to ongoing student protests"}, {"id": "91db20e0-eec6-4c17-9191-c617251c4455", "title": "Columbia students who witnessed anti - Israel protester building takeover speaks out", "date": "2024-04-30 14:15", "url": "https://www.foxnews.com/us/columbia-students-witnessed-anti-israel-protesters-building-takeover-speaks-we-feel-alone", "message": "Two students at Columbia University are describing the anarchic scenes at Columbia University overnight, when demonstrators took over an academic building.\nThe students say the lax security on campus – where anti-Israel protesters have been running wild while outside agitators have infiltrated the campus – has left them feeling abandoned and alone.\n\"This is a very important building… this is where the dean of Columbia Colleges is, it's where the center for the core curriculum is and that's the centerpiece of every student's academic experience.\"\nDu said Columbia University has lost control of its gates and that outside agitators have infiltrated the campus.\nYou can't negotiate with students who have shown that they're willing to be arrested to break the rules,\" Du said.", "classification": "antisemitism", "score": 0.5333316828105625, "location": "Columbia University", "event_breakdown": "- Demonstrators take over academic building at Columbia University\n- Lax security on campus allows for anarchic scenes\n- Anti-Israel protesters causing chaos on campus\n- Outside agitators infiltrate the campus\n- Students feel abandoned and alone due to lack of security\n- Columbia University loses control of its gates\n- Inability to negotiate with rule-breaking students"}]