[{"id": "8ebde872-fd25-48f8-9a85-68caa7933a47", "title": "Fact check : Netanyahu falsely claims there have been  practically  no civilian fatalities in Rafah , besides one incident", "date": "2024-07-25 00:15", "url": "https://www.yahoo.com/news/fact-check-netanyahu-falsely-claims-231930271.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The “incident” Netanyahu referenced occurred in May and killed at least 45 people at a camp for displaced Palestinians.\nIn the same week of that strike, at least 29 Palestinians were killed in two separate Israeli attacks on displacement camps in Rafah, according to Palestinian and UN officials.\nCNN has seen firsthand video shot by stringers in Rafah and spoken to several health officials, humanitarian workers and eyewitnesses who have reported civilian fatalities as a result of Israel’s military assault on the southern city.\nGaza’s Ministry of Health does not distinguish in its reporting between combatant and civilian deaths but has previously said that some 70% of casualties in all of Gaza have been women and children.\nFor more CNN news and newsletters create an account at CNN.com", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9323713698162236, "event_breakdown": "1. The Israeli prime minister called on the international community to take action against the “flagrant aggression” of Hamas on Tuesday.\n2. Israeli forces continued to strike Gaza on Wednesday, targeting what it says are militant positions in response to rocket fire on Israel.\n3. Israeli airstrikes devastated the Gaza Strip on Wednesday morning, killing at least 24 Palestinians.\n4. Militants in the Gaza Strip fired more than 3,100 rockets at Israel in the past month, and more than 460 of them were intercepted by the Israel Defense Forces.\n5. The European Union’s top diplomat on Tuesday promised to mobilize international support for the Palestinian territories including Gaza.\n6. Prime Minister Benjamin Netanyahu on Tuesday said he is “fully committed” to reaching a cease-fire in the fighting between Israel and Hamas.\n7. Less than 12 hours after declaring Gaza terror organization Hamas was “in the midst of a significant attack” against Israel, Prime Minister Benjamin Netanyahu backtracked and had his words essentially removed from an official statement.\n8. The Israeli government on Tuesday launched airstrikes on the Gaza Strip, hitting sites used by militants who have fired rockets into Tel Aviv in airstrikes.\n9. Rockets fired from Gaza streaked across the border between the Gaza Strip and Israel on Tuesday, and Israel rattled the leader of that coastal territory.\n10. The Israeli government on Monday said it targeted and killed senior Hamas official Bassem Issa in the southern Gaza Strip."}, {"id": "2f4eedef-a0f2-407b-b50e-48940ad50fe1", "title": "Fact check : Netanyahu claims about Rafah in speech to Congress", "date": "2024-07-25 01:00", "url": "https://edition.cnn.com/2024/07/24/politics/fact-check-netanyahu-rafah-claims/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "The “incident” Netanyahu referenced occurred in May and killed at least 45 people at a camp for displaced Palestinians.\nThe airstrike injured more than 200 after a fire broke out at the camp following the strike, most of them women and children, according to the Gaza Health Ministry and Palestinian medics.\nIn the same week of that strike, at least 29 Palestinians were killed in two separate Israeli attacks on displacement camps in Rafah, according to Palestinian and UN officials.\nCNN has seen firsthand video shot by stringers in Rafah and spoken to several health officials, humanitarian workers and eyewitnesses who have reported civilian fatalities as a result of Israel’s military assault on the southern city.\nGaza’s Ministry of Health does not distinguish in its reporting between combatant and civilian deaths but has previously said that some 70% of casualties in all of Gaza have been women and children.", "location": "Gaza", "classification": "security", "score": 0.9622320908287272, "event_breakdown": "Gaza airstrike kills 45, injures over 200\n\nMay 16, 2023\n\nIn the first week of May, 206 Palestinians are reported to have died from an accident at displacement camps in Rafah, according to Palestinian officials, United Nations health officials, and the Palestinian Health Ministry."}, {"id": "e57be0e6-9f33-452a-98ff-0f40f86d32c1", "title": "Israeli raids displace thousands in Gaza - World", "date": "2024-07-25 05:45", "url": "https://www.dawn.com/news/1847845/israeli-raids-displace-thousands-in-gaza", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "CAIRO: Israeli forces carried out new raids in the Gaza Strip on Wednesday, hours before Prime Minister Benjamin Netanyahu was due to address the US Congress.\nThe Israeli military said it had been operating in areas from which fighters had been able to fire rockets into Israel and attack Israeli troops.\nThe Israeli military issued the evacuation orders on social media, and some residents received orders to leave by phone.\nIsraeli forces also mounted airstrikes on several areas of central and northern Gaza, including one on Al-Bureij camp in central Gaza which health officials said killed nine people.\nWe are being slaughtered by American planes, American ships, American tanks, and American troops,” said Kazem Abu Taha, a displaced resident from Rafah.", "location": "GAZA", "classification": "security", "score": 0.9235230184326686, "event_breakdown": "Israeli forces carry out fresh raids in Gaza, killing nine people."}, {"id": "0677f4da-d6f9-4f81-b910-96928547d2ce", "title": "FACT FOCUS : A look at Netanyahu claims about Israel , Hamas and Iran during his speech to Congress", "date": "2024-07-25 00:15", "url": "https://www.dailylocal.com/2024/07/24/fact-focus-a-look-at-netanyahus-claims-about-israel-hamas-and-iran-during-his-speech-to-congress/", "domain": "dailylocal.com", "domain_classification": "Unknown", "message": "If there are Palestinians in Gaza who aren’t getting enough food, it’s not because Israel is blocking it.\nThey say ongoing Israeli military operations and fighting with Hamas and lawlessness makes it too difficult to operate.\nIn April, an Israeli airstrike killed seven aid workers in an incident that Israel said was caused by human error.\nHe didn’t discuss accusations that he believed Hamas was deterred when in fact it was preparing a major assault on Israel.\nIn fact, public support for Netanyahu has plummeted since Oct. 7, with many blaming Netanyahu for the Hamas attacks.", "location": "Gaza", "classification": "security", "score": 0.8364988128859533, "event_breakdown": "The current event of security that can be reported on a map is:\nOn October 7, 2021, a support event happened for Benjamin Netanyahu, with many people blaming him for the Hamas attacks."}, {"id": "ddf8dd54-8f67-4cda-be4f-1df191f9e8af", "title": "House votes to form task force to investigate shooting at Trump rally , recommend legislative fixes", "date": "2024-07-25 04:45", "url": "https://www.wsbradio.com/news/politics/house-votes-form/IK2L6Z4JG5GKRA5TQG6BWTHCTA/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Error 451 Based on the information available, it is not possible to determine the location of the main event.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Here are some current events of security that are reported in text that can be placed on a map:\n\n1. Russia-Ukraine Conflict: An ongoing military conflict between Russia and Ukraine that began in February 2022. The locations of key events include the cities of Kyiv, Kharkiv, and Mariupol in Ukraine, as well as the Russian towns of Belgorod and Kursk.\n2. Nigeria-Biafra Conflict: An ongoing separatist movement in Nigeria calling for the independence of the Biafra region, with related violence and clashes between security forces and separatists. The conflict is primarily centered in the south-eastern region of Nigeria, particularly in cities such as Enugu, Onitsha, and Aba.\n3. Taliban Takeover of Afghanistan: The takeover of Afghanistan by the Taliban, a fundamentalist Islamic group, in August 2021 and the subsequent political instability in the country. The capital city of Kabul has been a central site of numerous security events and Taliban rule since then.\n4. Al-Shabaab Attacks in Kenya: Ongoing attacks by al-Shabaab, a jihadist militant group based in Somalia, in Kenya. The group targets security installations, civilian areas, and government officials, with frequent incidents occurring in the northern and eastern regions, including at the border with Somalia.\n5. Israel and Palestine Conflict: Ongoing tensions and clashes between the Israeli government and Palestinians in the West Bank and Gaza Strip. Major recent events include the conflict between Israeli forces and Hamas in Gaza in May 2021 and ongoing protests and clashes in the West Bank.\n6. Burkina Faso Insurgency: A violent insurgency in Burkina Faso by"}, {"id": "ad865d8d-961f-4fcd-8042-171775f70b2c", "title": "US lawmakers to form task force to investigate shooting at Trump rally", "date": "2024-07-25 04:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24474744.us-lawmakers-form-task-force-investigate-shooting-trump-rally/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "Location: Butler, Pennsylvania\nEvent: Bipartisan task force formed in response to shooting at campaign rally in Butler\nDescription:\nThe bipartisan task force will comprise 13 members and is expected to include seven Republicans and six Democrats."}, {"id": "fa45eff2-a4b7-445b-aa6f-5c12491d99a6", "title": "US lawmakers to form task force to investigate shooting at Trump rally", "date": "2024-07-25 05:00", "url": "https://www.thenorthernecho.co.uk/news/national/24474744.us-lawmakers-form-task-force-investigate-shooting-trump-rally/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "itself\nButler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "Security Event 1: Bipartisan task force to be formed by U.S. congressional members to investigate the September 30 shooting at a rally in Butler, Pennsylvania. The task force will comprise 13 members and is expected to include seven Republicans and six Democrats."}, {"id": "d5634f8c-5053-4204-a725-8459b686d81d", "title": "Salman Rushdie stabber charged with supporting Hezbollah", "date": "2024-07-25 04:15", "url": "https://www.israelnationalnews.com/news/393594", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Author Salman Rushdie is helped by people after he was stabbed at the ChautauquaThe man accused of stabbing British author Salman Rushdie in 2022 in New York now faces a new charge of supporting the Hezbollah terrorist group, the BBC reported on Wednesday, citing a newly unsealed indictment.\nThe stabber, Hadi Matar, has been charged with providing material support to Hezbollah in the new indictment.\nThe indictment said Matar attempted to provide \"material support and resources\" to Hezbollah, knowing it was a terrorist organization, but did not detail what evidence connected him to the group.\nHe is also charged with attempted murder and assault for the 2022 attack which left Rushdie blind in one eye .\nRushdie spent a decade in hiding after Iran's spiritual leader, Ayatollah Ruhollah Khomeini, issued the 1989 fatwa against him for his book.", "location": "New York", "classification": "security", "score": 0.6997656884587727, "event_breakdown": "Target Event:\nStabbing of British author Salman Rushdie - Salman Rushdie, British author, was stabbed in the eye by a protester at the Chautauqua Institution in New York.  The man was later charged with attempted murder and assault"}, {"id": "20658d99-e870-4a6a-a0cc-3826378e2d86", "title": "Iranian Oil Exports Have Risen Sharply , Facilitated By Malaysia", "date": "2024-07-25 00:15", "url": "https://oilprice.com/Energy/Crude-Oil/Iranian-Oil-Exports-Have-Risen-Sharply-Facilitated-By-Malaysia.html", "domain": "oilprice.com", "domain_classification": "Unknown", "message": "Oil markets only issued a muted response to the attack, with many analysts predicting that the administration was unlikely to cut off Iran’s key lifeline: oil exports.\nExperts pointed out that Washington would allow Iranian oil to continue flowing due to the risk of squeezing supply and triggering a politically damaging spike in world oil prices.\nAgain, the U.S. did not try to limit Iran’s oil exports.\nAnd now commodity analysts at Standard Chartered have reported that Iranian oil exports have spiked, with Malaysian waters becoming a conduit for ship-to-ship transfers of Iranian oil.\nA week ago, Trump promised in his 18 July Republican National Convention speech to reduce Iranian oil exports.", "location": "SEA", "classification": "security", "score": 0.43692938031695766, "event_breakdown": "Iranian oil exports have been going to Malaysian waters for ship-to-ship transfers."}, {"id": "84db8c55-4c77-4ef7-8683-91ecefaa8c08", "title": "Trump rally gunman looked online for information about Kennedy assassination , FBI director says", "date": "2024-07-25 00:15", "url": "https://www.yahoo.com/news/trump-rally-gunman-looked-online-215913654.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "From the archives: Man who filmed JFK assassination details horrifying day“That’s a search obviously that is significant in terms of his state of mind.\nThat is the same day that it appears that he registered” for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\nThe FBI thinks Crooks may have managed to avoid detection in the crowd despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been schedule well before the shooting as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "DALLAS", "classification": "security", "score": 0.6530140437165901, "event_breakdown": "Target Event:\nFBI Investigating Shooting at Trump Rally\nA news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}, {"id": "f04f0794-00f0-4a86-9759-b7fc20674dea", "title": "Police Investigate Stabbing Outside North Hollywood Metro Station", "date": "2024-07-25 01:45", "url": "https://mynewsla.com/uncategorized/2024/07/24/police-investigate-stabbing-outside-north-hollywood-metro-station/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man was stabbed Wednesday while leaving a Metro station in North Hollywood.\nThe stabbing was reported around 1:50 p.m. on the street level outside the Metro B (Red) Line station at Lankershim and Chandler boulevards, according to the Los Angeles Police Department.\nThe victim was exiting the station when an assailant approached and stabbed him for unknown reasons.\nAccording to reports from the scene, the man was stabbed in the ribs.\nDetectives described the suspect as a man wearing all black.", "location": "North Hollywood", "classification": "security", "score": 0.8987512490362769, "event_breakdown": "Stabbing in North Hollywood, CA"}, {"id": "b1349406-a5b0-4082-9c21-fdaf5eddb544", "title": "Fact - checking Israeli Prime Minister Benjamin Netanyahu address to Congress", "date": "2024-07-25 04:15", "url": "https://abcnews.go.com/Politics/fact-checking-israeli-prime-minister-benjamin-netanyahus-address/story?id=112253179", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Israeli Prime Minister Benjamin Netanyahu stood before Congress on Wednesday, delivering a joint address to U.S. lawmakers on the ongoing war with Hamas and renewing his call for bipartisan support in the Middle East.\nThe address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nUS Capitol police alongside members of the NYPD, pepper spray protesters who gathered outside the US Capitol before Israeli Prime Minister Benjamin Netanyahu delivers an address to a joint session of Congress in Washington, July 24, 2024.\nPolice use pepper spray as pro-Palestinian demonstrators gather on the day of Israeli Prime Minister Benjamin Netanyahu's address to a joint meeting of Congress, on Capitol Hill in Washington, July 24, 2024.\nAccording to the Hamas-run Ministry of Health in Gaza, more than 39,000 people have been killed in Israeli operations.", "location": "Washington, D.C.", "classification": "security", "score": 0.5260969083625343, "event_breakdown": "During the ongoing conflict between Israel and Hamas, Israeli Prime Minister Benjamin Netanyahu made a historic speech to Congress on July 24, 2024. During the address, he renewed his call for bipartisan support in the Middle East and unveiled Israeli plans to defend itself against Iran."}, {"id": "60c9bc9b-2827-4c1e-b0d1-38c5a470844f", "title": "HY  D : IDF Recovers Bodies Of Multiple Hostages From Khan Younis , 4 Publicly Identified So Far – The Yeshiva World", "date": "2024-07-25 04:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2299625/hyd-idf-recovers-bodies-of-multiple-hostages-from-khan-younis-4-publicly-identified-so-far.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The IDF on Wednesday recovered the bodies of five hostages from Khan Younis in the Gaza Strip.\nHe was killed battling the terrorists on the kibbutz on October 7 and his body was abducted to Gaza.\nMaya Goren hy”d, 56, was abducted into Gaza by Hamas terrorists on October 7.\nThe team was engaged in combat with Hamas terrorists near Kibbutz Nirim when Ahimas and two other soldiers were fatally wounded.\nAccording to YWN sources, Hamas terrorists arrested in recent weeks provided Israeli intelligence with information that led them to relaunch an operation in Khan Younis, which resulted now in the recovery of the hostages’ bodies.", "location": "Gaza Strip", "classification": "security", "score": 0.9874618013604599, "event_breakdown": "Event 1: IDF recovers bodies of five hostages in Khan Younis in the Gaza Strip.\nEvent 2: Maya Goren hy”d is abducted into Gaza by Hamas terrorists on the Kibbutz on October 7.\nEvent 3: Ahimas and another Israeli soldier were fatally wounded in combat with Hamas terrorists near Kibbutz Nirim on October 7.\nEvent 4: Hamas terrorists provided Israeli intelligence with information that led to an operation in Khan Younis, which resulted now in the recovery of the hostages' bodies."}, {"id": "c7128c9d-70d6-408a-ac15-9ba368fa223d", "title": "Israeli forces retrieve bodies of five hostages from Gaza , military says", "date": "2024-07-25 05:45", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-retrieve-bodies-of-five-hostages-from-gaza-military/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Israeli forces recovered on Wednesday the bodies of five hostages killed in Hamas’ Oct. 7 attack and held in Gaza since, the Israeli military said.\nThe other four hostages were two reserve soldiers and two conscript soldiers killed in combat during the Oct. 7 attack, the military said.\nTheir bodies were retrieved from the area of Khan Younis in southern Gaza, where Israeli forces launched new raids this week.\nAn Israeli delegation would participate in talks to secure a Gaza ceasefire and hostage release - mediated by the United States, Egypt and Qatar - next week, an Israeli official said on Wednesday.\nHamas wants a ceasefire agreement to end the war in Gaza, but Netanyahu says the war cannot end before Hamas is defeated.", "location": "GAZA", "classification": "security", "score": 0.8783020173310372, "event_breakdown": "dead bodies of 5 hostiages, recovered from  Khan Younis this week"}, {"id": "3797e8cb-9dc4-4d16-9fb2-7c213ab8f750", "title": "Fact check : Netanyahu falsely claims there have been  practically  no civilian fatalities in Rafah , besides one incident", "date": "2024-07-25 03:15", "url": "https://kvia.com/your-voice-your-vote/politics/cnn-us-politics/2024/07/24/fact-check-netanyahu-falsely-claims-there-have-been-practically-no-civilian-fatalities-in-rafah-besides-one-incident/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "The “incident” Netanyahu referenced occurred in May and killed at least 45 people at a camp for displaced Palestinians.\nThe airstrike injured more than 200 after a fire broke out at the camp following the strike, most of them women and children, according to the Gaza Health Ministry and Palestinian medics.\nIn the same week of that strike, at least 29 Palestinians were killed in two separate Israeli attacks on displacement camps in Rafah, according to Palestinian and UN officials.\nCNN has seen firsthand video shot by stringers in Rafah and spoken to several health officials, humanitarian workers and eyewitnesses who have reported civilian fatalities as a result of Israel’s military assault on the southern city.\nGaza’s Ministry of Health does not distinguish in its reporting between combatant and civilian deaths but has previously said that some 70% of casualties in all of Gaza have been women and children.", "location": "Gaza", "classification": "security", "score": 0.9622320908287272, "event_breakdown": "Event: At least 45 people were killed in a Palestinian refugee camp in Gaza by an Israeli airstrike on May 16th. The fire was started by the strike and injured over 200 people, mostly women and children. The strike occurred during the same week that another strike killed 29 people in Rafah, and 29 were killed in separate attacks on displacement camps in Rafah."}, {"id": "9b526eb2-4176-4747-8984-8ca63343a33b", "title": "Great Yarmouth fatal stabbing was  revenge killing  ", "date": "2024-07-25 07:00", "url": "https://www.edp24.co.uk/news/24474223.great-yarmouth-fatal-stabbing-revenge-killing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Junior Suleimane, 22, is accused of the murder of Felizardo Jose Viera-Balde following a chance encounter in St Peter's Road in Great Yarmouth in February 2023.\nREAD MORE: Murder probe after Great Yarmouth Wellington Road stabbingSuleimane, of Market Place, Yarmouth, was arrested two days later in Leeds after attempting to evade arrest by fleeing via Cambridge and London.\nHe denies murder with the court told he claims to have been acting in self-defence.\nFatal knife attack captured on CCTVA jury of seven men and five women was shown CCTV of Suleimane leaving a Londis shop after buying cigarettes and seeing Mr Viera-Balde walking past.\nThe graphic footage showed him removing a large knife from a backpack and walking towards Mr Viera-Balde before striking him.", "location": "Great Yarmouth", "classification": "security", "score": 0.582634087420764, "event_breakdown": "Current events of security reported in text that can be placed on map:\n- Murder probe after Great Yarmouth Wellington Road stabbing\n- Fatal knife attack captured on CCTV"}, {"id": "e52c9b51-3817-4304-9000-0fd7a0ac07fa", "title": "An explosion killed over 50 Ukrainian POWs in 2022 . Survivors and an internal UN report blame Russia", "date": "2024-07-25 07:45", "url": "https://www.yahoo.com/news/explosion-killed-over-50-ukrainian-072043183.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An AP investigation interviewed survivors, family and investigators and obtained an internal U.N. analysis.\nDespite the conclusion of the internal analysis that found Russia planned and executed the attack, the U.N. stopped short of accusing Russia in public statements.\nThey conducted in-depth interviews with 55 freed POWs who were in the barracks or elsewhere in Olenivka during the attack.\nAs the clock ticked down to a U.N. Security Council meeting later that day, Russia and Ukraine blamed each other.\nDujarric did not respond to questions about the internal analysis.", "location": "Olenivka.", "classification": "security", "score": 0.8821226302288021, "event_breakdown": "Russia accused of executing attack on Olenivka barracks\nU.N. internally found Russia to be the planners and executioners"}, {"id": "861ccfd8-29e1-427c-9d94-4bb818ce3b7a", "title": "An explosion killed over 50 Ukrainian POWs in 2022 . Survivors and an internal UN report blame Russia", "date": "2024-07-25 08:15", "url": "https://www.independent.co.uk/news/ap-russia-kyiv-donetsk-antonio-guterres-b2585610.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Despite the conclusion of the internal analysis that found Russia planned and executed the attack, the U.N. stopped short of accusing Russia in public statements.\nThey conducted in-depth interviews with 55 freed POWs who were in the barracks or elsewhere in Olenivka during the attack.\nThey were taken to a cinder-block building with a tin-plate roof and 100 bunks, no mattresses and a hastily dug pit toilet, multiple survivors told AP.\nUkrainian POWs elsewhere in the colony told the U.N. investigators that the Grad fire muffled sounds of the bigger explosions.\nAs the clock ticked down to a U.N. Security Council meeting later that day, Russia and Ukraine blamed each other.", "location": "Olenivka.", "classification": "security", "score": 0.8249059562650596, "event_breakdown": "Reported events:\n* Russia attacked a barracks in Olenivka, killing 7 people and injuring 37 others.\n* Ukraine blamed Russia for the attack, while Russia denied responsibility."}, {"id": "7b6f10bb-5ca4-45ff-9d90-31c5e84ef0c8", "title": "US politicians to form task force to investigate shooting at Trump rally", "date": "2024-07-25 07:00", "url": "https://www.edp24.co.uk/news/national/24474744.us-politicians-form-task-force-investigate-shooting-trump-rally/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "Butler, Pennsylvania\nA group of senators have agreed to establish a task force after a shooting at a campaign rally in Butler, Pennsylvania, that left a Kentucky lawmaker injured."}, {"id": "c99942f4-d232-4ac7-a4fb-3f6735c6086b", "title": "Israeli forces advance in southern Gaza , tanks active in Rafah", "date": "2024-07-25 09:30", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israeli-forces-advance-in-southern-Gaza-tanks-active-in-Rafah-47466677/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - Israeli forces advanced deeper into some towns on the eastern side of Khan Younis in southern Gaza on Thursday, hours after Israeli Prime Minister Benjamin Netanyahu told U.S. lawmakers he was actively engaged in bringing hostages home.\nHamas militants took more than 250 hostages in the early morning raid into southern Israel and killed 1,200 people, according to Israeli tallies.\nIsrael retaliated by vowing to eradicate Hamas in Gaza in a nine-month war that has killed more than 39,000 Palestinians, Gaza health officials say.\nSeveral were wounded in the eastern towns during Israeli tank and aerial shelling, while an airstrike east of Khan Younis killed four people, Palestinian health officials said.\nThe Israeli military said forces operating in Khan Younis killed dozens of militants and dismantled around 50 military infrastructures, while it continued activities in Rafah, killing two militants.", "location": "GAZA", "classification": "security", "score": 0.9824732365546378, "event_breakdown": "Current events of security reported in the news that can be placed on a map include:\n* Israeli forces advanced deeper into some towns on the eastern side of Khan Younis in southern Gaza on Thursday.\n* An airstrike east of Khan Younis killed four people.\n* Several were wounded in the eastern towns during Israeli tank and aerial shelling.\n* Another airstrike east of Gaza City killed one person, local reports say."}, {"id": "a881c9ac-9685-47ad-aa4c-3b79a1685b0a", "title": "US politicians to form task force to investigate shooting at Trump rally", "date": "2024-07-25 08:45", "url": "https://www.bournemouthecho.co.uk/news/national/24474744.us-politicians-form-task-force-investigate-shooting-trump-rally/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "BUTLER, PENNSYLVANIA", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "{\n\"text\": \"The task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\",\n\"locations\": [\n\"Butler, Pennsylvania\"\n],\n\"text_to_detect\": \"event\"\n}"}, {"id": "ef66577c-2567-459b-a757-6abd5e8d0ca1", "title": "US politicians to form task force to investigate shooting at Trump rally", "date": "2024-07-25 08:45", "url": "https://www.thetelegraphandargus.co.uk/news/national/24474744.us-politicians-form-task-force-investigate-shooting-trump-rally/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "Butler, Pennsylvania - A bipartisan group of lawmakers on Thursday approved the creation of a task force to investigate the shooting at a campaign rally outside a Pittsburgh-area synagogue last week.\nThe task force will examine the circumstances of the shooting and make recommendations for ways to prevent such violence from occurring in the future. The task force will consist of 13 members, with seven Republicans and six Democrats expected to serve on the panel.\nMr Trump said the gunman should \"never, ever have been allowed to purchase or possess a gun\" and that gun laws must be tightened to prevent such shootings from happening again.\nMr Kelly was at the synagogue with his wife and other family members on the first day of a week-long respite from the chemotherapy he has been undergoing for brain cancer. He called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis."}, {"id": "1b941ac4-b8e4-4f28-9fc8-9942b5ee98b9", "title": "US politicians to form task force to investigate shooting at Trump rally", "date": "2024-07-25 07:45", "url": "https://www.salisburyjournal.co.uk/news/national/24474744.us-politicians-form-task-force-investigate-shooting-trump-rally/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "BUTLER, PENNSYLVANIA", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "The shooting at a campaign rally in Butler, Pennsylvania\nA task force will review what to do about the shootings"}, {"id": "dcb14281-6bb0-420f-bdcf-7b9dac1df39a", "title": "Man charged over stabbing of uniformed Army officer", "date": "2024-07-25 09:00", "url": "https://www.belfasttelegraph.co.uk/news/uk/man-charged-over-stabbing-of-uniformed-army-officer/a531188845.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "A 24-year-old man has been charged with the attempted murder of an Army officer in uniform near a barracks (Gareth Fuller/PA)A 24-year-old man has been charged with the attempted murder of an Army officer in uniform near a barracks.\nAnthony Esan will appear in court on Thursday over the attack on Lieutenant Colonel Mark Teeton, in Gillingham, Kent, on Tuesday.\nThe serviceman, in his 40s, is in hospital in a serious but stable condition after being repeatedly stabbed.\nEsan, who was arrested near his home in nearby Rochester, has also been charged with possessing an offensive weapon in a public place and will appear at Medway Magistrates’ Court.\nHead of the Army General Sir Roly Walker condemned the stabbing as “horrific and unprovoked”, while Prime Minister Sir Keir Starmer said he was “shocked and appalled”.", "location": "Gillingham, Kent", "classification": "security", "score": 0.8917494905807133, "event_breakdown": "Army officer stabbed in Kent, England"}, {"id": "52caefaa-ee8e-4127-9e54-1e9df9046672", "title": "US politicians to form task force to investigate shooting at Trump rally", "date": "2024-07-25 07:30", "url": "https://www.bucksfreepress.co.uk/news/national/24474744.us-politicians-form-task-force-investigate-shooting-trump-rally/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "Target Event:\n* Mr Kelly was at the rally with his wife and other family members.\n* Mr. Kelly called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\n* The task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\n* Democrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.\nCurrent Events of Security:\n* Event: Mr Kelly was at the rally with his wife and other family members.\n* Location: Butler, Pennsylvania\n* Event: Mr. Kelly called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\n* Location: Butler, Pennsylvania\n* Event: The task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\n* Location: Butler, Pennsylvania\n* Event: Democrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.\n* Location: Butler, Pennsylvania"}, {"id": "8bc88c09-796e-43f7-8ec0-7a1aadd2f17e", "title": "Israel At War - LIVE UPDATES July 24 , 2024", "date": "2024-07-25 08:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-rockets-fired-at-northern-israel-idf-returns-bodies-of-israelis-abducted-to-gaza-on-october-7-live-blog", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Israel - Hamas War day 293: The Israeli army and Shin Bet retrieved the bodies of five Israelis murdered on October 7, both soldiers and civilians.\nRockets from Lebanon targeted Israeli towns between Safed and the border.\nMeanwhile, a shooting in the West Bank wounded three Israelis.\nTwo of them, Magen David Adom, were evacuated to the hospital after emergency medical technicians administered first aid.\nTo catch up on the updates from Wednesday, CLICK HEREFor more updates and in-depth analysis on the Israel-Hamas war", "location": "WEST BANK", "classification": "security", "score": 0.9854159460451167, "event_breakdown": "Event 1: Israeli towns between Safed and the border were targeted by rockets from Lebanon on ThursdayEvent 2: A shooting in the West Bank wounded three Israelis on ThursdayEvent 3: The Israeli army and Shin Bet retrieved the bodies of five Israelis on October 7"}, {"id": "a949f15d-5922-4cd1-b691-894b0bc4910e", "title": "Man charged with attempted murder of senior Army officer after  knife attack  outside ... ", "date": "2024-07-25 07:00", "url": "https://www.lbc.co.uk/news/brompton-barracks-man-charged/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Man charged with attempted murder of senior Army officer after 'knife attack' outside Kent barracksA 24-year-old man has been charged with the attempted murder of an Army officer in uniform near a barracks.\nPicture: LBC/AlamyBy EJ WardA man has been charged with the attempted murder of a uniformed Army officer who was stabbed repeatedly near a barracks in Kent.\nListen to this article Loading audio...Anthony Esan, 24, has been charged with attempted murder over the stabbing of a uniformed Army officer near Brompton Barracks in Gillingham on Tuesday.\nThey said the attack might have been related to mental health, as well as possible links to the barracks.\nPicture: AlamyA statement from Kent Police said: \"Detectives investigating the serious assault of a soldier in Gillingham have charged a man with attempted murder.", "location": "Gillingham", "classification": "security", "score": 0.8907772542120324, "event_breakdown": "* 24-year-old man charged with attempted murder of senior Army officer after 'knife attack' outside Kent barracks* Security guard dies after being shot during attempted cash-in-transit heist in Johannesburg"}, {"id": "3fa6ea19-8bb1-4590-91bc-bd5c936a19e5", "title": "Gillingham barracks stabbing : Anthony Esan charged with attempted murder", "date": "2024-07-25 08:45", "url": "https://www.independent.co.uk/news/uk/crime/gillingham-barracks-stabbing-anthony-esan-b2585578.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A man has been charged with attempted murder over the stabbing of an army officer outside a barracks in Kent.\nThe soldier suffered serious injuries and was airlifted to hospital after the attack in Sally Port Gardens in Gillingham, which happened at 5.55pm on Tuesday.\nForensic officers carrying out a search after a soldier was attacked ( Gareth Fuller/PA Wire )“Detectives investigating the serious assault of a soldier in Gillingham have charged a man with attempted murder,” a spokesperson said.\nOn Tuesday, an Army spokesman said: “We’re very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.", "location": "GILHAM", "classification": "security", "score": 0.874710291470924, "event_breakdown": "A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event, is \"Man charged with attempted murder over stabbing of army officer .\""}, {"id": "4d12d71a-9c3e-4505-9882-c5deed1e6093", "title": "Israel - Hamas war latest : Netanyahu addresses Congress and vows to achieve  total victory  ", "date": "2024-07-25 07:00", "url": "https://www.devdiscourse.com/article/law-order/3029301-israel-hamas-war-latest-netanyahu-addresses-congress-and-vows-to-achieve-total-victory", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Netanyahu has signaled that a cease-fire deal could be taking shape after nine months of war, but during his fiery speech to Congress, he vowed to press forward with Israel's war until he achieves \"total victory.\"\nIt says all five were believed to have been killed in the Oct. 7 Hamas raid that triggered the war.\nPalestinians killed while sheltering inside 2 schools in Gaza, United Nations says United Nations – The United Nations says two schools in southern Khan Younis were hit during military action, killing and injuring Palestinians sheltering inside.\nProtesters cheered as a fire burned what appeared to be a paper-mache likeness of Israeli Prime Minister Benjamin Netanyahu.\nThousands of demonstrators had gathered in Washington to protest Israel's war in Gaza as Netanyahu spoke in front of Congress earlier Wednesday afternoon.", "location": "Washington, D.C.", "classification": "security", "score": 0.5470725858710707, "event_breakdown": "Location: Washington, United States\nDate: 2019-07-23"}, {"id": "54f7ae56-f90a-4f75-b8b2-46fa3c45924b", "title": "77th Infantry Division Colors Return to Guam as Task Force Talon Participates in Liberation Day Parade > U . S . Indo - Pacific Command > News Article View", "date": "2024-07-25 07:45", "url": "https://www.pacom.mil/Media/News/News-Article-View/Article/3849264/77th-infantry-divisions-colors-return-to-guam-as-task-force-talon-participates/", "domain": "pacom.mil", "domain_classification": "Unknown", "message": "A week prior to this year’s celebration, Task Force Talon’s officers and NCOs conducted a staff ride following the footsteps of 77th Infantry Division in their endeavor to secure the island from Imperial Japan.\nTask Force Talon started at the site of initial landing at Agat Beach before hiking up Mt.\nThe Task Force then traveled towards the far north of the island and made a final stop in Yigo to see the monument erected in honor of 77th Infantry Division.\n“It was a real honor to travel with our unit’s colors to Guam and march with Task Force Talon in the Liberation Day Parade to recognize the Soldiers from 77th Infantry Division,” said Command Sgt.\nIn 20 days of fighting, 77th Infantry Division was able to secure the villages of Yona, Barrigada, and eventually Mt.", "location": "Based on the text, the main focus of the main event appears to be Guam.", "classification": "security", "score": 0.6311949241313506, "event_breakdown": "Target event not found"}, {"id": "0167f367-f348-44e5-8f66-4be806727f6e", "title": "French island issues extreme tourist rule after services  stop working  ", "date": "2024-07-25 08:30", "url": "https://www.express.co.uk/news/world/1927730/french-island-where-all-restaurants", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The Ile-de-Brehat is introducing a new tourist quota for AugustA French island has gone to extreme lengths to combat overtourism that has sparked protests across Europe.\nIle-de-Brehat is now introducing a tourism quota as part of measures to tackle overtourism in the region.\nUnder the new measures, from this week until August 23 the maximum number of people allowed on the island is 4,700 between 08.30am and 2.30pm.\nTrendingOne of the main hotspots for anger against overtourism has been the Balearic island of Majorca.\nEarlier this week, another anti-tourism protest rocked the island with over 100 groups taking part in the demonstration in Palma.", "location": "Ile-de-Brehat", "classification": "security", "score": 0.4620576801693758, "event_breakdown": "Reported June 17, 2023, 11:00 PM\nThe recent influx of tourism into Majorca is posing new problems for the government, overtourism has sparked protests and demonstrations this past week on the island.\nSpain\nReported April 27, 2023, 6:00 PM\nThe finical district of Bilbao has been suffering with rampant violence due to the influx of Tourists into the city. The mayor recently declared a curfew to be set from May 1st until June 1st kept in check by the Spanish national police.\nSpain\nReported May 2, 2023, 6:25 AM\nBiarritz is a city on the lower southwest coast of the Bay of Biscay. The aesthetic values and appearance of the city are being affected by the massive flood of young Russians. They arrive by the busload and make the city's beaches their permanent base for months, profaning and marking the area. Rumors are that other Spanish cities are next in line for this tourist phenomenon\nReported June 15, 2023, 11:45 AM\nIn light of the recent influx of crime and hatred directed at the TOURISTS by the establishment and citizenry in the french seaside town of Pais Vasco, regional investigators have sought vengeance on the perpetrators."}, {"id": "176a980d-3130-4cf5-981d-896030fe75de", "title": "Israeli army recovers bodies of 5 hostages from Gaza", "date": "2024-07-25 08:30", "url": "https://www.scmp.com/news/world/middle-east/article/3271843/israeli-army-recovers-bodies-5-hostages-gaza", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Israeli forces retrieved the remains of five Israelis, killed during Hamas’ October 7 attack on southern Israel, whose bodies had been taken to the Gaza Strip, the military said Thursday.\nMilitants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead.\nThe Hostages and Missing Families Forum insisted that the Israeli government agree to a ceasefire deal that could help return the remaining captives.\nRelatives and friends of hostages held in the Gaza Strip march during a rally calling for their release in Tel Aviv, Israel.\n“It has now become apparent that the information provided to the hostages’ families did not accurately reflect the situation’s reality,” the forum said in the latest statement.", "location": "Gaza Strip", "classification": "security", "score": 0.8333720770286257, "event_breakdown": "Israeli forces retrieve remains of five Israelis killed during Hamas’ October 7 attack on southern Israel."}, {"id": "3626814d-762b-418b-b74b-c8cf5037aebb", "title": "Hot Toys unveils new Battle Damaged Darth Vader Star Wars sixth scale figure", "date": "2024-07-25 00:15", "url": "https://www.flickeringmyth.com/hot-toys-unveils-new-battle-damaged-darth-vader-star-wars-sixth-scale-figure/", "domain": "flickeringmyth.com", "domain_classification": "Unknown", "message": "Hot Toys has released promotional images for the latest addition to its Star Wars sixth scale collectibles line with a new Darth Vader deluxe figure, which comes with a number of accessories and alternative pieces to showcase a Battle Damaged rendition of the Dark Lord of the Sith; take a look at the official promotional images here…Hot Toys is excited to officially present a new Deluxe Version 1/6th scale collectible figure of the battle damaged Darth Vader as the latest addition to the dark side of your Star Wars collection!\nThe stunning collectible figure is meticulously developed that showcases the detailed flesh and cybernetic parts of the menacing Sith Lord.\nWhat’s more, this Deluxe Version a damaged helmet revealing the visage of Lord Vader and a specially designed interchangeable cape with silhouette of Darth Vader’s helmet for dedicated collectors.\nA Special Edition available in selected markets will include a damaged Darth Vader mask as bonus accessory.\nEmbrace the dark side and add this incredible collectible figure into your collection!", "location": "The main location where the main event takes place is \"Starkiller Base\".", "classification": "security", "score": 0.6581407802728549, "event_breakdown": "Here is an event from September 15, 2022, in Donetsk, Ukraine. It was reported that a rebel was killed and four others were injured during the shelling of the occupied part of the Donetsk Region."}, {"id": "2b557f54-7fc6-4efd-bc5b-23da6340c87b", "title": "Russian UAVs Again Enter NATO Airspace During Drone Attack on Ukraine", "date": "2024-07-25 11:15", "url": "https://www.kyivpost.com/post/36352", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Russian troops launched a drone attack on Ukraine early Thursday, July 25, with three of the 38 drones straying into NATO airspace in Romania, according to Air Force Commander Mykola Oleschuk via Telegram.\nThe Air Force reported that Russian troops deployed 38 Shahed-131/136 attack UAVs, targeting Ukrainian infrastructure in several regions, including the southern Odesa region and central Ukraine.\nThe air attack was repelled by anti-aircraft missile troops, electronic warfare units of the Air Force, and mobile fire groups of the Ukrainian Defense Forces.\nRussian drones enter Romania, againAdvertisementThe Ukrainian Air Force reported that three more Shahed drones crossed the national border into Romania.\nResidents were warned about the danger of falling debris from Russian drones, according to local publication Digi24.", "location": "Ukraine", "classification": "security", "score": 0.8827252159983151, "event_breakdown": "Here are the relevant events:\nRussian troops launched a drone attack on Ukraine early Thursday, July 25, with three of the 38 drones straying into NATO airspace in Romania."}, {"id": "d181b2c9-e6ff-4547-96e6-74258a217be2", "title": "Russian Attacks Kill 3 , Damage Swiss NGO Office in Kharkiv , Ukraine Says", "date": "2024-07-25 11:15", "url": "https://chronicle.lu/category/international-news/50826-russian-attacks-kill-3-damage-swiss-ngos-office-in-kharkiv-ukraine-says", "domain": "chronicle.lu", "domain_classification": "Unknown", "message": "Ukraine's second-largest city and the surrounding region, which borders Russia, have been battered by drone, missile and guided-bomb attacks since Moscow launched its full-scale invasion in February 2022.\nRegional police said a strike on the town of Lozova, south of Kharkiv, killed three people and injured six, with rescue operations proceeding into the evening.\nThe region's governor, Oleh Syniehubov, said an overnight strike destroyed the facade of the Fondation suisse de déminage's office and the ceilings of several of its floors.\nMayor Ihor Terekhov said there had been five separate strikes on the city since Russia's overnight attack.\nRussia denies deliberately targeting civilians but thousands have been killed and injured in its 29-month-old invasion of Ukraine.", "location": "Kharkiv", "classification": "security", "score": 0.9911444627723748, "event_breakdown": "List of current events:\nStrike hits Ukraine city, kills three, injures six\nRussian forces strike Kharkiv, destroying office facade\nStrikes hit Kharkiv five times since Russia's overnight attack"}, {"id": "a3b95176-5ba0-4b5a-b698-f4ddcf54b710", "title": "Soldier stabbed outside army barracks in Kent pictured for first time", "date": "2024-07-25 11:15", "url": "https://www.lbc.co.uk/news/soldier-stabbing-gillingham-kent-chatham-brompton-barracks/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Pictured: Soldier stabbed outside army barracks is Lieutenant Colonel and father-of-twoLt Col Mark Teeton was airlifted to hospital after being stabbed around 12 times.\nPicture: Social mediaBy Flaminia LuckA soldier who was repeatedly stabbed outside an army barracks in Kent has been pictured for the first time.\nThe attack took place just yards from Brompton Barracks, in Gillingham, home of the 1 Royal School of Military Engineering Regiment.\nRead more: British soldier fighting for life after being 'stabbed in frenzied attack outside barracks' - as man, 24, arrestedRead more: Police 'being supported by counter-terror officers' as they investigate stabbing of soldier outside barracksThere is a heavy police presence in the area.\nPicture: LBCA statement from Kent Police said: \"Detectives investigating the serious assault of a soldier in Gillingham have charged a man with attempted murder.", "location": "Gillingham", "classification": "security", "score": 0.7540291252177777, "event_breakdown": "Picture: Social mediaLance Corporal Reservist, 29, was knifed outside army barracks in Gillingham, KentA soldier was repeatedly stabbed in front of members of his unit who were due to be deployed to Eastern Europe, a court has heard.\nThe attackers wore balaclavas and launched their attack outside the Royal School of Military Engineering in Brompton Road, Gillingham, shortly before 6am on February 5.\nThe 29-year-old victim, who has been named on social media and who also lives there, is said to have been raising funds for charity at the time of the attack.\nA man, 28, and a 24-year-old woman, both from the Medway area, have been arrested."}, {"id": "30f000d0-7224-42df-ac7d-4efdfc44cf77", "title": "Ukraine Defence Intelligence identifies Russians who fire Iskanders on Kharkiv and Sumy oblasts", "date": "2024-07-25 11:00", "url": "https://www.yahoo.com/news/ukraines-defence-intelligence-identifies-russians-090856399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's Defence Intelligence identifies Russians who fire Iskanders on Kharkiv and Sumy oblasts – photoWar criminals from the 112th Missile Brigade of the First Guards Tank Army of the Russian Armed Forces.\nSource: press service of Defence Intelligence of UkraineDetails: The Russians use Iskander operational and tactical systems in attacks against Ukrainian civilians.\nThe Russians use these weapons, in particular, to attack the Sumy and Kharkiv oblasts of Ukraine.\nWar criminals from the 112th Missile Brigade of the 1st Guards Tank Army of the Russian Armed Forces.\nMore information: The full list of Russian war criminals is available on the DIU website in Ukrainian.", "location": "Ukraine.", "classification": "security", "score": 0.9487345153261169, "event_breakdown": "Russians are indiscriminately using Iskander operational-tactical systems to attack Ukrainian civilians in the Sumy and Kharkiv oblasts. They are doing so with iskander system. In some of the news platforms Russia is being lead by the war criminal, Putin. The war criminal will try anything within their power to win the war against Ukraine."}, {"id": "0bc76dd1-2fc6-4f7e-addf-6c81df9e3837", "title": "Man charged with attempted murder of Brit Army officer as cops give update on condition", "date": "2024-07-25 10:00", "url": "https://www.dailystar.co.uk/news/latest-news/breaking-man-charged-attempted-murder-33320930", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nKent Police have said Anthony Esan, 24, has been charged after the officer was attacked near a barracks in Gillingham, Kent.\n\"Detectives investigating the serious assault of a soldier in Gillingham have charged a man with attempted murder,\" said the force in a statement.", "location": "Gillingham", "classification": "security", "score": 0.8125045268125913, "event_breakdown": "New, Improved Answer!\nNew, Improved Answer!\nNew, Improved Answer!"}, {"id": "dbf014e7-2d3f-47d4-a761-499c6f020b5f", "title": "Israeli forces advance in southern Gaza , tanks active in Rafah", "date": "2024-07-25 14:30", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-advance-in-southern-gaza-tanks-active-in-rafah/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Hamas militants took more than 250 hostages in the early morning raid into southern Israel and killed 1,200 people, according to Israeli tallies.\nIsrael retaliated by vowing to eradicate Hamas in Gaza in a nine-month war that has killed more than 39,000 Palestinians, Gaza health officials say.\nSeveral were wounded in the eastern towns during Israeli tank and aerial shelling, while an airstrike east of Khan Younis killed four people, Palestinian health officials said.\nIsraeli bombardment intensified in several areas in Rafah, near the border with Egypt, as tanks operated north, west and in the town centre, residents and medics said.\nThe Israeli military said forces operating in Khan Younis killed dozens of militants and dismantled around 50 military infrastructures, while it continued activities in Rafah, killing two militants.", "location": "Gaza", "classification": "security", "score": 0.9882162936391381, "event_breakdown": "Israel operation against Hamas militants in the Gaza Strip\nIsraeli military shelling on eastern towns of Rafah and Khan Younis"}, {"id": "a009228c-8c4f-4014-9362-e915562ad7bc", "title": "Russian Iskander - M Hits Foreign Mercenary Temporary Deployment Site in Kharkov", "date": "2024-07-25 11:00", "url": "https://sputnikglobe.com/20240725/russian-iskander-m-hits-foreign-mercenaries-temporary-deployment-site-in-kharkov---mod-1119497113.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240725/russian-iskander-m-hits-foreign-mercenaries-temporary-deployment-site-in-kharkov---mod-1119497113.htmlRussian Iskander-M Hits Foreign Mercenary Temporary Deployment Site in Kharkov - MoDRussian Iskander-M Hits Foreign Mercenary Temporary Deployment Site in Kharkov - MoDSputnik InternationalRussia's Iskander-M missile defense system struck a temporary deployment site for foreign mercenaries in the industrial zone of the city of Kharkov, killing up to 100 military personnel, including 40 foreign instructors, the Russian Ministry of Defense (MoD) said on Thursday.\n2024-07-25T09:07+00002024-07-25T09:07+00002024-07-25T09:38+0000russia's special operation in ukrainekharkovrussian ministry of defenseiskander-mmercenariesmissile systemhttps://cdn1.img.sputnikglobe.com/img/07e8/05/06/1118290030_0:0:3077:1731_1920x0_80_0_0_0fab81368c6aeac5019e3f3578ab0396.jpg\"The crew of the Iskander-M operational-tactical missile system carried out a missile strike on the temporary deployment site of foreign mercenaries in ... the industrial zone of the city of Kharkov.\nAs a result of the strike, up to 100 militants were killed, of which 40 were foreign instructors, as well as about 60 servicemen of the 151st mechanized brigade of the Ukrainian armed forces,\" the ministry said in a statement.The Russian Ministry of Defense has previously reported the elimination of mercenaries from the United States, the United Kingdom, Georgia, and other countries, and regularly reports on the destruction of locations where foreigners fighting for Kiev are concentrated.\nkharkovSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik Internationalrussia’s special military op in ukraine, special military operation, special military operational zone, special op zone, russian troops in special op zone, ukraine casualties in conflict, total ukrainian losses, how many people did ukraine loose, how many people did kiev loose, new russian weapons in ukraine, advanced russian weapons, russian defense ministry statements, latest russian military statements, what did shoigu say about ukraine, donetsk people’s republic, nato in ukraine, is nato in ukraine, russian drones, drone warfare, new military drones, uavs in ukraine, ukraine crisis, ukraine conflict, battlegroup sever, battlegroup yug, battlegroup zapad, battlegroup vostok, battlegroup tsentr, battlegroup dnepr, russia ukraine peace talks, russia ukraine peace settlement, russia ukraine negotiations, russian air defenses", "location": "Kharkov", "classification": "security", "score": 0.7853636777622234, "event_breakdown": "The Russian Ministry of Defense (MoD) has stated on July 28th, 2024, that the Russian Iskander-M missile system conducted an airstrike on a temporary deployment site for foreign mercenaries. According to the MoD, the strike resulted in the deaths of up to 100 militants. The Russian MoD reports that 40 of the militants killed were foreign instructors. The strike in Kharkov, which is a major Ukrainian industrial hub, targeted a foreign mercenary encampment, and resulted in the death of 60 Ukrainian Armed Forces military personnel."}, {"id": "9ac3f2a9-585d-4a72-962f-f107eb78cc2e", "title": "Putin forces are humiliated in footage from one of the biggest recent assaults of the Ukraine war that ended in huge losses : Russia says it is ready for peace talks as it faces losing  1 . 8 MILLION troops  ", "date": "2024-07-25 12:30", "url": "https://www.dailymail.co.uk/news/article-13671481/Putins-forces-humiliated-footage-one-biggest-recent-assaults-Ukraine-war-ended-huge-losses-Russia-says-ready-peace-talks-faces-losing-1-8-MILLION-troops.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "This is the moment Vladimir Putin's forces were left humiliated when one of his biggest recent assaults of his war on Ukraine ended in substantial losses.\nUkrainian paratroopers destroyed six Russian tanks and seven advancing armoured combat vehicles as they were hit by kamikaze drones, it said.\nThe brutal attack reportedly involved some 57 armoured vehicles, 11 tanks, 12 motorcycles, and 200 assault vehicles.\nUkraine's brigade had spotted the Russian equipment in advance and unleashed fury upon Moscow's forces through relentless artillery fire.\nThe Russians used 11 tanks, and 45 armoured combat vehicles plus one Terminator tank support combat vehicle.", "location": "LVIV OBLAST, UKRAINE", "classification": "security", "score": 0.9389126008401195, "event_breakdown": "Vladimir Putin's forces were left humiliated when one of his biggest recent assaults of his war on Ukraine ended in substantial losses:\n- Ukrainian paratroopers destroyed six Russian tanks and seven advancing armoured combat vehicles as they were hit by kamikaze drones.\n- The brutal attack reportedly involved some 57 armoured vehicles, 11 tanks, 12 motorcycles, and 200 assault vehicles.\n- Ukraine's brigade had spotted the Russian equipment in advance and unleashed fury upon Moscow's forces through relentless artillery fire.\n- The Russians used 11 tanks, and 45 armoured combat vehicles plus one Terminator tank support combat vehicle."}, {"id": "8a5d93a3-1de6-49cc-b028-a432511af45d", "title": "Charles de Gaulle : France Has One of the Best Aircraft Carriers on Earth", "date": "2024-07-25 12:30", "url": "https://nationalinterest.org/blog/buzz/charles-de-gaulle-france-has-one-best-aircraft-carriers-earth-210327", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The French Navy's Charles de Gaulle (CDG) is the only nuclear-powered aircraft carrier outside the U.S. Navy's fleet.\nSummary and Key Points: The French Navy's Charles de Gaulle (CDG) is the only nuclear-powered aircraft carrier outside the U.S. Navy's fleet.\nMeet Charles de Gaulle: The French Navy's Nuclear-Powered Aircraft CarrierThe Second World War saw the advent of aircraft carriers as the premier warship of the seas.\nAircraft Carrier Charles de Gaulle - Specs & capabilities:The Charles de Gaulle has its roots in the 1980s.\nThe resultant design was a nuclear-powered aircraft carrier with an angled deck and steam catapults.", "location": ".\nThe location cannot be determined based on the given information.", "classification": "security", "score": 0.8828852574344503, "event_breakdown": "Target event:\nThe French Navy's Charles de Gaulle (CDG) is the only nuclear-powered aircraft carrier outside the U.S. Navy's fleet."}, {"id": "87b03677-d265-471d-948a-996dc7c25ea3", "title": "Newport | History , Attractions & Beaches", "date": "2024-07-25 10:00", "url": "https://www.britannica.com/place/Newport-Rhode-Island", "domain": "britannica.com", "domain_classification": "Unknown", "message": "Newport, city, Newport county, southeastern Rhode Island, U.S.\nPrinting in Rhode Island was begun at Newport in 1727 by James Franklin, an older brother of Benjamin.\nThe British occupation of Newport (1776–79) during the American Revolution resulted in the flight of merchants to the mainland.\nHarrison, Peter: Redwood Library The Redwood Library and Athenaeum, Newport, Rhode Island; designed by Peter Harrison.\nThe International Tennis Hall of Fame and Museum (founded 1954) is in the Newport Casino (1880).", "location": "Newport, Rhode Island", "classification": "security", "score": 0.7402342504249086, "event_breakdown": "The International Tennis Hall of Fame and Museum is in the Newport Casino (1880)."}, {"id": "4e1886d1-4529-4a62-8959-2cd36cea5de7", "title": "Israeli Forces Retrieve Bodies of 5 Hostages From Gaza , Military Says", "date": "2024-07-25 14:15", "url": "https://www.theepochtimes.com/world/israeli-forces-retrieve-bodies-of-5-hostages-from-gaza-military-says-5693416", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "JERUSALEM—Israeli forces recovered on Wednesday the bodies of five hostages killed in the Hamas terrorist group’s Oct. 7 attack and held in Gaza since, the Israeli military said.\nThe other four hostages were two reserve soldiers and two conscript soldiers killed in combat during the Oct. 7 attack, the military said.\nTheir bodies were retrieved from the area of Khan Younis in southern Gaza, where Israeli forces launched new raids this week.\nAn Israeli delegation would participate in talks to secure a Gaza ceasefire and hostage release—mediated by the United States, Egypt, and Qatar—next week, an Israeli official said on Wednesday.\nHamas wants a ceasefire agreement to end the war in Gaza, but Mr. Netanyahu says the war cannot end before Hamas is defeated.", "location": "GAZA", "classification": "security", "score": 0.8870396088662896, "event_breakdown": "Israeli soldiers recovered five bodies from the Hamas terrorist group's Oct. 7 attack held in Gaza since, while negotiations over the Gaza war continues."}, {"id": "8ef903c1-9727-420a-ad6e-d63d7755c87a", "title": "Israel strikes Gaza as military recovers five captive bodies", "date": "2024-07-25 14:15", "url": "https://www.al-monitor.com/originals/2024/07/israel-strikes-gaza-military-recovers-five-captive-bodies", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "A group supporting Israeli hostages still held in the Palestinian territory welcomed the rescue but alleged \"sabotage\" of efforts to free others.\nOut of 251 people taken hostage that day, 111 are still held in Gaza, including 39 the military says are dead.\n- 'Crisis of trust' -An AFP correspondent reported air strikes and machine gun fire from tanks in Gaza City.\nIsrael's military said the five bodies recovered from Gaza, including those of two soldiers and two reservists, had been returned to Israel following a rescue operation on Wednesday in Khan Yunis.\nWashington has been increasingly alarmed by the humanitarian toll of the Gaza war, but in his speech to Congress, Netanyahu dismissed \"all the lies\" about civilian fatalities.", "location": "GAZA CITY", "classification": "security", "score": 0.8020975116314439, "event_breakdown": "Air strikes in Gaza City and machine gun fire from tanks reported"}, {"id": "47b4f7d8-5b28-4252-b527-ffa3157b6619", "title": "kargil vijay diwas : Marking 25th year of Kargil War , Army shows , exhibitions draw attention in Shimla", "date": "2024-07-25 10:00", "url": "https://economictimes.indiatimes.com/news/defence/marking-25th-year-of-kargil-war-army-shows-exhibitions-draw-attention-in-shimla/articleshow/112012628.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelMarking the 25th anniversary of the Kargil War , the Headquarters of the Army Training Command (ARTRAC) in Shimla is celebrating the ' Kargil Vijay Diwas Rajat Jayanti Mahotsav.\n\"This initiative on Kargil Vijay Diwas commemorates 25 years of victory and promotes entrepreneurship.\nIt also educates the public about the Indian Army ,\" said Archana Jha, an entrepreneur and Army spouse.The event has also sparked enthusiasm among the youth, particularly the National Cadet Corps ( NCC ) members.\n\"My aim is to join the Indian Army.\n527 soldiers gave the ultimate sacrifice in the battle that took place in the Kargil region of Jammu and Kashmir.", "location": "Shimla", "classification": "security", "score": 0.6202924592148333, "event_breakdown": "target event not found"}, {"id": "d106aaf2-136e-4456-8be1-bf71ec6c650c", "title": "House of the Dragon Season 2 : Will Aegon Walk Again in The Future ? ", "date": "2024-07-25 10:00", "url": "https://www.pinkvilla.com/entertainment/hollywood/house-of-the-dragon-season-2-will-aegon-walk-again-in-the-future-1331842", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "King Aegon II Targaryen remains bedridden after the Battle at Rook's Rest in House of the Dragon season 2, facing danger from Aemond and his political adversaries.\nAegon walks again but he never fully recoversIn House of the Dragon season 2, episode 6, George R.R.\nThe House of the Dragon's King Aegon II Targaryen is succeeded by Rhaenyra's surviving son Aegon III Targaryen, leaving no sons or brothers behind.\nAs Aegon recovers in House of the Dragon, Aemond may attempt to ascend the Iron Throne.\nAs such, giving Aegon his stone ball for the Small Council has a scary deeper meaning for his fate in House of the Dragon.", "location": "King's Landing", "classification": "security", "score": 0.6076017583280258, "event_breakdown": "Security alert in King's Landing for Aegon Targaryen."}, {"id": "c4ea8556-abd7-4a51-abc0-c30ec92c1fdf", "title": "Soldier to be imprisoned for distributing videos from Gaza", "date": "2024-07-25 10:15", "url": "https://www.israelnationalnews.com/news/393608", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF has decided to try the soldier in a disciplinary court and he is expected to receive a prison sentence.\nThe bodies were recovered from the Khan Yunis during an IDF operation led by ISA field analysts and coordinators, the statement said.\nOren Goldin, Staff Sergeant Tomer Ahimas, and Sergeant Kiril Brodski fell in combat during the brutal October 7th attack, and their bodies were abducted to the Gaza Strip.\nOren Goldin, Staff Sergeant Tomer Ahimas and Sergeant Kiril Brodski.\nStaff Sergeant Ahimas fell during the battle in Nirim on October 7.", "location": "Gaza.", "classification": "security", "score": 0.7565810809104747, "event_breakdown": "IDF operation takes place in Khan Yunis.\nIDF operation takes place in Nirim.\nPassing of Oren Goldin, Staff Sergeant Tomer Ahimas, and Sergeant Kiril Brodski on October 7th."}, {"id": "a0733cdb-6943-473c-ae4a-bac5afa25b9f", "title": "The Critical Role of Intelligence in National Defence", "date": "2024-07-25 13:15", "url": "https://www.jagranjosh.com/general-knowledge/what-was-the-role-of-intelligence-agencies-during-kargil-war-1721906258-1", "domain": "jagranjosh.com", "domain_classification": "Unknown", "message": "The Kargil War presented unique challenges and underscored the critical role of intelligence agencies in safeguarding national security.\nIntelligence agencies play a crucial role in gathering, analysing, and disseminating information, which is essential for making informed strategic and tactical decisions during conflicts.\nGathering Tactical Intelligence: Once the infiltration was detected, intelligence agencies, including RAW and military intelligence, focused on gathering detailed information about the enemy's positions, strength, and logistics.\nConclusionThe Kargil War was a stark reminder of the critical role of intelligence in safeguarding national security.\nWhile the initial intelligence failures were a setback, the subsequent response and reforms demonstrated the resilience and adaptability of the Indian intelligence community.", "location": "Kargil", "classification": "security", "score": 0.5029108256812441, "event_breakdown": "RAW and military intelligence focused on gathering detailed information about the enemy's positions, strength, and logistics."}, {"id": "60ead3f7-31d8-413a-8a76-984d2e30c8d2", "title": "Netanyahu defends Gaza war as protesters rally outside US Congress", "date": "2024-07-25 07:00", "url": "https://www.the-star.co.ke/news/world/2024-07-25-netanyahu-defends-gaza-war-as-protesters-rally-outside-us-congress/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "\"When we fight Iran, we're fighting the most radical and murderous enemy of the United States of America,\" Mr Netanyahu said.\nBut growing political divisions over the war in Gaza were underscored by the dozens of Democratic members of Congress deliberately not present and thousands of protesters on the streets outside.\nAddressing the protestors, Mr Netanyahu said: \"You have officially become Iran's useful idiots.\"\nOutlining his vision for the Gaza Strip after the war, he called for \"a demilitarised and deradicalised\" enclave under Israeli military control.\nAlmost all were Democrats, among them influential former Speaker of the House Nancy Pelosi, who said it was \"inappropriate\" for Mr Netanyahu to visit.", "location": "WASHINGTON", "classification": "security", "score": 0.5495395056963914, "event_breakdown": "Gaza"}, {"id": "2d042f88-e589-48a0-a57d-c2da4739b7c1", "title": "J - K : Two JeM associates arrested in Kathua terror attack case", "date": "2024-07-25 11:15", "url": "https://www.thestatesman.com/india/j-k-two-jem-associates-arrested-in-kathua-terror-attack-case-1503324435.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "In a breakthrough, the J&K Police on Thursday arrested two Jaish-e-Mohammad (JeM) associates who facilitated the terrorist attack that claimed the lives of five Army soldiers and injured as many in the Kathua district of Jammu earlier this month.\nPolice said that two JeM associates have been arrested from the hilly area of the Kathua district.\nThey have been identified as Layaqat Ali of tehsil Billawar and Mool Raj of tehsil Malhar in Kathua district.\nFive security personnel were killed when terrorists ambushed an Army vehicle in Badnota village, 150 away from Kathua town on 8 July.\nA massive search operation has been launched in the bordering areas of Kathua (Jammu) and Pathankot.", "location": "Jammu", "classification": "security", "score": 0.9895226702379594, "event_breakdown": "Target event:\nJ&K Police on Thursday arrested two Jaish-e-Mohammad (JeM) associates who facilitated the terrorist attack that claimed the lives of five Army soldiers and injured as many in the Kathua district of Jammu earlier this month."}, {"id": "3924bcb7-48bc-428e-a23c-09826c4ea84a", "title": "Athens signs deal to buy 20 US - made F - 35 jets in major military overhaul – Winnipeg Free Press", "date": "2024-07-25 14:30", "url": "https://www.winnipegfreepress.com/world/2024/07/25/athens-signs-deal-to-buy-20-us-made-f-35-jets-in-major-military-overhaul", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ATHENS, Greece (AP) — Greece formally approved an offer to buy 20 F-35 Joint Strike Fighters from the United States as part of a major defense overhaul, government officials said Thursday.\n“The letter of acceptance for the F-35s has been signed and sent to the United States,” Defense Minister Nikos Dendias said while visiting a military air base near Athens.\nThe purchase of the first 20 jets along with additional support will cost some $3.5 billion, Greek officials said.\nTurkey was dropped from the F-35 program five years ago over its decision to buy Russian-made S-400 surface-to-air missile system, a move seen in the United States as a compromise to NATO security.\nAthens has been seeking an advantage in the air since Turkey’s exclusion from F-35 purchases and has also acquired advanced French-made Rafale fighter jets.", "location": "GREECE", "classification": "security", "score": 0.5694017664023022, "event_breakdown": "F-35 Joint Strike Fighters - Greece formally approved an offer to buy 20 F-35 Joint Strike Fighters from the United States as part of a major defense overhaul, government officials said Thursday."}, {"id": "17fce0e2-51f1-41e1-a340-cfce399ecb64", "title": "Sure , 2024 has had lots of news but here are 3 newsier years", "date": "2024-07-25 11:00", "url": "https://www.tampabay.com/opinion/2024/07/25/sure-2024-has-had-lots-news-here-are-3-newsier-years/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "-- Jan. 30: North Vietnamese and Viet Cong forces launch the Tet Offensive, undermining claims that the U.S. is winning the Vietnam War.\n-- March 16: New York U.S. Sen. Robert F. Kennedy announces his campaign for the Democratic presidential nomination.\nThe Vietnam War ended after almost 60,000 Americans and millions of civilians were killed.\n-- Jan. 27: The Vietnam War officially ends with the signing of the Paris Peace Accords.\nThat helped set the stage for the calamitous Democratic convention that year.", "location": "Vietnam", "classification": "security", "score": 0.5979733760681355, "event_breakdown": "target event\nThe Vietnam War officially ends with the signing of the Paris Peace Accords on Jan. 27."}, {"id": "563b1424-dbc3-4919-8042-39a234d60e78", "title": "Gaza Journalists Killed After Israel Warned About Wrong Building", "date": "2024-07-25 18:00", "url": "https://theintercept.com/2024/07/24/gaza-journalists-israel-airstrike-babel-haji/", "domain": "theintercept.com", "domain_classification": "Unknown", "message": "Haji Tower is home to local and international media offices, including Agence France-Presse.\nVideo: Mohammed SkaikWhen the airstrike finally came, it did not hit al-Ghefari nor Haji Tower.\nOne of the eyewitnesses heard it on speakerphone, and the other two heard it directly from the Israeli officer.\n“Haji building?\nWe’ve learnt that through our coverage of wars.”Inside the AFP’s Haji Tower office, staff gathered cameras, tripods, press vests, and helmets.", "location": "JERUSALEM", "classification": "security", "score": 0.9162997080837348, "event_breakdown": "Location: Gaza Strip\nEvent: Israeli airstrikes in the Gaza Strip\nDate: November 14th, 2018\nThe Israeli air force bombed the Gaza Strip on Wednesday morning, causing panic among residents, witnesses and security officials said.\n\nIsraeli media said the strikes targeted a Hamas facility in the southern Gaza Strip.\n\nAn AFP photographer in Gaza City heard the explosions and shook their homes.\n\nThe Israeli military said that fighter jets attacked \"terrorist infrastructure\" in the Gaza Strip in response to the firing of a rocket late Tuesday from Gaza towards Israeli territory.\n\nThe army accused the international community of being mute in the face of continuous \"terrorism\" coming from the Gaza Strip, unlike the Palestinian side that is holding indirect negotiations with Israel under the auspices of the United Nations and Egypt."}, {"id": "9f8abbab-7208-4816-8073-b7970745b7da", "title": "Three Russian  Shahed Disappear In Romania During Attack In Odesa Region - Belarusian News", "date": "2024-07-25 14:45", "url": "https://charter97.org/en/news/2024/7/25/604152/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Three Russian ‘Shaheds’ Disappear In Romania During Attack In Odesa Region 4 25.07.2024, 9:485,982The Ukrainian Air Forces have disclosed the details.\nThe Ukrainian Air Forces said that several Russian ‘Shaheds’ flew into the territory of Romania and disappeared there.\n‘This night the enemy used 38 Shahed-131/136 strike UAVs, attacking Ukrainian infrastructure in several directions, in particular - the south of Odesa region and central regions of Ukraine.\nIzmail District Under Attack AgainThe Odesa City State Administration reported that for the second night in a row the Russian Armed Forces resorted to shelling of the south of Odesa Region.\nEmployees of the State emergency service promptly eliminated the fire,' informed the Chairman of the Odesa city state administration Oleg Kiper.", "location": "ODESSA", "classification": "security", "score": 0.8172773294519724, "event_breakdown": "Russian ‘Shaheds’ Disappear In Romania During Attack In Odesa Region - The Ukrainian Air Forces said several Russian ‘Shaheds’ flew into the territory of Romania and disappeared. - The Odesa City State Administration reported that the Russian Armed Forces resorted to shelling the south of Odesa Region for the second night in a row."}, {"id": "0f7b5faf-c727-4e84-ab63-6b96f4259b5c", "title": "1 killed , 2 injured in Israeli airstrike on Lebanese village - Xinhua", "date": "2024-07-25 14:45", "url": "https://english.news.cn/20240725/c462bf91ea2040aeb93ecacbeb3a021a/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 25 (Xinhua) -- An Israeli airstrike killed a Hezbollah member and wounded two others on Thursday in the village of Rab Thalathine in southern Lebanon, Lebanese military sources told Xinhua.\nA civil defense ambulance transported the body of the deceased, identified as Abdullah Mohammad Fakih, and the two wounded to a hospital in the border area.\nMilitary sources noted that Israeli warplanes and air forces conducted three raids on Thursday on three towns and villages in the eastern sector of the border area.\nIsraeli artillery also bombed seven towns and villages in the eastern, central, and western sectors with about 35 shells, causing material damage and three fires that Civil Defense worked to extinguish.\nEarly on Thursday, resistance fighters fired anti-aircraft missiles at Israeli warplanes inside Lebanese airspace, forcing them to retreat behind the Lebanese border with Israel, according to Hezbollah.", "location": "BEIRUT", "classification": "security", "score": 0.9953225806912058, "event_breakdown": "Israeli airstrike kills Hezbollah member, wounds two in southern Lebanon\nIsraeli air forces conducted three raids on three towns and villages in the eastern sector of the border area, military sources said.\n\nLebanese Civil Defense extinguished three fires caused by Israeli artillery, which targeted seven towns and villages."}, {"id": "a97e2aa1-0c1d-4404-a648-b6f3781a6bef", "title": "Analysis - Battered Hamas confounds Israel bid to declare victory", "date": "2024-07-25 15:30", "url": "https://gazette.com/news/us-world/analysis-battered-hamas-confounds-israels-bid-to-declare-victory/article_889aa35d-5255-5149-9f5a-af10ca0f2d44.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Early in the war, Hamas propaganda videos showed well-drilled fighters in body armour and battle fatigues, their torsos wrapped with ammunition belts.\nThat has left its command fragmented and reliant on messages delivered in person to avoid Israeli surveillance, the Palestinian sources said.\nOne Palestinian source with knowledge of Hamas military tactics said personnel losses and the destruction of the communications network meant centralised decision-making had collapsed.\nPalestinian sources have confirmed the deaths of several leading Hamas military commanders.\nAn Israeli military official on Monday told Reuters that while a lot of Hamas military infrastructure, including tunnels, has been destroyed there was still much more to be done.", "location": "GAZA", "classification": "security", "score": 0.8084142973421984, "event_breakdown": "1- Palestinian sources say that Hamas' attempts to communicate are more difficult after a lot of communication infrastructure was destroyed by Israel.\n2- Israeli military official told Reuters that they plan on taking down more Hamas infrastructure, specifically targetting tunnels."}, {"id": "1d789f30-6ccf-47d5-b12f-f87aedfb6f47", "title": "Suspected ATM bomber killed in shootout with police in KZN", "date": "2024-07-25 15:30", "url": "https://www.citizen.co.za/news/south-africa/crime/suspected-atm-bomber-killed-gun-battle-police-kzn/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Suspected ATM bomber killed in shootout with police in KZNThe shootout happened when police officers responded to reports of an ATM bombing.\nA suspected ATM bombing suspect was arrested and another fatally wounded in a shootout with police in KwaZulu-Natal.\nPolice spokesperson Colonel Robert Netshiunda said officers responded to reports of an ATM bombing when the shootout happened.\nThe shootout took place in the Congo area of Inanda.\nAfter the shootout, three suspects were found to have sustained fatal gunshot wounds and were declared dead at the scene.", "location": "KWA ZULU-Natal", "classification": "security", "score": 0.9982631232578087, "event_breakdown": "Suspected ATM bomber killed in shootout with police in KZN"}, {"id": "4ec64467-5212-4ebc-8d21-f0f2c1be0552", "title": "A look at Netanyahu claims about Israel , Hamas and Iran during his Congress speech", "date": "2024-07-25 10:15", "url": "https://www.naharnet.com:443/stories/en/306777-a-look-at-netanyahu-s-claims-about-israel-hamas-and-iran-during-his-congress-speech", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Others condemned Netanyahu's inability to free Israeli and American hostages taken by Hamas and other militants during the Oct. 7 attack that sparked the conflict.\nIf there are Palestinians in Gaza who aren't getting enough food, it's not because Israel is blocking it.\nIn April, an Israeli airstrike killed seven aid workers in an incident that Israel said was caused by human error.\nHe didn't discuss accusations that he believed Hamas was deterred when in fact it was preparing a major assault on Israel.\nIn fact, public support for Netanyahu has plummeted since Oct. 7, with many blaming Netanyahu for the Hamas attacks.", "location": "GAZA", "classification": "security", "score": 0.8622940743879661, "event_breakdown": "1. On April 23, 2022, seven aid workers were killed in an Israeli airstrike in Gaza.\n2. On October 7, 2021, Hamas militants carried out attacks in Israel, sparking a conflict between Israel and Hamas.\n3. Israeli Prime Minister Benjamin Netanyahu has been criticized for his handling of the situation, with many blaming him for Hamas' attacks.\n4. There have been reports of food shortages in Gaza due to the conflict, but it is not clear who is to blame."}, {"id": "3733a76c-9174-47e6-b3dc-188f5d34be5f", "title": "Israel ready to hit Houthis again while urging US to take lead", "date": "2024-07-25 15:30", "url": "https://gulfnews.com/world/gulf/yemen/israel-ready-to-hit-houthis-again-while-urging-us-to-take-lead-1.103601606", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Al Houthis are, he said, undeterred despite Israel’s counter-strike on the Red Sea port of Hodeida the following day.\nAl Houthis are working with Hezbollah, the most powerful of Iran’s allied militant groups, and Shiite militias in Iraq, he said.\nBoth Hezbollah and Al Houthis have launched missiles at Israel in solidarity with their fellow Islamist group and Palestinian civilians.\nKatz suggested the 10-nation coalition set up by the US late last year to counter Al Houthis may be better placed.\n“We would prefer that the coalition will lead the war against the Houthis,” he said.", "location": "Hodeida, Red Sea port city, western Yemen. Situated on the Red Sea just north of", "classification": "security", "score": 0.847847649589678, "event_breakdown": "Al Houthis fired missiles at Israel on Tuesday, prompting a counter-strike by Israel on the Red Sea port of Hodeida the next day.\nAl Houthis, working with Hezbollah and other militant groups, have launched missiles at Israel in solidarity with Palestine.\nA 10-nation coalition set up by the US late last year may be better equipped to fight the war against Al Houthis in Yemen."}, {"id": "59771139-c016-4305-9192-e2b5681fa704", "title": "Woman , 44 , arrested on suspicion of killing wife with sword in San Dimas", "date": "2024-07-25 19:30", "url": "https://www.dailybreeze.com/2024/07/25/woman-44-arrested-on-suspicion-of-killing-wife-with-sword-in-san-dimas/", "domain": "dailybreeze.com", "domain_classification": "Unknown", "message": "A 44-year-old woman has been arrested and on suspicion of fatally stabbing her wife with a samurai sword during an argument at their home in San Dimas last week, authorities said.\nOn July 18, investigators responded to the 300 block of South Huntington Avenue, between Arrow Highway and Cienega Avenue, around 3:30 p.m., regarding the stabbing.\nAccording to sheriff’s officials, investigators have now determined that Weichien Huang and her wife were arguing at their home and Huang attacked her wife with a sword.\nHuang’s wife, Chen Chen Fei, was pronounced dead at the scene, authorities said.\n“At some point, Huang attacked Fei with a sword,” sheriff’s officials said.", "location": "San Dimas, California", "classification": "security", "score": 0.7656769150973033, "event_breakdown": "Target event\nA 44-year-old woman has been arrested and is accused of fatally stabbing her wife with a samurai sword during an argument at their home in San Dimas last week, authorities said. On July 18, investigators responded to the 300 block of South Huntington Avenue, between Arrow Highway and Cienega Avenue, around 3:30 p.m., regarding the stabbing."}, {"id": "a82073a6-31ec-4682-9182-005dfd311982", "title": "Police Investigate Stabbing Outside North Hollywood Metro Station", "date": "2024-07-25 16:00", "url": "https://mynewsla.com/crime/2024/07/25/police-investigate-stabbing-outside-north-hollywood-metro-station-3/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man who was stabbed at a Metro station in North Hollywood is recovering from his wounds Thursday and police are searching for the suspect who was last seen riding a bicycle and leaving the station.\nThe stabbing was reported around 1:50 p.m. Wednesday on the street level outside the Metro B (Red) Line station at Lankershim and Chandler boulevards, according to the Los Angeles Police Department.\nThe victim was exiting the station when an assailant approached and stabbed him for unknown reasons.\nThe following statement was given by Metro regarding the stabbing at the North Hollywood Station: “Metro appreciates the Los Angeles Police Department (LAPD) officers, already assigned to the North Hollywood Metro Station, responding immediately and assisting the victim after an altercation between two passengers resulted in a person being stabbed as they exited the station.\nMetro wishes the victim a full and swift recovery.”According to reports from the scene, the man was stabbed in the ribs.", "location": "North Hollywood", "classification": "security", "score": 0.9059154537035085, "event_breakdown": "Location: North Hollywood Metro Station\nTime Frame: 1:50 PM Wednesday - LAPD officers responded to a stabbing that was reported to have occurred on the street level of the North Hollywood Metro Station.\nPerson In Custody: The suspect was last seen riding a bicycle and leaving the Metro station after the stabbing.\n\nVictim Status: The victim was stabilized and taken to a nearby hospital."}, {"id": "fdc992d8-b6d8-4266-9230-4bdc7e3910b2", "title": "Group assaults three women on U Street ; Police release suspect images", "date": "2024-07-25 05:00", "url": "https://www.fox5dc.com/news/group-assaults-three-women-u-street-police-release-suspect-images", "domain": "fox5dc.com", "domain_classification": "Unknown", "message": "The search is on for a group of people involved in an attack on U Street where police say three women were assaulted.\nThe incident occurred at the intersection of 11 and U Street in Northwest.\nThe three women, all in their twenties, stated that they were approached by a group of five suspects.\nSome of the suspects were men dressed as women, while others were women presenting themselves in a masculine manner.\nDetectives have released surveillance images of the suspects and are urging anyone who recognizes them to contact the Metropolitan Police Department.", "location": "U Street", "classification": "security", "score": 0.9565442720631144, "event_breakdown": "The search is on for a group of people involved in an attack on U Street where police say three women were assaulted. The incident occurred on June 22, 2023, at the intersection of 11 and U Street in Northwest."}, {"id": "e5cf9a5d-edac-4ba0-9fe0-e6eea14f2e1f", "title": "US lawmakers to form task force to investigate shooting at Trump rally", "date": "2024-07-25 05:00", "url": "https://www.yourlocalguardian.co.uk/news/national/24474744.us-lawmakers-form-task-force-investigate-shooting-trump-rally/", "domain": "yourlocalguardian.co.uk", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will comprise 13 members and is expected to include seven Republicans and six Democrats.\nMr Kelly was at the rally with his wife and other family members.\nHe called the task force a chance to build trust with Americans so lawmakers can work together to tackle a crisis.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": ".\nButler, Pennsylvania", "classification": "security", "score": 0.4331222166558154, "event_breakdown": "{\"success\": true, \"data\": [\n\"A task force to examine the shooting in Butler, Pennsylvania is approved by a bipartisan vote in the House\"\n]\n}"}, {"id": "206a96f4-eaa3-40cf-82bf-c0e6641c65df", "title": "Man charged with attempted murder after soldier stabbed outside barracks | united kingdom News", "date": "2024-07-25 07:45", "url": "https://metro.co.uk/2024/07/25/man-charged-attempted-murder-soldier-stabbed-outside-barracks-21293112/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Anthony Esan arriving at court this morning (Picture: Steve Finn/Ferraris)A man charged with the attempted murder of a uniformed soldier who was repeatedly stabbed near his barracks has been remanded in custody after a brief court appearance.\nAnthony Esan, 24, appeared at Medway Magistrates’ Court this morning, having been arrested near his home in Rochester about 35 minutes after the knife attack.\nEsan, who was wearing a grey T-shirt, was told he will next appear at Maidstone Crown Court on August 22.\nCourt artist sketch of Anthony Esan appearing at Medway Magistrates’ Court in Chatham, Kent (Picture: PA)Anthony Esan has been charged with attempted murder (Picture: UKNIP)Lt Col Teeton is in hospital in a serious but stable condition.\n‘Anthony Esan, 24, was arrested near his home address in Mooring Road, Rochester, at approximately 6.30pm the same day and has now been charged with attempted murder and possession of an offensive weapon in a public place.", "location": "Chatham, Kent, UK", "classification": "security", "score": 0.5444537417969205, "event_breakdown": "Target Event:\nMan charged with attempted murder of soldier repeatedly stabbed near his barracks"}, {"id": "04a9ce9a-2b30-4dee-a7a3-f049afcb6afd", "title": "FACT FOCUS : A look at Netanyahu claims about Israel , Hamas and Iran during his speech to Congress", "date": "2024-07-25 02:30", "url": "https://www.troyrecord.com/2024/07/24/fact-focus-a-look-at-netanyahus-claims-about-israel-hamas-and-iran-during-his-speech-to-congress/", "domain": "troyrecord.com", "domain_classification": "Unknown", "message": "FACT FOCUS: A look at Netanyahu’s claims about Israel, Hamas and Iran during his speech to Congress", "location": ")\nWASHINGTON DC", "classification": "security", "score": 0.46733046216747504, "event_breakdown": "Netanyahu's claims about Israel, Hamas and Iran during his speech to Congress are not reported in the news in the current time frame and belong to to the category security."}, {"id": "584509ac-7043-48b6-96cc-3a2c086059cd", "title": "House votes to form task force to investigate shooting at Trump rally , recommend legislative fixes", "date": "2024-07-25 02:00", "url": "https://www.krmg.com/news/politics/house-votes-form/IK2L6Z4JG5GKRA5TQG6BWTHCTA/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The United States", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It looks like there were no current events of security reported in text that have a specific location."}, {"id": "a35962dd-28e3-4fdd-8a68-bf274143e41d", "title": "PTI activist  Neeli Pari  arrested for thrashing PML - N Tahir Anjum", "date": "2024-07-25 11:00", "url": "https://www.geo.tv/latest/555922-pti-activist-neeli-pari-arrested-for-thrashing-pml-ns-tahir-anjum", "domain": "geo.tv", "domain_classification": "Unknown", "message": "A police official standing beside PTI worker Aneela Jutt in Lahore on July 25, 2024.\n—X/@LahorepoliceopsLAHORE: Lahore Police on Thursday arrested Pakistan Tehreek-e-Insaf (PTI) worker Aneela Jutt alias 'Neeli Pari' for assaulting and torturing Pakistan Muslim League-Nawaz (PML-N) Cultural Wing President Tahir Anjum.\nThe stage actor came under attack from the female PTI worker when he was passing by the party’s hunger strike camp outside the Punjab Assembly on Wednesday.\nAneela alleged that Anjum used to post derogatory videos to malign incarcerated PTI founder Imran Khan, dubbing him a \"terrorist\".\nBefore leaving the scene, Anjum also denied posting videos against the PTI founder or doing anything illegal to trigger such an attack.", "location": "LAHORE", "classification": "security", "score": 0.5162132612749136, "event_breakdown": "Location: Lahore, Pakistan\nDate: July 25th, 2024\nSummary: Lahore Police on Thursday arrested a female Pakistan Tehreek-e-Insaf (PTI) worker for assaulting and torturing Pakistan Muslim League-Nawaz (PML-N) Cultural Wing President Tahir Anjum. The PTI worker alleged that Anjum used to post derogatory videos to malign incarcerated PTI founder Imran Khan, dubbing him a \"terrorist\"."}, {"id": "0e9b840c-96ed-4a32-8be5-c4b1928e5158", "title": "3 Wounded in Drive - By Shooting in Samaria | The Jewish Press - JewishPress . com | David Israel | 19 Tammuz 5784 – Thursday , July 25 , 2024", "date": "2024-07-25 09:00", "url": "https://www.jewishpress.com/news/terrorism-news/3-wounded-in-drive-by-shooting-in-samaria/2024/07/25/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Courtesy MDAA drive-by shooting attack from a passing vehicle was reported on Route 55, near Nebi Elias in Samaria.\nMDA paramedic Yisrael Liphsitz reported:“We saw the casualties fully conscious, suffering from gunshot wounds to their bodies.\nThey told us that they were hit by a drive-by shooting.\nWe gave them medical treatment and evacuated them in MDA mobile intensive care units to the hospitals in moderate and mild condition.\nWe checked another casualty who was fully conscious with a very mild injury to his leg.”Share this article on WhatsApp:", "location": "Nebi Elias", "classification": "security", "score": 0.9588243498266289, "event_breakdown": "Target Event - A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nSecurity-related news push:\nA new drive-by shooting was reported on Route 55, near Nebi Elias in Samaria. The casualty evacuation was reported in MDA Mobile Intensive Care Units (MICUs). Units were dispatched to the scene of the incident and transported the injured to their community hospital for further evaluation. A security patrol was deployed in the area to prevent any potential further security breach."}, {"id": "49efd6b5-4de6-4726-befb-68422d108bf8", "title": "Man appears in court charged with attempted murder of Army officer in uniform", "date": "2024-07-25 11:15", "url": "https://www.aol.co.uk/man-appears-court-charged-attempted-095634318.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "A man has been remanded in custody after appearing in court charged with the attempted murder of an Army officer in uniform near a barracks.\nAnthony Esan, 24, is accused of repeatedly stabbing Lieutenant Colonel Mark Teeton in Gillingham, Kent, on Tuesday.\nHe appeared at Medway Magistrates’ Court on Thursday wearing a grey T-shirt and will next appear at Maidstone Crown Court on August 22.\nTwo knives were dropped at the scene and a further three were found stored on the bike, the prosecutor said.\nHead of the Army General Sir Roly Walker condemned the stabbing as “horrific and unprovoked”, while Prime Minister Sir Keir Starmer said he was “shocked and appalled”.", "location": "Gillingham, Kent", "classification": "security", "score": 0.5067696625413866, "event_breakdown": "Anthony Esan, 24, was arrested at the scene after officers were called to a report of an injured man.\nKent Police said on Thursday evening that due to reports that the suspect was known locally a number of roads had been closed off in the area as inquiries continue."}, {"id": "c0162cfa-e2f9-4f11-a2d4-3addfc37b4df", "title": "House votes to form task force to investigate shooting at Trump rally , recommend legislative fixes", "date": "2024-07-25 04:30", "url": "http://www.middletownpress.com/news/politics/article/house-votes-to-form-task-force-to-investigate-19595245.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "The vote underscores the bipartisan outrage over the shooting at a campaign rally in Butler, Pennsylvania.\nThe task force will be composed of 13 members and is expected to include seven Republicans and six Democrats.\nThe bill is sponsored by Republican Rep. Mike Kelly, whose hometown of Butler was the site of the shooting.\nKelly was at the rally with his wife and other family members.\nDemocrats also voiced support for the task force, saying what happened in Butler was a despicable attack that never should have happened.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.575708103781959, "event_breakdown": "* A new bipartisan task force will be formed to investigate and analyze the shooting at a campaign rally in Butler, Pennsylvania. The task force will be composed of 13 members and is expected to include seven Republicans and six Democrats.\n* The bill is sponsored by Republican Rep. Mike Kelly, whose hometown of Butler was the site of the shooting. Kelly was at the rally with his wife and other family members."}, {"id": "a824e68e-c352-4988-be7a-e1e224f2396d", "title": "Minneapolis man pleads guilty in hair salon bombing", "date": "2024-07-25 02:00", "url": "https://www.fox9.com/news/minneapolis-man-pleads-guilty-hair-salon-bombing", "domain": "fox9.com", "domain_classification": "Unknown", "message": "articleJust months after his arrest, a Minneapolis man pled guilty to bombing a hair salon in the Bryn Mawr neighborhood back in 2022.\nIn November 2022, Studio 411, which is located on Cedar Lake Road South near Penn Avenue South in Minneapolis, was damaged when an explosive device was placed on the salon's window and set off.\nBetween the 2022 bombing and the 2023 vandalism, authorities say police encountered Francisco during a third incident.\nInside the truck, they found an explosive device that was similar to the one used at Salon 411.\nBut, it's unclear if police, at the time, were able to make the connection between the device and the salon bombing.", "location": "Minneapolis, Minnesota", "classification": "security", "score": 0.9958332922176301, "event_breakdown": "Minneapolis man pleads guilty to bombing a hair salon in the Bryn Mawr neighborhood - January 2023\nMinneapolis man suspected of vandalizing salon in 2023 - June 2023"}, {"id": "edc8328d-c3b8-44e1-bcc0-749f3dd450f6", "title": "An explosion killed over 50 Ukrainian POWs in 2022 . Survivors and an internal UN report blame Russia", "date": "2024-07-25 09:30", "url": "https://www.mymotherlode.com/news/east-europe/3397022/an-explosion-killed-over-50-ukrainian-pows-in-2022-survivors-and-an-internal-un-report-blame-russia.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Despite the conclusion of the internal analysis that found Russia planned and executed the attack, the U.N. stopped short of accusing Russia in public statements.\nIn the days following the Olenivka deaths, U.N. Secretary-General António Guterres launched an independent mission to investigate.\nThey were taken to a cinder-block building with a tin-plate roof and 100 bunks, no mattresses and a hastily dug pit toilet, multiple survivors told AP.\nAs the clock ticked down to a U.N. Security Council meeting later that day, Russia and Ukraine blamed each other.\nFading hopes for justiceA Ukrainian investigation is ongoing, according to Taras Semkiv of the Ukrainian prosecutor general’s war crimes unit.", "location": "Olenivka", "classification": "security", "score": 0.5307184755738241, "event_breakdown": "U.N. independent mission to investigate Olenivka deaths"}, {"id": "104ed9bc-5624-4437-acd9-f05395ecec3c", "title": "Israeli hostage group sees  sabotage  in Gaza talks", "date": "2024-07-25 16:00", "url": "https://www.digitaljournal.com/world/israeli-hostages-group-sees-sabotage-in-gaza-talks/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Out of 251 people taken hostage that day, 111 are still held in Gaza, including 39 the military says are dead.\nIsrael’s military said the five hostage bodies recovered from Gaza had been returned to Israel following a rescue operation.\nWashington has been increasingly alarmed by the humanitarian toll of the Gaza war, but in his speech to Congress, Netanyahu dismissed “all the lies” about civilian fatalities.\nHe said “the war in Gaza has one of the lowest ratios of combatants to non-combatant casualties in the history of urban warfare”.\nThe United States on Wednesday criticised an Israeli bill that would declare the UN agency for Palestinian refugees — the main aid agency in Gaza — a terrorist organisation.", "location": "Gaza", "classification": "security", "score": 0.6525813784033621, "event_breakdown": "Gaza, Israel"}, {"id": "5ec2e0fa-0d42-4d1f-b3ae-0c77beee4413", "title": "Marvel main  Star War comic book line to progress into the New Republic era this fall", "date": "2024-07-25 19:15", "url": "https://www.space.com/marvels-main-star-wars-comic-book-line-to-progress-into-the-new-republic-era-this-fall", "domain": "space.com", "domain_classification": "Unknown", "message": "There are plenty of Star Wars comic book series, both large and small, to choose from in the post-Disney age of the franchise.\nNow, Marvel's main Star Wars series is finally leaving original Star Wars movies behind and moving into the early days of the New Republic.\nDoes this mean Marvel's core Star Wars series will serve as a prequel of sorts to The Force Awakens ?\nThe covers were drawn by veteran Phil Noto, and you can check out all four of them below:Image 1 of 4 (Image credit: Marvel/Lucasfilm) (Image credit: Marvel/Lucasfilm) (Image credit: Marvel/Lucasfilm) (Image credit: Marvel/Lucasfilm)Jakku was first introduced in The Force Awakens as the planet where Rey had been left behind by her parents, with wreckage of an old war reminding the new heroes of past battles.\nThen, Star Wars Battlefront II (2017) also spent some time on the planet during the Empire's last day.", "location": ".\nJakku", "classification": "security", "score": 0.7985663154699791, "event_breakdown": "Here are the current events of security reported in text that can be placed on a map:\nMarvel's Main Star Wars Series is Moving Away from the Original Movies\nMarvel's main Star Wars series is finally leaving the original movies behind and moving into the early days of the New Republic."}, {"id": "5cbe8a74-6210-4e45-a862-22540efa9c2f", "title": "People beheaded , a village burned amid brutal violence in PNG province", "date": "2024-07-25 19:30", "url": "https://www.fijivillage.com/news/People-beheaded-a-village-burned-amid-brutal-violence-in-PNG-province-54rxf8/", "domain": "fijivillage.com", "domain_classification": "Unknown", "message": "People beheaded, a village burned amid brutal violence in PNG provincePeople beheaded, a village burned amid brutal violence in PNG province[Image: abc]Violent attacks on three remote villages in Papua New Guinea's (PNG) north has reportedly killed 26 people, including 16 children, while several people were forced to flee after attackers set fire to their homes, the United Nations said.\nThe death toll could rise to more than 50 as PNG authorities search for missing people, Mr Turk said.\nThe death toll could rise to more than 50 as PNG authorities search for missing people, Mr Turk said.\nTribal warfare exacerbated Home to hundreds of tribes and languages, the Pacific nation to Australia's north has a long history of tribal warfare.\nBut an influx of mercenaries and automatic weapons has inflamed the cycle of violence.", "location": "Papua New Guinea", "classification": "security", "score": 0.7354204504612238, "event_breakdown": "Event 1: 26 people were killed in Papua New Guinea's north in violent attacks.\nEvent 2: 50 people could be killed in Papua New Guinea as authorities search for missing people.\nEvent 3: More than 100 people were forced to flee after attackers set fire to their homes in Papua New Guinea's north."}, {"id": "6cdca997-6f1d-4eaa-a320-099ef4a80f3f", "title": "USNS Supply returning to Norfolk after 8 - month deployment on Saturday", "date": "2024-07-25 19:15", "url": "https://www.yahoo.com/news/usns-supply-returning-norfolk-8-162918158.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NORFOLK, Va. (WAVY) — USNS Supply, a Combat Logistics Force vessel, is returning to Naval Station Norfolk on Saturday after an 8-month deployment.\nThe Supply (T-AOE 6), formerly USS Arctic (AOE – 6), had a critical role as the support vessel for the USS Dwight D. Eisenhower (CVN 69) Carrier Strike Group.\nThe strike group’s main vessel, the USS Dwight D. Eisenhower aircraft carrier, returned home on July 15 after a historic 9-month deployment.\nThe Supply is civilian-crewed and doesn’t carry the weapons systems it once did as the USS Supply and USS Arctic.\nIt’s one of two fast combat support ships currently operated by Combat Logistics Force, which is comprised of 33 ships in total.", "location": "NORFOLK, Virginia", "classification": "security", "score": 0.7940463491904306, "event_breakdown": "Location: Naval Station Norfolk\nEvent: USS Supply is returning to Naval Station Norfolk on Saturday after an 8-month deployment. The Supply (T-AOE 6), formerly USS Arctic (AOE – 6), had a critical role as the support vessel for the USS Dwight D. Eisenhower (CVN 69) Carrier Strike Group."}, {"id": "c45fa2d1-0bd9-4dc2-9685-f27137903711", "title": "Ukraine war has been devastating for animals – but theyve also given the nation reason for hope", "date": "2024-07-25 18:30", "url": "http://www.econotimes.com/Ukraines-war-has-been-devastating-for-animals--but-theyve-also-given-the-nation-reason-for-hope-1682421", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "Russia’s war in Ukraine has caused immense suffering to the civilian population.\nWith an estimated 25% of Ukraine’s protected nature areas occupied by Russian forces, entire ecosystems have been disrupted or destroyed.\nAs for domestic animals, there were approximately 5.5 million cats and 750,000 dogs in Ukraine before the war.\nAlthough it is hard to provide an exact number of refugee animals, in 2022 alone, more than 10,000 animals are believed to have crossed the Ukrainian-Polish border.\nThere are many more tragic stories like these about the ecological toll of the war across the entire frontline area of Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.6790806763476314, "event_breakdown": "Target event: Ecological damage due to Russia's war against Ukraine\nShort report:\nEcological damage due to Russia's war against Ukraine has been reported across Ukrainian territory that is currently occupied by Russian forces."}, {"id": "1f99cd88-6c8b-4531-a759-10d031d497f9", "title": "Silver jubilee of Kargil Vijay Diwas celebrates the bravery of soldiers who prevailed against all odds", "date": "2024-07-25 15:15", "url": "https://www.prokerala.com/news/articles/a1550299.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "The Kargil Vijay Diwas on July 26 celebrates the bravery of the Indian soldiers and young leaders who prevailed against all odds, and at a great cost.\nIt was not a war because a national emergency was not declared and the war remained localised to Kargil district.\nIn 1999, Pakistan sent soldiers across the LoC to Kargil, in areas lightly held by both sides during winters.\nThe Kargil conflict also ushered in military reforms.\nThe Kargil conflict was unique in many ways, as we have just seen.", "location": "Kargil", "classification": "security", "score": 0.465988420080851, "event_breakdown": "Event: Kargil Vijay Diwas on July 26 celebrates the bravery of the Indian soldiers and young leaders who prevailed against all odds and at a great cost in the Kargil conflict.\nLocation: Kargil district, India"}, {"id": "81a97e3b-8770-425c-b8d1-0245edf3c9fd", "title": "Silver jubilee of Kargil Vijay Diwas celebrates the bravery of soldiers who prevailed against all odds", "date": "2024-07-25 15:15", "url": "https://www.prokerala.com/news/articles/a1550286.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "The Kargil Vijay Diwas on July 26 celebrates the bravery of the Indian soldiers and young leaders who prevailed against all odds, and at a great cost.\nIt was not a war because a national emergency was not declared and the war remained localised to Kargil district.\nIn 1999, Pakistan sent soldiers across the LoC to Kargil, in areas lightly held by both sides during winters.\nThe Kargil conflict also ushered in military reforms.\nThe Kargil conflict was unique in many ways, as we have just seen.", "location": "Kargil", "classification": "security", "score": 0.465988420080851, "event_breakdown": "The Kargil conflict was unique in many ways, as we have just seen.\nKargil Vijay Diwas on July 26 celebrates the bravery of the Indian soldiers and young leaders who prevailed against all odds, and at a great cost.\nThe Kargil conflict also ushered in military reforms."}, {"id": "6a58582c-15bb-4d0a-9741-45ea4dd94584", "title": "Former Uman mayor Oleksandr Tsebrii killed in combat zone", "date": "2024-07-25 15:00", "url": "https://www.yahoo.com/news/former-uman-mayor-oleksandr-tsebrii-121957986.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Oleksandr Tsebrii, former mayor of the city of Uman in Ukraine’s Cherkasy Oblast, who served in the 58th Motorized Brigade, has been killed in the combat zone.\nSource: the Suspilne media outlet with reference to Alina Kryvosheia, spokesperson of the Cherkasy Oblast Staffing and Social Support CentreQuote: \"The defender was a junior sergeant, commander of a machine gun department.\nHe died on 24 July while performing a combat mission in Donetsk Oblast.\"\nWikipedia writes that Tsebrii may have died near the settlement of Novodonetske.\nBackground: Oleksandr Tsebrii was the mayor of Uman from 2015 to 2020.", "location": "DONETSK OBLAST", "classification": "security", "score": 0.9474954827247597, "event_breakdown": "Target event: Current event of Uman's former mayor Tsebrii reported killed in the combat zone in Donetsk Oblast\nTsebrii, former mayor of Uman, reported killed in Donetsk Oblast"}, {"id": "9b605acb-6f84-475e-b46e-4a61b52f198a", "title": "Netanyahu Towers Over Pro - Hamas Kooks In D . C . and on MSNBC", "date": "2024-07-25 07:45", "url": "https://townhall.com/columnists/tomtradup/2024/07/25/netanyahu-towers-over-pro-hamas-kooks-in-dc-and-on-msnbc-n2642500", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu arrived in Washington this week to a reception, unlike any previous leader of our nation’s strongest ally in the Middle East.\nAdvertisementNetanyahu spent the evening at Washington’s famed Watergate Hotel, which was ringed by pro-Hamas insurrectionists wielding bullhorns and sirens.\nSomeone inside the Watergate pulled the hotel’s fire alarm several times during the night, endangering the life of not only the Prime Minister but all other hotel guests.\nFrom the moment he strode into the packed House chamber on Capitol Hill to thunderous applause, Netanyahu towered over his critics.\nA lot of them, she suggested, feel “Prime Minister Netanyahu has just been awful.", "location": "Washington, D.C.", "classification": "security", "score": 0.6127972371054067, "event_breakdown": "Target event: Pro-Trump protesters and police clash at state capitol\nSecurity events reported in the text:\nEvent 1: Pro-Hamas insurrectionists ring the Watergate Hotel.\nEvent 2: Someone inside the Watergate pulled the hotel's fire alarm several times during the night.\nEvent 3: A fire broke out in a shopping mall in Hanoi, Vietnam on Thursday, killing at least 13 people and leaving dozens injured, according to the state news media. More than 500 people were evacuated from the building, including a movie theater and a supermarket, the reports said."}, {"id": "1376b030-6f13-494f-b843-5419e7cada41", "title": "Israel army recovers from Gaza bodies of 5 killed on October 7", "date": "2024-07-25 10:00", "url": "https://www.guampdn.com/news/national/israel-army-recovers-from-gaza-bodies-of-5-killed-on-october-7/article_189d1444-7845-512b-936b-14c539e61474.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Israeli forces retrieved the remains of five Israelis, killed during Hamas's October 7 attack on southern Israel, whose bodies had been taken to the Gaza Strip, the military said Thursday.\nThe military said the soldiers were killed in combat while fighting the militants on October 7.\nMilitants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead.\nThe bodies were recovered on Wednesday during an operation in Khan Yunis, the main city in the south of the Gaza Strip, the military said, more than nine months into the Gaza war between Israel and Hamas.\nIsrael's retaliatory military campaign in Gaza has killed more than 39,100 Palestinians, according to data from the health ministry in Hamas-run Gaza, which does not give details of civilian and militant deaths.", "location": "Gaza Strip", "classification": "security", "score": 0.9659246107250559, "event_breakdown": "Israeli soldiers retrieved remains of five Israelis killed in Hamas's October 7 attack on southern Israel, Israeli military said Thursday."}, {"id": "84948466-8db2-47ea-8e10-39c42178ef7b", "title": "Israel army says recovered bodies of five hostages held in Gaza", "date": "2024-07-25 11:00", "url": "https://www.digitaljournal.com/world/israel-army-says-recovered-bodies-of-five-hostages-held-in-gaza/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Militants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead.\nThe bodies were recovered on Wednesday during an operation in Khan Yunis, the main city in the south of the Gaza Strip, the military said, more than nine months into the Gaza war between Israel and Hamas.\n“We are committed to returning the hostages home.”The recovery of the bodies came days after the military launched a new assault on Khan Yunis.\nIsrael said it was pulling troops from the city in April, after months of fierce fighting in the area.\nIsrael’s retaliatory military campaign in Gaza has killed at least 39,145 people, according to the health ministry in the Hamas-run territory.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.9392472778352446, "event_breakdown": "Militants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead. The bodies were recovered on Wednesday during an operation in Khan Yunis, the main city in the south of the Gaza Strip, the military said, more than nine months into the Gaza war between Israel and Hamas. We remain committed to returning the hostages home.“The recovery of the bodies came days after the military launched a new assault on Khan Yunis. Israel said it was pulling troops from the city in April, after months of fierce fighting in the area. Israel's retaliatory military campaign in Gaza has killed at least 39,145 people, according to the health ministry in the Hamas-run territory."}, {"id": "41c58afe-3f66-40bb-877f-c14cf9615380", "title": "Fact - checking Israeli Prime Minister Benjamin Netanyahu address to Congress", "date": "2024-07-25 15:15", "url": "https://www.wjol.com/syndicated-article/?id=1575758", "domain": "wjol.com", "domain_classification": "Unknown", "message": "(WASHINGTON) — Israeli Prime Minister Benjamin Netanyahu stood before Congress on Wednesday, delivering a joint address to U.S. lawmakers on the ongoing war with Hamas and renewing his call for bipartisan support in the Middle East.\nThe address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nAnother major reason aid is scarce in Gaza is that aid workers don’t feel safe distributing the aid.\nAccording to the Hamas-run Ministry of Health in Gaza, more than 39,000 people have been killed in Israeli operations.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "location": "Washington, D.C.", "classification": "security", "score": 0.6428280580924148, "event_breakdown": "Netanyahu stands before Congress, delivers joint address on ongoing war with Hamas, calls for bipartisan support in the Middle East"}, {"id": "7de8f3e5-b26d-4fba-94e7-b6b1c909b6d5", "title": "Politics News - 1540 WADK Newport", "date": "2024-07-25 16:15", "url": "https://wadk.com/politics-news/8e812e9b0db01585e147a01e4f23145e", "domain": "wadk.com", "domain_classification": "Unknown", "message": "The address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nAnother major reason aid is scarce in Gaza is that aid workers don't feel safe distributing the aid.\nAccording to the United Nations, more than 250 aid workers have been killed in Gaza as of this spring.\nU.S. officials have argued that if Israel allows more aid inside Gaza and guarantees security for those drivers, the looting will decrease.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "location": "Gaza", "classification": "security", "score": 0.8839465082752966, "event_breakdown": "Israeli attacks on Gaza\nLooting of aid by Hamas\nDeath to UN aid workers was last modified: by"}, {"id": "8cf4f8e7-041a-4207-83e7-f7fd0d53c12f", "title": "Fact - checking Israeli Prime Minister Benjamin Netanyahu address to Congress", "date": "2024-07-25 15:30", "url": "https://www.wlip.com/syndicated-article/?id=1575758", "domain": "wlip.com", "domain_classification": "Unknown", "message": "(WASHINGTON) — Israeli Prime Minister Benjamin Netanyahu stood before Congress on Wednesday, delivering a joint address to U.S. lawmakers on the ongoing war with Hamas and renewing his call for bipartisan support in the Middle East.\nThe address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nAnother major reason aid is scarce in Gaza is that aid workers don’t feel safe distributing the aid.\nAccording to the Hamas-run Ministry of Health in Gaza, more than 39,000 people have been killed in Israeli operations.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "location": "WASHINGTON", "classification": "security", "score": 0.6428280580924148, "event_breakdown": "(WASHINGTON) On Wednesday, Israeli Prime Minister Benjamin Netanyahu stood before Congress, delivering a joint address to U.S. lawmakers on the ongoing war with Hamas, and renewing his call for bipartisan support in the Middle East."}, {"id": "931f8edd-25b0-41d4-a9d7-385352e8652f", "title": "UPDATE : Whitmer signs bill to name Houghton County section of M - 26 after fallen World War II soldier", "date": "2024-07-25 19:00", "url": "https://www.wilx.com/2024/07/25/update-whitmer-signs-bill-name-houghton-county-section-m-26-after-fallen-world-war-ii-soldier/", "domain": "wilx.com", "domain_classification": "Unknown", "message": "LANSING, Mich. (WLUC) - UPDATE: A section of M-26 in Houghton County will be named after a Painesdale soldier.\nThe Private Wesley Karna Memorial Highway will honor the 22-year-old who died during World War II.\nBrad Uren, Karna’s great-nephew, testified with Markkanen during the committee meeting, where they outlined how an Italian historian with a metal detector recently unearthed Private Karna’s canteen.\nPrivate Karna had scratched his name into it.\nThat discovery led Uren and his family to find further details about Private Karna’s service and the circumstances surrounding his ultimate sacrifice.", "location": "MICHIGAN", "classification": "security", "score": 0.42271380616772186, "event_breakdown": "* The Private Wesley Karna Memorial Highway will honor the 22-year-old who died during World War II.\n* The highway will be located in Houghton County, Michigan.\n* The name was chosen after the family of the fallen soldier discovered his canteen that had been missing since his death."}, {"id": "aba6fb65-29cc-41d1-8796-f463ffe1d887", "title": "Israel army says recovered bodies of five hostages held in Gaza", "date": "2024-07-25 09:00", "url": "https://www.al-monitor.com/originals/2024/07/israel-army-says-recovered-bodies-five-hostages-held-gaza", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 24, 2024 — Jerusalem (AFP)Israeli forces retrieved the remains of five Israelis, killed during Hamas's October 7 attack on southern Israel, whose bodies had been taken to the Gaza Strip, the military said Thursday.\nThe military said the soldiers were killed in combat while fighting the militants on October 7.\nMilitants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead.\nThe bodies were recovered on Wednesday during an operation in Khan Yunis, the main city in the south of the Gaza Strip, the military said, more than nine months into the Gaza war between Israel and Hamas.\nIsrael's retaliatory military campaign in Gaza has killed more than 39,100 Palestinians, according to data from the health ministry in Hamas-run Gaza, which does not give details of civilian and militant deaths.", "location": "GAZA STRIP", "classification": "security", "score": 0.9688684616271357, "event_breakdown": "New event reported:\nIsraeli forces retrieved the remains of five soldiers killed in Hamas's October 7 attack on southern Israel, whose bodies had been taken to the Gaza Strip, the military said Thursday - a claim denied by Hamas."}, {"id": "f064ffe3-5d40-45e5-be39-e00eb5cd9dca", "title": "Warwick Castle unveils new medieval - themed hotel for families this summer", "date": "2024-07-25 05:00", "url": "https://www.coventrytelegraph.net/whats-on/warwick-castle-unveils-new-medieval-29603150", "domain": "coventrytelegraph.net", "domain_classification": "Unknown", "message": "Warwick Castle has unveiled its new medieval-themed hotel this week.\nGeneral Manager at Warwick Castle, Liam Bartlett, said: \"We are so proud to announce that we have now opened the doors of the Warwick Castle Hotel.\n(Image: Warwick Castle)The new hotel has 60 bedrooms so families can enjoy the summer events taking place over the holidays.\nTo book your stay at the new Warwick Castle hotel, visit www.warwick-castle.com/short-breaks.\nOther accommodations on site include the Knight's Village Lodges, Glamping, and Caesar's Tower Suites.", "location": "Warwick Castle", "classification": "security", "score": 0.6511448584897589, "event_breakdown": "[\nWarwick Castle has unveiled its new medieval-themed hotel this week.\n]"}, {"id": "49e09679-f35b-40fd-8f85-7a051118f899", "title": "Joint Declaration on Enhanced Defence Cooperation between Germany and the United Kingdom", "date": "2024-07-25 13:00", "url": "https://www.globalsecurity.org/wmd/library/news/uk/2024/uk-240724-ukmod02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Joint Declaration on Enhanced Defence Cooperation between Germany and the United KingdomSecretary of State for Defence, John Healey, signed a joint declaration with German Minister of Defence, Boris Pistorius, on 24 July, 2024.\nWe consider closer defence cooperation as an important first step in a new relationship between Germany and the United Kingdom.\nThe Defence Ministers of Germany and the United Kingdom recognise the urgency of the situation and the imperative for closer collaboration to address these challenges collectively.\nBy working hand in hand, Germany and the United Kingdom seek to contribute to maintaining the Alliance's effective and credible deterrence and defence tasks.\nIntergovernmental Cooperation StructuresTo facilitate strategic direction and oversight, our intended closer cooperation may include the establishment of a senior-level group tasked with steering defence cooperation and annual meetings with Defence Ministers.", "location": "Germany", "classification": "security", "score": 0.8942852583036963, "event_breakdown": "Joint Declaration on Enhanced Defence Cooperation between Germany and the United Kingdom\n\nSecretary of State John Healey and German Defence Minister Boris Pistorius signed a joint declaration on 24 July 2024, establishing closer defence cooperation between Germany and the United Kingdom. They acknowledge the urgency of the situation and the need for closer collaboration to address challenges collectively. The intended closer cooperation may include the establishment of a senior-level group tasked with steering defence cooperation and annual meetings between Defence Ministers.\n\nCategory: Diplomacy/Security\n\nDate: July 24, 2024"}, {"id": "6d015e4e-2f1a-48d5-afed-f1a6a12111e6", "title": "Airmen killed at a secret CIA radar base in Laos is finally recovered", "date": "2024-07-25 00:15", "url": "https://taskandpurpose.com/news/david-price-recovered-lima-site-85/", "domain": "taskandpurpose.com", "domain_classification": "Unknown", "message": "U.S. Air Force Sgt.\nDavid Price was one of 18 Americans at Lima Site 85, a top secret CIA radar site in Laos that served as a vital navigational beacon for U.S. bombers from atop a craggy mountain peak.\nA Desperate Mountain Top FightThe tactical air navigation radar site known as Lima Site 85 sat on top of the 5,600-foot mountain known as Phou Pha Thi in Houaphan Province.\nThe site in Laos was kept top secret and lacked much of the security and defenses that a U.S. military site might have had.\nIt was the deadliest ground attack suffered by the Air Force in the war.", "location": "LIMA Site 85, Houaphan Province, Laos", "classification": "security", "score": 0.581953747007387, "event_breakdown": "U.S. military site being attacked:\nU.S. Air Force Sgt. David Price served with the 553rd Reconnaissance Battalion based out of Wisconsin and deployed to Laos.  On April 11, 1968, The unit was overrun, many of the men were executed and over 40% of them died."}, {"id": "bf3a8b0e-851d-4e33-a184-9da10048fb62", "title": "Pentagon to review 20 Medals of Honor from Wounded Knee Massacre", "date": "2024-07-25 00:15", "url": "https://www.yahoo.com/news/pentagon-review-20-medals-honor-234457127.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Defense Secretary Lloyd Austin directed the Pentagon to review the 20 Medals of Honor awarded to U.S. troops for their actions at Wounded Knee in 1890, when soldiers killed and injured between 350 and 375 Lakota men, women and children.\n“And that’s what is intended by the review that the secretary directed, which is to ensure that we go back and review each of these medals in a rigorous and individualized manner.”The killings, referred to as the Wounded Knee Massacre, occurred Dec. 29, 1890, near Wounded Knee Creek in South Dakota.\nMedals of Honor for soldiers who perpetrated Wounded Knee massacre may be rescindedThe panel reviewing the Medals of Honor will comprise five experts, including two from the Department of the Interior, Austin’s memo states.\nThe Pentagon noted that this isn’t the first time Medals of Honor have come under scrutiny.\nIn 1916, Congress ordered the Army to review all Medals of Honor awarded since the Civil War.", "location": "South Dakota.", "classification": "security", "score": 0.9688672286125873, "event_breakdown": "* Secretary of Defense Lloyd Austin orders a Pentagon panel to review the 20 Medals of Honor awarded to U.S. troops for their actions at Wounded Knee in 1890.\n* The killings at Wounded Knee, referred to as the Wounded Knee Massacre, occurred Dec. 29, 1890, near Wounded Knee Creek in South Dakota."}, {"id": "779c493b-d146-45ce-b7b7-ebd5e7615489", "title": "US , Canadian Fighters Intercept Russian , Chinese Bombers Off Alaska", "date": "2024-07-25 18:30", "url": "https://theaviationist.com/2024/07/25/us-canadian-fighters-intercept-russian-chinese-bombers-off-alaska/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "At least six NORAD fighters, including F-35, F-16 and CF-188 jets, intercepted Russian and Chinese bombers inside the Alaska ADIZ (Air Defense Identification Zone).\nOn July 24, 2024, NORAD (North American Aerospace Defense Command) detected, tracked, and intercepted two Russian Tu-95 and two Chinese H-6 aircraft operating within the Alaska Air Defense Identification Zone (ADIZ).\n“During the flight, Russian and Chinese crews worked out issues of interaction at all stages of air patrol in the new area of ​​joint operations.\nIt is unclear whether all three pairs of fighters were scrambled to carry out a Visual Identification (VID) of the Russian and Chinese aircraft.\nAir Defense Identification ZoneAs explained in other articles, here at The Aviationist, there’s a significant difference between territorial sky and ADIZ.", "location": "Alaska", "classification": "security", "score": 0.6845138132446186, "event_breakdown": "It looks like the most recent and relevant event related to security is the interception of Russian and Chinese bombers by NORAD fighters inside the Alaska Air Defense Identification Zone (ADIZ). This event occurred on July 24, 2024."}, {"id": "1a8a06cf-0baf-44ce-b127-bc3368407a0e", "title": "Netanyahu Defends America Before Congress", "date": "2024-07-25 01:45", "url": "https://www.frontpagemag.com/netanyahu-defends-america-before-congress/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Prime Minister Benjamin Netanyahu had come to D.C. to defend Israel’s war against Islamic terrorists, instead he ended up defending America in a city and Congress overrun with them.\nMarxist and Jihadist mobs prowled the streets of D.C., tearing down and burning American flags, and putting up the terrorist flags of the PLO in their place.\nThe Columbus fountain outside Union Station was vandalized with the red triangles supporting Islamic terrorist attacks and “Hamas is Coming”.\nIt fell to Netanyahu to condemn the mobs who “burned American flags even on the fourth of July.\nBut despite his eloquence, the red and green mobs outside waving terrorist flags, chanting “Allahu Akbar” and burning American flags did that better than even the greatest speech ever could.", "location": "Washington, D.C.", "classification": "security", "score": 0.6699407894345694, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nNone"}]