[{"id": "c2982cb9-3ee6-4f77-84a3-ea8d549f184d", "title": "Probe finds two universities failed to protect Jewish and Muslim students", "date": "2024-06-18 00:45", "url": "https://www.adn.com/nation-world/2024/06/17/probe-finds-two-universities-failed-to-protect-jewish-and-muslim-students/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism and more.\nAn additional 106 cases are pending at the Office for Civil Rights in the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThere was also “no evidence” that the university complied with its legal requirements under Title VI of the Civil Rights Act, the report said.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found.", "location": "Based on the provided information, it appears that the main focus of the event is the United States.", "classification": "antisemitism", "score": 0.8554251738413081, "event_breakdown": "Jewish students at Stanford vandalized\nJewish students harassed at Montreal rally"}, {"id": "92aaf789-1efa-4d70-959b-4109db992745", "title": "Alsobrooks visits the heart of Baltimore Jewish community and Hogan country", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/alsobrooks-visits-heart-baltimore-jewish-011701533.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Prince George’s County Executive Angela Alsobrooks (D) traveled to the heart of Baltimore’s Jewish community Monday to meet with local leaders and promote her Senate candidacy.\n“Growing up in the 1970s, it was hard not to have conversations about the Jewish community and the African-American community being special friends,” she said.\n“I think it’s important for her to meet with the Jewish community here, hear what we’re working on, because she’s not from Baltimore,” said Howard Libit, executive director of the Baltimore Jewish Council.\n“She’s reached out to understand the issues that are important to the Jewish community,” he said.\nThey’re not going to want Republicans controlling the agenda.”The post Alsobrooks visits the heart of Baltimore’s Jewish community — and Hogan country appeared first on Maryland Matters.", "location": "Baltimore", "classification": "antisemitism", "score": 0.8257386330771576, "event_breakdown": "* On March 25, 2022, there was a swastika found spray-painted on a dumpster near the University of Maryland, College Park Hillel.\n* A swastika and other antisemitic graffiti were drawn on the Spring Valley Lane Elementary School in Spring Valley, New York on March 10, 2022.\n* In early February 2022, swastikas were drawn on rollup windows, anti-LGBTQ graffiti and a racial slur were discovered at St. Raymond Catholic School in Philadelphia, PA.\n* Swastika and other graffiti were spray painted in the Irvine community, California, on January 24, 2022, causing a stir."}, {"id": "759cf14a-b0ba-4e9e-a835-0fbba1ca5d22", "title": "Probe finds two universities failed to protect Jewish , Muslim students", "date": "2024-06-18 00:45", "url": "https://www.bostonglobe.com/2024/06/17/nation/probe-finds-two-universities-failed-protect-jewish-muslim-students/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism, and more.\nAn additional 106 cases are pending at the Office for Civil Rights at the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThe provision bars discrimination based on shared ancestry, including against those who are Jewish or Muslim.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found.", "location": ")\nWASHINGTON", "classification": "antisemitism", "score": 0.8928033993695561, "event_breakdown": "Jewish Community Center bomb threats\nJewish cemetery desecration\nAntisemitic graffiti\nAntisemtic incidents on college campuses\nAntisemtic incidents at K-12 schools"}, {"id": "8a243968-1beb-4348-9bcb-760b64cdb432", "title": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearance", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/ben-cardin-touts-angela-alsobrooks-022700548.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearanceDuring their first joint campaign appearance since Angela Alsobrooks announced her campaign to succeed him, U.S. Sen. Ben Cardin on Monday touted the Prince George’s County executive, saying she was the best candidate to boost U.S.-Israel relations.\nCardin told a panel of Baltimore-area Jewish leaders that Alsobrooks would be the best choice to stand up for Jewish Marylanders against rising antisemitism and would support congressional efforts to promote peace in Gaza.\n“I always talk about how Jewish values are my North Star,” said Cardin, listing his support for stricter gun control and advocacy for LGBTQ rights and reproductive freedom.\nAndrew Cushnir, the chief executive and president of the Associated Jewish Federation of Baltimore, said the days since the Oct. 7 Hamas attack “have been incredibly difficult” for both Jewish Baltimoreans and Jewish people around the world.\nAlsobrooks said she was “grateful” for Van Hollen’s support, though she said the two had “different positions” on Israel and did not elaborate.", "location": "Baltimore, Maryland", "classification": "antisemitism", "score": 0.9329035632423899, "event_breakdown": "Target Event: Biden accuses some in the U.S. Congress of antisemitism\nSome in the U.S. Congress are trying to block a $735 million arms sale to Israel approved by the Biden administration.\nLocation: Washington, D.C.\nBiden: U.S. Congress blocking $735M Israel arms sale\nPresident Joe Biden is accusing some in the U.S. Congress of holding an anti-Israeli stance and trying to block a $735 million arms sale approved by his administration.\nBiden said Tuesday that “no Iron Dome” missile defense system was intended for use in Israel. Biden vowed to “make sure” the deal went through despite any other movement against it.\n“The Israelis, Jewish, are sent to the hell of slavery”\nIranian Supreme Leader Ayatollah Ali Khamenei made an antisemitic statement in a tweet Tuesday aimed at Israelis. It appears that Khamenei’s Twitter account wrote, “The West and Zionism are on course to collapse, and Palestine will be free.”"}, {"id": "7c2a77fc-20d1-418a-a36c-0d8e7414bb23", "title": "Oppose Antisemitism : Stop the Hate - Chosen People Ministries to Host Rally in New York City on June 20", "date": "2024-06-18 13:30", "url": "https://www.finanznachrichten.de/nachrichten-2024-06/62520204-oppose-antisemitism-stop-the-hate-chosen-people-ministries-to-host-rally-in-new-york-city-on-june-20-200.htm", "domain": "finanznachrichten.de", "domain_classification": "Unknown", "message": "On June 20, Chosen People Ministries, an organization dedicated to sharing the love of the Messiah with Jewish people worldwide, will host \"Oppose Antisemitism: Stop the Hate\" at Palladium Times Square in Manhattan.\nThrough the rally, Chosen People Ministries is seeking to confront and combat the global scourge of antisemitism through education, solidarity, and prayer.\n\"Through events like 'Oppose Antisemitism: Stop the Hate,' we hope to inspire individuals to become agents of change and champions of tolerance and understanding.\"\n\"We cannot stand idly by while antisemitism continues to spread its poisonous ideology,\" said Dr. Glaser.\nThe \"Oppose Antisemitism: Stop the Hate\" event is open to people of all faiths and backgrounds who share a commitment to combating antisemitism and promoting a world where all people are treated with dignity and respect.", "location": "MANHATTAN", "classification": "antisemitism", "score": 0.9461259999637303, "event_breakdown": "June 16, 2022: Antisemitic graffiti was spray painted on a headstone in a Jewish cemetery in France. The graffiti included swastikas and the word \"Juden.\"\nJune 16, 2022: Antisemitic graffiti was found on a Jewish-owned business in England. The graffiti included swastikas and the word \"Jew.\"\nJune 13, 2022: Antisemitic graffiti was found on the front of a synagogue in England. The graffiti included a swastika and the word \"Jew.\"\nJune 5, 2022: Antisemitic graffiti was found on a Jewish-owned business in London. The graffiti included swastikas and the word \"Jew.\"\nJune 4, 2022: Antisemitic graffiti was found on a Jewish-owned business in Rome. The graffiti included swastikas and the word \"Jew.\"\nJune 3, 2022: Antisemitic graffiti was found on a Jewish-owned business in Spain. The graffiti included swastikas and the word \"Jew.\""}]