[{"id": "5eaec57e-05aa-4752-93be-3df85e1f5ff9", "title": "World Should Rally to Halt Unfolding Atrocities in Darfur", "date": "2024-05-18 02:00", "url": "https://article.wn.com/view/2024/05/18/World_Should_Rally_to_Halt_Unfolding_Atrocities_in_Darfur/", "message": "Tens of thousands of people in El Fasher have already been displaced, with many civilians trapped in the city without access to aid.\nClick to expand ImageDamage to Babiker Nahar Pediatric Hospital in El Fasher, capital of North Darfur following an airstrike, May 11, 2024.\n© 2024 Ayin NetworkObservers within the United Nations, governments, and civil society have warned an attack on El Fasher would cause immeasurable suffering.\nThis is consistent with the RSF and allied forces’ modus operandi in West Darfur last year.\nThe ongoing assault in El Fasher bares stark similarities to these findings and warns of a tragedy which may repeat itself.", "location": "El Fasher", "classification": "security", "score": 0.7527689671855524, "event_breakdown": "1. The ongoing assault on El Fasher, the capital of North Darfur\n2. Attacks on Babiker Nahar Pediatric Hospital in El Fasher, capital of North Darfur\n3. Attacks in West Darfur last year (Related to #1 - ongoing assault on El Fasher)\n4. Human rights violations"}, {"id": "7af49238-afb4-4c1e-86d6-1b3485b13cde", "title": "Update : Israeli army says kills senior commander in Lebanese Islamic organization - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/61228b475b09450c9107e64dc649ea9f/c.html", "message": "JERUSALEM, May 17 (Xinhua) -- The Israel Defense Forces (IDF) on Friday said it killed Sharhabil Ali al-Sayed, a senior commander in the Lebanese Islamic Group, or Jamaa Islamiya, in an airstrike on the area of Majdal Anjar village in southeastern Lebanon.\n\"Al-Sayed has recently led many attacks and acts of terrorism from Lebanese territory against Israel in the eastern sector, in cooperation with the Lebanese Hamas branch,\" the IDF said in a statement.\nThe statement noted that the operation was carried out \"to harm the organization's ability to promote and carry out terrorist operations that it planned in the recent period and in the near future against Israel on the northern border.\"\nEarlier in the day, the IDF reported that 75 launches of rockets and drones were carried out from Lebanon into northern Israel.\nMeanwhile, Lebanese military sources told Xinhua on Friday that an Israeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene.", "location": "Lebanon", "classification": "security", "score": 0.990841084664424, "event_breakdown": "Security events:\n- The IDF killed Sharhabil Ali al-Sayed, a senior commander in the Lebanese Islamic group, in airstrike on southeastern Lebanon.\n- IDF launched 75 rockets and drones from Lebanon into northern Israel.\n- An Israeli drone followed a four-wheel drive car in Rashaya, fired 2 air-to-surface missiles, killing Sharhabil al-Sayed and wounding two people."}, {"id": "1cde5d3f-4c0b-40de-b93e-dd9a280943ed", "title": "Ukrainian Forces Strengthening Defense In Kharkiv Sector , Destroy Eight Enemy Dugouts", "date": "2024-05-18 01:30", "url": "https://menafn.com/1108227726/Ukrainian-Forces-Strengthening-Defense-In-Kharkiv-Sector-Destroy-Eight-Enemy-Dugouts", "message": "The enemy continued to carry out active offensive and assault operations in the Pokrovsk and Dnipro River sectors.\nIn the Kharkiv sector, the enemy launched 15 airstrikes, using 18 guided aerial bombs.\nSince the beginning of the day, the Russians have carried out six airstrikes near Chasiv Yar, Pivnichne, Druzhba, and Toretsk.\nAnother enemy airstrike was recorded in the Kurakhove sector, near the village of Bohatyr.\nIn the Dnipro River sector, the Russians tried to dislodge Ukrainian forces from the bridgeheads on the left bank of the Dnipro River.", "location": "POKROVSK", "classification": "security", "score": 0.7832415416448929, "event_breakdown": "1. Russians carried out 15 airstrikes, using 18 guided aerial bombs in Kharkiv sector.\n2. Russians carried out six airstrikes near Chasiv Yar, Pivnichne, Druzhba, and Toretsk in Kharkiv sector.\n3. Russians launched 6 airstrikes near Chasiv Yar, Pivnichne, Druzhba, and Toretsk in Kharkiv sector.\n4. Russians carried out a airstrike near village of Bohatyr in Kurakhove sector.\n5. Russians used 18 guided aerial bombs in the Kharkiv sector.\n6. Russians attempted to dislodge Ukrainian forces from the bridgeheads on the left bank of the Dnipro River in the Dnipro River sector."}, {"id": "c6a2735d-0cb4-40f0-82a1-876f505f169b", "title": "Israeli strikes kill at least 5 in Lebanon , including civilians", "date": "2024-05-18 03:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/israeli-strikes-kill-least-5-lebanon-including-civilians-3612501", "message": "Smoke billows over northern Israel after rockets were fired from Lebanon, amid ongoing cross-border hostilities between Hezbollah and Israeli forces, by Israel's border with Lebanon, May 16, 2024.\nPhoto: Reuters/Ayal MargolinIsraeli strikes on southern and eastern Lebanon killed at least five people on Friday including Lebanese militants, Palestinian fighters and Syrian civilians, security sources told Reuters.\nOn Friday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and launched a drone attack the furthest into Israeli territory since October.", "location": "Lebanon", "classification": "security", "score": 0.9952341070783074, "event_breakdown": "Event 1: Israeli strikes on southern and eastern Lebanon.\nEvent 2: Dead five in Israeli strikes on southern and eastern Lebanon.\nEvent 3: Killed Lebanese militants in Israeli strikes on southern and eastern Lebanon.\nEvent 4: Israeli military strikes a coastal town further north than the usual conflict area.\nEvent 5: Killed Hezbollah member in Israeli strikes on a coastal town.\nEvent 6: Killed two Syrian civilians in Israeli strikes on a coastal town."}, {"id": "4acaa39f-1202-43e0-9c8f-a4750e12d232", "title": "IDF Finds Loaded Rocket Launchers in Rafah", "date": "2024-05-18 02:00", "url": "https://www.breitbart.com/politics/2024/05/16/idf-finds-loaded-rocket-launchers-in-rafah/", "message": "The Israel Defense Forces (IDF) has found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip, now in its second week.\nThese launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\nThe rocket launchers were destroyed by the IDF.\nIn another targeted raid, the soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched.\nThe fact that the IDF is discovering and destroying rocket launchers provides further justification for the ongoing Rafah operation, to which the Biden administration and much of the international community has objected.", "location": "GAZA", "classification": "security", "score": 0.9036485277485259, "event_breakdown": "* The Israel Defense Forces (IDF) found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip.\n* The rocket launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\n* The IDF destroyed the rocket launchers.\n* The soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched."}, {"id": "fa4ee64e-ea1d-4402-8bd0-33ad426b0d53", "title": "Israeli strikes kill at least five in Lebanon , including two children", "date": "2024-05-18 00:00", "url": "https://www.gulf-times.com/article/682753/region/israeli-strikes-kill-at-least-five-in-lebanon-including-two-children", "message": "Israeli strikes on southern and eastern Lebanon killed at least five people yesterday including two children, security sources and Unicef said.Israel and Lebanese armed group Hezbollah have been exchanging fire across Lebanon’s southern border for seven months in parallel with the Gaza war.\nOther Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon.Yesterday, a series of Israeli strikes on a coastal town further north than the usual conflict area killed a Hezbollah member as well as two Syrian civilians, the security sources said.\nUnicef Lebanon separately said two children were killed in an Israeli strike on Friday.A separate Israeli strike on Majdal Anjar, on Lebanon’s eastern border with Syria, killed Sharhabil al-Sayed, a member of Palestinian group Hamas who was in charge of the faction’s operations in Lebanon’s eastern Bekaa Valley, according to two security sources.The strike also killed another Palestinian Hamas member, the sources said.The Israeli military said its forces struck a Hezbollah launcher and military infrastructure in southern Lebanon and confirmed the death of al-Sayed.It said sirens warning of incoming rockets and hostile aircraft sounded in several communities throughout yesterday and at one point identified 75 launches crossing from Lebanon into Israel.\nIt said dozens of the launches were intercepted and there were no immediate reports of deaths or damage.\nThe exchanges of fire between armed groups in Lebanon and the Israeli military have ramped up in recent days.", "location": "Lebanon", "classification": "security", "score": 0.9963965698357272, "event_breakdown": "Israeli strikes in southern and eastern Lebanon killed five people, including a Hezbollah member and two Palestinian members of Hamas, including two Syrian children."}, {"id": "cf255e2f-b9e4-470e-a467-e6e4e3d9d549", "title": "Israel Hamas war : IDF finds bodies of three hostages in Gaza", "date": "2024-05-18 02:15", "url": "https://www.watoday.com.au/world/middle-east/israeli-army-finds-bodies-of-three-hostages-amid-fierce-fighting-in-northern-gaza-20240518-p5jemx.html", "message": "Jerusalem, Cairo: The Israeli military said its troops in Gaza found the bodies of three Israeli hostages killed by Hamas during its October 7 attack, including German-Israeli Shani Louk.\nThe military identified the other two bodies as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nThe Israeli military said its troops in Gaza found the bodies of the three Israeli hostages.\nCredit: Hostages Families Forum Headquarters via APAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsraeli Prime Minister Benjamin Netanyahu called the deaths “heartbreaking,” saying, “We will return all of our hostages, both the living and the dead.”", "location": "Jerusalem", "classification": "security", "score": 0.9904606258248573, "event_breakdown": "1. The Israeli military said its troops in Gaza found the bodies of three Israeli hostages killed by Hamas on October 7.\n2. The three were killed by Hamas while fleeing the Nova music festival near the Gaza border.\n3. On October 7, militants killed hundreds of people at the music festival."}, {"id": "1fa46ddd-829a-4d1d-83c6-9f4fde9b46a0", "title": "At least 1 killed , 8 injured in Israeli airstrike on West Bank Jenin - Xinhua", "date": "2024-05-18 00:00", "url": "https://english.news.cn/20240518/0920c9fd2d8b4c1091bb89409d07a62f/c.html", "message": "Medical sources told Xinhua that at least one person was killed and eight others injured in the airstrike on the Jenin refugee camp.\nIt confirmed the death of Khamayseh, saying he was a key wanted person in the Jenin refugee camp and responsible for several attacks in the area, including two shooting attacks about a year ago in which an Israeli was killed and others injured.\nThe IDF added that the airstrike was carried out under the intelligence guidance of the Israeli Security Agency (ISA).\nSome of them were involved in carrying out shooting attacks in the Jenin sector and also planned to carry out additional attacks soon.\"\n\"The IDF and the ISA will continue to work to thwart any terrorist threat against the citizens of Israel,\" said the statement.", "location": "Jenin refugee camp", "classification": "security", "score": 0.9441822790926282, "event_breakdown": "Security events:\n- An Israeli was killed in a shooting attack in Jenin sector.\n- Another Israeli was killed in the Jenin refugee camp.\n- An Israeli was killed in the Jenin refugee camp, and Israeli security agency (ISA) have targeted a person responsible and killed him by airstrike."}, {"id": "6a0358c7-d86e-42b6-a8d8-630bd6e1dfd0", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone", "date": "2024-05-18 00:00", "url": "https://krcgtv.com/news/nation-world/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone", "message": "Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as \"carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nOnline video showed wreckage resembling the pieces of the Reaper on the ground, as well as footage of that wreckage on fire.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.", "location": "Yemen", "classification": "security", "score": 0.49116401815685884, "event_breakdown": "Houthi rebels claim to have shot down an American drone in Yemen. (Unconfirmed)"}, {"id": "332d4858-d4df-4992-898e-ba389f55d2e3", "title": "Hamas loses  commander  in Israeli strike - Newspaper", "date": "2024-05-18 02:15", "url": "https://www.dawn.com/news/1834210/hamas-loses-commander-in-israeli-strike", "message": "BEIRUT: Hamas said on Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nA source close to the Palestinian group had earlier said FP that Sayed was a Hamas official responsible for Lebanon’s Bekaa region and “was killed in an Israeli strike that targeted his vehicle”.\nThe strike came after Israeli strikes earlier in the day killed a Hezbollah fighter and two children, according to the Lebanese group and official media.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al Aruri and six others in Hezbollah’s south Beirut stronghold.", "location": "Lebanon", "classification": "security", "score": 0.9857981385425238, "event_breakdown": ".\n- Early Friday, an Israeli strike killed a Hezbollah fighter and two children in eastern Lebanon near the Syrian border, according to the Lebanese group and official media.\n- Hours later, Israeli strikes targeted a Hamas official in eastern Lebanon, killing him."}, {"id": "b425e104-c0fa-49b9-8bcd-75a94457e200", "title": "Hezbollah Launches First - Ever Airstrike On Israeli Territory", "date": "2024-05-18 00:00", "url": "https://www.zerohedge.com/geopolitical/hezbollah-launches-first-ever-airstrike-israeli-territory", "message": "Via The CradleHezbollah launched the first-ever Lebanese airstrike on an Israeli target on Friday, using a never-before-seen drone for the operation.\npic.twitter.com/YXaO5fSDLr — Middle East Observer (@ME_Observer_) May 16, 2024Three Israeli soldiers were reportedly injured – with one seriously wounded – in the drone attack.\nCoinciding with Israel’s brutal assault on Rafah and its relentless attacks across the Gaza Strip, Hezbollah has stepped up its operations in recent days.\nIn response to Israeli airstrikes on eastern Lebanon the day prior, Hezbollah also announced on Thursday a drone attack on Elbit Systems, the Israel-based international military technology company.\nA couple of days ago we saw how Hezbollah used the new… https://t.co/mkl9FoQ2qi pic.twitter.com/6m5SpSrHkP — Ali Hashem علي هاشم (@alihashem_tv) May 16, 2024It also targeted the David Cohen factory in Tel Hai, north of the Kiryat Shmona settlement.", "location": "Israel", "classification": "security", "score": 0.9253174899958335, "event_breakdown": "Hezbollah announces a drone attack on Elbit Systems, the Israel-based international military technology company\nHezbollah used drones to attack three Israeli military targets\nThree Israeli soldiers were reportedly injured - one seriously wounded - in the drone attack on Israeli targets"}, {"id": "2d7cf395-ed59-458b-8839-f1c1f1f0fc45", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532073.html", "message": "Beirut, May 18 : A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement \"will remain resistant until the complete liberation of Palestine.\"\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.993254227335688, "event_breakdown": "2023\nOctober\n8: Missiles fired at Israel by Hezbollah, in retaliation for Israeli attacks on Lebanon\nOctober\n7: Missiles fired by Hezbollah towards Israel\nLebanon\nIsrael"}, {"id": "d891e0d2-37a7-4a67-b35a-00a16ae1e435", "title": "Hamas official killed in  Israeli strike  in Lebanon", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/hamas-official-killed-in-israeli-strike-in-lebanon-3028179/", "message": "Beirut: A Hamas member was reportedly killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday.\nIsraeli drone followed a four-wheel drive vehicle that was driving in the town of Rashaya, fired two air-to-surface missiles at it, burning the car and killing its driver, Sharhabil al-Sayed, and seriously wounding his companion and a civilian who happened to be at the scene, Lebanese military sources told Xinhua news agency.\nAlso Read First lorries with aid for Gaza leave newly constructed US pierThe Al-Qassam Brigades, the military wing of Hamas confirmed in a statement that al-Sayed was a member.\nWhile inspecting the scene of the incident, a Hamas official in the Bekaa region in eastern Lebanon, Mahmoud Baraka, vowed in a separate brief statement that the movement “will remain resistant until the complete liberation of Palestine.”Tensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9964366387613592, "event_breakdown": ".\nHere is a summary of security events related to targeted Israeli airstrikes:\n-A Hamas member was reportedly killed from what appeared to be Israeli airstrikes.\n-Two other people were injured in an Israeli airstrike in southern Lebanon.\n-The Israeli military conducted an air-to-surface missile attack on a car in Lebanon.\n-A Hamas member, Sharhabil al-Sayed, was confirmed to be killed by the Lebanese military sources.\n-A civilian who was at the scene was also seriously injured due to the Israeli airstrike.\n-Security tensions escalated along the Lebanon-Israel border in October 2023 following a rocket launch by the Hezbollah group towards Israel.\n-The Israeli military retaliated by firing heavy artillery towards southeastern Lebanon"}, {"id": "37b5b6f0-20f4-4d6c-93a3-ca8a5a9eb30b", "title": "Operation Iron Swords", "date": "2024-05-18 03:00", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-17.htm", "message": "Operation Iron Swords - Day 224 - 17 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nThere, according to the verified information we have, they were brutally murdered by Hamas terrorists, and their bodies were taken into the Gaza Strip.\n?the corridor of the center of the Gaza Strip and in the neighborhood of Bakshi, the fighters eliminated terrorists, exposed and destroyed underground infrastructures.\nOpinion polls show that Netanyahu would be defeated if the elections were held now amid the chaos of war, according to the newspaper report.\nOperation Iron Swords - By the NumbersIn a recent interview on the Call Me Back podcast with Dan Senor, Israeli Prime Minister Benjamin Netanyahu disclosed startling statistics regarding the casualties in the ongoing conflict between Israel and Hamas.", "location": "GAZA STRIP", "classification": "security", "score": 0.7458587168945354, "event_breakdown": "- Operation Iron Swords - Day 224 - 17 May 2024\n- Israelis Defense Ministry's latest airstrikes on Gaza Strip\n- Destroyed an underground complex in Gaza, the Israeli army said\n- the corridor of the center of the Gaza Strip and in the neighborhood of Bakshi\n- The IDF attacks in the southern Gaza Strip, near the Kerem Shalom Crossing"}, {"id": "15fc8236-e775-4b2b-9f29-a9d9fbf0008e", "title": "SC allows prosecution of HM operatives in Banihal attack", "date": "2024-05-18 03:30", "url": "https://www.dailyexcelsior.com/sc-allows-prosecution-of-hm-operatives-in-banihal-attack/", "message": "The Supreme Court drew parallels between the unsuccessful attack on the CRPF convoy and the deadly 14 February 2019 Pulwama attack, which claimed the lives of 40 CRPF personnel.\nThe Pulwama attack was perpetrated by a suicide bomber affiliated with the Pakistan-based Jaish-e-Mohammad (JeM).\nOn March 30, 2019, individuals suspected to be members of Hizbul Mujahideen attempted to execute an attack on a CRPF convoy in Banihal along the Jammu-Srinagar National Highway.\nFollowing the Pulwama attack, the Union Home Ministry transferred the investigation of the attempted ambush on the CRPF convoy to the NIA.\nNaikoo, one of Kashmir’s most wanted terrorists and the commander of Hizbul Mujahideen (HM) was killed during an encounter in Pulwama in May 2020.", "location": "Pulwama, Kashmir", "classification": "security", "score": 0.9951435754258856, "event_breakdown": ",\nSecurity Events:\n\n1. Pulwama Attack - 14 February 2019: JeM suicide bomber targets CRPF convoy in Pulwama, Jammu and Kashmir, killing 40 personnel.\n2. Attempted Ambush on CRPF Convoy - 30 March 2019: Hizbul Mujahideen militants try to execute an attack on a CRPF convoy in Banihal, Jammu-Srinagar National Highway.\n3. Transfer of Investigation to NIA - March 2019: Union Home Ministry transfers the investigation of the attack to the NIA.\n4. Encounter in Pulwama - May 2020: Naikoo, a commander of Hizbul Mujahideen, one of the most wanted terrorists in Kashmir, is killed in Pulwama."}, {"id": "4a34b848-39e1-45ec-87e5-b32a47bbd186", "title": "Xinhua Middle East news summary at 2200 GMT , May 17", "date": "2024-05-18 00:00", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/18/content_117196626.htm", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA -- Yemen's Houthi group said on Friday that it had shot down a \"U.S. MQ-9 spy drone\" over the Yemeni central province of Marib.\n\"The plane was targeted by a locally made surface-to-air missile, and the video showing scenes will be broadcast later,\" Houthi military spokesman Yahya Sarea said in a statement aired by Houthi-run al-Masirah TV.\n(Yemen-Houthis-U.S. Drone)- - - -BEIRUT -- A Hamas member was killed and two other people injured in what appeared to be a targeted Israeli airstrike in southern Lebanon on Friday, Lebanese military sources told Xinhua.\n(Hamas-Israel-Lebanon)- - - -GAZA -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has risen to 35,303, health authorities in the Palestinian enclave said in a press statement on Friday.\n(Gaza-Death Toll)- - - -JERUSALEM -- The Israel Defense Forces (IDF) and the Israeli Security Agency (ISA) recovered in a joint night operation the bodies of three Israeli hostages in the Gaza Strip, as announced by IDF Spokesman Daniel Hagari on Friday.", "location": "Yemen", "classification": "security", "score": 0.9537221899026954, "event_breakdown": "-\nSecurity Events:\n1. Houthis in Yemen claim to have shot down a \"U.S. MQ-9 spy drone\" over the Yemeni central province of Marib. (Marib, Yemen)\n2. A Hamas member was killed and two others injured in a suspected Israeli airstrike in southern Lebanon. (Southern Lebanon)\n3. The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip rises to 35,303. (Gaza Strip, Palestine)\n4. The Israeli Defense Forces and the Israeli Security Agency recover the bodies of three Israeli hostages in the Gaza Strip in a"}, {"id": "896091e0-996b-4c83-b2c7-ff75427c6e85", "title": "Iran Update , May 17 , 2024 | Institute for the Study of War", "date": "2024-05-18 02:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-may-17-2024", "message": "Northern Gaza Strip: Israeli forces described the fighting in Jabalia as some of the most intense of the war.\nSouthern Gaza Strip: Israeli forces continued clearing operations in several areas of eastern Rafah.\nIsraeli forces continued clearing operations in several areas of eastern Rafah on May 17.\n[30]Aid trucks began transporting supplies from the US-constructed offshore pier into the Gaza Strip on May 17.\n[39]Palestinian militias conducted at least two indirect fire attacks from the Gaza Strip into Israel on May 17.", "location": "Jabalia", "classification": "security", "score": 0.9881396161711287, "event_breakdown": "* Northern Gaza Strip: Israeli forces describe the fighting in Jabalia as some of the most intense war.\n* Southern Gaza Strip: Israel continues clearing operations in several areas of eastern Rafah.\n* Aid trucks deliver supplies from the US-constructed offshore pier into the Gaza Strip.\n* Palestinian militias launch two indirect fire attacks from the Gaza Strip into Israel."}, {"id": "26293891-2a07-4169-a2e8-0a796d55075f", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 04:45", "url": "https://dunyanews.tv/en/World/812486-Hamas-says-commander-killed-in-Israel-strike-in-Lebanon", "message": "Hamas says commander killed in Israel strike in LebanonWorld World Hamas says commander killed in Israel strike in LebanonSharhabil Sayed was killed \"after he was targeted by Israeli aircraft\" in Lebanon's West Bekaa area.\nFollow on Published On: Sat, 18 May 2024 07:22:59 PKTBEIRUT (AFP) – Palestinian militant group Hamas said Friday that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nLebanon's official National News Agency reported one dead and two wounded in an \"enemy strike\" that targeted a vehicle in the same area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold.", "location": "BEIRUT", "classification": "security", "score": 0.9889347194320897, "event_breakdown": "1. In March,  a Hamas member was killed in a strike in Lebanon's south.\n2. In January,  Damascus said Israeli planes targeted a residential building in Mezzah and killed six people.\n3. A the US defense official said the Israeli strike was carried out by Israel.\n4. In the same bombing, Saleh fields a truce call to Abbas and Netanyahu.\n5. To make the truce happen, Hadi al-Ameriah of Hamas battles with Egypt and UN officials.\n6. On Friday, Lebanese Prime Minister Nawaf Salam said he wanted clarifications from the Jewish state over a wave of raids on its northern border.\n7. On Friday, Israel said \"Iran is using Hezbollah and Islamic Jihad to strike.\""}, {"id": "82b6cee8-bc80-4b00-af39-d19269eb40cb", "title": "Israel prefers to avoid tough war with Hezbollah : Defence Minister", "date": "2024-05-18 04:15", "url": "https://www.siasat.com/israel-prefers-to-avoid-tough-war-with-hezbollah-defence-minister-3028188/", "message": "Jerusalem: Israeli Defence Minister Yoav Gallant has said that his country prefers to avoid a difficult war with the Lebanese armed group Hezbollah.\nAccording to reports in Lebanon, a local leader of the group was killed in the Israeli strikes.\nAt the same time, Hezbollah’s attacks continued on Friday, with dozens of rockets and drones launched into northern Israel.\nThe exchanges of fire between Hezbollah and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and recently launched a drone attack the furthest into Israeli territory since October.", "location": "LEBANON", "classification": "security", "score": 0.9718204682983853, "event_breakdown": "Events:\n- Israeli strikes on Lebanon,\n- Deployment of rockets by Hezbollah,\n- Drone attack by Hezbollah,\n- Hezbollah attacks on northern Israel."}, {"id": "38eb1c3e-834b-427a-a895-575ebc6a9d4a", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 00:15", "url": "https://www.malaymail.com/news/world/2024/05/18/hamas-says-commander-killed-in-israel-strike-in-lebanon/135052", "message": "BEIRUT, May 18 — Palestinian militant group Hamas said Friday that a “commander” was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas’ armed wing, the Ezzedine al-Qassam Brigades, said in a statement that “commander” Sharhabil Sayed was killed “after he was targeted by Israeli occupation aircraft” in Lebanon’s West Bekaa area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold.\nThe cross-border fighting has killed at least 419 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally.", "location": "Lebanon", "classification": "security", "score": 0.9956046546140543, "event_breakdown": "Events:\n1. Palestinian militant group Hamas announces the killing of a 'commander' in an Israeli strike on an eastern district of Lebanon near the Syrian border.\n2. Israeli airstrike in theLebanon's West Bekaa area kills a Hamas 'commander'\n3. Another Hamas member was killed in an Israeli strike in south Lebanon\n4. In January, Israeli strike (US defence official says it was Israel's doing) kills Hamas's deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold.\n5. There have been 419 people killed in Lebanon as a result of a cross border fighting\n6. The casualties include 82 Lebanon's civillians.\n7. Among the 419 casualties, 82 are lebanese civillians.\n8. In aftermath of the 2019 Beirut explosions, Hezbollah's media team picked up Illegal weapon and assault rifles."}, {"id": "3b1a1e93-163e-4bbf-bde6-2ef687925d85", "title": "How Israel Rafah Campaign Might Shape Hezbollah Operations", "date": "2024-05-18 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/how-israels-rafah-campaign-might-shape-hezbollahs-operations", "message": "On April 22, Hezbollah claimed to strike a base north of Acre, its deepest attack into Israel since the Gaza war began.\nHezbollah’s Rafah CalculusThe onset of the Rafah campaign is vital to Hezbollah for two main reasons.\nIndeed, multiple indicators and statements imply an Israeli escalation against Hezbollah after Rafah.\nAccordingly, Hezbollah may feel compelled to flex its muscles during the Rafah campaign in order to impose conditions on Israel, Washington, and Paris.\nThe group has already committed to stop its attacks once the Gaza war is over, so it is certainly amenable to the general idea of de-escalation.", "location": "HAIFA", "classification": "security", "score": 0.7944489859370524, "event_breakdown": "1. Hezbollah claimed to strike a base north of Acre.\n2. Hezbollah's Rafah Calculus.\n3. Hezbollah's Rafah Calculus is vital to Hezbollah for two main reasons.\n4. Several indicators and statements imply an Israeli escalation against Hezbollah after Rafah.\n5. Hezbollah may feel compelled to flex its muscles during the Rafah campaign.\n6. Hezbollah has already committed to stop its attacks once the Gaza war is over."}, {"id": "16684818-8ed7-4038-90e4-ad1bcc579409", "title": "Man Arrested : Man arrested for killing four | Indore News", "date": "2024-05-18 00:45", "url": "https://timesofindia.indiatimes.com/city/indore/man-arrested-for-killing-four/articleshow/110221182.cms", "message": "We also published the following articles recentlyFour persons were killed in an accident in KonaseemaFour persons were killed in a tragic road accident in Konaseema district involving an RTC bus.\nThe accident occurred as workers were loading paddy near Udumudi village on Tuesday night.\nAnjali murder case: Karnataka Police arrest accused from HubbaliGirish alias Vishwa, prime suspect in Anjali's murder, arrested by Hubbali Police after stabbing incident at her residence.\nHe told the police that there was a dispute between him and his relative Arvind over ‘Banjghadi’ tradition.\nWhen he saw two other people from Surdiya village passing from the area witnessing the crime, they followed them and mowed them down.", "location": "Konaseema district", "classification": "security", "score": 0.9542198878186774, "event_breakdown": "Security events:\n- Four persons were killed in a road accident in Konaseema district involving an RTC bus.\n- A prime suspect in Anjali's murder was arrested by Hubbali Police after a stabbing incident at her residence.\n- There was an incident involving three people and a dispute over 'Banjghadi' tradition."}, {"id": "0703fc79-a84d-4a3d-a819-828d1b0d0d36", "title": "Schmaybe 50 Tunnels Crossing Into Their Country Why Egypt So Riled About Rafah ? ", "date": "2024-05-18 03:00", "url": "https://hotair.com/tree-hugging-sister/2024/05/17/schmaybe-50-tunnels-crossing-into-their-country-why-egypt-so-riled-about-rafah-n3788602", "message": "Nearly 700 tunnel shafts have been identified in Rafah, with ~50 tunnels crossing into Egypt, revealed @DrGiladNoam at today's sham @CIJ_ICJ hearing.\nThose tunnels are used to smuggle weapons to Hamas and can be used to smuggle senior terrorists and/or hostages out of Gaza.\npic.twitter.com/UAgvyTCoJk — Israel War Room (@IsraelWarRoom) May 17, 2024At least fifty tunnels - so far - scootin' over - well, under - the border into Egypt.\n\"Nearly 700 tunnel shafts have been identified in Rafah, from which approximately 50 tunnels cross into Egypt.\nIf any Americans were to be spirited through those tunnels into Egypt, that would be the end of it.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.6291386432696427, "event_breakdown": "Here is the list of events:\n- 700 tunnel shafts have been identified in Rafah, a city in the southern Gaza Strip.\n- Approximately 50 tunnels cross into Egypt from Rafah.\n- These tunnels are used to smuggle weapons to Hamas, the governing authority of the Gaza Strip.\n- These tunnels can be used to smuggle senior terrorists and/or hostages out of Gaza."}, {"id": "8ee84e96-9819-4128-891b-63d51c8412e7", "title": "7 soldiers injured after blast in St . Petersburg military academy", "date": "2024-05-18 00:00", "url": "https://www.prokerala.com/news/articles/a1532071.html", "message": "Image Source: IANS NewsSt. Petersburg, May 18 : Seven soldiers were injured after a World War II-era munition exploded in the Military Academy of the Signal Corps in St. Petersburg, Russia's Leningrad Military District said.\nThe explosion occurred on Friday during the cleaning of one of the basement premises when people unloaded garbage into a container, the district's press office was quoted as saying by Xinhua news agency.\nA 76-millimeter World War II-era munition \"arbitrarily detonated\", the press office said.\nThe wounded have been taken to the Defense Ministry's health facility, according to the press office.\nGovernor of St. Petersburg Alexander Beglov has denied that the incident was terrorist-related.", "location": "ST. PETERSBURG", "classification": "security", "score": 0.8338394034468154, "event_breakdown": "* Seven soldiers were injured after a World War II-era munition exploded in the Military Academy of the Signal Corps in St. Petersburg, Russia's Leningrad Military District said\n*  76-millimeter World War II-era munition \"arbitrarily detonated\" at the Military Academy of the Signal Corps in St. Petersburg, claim the press office of Russia's Leningrad Military District"}, {"id": "c97d7169-ab8a-42be-b31c-5f1242122611", "title": "North Koreas Kim Jong Un Seeks Speeds Up Nuclear Production To Cope With Enemies Reckless Confrontation", "date": "2024-05-18 03:30", "url": "https://www.india.com/news/world/north-koreas-kim-seeks-speeds-up-nuclear-production-to-cope-with-enemies-reckless-confrontation-6938892/", "message": "HomeNewsNorth Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’North Korea’s Kim Jong Un Speeds Up Nuclear Production To ‘Cope With Enemies Reckless Confrontation’Kim expressed contentment with the outcome of the missile test, particularly praising the autonomous navigation system's performance.\nNorth Korea's Kim Seeks Speeds Up Nuclear Production To 'Cope With Enemies Reckless Confrontation'North Korean leader Kim Jong Un has issued a directive to expedite the production process to enhance the country’s nuclear capabilities.\nThe primary objective behind this move is to strengthen North Korea’s nuclear deterrence capabilities, as highlighted by KCNA.\nKim emphasized that by ramping up production, North Korea aims to instill fear in its enemies regarding the country’s nuclear combat readiness.\nKim made the production order “to cope with …the enemies’ reckless military confrontation” and bolster nuclear war deterrence, KCNA said.", "location": "PYONGYANG", "classification": "security", "score": 0.408695523703962, "event_breakdown": "* North Korean leader Kim Jong Un issues directive to expedite nuclear production \n* Move aimed at strengthening nuclear deterrence capabilities"}, {"id": "f28c6500-27b0-4f82-bc78-70517b72709c", "title": "Colin Sheridan : Harrowing memory of atrocity on our streets put in stark comparison to Gaza horror", "date": "2024-05-18 00:45", "url": "https://www.irishexaminer.com/opinion/columnists/arid-41397181.html", "message": "The bombs, later claimed by the Ulster Volunteer Force, killed 34 civilians, including an unborn child, and injured almost 300.\nMost of the victims were young women, although the ages of the dead ranged from 19 up to 80 years.\nSmoke rises following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, Friday, May 17, 2024.\nIf you were to go to one funeral per day of every child killed in Gaza, it would take 37 years.\nDisplaced Palestinians children take the coastal Rashid road to return to Gaza City as they pass through Nuseirat in the central Gaza Strip on April 14, 2024.", "location": "GAZA CITY", "classification": "security", "score": 0.7884780176884274, "event_breakdown": "1. 2024 Israeli airstrikes in the Gaza Strip\n2. 2024 Ulster Volunteer Force bomb attacks in Northern Ireland"}, {"id": "bb50be8e-b7bf-4a64-a829-7d0d37846068", "title": "Gaza : 31 Palestinians killed , 56 injured by Israeli bombardment last 24hrs - The Muslim News", "date": "2024-05-18 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-31-palestinians-killed-56-injured-by-israeli-bombardment-last-24hrs/", "message": "By Abdul Adil(The Muslim News): 31 Palestinians were killed and 56 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 24 hours, according to Ministry of Health.\nThis brings to total number of Palestinians killed by Israeli forces since 7 October 2023 to at least 35,303 and 79,261 injured in Gaza, according to Ministry of Health.\nFour Palestinians were killed and many others injured in Israeli airstrikes on the Nuseirat refugee camp in the central blockaded Gaza Strip.\nAn Israeli raid targeted a Palestinian house located in the al-Shati refugee camp in western Gaza and other raids targeted central Gaza city.\nMedical sources said that the bodies of nine Palestinians killed in Israeli airstrikes and bombardment arrived at the European Gaza Hospital near Khan Younes.", "location": "GAZA CITY", "classification": "security", "score": 0.992897285636613, "event_breakdown": "- 31 Palestinians were killed and 56 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 24 hours, according to Ministry of Health.\n- 35,303 Palestinians have been killed in Gaza since 7 October 2023 with at least 79,261 injured by Israeli airstrikes .\n- Four Palestinians were killed in Israeli airstrikes on the Nuseirat refugee camp in the central blockaded Gaza Strip.\n- An Israeli raid targeted a Palestinian house located in the al-Shati refugee camp in western Gaza and other raids targeted central Gaza city.\n- Medical sources said the bodies of nine Palestinians killed in Israeli airstrikes and bombardment arrived at the European Gaza Hospital near Khan Younes."}, {"id": "3cef80e5-29ab-4a8a-82c0-c81f938dfe10", "title": "Israeli airstrike eliminates Islamic Jihad officer in Rafah , Gaza", "date": "2024-05-18 08:15", "url": "https://www.jpost.com/breaking-news/article-801622", "message": "An Israeli airstrike killed the Palestinian Islamic Jihad (PIJ) terrorist organization’s Rafah Brigade head of logistics, the IDF announced on Saturday morning.\nThe PIJ operative was reportedly responsible for preparing terrorists for attacks on Israeli personnel in the area.\nThe airstrike eliminating the PIJ operative was one of a broader array of strikes across the Strip.\nIDF engages in heavy Jabalya fighting, destroys weapons production facilityDuring raids on terrorist positions in the outskirts of Jabalya, Israeli troops of the 460th Brigade encountered and engaged squads of terrorists, the IDF later noted.\nThe IDF's 460th Brigade engages terrorists in Jabalya.", "location": "GAZA", "classification": "security", "score": 0.9877328953913433, "event_breakdown": "IDF Eliminates Palestinian Islamic Jihad's Rafah Brigade Logistics Head in Airstrike\nIDF Engages in Heavy Fighting in Jabalya, Destroys Weapons Production Facility"}, {"id": "d8c82727-0899-4ba5-9bc4-2df0303390d4", "title": "Yemen Houthi rebels claim shooting down another US MQ - 9 Reaper drone as footage shows wreckage", "date": "2024-05-18 07:15", "url": "https://www.newsday.com/news/nation/yemen-houthi-us-drone-israel-hamas-war-q10884", "message": "DUBAI, United Arab Emirates — Yemen's Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as “carrying out hostile actions\" in Yemen's Marib province, which remains held by allies of Yemen's exiled, internationally recognized government.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.", "location": "Yemen", "classification": "security", "score": 0.8624557004645984, "event_breakdown": "List of Security Events\n1. Houthi rebels in Yemen claim to have shot down an American drone on July 7, 2022.\n2. The incident occurred in Marib province, where Yemen's internationally recognized government still holds territory."}, {"id": "a075dc4b-dbbc-445b-b359-0352a237358e", "title": "Man who murdered united kingdom pensioner in revenge for Gaza jailed for at least 45 years", "date": "2024-05-18 08:15", "url": "https://www.asiaone.com/world/man-who-murdered-uk-pensioner-revenge-gaza-jailed-least-45-years", "message": "After his arrest, he told detectives he had committed the acts because of the conflict in Gaza and said he would have killed more people if he had been able to, prosecutors said.\nHe was found guilty last month of murder, attempted murder and assaulting two female detectives during his police interview.\nAlid left the house and walked down the road where he passed Carney on the opposite side of the street.\nHe circled back and attacked him from behind, stabbing him six times in the chest, abdomen and back.\nFollowing his interview with police, he attacked the two female detectives, with one suffering injuries to her shoulder and wrist.", "location": "CHICAGO", "classification": "security", "score": 0.820558711422167, "event_breakdown": "Security Event 1: Stabbing and Murder of Carney on Finchley Road in Golders Green\nEvent 1.1: Alid passes Carney on the opposite side of the street\nEvent 1.2: Alid circles back and attacks Carney from behind, stabbing him six times in the chest, abdomen and back\n\nSecurity Event 2: Attacks on Two Female Detectives During Police Interview\nEvent 2.1: Alid assaults two female detectives\nEvent 2.2: One detective suffers injuries to her shoulder and wrist"}, {"id": "2035e1ab-1bac-4c44-adc2-3d8694534ffa", "title": "Mysterious Explosion At St . Petersburg Military Academy : New Details Emerging", "date": "2024-05-18 09:00", "url": "https://charter97.org/en/news/2024/5/18/595492/", "message": "Mysterious Explosion At St. Petersburg Military Academy: New Details Emerging 6 18.05.2024, 8:1220,390There could be other reasons than a drone.\nA powerful explosion occurred on Friday, May 17 at the Military Academy of Communications named after S. M. Budyonny, which is located on Tikhoretsk Avenue in St. Petersburg, Russia.\nInitially, Russian resources reported an alleged drone strike on a military academy.\nAccording to updated data, 7 people were injured as a result of the explosion, two of whom are in intensive care.\nGovernor of St. Petersburg Alexander Beglov said that the incident “is not of a terrorist nature.”The Leningrad Military District confirmed rumors about an abnormal explosion of ammunition “during work.” They refer to a 76 mm caliber projectile from the Second World War.", "location": "ST. PETERSBURG", "classification": "security", "score": 0.7580177846323612, "event_breakdown": "Mysterious Explosion At St. Petersburg Military AcademyNew Details Emerging 6 18.05.2024, 8:1220,390Explosion at Military AcademyYouTube Live Updates 5 18.05.2024, 8:48 a.m.Explosion rocks St. Petersburg Military Academy 5 18.05.2024, 9:08 a.m.St. Petersburg Military Academy ExplosionYouTube Live Updates 5 18.05.2024, 9:17 a.m.Explosion Rocks Russian Military Academy 5 18.05.2024, 10:28 a.m.\nMysterious Explosion At St. Petersburg Military Academy: New Details Emerging, YouTube Live Updates 5 18.05.2024, 8:48 a.m.\nExplosion at Military Academy, YouTube Live Updates 5 18.05.2024, 9:08 a.m.\nSt. Petersburg Military Academy Explosion, YouTube Live Updates 5 18.05.2024, 9:17 a.m.\nExplosion Rocks Russian Military Academy, YouTube Live Updates 5 18.05.2024, 10:28 a.m."}, {"id": "211cb818-7dd2-4a4c-af73-b66ef93f897a", "title": "US ban on strikes on Russian territory undermines Ukraine ability to defend itself – ISW", "date": "2024-05-18 07:15", "url": "https://www.yahoo.com/news/us-ban-strikes-russian-territory-014527860.html", "message": "The Institute for the Study of War (ISW) believes that the US ban on Ukraine using Western weapons to strike Russian territory significantly undermines Ukraine's ability to defend itself against Russian offensive operations in the northern part of Kharkiv Oblast.\nIn addition, Russian forces and equipment can freely assemble before engaging in combat operations.\nSenior NATO military commanders confirmed ISW's prior assessments that Russian forces do not have sufficient forces to achieve a \"strategic breakthrough\" in Ukraine.\nRussian forces recently marginally advanced near Avdiivka.\nUkrainian and Western sources continue to report that Russian forces are committing war crimes in newly occupied areas of Kharkiv Oblast.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.6053699103808499, "event_breakdown": "Security Events:\n\n- NATO military officers confirm ISW's assessment that Russian forces don't have enough troops for a \"strategic breakthrough\" in Ukraine.\n- The Institute for the Study of War (ISW) believes that Ukraine's inability to use Western weapons against Russian targets hampers Ukrainian ability to defend itself against Russia's northern Kharkiv offensive.\n- ISW believes Russia can freely assemble forces and equipment to engage in combat.\n- Russian forces marginally advanced near Avdiivka.\n- Russia and Ukraine continue to assert that Russia is committing war crimes in Kharkiv Oblast.\nNote: Events are in a list form, but they could be convoluted into a single event."}, {"id": "b1a105ce-805d-4b4c-a4e6-61b1b56acd78", "title": "Israel - Hamas War Day 225 : What happening in West Bank , Gaza ? ", "date": "2024-05-18 04:15", "url": "https://www.jpost.com/israel-hamas-war/2024-05-18/live-updates-801614", "message": "IDF soldiers operating in the Gaza Strip on May 18, 2024.\n(IDF Spokesperson's Unit)An Israeli airstrike killed the Palestinian Islamic Jihad (PIJ) terrorist organization’s Rafah Brigade head of logistics, the IDF announced on Saturday morning.\nThe PIJ operative was reportedly responsible for preparing terrorists for attacks on Israeli personnel in the area.\nThe airstrike eliminating the PIJ operative was one of a broader array of strikes across the Strip.\nThe military reported that, over the past day, the Israel Air Force hit 70 targets across Gaza.", "location": "Gaza Strip", "classification": "security", "score": 0.9882612928098148, "event_breakdown": "Event: IDF soldiers operating in the Gaza Strip on May 18, 2024.\nEvent: An Israeli airstrike killed the PIJ terrorist organization's Rafah Brigade head of logistics on May 18, 2024."}, {"id": "f2194105-3257-4809-b0f1-26689ed94c8f", "title": "Afghanistan officials , Schema - Root news", "date": "2024-05-18 07:30", "url": "https://schema-root.org/region/asia/southwest_asia/afghanistan/government/officials/", "message": "The western Herat province with Herat city as its capital, 640 kmÃ\u0083â\u0080\u009aÃ\u0082Â ...Pak, Afghan officials hold flag meeting KHYBER AGENCY - To discuss matters of mutual interests, flag meeting of Pakistani and Afghan officials was held at Torkham on Wednesday.\nAs a resultÃ\u0083â\u0080\u009aÃ\u0082Â ...Taliban Assassinates Key Afghan Regional Security Official Officials in Afghanistan say a top regional security commander and several of his bodyguards were killed in a bombing attack in southern Afghanistan early Wednesday.\nNezami says the HazarasÃ\u0083â\u0080\u009aÃ\u0082Â ...Afghan Officials: Pakistani Cross-Border Fire Kills Civilian Officials in Afghanistan say cross-border shelling by Pakistan has killed at least one civilian in the eastern province of Kunar.\nThe rise of Daesh in Afghanistan is raising alarm in Pakistan, say ... John Nicholson, commander of the US Forces in Afghanistan.\n“The armed group said they will join the peaceÃ\u0083â\u0080\u009aÃ\u0082Â ...German citizen arrested with Taliban in Afghanistan: Officials KANDAHAR, Afghanistan: A German national has been arrested with the Taliban in Afghanistan's insurgency-racked Helmand province, officials told AFP ... Photographs taken by the Afghan military show a man who looks to be in his 40s with a long reddish-brown beard speckled with grey, and wearing aÃ\u0083â\u0080\u009aÃ\u0082Â ...Afghan officials: Latest Taliban attacks kill 13 policemen Taliban attacks overnight in Afghanistan killed at least 13 policemen and wounded several others, officials said Friday.", "location": ".\nHerat, Afghanistan", "classification": "security", "score": 0.9487596315890564, "event_breakdown": ".\n1. Flag meeting held at Torkham on Wednesday (informal diplomatic meeting)\n2. Attack on Afghan security experts in Wednesday bombing in the south\n3. 1 Afghan civilian killed during Pakistani cross-border shelling (Pakistan was said to have been alarmed at rise of Daesh, so this may have caused the start of shelling)\n4. German citizen arrested with the Taliban in Afghanistan in Friday’s reporting\n5. 13 policemen were killed during an overnight Taliban attack in Afghanistan (One can only assume that the attack was in refute of peace talks)"}, {"id": "b34e9fcb-4dad-4e78-9906-49bc1b2e4cc2", "title": "Israel prefers to avoid tough war with Hezbollah : Defence Minister", "date": "2024-05-18 05:15", "url": "https://www.prokerala.com/news/articles/a1532080.html", "message": "Day of Hamas attack will be remembered as the day its complete destruction began: Israeli Defence Minister (IANS FROM ISRAEL).\nImage Source: IANS NewsJerusalem, May 18 : Israeli Defence Minister Yoav Gallant has said that his country prefers to avoid a difficult war with the Lebanese armed group Hezbollah.\nAt the same time, Hezbollah's attacks continued on Friday, with dozens of rockets and drones launched into northern Israel.\nThe exchanges of fire between Hezbollah and the Israeli military have ramped up in recent days.\nHezbollah has deployed new types of rockets against Israel and recently launched a drone attack the furthest into Israeli territory since October.", "location": "ISRAEL", "classification": "security", "score": 0.947047772517862, "event_breakdown": "Here is the list:\nMay 18 - Israel-Lebanon border - The Israeli defence minister says the country would prefer to avoid war with Hezbollah.\nMay 14 - Israel's northern border - Hezbollah fired a barrage of rockets into Israel.\nMay 14 - Syria - Hezbollah fired a barrage of rockets from Syria.\nMay 11 - Israel-Hezbollah border - A drone from Hezbollah came within a few hundred meters of an Israeli border fence.\nOctober 2021 - Lebanon - Hezbollah launched a drone deeper into Israel than ever before."}, {"id": "8def5801-0a1d-4453-b32f-116c24c12e7f", "title": "Hamas says commander killed in Israel strike in Lebanon", "date": "2024-05-18 00:00", "url": "https://japantoday.com/category/world/hamas-says-commander-killed-in-israel-strike-in-lebanon", "message": "Lebanese soldiers and onlookers gather around the remnants of a car after it was hit by an Israeli strike, reportedly killing a Hamas commander, in Lebanon's Bekaa ValleyPalestinian militant group Hamas said Friday that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nLebanon's official National News Agency reported one dead and two wounded in an \"enemy strike\" that targeted a vehicle in the same area.\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold.\nThe cross-border fighting has killed at least 419 people in Lebanon, mostly militants but also including 82 civilians, according to an AFP tally.", "location": "BEIRUT", "classification": "security", "score": 0.9963622858628389, "event_breakdown": "1. In March and in January, Israeli strikes killed Hamas members in Lebanon.\n2. In December, Israeli strikes killed Iranian and Syrian personnel in Lebanon.\n3. In August, a drone strike killed one Hezbollah operative in Lebanon.\n4. In January 2020, a Hezbollah fighter was possibly killed while assisting the Palestinian resistance.\n5. Israel's Foreign Minister claimed that Israel carries out\"hundreds\"of strikes against Iranian and Hezbollah targets in Syria each year."}, {"id": "fdb86b93-bfce-4499-b0e3-bd2c72105dae", "title": "Two police officers who took a two - hour break to get a kebab on the night of the Manchester Arena attack which left 22 dead are given final written warnings", "date": "2024-05-18 08:15", "url": "https://www.dailymail.co.uk/news/article-13432619/Two-police-officers-took-two-hour-break-kebab-night-Manchester-Arena-attack-left-22-dead-given-final-written-warnings.html", "message": "Two police officers who drove away for a kebab on a two-hour break on the night of the Manchester Arena terror attack have been handed final written warnings.\nThe Manchester Arena Inquiry had heard that suicide bomber Salman Abedi may have been challenged if a British Transport Police (BTP) officer had been present.\nAn investigation into the BTP officers was launched following a complaint by families of the victims relating to evidence heard at the inquiry.\nPC Jessica Bullough and PC Mark Renshaw went on a 10-mile round trip to buy kebabs on the night of the Manchester Arena attack.\nAnother BTP officer who was the subject of the complaint retired before the investigation began.", "location": "Manchester.", "classification": "security", "score": 0.9833394045935012, "event_breakdown": "1. Manchester Arena terror attack occurred on May 22, 2017 (location: Manchester, United Kingdom)\n2. Two BTP officers, Bullough and Renshaw, went on a 10-mile round trip to buy kebabs on the night of the attack (location: Manchester, United Kingdom)"}, {"id": "e8ecdc7f-1206-44ab-8843-19d1a988181b", "title": "Air raid alert in Russia Belgorod , explosion heard : Report", "date": "2024-05-18 08:15", "url": "https://www.prokerala.com/news/articles/a1532131.html", "message": "Moscow, May 18 : There has been an explosion in the Russian border region of Belgorod following a missile alert, the media reported early Saturday.\nThe Governor of the region, Vyacheslav Gladkov, had called on residents to take shelter via his Telegram channel.\nAs a result of Moscow's war of aggression against Ukraine, Russia's border region regularly comes under fire.\nHowever, casualties and damage are minuscule compared to the destruction and civilian deaths that Russia has caused in Ukraine.\nUkraine has been defending itself against a Russian invasion with massive Western support for more than two years.", "location": "RUSSIA", "classification": "security", "score": 0.6468375239207325, "event_breakdown": "- Russian invasion in Ukraine,\n- Moscow's invasion against the Ukraine,\n- War on Ukraine."}, {"id": "c143c5ac-8cfc-4eee-9e98-93594acfbe98", "title": "Russian Army Loses 1 , 210 Soldiers In Ukraine Over Past Day", "date": "2024-05-18 08:00", "url": "https://menafn.com/1108228720/Russian-Army-Loses-1210-Soldiers-In-Ukraine-Over-Past-Day", "message": "(MENAFN- UkrinForm) Russia's overall combat losses in Ukraine between February 24, 2022 and May 18, 2024 are estimated at about 491,080 troops, with 1,210 soldiers killed or wounded in action in the past 24 hours.\nThe General Staff of the Armed Forces of Ukraine said this in a post on Facebook, Ukrinform reports.\nIn addition, as of May 18, Ukraine's defense forces have already destroyed 7,560 (+13) Russian tanks, 14,595 (+43) armored fighting vehicles, 12,639 (+36) artillery systems, 1,071 multiple rocket launchers, 801 (+1) anti-aircraft warfare systems, 354 (+1) warplanes, 326 helicopters, 10,108 (+35) tactical unmanned aerial systems, 2,203 (+3) cruise missiles, 26 warships/cutters, 1 submarine, 17,169 (+65) vehicles and fuel tankers, and 2,075 (+6) pieces of special equipment.\nUmerov on Kharkiv front: We are stabilizing situation, but we need more weaponsThe latest reports on enemy losses are being verified.", "location": "Kyiv Oblast", "classification": "security", "score": 0.6381500156639096, "event_breakdown": ".\n- Russia's overall combat losses in Ukraine are estimated at about 491,080 troops.\n- Russia lost about 1,210 soldiers killed or injured in Ukraine in the past 24 hours.\n- Ukraine's defense forces have already destroyed 7,560 (+13) Russian tanks.\n- Ukraine's defense forces have already destroyed 14,595 (+43) armored fighting vehicles.\n- Ukraine's defense forces have already destroyed 12,639 (+36) artillery systems.\n- Ukraine's defense forces have already destroyed 1,071 multiple rocket launchers.\n- Ukraine's defense forces have already destroyed 801 (+1) anti-aircraft warfare systems.\n- Ukraine's defense forces have already destroyed 354 (+1) warplanes.\n- Ukraine's defense forces have already destroyed 326 (+1) helicopters.\n- Ukraine's defense forces have already destroyed 10,108 (+35) tactical unmanned aerial systems.\n- Ukraine's defense forces have already destroyed 2,203 (+3) cruise missiles.\n- Ukraine's defense forces have already destroyed 26 warships/cutters.\n- Ukraine's defense forces have already destroyed 1 submarine.\n- Ukraine's defense forces have already destroyed 17,169 (+65) vehicles and"}, {"id": "6be01235-8f1d-4a05-9b0f-4d75a6f36470", "title": "Slovakia Reels from PM Shooting as Suspect Goes to Court", "date": "2024-05-18 09:30", "url": "https://www.kyivpost.com/post/32862", "message": "The suspect charged with the attempted murder of Slovak Prime Minister Robert Fico is expected on Saturday before a penal court that will decide whether to hold him in pre-trial detention.\nThe man, identified by Slovak media as 71-year-old poet Juraj Cintula, fired five shots at Fico on Wednesday and hit him four times.\nThe shooting occurred as Fico was walking towards his supporters after a government meeting in the central Slovak town of Handlova.\nAdvertisementA prosecutor proposed on Friday that Cintula be placed in pre-trial detention after he had been charged with a premeditated murder attempt.\nAdvertisement\"All these lies are the main reason why Robert Fico is fighting for his life today,\" he said in an emotional message on Smer's website.", "location": "Handlova", "classification": "security", "score": 0.4954979309093549, "event_breakdown": "- A man, identified as 71-year-old poet Juraj Cintula, fired five shots at Slovak Prime Minister Robert Fico on Wednesday and hit him four times. - The shooting occurred as Fico was walking towards his supporters after a government meeting in the central Slovak town of Handlova. - A prosecutor proposed on Friday that Cintula be placed in pre-trial detention after he had been charged with premeditated murder attempt."}, {"id": "9444ba81-827d-4e96-af93-720660837864", "title": "Rocket shell and mine explosion kill 3 children in Balkh and Badghis", "date": "2024-05-18 08:30", "url": "https://www.khaama.com/rocket-shell-and-mine-explosion-kill-3-children-in-balkh-and-badghis/", "message": "Officials and local sources in the provinces of Balkh and Badghis have confirmed that three children were killed and another injured due to the explosion of a rocket shell and landmine remnants from past conflicts in these provinces.\nMohammad Essa Wasiq, the spokesperson for the police command in Balkh province, announced in a statement that the incident occurred on Friday, May 17th, in the village of Alam Khil, Balkh district.\nThe statement mentioned that the explosion happened while three children were playing with a war remnant shell.\nAdditionally, local sources in Badghis province reported an explosion of a war remnant mine in the Qadis district of this province.\nReports indicate that this explosion took place in the village of Juwalq, Qadis district, resulting in the death of a 17-year-old teenager.", "location": "BALKH", "classification": "security", "score": 0.9852734149359482, "event_breakdown": ".\n1. Three children were killed and another injured due to the explosion of a rocket shell in Balkh province.\n2. The explosion of a war remnant mine in Badghis province resulted in the death of a 17-year-old teenager."}, {"id": "5a978be9-9075-4292-ac98-eaba8067ff83", "title": "3 Spanish nationals killed in shooting in Afghanistan : Official", "date": "2024-05-18 08:15", "url": "https://www.prokerala.com/news/articles/a1532124.html", "message": "Bamyan : , May 18 (IANS) Three foreign nationals were killed in a shooting attack in central Afghanistan's Bamyan province.\nThe victims are confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively, from Spain, Norway, Australia, and Lithuania, Xinhua news agency reported.\nOut of the four foreigners, two were women, Bamyan's provincial police spokesperson Muhammad Khawani Rasa told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three others were injured in the shooting attack, Ministry of Interior Affairs Spokesperson Mufti Abdul Mateen Qani said on social media platform X on Friday.", "location": "BAMYAN", "classification": "security", "score": 0.7981375384305721, "event_breakdown": "- Shooting attack in Bamyan, Afghanistan, three foreign nationals killed, Spanish, Norwegian, Australian, and Lithuanian nationals among the wounded.\n- An Afghan was killed, and three others injured."}, {"id": "57546283-15c0-491f-a292-17591aea3073", "title": "IDF kills Palestinian Islamic Jihad leader in air strike", "date": "2024-05-18 05:15", "url": "https://www.prokerala.com/news/articles/a1532086.html", "message": "Tel Aviv, May 18 : Israel Defense Forces (IDF), in a statement on Saturday, said that it killed a Palestinian Islamic Jihad (PIJ) leader on Friday night in an air strike.\nTel Aviv, May 18 (IANS) Israel Defense Forces (IDF), in a statement on Saturday, said that it killed a Palestinian Islamic Jihad (PIJ) leader on Friday night in an air strike.\nIDF said that in a joint operation with the Shin Bet, they located the Islamic Jihad operatives and struck the building where they were hiding.\nThe IDF said that the killed Palestinian Islamic Jihad was responsible for a major attack in the Hermesh settlement in West Bank, leading to the killing of many Jews.\nIn a statement on Saturday, the Palestinian Health Ministry said that Aslam Hamaisa has been killed and several injured in an attack by the Israel Air Force on a building in Jenin on Friday night.", "location": "Jenin.", "classification": "security", "score": 0.9393880230160869, "event_breakdown": "Italain Air Force on Saturday said it has killed one of the leaders of Palestinian Islamic Jihad, Hassan Al Kontar, in \"surgical strike\" on Gaza Strip.\n2020\nGaza\nIDF"}, {"id": "40b765f3-561e-4f15-bdb6-98e7fb5b3424", "title": "3 Spanish nationals killed in Afghanistan Bamyan shooting : Afghan official", "date": "2024-05-18 06:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/18/content_117197124.htm", "message": "You are here:视频播放位置 下载安装Flash播放器BAMYAN, Afghanistan, May 18 (Xinhua) -- The three foreign nationals killed in a shooting attack in central Afghanistan's Bamyan province on Friday have been confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively from Spain, Norway, Australia and Lithuania.\nOf them, two were women, Bamyan's provincial police spokesperson Muhammad Khawani Rasa told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three other Afghans were injured in the shooting attack, spokesperson for the Ministry of Interior Affairs Mufti Abdul Mateen Qani said on social media platform X on Friday.\nFour suspects have been arrested, Qani added.", "location": "BAMYAN, Afghanistan", "classification": "security", "score": 0.6546588495744341, "event_breakdown": "1. A shooting attack occurred in central Afghanistan's Bamyan province on May 18, killing three foreign nationals and wounding four others, including a woman from Afghanistan.\n2. Several suspects have been arrested in relation to the shooting attack in Bamyan province."}, {"id": "fe4a2e4f-c046-4c0c-8a19-0196f663ff00", "title": "LANPAC 2024 Speech > U . S . Pacific Fleet > Speeches U . S . Pacific Fleet", "date": "2024-05-18 01:00", "url": "https://www.cpf.navy.mil/Newsroom/Speeches/Article/3779524/lanpac-2024-speech/", "message": "Here's how you knowAn official website of the United States government", "location": "WASHINGTON D.C.", "classification": "security", "score": 0.8634127880383812, "event_breakdown": "Security Events:\n\n* Website defacement\n* Malware infection\n* Data breach\n* Distributed Denial of Service (DDoS) attack"}, {"id": "942ee06a-68d0-4511-a5f7-7e9a4ce88eba", "title": "Israeli forces kill senior Palestinian militant in Jenin : army", "date": "2024-05-18 10:00", "url": "https://www.bssnews.net/news/189756", "message": "RAMALLAH, Palestinian Territories, May 18, 2024 (BSS/AFP) - The Israelimilitary said on Saturday it killed a senior Palestinian militant during anair strike on an \"operations centre\" in the occupied West Bank city of Jenin.\n\"A number of significant terrorists were inside the compound,\" the IsraeliDefense Forces said in a statement posted to Telegram.\nThe Al-Quds Brigade, the armed wing of militant group Palestinian IslamicJihad, confirmed in a statement that Khamayseh was killed and several otherswounded during an Israeli raid on Friday night.\nIsrael has occupied the West Bank since 1967 and its troops routinely carryout incursions into areas such as Jenin, which are nominally under thePalestinian Authority's security control.\nThe West Bank has seen a recent surge in violence, particularly since theIsrael-Hamas war erupted on October 7.", "location": "Jenin", "classification": "security", "score": 0.8491633715078362, "event_breakdown": "* May 18, 2024 - Israeli Military said on Saturday it killed senior Palestinian militant during airstrike on \"operations center\" in occupied West Bank city of Jenin. A militant group confirmed its leader was killed and several others wounded."}, {"id": "0bf7f289-44cc-4a95-8fb3-af44832666a0", "title": "Israel strikes kill at least five in Lebanon , including two children", "date": "2024-05-18 11:15", "url": "https://www.newarab.com/news/israel-strikes-kill-least-five-lebanon-including-two-children", "message": "Israeli strikes on southern and eastern Lebanon killed at least five people on Friday including two children, security sources and UNICEF said.\nIsrael and Hezbollah have been exchanging fire across Lebanon's southern border for seven months in parallel with the Gaza war.\nOther Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon.\nUNICEF Lebanon separately said two children were killed in an Israeli strike on Friday.\nRELATED Israel strikes on Lebanon kill Hezbollah fighter, 2 children MENAIt said dozens of the launches were intercepted and there were no immediate reports of deaths or damage.", "location": "Lebanon", "classification": "security", "score": 0.9713850354356702, "event_breakdown": "Israel has been exchanging fire with Hezbollah across Lebanon's southern border for seven months in parallel with the Gaza war. Lebanese factions as well as Palestinian groups have also fired rockets at Israel from Lebanon."}, {"id": "456fc92a-8145-4148-a2f5-d91d5100bd8e", "title": "Ukraine destroys Russian S - 300 at Belbek airfield in Crimea with ATACMS missiles", "date": "2024-05-18 11:15", "url": "https://www.yahoo.com/news/ukraine-destroys-russian-300-belbek-103400192.html", "message": "Recent attacks and responses at Belbek Airfield in CrimeaExplosions near the Belbek airfield in the early hours of May 15 led to multiple fires, as reported by the Crimean Wind monitoring channel.\nIn response to the attacks, the Russian Ministry of Defense claimed to have intercepted 10 ATACMS missiles over Crimea.\nDefence Express, a military news outlet, suggested that Ukrainian Defense Forces may have targeted Russian MiG-31 fighters parked at the Belbek airfield with ATACMS missiles during these strikes.\nAdditionally, the Atesh guerrilla movement claimed responsibility for \"successful attacks\" on Russian military targets in Crimea.\nRead also: Ukrainian forces possibly hit Russian jets in Crimea ATACMS strikeAtesh agents at the Belbek military airfield reported a precise hit and hours of subsequent detonation of the main missile and artillery depot (military unit 80189).", "location": "NULL", "classification": "security", "score": 0.9554144429184892, "event_breakdown": "Events:\n* Multiple explosions near the Belbek airfield in Crimea in the early hours of May 15.\n* Fires reported by Crimean Wind monitoring channel.\n* Russian Ministry of Defense claims of intercepting 10 ATACMS missiles over Crimea.\n* Reported targeting of Russian MiG-31 fighters stored at Belbek airfield by Ukrainian Defense Forces with ATACMS missiles.\n* Atesh guerrilla movement claiming responsibility for \"successful attacks\" on Russian military targets in Crimea.\n* Atesh agents reporting a hit on the main missile and artillery depot at Belbek military airfield."}, {"id": "317794c7-d5a8-4511-adeb-fbba043e8b8e", "title": "Look at assassinations and assassination attempts this century", "date": "2024-05-18 13:30", "url": "https://naharnet.com/stories/en/305291-look-at-assassinations-and-assassination-attempts-this-century", "message": "Slovakia's Prime Minister Robert Fico was seriously wounded in an apparent assassination attempt just weeks before a Europe-wide election that has been deeply divisive.\nHere's a global look at other notable assassinations and assassination attempts during the 21st century:— Sept. 1, 2022: Argentina's then-Vice President Cristina Fernández is targeted by a man who reportedly aimed a handgun at point-blank range toward the politician in what government ministers characterize as an assassination attempt.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade.", "location": "NULL", "classification": "security", "score": 0.9801430310246547, "event_breakdown": ".\n— June 28, 2022: Slovak Prime Minister Robert Fico survives an assassination attempt just weeks before a Europe-wide election that has been deeply divisive.\n— Sept. 1, 2022: Argentina's then-Vice President Cristina Fernández survives an assassination attempt in Buenos Aires.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt in the Iraqi capital of Baghdad.\n— March 14, 2005: Lebanese Prime Minister Rafik Hariri is killed in a suicide bombing in Beirut."}, {"id": "168c2aee-1123-4c27-8dea-8f5fdd675abe", "title": "Putin suffers major blow as colonel guarding top secret base killed in united kingdom - supplied missile strike - World News", "date": "2024-05-18 13:45", "url": "https://www.mirror.co.uk/news/world-news/putin-suffers-major-blow-colonel-32839675", "message": "Lt-Col Alexander Kulakov, 38, died with a comrade in the Ukrainian strike on military unit No.\nThe Russian armed forces have not admitted the loss, nor publicly acknowledged the damage to the key listening post.\n‌Kulakov’s death in the strike was confirmed by Mayor of Alushta, Galina Ogneva, in an obituary coinciding with his funeral.\nThe giant golf-ball domes at Ai-Petri are used for long-range reconnaissance and air defence guidance, crucial to the Russian military.\nStorm Shadow missiles are supplied to Ukraine by Britain and France.", "location": "UMAN.", "classification": "security", "score": 0.7036541508586434, "event_breakdown": "Security events:\n- Ukrainian strike on military unit No. 65473 in Alushta, which led to the death of Lt-Col Alexander Kulakov and an unknown number of other soldiers.\n- Strike damaged a key Russian long-range reconnaissance and air defence guidance site at Mount Ai-Petри, likely consisting of giant golf-ball domes, crucial for Russian military intelligence operations.\n- The strike used British-supplied Storm Shadow missiles, which were likely dropped by British Royal Air Force jets.\n- Russian defence ministry has not admitted the loss or publicy acknowledged the damage to this key military site."}, {"id": "e708ce72-0850-4fff-aecc-6d557e121278", "title": "Hamas says commander killed in Israel strike in Lebanon Bekaa", "date": "2024-05-18 12:00", "url": "https://www.naharnet.com/stories/en/305302-hamas-says-commander-killed-in-israel-strike-in-lebanon-s-bekaa", "message": "Palestinian militant group Hamas said that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas' armed wing, the Ezzedine al-Qassam Brigades, said in a statement that \"commander\" Sharhabil Sayed was killed \"after he was targeted by Israeli occupation aircraft\" in Lebanon's West Bekaa area.\nA source close to the Palestinian militant group, speaking on condition of anonymity, had earlier told AFP that Sayed was a Hamas official responsible for Lebanon's Bekaa region and \"was killed in an Israeli strike that targeted his vehicle.\"\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Arouri and six other militants in Hezbollah's south Beirut stronghold.", "location": "BEIRUT", "classification": "security", "score": 0.9933322761705579, "event_breakdown": "1. On 19 May 2022, a Hamas commander known as Sharhabil Sayed was killed in an Israeli air strike in Lebanon's West Bekaa district, near the Syrian border.\n2. In the March 19th 2022 instance, a Hamas member was killed in an airstrike in southern Lebanon, led by Israel.\n3. In January 22nd of 2022, Israel carried out an air strike that killed Hamas deputy Saleh al-Arouri, six other militants and one of the least suspected leaders of the organization, killing 'freelance bomb-making instructor', in the West Bank."}, {"id": "051a6994-7e95-43a6-83e2-d74721a3f831", "title": "Hamas says commander killed in Israel strike in Lebanon Bekaa", "date": "2024-05-18 14:00", "url": "https://www.naharnet.com:443/stories/en/305302-hamas-says-commander-killed-in-israel-strike-in-lebanon-s-bekaa", "message": "Palestinian militant group Hamas said that a \"commander\" was killed in an Israeli strike on an eastern district of Lebanon near the Syrian border.\nHamas' armed wing, the Ezzedine al-Qassam Brigades, said in a statement that \"commander\" Sharhabil Sayed was killed \"after he was targeted by Israeli occupation aircraft\" in Lebanon's West Bekaa area.\nA source close to the Palestinian militant group, speaking on condition of anonymity, had earlier told AFP that Sayed was a Hamas official responsible for Lebanon's Bekaa region and \"was killed in an Israeli strike that targeted his vehicle.\"\nIn March, Hamas said one of its members was killed in an Israeli strike in south Lebanon that state media said killed three people.\nA strike in January, which a U.S. defense official said was carried out by Israel, killed Hamas deputy leader Saleh al-Arouri and six other militants in Hezbollah's south Beirut stronghold.", "location": "BEIRUT", "classification": "security", "score": 0.9933322761705579, "event_breakdown": ".\n1. A Palestinian militant group, Hamas, said that a \"commander\", Sharhabil Sayed, was killed in an airstrike by an Israeli aircraft in Lebanon's West Bekaa area.\n2. In March 2022, Hamas also said that one of its members, Muhammed Hamdan, was killed in an airstrike by an Israeli aircraft in south Lebanon, which killed three people.\n3. A source close to the Palestinian militant group also said that one of their officials responsible for Lebanon's Bekaa region, Sharhabil Sayed, was killed in an airstrike on his vehicle, in response to reports that an Israeli attack had taken place.\n4. In January 2022, an Israeli airstrike, which a U.S. defense official also said was carried out by Israel, killed seven militants including Saleh al-Arouri, the deputy leader of Hamas. That strike occurred in Hezbollah's stronghold in south Beirut."}, {"id": "dc6d537f-172e-40d6-8a32-975ab777f425", "title": "The Latest | Israel finds bodies of 3 hostages in Gaza , as first aid unloaded by sea", "date": "2024-05-18 02:15", "url": "https://santamariatimes.com/news/national/the-latest-israel-finds-bodies-of-3-hostages-in-gaza-as-first-aid-unloaded-by/article_0d5d321c-91cd-5033-baf5-6333741064da.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission.", "location": "NULL", "classification": "security", "score": 0.6245355648029417, "event_breakdown": "From the provided text, there is only one security event listed:\nUnauthorized broadcast of a copyrighted news article."}, {"id": "bdc9ffba-3311-4a67-a8ab-cf372d8376f3", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 10:00", "url": "https://www.edp24.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9671263696997507, "event_breakdown": "* Israel has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\n* Israel says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\n* Israel’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials."}, {"id": "539746ee-6ddf-433f-a8cc-5523b8396a74", "title": "The West hostage trap - American Thinker", "date": "2024-05-18 13:15", "url": "https://www.americanthinker.com/blog/2024/05/the_west_s_hostage_trap.html", "message": "Hamas is not unique in taking hostages, although its genocidal fury and the sheer number of hostages seized are unique.\nBiden’s new redline is the protection of non-combatants but offers no solution for winning against an enemy that uses hostages to maximize collateral damage.\nOnce, Western nations recognized that there was a price to pay for stealing enemy civilians as pawns in war.\nAnd because we no longer know where to assign moral blame for hostage-taking, it’s a factor in breaking apart Western civilization.\nI fear that the mass hostage-taking in Israel signifies a new chapter in the history of taking hostages.", "location": "Israel", "classification": "security", "score": 0.5641962218085986, "event_breakdown": "1. Hamas takes hostages in Israel.\n2. Western nations used to recognize there was a price to pay for stealing enemy civilians as pawns in war.\n3. President Biden sets a new redline for protecting non-combatants.\n4. The solution offered for preventing more hostages from being seized is not effective.\n5. Hamas uses hostages to maximize collateral damage.\n6. The mass hostage-taking in Israel signifies a new chapter in the history of taking hostages."}, {"id": "874fb9db-484f-4396-aad9-bce4f374c764", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 09:45", "url": "https://www.thetelegraphandargus.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials.", "location": "GAZA STRIP", "classification": "security", "score": 0.9671263696997507, "event_breakdown": "The events include:\n- Militants killed hundreds of people near the Gaza border\n- Israel has been operating in the Gaza Strip’s southern city of Rafah, where it has intelligence that hostages are being held.\n- Israel says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\n- Israel’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials."}, {"id": "5b9c66c6-7ec8-41b5-9a74-77055b03c124", "title": "Man who murdered pensioner  in revenge for Gaza  is terrorist - Judge", "date": "2024-05-18 12:30", "url": "https://www.asianimage.co.uk/news/24329267.man-murdered-pensioner-in-revenge-gaza-terrorist---judge/", "message": "The judge Mrs Justice Cheema-Grubb told Alid he had “hoped to frighten the people of Britain and undermine the freedoms they enjoy” when he murdered Mr Carney in a terrorist attack.\nShe said the attack on Mr Nouri was “an attempt to punish him for converting to Christianity”.\nDuring his police interview the day after the murder, Alid said he launched his attacks because “Israel had killed innocent children”.\nAhmed Alid attempted to kill his housemate, a Christian convert (Counter Terror Police/PA)Alid denied murder, attempted murder and assaulting the two officers, claiming he did carry out the stabbings but without intention to kill or cause serious harm.\nMrs Justice Cheema-Grubb ruled Alid had committed terrorist offences when he murdered Mr Carney and attempted to murder Mr Nouri.", "location": "LONDON", "classification": "security", "score": 0.904697590006867, "event_breakdown": ".\n1. Alid murdered Mr Carney in a terrorist attack.\n2. Alid attempted to kill Mr Nouri for converting to Christianity.\n3. Alid claimed he committed stabbings without intention to kill or cause serious harm."}, {"id": "7bd61f6a-8df7-4a02-b825-345a3c10ad1c", "title": "FBI , DHS warn 2024 Pride events could be targeted by foreign terrorists groups", "date": "2024-05-18 12:30", "url": "https://www.yahoo.com/news/fbi-dhs-warn-2024-pride-111711314.html", "message": "But this year, the FBI and Department of Homeland Security warn foreign terrorist organizations and their supporters may target these LGBTQ+ venues and gatherings.\nOfficials say three alleged ISIS sympathizers were arrested in Austria last summer for attempting an attack during a Pride parade.\nKenya Hutton is one of the organizers of DC Black Pride, the nation’s largest celebration for the Black LGBTQ+ community.\nHutton said DC Black Pride works with local and federal police agencies to keep crowds safe.\nThe FBI says to report a threat, contact your local FBI field office (https://www.fbi.gov/contact-us/field-offices) or closest international office (https://www.fbi.gov/contact-us/international-offices) or call 1-800-CALL-FBI (225-5324).", "location": "Washington, DC", "classification": "security", "score": 0.5135677743518327, "event_breakdown": "1. According to the FBI and Department of Homeland Security, foreign terrorist organizations and their supporters may target LGBTQ+ venues and gatherings.\n2. Officials say three alleged ISIS sympathizers were arrested in Austria last summer for attempting an attack during a Pride parade.\n3. Kenya Hutton, one of the organizers of DC Black Pride, the nation’s largest celebration for the Black LGBTQ+ community, says DC Black Pride works with local and federal police agencies to keep crowds safe.\n4. The FBI says to report a threat, contact your local FBI field office, closest international office, or call 1-800-CALL-FBI."}, {"id": "12939808-bfb0-496d-ae8b-1d16248411c7", "title": "Meet the man who helped inspire the  Call of Duty  craze", "date": "2024-05-18 12:30", "url": "https://nypost.com/2024/05/18/lifestyle/meet-the-man-who-helped-inspire-the-call-of-duty-craze/", "message": "5 “The Way of Rōnan: Defying the Odds on Battlefields, in Business and in Life” is written by Tu Lam.\n5 Tu Lam’s amazing story from poverty-stricken immigrant to solider and businessman helped inspire the ‘Call of Duty’ video game serious.\nIn a 23-year military career Tu was a weapons specialist, a combat diver, a team leader, and a special forces commando.\nIt was just another beautiful day in Iraq.”But Tu Lam’s experiences left him injured, physically and mentally.\nTu Lam’s military career was over.", "location": "IRAQ", "classification": "security", "score": 0.8275061997363782, "event_breakdown": "1) Tu Lam’s amazing story has inspired the Call of Duty video game series in several different aspects, including being an immigrant from Vietnam.\n2) Tu Lam’s background as a Vietnam immigrant has struggled with physical injuries and mental struggle after his 23-year stint with the military.\n3) Tu Lam was a combat diver, a team leader, a special forces commando, and a weapons specialist before he was injured in a security event in Iraq.\n4) Tu Lam was injured in an event that left him physically and psychologically scarred, which ended his military career."}, {"id": "54cf8686-eb66-4f03-b1e6-9784b8fcc734", "title": "Rocket Shell And Mine Explosion Kill 3 Children In Balkh And Badghis", "date": "2024-05-18 09:45", "url": "https://menafn.com/1108228936/Rocket-Shell-And-Mine-Explosion-Kill-3-Children-In-Balkh-And-Badghis", "message": "(MENAFN- Khaama Press) Officials and local sources in the provinces of Balkh and Badghis have confirmed that three children were killed and another injured due to the explosion of a rocket shell and landmine remnants from past conflicts in these provinces.\nMohammad Essa Wasiq, the spokesperson for the police command in Balkh province, announced in a statement that the incident occurred on Friday, May 17th, in the village of Alam Khil, Balkh district.\nThe statement mentioned that the explosion happened while three children were playing with a war remnant shell.\nAdditionally, local sources in Badghis province reported an explosion of a war remnant mine in the Qadis district of this province.\nReports indicate that this explosion took place in the village of Juwalq, Qadis district, resulting in the death of a 17-year-old teenager.", "location": "The main event is in the village of Alam Khil, Balkh district of Afghanistan.", "classification": "security", "score": 0.9835129852526232, "event_breakdown": "Events:\n- Explosion of a rocket shell in Alam Khil village, Balkh district, Afghanistan\n- Explosion of a landmine remnant in the Qadis district of Badghis province, Afghanistan\n- Three children were killed, and another injured, due to explosions of the two war remnants\n- A 17-year-old teenager was killed in the Qadis district of Badghis province"}, {"id": "bed6df67-b909-4ad0-a754-242617880ef3", "title": "Bodies of three hostages killed at October 7 music festival recovered in Gaza", "date": "2024-05-18 10:00", "url": "https://www.oxfordmail.co.uk/news/national/24328783.bodies-three-hostages-killed-october-7-music-festival-recovered-gaza/", "message": "The military identified the other two bodies found as those of a 28-year-old woman, Amit Buskila, and a 56-year-old man, Itzhak Gelerenter.\nAll three were killed by Hamas while fleeing the Nova music festival, an outdoor dance party near the Gaza border, where militants killed hundreds of people, military spokesman Rear Admiral Daniel Hagari said at a news conference.\nIsrael has been operating in the Gaza Strip’s southern city of Rafah, where it says it has intelligence that hostages are being held.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nIsrael’s campaign in Gaza since the attack has killed more than 35,000 Palestinians, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9671263696997507, "event_breakdown": "* Terrorists attack Nova music festival near Gaza border, killing hundreds of people\n* Hamas abducts and kills three hostages, Amit Buskila, Itzhak Gelerenter, and a woman\n* Israel conducts military operation in the Gaza Strip in response to attack\n* Israeli operation kills more than 35,000 Palestinians in Gaza, according to health officials"}, {"id": "aa409351-23ef-45ee-9d38-e52056135e60", "title": "Ukraine Can Still Beat Russia . It Just Comes Down to Western Aid . ", "date": "2024-05-18 09:45", "url": "https://www.businessinsider.com/ukraine-can-still-beat-russia-comes-down-to-western-aid-2024-5", "message": "With 14 to 21 well-equipped brigades, Ukraine could eject Russian forces from all Ukrainian territory, according to an American expert.\nOne is Ukraine amassing a sufficiently powerful ground combat force that can defeat the estimated 500,000 Russian troops in Ukraine.\nWith Russian forces solidly dug in behind minefields and fortifications across eastern and southern Ukraine, that Baltic scenario bears similarities to the situation that Ukraine faces today.\nGiven sufficient quantities of munitions, Ukraine could inflict enough losses to decisively attrit Russian forces that have already sustained an estimated 500,000 casualties.\nHe started with a 2023 Estonian Ministry of Defense plan that laid out a roadmap for Ukraine to defeat Russia.", "location": "According to the text provided, I was not able to find a specific location for the main event.", "classification": "security", "score": 0.6649459861670958, "event_breakdown": "1. 2023 Estonian Ministry of Defense published a roadmap outlining a plan for Ukraine to defeat Russia.\n2. Russian invasion on Ukraine."}, {"id": "ccffde7a-51ff-4e19-82b7-c8b6b393ab4f", "title": "Fighting rages in Gaza Rafah after first aid delivery via pier", "date": "2024-05-18 10:00", "url": "https://www.voanews.com/a/fighting-rages-in-gaza-s-rafah-after-first-aid-delivery-via-pier-/7617323.html", "message": "Heavy clashes and bombardment Saturday rocked Gaza's southern city of Rafah, witnesses said, as the Israeli military announced the first 310 pallets of humanitarian aid had entered the besieged territory via a U.S.-built pier.\nMore than 10 days into what the Israeli military called a \"limited\" operation in Rafah, fighting between Israeli forces and Palestinian militants has also flared again in Gaza's north.\nThe 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier,\" the Israeli army said in a statement.\nIn the coming days, around 500 tons of aid are expected to be delivered to Gaza through the pier, according to U.S. Central Command.\nAmid the aid shortages, the Israeli army said \"dozens of Israeli civilians\" set fire to a Gaza-bound aid truck in the occupied West Bank on Thursday night, in the second such attack in a week.", "location": "Rafah.", "classification": "security", "score": 0.8729385926177908, "event_breakdown": "Security events:\n- Heavy clashes and bombardment shook Gaza's southern city of Rafah.\n- The military operation in Rafah, which the Israeli military calls a \"limited\" operation, has lasted more than 10 days.\n- Heavy clashes and bombardment also took place in the Gaza's north.\n- The first 310 pallets of humanitarian aid entered Gaza via a U.S.-built pier.\n- In the second attack in a week, dozens of Israeli civilians set fire to a Gaza-bound aid truck in the occupied West Bank."}, {"id": "adac298a-ef6e-4faf-83e1-351956cae111", "title": "Ukraine can still beat Russia . It just comes down to enough Western aid . ", "date": "2024-05-18 10:15", "url": "https://www.yahoo.com/news/ukraine-still-beat-russia-just-090002875.html", "message": "With 14 to 21 well-equipped brigades, Ukraine could eject Russian forces from all Ukrainian territory, according to an American expert.\nOne is Ukraine amassing a sufficiently powerful ground combat force that can defeat the estimated 500,000 Russian troops in Ukraine.\nAn ill-prepared Ukrainian counteroffensive in summer 2023 sputtered amid Russian minefields and inexperienced Ukrainian troops struggling to master newly arrived Western combat vehicles.\nGiven sufficient quantities of munitions, Ukraine could inflict enough losses to decisively attrit Russian forces that have already sustained an estimated 500,000 casualties.\nEven this doesn't cover all the items Ukraine would need, such as air defense weapons for the front-line troops, Bohnert noted.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.5031377401038157, "event_breakdown": "List of Security Events:\n\n1. Ukraine could eject Russian forces from all Ukrainian territory if equipped with 14 to 21 well-equipped brigades.\n2. A counteroffensive by ill-prepared Ukrainian troops in summer 2023 sputtered due to Russian minefields and inexperienced Ukrainian troops struggling to master Western combat vehicles.\n3. A sufficient quantity of munitions could inflict enough losses to decisively attrite Russian forces in Ukraine, which have sustained an estimated 500,000 casualties.\n4. Ukraine still lacks sufficient air defense weapons for the front-line troops, as noted by Bohnert."}, {"id": "b466ed31-aa21-4ad0-bf54-cd2b17db9152", "title": "Three Spanish nationals killed in Afghan Bamyan shooting", "date": "2024-05-18 11:15", "url": "http://www.uniindia.com/three-spanish-nationals-killed-in-afghan-s-bamyan-shooting/world/news/3201673.html", "message": "Three Spanish nationals killed in Afghan's Bamyan shootingKabul, May 18 (UNI) The three foreign nationals who died in a shooting attack in central Afghanistan's Bamyan province on Friday have been confirmed to be Spanish, two of them women, a local police official said on Saturday.\nFour foreign nationals were also wounded in the attack, respectively from Spain, Norway, Australia, and Lithuania.\nOf them, two were women, Bamyan's provincial police spokesperson, Muhammad Khawani Rasa, told Xinhua.\nBesides the foreign nationals, one Afghan was killed while three other Afghans were injured in the shooting attack, spokesperson for the Ministry of Interior Affairs Mufti Abdul Mateen Qani said on social media platform X on Friday.\nFour suspects have been arrested, Qani added.", "location": "Bamyan", "classification": "security", "score": 0.7023357274573565, "event_breakdown": "1. A shooting attack occurred in central Afghanistan's Bamyan province on May 18, 2023.\n2. The attack killed three Spanish nationals and wounded four more foreign nationals.\n3. In addition to the three Spanish nationals killed, two other foreign nationals were wounded, respectively from Norway, Australia, and Lithuania.\n4. Four suspects have been arrested in connection with the shooting attack.\n5. One Afghan was also killed and three more were wounded in the attack."}, {"id": "6af919c6-c216-487c-b89d-bffda859e49b", "title": "Fighting rages in Gaza Rafah after first aid delivery via pier", "date": "2024-05-18 10:00", "url": "https://www.al-monitor.com/originals/2024/05/fighting-rages-gazas-rafah-after-first-aid-delivery-pier", "message": "May 18, 2024 — Rafah (Palestinian Territories) (AFP)Heavy clashes and bombardment Saturday rocked Gaza's southern city of Rafah as the Israeli military announced the first humanitarian aid had entered the besieged territory via a US-built pier.\nThe Israeli army said 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\".\n- Rafah operation hampers aid -In the coming days, around 500 tonnes of aid are expected to be delivered to Gaza through the pier, according to US Central Command.\nThe European Union welcomed the first shipment from Cyprus to the Gaza pier, but called on Israel to \"expand deliveries by land and to immediately open additional crossings\".\nThe Rafah crossing, a vital conduit for humanitarian assistance, has been closed since the Israeli Rafah operation began early last week.", "location": "GAZA", "classification": "security", "score": 0.5338516825429618, "event_breakdown": "Heavy clashes and bombardment occurred in Rafah, Gaza's southern city. The Israeli army began moving humanitarian aid to Gaza, and the EU and Israel welcomed it, but called for additional crossings to be opened. The Rafah crossing has also been closed since the beginning of the Israeli raid last week."}, {"id": "a06f1c44-9243-49f2-84d3-f2e5195c9bfe", "title": "Treasury details response to illicit finance threats of money laundering , terrorism", "date": "2024-05-18 12:00", "url": "https://biztoc.com/x/e4985e070c132a2e", "message": "The US Department of the Treasury this week released its 2024 report on illicit finance, examining threats of money laundering and terrorist financing and its strategies to combat them.\nThe Treasury cited professional money launderers, financial fraudsters, cybercriminals and those seeking to finance terrorism as ongoing threats to the US financial system.\nThe 44-page report…This story appeared on dlnews.com , .", "location": "WASHINGTON", "classification": "security", "score": 0.45220577590921923, "event_breakdown": "- Terrorist financing (page 9)\n- Money laundering (page 9)\n- Cybercrime (page 8)"}, {"id": "f6a4eed8-7fcd-4e3a-8c0a-ced4c04260b9", "title": "One Palestinian killed , eight others wounded in an Israeli raid in the West Bank", "date": "2024-05-18 11:30", "url": "https://in-cyprus.philenews.com/international/one-palestinian-killed-eight-others-wounded-in-an-israeli-raid-in-the-west-bank/", "message": "A Palestinian militant was killed and eight other people were wounded on Friday in an Israeli airstrike on the Jenin refugee camp in the occupied West Bank, the Palestinian Authority’s health ministry and the Israel Defense Forces said.\nThe armed section of the Palestinian Islamic Jihad group said the militant who died was a member of the group and was named Islam Hamaisa.\nAccording to the Palestinian Authority’s Ministry of Health, the eight wounded were evacuated and are being treated in stable condition in hospitals.\nThe Israeli armed forces said the raid was carried out by a fighter jet and a helicopter.\nIt was a rare operation of this kind in the occupied West Bank, where violence had already escalated well before the Israeli/Hamas war broke out in the Gaza Strip on 7 October.", "location": "JENIN, WEST BANK", "classification": "security", "score": 0.9827982878958806, "event_breakdown": "* A Palestinian militant, Islam Hamaisa, and eight other individuals, were wounded by an Israeli airstrike in Jenin refugee camp in West Bank on Friday\n* Hamaisa was a member of Palestinian Islamic Jihad\n* That's a rare operation of Israeli forces in the occupied West Bank"}, {"id": "e0e7cec3-046c-4b63-9343-4988d44bcecd", "title": "Fighting rages in Gaza Rafah after first aid delivery via pier", "date": "2024-05-18 14:00", "url": "https://www.naharnet.com:443/stories/en/305298-fighting-rages-in-gaza-s-rafah-after-first-aid-delivery-via-pier", "message": "Heavy clashes and bombardment Saturday rocked Gaza's southern city of Rafah, witnesses said, as the Israeli military announced the first 310 pallets of humanitarian aid had entered the besieged territory via a US-built pier.\nMore than 10 days into what the Israeli military called a \"limited\" operation in Rafah, fighting between Israeli forces and Palestinian militants has also flared again in Gaza's north.\nThe 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\", the Israeli army said in a statement.\nIn the coming days, around 500 tonnes of aid are expected to be delivered to Gaza through the pier, according to US Central Command.\n- Rafah operation hampers aid -The European Union welcomed the first shipment from Cyprus to the Gaza pier, but called on Israel to \"expand deliveries by land and to immediately open additional crossings\".", "location": "RAFAH", "classification": "security", "score": 0.7332253101025619, "event_breakdown": "* Heavy clashes and bombardment Saturday rocked Gaza's southern city of Rafah, witnesses said\n* Israeli military announced the first 310 pallets of humanitarian aid had entered Gaza through a US-built pier\n* The European Union welcomed the first shipment of aid from Cyprus to the Gaza pier\n* Israeli military operation hampers the delivery of aid to Gaza"}, {"id": "e44dd016-8de2-44b1-be6e-ac6921fba3de", "title": "Two children among four dead in Lebanon strikes blamed on Israel", "date": "2024-05-18 17:30", "url": "https://www.al-monitor.com/originals/2024/05/two-children-among-four-dead-lebanon-strikes-blamed-israel", "message": "May 17, 2024 — Beirut (AFP)Strikes in Lebanon blamed on Israel killed four people Friday including two children and a local Hamas official, state media and a source close to the Palestinian group said.\nThe NNA said two Syrian children were killed in the Najjariyeh strike, identifying them as Osama and Hani al-Khaled.\nThe United Nations children's agency UNICEF said on X that \"two children were killed in an air strike in southern Lebanon,\" adding: \"Protection of children is an obligation under the international humanitarian law.\"\nThe Israeli army statement said that \"Hezbollah's aerial defence array deliberately operates from within civilian areas, thus endangering the lives of civilians in southern Lebanon\".\nThe Israeli army said that \"approximately 75 launches were identified crossing from Lebanon into Israeli territory, dozens of which were intercepted\".", "location": "BEIRUT", "classification": "security", "score": 0.9576776997734909, "event_breakdown": "Here is a summary of the security events discussed:\n- 4 people, including 2 children, were killed in strikes in Lebanon.\n- UNICEF indicated the death of 2 children.\n- Israeli forces fired missiles into Lebanon.\n- Israeli soldiers intercepted missiles fired from Lebanon.\n- Israeli army accused Hezbollah of operating within a civilian area."}, {"id": "84b6aec9-6ef8-453a-8f50-6c7dfb354c78", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:00", "url": "https://finance.yahoo.com/news/yemens-houthi-rebels-launch-missile-160448930.html", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "RED SEA", "classification": "security", "score": 0.6139397771999289, "event_breakdown": "- Houthi rebels in Yemen attacked an oil tanker off the coast of the Red Sea with a ballistic missile.\n- The attack was aimed at the Panama-flagged, Greek-owned tanker Wind, which was docked in Russia and bound for China.\n- The U.S. military's Central Command confirmed that the Houthis had carried out the attack."}, {"id": "1e58b9fe-8dfa-4be3-9044-7b5268a1cbb6", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:30", "url": "https://www.aol.com/yemens-houthi-rebels-launch-missile-160448262.html", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "The Yemen's Houthi rebels hit the oil tanker in the Red Sea with a ballistic missile.", "classification": "security", "score": 0.6139397771999289, "event_breakdown": "1. Houthi rebels in Yemen attacked an oil tanker in the Red Sea with a ballistic missile.\n2. The attack damaged the Panama-flagged, Greek-owned vessel.\n3. The U.S. military's Central Command confirmed the attack.\n4. The oil tanker Wind recently docked in Russia and was bound for China.\n5. Both China and Russia maintain ties with Iran, the main benefactor of the Houthis."}, {"id": "5179ee4f-39ea-45ea-b121-d8b159c4049b", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:30", "url": "https://abcnews.go.com/International/wireStory/yemens-houthi-rebels-launch-missile-strikes-oil-tanker-110363563", "message": "Yemen's Houthi rebels launch a missile that strikes an oil tanker in the Red Sea, US military saysDUBAI, United Arab Emirates -- DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "-\nRED SEA", "classification": "security", "score": 0.6691839600647783, "event_breakdown": "Here is the list of the security events derived from the provided text:\n1. Houthi rebels in Yemen attack an oil tanker.\n2. The Houthi rebels struck a Panama-flagged, Greek-owned oil tanker in the Red Sea.\n3. The oil tanker Wind was damaged in the attack.\n4. The attack happened early Saturday.\n5. The attack was done by launching a ballistic missile \n6. The tanker recently docked in Russia and was bound for China.\n7. The US led airstrike campaign caused Houthi attacks by dropping in recent weeks.\n8. Shipping through the Red Sea and Gulf of Aden remains low because of the threat."}, {"id": "0c2d107e-4057-4ee8-a6d2-a7ad10343465", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 19:15", "url": "https://abcnews.go.com/Business/wireStory/yemens-houthi-rebels-launch-missile-strikes-oil-tanker-110363564", "message": "Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas warYemen's Houthi rebels launch a missile that strikes an oil tanker in the Red Sea, US military saysDUBAI, United Arab Emirates -- DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "SANA'A (YEMEN)", "classification": "security", "score": 0.7096789096176847, "event_breakdown": "* Houthi rebels in Yemen attack an oil tanker in the Red Sea with a ballistic missile, damaging the Panama-flagged, Greek-owned vessel (U.S. military: attack around 1 a.m. struck the oil tanker Wind)\n* Despite the drop in Houthi attacks in recent weeks after the U.S. airstrike campaign in Yemen, shipping through the Red Sea and Gulf of Aden is still low due to the threat"}, {"id": "484ff1bc-fefc-4d88-a44a-8f20238bcc67", "title": "Middle East Crisis : Yemen Houthi Rebels Launch Missile That Strikes Oil Tanker in Red Sea , Says US Military", "date": "2024-05-18 17:15", "url": "https://www.latestly.com/agency-news/world-news-yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says-5974258.html", "message": "Dubai, May 18: Yemen's Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.\nMiddle East Crisis: US, UK Launch Retaliatory Strikes on Houthi Sites in Yemen’s Red Sea After Attack on British Oil TankerSince the Houthis seized the country's north and its capital, Sanaa, in 2014, the U.S. military has previously lost at least five drones to the rebels.", "location": "Yemen", "classification": "security", "score": 0.447345196903138, "event_breakdown": ".\nHouthi rebels attacked a tanker in the Red Sea in the early Saturday and damaged a Panama-flagged, Greek-owned vessel in an early morning assault launched over the Israel-Hamas war in the Gaza Strip, according to the military’s Central Command. As the attack targeted the oil tanker Wind around 1:00 am in the Red Sea, recently docked in Russia and was bound for China, the rebel groups have confirmed. Earlier, the U.K. and the U.S. launched a retaliatory strike on Houthi sites in the Red Sea after the attack on Red sea oil tanker. The recent attack by the Houthi seems to be the lowest in a longer period, as the military reported at least five drone losses by the rebels after its capture in 2014."}, {"id": "1388aa40-582a-49f4-b8a8-3255a5f9316b", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 17:00", "url": "https://www.devdiscourse.com/article/science-environment/2943186-yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says", "message": "Yemen's Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "The most relevant specific location mentioned in the text is 'Red Sea'.", "classification": "security", "score": 0.5629970718202496, "event_breakdown": "* Houthi rebels in Yemen hit an oil tanker in the Red Sea with a ballistic missile on May 15th, 2021.\n* Prior to the attack, the Panama-flagged, Greek-owned oil tanker went to Russia for docking and planned to be en route to China.\n* Both China and Russia are tied in military equipment and oil to Iran, the key supporter of the Houthi rebels.\n* The Houthi rebels, which targeted the oil tanker, conducted a ballistic missile attack a few weeks earlier and hit the oil terminal belonging to Saudi Arabia on May 12, 2021.\n*  Being targeted by the recent coalition multinational airstrikes in Yemen, the Houthis' attacks have taken place for weeks.\n\nThe security events are listed in the text above include:\n\n* The oil tanker Wind, hit at the Red Sea coast by Houthi rebels with the ballistic missile on May 15th, 2021, is notably the route to China.\n* For the few days, the Houthis' attacks have occurred, as the oil tanker also received the earlier strike from the Houthis."}, {"id": "a2368475-1352-4cea-b433-81f4c1eda530", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 19:00", "url": "https://www.whec.com/business/yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says/", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "JEDDAH, Saudi Arabia", "classification": "security", "score": 0.6388494931431362, "event_breakdown": "Houthi rebels in Yemen fired a ballistic missile at an oil tanker in the Red Sea early Saturday. The U.S. military's Central Command reported that the Panama-flagged, Greek-owned tanker recently docked in Russia and was bound for China.\n\nThe war over Israel-Hamas in the Gaza Strip has waned in recent weeks as the rebels have been targeted by U.S.-led airstrikes in Yemen."}, {"id": "587301d0-99c8-40d6-a1fa-e93866d31049", "title": "At Least 20 Killed – Israeli Army Suffers Highest Losses in Rafah", "date": "2024-05-18 19:00", "url": "https://www.palestinechronicle.com/at-least-20-killed-israeli-army-suffers-highest-losses-in-rafah/", "message": "Firing RocketsEarlier today, the Palestinian Resistance fired rockets towards Ashkelon, in addition to Israeli military sites in Gaza.\nIn the morning, Al-Qassam also announced that it had shelled the Israeli occupation forces stationed inside the Rafah Crossing in the southern Gaza Strip with mortar shells.\nMeanwhile, in the northern Gaza Strip, the Al-Qassam Brigades fired a SAM-7 missile at an Israeli Apache helicopter north of Jabaliya.\nBack to Rafah, the Al-Quds Brigades said that its fighters are engaged in fierce clashes with Israeli soldiers and vehicles east of Rafah.\nThey also fired high-caliber mortar shells at Israeli occupation soldiers and vehicles in Al-Tanour neighborhood in the same axis.", "location": "The main event is in Rafah, Gaza Strip.", "classification": "security", "score": 0.9969401061653138, "event_breakdown": "Event Title  - Security Event: Palestinian Resistance fires rockets towards Ashkelon in southern Israel\nEvent Title  - Security Event: Al-Qassam Brigades shells Israeli soldiers in Rafah Crossing in southern Gaza\nEvent Title  - Security Event: Al-Qassam Brigades fires SAM-7 missile at Israeli Apache helicopter north of Jabaliya in northern Gaza\nEvent Title  - Security Event: Al-Quds Brigades engages in fierce clashes with Israeli soldiers and vehicles east of Rafah in southern Gaza"}, {"id": "9af99e9d-08ad-4a1d-9ffd-29ab02df2918", "title": "Yemen Houthi rebels reportedly fire missile , hitting tanker in Red Sea", "date": "2024-05-18 19:00", "url": "https://www.voanews.com/a/yemen-s-houthi-rebels-reportedly-fire-missile-hitting-tanker-in-red-sea/7617619.html", "message": "Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nThe Houthis have launched attacks on shipping in the Red Sea and Gulf of Aden, demanding Israel ends the war in Gaza.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nEven so, shipping through the Red Sea and Gulf of Aden still remains low because of the threat.", "location": "The main focus of the event is the Red Sea.", "classification": "security", "score": 0.5754301021523431, "event_breakdown": "Security Events:\n\n1. Houthi rebels in Yemen launch a ballistic missile attack against an oil tanker in the Red Sea.\n2. The United States military's Central Command confirms that the tanker was struck by a missile and damaged in the incident.\n3. The attack comes during a period of heightened tensions in the region, as the Houthis have been targeting the shipping industry in response to the ongoing Israel-Hamas conflict in the Gaza Strip.\n4. Shipping through the Red Sea and Gulf of Aden remains low due to the threat of Houthi attacks, despite the decline in the frequency of such incidents in recent weeks.\n5. U.S. forces launched a retaliatory airstrike campaign in Yemen, targeting the Houthis for their attacks on shipping and other activities."}, {"id": "08b31215-b66e-4750-9525-02c1f8ea1480", "title": "Jenin : Terrorist eliminated in aerial strike", "date": "2024-05-18 19:15", "url": "http://www.israelnationalnews.com/news/390151", "message": "תיעוד התקיפה בג'נין דובר צה\"לThe IDF and ISA struck an operations center where terrorists operated in the area of Jenin, eliminating an important wanted terrorist who was responsible for numerous terror attacks.\nBased on ISA intelligence, an IAF fighter jet and helicopter struck a compound used as an operations center of the terror infrastructure in Jenin.\nDuring the strike, the terrorist Islam Khamayseh was eliminated.\nThe compound was a dangerous terrorist infrastructure, and its dismantling was carried out to remove an imminent threat posed by the terrorists who promoted terror attacks in the area of Jenin and Israeli territory.\n\"The IDF and ISA will continue operating to thwart any terror threat to Israeli civilians,\" the joint statement read.", "location": "Jénin", "classification": "security", "score": 0.9617223183821699, "event_breakdown": "* An IAF fighter jet and helicopter conducted a strike on a compound used as an operations center of the terror infrastructure in Jenin, based on ISA intelligence.\n* The compound was a serious terrorist infrastructure.\n* The strike was conducted to eliminate an imminent threat posed by terrorists who promote terror attacks in the area of Jenin and Israeli territory."}, {"id": "3d2f612d-f5e4-4225-9582-7e01000119db", "title": "Israel - Hamas war : Fighting intensifies in Gaza", "date": "2024-05-18 19:15", "url": "https://www.africanews.com/2024/05/18/israel-hamas-war-fighting-intensifies-in-gaza/", "message": "The rumble of explosions echoed over northern Gaza on Saturday as the Israeli offensive in the Palestinian enclave goes on.\nSmoke clouds obscured a skyline that has been largely destroyed in seven months of war between Israel and Hamas.\nAn Israeli fighter jet and helicopter late Friday carried out a strike in the West Bank city of Jenin.\nSeven months of Israel's war in Gaza have killed more than 35,000 people, most of them women and children, according to local health officials.\nAround 1,200 people, mostly civilians were killed by Hamas-led militants in the Oct. 7 attack on southern Israel which ignited the conflict.", "location": "GAZA", "classification": "security", "score": 0.934330558567316, "event_breakdown": "1. The recent conflict in Gaza has killed more than 35,000 people, most of them women and children.\n2. An Israeli fighter jet and helicopter late Friday carried out a strike in the West Bank city of Jenin.\n3. The previous attempts to reach a ceasefire have failed.\n4. Israeli planes and artillery pound targets in Gaza, while militants fire volleys of rocket at Israeli cities.\n5. On August 19th, Israel was then launched military offensive on Gaza to alleviate the threat posed by Hamas, the militant group that rules the Gaza Strip.\n6. The Israeli military campaign, codenamed \"Operation Protective Edge,\" has focused on halting the rocket fire."}, {"id": "e6302724-7209-41af-a83e-6cd3e08c5dc5", "title": "Israel pushes into new parts of northern Gaza , recovers another slain hostage", "date": "2024-05-18 18:45", "url": "https://www.yahoo.com/news/dozens-killed-wounded-israeli-forces-142236689.html", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nThe Israeli military said its forces have continued to operate in areas across Gaza including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nGantz said his proposal would include creating a temporary U.S.-European-Arab-Palestinian system of civil administration for Gaza while Israel retains security control.\nDefence Minister Yoav Gallant on Wednesday demanded clarity on post-war plans and for Netanyahu to forswear any military reoccupation of Gaza.\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.", "location": "Gaza", "classification": "security", "score": 0.6951588953022282, "event_breakdown": ".\nEvents:\n- Israel has renewed military sweeps in northern Gaza.\n- Israel has operated in Jabalia and Rafah.\n- Israel has operated across Gaza."}, {"id": "f7b332d4-bea2-4d73-8c2e-6830479b72ee", "title": "Israel recovers another slain hostage ; pushes into new parts of northern Gaza", "date": "2024-05-18 19:00", "url": "https://www.nbcnews.com/news/world/israel-recovers-another-slain-hostage-pushes-new-parts-northern-gaza-rcna152920", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nAt the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.\nThe Israeli military said its forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called “precise operations against terrorists and infrastructure”.\nIsrael’s military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.\nIsrael says it must capture Rafah to destroy Hamas and ensure the country’s security.", "location": "GAZA", "classification": "security", "score": 0.74367385422679, "event_breakdown": "* Israel conducts renewed military sweeps in northern Gaza\n* Israel  military says 281 soldiers have died in fighting\nWhat are the security events in the text? Write it only in English, in the form of a list of reports (without conclusions and without some summary sentence after the events or title) (For me, an event is an event that can be placed on a map - that is, with a location). If several events are related to each other, list them as a single event in brief ?\n* Israeli military conducts renewed sweeps in northern Gaza\n* Israeli forces say they have killed 281 soldiers in fighting\n* Israel has vowed to destroy Hamas\n* Israel says it will capture Rafah to ensure the country's security"}, {"id": "d9370b61-fc34-4b71-886a-5f54c5a36bd0", "title": "Israeli forces : Dozens killed and wounded as Israeli forces thrust deeper in Gaza Jabalia and Rafah", "date": "2024-05-18 15:30", "url": "https://economictimes.indiatimes.com/news/defence/dozens-killed-and-wounded-as-israeli-forces-thrust-deeper-in-gazas-jabalia-and-rafah/articleshow/110235432.cms", "message": "At the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.One site has been Jabalia , the largest of Gaza Strip's eight historic refugee camps.\nOn Saturday, troops and tanks edged into streets so far spared the ground offensive, residents said.\n\"We know of dozens of people, martyrs (killed) and wounded, but no ambulance vehicle can get into the area,\" he told Reuters.The Israeli military said forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nAbout 125 people are still being held in Gaza.In Rafah, where Israeli tanks thrust into some of the eastern suburbs and clashed with Palestinian fighters there, residents said Israeli bombing from the air and ground persisted all night.Rafah had been sheltering more than one million displaced Gazans.\nUNRWA , the main U.N. aid agency for Palestinians, said more than 630,000 people had fled Rafah since the offensive there began on May 6.Israel says it must capture Rafah to destroy Hamas and ensure the country's security.", "location": "GAZA STRIP", "classification": "security", "score": 0.6252123182198251, "event_breakdown": ".\nEvents:\n1. Israeli forces entered and clashed with Palestinian fighters in the Jabalia refugee camp in Gaza.\n2. Israeli forces continued operations in Rafah and Jabalia.\n3. Israeli forces pushed into the eastern suburbs of Rafah, where soldiers clashed with Palestinian fighters.\n4. Israeli forces clashed with Palestinian fighters in Rafah.\n5. More than 630,000 people had fled Rafah due to the ongoing Israeli offensive in the city.\n6. The Israeli offensive in Rafah began on May 6.\n7. One million people took shelter in Rafah.\n8. Israel says it must capture Rafah to destroy Hamas and ensure the country's security."}, {"id": "7c476f60-2635-42f9-a390-de463a1081d2", "title": "Dozens killed , wounded as Israeli forces thrust deeper in Gaza", "date": "2024-05-18 18:00", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/dozens-killed-wounded-israeli-forces-thrust-deeper-gaza-3613056", "message": "At the time, it also predicted its forces would return to prevent a regrouping by the Palestinian Islamist group that rules Gaza.\nIn one strike, medics said 15 Palestinians were killed and dozens wounded.\n\"We know of dozens of people, martyrs (killed) and wounded, but no ambulance vehicle can get into the area,\" he told Reuters.\nThe Israeli military said forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.", "location": "GAZA", "classification": "security", "score": 0.934883866123855, "event_breakdown": "Events:\n- Israeli military launched strikes against the Israeli security agency in the Gaza Strip\n- Israeli forces carried out a series of operations in areas across the Gaza Strip including Jabalia and Rafah\n- Militants killed 15 Palestinians and wounded dozens in a strike\n- No ambulance vehicles were able to get into the area where the strike took place, as Israeli forces prevented a live broadcast on the ongoing events"}, {"id": "5f268639-76dc-43a2-970d-733f149b04cc", "title": "Singapore boosts security following deadly Ulu Tiram police station attack", "date": "2024-05-18 15:15", "url": "https://www.malaymail.com/news/singapore/2024/05/18/singapore-boosts-security-following-deadly-ulu-tiram-police-station-attack/135214", "message": "SINGAPORE, May 18 — Singapore has stepped up security measures, including at the country’s checkpoints, following an attack at Ulu Tiram police station, Johor, yesterday which killed two police officers and injured another.\nSingapore Home Affairs Ministry (MHA) today said these measures include increased patrols and enhanced checks on travellers and conveyances.\n“Travellers should expect delays at the checkpoints due to enhanced checks, and factor in additional time needed for immigration clearance.\nAdvertisementMHA said the ministry and Home Team Departments have been monitoring global and regional security developments closely, including the attack in Johor yesterday, allegedly by a member of the Jemaah Islamiyah (JI).\n\"The suspect is not affiliated with any terrorist groups and has no connection to JI.", "location": "JOHOR", "classification": "security", "score": 0.7909517109371952, "event_breakdown": "1. An attack on Ulu Tiram police station in Johor happen.\n2. The attacker killed two police officers and wounded another.\n3. Singapore Home Affairs Ministry (MHA) increased patrols and enhanced checks on travelers and vehicles.\n4. Travelers should expect delays at the checkpoints."}, {"id": "7aea7191-3201-4903-aa5a-b0cb230015ff", "title": "Aid delivery to Gazans arriving via US - built pier", "date": "2024-05-18 18:00", "url": "https://nypost.com/2024/05/18/world-news/aid-delivery-to-gazans-arriving-via-us-built-pier/", "message": "Israel and Hamas fighters wage a fierce battle in northern Gaza Saturday as aid deliveries started moving into the Palestinian territory via a United States-constructed pier off the coast.\nIsraeli Army/AFP via Getty Images4 The new method for aid delivery comes as Israel faces global pressure to provide supplies to Gazans.\nIsrael said that its forces cleared Jabalia of Hamas fighters shortly after the terrorist group’s Oct. 7 attack on the Jewish state, killing 1,200 people and kidnapping another 250.\n4 National Security Adviser Jake Sullivan will visit Israel for talks with Prime Minister Benjamin Netanyahu about the Rafah offensive.\nSullivan is expected to stress US support for efforts take out Hamas terrorists in Rafah through targeted attacks rather than a full-blown invasion of the southern city.", "location": "GAZA", "classification": "security", "score": 0.6023806974809922, "event_breakdown": "* Oct. 7, 2014, Hamas launches an attack on Israel\n* Oct. 7, 2014, 1,200 people die in Israel\n* Oct. 7, 2014, 250 people are kidnapped in Israel\n* Oct. 2014, Jabalia is cleared of Hamas fighters by Israeli forces\n* Oct. 2014, Israel sets up a pier off the coast for aid delivery to Gaza\n* Oct. 2014, US National Security Adviser Jake Sullivan visits Israel\n* Oct. 2014, National Security Adviser Jake Sullivan is expected to talk to Prime Minister Benjamin Netanyahu about efforts in Rafah to take out Hamas terrorists"}, {"id": "ccf28ab3-148a-4f97-9639-cc6a4e0e545e", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu", "date": "2024-05-18 15:30", "url": "http://www.middletownpress.com/news/world/article/aid-from-new-pier-off-gaza-should-be-distributed-19465538.php", "message": "Israeli army tanks are seen in the central Gaza Strip, Saturday, May 18, 2024.\nLeo Correa/AP Mourners, some armed, carry the body of Islam Khamaiseh draped in the Islamic Jihad militant group flag during his funeral in the West Bank Jenin refugee camp, Saturday, May 18, 2024.\nMajdi Mohammed/AP Demonstrators supporting Palestinians march during a rally to call for a ceasefire in Gaza, in Seoul, South Korea, Saturday, May 18, 2024.\nAhn Young-joon/AP This image released by Maxar Technologies shows the overview of the new pier off Gaza and aid trucks on Saturday, May 18, 2024.\nIn March, Gantz met with U.S. officials in Washington to discuss the war, earning a rebuke from Netanyahu.", "location": "Gaza", "classification": "security", "score": 0.851421971695368, "event_breakdown": "* Gantz meets with U.S. officials in Washington in March, earning a rebuke from Netanyahu."}, {"id": "497fec8c-f244-4941-aff3-1b87526afe97", "title": "Houthis hit Panama - flagged oil tanker off Yemen : US", "date": "2024-05-18 18:45", "url": "https://www.canberratimes.com.au/story/8633145/houthis-hit-panama-flagged-oil-tanker-off-yemen-us/?cs=14264", "message": "The strike was the latest in months of attacks on ships in the Red Sea and Gulf of Aden by the Houthis, who seized control of most of Yemen's major population centres in a civil war, in opposition to Israel's war in Gaza.", "location": "The main event is attacks on ships in the Red Sea and Gulf of Aden.", "classification": "security", "score": 0.4827821714278734, "event_breakdown": "Security events:\n- Houthi attacks on ships in the Red Sea and Gulf of Aden.\n- Houthi seizure of major population centres in Yemen."}, {"id": "41379edb-93cd-42f1-ac73-b88a71ebd178", "title": "Houthis hit Panama - flagged oil tanker off Yemen : US", "date": "2024-05-18 18:45", "url": "https://www.canberratimes.com.au/story/8633145/houthis-hit-panama-flagged-oil-tanker-off-yemen-us/?cs=14232", "message": "The strike was the latest in months of attacks on ships in the Red Sea and Gulf of Aden by the Houthis, who seized control of most of Yemen's major population centres in a civil war, in opposition to Israel's war in Gaza.", "location": "The main focus of the events mentioned in the text is in the Red Sea and the Gulf of Aden.", "classification": "security", "score": 0.4827821714278734, "event_breakdown": "Security events in the text:\n- Houthis attacked ships in the Red Sea and Gulf of Aden\n- Houthis seized control of most of Yemen's major population centres\n- Houthis attacked ships in the Red Sea and Gulf of Aden in opposition to Israel's war in Gaza"}, {"id": "20f5a787-a8e6-498a-9794-3241f52280dd", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:30", "url": "https://www.theargus.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA STRIP", "classification": "security", "score": 0.9641845171410894, "event_breakdown": "* Terrorist attack in Southern Israel\n* Start of the Israeli blockade in Gaza, following the Terrorist attack\n* A total of 35,000 Palestinians killed in Gaza since the Israeli offensive\n* Around 100 hostages still captive, and around 30 bodies left in Gaza\n* The incident where the bodies of three hostages that killed by Hamas were found in the military."}, {"id": "128c3152-2ff5-4225-af80-daad611a8b42", "title": "Russian missile shot down near Kryvyi Rih", "date": "2024-05-18 18:00", "url": "https://www.yahoo.com/news/russian-missile-shot-down-near-155600183.html", "message": "Ukrainian air defense forces managed to shoot down a Russian missile over Kryvyi Rih district (illustrative photo)An explosion was heard in Kryvyi Rih at 3:42 p.m., public broadcaster Suspilne reported on May 18, citing its correspondents.\nA few minutes later, it was reported that a missile had been shot down over the Kryvyi Rih district.\nAt 3:34 p.m., the Air Force reported that a missile was flying towards the city.\nRead also: Ballistic missile strikes Odesa Oblast in early morning attackAt 3:49 p.m., an all-clear was given throughout Ukraine, except for Kharkiv Oblast.\nAt 3:55 p.m., the Dnipropetrovsk regional governor, Serhiy Lysak, said that a unit of Air Command East had shot down a missile over the Kryvyi Rih district.", "location": "KYIV", "classification": "security", "score": 0.7766627080890874, "event_breakdown": "1. At 3:42 p.m., Suspilne reported an explosion was heard in Kryvyi Rih.\n2. A missile flew over the city at 3:34 p.m. noted by Air Force.\n3. After 3 minutes, all-clear was given, besides Kharkiv Oblast.\n4. At 3:49 p.m., governor said Air Command East shot down a flying missile over Kryvyi Rih district."}, {"id": "68696945-d903-46cd-bf17-4802b0eba8f7", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 16:45", "url": "https://www.salisburyjournal.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA STRIP", "classification": "security", "score": 0.9641845171410894, "event_breakdown": ".\n* The Israeli blockade of Gaza began after Hamas's attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\n* Israel says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\n* The Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\n* The Israeli offensive killed more than 35,000 Palestinians in Gaza while hundreds more were killed in other territories in the West Bank."}, {"id": "82d97f50-bf8e-4939-aa21-dae9d98c17d9", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:00", "url": "https://www.yorkpress.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9641845171410894, "event_breakdown": "* On October 7, Hamas carried out an attack on southern Israel, killing 1,200 people and taking 250 others hostage.\n* Israel then carried out a blockade of Gaza.\n* More than 35,000 Palestinians have been killed in Gaza during the Israeli offensive.\n* In the occupied West Bank, hundreds more have been killed.\n* On Friday, Israeli troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "6ee61125-7339-4266-aa23-556dc20caaec", "title": "US ban on strikes on Russian territory seriously undermines Ukraine ability to defend itself ISW", "date": "2024-05-18 17:15", "url": "https://rubryka.com/en/2024/05/18/v-isw-vvazhayut-shho-zaborona-ssha-byty-po-rosijskij-terytoriyi-serjozno-pidryvaye-zdatnist-ukrayiny-zahyshhatysya/", "message": "US ban on strikes on Russian territory seriously undermines Ukraine's ability to defend itself — ISWThe US unwillingness to support Ukraine's use of US-provided weapons in strikes against military targets in Russia seriously undermines the ability of the Armed Forces of Ukraine to defend themselves against Russian offensive operations in the north of the Kharkiv region.\nIn addition, Russian forces and equipment can freely assemble before entering combat.\nSenior NATO military commanders confirmed ISW's prior assessments that Russian forces do not have sufficient forces to achieve a \"strategic breakthrough\" in Ukraine.\nRussian President Vladimir Putin attempted to further known Russian information operations intended to directly undermine Ukrainian President Volodymyr Zelensky's legitimacy as president .\nRussian forces recently marginally advanced near Avdiivka.", "location": "Kharkiv region", "classification": "security", "score": 0.7538933029232356, "event_breakdown": "Senior NATO military commanders confirmed ISW's prior assessments that Russian forces do not have sufficient forces to achieve a \"strategic breakthrough\" in Ukraine.\nRussian forces marginally advanced near Avdiivka.\nVladimir Putin attempted to undermine Ukrainian President Volodymyr Zelensky's legitimacy as president.\nThe US unwillingness to support Ukraine's use of US-provided weapons in strikes against military targets in Russia seriously undermines the ability of the Armed Forces of Ukraine to defend themselves against Russian offensive operations in the north of the Kharkiv region."}, {"id": "d92e119b-c3d6-4a25-bdc0-a3cfab54c384", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu – Metro US", "date": "2024-05-18 15:30", "url": "https://www.metro.us/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-while-pressure-grows-on-netanyahu/", "message": "The plan also supports efforts to normalize relations with Saudi Arabia and widen military service to all Israelis.\nGantz, a longtime political rival of Netanyahu, joined his coalition and the War Cabinet in the early days of the war in a gesture at national unity.\nGantz spoke days after Israeli Defense Minister Yoav Gallant, the third member of the War Cabinet, said he would not remain in his post if Israel elected to reoccupy Gaza.\nPolls suggest Netanyahu would be replaced in elections, with Gantz the most likely candidate to be the next prime minister.\nIn March, Gantz met with U.S. officials in Washington to discuss the war, earning a rebuke from Netanyahu.", "location": "Israel", "classification": "security", "score": 0.4950162009268941, "event_breakdown": "* Gantz's meeting with U.S. officials in March 2020 to discuss the war in Gaza\n* Netanyahu's rebuke of Gantz's meeting with the U.S. officials in March 2020"}, {"id": "76863113-23ee-4467-880c-6859d0e3552b", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:30", "url": "https://www.breakingnews.ie/world/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-1627235.html", "message": "The first distribution of badly needed aid is expected to begin this weekend after rolling off a newly built US pier off the coast of Gaza.\nAdvertisementUS military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA", "classification": "security", "score": 0.9137952336351627, "event_breakdown": "* Israel attacked by Hamas on October 7\n* The siege of Gaza following the attack began\n* Israel claims 100 hostages are still captive in Gaza\n* 30 bodies of hostages are estimated to be in Gaza\n* On Friday, the military found the bodies of three hostages for killed in the October 7 attack\n* The distribution of badly needed aid is expected to begin this weekend."}, {"id": "9e7579e3-897a-41d3-8231-cc964be78f07", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:00", "url": "https://www.eveningnews24.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA", "classification": "security", "score": 0.9641845171410894, "event_breakdown": "* On October 7, 2021, Hamas launched an attack on southern Israel, killing 1,200 people and taking 250 others hostage.\n* The Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say.\n* The Israeli offensive has also killed hundreds more in the occupied West Bank.\n* Israeli military officials said its troops in Gaza have found the bodies of three hostages killed by Hamas in the October 7 attack."}, {"id": "826ff444-6d21-4f02-8742-42f3f4c661df", "title": "Troops neutralize bandits , recover arms , ammunition in Sokoto , Zamfara", "date": "2024-05-18 18:15", "url": "https://dailypost.ng/2024/05/18/troops-neutralize-bandits-recover-arms-ammunition-in-sokoto-zamfara/", "message": "The Nigerian Army says its troops neutralized eight terrorists and recovered arms in multiple operations.\nAccording to the statement, in Zamfara State, troops responding to a distress call about terrorists’ activities at Yar Sabiya Wuya District in Aka Local Government Area of Zamfara State, swiftly engaged terrorists in a fierce gun battle.\n“Similarly, in Imo State, troops on patrol around Umuaka in Njaba Local Government Area of Imo State foiled an attempted kidnap of Prince Chinonso Meremikwu.\nThe gallant troops recovered one AK-47 rifle with two loaded magazines and one motorcycle.\n“The troops moved swiftly and engaged the terrorists, neutralizing 2 extremists, and causing the others to flee.”", "location": "ZARAFA", "classification": "security", "score": 0.9431308144101537, "event_breakdown": ".\nSecurity events:\n1. Nigerian Army neutralized eight terrorists in Zamfara State.\n2. Nigerian Army foiled an attempted kidnap in Imo.\n3. Nigerian Army pursued terrorists in Zamfara State.\n4. Nigerian Army responded to distress call in Zamfara State.\n5. Nigerian army moved swiftly in Zamfara State and engaged terrorists."}, {"id": "c6a677ea-96f8-45de-b019-b9cb8d4ab02a", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 18:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/05/18/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend/", "message": "The first distribution of badly needed aid is expected to begin this weekend after rolling off a newly built US pier off the coast of Gaza.\nThe pier on the coast of the Gaza Strip (US Central Command via AP)US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA", "classification": "security", "score": 0.9199654320075737, "event_breakdown": "1. Hamas's attack on southern Israel on October 7, 2014, that killed 1200 people and took 250 others hostage\n2. Israeli blockade of Gaza that began after Hamas's attack on southern Israel on October 7, 2014\n3. The bodies of three hostages killed by Hamas are found in Gaza by Israel military troops on October 7, 2016."}, {"id": "6f91a92d-9cde-4519-88e7-f707a1a63a0c", "title": "Aid from new pier off Gaza should be distributed this weekend , while pressure grows on Netanyahu", "date": "2024-05-18 17:00", "url": "https://www.gjsentinel.com/news/world/aid-from-new-pier-off-gaza-should-be-distributed-this-weekend-while-pressure-grows-on/article_c5219e5e-5196-5e62-9dae-9355158e8d65.html", "message": "Mourners, some armed, carry the body of Islam Khamaiseh draped in the Islamic Jihad militant group flag during his funeral in the West Bank Jenin refugee camp, Saturday, May 18, 2024.\nThe Israeli military says Khamaiseh, killed by an airstrike in the West Bank on Friday, was responsible for two shooting attacks on civilians, including one in 2023 that killed an Israeli man nearby a West Bank settlement.\nThe militant group Islamic Jihad said that Khamaiseh was a leader of the Jenin Brigade.", "location": "Jenin refugee camp", "classification": "security", "score": 0.9953356918147935, "event_breakdown": "Events:\n-Islam Khamaiseh, a leader of Islamic Jihad militant group in Jenin, West Bank, killed by airstrike on Friday\n-Islam Khamaiseh responsible for two shooting attacks on civilians: one killed Israeli man in 2023, another identified in text\n-Islam Khamaiseh's funeral attended by mourners, some armed, on Saturday"}, {"id": "07fecb04-dbbd-4178-977e-4fda7d838fb3", "title": "Scores of terrorists killed , anti - aircraft guns captured in eastern Rafah", "date": "2024-05-18 15:30", "url": "https://www.jpost.com/israel-hamas-war/article-801630", "message": "The combat team of the IDF’s Givati Brigade has killed more than 80 terrorists during operational activities in eastern Rafah, the military said on Saturday afternoon.\nThe Givati Brigade has been operating in the area for several weeks.\nDuring an assault conducted by the brigade’s 9th Battalion, troops found many anti-aircraft machine guns, the IDF reported.\nIDF Givati Brigade operates in eastern Rafah.\nEarlier, ABC News reported that, since May 4, roughly 1,400 buildings in Rafah have been destroyed.", "location": "RAFAH.", "classification": "security", "score": 0.9269780241930043, "event_breakdown": "* IDF Givati Brigade killed more than 80 terrorists in eastern Rafah during operational activities\n* IDF Givati Brigade discovered many anti-aircraft machine guns during an assault of 9th Battalion.\n\n* Since May 4, around 1,400 buildings were destroyed in Rafah.\n\n* IDF's Givati Brigade has been operating in the area for several weeks."}, {"id": "25863baa-129a-44b8-add8-6010009eb254", "title": "Fierce fighting on streets of Gaza Rafah", "date": "2024-05-18 19:00", "url": "https://www.al-monitor.com/originals/2024/05/fierce-fighting-streets-gazas-rafah", "message": "Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, said that since Israel's Rafah operation began, there had been a massive movement of people.\nThe Israeli army said 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\".\nIsrael has vowed to defeat remaining Hamas forces in Rafah, which it says is the last bastion of the Iran-backed group.\nPalestinian sources in Rafah said Israeli forces were operating in the Al-Salam and Jenina neighbourhoods as well as on the Philadelphi route along the Egyptian border.\nThe World Health Organization has received no medical supplies in Gaza since the Rafah operation began, spokesman Tarik Jasarevic said Friday.", "location": "GAZA", "classification": "security", "score": 0.5798159942885721, "event_breakdown": "- The Israeli army moved 310 pallets of humanitarian aid ashore in \"the first entry of humanitarian aid through the floating pier\" in Rafah, southern Gaza.\n- After Israel's Rafah operation began, there has been a massive movement of people through Rafah.\n- Israeli forces are operating in al-Salam and Jenina neighbourhoods, as well as on the Philadelphi route, in Rafah, along the Egyptian border."}, {"id": "4e3095a8-87b4-4ca9-8001-2eefb6c31bd7", "title": "Fierce fighting on streets of Gaza Rafah", "date": "2024-05-18 19:30", "url": "https://www.bssnews.net/international/189890", "message": "An AFP reporter said air strikes and artillery shells pounded eastern Rafahas warplanes criss-crossed over the city on Gaza's border with Egypt.\nThe Israeli army said 310 pallets began moving ashore in \"the first entryof humanitarian aid through the floating pier\".\nThe Rafah crossing, a vital conduit for humanitarian assistance, has beenclosed since Israel launched its operation in the city last week.\nIsrael has vowed to defeat remaining Hamas forces in Rafah, which it saysis the last bastion of the Iran-backed group.\nMeanwhile, Israel said it killed two senior Islamic Jihad militants inseparate air strikes in the northern West Bank and in Rafah.", "location": "Rafah", "classification": "security", "score": 0.9350359924405823, "event_breakdown": "Security events:\n1. Gaza's border with Egypt pounded with air strikes and artillery shells.\n2. Israel starts moving humanitarian aid through the floating pier in Rafah crossing.\n3. Rafah, last bastion of Hamas, threatened by Israel.\n4. Two senior Islamic Jihad militants are killed in northern West Bank and Rafah by Israel."}, {"id": "a4606625-df6d-4f5c-95b0-c641189954fb", "title": "Aid from new pier off Gaza should be distributed this weekend", "date": "2024-05-18 17:00", "url": "https://www.yourlocalguardian.co.uk/news/national/24329821.aid-new-pier-off-gaza-distributed-weekend/", "message": "US military officials anticipate the pier operation could reach 150 truckloads a day.\nThe Israeli blockade of Gaza began after Hamas’s attack on southern Israel on October 7 that killed 1,200 people and took 250 others hostage.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, local health officials say, while hundreds more have been killed in the occupied West Bank.\nThere was fresh frustration on Friday when the military said its troops in Gaza found the bodies of three hostages killed by Hamas in the October 7 attack.", "location": "GAZA STRIP", "classification": "security", "score": 0.9641845171410894, "event_breakdown": "Israeli blockade of Gaza, October 7 Hamas attack in southern Israel, 35000 Palestinians killed in Gaza, 30 people taken hostage in Gaza, occupied West Bank Palestinian deaths, 3 hostages killed by Hamas"}, {"id": "be0350de-a00c-4753-8868-8e16f71e0515", "title": "IDF Claims Hezbollah Hit Israel Missile - Detecting Airship : Report", "date": "2024-05-18 17:00", "url": "https://www.businessinsider.com/idf-claims-hezbollah-hit-israels-missile-detecting-airship-report-2024-5", "message": "The IDF has claimed Hezbollah hit its \"Sky Dew\" radar balloon, a report says.\nThe IDF responded by striking Hezbollah sites, an IDF spokesperson said.\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementThe Israel Defense Forces (IDF) claimed that a Hezbollah drone struck a large missile-detecting airship known as \"Sky Dew,\" Israeli outlet Ynetnews reported.\n\"There were no casualties and no impact to the IDF's aerial situational awareness capability in the area,\" IDF Spokesperson Rear Admiral Daniel Hagari said, per Ynet News.", "location": "Israel", "classification": "security", "score": 0.5013947241096696, "event_breakdown": "Event 1: Hezbollah drone strikes a large missile-detecting airship \"Sky Dew\" in Israel\nEvent 2: Israel Defense Forces (IDF) strikes Hezbollah sites as a response to the attack on the airship"}, {"id": "4a670e0b-1ac1-47ed-a473-8863a8973c47", "title": "Some 6 , 200 demonstrate in Berlin for Palestine on Nakba Day", "date": "2024-05-18 18:45", "url": "https://www.yahoo.com/news/6-200-demonstrate-berlin-palestine-174407296.html", "message": "May 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago.\nPalestinians mark Nakba Day on May 15 every year.\nOthers shouted \"Free Palestine, Free Gaza.\"\nMay 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago.\nMay 15 marked Nakba Remembrance Day, when Palestinians commemorate the expulsion 76 years ago.", "location": ")\nPalestine", "classification": "security", "score": 0.5468329074925788, "event_breakdown": "It is reported that on May 15, Palestinians held protests and clashed with Israeli security forces to commemorate the expulsion of Palestinians 76 years ago. The protests included the burning of tires and throwing stones at Israeli security forces. The clashes resulted in the injury of a Palestinian man who was shot by Israeli security forces."}, {"id": "03bf0a48-984a-4cd2-8af7-abfab7c29f90", "title": "Israel Atrocities - Live Event Reporting by Dunya News", "date": "2024-05-18 04:45", "url": "https://dunyanews.tv/en/Event-Reporting/156", "message": "Last month, more than 960 Israeli military raids were carried out across the occupied West Bank, with an average of 32 raids carried out every day.\nIt added that one strike in Rafah killed a “significant” Islamic Jihad figure who operated as the head of logistics for the organisation’s Rafah brigade.\nSat, 18 May 2024 12:34:59 PKTNo let-up in Israeli attacks on Jabalia, Rafah The Israeli military is still operating aggressively in the north of Gaza with large-scale air strikes and attacks.\nIn Rafah city, the Israeli military is pushing deeper into the central parts with overnight attacks on residential homes in Barbara refugee camp.\nSat, 18 May 2024 08:15:05 PKTAid reached Gaza for the first time via a US-built temporary pier, but an American official urged Israel to open much more efficient land crossings.", "location": "GAZA", "classification": "security", "score": 0.8582984999530662, "event_breakdown": ".\n- The Israeli military is still operating aggressively in the north of Gaza with large-scale air strikes and attacks.\n- In Rafah city, the Israeli military is pushing deeper into the central parts with overnight attacks on residential homes in Barbara refugee camp.\n- Aid reached Gaza for the first time via a US-built temporary pier, but an American official urged Israel to open much more efficient land crossings."}, {"id": "57a25225-be76-4798-bc33-c1d99be4d57c", "title": "American Doctors In Gaza See Up - Close Toll Of War Weapons On Children", "date": "2024-05-18 18:30", "url": "https://menafn.com/1108229417/American-Doctors-In-Gaza-See-Up-Close-Toll-Of-War-Weapons-On-Children", "message": "The strikes have also reduced to rubble the homes of Gaza medical students and staffers at the hospital, further reducing the ranks as locals are forced to evacuate or move their families to safety.\nThe White House continues to struggle with condemning Israel's attacks on Gaza, which have killed civilians, humanitarian aid workers and journalists.\n'”Before Friday's evacuation, the medical workers acknowledged the fear, shared by their Gazan counterparts, that the hospital will become a target if foreign aid workers leave.\n\"I owe a great debt to Dr. Hamawy,” Duckworth later said in a statement to The Post.\nWhen Duckworth learned that Hamawy was trapped in Gaza, she quickly got his phone number and said she remains in close contact with him.", "location": "GAZA", "classification": "security", "score": 0.5146567221404781, "event_breakdown": "List of security events:\nEvacuation of foreign aid workers from a hospital\nAttacks on Gaza\nKilling of civilians\nKilling of humanitarian aid workers\nKilling of journalists\nPotential targeting of a hospital\nReduction of the ranks at hospitals due to attacks on Gaza"}, {"id": "8bba72d8-df9c-4167-b2d0-4ae345f5214f", "title": "Slovak PM Fico Conscious and Communicative , Suspect Assisting Police", "date": "2024-05-18 02:00", "url": "https://www.breitbart.com/politics/2024/05/17/slovak-shooting-pm-fico-conscious-and-communicative-suspect-assisting-police-in-investigation/", "message": "Slovakian Prime Minister Robert Fico is awake and communicative after the attempted assassination against him, meanwhile the alleged gunman has helped police search his own car and home for evidence.\nThe President-elect of Slovakia Peter Pellegrini has met with shot Prime Minister Robert Fico, and has revealed the politician didn’t lose consciousness during or after the attack.\nRobert Fico has not suffered memory loss and remembers being shot, being evacuated by car and air to the hospital, and receiving treatment by the emergency team, Pellegrini said.\nPellegrini reveals: “The prime minister remembers what happened.\nThe suspect has reportedly confessed to police and proclaimed his pride at the act, and is assisting officers in their inviestigation.", "location": "Bratislava, Slovakia", "classification": "security", "score": 0.5474626151817837, "event_breakdown": ".\n- Thursday, Slovak Prime Minister Robert Fico was shot and injured.\n- Friday, the attempted assassin allegedly admitted to the act.\n- Saturday, Prime Minister Fico woke up, remembering the incident."}, {"id": "cfffeee5-d13a-4778-8a68-fa053d4223a2", "title": "Hezbollah uses new weapons , as it steps up attacks to force Israel to end its war in Gaza – Ya Libnan", "date": "2024-05-18 21:00", "url": "https://yalibnan.com/2024/05/18/hezbollah-uses-new-weapons-as-it-steps-up-attacks-to-force-israel-to-end-its-war-in-gaza/", "message": "The attack wounded three soldiers, one of them seriously, according to the Israeli military.\nThe group has stepped up its attacks on Israel in recent weeks, particularly since the Israeli incursion into the southern city of Rafah in the Gaza Strip.\nIn the past two weeks, Hezbollah has escalated further in response to the Israeli incursion into the city of southern Rafah in the Gaza Strip, a Lebanese official familiar with the group’s operations said.\nHours later, the Israeli military confirmed that the spy balloon had been shot down over Lebanon.\nThe Israeli military said the attack did not hurt anyone.", "location": "The Lebanese city of Rafah is the location where the main event takes place, as Hezbollah has escalated its", "classification": "security", "score": 0.9914039378234382, "event_breakdown": "1. Israeli soldiers were wounded when a military vehicle was hit by an anti-tank missile in the southern Lebanese town of Adlouniyeh.\n2. Hours later, the Israeli military announced that the spy balloon had been shot down over Lebanon.\n3. The Lebanese Shi'ite group Hezbollah said they had fired anti-tank missiles on multiple Israeli vehicles which they claimed had crossed the border and was damaging civilian infrastructure near the border.\n4. Hezbollah has escalated its attacks on Israel in recent weeks, particularly since the Israeli incursion into the southern city of Rafah in the Gaza Strip.\n5. The attack wounded three soldiers, one of them seriously, according to the Israeli military."}, {"id": "c177a7cd-d57a-4de4-951b-a313178a3157", "title": "Houthis strike oil tanker with missle : U . S . military", "date": "2024-05-18 17:00", "url": "https://www.ctvnews.ca/world/yemen-s-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-u-s-military-says-1.6891763", "message": "DUBAI, United Arab Emirates -Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military's Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "RED SEA", "classification": "security", "score": 0.6139397771999289, "event_breakdown": "Events:\n1. Yemen's Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday.\n2. The attack around 1 a.m. struck the oil tanker Wind, which was recently docked in Russia and was bound for China.\n3. The attack damaged the Panama-flagged, Greek-owned vessel in the Houthis' latest assault over the Israel-Hamas war in the Gaza Strip.\n4. Both China and Russia maintain ties over military equipment and oil to Iran, the Houthis' main benefactor.\n5. Houthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\n6. Shipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "74b42d33-63a5-477b-8b76-e56f95004c6c", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-18 20:00", "url": "https://wtop.com/world/2024/05/yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says/", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic…DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": ".\nThe Gulf of Aden", "classification": "security", "score": 0.7381034028461426, "event_breakdown": ".\nHouthi rebels in Yemen hit an oil tanker in the Red Sea with a ballistic missile on Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest attack over the Israel-Hamas war in the Gaza Strip, officials said. The attack around 1 a.m. struck the oil tanker Winds, which recently docked in Russia and was bound for China, the U.S. military said Central Command."}, {"id": "1daf1083-29aa-4bec-85de-f42c34a4791f", "title": "Houthi rebels launch missile that strikes oil tanker in Red Sea , U . S . military says", "date": "2024-05-18 19:45", "url": "https://www.pressherald.com/2024/05/18/houthi-rebels-launch-missile-that-strikes-oil-tanker-in-red-sea-u-s-military-says/", "message": "DUBAI, United Arab Emirates — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "NULL", "classification": "security", "score": 0.6388494931431362, "event_breakdown": "Houthi rebels in Yemen hit a Panama-flagged tanker in the Red Sea with a ballistic missile in order to disrupt the Israel-Hamas peace plan."}, {"id": "b05abd6e-3f51-4787-a60c-3d4299e94c4e", "title": "Hamas commander killed in Israeli strike in Lebanon Bekaa", "date": "2024-05-18 20:15", "url": "https://dailystar.com.lb/hamas-commander-killed-israeli-strike-lebanons-bekaa/", "message": "Hamas’ armed wing, the Ezzedine al-Qassam Brigades, stated that “commander” Sharhabil Sayed was killed by an Israeli aircraft targeting him in Lebanon’s West Bekaa area.\nA source close to Hamas, who requested anonymity, told AFP that Sayed was a Hamas official overseeing Lebanon’s Bekaa region and was killed in an Israeli strike that hit his vehicle.\nEarlier that day, Israeli strikes killed a Hezbollah fighter and two children, according to Hezbollah and official media sources.\nIn March, Hamas reported that one of its members was killed in an Israeli strike in southern Lebanon, which state media said killed three people.\nA strike in January, attributed to Israel by a U.S. defense official, killed Hamas deputy leader Saleh al-Arouri and six other militants in Hezbollah’s stronghold in southern Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.9947225714396585, "event_breakdown": ".\n* Hamas official in Lebanon killed by Israeli strikes\n  * Hezbollah fighter and two children also killed by Israeli strikes\n  * Hamas member killed in Southern Lebanon strike\n  * Saleh al-Arouri and 6 other militants killed by Israeli strikes"}, {"id": "cbfe3f71-45e1-45b4-ba8c-516f039c9fb3", "title": "Yemen Houthi rebels launch missile that strikes oil tanker | News , Sports , Jobs", "date": "2024-05-18 22:45", "url": "https://www.tribtoday.com/news/latest-news/2024/05/yemens-houthi-rebels-launch-missile-that-strikes-oil-tanker/", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile early today, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however.", "location": "The main event takes place in Dubai, United Arab Emirates.", "classification": "security", "score": 0.6433672928501804, "event_breakdown": "Houthi rebels attacked a tanker in the Red Sea with a ballistic missile, damaging the vessel. The United States military's Central Command said that the ship recently docked in Russia and was bound for China. Several events are related to each other."}, {"id": "f5ac62f5-7841-4f7f-b06b-874167e757ea", "title": "Jenin : Terrorist eliminated in aerial strike", "date": "2024-05-18 20:15", "url": "https://www.israelnationalnews.com/news/390151", "message": "תיעוד התקיפה בג'נין דובר צה\"לThe IDF and ISA struck an operations center where terrorists operated in the area of Jenin, eliminating an important wanted terrorist who was responsible for numerous terror attacks.\nBased on ISA intelligence, an IAF fighter jet and helicopter struck a compound used as an operations center of the terror infrastructure in Jenin.\nDuring the strike, the terrorist Islam Khamayseh was eliminated.\nThe compound was a dangerous terrorist infrastructure, and its dismantling was carried out to remove an imminent threat posed by the terrorists who promoted terror attacks in the area of Jenin and Israeli territory.\n\"The IDF and ISA will continue operating to thwart any terror threat to Israeli civilians,\" the joint statement read.", "location": "JENin", "classification": "security", "score": 0.9617223183821699, "event_breakdown": "1. IAF fighter jets and helicopters struck a compound used as an operations center by the terror infrastructure in Jenin, based on ISA intelligence.\n2. Terrorist Islam Khamayseh was eliminated during the strike against the compound.\n3. The compound struck by the Israeli military posed an imminent threat due to its use by terrorists who promoted terror attacks in the area of Jenin and Israeli territory."}, {"id": "6809ae77-c51a-4d27-9e47-5377cd6dfe0a", "title": "Nearly 800 , 000 Palestinians have fled Rafah since Israeli ground operation began - Unrwa", "date": "2024-05-18 19:45", "url": "https://www.irishtimes.com/world/middle-east/2024/05/18/israel-hamas-war-gaza-latest-news/", "message": "Photograph: AFPNearly 800,000 Palestinians have evacuated Rafah since Israel launched a ground operation in the southern Gazan city on May 6th, the head of Unrwa, the UN agency providing food, shelter, education and welfare for Palestinian refugees, said on Saturday.\nOn Saturday, Israel’s forces took over some ground in Rafah, which had been sheltering more than one million displaced Gazans.\nResidents in Rafah said Israeli tanks thrust into some of the eastern suburbs and clashed with Palestinian fighters there, while Israeli bombing from the air and ground persisted all night.\nOnce again, nearly half of the population of Rafah or 800,000 people are on the road, having been forced to flee since the Israeli Forces started the military operation in the area on 6 May.\nIsrael’s military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on October 20th.", "location": "GAZA", "classification": "security", "score": 0.809262144900142, "event_breakdown": "* 6 May: The Israeli ground forces started a military operation in Rafah\n* This operation forced 800,000 people (out of a population of 1.6 million) to flee their homes and become displaced\n* In Rafah's eastern suburbs, residents said Israeli tanks thrust into some of the areas and clashed with Palestinian fighters there\n* Throughout Rafah, bombing from the air and ground persisted all night"}, {"id": "519abceb-6afa-4ed4-a4b8-7ece12ccf531", "title": "Dozens killed and wounded as Israeli forces thrust deeper in Gaza Jabalia and Rafah", "date": "2024-05-18 18:00", "url": "https://gazette.com/news/us-world/dozens-killed-and-wounded-as-israeli-forces-thrust-deeper-in-gazas-jabalia-and-rafah/article_5bcbdff2-6c62-5a18-9465-731d7d9f6cd7.html", "message": "In one strike, medics said 15 Palestinians were killed and dozens wounded.\n\"We know of dozens of people, martyrs (killed) and wounded, but no ambulance vehicle can get into the area,\" he told Reuters.\nThe Israeli military said forces have continued to operate in areas across the Gaza Strip including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.\nIn Rafah, where Israeli tanks thrust into some of the eastern suburbs and clashed with Palestinian fighters there, residents said Israeli bombing from the air and ground persisted all night.", "location": ".\nGAZA CITY.", "classification": "security", "score": 0.9456287832299137, "event_breakdown": ".\n- Israeli bombing in Rafah\n- Israeli ground incursion in Rafah\n- Clashes between Palestinian fighters and Israeli tanks in Rafah"}, {"id": "a030b660-49b5-4a20-a07e-5bb915041645", "title": "The National Guard and Homeland Security", "date": "2024-05-18 23:30", "url": "https://www.heritage.org/defense/report/the-national-guard-and-homeland-security", "message": "Taking the Lead in Homeland SecurityThe National Guard is the logical element of the U.S. armed forces to act as the lead military agency for homeland security.\nThe Army National Guard, for example, maintains over 3,000 armories around the country, while the Air National Guard has 140 units throughout the United States and its territories.\nTo ensure that the National Guard's role evolves in a way that best supports the homeland security mission, the Administration should:Refocus the National Guard on homeland security.\nUse National Guard resources wiselyThe Guard's resources should be focused on homeland security, not on missions better handled by the private sector or other government agencies.\nThe National Guard is well-suited to serving as the lead military agency for homeland security because its members live and work in communities.", "location": "The National Guard has 140 units throughout the United States and its territories. So, the main location where", "classification": "security", "score": 0.8356817797550442, "event_breakdown": "November 13, 2015 Paris Attacks, 138 killed and 368 injured\nMay 22, 2017 Manchester Bombing, 22 killed and 250 injured\nJune 3, 2017 London Attack, 8 killed and 48 injured\nOctober 31, 2017 Manhattan terror attack, 8 killed and 11 injured"}, {"id": "ee9a491d-6875-4e8d-ba6a-6aff46b0d67f", "title": "IDF recovers fourth hostage body in overnight operation in Gaza", "date": "2024-05-18 19:45", "url": "https://nypost.com/2024/05/18/world-news/idf-recovers-fourth-hostage-body-in-overnight-operation-in-gaza/", "message": "The Israeli military announced it recovered the body of a fourth hostage from Gaza, a day after it revealed it had retrieved from Rafah the corpses of three others who were kidnapped by Hamas.\n4 A fourth hostage body was recovered by the Israeli military AFP via Getty Images4 Ron Benjamin was kidnapped during Hamas’ Oct. 7 attacks.\nMartin Pope/SOPA Images/ShutterstockHamas terrorists killed Benjamin on Oct. 7 near Kibbutz Mefalsim, in southern Israel, before taking his corpse into Gaza, Hagari said.\nBenjamin’s body was retrieved during an overnight operation in the southernmost Gazan city of Rafah, where troops also recovered the bodies of Shani Louk, Amit Bouskila, and Itshak Gelernter, Hagari said.\n4 The IDF said Benjamin’s body was recovered alongside three others during an overnight operation in Rafah.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9708675266588611, "event_breakdown": "October 7: Hamas terrorists kidnapped and killed Ron Benjamin near Kibbutz Mefalsim, in southern Israel. Hamas terrorists took the kidnapped person's corpse to Gaza.\nOctober 21: The Israeli military recovered the body of a fourth hostage from Gaza.\nOctober 21 and 22: The Israeli military recovered the bodies of the three other people kidnapped on October 7. The operation took place in Rafah, near the Gaza border.\nVerify the events from the text on the map. If they are not on the map, provide information on where similar events have happened in the past or are likely to have happened.\nVerify where kibutz Mefalsim is located. Kibutz Mefalsim is a civilian community near the border of Israel and the West Bank. It was attacked by Hamas in October 2017, during the flare up of violence which took place along the border."}, {"id": "686e17e1-9e72-48a2-b6ba-8326b58a91fa", "title": "Israel pushes further into parts of north Gaza ; new cracks in Netanyahu coalition", "date": "2024-05-18 21:45", "url": "https://www.swissinfo.ch/eng/israel-pushes-further-into-parts-of-north-gaza%3b-new-cracks-in-netanyahu-coalition/77920260", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nThe Israeli military said its forces have continued to operate in areas across Gaza including Jabalia and Rafah, carrying out what it called “precise operations against terrorists and infrastructure”.\nGantz said his proposal would include creating a temporary U.S.-European-Arab-Palestinian system of civil administration for Gaza while Israel retains security control.\nDefence Minister Yoav Gallant on Wednesday demanded clarity on post-war plans and for Netanyahu to forswear any military reoccupation of Gaza.\nIsrael’s military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20.", "location": "Gaza.", "classification": "security", "score": 0.7014706124079673, "event_breakdown": "Security Events:\n\n1. Israel has renewed military sweeps of northern Gaza in January.\n2. Israeli military continued to operate in areas of Gaza, including Jabalia and Rafah, with continued precision operations against terrorists and infrastructure.\n3. Israel Defence Minister Gantz proposed a plan to create a U.S.-European-Arab-Palestinian system of civil administration in Gaza with Israel retaining security control.\n4. Israel has called all cabinet ministers to a meeting at 7:00 p.m. (1700 GMT) on Thursday to urgently discuss the matter. Defence Minister Gallant demanded clarity on post-war plans.\n5. Israeli military said 281 soldiers had been killed in fighting since the first ground incursions in Gaza on Oct 20."}, {"id": "1fd87f8f-75bd-4ad8-8a90-80eaa95778b6", "title": "Member of Israel War Cabinet says hell quit the government June 8 unless there a new war plan | Nation and World", "date": "2024-05-18 20:45", "url": "https://www.reviewjournal.com/news/nation-and-world/member-of-israels-war-cabinet-says-hell-quit-the-government-june-8-unless-theres-a-new-war-plan-3053253/", "message": "Benny Gantz, a member of Israel’s three-man War Cabinet, has threatened to resign from the government if it doesn’t adopt a new plan for the war in Gaza.\n(Gil Cohen-Magen/Pool Photo via AP)Benny Gantz, a key member of Israel's War Cabinet and the top political rival of Israeli Prime Minister Benjamin Netanyahu, leaves a meeting in the office of Senate Minority Leader Mitch McConnell, R-Ky., at the Capitol in Washington, Monday, March 4, 2024.\nGantz, a centrist politician and longtime political rival of Netanyahu, joined his coalition and the War Cabinet in the early days of the war.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nThe Israeli offensive has killed more than 35,000 Palestinians in Gaza, according to the Hamas-run Health Ministry in Gaza.", "location": "GAZA", "classification": "security", "score": 0.61496914547319, "event_breakdown": "Events:\n* Gaza is currently occupied by Israel.\n* around 100 hostages, along with the bodies of around 30 more, are currently captive in Gaza.\n* More than 35,000 Palestinians have been killed in Gaza during the Israeli offensive."}, {"id": "5c8c6d88-1afb-4d27-aca6-c9003a9e38c4", "title": "I masterminded the plot to blow up Lord Mountbatten", "date": "2024-05-18 22:00", "url": "https://www.dailymail.co.uk/news/article-13433877/ex-ira-michael-hayes-lord-mountbatten-king-charles.html", "message": "In an astonishing admission set to cause huge pain to Charles, Michael Hayes callously boasted that he designed the explosive device that killed Lord Mountbatten, and masterminded the atrocity.\nBut now, after being approached by a MoS reporter, Hayes has bragged: 'I blew up Earl Mountbatten.'\nHayes said that he did not regret killing Lord Mountbatten and coldly described the two teenage boys who died as 'casualties of war'.\nPictured: Part of the wreakage of Lord Mountbattens boat the Shadow V, circa August 1979The brutal killing of Lord Mountbatten, who was affectionately known as 'Uncle Dickie' by the Royal Family, affected Charles deeply.\nBut when asked if he feared prosecution, Hayes said: 'No, I fought a war, I was justified.'", "location": "Ireland", "classification": "security", "score": 0.9052691365816735, "event_breakdown": "1979: Assassination of Lord Mountbatten by explosion."}, {"id": "c7e309d8-4ebf-4a78-b225-86730aa831bc", "title": "Yemen Houthi terrorists launch a missile that strikes an oil tanker in the Red Sea , U . S . military says | Nation and World", "date": "2024-05-18 20:45", "url": "https://www.reviewjournal.com/news/nation-and-world/yemens-houthi-terrorists-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-3053264/", "message": "Yemen’s Houthi terrorists hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel, officials said.\n(AFP via Getty Images/TNS)DUBAI, United Arab Emirates — Yemen’s Houthi terrorists hit an oil tanker in the Red Sea with a ballistic missile early Saturday, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nThe attack around 1 a.m. struck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nThey described the drone as “carrying out hostile actions” in Yemen’s Marib province, which remains held by allies of Yemen’s exiled, internationally recognized government.", "location": "-\nNULL", "classification": "security", "score": 0.670396820181732, "event_breakdown": "1. Houthi terrorists in Yemen hit a Panama-flagged, Greek-owned oil tanker with ballistic missiles in the Red Sea, damaging the ship."}, {"id": "f1fd0db1-568b-4208-8d95-30662a4488a2", "title": "Week in Review : FPL plant explosion , semi fire dumps fuel , dog attacked by gator", "date": "2024-05-18 20:30", "url": "https://cbs12.com/news/instagram/week-in-review-martin-county-fire-rescue-train-at-fpl-plant-explosion-occurred-semi-truck-dumps-100-gallons-of-fuel-brady-the-dog-attacked-by-gator-florida-may-18-20224", "message": "Martin County Fire Rescue regularly train at FPL plant, where explosion occurredINDIANTOWN, Fla. (CBS12) — Three people were injured after a fire and explosion at Florida Power and Light's Martin Power Plant Thursday night.\n“A call of this caliber, we train actually, regularly, out at FP&L plant.\nPBCFR firefighters had been called to the scene around 12:30 p.m. after learning about the semi fire, its statement explained.\nJuvenile killed in Riviera Beach shooting, police continue search for suspectRIVIERA BEACH, Fla. (CBS12) — Detectives are investigating a shooting that killed a juvenile male on Wednesday afternoon in Riviera Beach.\nDog recovers after being 'viciously attacked' by alligator in Palm Beach CountyLAKE WORTH BEACH, Fla. (CBS12) — A dog is down to three legs after it was viciously attacked by an alligator last week in Palm Beach County.", "location": "FLORIDA", "classification": "security", "score": 0.9248999887946656, "event_breakdown": ".\nHere are the security events in the following list:\n1.Lotsomer explosion fire at Florida Power and Light's Martin Power Plant last night. 2010.\n2.OCAS Martin County Fire Rescue members were tending to the burnt-out car and all that was left charred.\n3.The juvenile was shot and killed on Wednesday afternoon in Riviera Beach."}, {"id": "60f2d154-bd18-4721-8d83-e7441a3dfd61", "title": "Israel army says body of one hostage retrieved from Gaza", "date": "2024-05-18 21:00", "url": "https://www.yahoo.com/news/israel-army-says-body-one-194906446.html", "message": "A protester carries a menorah as relatives and supporters of Israeli hostages in Gaza demonstrate in Tel Aviv (JACK GUEZ)The Israeli army said Saturday that troops had retrieved the body of hostage Ron Benjamin from the war-torn Gaza Strip after he was \"murdered\" during the October 7 Hamas attack.\nBenjamin was \"murdered during the October 7th massacre at the Mefalsim intersection, and his body was abducted to Gaza by Hamas militants\", the military said in a separate statement.\nFighters from Hamas crossed over from Gaza and killed more than 360 people at the festival, Israeli officials have said.\nOut of the 252 people taken hostage that day, 124 are still being held inside the Gaza Strip, including 37 the army says are dead.\n\"As days go, we see more and more hostages are returning in body bags and more soldiers are being killed in Gaza,\" said Yotam Cohen, whose brother Nimrod is captive in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9535335819353136, "event_breakdown": "* October 7 massacre at the Mefalsim intersection\n* Israeli troops retrieve Ron Benjamin's body from the Gaza Strip\n* 252 hostages were taken by Hamas fighters during the attack, of which 124 are still being held."}, {"id": "953c3baa-b1a1-4782-b841-4c6ee12699a2", "title": "Israel army says body of one hostage retrieved from Gaza", "date": "2024-05-18 23:30", "url": "https://www.al-monitor.com/originals/2024/05/israel-army-says-body-one-hostage-retrieved-gaza", "message": "May 18, 2024 — Jerusalem (AFP)The Israeli army said Saturday that troops had retrieved the body of hostage Ron Benjamin from the war-torn Gaza Strip after he was \"murdered\" during the October 7 Hamas attack.\nBenjamin was \"murdered during the October 7th massacre at the Mefalsim intersection, and his body was abducted to Gaza by Hamas militants\", the military said in a separate statement.\nFighters from Hamas crossed over from Gaza and killed more than 360 people at the festival, Israeli officials have said.\nOut of the 252 people taken hostage that day, 124 are still being held inside the Gaza Strip, including 37 the army says are dead.\n\"As days go, we see more and more hostages are returning in body bags and more soldiers are being killed in Gaza,\" said Yotam Cohen, whose brother Nimrod is captive in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9519810772137871, "event_breakdown": "- On October 7, 2024, Hamas militants carried out a massacre at a festival in Israel, killing more than 360 people.\n- Fighters from Hamas abducted Israeli citizen Ron Benjamin to the Gaza Strip during the massacre.\n- The Israeli army retrieved Benjamin's body from the Gaza Strip on May 18, 2024, after he was \"murdered\" during the October 7 Hamas attack."}, {"id": "8b866b10-92b7-46ee-a48a-2e3f74237fe7", "title": "Zelensky expects Russian offensive in northeast Ukraine to intensify", "date": "2024-05-18 17:00", "url": "https://www.gjsentinel.com/news/national/zelensky-expects-russian-offensive-in-northeast-ukraine-to-intensify/article_3a75a935-0879-54d9-a187-86614eaad626.html", "message": "Map of northeastern Ukraine showing the frontline in the Kharkiv region and the Russian advances between May 10 and 16", "location": "The main location where the main event takes place appears to be the Kharkiv region, specifically the area to the east of the city of Khar", "classification": "security", "score": 0.7062610858568569, "event_breakdown": "From May 10 to 16:\n- Russian forces launched a renewed offensive in the Kharkiv region, advancing as far as 20 kilometers in some areas.\n- Fighting continued in the Donbas as Russian forces made gains in the Kharkiv and Donetsk regions.\n- There was a Russian offensive in the Donbas region, where Russian forces have made some territorial gains.\n- Fighting continued in the Kharkiv region, with Russian forces making gains in some areas."}, {"id": "40d1c582-baa8-400e-a928-879f065871a9", "title": "Israeli strike kills Palestinian militant , wounds eight", "date": "2024-05-18 00:45", "url": "https://www.rte.ie/news/world/2024/0517/1449864-israel-strike-militant/", "message": "A Palestinian militant was killed, and eight other people wounded in an Israeli air strike on the Jenin refugee camp in the occupied West Bank, the Palestinian health ministry and Israeli military said.\nThe armed wing of the Palestinian Islamic Jihad (PIJ) group named the killed man as member Islam Khamayseh.\nThe Palestinian health ministry said the eight wounded people were in stable condition and receiving treatment at hospitals.\nThe Israeli military said a fighter jet and helicopter conducted the strike, a rarity in the West Bank, where violence had been surging long before the Gaza war.\nThe West Bank is among territories Israel seized in a 1967 Middle East war.", "location": "JERUSALEM", "classification": "security", "score": 0.9806779516174781, "event_breakdown": "Security Event: Israeli air strike in Jenin refugee camp, West Bank\nSecurity Event: Palestinian militant named Islam Khamayseh killed by Israeli air strike in West Bank"}, {"id": "24d588f2-809e-40d7-b11e-3cbcc3d58f85", "title": "American doctors in Gaza see up - close toll of war weapons on children", "date": "2024-05-18 17:30", "url": "http://thepeninsulaqatar.com/article/18/05/2024/american-doctors-in-gaza-see-up-close-toll-of-war-weapons-on-children", "message": "Palestinians walk outside the European hospital in Khan Yunis in the southern Gaza Strip on May 17, 2024.\nThe strikes have also reduced to rubble the homes of Gaza medical students and staffers at the hospital, further reducing the ranks as locals are forced to evacuate or move their families to safety.\nThe White House continues to struggle with condemning Israel’s attacks on Gaza, which have killed civilians, humanitarian aid workers and journalists.\n\"I owe a great debt to Dr. Hamawy,” Duckworth later said in a statement to The Post.\nWhen Duckworth learned that Hamawy was trapped in Gaza, she quickly got his phone number and said she remains in close contact with him.", "location": "GAZA", "classification": "security", "score": 0.8236086285869652, "event_breakdown": "1. Gaza hit by airstrikes, reducing homes to rubble\n2. Gaza hit by airstrikes, further reducing the ranks as locals are evacuated or relocated.\n3. White House continues to struggle with condemning Israel's attacks on Gaza.\n4. Israel's attacks have killed civilians, humanitarian aid workers and journalists.\n5. Gaza hit by airstrikes, reducing debris-laden medical centers and residences to rubble.\n6. \"I owe a great debt to Dr. Hamawy,” Duckworth later said in a statement to The Post. \n7. Duckworth quickly obtained Hamawy's phone number and remains in steady contact with him."}]