[{"id": "0d2f0a0c-a8b3-4dd4-a66f-857bd95cf25a", "title": "Antisemitism Report : Anti - Jewish hate goes from bad to worse in 2023", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-799850", "message": "“October 7 helped spread a fire that was already out of control,” the report stated.\nAustralia in particular recorded 622 antisemitic incidents in October and November 2023, in comparison to 79 during the same period in 2022.\n“Israel does not have a meaningful strategic plan for combating antisemitism that is based on the needs of Jewish communities.\nFighting antisemitism is failingTHE IMPOSSIBILITY of reliably tracking antisemitic incidents in Russia at present was discussed in the report as well.\n“Two years ago, this report stated that the fight against antisemitism was failing.", "location": "Australia", "classification": "antisemitism", "score": 0.909906376794986, "event_breakdown": "- October 7: Spread of a fire in an unspecified location\n- Australia: Recorded 622 antisemitic incidents in October and November 2023\n- Israel: Lack of a meaningful strategic plan for combating antisemitism\n- Fighting antisemitism: Failure in tracking antisemitic incidents in Russia\n- Unspecified location: Report stating the failure of the fight against antisemitism two years ago"}, {"id": "ce814e8b-9a12-4588-864b-3b73edf6bd39", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war – Winnipeg Free Press", "date": "2024-05-06 15:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/faith/2024/05/06/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war", "message": "The October attack unleashed a war that has led to a high number of Palestinian deaths, fueling pro-Palestinian protests that have swept U.S. campuses.\nMany Jewish students have felt intimidated by protests, which have at times included antisemitic tropes and calls for anti-Jewish violence.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9784213866996225, "event_breakdown": "- The October attack leading to war and Palestinian deaths, sparking pro-Palestinian protests\n- Protests causing intimidation of Jewish students and including antisemitic tropes and calls for violence\n- Preservation of former death camps as memorials by the Polish state\n- Annual event drawing thousands of participants, including Holocaust survivors and Jewish students, leaders, and politicians\n- Judith Tzamir, a Holocaust survivor from Germany, visiting Auschwitz after long avoidance"}, {"id": "0697d692-01bb-4c5e-8980-c55c13d4eb73", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war", "date": "2024-05-06 16:00", "url": "https://isp.netscape.com/news/world/story/0001/20240506/a7996e224bb4be1c76059b6fafbbd19d", "message": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel-Hamas warOSWIECIM, Poland (AP) — U.S. university presidents joined Holocaust survivors and thousands of Israelis on Monday for the March of the Living, a yearly memorial march at the site of Auschwitz that honors the 6 million Jews killed by Nazi Germany and celebrates the state of Israel.\nThe October attack unleashed a war that has led to a high number of Palestinian deaths, fueling pro-Palestinian protests that have swept U.S. campuses.\nMany Jewish students have felt intimidated by protests, which have at times included antisemitic tropes and calls for anti-Jewish violence.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "OSWIECIM", "classification": "antisemitism", "score": 0.9386208274535295, "event_breakdown": "- Yearly memorial march at former death camp at Auschwitz overshadowed by Israel-Hamas war\n- U.S. university presidents, Holocaust survivors, and thousands of Israelis participate in the March of the Living\n- The October attack leads to a high number of Palestinian deaths and sparks pro-Palestinian protests on U.S. campuses\n- Jewish students feel intimidated by protests, which have included antisemitic tropes and calls for anti-Jewish violence\n- Former death camps in the area preserved as memorials by the Polish state\n- Holocaust survivor Judith Tzamir from Germany, who moved to Israel in 1964, visits Auschwitz for the first time"}, {"id": "f986326c-9e5a-472d-b0ef-612812b71f3b", "title": "At U . of C . encampment , Jewish organizers explain significance of their anti - Zionist Shabbat service", "date": "2024-05-05 23:00", "url": "https://www.yahoo.com/news/u-c-encampment-jewish-organizers-222300552.html", "message": "But in interviews with a half-dozen or more Jewish students and affiliated faculty members within the pro-Palestine encampment at the U. of C., none of them said they felt anything resembling antisemitism within the camp.\nAccording to messages with a Jewish organizer at DePaul’s encampment, a similar Shabbat service was held within the encampment on their campus.\nAt Shabbat time, she entered the encampment to pray with the students and organizers.\nEncampment organizers are, for the most part, supportive of the demands of the Boycott, Divestment, Sanctions movement, but many matzo brands, including Manischewitz, produce some of their goods in Israel.\nFor the most part, the organizers in the encampment wish things were different with their families; but that won’t stop them from protesting.", "location": "DePaul's campus", "classification": "antisemitism", "score": 0.7810662660304113, "event_breakdown": "- Shabbat service held within the pro-Palestine encampment at the University of Chicago\n- Jewish organizer participating in a Shabbat service at DePaul’s encampment\n- Entrance of a woman into the encampment to pray with students and organizers\n- Support of the Boycott, Divestment, Sanctions movement by encampment organizers\n- Matzo brands, like Manischewitz, producing goods in Israel\n- Encampment organizers expressing support for protesting despite familial differences"}, {"id": "ecb9d20d-df9d-40bb-ab95-81a08010a2fa", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 20:30", "url": "https://www.thisisoxfordshire.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\"", "location": "Oxford", "classification": "antisemitism", "score": 0.9518249232346063, "event_breakdown": "- Initiation of March of Life in Germany in 2007\n- Public memorial event in Bonn Square following the procession\n- Annual processions as a platform for Holocaust survivors, reconciliation, and rallying against present-day antisemitism\n- Christian community in Oxford starting from the mediaeval Jewish cemetery outside the Botanic Garden, walking up High Street, and concluding the march at Bonn Square\n- First time event held in Oxford with hopes of becoming an annual fixture\n- Solidarity with the Jewish community against increasing hatred at home and abroad"}, {"id": "6609aac9-4eee-4d19-adbb-9f18a3c75611", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 21:15", "url": "https://www.smh.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”", "location": "The main location where the main event takes place is \"The University of Melbourne\" student encampment.", "classification": "antisemitism", "score": 0.830386738260159, "event_breakdown": "- University of Melbourne student encampment protesting the war in Gaza\n- Statement emphasizing limits on freedom of speech and condemning bullying and intimidation\n- Tutor advising a student to skip class due to discomfort with the encampment\n- Dutton's argument that the protests are racist and Jews are targeted unfairly\n- Emphasis on not preemptively shutting down free speech, debate, and the right to protest"}, {"id": "2c751600-f276-40bd-b418-2db457905041", "title": "Hope of Israel Congregation in Roanoke educates during annual Holocaust Remembrance service", "date": "2024-05-06 04:00", "url": "https://www.wsls.com/news/local/2024/05/06/hope-of-israel-congregation-in-roanoke-educates-during-annual-holocaust-remembrance-service/", "message": "ROANOKE, Va. – Dozens gathered at the Hope of Israel Congregation for their annual holocaust remembrance event.\nIt was an event that was held two weeks after Passover to remember and reflect on the horror of the Holocaust.\nIn the flicker of candlelight, heavy hearts gathered at Hope of Israel Congregation in Roanoke to honor the roughly 6 million people killed during the Holocaust.\nYou’ll see people of all ages here, and it’s important for us to never forget,” Maynard Keller, Elder at Hope of Israel Congregation, said.\nSamuel Cox, a Holocaust historian, shared stories of Holocaust survivors he has spoken with over the years.", "location": "", "classification": "antisemitism", "score": 0.7930485491019857, "event_breakdown": "- Dozens gathered at Hope of Israel Congregation in Roanoke for their annual holocaust remembrance event\n- Event was held two weeks after Passover to remember and reflect on the horror of the Holocaust\n- Heavy hearts gathered at Hope of Israel Congregation to honor the roughly 6 million people killed during the Holocaust\n- Maynard Keller, Elder at Hope of Israel Congregation, emphasized the importance of never forgetting the Holocaust\n- Samuel Cox, a Holocaust historian, shared stories of Holocaust survivors he has spoken with over the years"}, {"id": "ef40affa-93eb-4261-9dfc-b5473f904781", "title": "In lead - up to Yom HaShoah , Oporto Jewish community teaches the evolution of Antisemitism to schoolchildren", "date": "2024-05-05 00:30", "url": "https://ejpress.org/in-lead-up-to-yom-hashoah-oporto-jewish-community-teaches-the-evolution-of-antisemitism-to-schoolchildren/", "message": "800 Portuguese schoolchildren visited the Holocaust Museum of Oporto on Friday to learn about the Holocaust and the evolution of Antisemitism throughout the centuries that led to the annihilation of Six Million Jews and continues today.\n“In this museum, we press the importance of having the children and teenagers asking how it was possible for this unspeakable tragedy to take place,” said Gabriel Senderowicz, the President of the Oporto Jewish community that built and runs the museum.\nIt focuses on the general public, especially youths and schoolchildren, and invests in education, professional training for educators, promoting exhibitions, and supporting research.\nDavid Garrett, a jurist who is a board member of the Jewish community of Oporto, highlighted that “a genocide can be national or local and kill millions, thousands or even dozens of people.\nCredit: Jewish Community of Oporto", "location": "Oporto", "classification": "antisemitism", "score": 0.9717489477710876, "event_breakdown": "- 800 Portuguese schoolchildren visited the Holocaust Museum of Oporto to learn about the Holocaust and the evolution of Antisemitism\n- Gabriel Senderowicz, the President of the Oporto Jewish community, emphasized the importance of educating children about the Holocaust\n- The museum focuses on the general public, particularly youth and schoolchildren, by investing in education, professional training for educators, exhibitions, and research\n- David Garrett, a jurist and board member of the Jewish community of Oporto, discussed the different scales of genocide during a visit to the museum"}, {"id": "f78113d5-dd1d-4c05-9f71-d887debf3d36", "title": "Jailed students , a canceled commencement , angry parents : USC Carol Folt takes on critics", "date": "2024-05-06 04:45", "url": "https://arrobajuarez.com/2024/05/06/jailed-students-a-canceled-commencement-angry-parents-uscs-carol-folt-takes-on-critics/", "message": "To dozens of Japanese American ex-students unjustly incarcerated during World War II, then later denied reentry to the university, Folt awarded honorary degrees.\n(Genaro Molina / Los Angeles Times)Citing unspecified safety threats, Folt rescinded pro-Palestinian valedictorian Asna Tabassum’s speaking slot in USC’s main commencement ceremony.\nLast week, Folt canceled the “main stage” commencement ceremony altogether, depriving students and their families of a treasured ritual.\nIn balancing campus safety and the right to protest with concerns about antisemitism and anti-Muslim hatred, Folt was bound to take criticism from all directions.\nProtesters are detained by LAPD officers at the USC campus on April 24.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.8221430738197252, "event_breakdown": "1. Japanese American ex-students unjustly incarcerated during World War II awarded honorary degrees.\n2. Asna Tabassum's speaking slot in USC's main commencement ceremony rescinded due to unspecified safety threats.\n3. \"Main stage\" commencement ceremony canceled, depriving students and families of a treasured ritual.\n4. Folt faces criticism from all directions for balancing campus safety, right to protest, and concerns about antisemitism and anti-Muslim hatred.\n5. LAPD detains protesters at the USC campus on April 24."}, {"id": "bd527179-7999-49bd-9182-36c8c0933f13", "title": "Beyond bullets and bombs : Lessons of faith , pragmatism , and survival from the vilna g", "date": "2024-05-04 23:45", "url": "https://www.ynetnews.com/article/rj78izvfc", "message": "The diaries of Zelig Kalmanovich, a prominent Jewish scholar in the Vilna Ghetto, offer a glimpse into the agonizing choices faced by individuals trapped within Nazi tyranny.\n3 View gallery Jews in the Vilna Ghetto ( Photo: The Association of Jews from Vilna and Vicinity in Israel )Vilna was once a vibrant center of Jewish life and learning.\nVilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\nHe championed the ghetto's schools, synagogues, and libraries, viewing them as battlegrounds for the preservation of Jewish identity and a continuation of Jewish history.\nThe perspective of the long Jewish history is essential in analyzing the current events.", "location": "Vilna", "classification": "antisemitism", "score": 0.8974516408212561, "event_breakdown": "1. Vilna was once a vibrant center of Jewish life and learning.\n2. Vilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\n3. Zelig Kalmanovich championed the ghetto's schools, synagogues, and libraries as battlegrounds for the preservation of Jewish identity and continuation of Jewish history."}, {"id": "a93e1b49-14e8-4c74-88e0-4776d856458e", "title": "Stewart Weiss on Holocaust Remembrance Day amid student protests", "date": "2024-05-05 02:00", "url": "https://www.jpost.com/opinion/article-799536", "message": "The week(s) ahead offer both tears and cheers as they lead us once again into the modern “Yom” holidays: Yom Hashoah, Yom Hazikaron, and Yom Ha’atzmaut (and later, Yom Yerushalayim).\nDangerous times: Antisemitism and anti-Israel protestsWe live in a dangerous world at a dangerous time, with equal parts ignorance and evil surrounding us.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City on Tuesday.\nTragically, there is no shortage of un-Jewish Jews who have joined together with the antisemitic mob, helping to add credence to their crusade.\nThis, he said, was an attempt of the prisoners to gain a false sense of empowerment by “joining” with their persecutors.", "location": "", "classification": "antisemitism", "score": 0.9250844478775154, "event_breakdown": "- Anti-Semitic and anti-Israel protests escalate, exemplified by a student waving a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City.\n- Un-Jewish Jews join the anti-Semitic mob, fueling their crusade.\n- Prisoners attempt to gain a false sense of empowerment by \"joining\" with their persecutors."}, {"id": "6e3d924e-8a0b-4553-ab81-f7b238c34d97", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-mark-history-differently-after-horrors-oct-109936441", "message": "KIBBUTZ MEFALSIM, Israel -- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "", "classification": "antisemitism", "score": 0.9866395318761043, "event_breakdown": "- Hamas fighters invaded southern Israel on Oct. 7, perpetrating the deadliest attack on Jews since the Holocaust\n- Holocaust Remembrance Day begins on Sunday evening in Israel, carrying a heavier weight this year for many Jews\n- Holocaust Remembrance Day event, in its 36th year, usually draws thousands of participants including Holocaust survivors, Jewish students, leaders, and politicians\n- The Oct. 7 attack brought up memories of childhood trauma for Tzamir"}, {"id": "e6712d4e-e101-415d-b14b-db474ada0b7b", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7 – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9612619689091397, "event_breakdown": "- Judith Tzamir, a Holocaust survivor, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel\n- Judith Tzamir will join 55 other Holocaust survivors for the March of the Living in Poland\n- Hamas fighters invaded southern Israel on Oct. 7, perpetrating the deadliest attack on Jews since the Holocaust."}, {"id": "ce318fd2-58f4-41c7-b528-603e71503c4b", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "https://www.clickorlando.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "Poland", "classification": "antisemitism", "score": 0.9289982583346631, "event_breakdown": ""}, {"id": "d47fdcb8-3ed5-4006-9ec0-53ea5e6cd7db", "title": "Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-06 06:15", "url": "https://www.theday.com/nation/20240506/holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Mefalsim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "Kibbutz Mefalsim", "classification": "antisemitism", "score": 0.9289982583346631, "event_breakdown": ""}, {"id": "76b1f6a6-16b8-4dbb-8a7e-41050a785092", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:00", "url": "https://www.newsday.com/news/nation/Israel-Poland-Holocaust-Gaza-march-Auschwitz-h48121", "message": "KIBBUTZ MEFALSIM, Israel — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nHamas militants poured over the border from Gaza and attacked towns, army bases and a music festival in southern Israel.", "location": "", "classification": "antisemitism", "score": 0.7350370049431462, "event_breakdown": "null"}, {"id": "efbb5edf-4e87-4418-97f5-00bf869961bb", "title": "A Holocaust Survivor Will Mark That History Differently after the Horrors of Oct . 7", "date": "2024-05-05 08:45", "url": "https://www.newsmax.com/world/globaltalk/israel-poland-holocaust-gaza-march-auschwitz/2024/05/05/id/1163510/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9866395318761043, "event_breakdown": ""}, {"id": "02479094-946d-46ad-9e99-9cb7c93d9d23", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:45", "url": "https://www.kob.com/news/us-and-world-news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel.", "location": "Kibbutz Mefalsim, Israel", "classification": "antisemitism", "score": 0.9590549156824396, "event_breakdown": "1. Hamas fighters invade southern Israel on Oct. 7, resulting in the deadliest attack on Jews since the Holocaust.\n2. The annual memorial march called March of the Living is held in Poland, with 55 Holocaust survivors from Israel and around the world participating.\n3. Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel.\n4. Thousands of participants, including Holocaust survivors, Jewish students, leaders, and politicians, gather for an event in its 36th year."}, {"id": "35fad1d7-b052-46df-84e9-a3032714f477", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wfmz.com/news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_e8f14bc4-6d3a-595d-af45-a5281e1aec28.html", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM, Israel", "classification": "antisemitism", "score": 0.9866395318761043, "event_breakdown": "null"}, {"id": "c3b39322-92be-455d-9c4f-dca63f2403af", "title": "Holocaust Survivor Finds Solace in Retelling Story in Wake of Recent Tragedy", "date": "2024-05-05 07:00", "url": "https://www.devdiscourse.com/article/law-order/2927949-holocaust-survivor-finds-solace-in-retelling-story-in-wake-of-recent-tragedy", "message": "When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year's Holocaust Remembrance Day, which begins Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nTzamir, whose kibbutz fended off Hamas attackers Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates 132,000 Holocaust survivors live in Israel.", "location": "", "classification": "antisemitism", "score": 0.9797381691872994, "event_breakdown": "- Hamas fighters invaded southern Israel on Oct. 7, perpetrating the deadliest attack on Jews since the Holocaust\n- Holocaust Remembrance Day begins Sunday evening in Israel with a heavier weight than usual for many Jews around the world\n- Tzamir's kibbutz fended off Hamas attackers on Oct. 7\n- Tzamir will join 55 other Holocaust survivors from around the world and about 10,000 others in the March of the Living\n- The March of the Living event, now in its 36th year, usually draws thousands of participants including Holocaust survivors and Jewish students, leaders, and politicians\n- 132,000 Holocaust survivors estimated to live in Israel"}, {"id": "6420f2fc-e776-4924-a7e9-68b1e08cf5e8", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 11:30", "url": "https://isp.netscape.com/news/world/story/0001/20240505/492eab9a3b95de64602ccdec863f1b37", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM", "classification": "antisemitism", "score": 0.9866473197797783, "event_breakdown": ""}, {"id": "b6af6bba-99fb-4efc-995b-c17de77146f7", "title": "San Diego Jewish leaders host Holocaust commemoration in La Jolla", "date": "2024-05-06 04:15", "url": "https://www.nbcsandiego.com/news/local/holocaust-commemoration-la-jolla-san-diego/3507128/", "message": "The Jewish Federation of San Diego and the Lawrence Family Jewish Community Center hosted their annual Holocaust commemoration in La Jolla on Sunday.\n“It’s important that we tell the stories and that we remember the Holocaust,” Heidi Gantwerk, president and CEO of the Jewish Federation of San Diego, said.\nGet San Diego local news, weather forecasts, sports and lifestyle stories to your inbox.\nSign up for NBC San Diego newsletters.\nLocal leaders are continuing their effort to combat antisemitism and Holocaust denial, according to event organizers.", "location": "La Jolla", "classification": "antisemitism", "score": 0.9402002161100587, "event_breakdown": "- The Jewish Federation of San Diego and the Lawrence Family Jewish Community Center hosted their annual Holocaust commemoration in La Jolla on Sunday.\n- Heidi Gantwerk, president and CEO of the Jewish Federation of San Diego, emphasized the importance of telling Holocaust stories and remembering the tragedy.\n- Local leaders are working to combat antisemitism and Holocaust denial, as mentioned by event organizers."}, {"id": "e19c2c80-4193-49c3-9124-9f08648506b5", "title": "Tech becomes teaching tool on Israel Holocaust remembrance day", "date": "2024-05-05 17:45", "url": "https://nocamels.com/2024/05/tech-becomes-teaching-tool-on-israels-holocaust-remembrance-day/", "message": "In Israel, Holocaust Remembrance Day for 2024 begins at sundown on May 5.\nThe first evening sees memorial services being held across the country, with a central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem.\nFlags are flown at half mast in Israel to mark Holocaust Remembrance Day (Joel Goldberg/Wikimedia Commons)The following morning is punctuated by a siren at 10am, which wails throughout Israel for two minutes in memory of the victims.\nAnd according to Zikaron BaSalon, the event is attended annually by around 2 million people across the country.\n“But this year was particularly painful – none of the Holocaust survivors we met even imagined that the horrific memories of the Holocaust would resurface, and this time in their own home.”", "location": "The main location of the event is Jerusalem, specifically at the Yad Vashem World Holocaust Remembrance Center.", "classification": "antisemitism", "score": 0.7877177970065752, "event_breakdown": "- Holocaust Remembrance Day for 2024 begins at sundown on May 5 in Israel\n- Memorial services held across Israel, including a central remembrance ceremony at Yad Vashem World Holocaust Remembrance Center in Jerusalem\n- Flags flown at half mast in Israel to mark Holocaust Remembrance Day\n- Siren wails at 10am throughout Israel for two minutes in memory of the victims\n- Around 2 million people attend the event annually in Israel, as stated by Zikaron BaSalon"}, {"id": "e834fa36-f29e-4ffa-8b40-0f96992d069e", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://www.mymotherlode.com/news/world/3352547/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7.html", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7 View PhotoKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim.", "location": "KIBBUTZ MEFALSIM, Israel", "classification": "antisemitism", "score": 0.9866473197797783, "event_breakdown": "- Hamas fighters invaded southern Israel on Oct. 7, perpetrating the deadliest attack on Jews since the Holocaust\n- Holocaust Remembrance Day begins on Sunday evening in Israel\n- The event is in its 36th year and usually draws thousands of participants, including Holocaust survivors, Jewish students, leaders, and politicians\n- The Oct. 7 attack brought up memories of childhood trauma for some, such as Tzamir"}, {"id": "64338c7a-f18c-4996-9d1b-71d1ed502988", "title": "Holocaust Remembrance Week Complicated By the Israel War with Hamas and a Growing Anti - Semitic Problem | Newstalk Florida", "date": "2024-05-06 05:45", "url": "https://www.newstalkflorida.com/featured/holocaust-remembrance-week-complicated-by-the-israel-war-with-hamas-and-a-growing-anti-semitic-problem/", "message": "Eighty-five years ago marked the beginning of World War II; the Holocaust had already commenced prior to this, and the implementation of the Nazi’s Final Solution plan took place in 1942.\nIn 2023, the world experienced an alarming surge in anti-Semitism, a phenomenon unparalleled since the conclusion of World War II.\nLet’s delve into the key findings from the report:Incident Surge: In 2023, ADL tabulated 8,873 antisemitic incidents across the United States.\nBetween October 7 and the end of 2023, ADL documented , surpassing the total for the entire year of 2022.\nExcluding these incidents, ADL tabulated 7,523 incidents, a 103% increase from 2022.", "location": "The main location where the main event takes place is: 'United States'.", "classification": "antisemitism", "score": 0.8157175642217862, "event_breakdown": "- The beginning of World War II (85 years ago)\n- The commencement of the Holocaust\n- Implementation of the Nazi's Final Solution plan in 1942\n- An alarming surge in anti-Semitism worldwide in 2023\n- ADL tabulating 8,873 anti-Semitic incidents across the United States in 2023\n- ADL documenting an increase in incidents between October 7 and the end of 2023\n- ADL tabulating 7,523 incidents excluding those related to a specific time period, indicating a 103% increase from 2022."}, {"id": "85a036a9-2189-49fc-b8df-b3e032f01e8d", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "http://www.middletownpress.com/news/world/article/a-holocaust-survivor-will-mark-that-history-19440012.php", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/AP Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nMaya Alleruzzo/APKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.", "location": "The main location where the main event takes place is Kibbutz Meflasim, southern Israel.", "classification": "antisemitism", "score": 0.821799420364865, "event_breakdown": "1. Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel - May 3, 2024.\n2. Judith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel - May 3, 2024.\n3. Hamas fighters invade southern Israel - October 7, (year not specified).\n4. The militant group ruling Gaza Strip perpetrates the deadliest attack on Jews since the Holocaust during the invasion of southern Israel.\n5. An annual event, now in its 36th year, usually drawing thousands of participants, including Holocaust survivors and Jewish students, leaders, and politicians (specific date not mentioned)."}, {"id": "b67cfb9e-02a9-47dc-a7af-d7859bb15816", "title": "Child survivor , U . S . senator speak at Holocaust Remembrance Day event", "date": "2024-05-06 15:00", "url": "https://www.gpb.org/news/2024/05/06/child-survivor-us-senator-speak-at-holocaust-remembrance-day-event", "message": "About 500 people, including U.S. Sen. Jon Ossoff, Deputy Consul General of Israel Anna Shteingart, a handful of state and local politicians, and dozens of Jewish community leaders gathered at Greenwood Cemetery in Southwest Atlanta today to mark Yom HaShoah, Holocaust Remembrance Day.\nThe 59th annual ceremony was also a rededication of the Memorial to the Six Million, which has recently undergone a complete renovation led by Landmark Preservation with help from the Atlanta Preservation Center.\nChild survivor address antisemitismGeorge Rishfeld, a child survivor of the Holocaust, was a toddler when his parents handed him over to the Fronckvics, a Catholic family with whom Rishfeld lived for three years.\nThey saw me as a human being and not as a Jew.” Both of his parents also survived the war.\nWe need to challenge hateful statements and occurrences strongly and immediately.” — George Rishfeld, Holocaust survivorThis story comes to GPB through a reporting partnership with Rough Draft Atlanta.", "location": "Greenwood Cemetery, Southwest Atlanta", "classification": "antisemitism", "score": 0.6739605332116837, "event_breakdown": "- About 500 people gathered at Greenwood Cemetery in Southwest Atlanta to mark Yom HaShoah, Holocaust Remembrance Day\n- U.S. Sen. Jon Ossoff, Deputy Consul General of Israel Anna Shteingart, state and local politicians, and Jewish community leaders were present\n- The ceremony was a rededication of the Memorial to the Six Million after a renovation led by Landmark Preservation and the Atlanta Preservation Center\n- George Rishfeld, a child survivor of the Holocaust, spoke about his experiences and the need to challenge antisemitism"}, {"id": "3b61b7e4-31f3-4255-96b6-74771604d76c", "title": "The past three days at GW Gaza solidarity encampment", "date": "2024-05-05 02:30", "url": "https://georgetownvoice.com/2024/05/04/the-past-three-days-at-gws-gaza-solidarity-encampment/", "message": "Over a week ago, a coalition of students from universities across D.C., including Georgetown, George Washington University (GW), and American University, established a Gaza solidarity encampment at University Yard (U-Yard) on GW’s campus.\nWhile the encampment has brought together students, academics, and community members from across D.C., it has also garnered national attention.\nUntil complete liberation, the students are for justice in Palestine.” While others listened to speakers who described messages they had received from people in Gaza thanking students for protesting at the GW encampment.\n“The only thing I can do is to be there with them in spirit by supporting GW and Georgetown students for here.”No Georgetown students spoke at the counter-protest, and it’s unclear if any were present at the demonstration.\nBased on a post on DMV SJP’s Instagram, demonstrators projected a photo of President Joe Biden onto the American flag for several hours, with the words ‘genocide Joe’ written underneath.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.7844045352952751, "event_breakdown": "1. Establishment of a Gaza solidarity encampment at University Yard (U-Yard) on GW’s campus by a coalition of students from universities across D.C.\n2. National attention garnered by the encampment.\n3. Messages received from people in Gaza thanking students for protesting at the GW encampment.\n4. Counter-protest at the encampment, with no Georgetown students speaking or present.\n5. Projection of a photo of President Joe Biden onto the American flag with the words 'genocide Joe' written underneath, as posted on DMV SJP's Instagram."}, {"id": "d6193d43-17f0-4101-a357-dad67eadd826", "title": "Jewish poet , paratrooper Hannah Senesh honoured in Budapest", "date": "2024-05-05 10:30", "url": "https://www.jwire.com.au/jewish-poet-paratrooper-hannah-senesh-honoured-in-budapest/", "message": "Browse > Home News / Jewish poet, paratrooper Hannah Senesh honoured in Budapest – J-WireJewish poet, paratrooper Hannah Senesh honoured in BudapestRead on for articleHannah Senesh (Szenes) was honoured on Friday in a ceremony at her birthplace in Budapest, Hungary.\nThe Jewish paratrooper and poet was executed at age 23 “not far from here,” Revital Yakin, deputy CEO of March of the Living, said during the event.\nSenesh (1921-44), who was captured after parachuting into Yugoslavia during World War II to rescue Hungarian Jews, endured “severe torture,” Yakin said.\nAnd here, there are more of those than anywhere else.”“How relevant and accurate Hannah Senesh’s letter is even for our days,” said Yakin.\n“May her memory be blessed.”Rakefet Senesh Shkiler, Senesh’s great-grandniece, was one of the poet’s family members who attended the event and laid a wreath in her honor.", "location": "Budapest, Hungary", "classification": "antisemitism", "score": 0.7971402382719714, "event_breakdown": ""}, {"id": "c6a3f132-84d1-42b0-abec-b20223a99b14", "title": "  Actions Have Consequences : Dartmouth Jewish Studies Professor Arrested at Pro - Palestinian Protest – JONATHAN TURLEY", "date": "2024-05-04 20:45", "url": "https://jonathanturley.org/2024/05/04/actions-have-consequences-dartmouth-jewish-studies-professor-arrested-at-pro-palestinian-protest/comment-page-2/", "message": "I was standing with a line of women faculty in the their 60s to 80s trying to protect our students.\nDespite pleading guilty to criminal assault, she was not fired and received overwhelming support from the students and faculty.\nAt Hunter College in New York, Professor Shellyne Rodríguez was shown trashing a pro-life display of students.\nMoreover, Jewish students and faculty at schools like Columbia and UCLA were prevented from gaining access to areas on the campuses.\n“Actions have consequences” for students and faculty alike.", "location": "Hunter College", "classification": "antisemitism", "score": 0.4124504163993415, "event_breakdown": "1. A group of women faculty members in their 60s to 80s standing together to protect students.\n2. Professor Shellyne Rodríguez at Hunter College in New York trashing a pro-life display of students.\n3. Despite pleading guilty to criminal assault, Professor Shellyne Rodríguez was not fired and received overwhelming support from students and faculty.\n4. Jewish students and faculty at schools like Columbia and UCLA being prevented from accessing certain areas on the campuses.\n5. The notion that \"actions have consequences\" for both students and faculty."}, {"id": "78606edd-e9ea-4748-9391-b227258c9ddd", "title": "The legacy of Holocaust survivor whose home was destroyed on Oct . 7", "date": "2024-05-05 21:45", "url": "https://www.jpost.com/israel-hamas-war/article-799983", "message": "In the venerable \"Kupa\" synagogue in Krakow, Smil Sacagiu, an 87-year-old Holocaust survivor, and his son Mendi participated in a poignant ceremony, marking both remembrance and resilience.\nThe ceremony saw the Sacagius inscribing a Sefer Torah, a ritual laden with emotion and significance.\nFifty-five Holocaust survivors, living testaments to resilience and courage, will gather from all corners of the globe.\n\"We have Holocaust survivors here whose grandchildren are hostages in hell,\" he added, underscoring the ongoing threats to Jewish people.\n\"The Jewish spirit is at the heart of the march tomorrow,\" Taieb declared, rallying the community.", "location": "Krakow", "classification": "antisemitism", "score": 0.8405508213482472, "event_breakdown": "- Location: \"Kupa\" synagogue in Krakow, Poland\n- Smil Sacagiu, an 87-year-old Holocaust survivor, and his son Mendi participate in a ceremony marking remembrance and resilience.\n- The ceremony involves the Sacagius inscribing a Sefer Torah, a ritual filled with emotion and significance.\n- Fifty-five Holocaust survivors from around the world gather for the ceremony, symbolizing resilience and courage.\n- Taieb rallies the community, emphasizing the importance of the Jewish spirit in the upcoming march."}, {"id": "f7cf718b-4830-4d31-a24d-e87ec7fc0ef5", "title": "Holocaust scholar coming to Tulsa says antisemitism persists", "date": "2024-05-05 10:00", "url": "https://tulsaworld.com/news/local/holocaust-scholar-danny-m-cohen/article_937bd5e0-0639-11ef-ac8f-b7feb1131214.html", "message": "“We’ve done a really excellent job of collecting testimonies,” said Danny M. Cohen, a Chicago-based Holocaust scholar, educator and writer.\nThe grandson of a Holocaust survivor, Cohen has dedicated his career to Holocaust studies and human rights advocacy.\nOr we might call it ‘inherited trauma.’”Many have even compared Oct. 7 to the Holocaust, Cohen added.\nWe want the Palestinian people to be able to work toward self-determination.”“My stance is, I’m on the side to end suffering,” Cohen added.\nAdmission: Free, registration required Presented by: Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah and Temple Israel To register or for more information: Go to jewishtulsa.org/yomhashoah2024.", "location": "Chicago", "classification": "antisemitism", "score": 0.9048038057196574, "event_breakdown": "- Danny M. Cohen, a Chicago-based Holocaust scholar, educator, and writer, mentioned the excellent job of collecting testimonies\n- Cohen, the grandson of a Holocaust survivor, has dedicated his career to Holocaust studies and human rights advocacy\n- Oct. 7 is compared to the Holocaust by many, as mentioned by Cohen\n- Cohen expressed the desire for the Palestinian people to work toward self-determination and to end suffering\n- An event presented by Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah, and Temple Israel, with free admission and registration required"}, {"id": "0f5f9c1f-1d4d-4f12-92e6-9bfebe6d9441", "title": "How did Jews celebrate Passover during a war ? - opinion", "date": "2024-05-04 22:45", "url": "https://www.jpost.com/opinion/article-799791", "message": "This tranquil setting was the location of a dance/music event billed as a festival of “Friends, Love, and Infinite Freedom,” Nova was attended by more than 3,500 young Israelis.\nThe kibbutz is populated by young, idealistic Jews who wish to work the holy soil.\nOn October 7, despite a ceasefire between Hamas and Israel being in place, it was attacked by the Palestinian hordes.\nThese displaced Israelis are among the forgotten in Israel as the war enters its eighth month.\nI can’t imagine any other country at war demonstrating more humanitarian concern than Israel.”Our celebration of Passover in Israel reinforced an important age-old lesson for our family.", "location": "Based on the information provided, the main location where the main event takes place is \"Israel\".", "classification": "antisemitism", "score": 0.6209995559715097, "event_breakdown": "null"}, {"id": "256b79e3-4704-4a9e-8dd9-80fbc51264b3", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war", "date": "2024-05-06 15:30", "url": "https://www.clickorlando.com/news/world/2024/05/06/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war/", "message": "The event comes amid the dramatic backdrop of the violence of the Israel-Hamas war after the Oct. 7 Hamas attack, the deadliest violence against Jews since the Holocaust, and as pro-Palestinian protests sweep U.S. campuses.\nRecommended VideosThe October attack unleashed a war that has led to a high number of Palestinian deaths, fueling pro-Palestinian protests that have swept U.S. campuses.\nMany Jewish students have felt intimidated by protests, which have at times included antisemitic tropes and calls for anti-Jewish violence.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9732349184556152, "event_breakdown": "- Oct. 7: Hamas attack sparks Israel-Hamas war\n- Pro-Palestinian protests sweep U.S. campuses\n- High number of Palestinian deaths in Israel-Hamas war\n- Intimidation of Jewish students by protests\n- Preservation of former death camps as memorials in Poland\n- Holocaust survivor Judith Tzamir's visit to Auschwitz"}, {"id": "87c03f66-37d3-4ba7-a7df-ea1f6f5b5182", "title": "Two dichotomies", "date": "2024-05-06 05:00", "url": "https://www.jwire.com.au/two-dichotomies/", "message": "I am unaware of any Islamophobic gathering advocating “Israel will be free (of Arabs) from the river to the sea” or promoting killing of Muslims.\nEvery event involving Australian Jews has been peacefully advocating Hamas return the kidnapped civilian hostages.\nAt none of these has there been statements, placards or anything else advocating harm or hatred of Muslims or any other group.\n2 On Friday, May 3, Prime Minister Anthony Albanese was reported holding a “round-table discussion with the country’s leading rabbis”.\nI was tearful hearing the recording of Rev Cantor Deutsch singing El Maleh Rachamim at Sunday night’s impressive Yom Hashoah commemoration.", "location": "", "classification": "antisemitism", "score": 0.5974347798614479, "event_breakdown": "null"}, {"id": "3b9b8bfe-da6c-4f9e-9436-5b305cfb09d6", "title": "The Jewish Vote is up for Grabs , and it May Decide the Election | The Jewish Press - JewishPress . com | Caroline B . Glick | 27 Nisan 5784 – Sunday , May 5 , 2024", "date": "2024-05-05 01:30", "url": "https://www.jewishpress.com/indepth/opinions/the-jewish-vote-is-up-for-grabs-and-it-may-decide-the-election/2024/05/05/", "message": "And second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nBut anecdotal evidence is piling up that the Jewish vote is in contention like it hasn’t been in more than 40 years.\nMoreover, American Jewish voters may well turn out to be the demographic that determines the outcome of the 2024 presidential election.\nIn 1976, Jimmy Carter won 71% of the Jewish vote in his race against incumbent Gerald Ford.\nIndependent candidate John Anderson won 15% of the Jewish vote, and Ronald Reagan won 39% of the Jewish vote—and the presidency.", "location": "The main location where the main event takes place is the United States.", "classification": "antisemitism", "score": 0.6413084800125979, "event_breakdown": "- Anecdotal evidence suggests that the Jewish vote is in contention for the 2024 presidential election\n- In 1976, Jimmy Carter won 71% of the Jewish vote in his race against incumbent Gerald Ford\n- Independent candidate John Anderson won 15% of the Jewish vote\n- Ronald Reagan won 39% of the Jewish vote and the presidency"}, {"id": "d5dc58ee-1c3a-4577-83fb-74331880ea75", "title": "Here Just Some of the Boycott and Protest Activity Being Aimed at Israel", "date": "2024-05-06 16:00", "url": "https://www.algemeiner.com/2024/05/06/heres-just-some-of-the-boycott-and-protest-activity-being-aimed-at-israel/", "message": "Anecdotal reports continue to indicate that more Jewish students are shunning elite universities in favor of institutions in the south.\nBrandeis University also extended its deadline for students to apply to transfer, specifically in order to allow as many Jewish students as necessary to relocate.\nCancel all forms of cooperation with Israeli academic institutions, including events, activities, agreements, and research collaborations.\nGet IOF and NYPD officers off all CUNY campuses, and end all collaboration, trainings and recruitment by imperialist institutions, including the CIA, Homeland Security and ROTC.\nIreland’s sovereign wealth fund divested its holdings of Israeli companies, including banks and supermarket chains, for their operations in the West Bank.", "location": "Brandeis University", "classification": "antisemitism", "score": 0.5099666546574659, "event_breakdown": "- Shunning elite universities: Anecdotal reports suggest more Jewish students are choosing institutions in the southern region over elite universities.\n- Brandeis University deadline extension: Extended deadline to allow Jewish students to transfer.\n- Cancel cooperation with Israeli academic institutions: Call to cancel all forms of cooperation with Israeli academic institutions.\n- Removal of IOF and NYPD officers from CUNY campuses: Demand to remove officers and end collaboration with imperialist institutions.\n- Divestment by Ireland's sovereign wealth fund: Ireland's fund divested holdings of Israeli companies operating in the West Bank."}, {"id": "3a7c912c-ecfd-4f8d-9cd8-9c8945db9d12", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protesters.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees.", "location": "Based on the information provided, the main location where the main event takes place is the University of North Carolina (UNC), specifically in Chapel Hill, North Carolina.", "classification": "antisemitism", "score": 0.7274022151977523, "event_breakdown": "- University police remove pro-Palestinian encampment and arrest 36 protesters at around 6 a.m.\n- UNC Students for Justice in Palestine (SJP) organized a vigil at noon\n- Duke Academics and Staff for Justice in Palestine raised more than $50,000 in support of UNC encampment arrestees\n- Reduced hours and booking portal removal for Campus Y facilities reported by Campus Y student leadership"}, {"id": "236aefb1-6b18-4ca7-ba52-2671d7c3e6c4", "title": "Here where things stand one week since Penn ordered the Gaza Solidarity Encampment to disband", "date": "2024-05-04 19:00", "url": "https://www.thedp.com/article/2024/05/penn-gaza-solidarity-encampment-day-eight", "message": "The videos, which together are nearly six minutes long, were filmed by a Jewish student walking near the encampment.\nAt one point, the Jewish student asked an encampment participant if they were a student.\nThe DP could not confirm whether DPS has reached out to the student or whether the encampment participant was a student.\nThe DP could not independently corroborate Yakoby's allegation that encampment members have used slurs towards Jewish students.\nHe called on Penn’s leadership to keep students safe and said that Penn has not requested help from state police to disband the encampment.", "location": "", "classification": "antisemitism", "score": 0.5825308301516012, "event_breakdown": "1. Videos filmed by a Jewish student near the encampment (location: near the encampment).\n2. The Jewish student asked an encampment participant if they were a student.\n3. The DP (unspecified source) couldn't confirm if DPS (Department of Public Safety) has contacted the student or confirmed the encampment participant's student status.\n4. The DP couldn't independently verify Yakoby's claim of slurs being used towards Jewish students by encampment members.\n5. Call from Yakoby for Penn's leadership to prioritize student safety.\n6. Penn has not requested assistance from state police to dismantle the encampment."}, {"id": "56065255-80b6-45f0-aa66-ae9b5def04c0", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war", "date": "2024-05-06 15:30", "url": "https://www.clickorlando.com/news/world/2024/05/06/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war/", "message": "The event comes amid the dramatic backdrop of the violence of the Israel-Hamas war after the Oct. 7 Hamas attack, the deadliest violence against Jews since the Holocaust, and as pro-Palestinian protests sweep U.S. campuses.\nIsrael's Gaza offensive has been fueling pro-Palestinian protests, including at many U.S. campuses.\nIsrael and its supporters have branded the protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9784222136295248, "event_breakdown": ""}, {"id": "c8d65e6e-8727-4a7a-9148-e07bef1007d2", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war – Winnipeg Free Press", "date": "2024-05-06 15:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/faith/2024/05/06/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war", "message": "The event comes amid the dramatic backdrop of the violence of the Israel-Hamas war after the Oct. 7 Hamas attack, the deadliest violence against Jews since the Holocaust, and as pro-Palestinian protests sweep U.S. campuses.\n(AP Photo/Czarek Sokolowski)Israel’s Gaza offensive has been fueling pro-Palestinian protests, including at many U.S. campuses.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9808411340387749, "event_breakdown": "- Israel's Gaza offensive fueling pro-Palestinian protests at U.S. campuses\n- Pro-Palestinian protests sweeping U.S. campuses\n- Former death camps in Poland preserved as memorials\n- Event in its 36th year drawing thousands, including Holocaust survivors and Jewish leaders\n- Holocaust survivor Judith Tzamir from Germany and moved to Israel in 1964 visiting Auschwitz"}, {"id": "224f7f88-6330-40e0-be62-958ada719790", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war", "date": "2024-05-06 16:00", "url": "https://isp.netscape.com/news/world/story/0001/20240506/a7996e224bb4be1c76059b6fafbbd19d", "message": "Israel and its supporters have branded the protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThis year, Israeli hostages released from captivity in Gaza and families whose relatives are still being held captive also joined.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9839084046275653, "event_breakdown": "- Protests branded as antisemitic by Israel and supporters\n- Former death camps preserved as memorials in Poland\n- 36th year event drawing thousands of participants, including Holocaust survivors and Jewish students, leaders, and politicians\n- Israeli hostages released from captivity in Gaza and families of those still held captive joining the event\n- Judith Tzamir, a Holocaust survivor from Germany, visiting Auschwitz"}, {"id": "fac2c438-ecef-4270-976b-5837a393433a", "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel - Hamas war", "date": "2024-05-06 18:00", "url": "https://www.wdio.com/front-page/world-national/the-yearly-memorial-march-at-the-former-death-camp-at-auschwitz-overshadowed-by-the-israel-hamas-war/", "message": "Israel’s Gaza offensive has been fueling pro-Palestinian protests, including at many U.S. campuses.\nIsrael and its supporters have branded the protests as antisemitic, while critics of Israel say it uses such allegations to silence opponents.\nThe area was under German occupation during World War II and today the former death camps are preserved as memorials by the Polish state.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had long avoided visiting Auschwitz.", "location": "Auschwitz", "classification": "antisemitism", "score": 0.9769526004195005, "event_breakdown": "1. Israel's Gaza offensive fueling pro-Palestinian protests at U.S. campuses.\n2. Protests labeled as antisemitic by Israel and its supporters.\n3. Critics of Israel claim allegations of antisemitism used to silence opponents.\n4. Former death camps in the area preserved as memorials by the Polish state.\n5. Annual event, now in its 36th year, draws thousands including Holocaust survivors, Jewish students, leaders, and politicians.\n6. Judith Tzamir, a Holocaust survivor from Germany who moved to Israel in 1964, had avoided visiting Auschwitz until recently."}, {"id": "1a1e0adc-9d95-4247-975c-fcbbfea8c005", "title": "Israel observes Holocaust Remembrance Day amid Gaza war – DW – 05 / 06 / 2024", "date": "2024-05-06 17:45", "url": "https://www.dw.com/en/israel-observes-holocaust-remembrance-day-amid-gaza-war/a-69009798", "message": "This year's Holocaust Remembrance Day comes amid the ongoing war in Gaza, where more than 100 Israeli hostages are still being held by Hamas.\nIsrael's Holocaust Remembrance Day, or Yom Hashoah, takes place every year in April or May according to the Hebrew calendar, whereas International Holocaust Remembrance Day is observed on January 27.\nAccording to official figures, 132,826 Holocaust survivors still live in Israel, the creation of which in 1948 came just three years after the end of World War II and the defeat of Nazi Germany.\nThis year, Israeli hostages released from captivity in Gaza and families whose relatives are still being held captive also joined the march.\n\"In the aftermath of the October 7 war crimes committed by Hamas, the world has seen the worst wave of antisemitic incidents since the end of the Second World War,\" the report stated.", "location": "Israel", "classification": "antisemitism", "score": 0.880467593288952, "event_breakdown": "1. Ongoing war in Gaza with Israeli hostages held by Hamas\n2. Israel's Holocaust Remembrance Day (Yom Hashoah)\n3. International Holocaust Remembrance Day\n4. Existence of 132,826 Holocaust survivors in Israel\n5. Israeli hostages released from captivity in Gaza and families joining the march\n6. Antisemitic incidents following the war crimes committed by Hamas on October 7"}, {"id": "f0886b9f-e1ed-46d7-a5e5-11088993eecc", "title": "Auraria encampment arrests have  lit a fire  for protestors , as they enter 12th day of campus occupation", "date": "2024-05-06 18:30", "url": "https://kgnu.org/auraria-campus-encampment-denver-msu-sds-palestine-israel-gaza-hamas-police-arrests/", "message": "They were charged with municipal offenses including trespassing and interference, according to an Auraria Campus statement.\nThey were charged with multiple offenses, including trespassing and interference, according to an Auraria campus statement.\nHe’s a member of SDS and one of the organizers of the Auraria encampment.\nThomas went on to blame Auraria Campus leaders for mishandling the aftermath of the mass arrests, saying he’d expected campus officials to collect the tents.\nAuraria Higher Education Center’s Director of Marketing and Communications, Devra Ashby, directed me to Auraria campus website.", "location": "Auraria Campus", "classification": "antisemitism", "score": 0.5056693158357884, "event_breakdown": ""}, {"id": "657dd12a-ad98-43d7-919a-ee91789850b9", "title": "Holocaust Remembrance Week Complicated By the Israel War with Hamas and a Growing Anti - Semitic Problem | Newstalk Florida", "date": "2024-05-06 05:45", "url": "https://www.newstalkflorida.com/featured/holocaust-remembrance-week-complicated-by-the-israel-war-with-hamas-and-a-growing-anti-semitic-problem/", "message": "Numerous European nations embraced the Nazis, with considerable local support, while some countries chose to declare “neutrality.”As World War II raged on, one of history’s darkest chapters unfolded: the Holocaust.\nIn 2023, the world experienced an alarming surge in anti-Semitism, a phenomenon unparalleled since the conclusion of World War II.\nLet’s delve into the key findings from the report:Incident Surge: In 2023, ADL tabulated 8,873 antisemitic incidents across the United States.\nBetween October 7 and the end of 2023, ADL documented , surpassing the total for the entire year of 2022.\nExcluding these incidents, ADL tabulated 7,523 incidents, a 103% increase from 2022.", "location": "The main location where the main event takes place is the United States.", "classification": "antisemitism", "score": 0.8436587385142604, "event_breakdown": "- European nations embracing the Nazis with local support\n- Some countries declaring \"neutrality\" during World War II\n- The Holocaust unfolding during World War II\n- Alarming surge in anti-Semitism worldwide in 2023\n- ADL tabulating 8,873 antisemitic incidents in the United States in 2023\n- ADL documenting a surge in incidents between October 7 and the end of 2023\n- Excluding the surge, ADL tabulating 7,523 antisemitic incidents, a 103% increase from 2022"}, {"id": "92098ce1-4c98-4cbb-9e20-e0fd9c2112a2", "title": "Pursuit Church Announces Interfaith March for Israel at University of Southern California", "date": "2024-05-06 07:15", "url": "https://markets.businessinsider.com/news/stocks/pursuit-church-announces-interfaith-march-for-israel-at-university-of-southern-california-1033329841", "message": "United for IsraelLOS ANGELES, CA / ACCESSWIRE / May 5, 2024 / The Pursuit NW, under the leadership of Pastor Russell Johnson, is proud to announce its continued commitment to advocating for Israel with the upcoming \"United for Israel\" rally at the University of Southern California on Wednesday, May 8, 2024, at 5:30 PM.\nPastor Johnson emphasizes the rally's focus on essential issues, including Israel's right to self-defense, the immediate release of all remaining hostages, and the restoration of lasting peace in the region.\nDrawing from past successes, such as the impactful Seattle march convened shortly after the October 7th attacks on Israel, Pastor Johnson brings a wealth of experience and passion to this latest initiative.\nBased in Washington State, The Pursuit operates as a non-denominational church across multiple campuses, including Seattle, Kirkland, Snohomish, and an online presence.\nContact:Pursuit NW ChurchEmma LaMarche | emma.l@thepursuitnw.comMedia Intake Coordinator | 425-205-7428contact@thepursuitnw.comSOURCE: Pursuit NWView the original press release on newswire.com.", "location": "University of Southern California", "classification": "antisemitism", "score": 0.5974310928636021, "event_breakdown": "null"}]