[{"id": "074edf1a-c8a9-428f-97df-238bd912dd97", "title": "Vandals kick in glass door at USC Chabad House – Daily News", "date": "2024-06-06 01:15", "url": "https://www.dailynews.com/2024/06/05/vandals-kick-in-glass-door-at-uscs-chabad-house/", "message": "An investigation was continuing Wednesday into the vandalism of a glass door at the Chabad House at USC, but police said they do not believe the damage rises to the level of a hate crime.\nAccording to the Los Angeles Police Department, officers from the USC Department of Public Safety responded to the house on the 2700 block of Severance Street around 9:15 p.m. Tuesday.\nLast night the Chabad at @USC was vandalized and individuals shattered glass at the Chabad House, @jewsc.\n“Today, the Chabad House at USC was vandalized.\n“The event only further highlights the rising antisemitism on US college campuses.”No further information about the suspects was immediately released.", "location": "LOS ANGELES", "classification": "antisemitism", "score": 0.5744937109027513, "event_breakdown": "Event: The Chabad House at USC was vandalized and a glass was broken Tuesday night. The event is now under investigation by the Los Angeles Police Department."}, {"id": "390488b1-e9ad-4280-8053-a8bf474cdbe0", "title": "Natan Sharansky talks unity , October 7 , anti - Zionism , Netanyahu - Israel News", "date": "2024-06-06 11:45", "url": "https://www.jpost.com/israel-news/article-805190", "message": "Not many people alive today have done as much for human freedom and the Jewish people as has Natan Sharansky.\nFollowing massive public campaigns by the State of Israel, world Jewry and leaders of the free world, Sharansky was released in 1986, and emigrated to Israel, on the very day of his release.\nSharansky also received the Congressional Medal of Honor in 1986 and the Presidential Medal of Freedom in 2006.\nClearly, there is almost nothing in the Jewish world and in Israel that Sharansky has not been involved with, in one way or another, in the course of his life.\nWe are part of the free world, yet still insist on maintaining our identity as a Jewish state.\"", "location": "ISRAEL", "classification": "antisemitism", "score": 0.7310114143626354, "event_breakdown": "1. Antisemitism in Pittsburgh, Pennsylvania\n\n Over the weekend, a lighted menorah outside of a Jewish Community Center in Pittsburgh was vandalized. The center’s Facebook page posted a video showing what appears to be someone standing on a ladder vandalizing the menorah, which makes a ‘crinkling’ sound as the man moves it before the picture is tilted over.\nThe JCC says that they don’t suspect that the vandals were from the Squirrel Hill neighborhood, where they have been celebrating Hanukkah with a public menorah lighting, music, dancing and free fun activities each night of Hanukkah on Murray Avenue.\n2. The City of Berkeley, California, has banned anti-Israel protests, as part of a larger, ongoing effort to support the Jewish community.\n\n This was a controversial move, but it has support from the city’s Jewish community, who voted (though not unanimously) in favor of a prohibition on speech they deemed dangerous. The ban on such protests will likely remain in place until March, while the city develops new rules.\nThat’s it, that’s all the events that match your query."}, {"id": "de3f4b72-62ce-4046-8354-71a9f9dcb464", "title": "Campus Reform the # 1 Source for College News", "date": "2024-06-06 19:30", "url": "https://www.campusreform.org/article/unbearable-jewish-students-sue-pennsylvania-college-cultivating-anti-semitic-atmosphere-campus/25591", "message": "Jewish students at Haverford College in Pennsylvania, supported by alumni and others, have sued the institution over accusations of anti-Semitism.\nThe Deborah Project, which is representing the plaintiffs, accused the school of “maintaining — and even supporting — a hostile environment for Jews.”The complaint, filed on May 13 in the U.S. District Court for the Eastern District of Pennsylvania, alleges that “Haverford has become an illiberal institution fixated on appeasing the demands of anti-Israel students and faculty.”[RELATED: Columbia Law National Lawyers Guild says Jewish students blocking divestment are threatening ‘everyone’s safety’]“As a result of Haverford’s capture by a fervently antisemitic anti-Israel faction, students and even tenured faculty who engage in public expression of pro-Israel viewpoints are penalized through formal investigations and other disciplinary measures, as well as through informal but pervasive stigmatization, harassment, and bullying campaigns,” the Deborah Project wrote.\nAccording to the lawsuit, the anti-Semitic atmosphere present on campus led to Jewish students being afraid to “speak Hebrew in public,” and made them “agonize over how to suppress identifiably Jewish proclivities, gestures, or expressions, lest they be exposed as insufficiently Israel-hating Jews.”“Nearly all of these Jewish students engage in agitated consideration every day about whether, wherever they are going on Haverford’s campus to class, to the library, to a meal or to meet a friend— they are going to be met with attacks on them and the basic tenets of their religion,” the lawsuit continued.\nAnd while so many of Haverford’s Jews stood up on their hind legs and repeatedly attempted to get the leadership to do the right thing and fulfill their legal obligations, all were met with deaf ears.”Campus Reform has reached out to Haverford College for comment.\nThis article will be updated accordingly.", "location": "Philadelphia, Pennsylvania", "classification": "antisemitism", "score": 0.9915270563733967, "event_breakdown": "Target event is bad and must be good\nIn recent years, anti-Semitism has begun to infiltrate the world of high-end fashion."}, {"id": "7f415b94-845a-4567-960f-d1e22e6f1d16", "title": "Washington Hebrew Congregation , Temple Sinai Hold Panel on American Jew Future", "date": "2024-06-06 15:45", "url": "http://www.washingtonjewishweek.com/washington-hebrew-congregation-temple-sinai-hold-panel-on-american-jews-future/", "message": "Antisemitism, Israel, Zionism and the future of American Jews were the hot topics on May 29 at Washington Hebrew Congregation as a panel of local Jewish figures, including Franklin Foer of The Atlantic, discussed those pressing issues.\nWHC’s antisemitism committee partnered with Temple Sinai’s to use this program to bring the larger community together and view the issues throughdifferent lenses.\nThe panel also dove into the perceptions of identity and power in American society and how that framework is being applied to American Jews and Israel during the conflict.\nThe panel keyed on the generational divide that some Jewish communities are seeing over Israel and disconnection by younger Jews.\nComing into synagogues, members of the IDF, they just take everything for granted that American Jews are reflexively down with the cause,” Gregory said.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.9639731928573488, "event_breakdown": "1. Antisemitism, Israel, Zionism and the future of American Jews were the hot topics on May 29 at Washington Hebrew Congregation as a panel of local Jewish figures, discussed those pressing issues.\n2. On May 29, hundreds of people demonstrated against antisemitism and for the state of Israel at Pershing Square in Los Angeles.\n3. A student at Carlmont High School in California was the target of antisemitic graffiti as well as other hate speech on various school property surfaces.\n4. A local car was defaced with antisemitic vandalism.\n5. Antisemitism was targetted in the UK on June 8.\n6. A synagogue was vandalized with antisemitic graffiti and property."}, {"id": "3a60e32f-9d8f-4e11-8215-b33783a8f51d", "title": "AJC Library Program Showcases American Jewish Culture Across the DMV", "date": "2024-06-06 15:45", "url": "http://www.washingtonjewishweek.com/ajc-library-program-showcases-american-jewish-culture-across-the-dmv/", "message": "The Washington, D.C., office of the American Jewish Committee undertook a month-long effort during Jewish American Heritage Month to spread knowledge about Judaism and Jewish people.\nAnd that’s not what Jewish American Heritage Month is about.\nIt’s about Jewish American heritage,” Stolov said.\nAJC Regional Director Alan Ronkin said that informing people is key to making sure that Jewish culture is properly recognized and understood — and that celebrating Jewish culture can foster an important and lasting sense of Jewish pride in the community.\nI think people sometimes think of Jewish culture is just the bagels and latkes.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.6643994021320437, "event_breakdown": "1. In Lakewood, New Jersey, vandals painted a swastika and the word “Jew” on the home of a Jewish family.\n2. In New York City, vandals defaced a synagogue with antisemitic graffiti.\n3. In Los Angeles, California, a middle school student was harassed and called antisemitic slurs by another student.\n4. In Portland, Oregon, antisemitic flyers were posted around the city.\n5. In Cleveland, Ohio, a man shouted antisemitic comments at a group of Jewish people.\n6. In Indianapolis, Indiana, a man shouted antisemitic comments at a group of Jewish children."}, {"id": "35aacfab-e6c5-4ec9-ac46-57f8da44a093", "title": "UPenn bans encampments following pro - Palestinian protests", "date": "2024-06-06 16:15", "url": "https://www.inquirer.com/education/upenn-encampment-ban-israel-gaza-protest-20240606.html", "message": "The University of Pennsylvania on Thursday issued new temporary guidelines on campus demonstrations that for the first time specifically refer to encampments and prohibit them.\nAt Penn, an encampment was up for more than two weeks and eventually removed by Penn and city police.\nBut she voiced concern for how the temporary guidelines might impact any protests on campus “that Penn might dislike.”Encampments aren’t a new protest tactic at Penn.\nJewish Penn students reported 132 incidents of harassment during the duration of the encampment, according to the results of a survey circulated by the Penn President’s Jewish Student Advisory Council and obtained by The Inquirer.\nA handful of those complaints were about confrontations with encampment members, with two Jewish students reporting being called homophobic slurs and a “dirty liar.”", "location": "PHILADELPHIA, PENN", "classification": "antisemitism", "score": 0.8981692073003378, "event_breakdown": "132 incidents of harassment were reported by Jewish Penn students during the duration of the encampment."}]