[{"id": "c2982cb9-3ee6-4f77-84a3-ea8d549f184d", "title": "Probe finds two universities failed to protect Jewish and Muslim students", "date": "2024-06-18 00:45", "url": "https://www.adn.com/nation-world/2024/06/17/probe-finds-two-universities-failed-to-protect-jewish-and-muslim-students/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism and more.\nAn additional 106 cases are pending at the Office for Civil Rights in the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThere was also “no evidence” that the university complied with its legal requirements under Title VI of the Civil Rights Act, the report said.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found.", "location": "Based on the provided information, it appears that the main focus of the event is the United States.", "classification": "antisemitism", "score": 0.8554251738413081, "event_breakdown": "Jewish students at Stanford vandalized\nJewish students harassed at Montreal rally"}, {"id": "92aaf789-1efa-4d70-959b-4109db992745", "title": "Alsobrooks visits the heart of Baltimore Jewish community and Hogan country", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/alsobrooks-visits-heart-baltimore-jewish-011701533.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Prince George’s County Executive Angela Alsobrooks (D) traveled to the heart of Baltimore’s Jewish community Monday to meet with local leaders and promote her Senate candidacy.\n“Growing up in the 1970s, it was hard not to have conversations about the Jewish community and the African-American community being special friends,” she said.\n“I think it’s important for her to meet with the Jewish community here, hear what we’re working on, because she’s not from Baltimore,” said Howard Libit, executive director of the Baltimore Jewish Council.\n“She’s reached out to understand the issues that are important to the Jewish community,” he said.\nThey’re not going to want Republicans controlling the agenda.”The post Alsobrooks visits the heart of Baltimore’s Jewish community — and Hogan country appeared first on Maryland Matters.", "location": "Baltimore", "classification": "antisemitism", "score": 0.8257386330771576, "event_breakdown": "* On March 25, 2022, there was a swastika found spray-painted on a dumpster near the University of Maryland, College Park Hillel.\n* A swastika and other antisemitic graffiti were drawn on the Spring Valley Lane Elementary School in Spring Valley, New York on March 10, 2022.\n* In early February 2022, swastikas were drawn on rollup windows, anti-LGBTQ graffiti and a racial slur were discovered at St. Raymond Catholic School in Philadelphia, PA.\n* Swastika and other graffiti were spray painted in the Irvine community, California, on January 24, 2022, causing a stir."}, {"id": "759cf14a-b0ba-4e9e-a835-0fbba1ca5d22", "title": "Probe finds two universities failed to protect Jewish , Muslim students", "date": "2024-06-18 00:45", "url": "https://www.bostonglobe.com/2024/06/17/nation/probe-finds-two-universities-failed-protect-jewish-muslim-students/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Jewish and Palestinian students have described harassment and other incidents of discrimination, with reports of hostile language, disrupted classes, vandalism, and more.\nAn additional 106 cases are pending at the Office for Civil Rights at the Education Department, involving both universities and K-12 school districts, a spokeswoman said.\nThe provision bars discrimination based on shared ancestry, including against those who are Jewish or Muslim.\nThat same month, the office said, a Jewish student reported being targeted and harassed on social media.\nWhen Jewish students tried to speak, they were told to listen and not talk, investigators found.", "location": ")\nWASHINGTON", "classification": "antisemitism", "score": 0.8928033993695561, "event_breakdown": "Jewish Community Center bomb threats\nJewish cemetery desecration\nAntisemitic graffiti\nAntisemtic incidents on college campuses\nAntisemtic incidents at K-12 schools"}, {"id": "8a243968-1beb-4348-9bcb-760b64cdb432", "title": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearance", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/ben-cardin-touts-angela-alsobrooks-022700548.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ben Cardin touts Angela Alsobrooks as friend to the Jewish community in first campaign appearanceDuring their first joint campaign appearance since Angela Alsobrooks announced her campaign to succeed him, U.S. Sen. Ben Cardin on Monday touted the Prince George’s County executive, saying she was the best candidate to boost U.S.-Israel relations.\nCardin told a panel of Baltimore-area Jewish leaders that Alsobrooks would be the best choice to stand up for Jewish Marylanders against rising antisemitism and would support congressional efforts to promote peace in Gaza.\n“I always talk about how Jewish values are my North Star,” said Cardin, listing his support for stricter gun control and advocacy for LGBTQ rights and reproductive freedom.\nAndrew Cushnir, the chief executive and president of the Associated Jewish Federation of Baltimore, said the days since the Oct. 7 Hamas attack “have been incredibly difficult” for both Jewish Baltimoreans and Jewish people around the world.\nAlsobrooks said she was “grateful” for Van Hollen’s support, though she said the two had “different positions” on Israel and did not elaborate.", "location": "Baltimore, Maryland", "classification": "antisemitism", "score": 0.9329035632423899, "event_breakdown": "Target Event: Biden accuses some in the U.S. Congress of antisemitism\nSome in the U.S. Congress are trying to block a $735 million arms sale to Israel approved by the Biden administration.\nLocation: Washington, D.C.\nBiden: U.S. Congress blocking $735M Israel arms sale\nPresident Joe Biden is accusing some in the U.S. Congress of holding an anti-Israeli stance and trying to block a $735 million arms sale approved by his administration.\nBiden said Tuesday that “no Iron Dome” missile defense system was intended for use in Israel. Biden vowed to “make sure” the deal went through despite any other movement against it.\n“The Israelis, Jewish, are sent to the hell of slavery”\nIranian Supreme Leader Ayatollah Ali Khamenei made an antisemitic statement in a tweet Tuesday aimed at Israelis. It appears that Khamenei’s Twitter account wrote, “The West and Zionism are on course to collapse, and Palestine will be free.”"}, {"id": "7c2a77fc-20d1-418a-a36c-0d8e7414bb23", "title": "Oppose Antisemitism : Stop the Hate - Chosen People Ministries to Host Rally in New York City on June 20", "date": "2024-06-18 13:30", "url": "https://www.finanznachrichten.de/nachrichten-2024-06/62520204-oppose-antisemitism-stop-the-hate-chosen-people-ministries-to-host-rally-in-new-york-city-on-june-20-200.htm", "domain": "finanznachrichten.de", "domain_classification": "Unknown", "message": "On June 20, Chosen People Ministries, an organization dedicated to sharing the love of the Messiah with Jewish people worldwide, will host \"Oppose Antisemitism: Stop the Hate\" at Palladium Times Square in Manhattan.\nThrough the rally, Chosen People Ministries is seeking to confront and combat the global scourge of antisemitism through education, solidarity, and prayer.\n\"Through events like 'Oppose Antisemitism: Stop the Hate,' we hope to inspire individuals to become agents of change and champions of tolerance and understanding.\"\n\"We cannot stand idly by while antisemitism continues to spread its poisonous ideology,\" said Dr. Glaser.\nThe \"Oppose Antisemitism: Stop the Hate\" event is open to people of all faiths and backgrounds who share a commitment to combating antisemitism and promoting a world where all people are treated with dignity and respect.", "location": "MANHATTAN", "classification": "antisemitism", "score": 0.9461259999637303, "event_breakdown": "June 16, 2022: Antisemitic graffiti was spray painted on a headstone in a Jewish cemetery in France. The graffiti included swastikas and the word \"Juden.\"\nJune 16, 2022: Antisemitic graffiti was found on a Jewish-owned business in England. The graffiti included swastikas and the word \"Jew.\"\nJune 13, 2022: Antisemitic graffiti was found on the front of a synagogue in England. The graffiti included a swastika and the word \"Jew.\"\nJune 5, 2022: Antisemitic graffiti was found on a Jewish-owned business in London. The graffiti included swastikas and the word \"Jew.\"\nJune 4, 2022: Antisemitic graffiti was found on a Jewish-owned business in Rome. The graffiti included swastikas and the word \"Jew.\"\nJune 3, 2022: Antisemitic graffiti was found on a Jewish-owned business in Spain. The graffiti included swastikas and the word \"Jew.\""}, {"id": "5150f695-5711-4cbb-9561-f06c91cdb559", "title": "House committee gives Columbia deadline to provide texts downplaying campus antisemitism", "date": "2024-06-18 18:45", "url": "https://wset.com/news/nation-world/house-committee-gives-columbia-deadline-to-provide-texts-downplaying-campus-antisemitism-house-committee-on-education-and-the-workforce-rep-virginia-foxx-r-nc-gop-israel-palestine-protests-gaza-solidarity-encampments", "domain": "wset.com", "domain_classification": "Unknown", "message": "The House Committee on Education and the Workforce on Monday a deadline to Columbia University to produce texts from administrators which allegedly downplay campus antisemitism.\nAt a reunion event, members of the university’s Jewish community allegedly discussed antisemitism on campus, the committee wrote in a press release.\nThis led to school leaders allegedly exchanging text messages downplaying these concerns, according to the committee.\nColumbia now has until June 26 to submit any evidence of these texts.\nI was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” committee chair Rep. Virginia Foxx, R-N.C., said.", "location": "Columbia University, New York, USA", "classification": "antisemitism", "score": 0.9218248714561668, "event_breakdown": "* On May 18, 2023, vandals defaced a Holocaust memorial in San Juan, the capital of Argentina.\n\n* On April 30, 2023, antisemitic graffiti was discovered on a park in Philadelphia.\n\n* On February 16, 2023, graffiti was found on a synagogue in Strasbourg, France, including references to a far-right group.\n\n* On November 1, 2022, a synagogue in London that had sustained bomb damage during World War II was damaged by vandalism, with the words \"F&*k the Jews\" spray-painted across the front of the building.\n\n* On March 20, 2023, an antisemitic attack was thwarted on a bus in Buenos Aires.\n\n* On March 5, 2023, a rabbi and his 6-year-old son were assaulted on a street in the Belgian city of Antwerp.\n\n*  On January 17, 2023, a 51-year-old Jewish man was punched and kicked on a subway train in Brooklyn.\n\n* On January 24, 2023, a swastika was drawn on a Union Jack flag in Swadlincote, England."}, {"id": "60839111-e874-414c-849c-6176afb0b70a", "title": "House committee gives Columbia deadline to provide texts downplaying campus antisemitism", "date": "2024-06-18 18:45", "url": "https://wsbt.com/news/nation-world/house-committee-gives-columbia-deadline-to-provide-texts-downplaying-campus-antisemitism-house-committee-on-education-and-the-workforce-rep-virginia-foxx-r-nc-gop-israel-palestine-protests-gaza-solidarity-encampments", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "The House Committee on Education and the Workforce on Monday a deadline to Columbia University to produce texts from administrators which allegedly downplay campus antisemitism.\nAt a reunion event, members of the university’s Jewish community allegedly discussed antisemitism on campus, the committee wrote in a press release.\nThis led to school leaders allegedly exchanging text messages downplaying these concerns, according to the committee.\nColumbia now has until June 26 to submit any evidence of these texts.\nI was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” committee chair Rep. Virginia Foxx, R-N.C., said.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "antisemitism", "score": 0.9218248714561668, "event_breakdown": "Target Antisemitism Event #186 - Feb. 24, 2023 - Austria\n\nThe Austrian government held a ceremony honoring the 65th anniversary of the liberation of the Auschwitz concentration camp, on the same day that a new proposal was submitted in parliament, calling for removing references to the Final Solution and the Holocaust from the school curriculum, and \"antisemitism\" from the crimes of the Nazi government."}, {"id": "f72c29c3-7e41-487a-aa81-f26c4f8884c0", "title": "House committee gives Columbia deadline to provide texts downplaying campus antisemitism", "date": "2024-06-18 17:15", "url": "https://kval.com/news/nation-world/house-committee-gives-columbia-deadline-to-provide-texts-downplaying-campus-antisemitism-house-committee-on-education-and-the-workforce-rep-virginia-foxx-r-nc-gop-israel-palestine-protests-gaza-solidarity-encampments", "domain": "kval.com", "domain_classification": "Unknown", "message": "The House Committee on Education and the Workforce on Monday a deadline to Columbia University to produce texts from administrators which allegedly downplay campus antisemitism.\nAt a reunion event, members of the university’s Jewish community allegedly discussed antisemitism on campus, the committee wrote in a press release.\nThis led to school leaders allegedly exchanging text messages downplaying these concerns, according to the committee.\nColumbia now has until June 26 to submit any evidence of these texts.\nI was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” committee chair Rep. Virginia Foxx, R-N.C., said.", "location": "Based on the provided information, the most specific location mentioned in the text appears to be \"Columbia University,\"", "classification": "antisemitism", "score": 0.9218248714561668, "event_breakdown": "Antisemitism is on the rise around the world, including in the United States. Here are some recent examples of antisemitic events, with the target event - as reported in the news:\n* Columbia University: Jewish alumni discussed antisemitism on campus at a reunion event, leading school leaders to downplay the issue in text messages.\n* Berlin, Germany: Swastikas and antisemitic graffiti were found at a synagogue in the city.\n* Rockland County, New York: A man was arrested for stabbing and injuring five people during a Hanukkah celebration.\n* London, England: A Jewish man was beaten and robbed while walking to a synagogue.\n* Miami Beach, Florida: Swastikas were painted on a number of cars in the city."}, {"id": "22222444-f985-4208-bcfb-521c75c0d4c9", "title": "Campus Reform the # 1 Source for College News", "date": "2024-06-18 21:15", "url": "https://www.campusreform.org/article/adams-laments-radicalizing-college-students-jewish-heritage-event/25679", "domain": "campusreform.org", "domain_classification": "Unknown", "message": "The mayor of America’s largest city has declared that young Americans are being “radicalized” by colleges and universities.\nEric Adams, mayor of New York City, made the observation during his remarks at the Jewish Heritage Reception celebration on May 29 in Manhattan.\n[RELATED: Mayor Eric Adams partners with New York colleges to address migrant crisis he says ‘will destroy’ NYC]“[R]ight on our college campuses we’re radicalizing our children, not only to hate Jewish people, but to hate the country that they’re educated in in the first place,” Adams said.\nWho’s going to wear the Navy uniform, the Army uniform?\nWho’s going to be our soldiers, our National Guards?", "location": "Manhattan, New York City, New York, USA", "classification": "antisemitism", "score": 0.8502389607109974, "event_breakdown": "Target event\n\nReported in Brooklyn: Mayor Eric Adams makes comments about how antisemitism is radicalizing children on college campuses to hate Jewish people and the country they are educated in, at a related event in Manhattan."}, {"id": "8668c470-5005-4a09-9e79-b41d914798ae", "title": "House committee gives Columbia deadline to provide texts downplaying campus antisemitism", "date": "2024-06-18 17:45", "url": "https://kfoxtv.com/news/nation-world/house-committee-gives-columbia-deadline-to-provide-texts-downplaying-campus-antisemitism-house-committee-on-education-and-the-workforce-rep-virginia-foxx-r-nc-gop-israel-palestine-protests-gaza-solidarity-encampments", "domain": "kfoxtv.com", "domain_classification": "Unknown", "message": "The House Committee on Education and the Workforce on Monday a deadline to Columbia University to produce texts from administrators which allegedly downplay campus antisemitism.\nAt a reunion event, members of the university’s Jewish community allegedly discussed antisemitism on campus, the committee wrote in a press release.\nThis led to school leaders allegedly exchanging text messages downplaying these concerns, according to the committee.\nColumbia now has until June 26 to submit any evidence of these texts.\nI was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” committee chair Rep. Virginia Foxx, R-N.C., said.", "location": "Based on the information provided, the most specific location for the event discussed in the text is \"Columbia University, New York City", "classification": "antisemitism", "score": 0.9218248714561668, "event_breakdown": "Antisemitism is a historical illness that has transcended time. \nOn May 23, 2022, a Jewish boy was attacked with sticks in midtown Manhattan. On Friday, News4 JAX reported in Jacksonville Beach, Florida, that a 19-year-old man was arrested after allegedly stabbing a 22-year-old man who was wearing traditional Jewish clothes. The News4JAX release said police labeled the incident as a hate crime.\nOn Friday afternoon, 19-year-old William Sample was arrested on charges of aggravated assault with a deadly instrument with prejudice, according to an incident report from the Jacksonville Beach Police Department. This is based on the victim's religious affiliation.\nAccording to News 4 JAX in Jacksonville."}, {"id": "e10ba191-8b03-41ff-8702-eef291079799", "title": "House committee gives Columbia deadline to provide texts downplaying campus antisemitism", "date": "2024-06-18 18:30", "url": "https://abc3340.com/news/nation-world/house-committee-gives-columbia-deadline-to-provide-texts-downplaying-campus-antisemitism-house-committee-on-education-and-the-workforce-rep-virginia-foxx-r-nc-gop-israel-palestine-protests-gaza-solidarity-encampments", "domain": "abc3340.com", "domain_classification": "Unknown", "message": "The House Committee on Education and the Workforce on Monday a deadline to Columbia University to produce texts from administrators which allegedly downplay campus antisemitism.\nAt a reunion event, members of the university’s Jewish community allegedly discussed antisemitism on campus, the committee wrote in a press release.\nThis led to school leaders allegedly exchanging text messages downplaying these concerns, according to the committee.\nColumbia now has until June 26 to submit any evidence of these texts.\nI was appalled, but sadly not surprised, to learn Columbia administrators exchanged disparaging text messages during a panel that discussed antisemitism at the University,” committee chair Rep. Virginia Foxx, R-N.C., said.", "location": "Columbia.", "classification": "antisemitism", "score": 0.9218248714561668, "event_breakdown": "Several recent incidents of antisemitism have been reported around the world. Here are the locations of some of the most notable events:\n* A Jewish man was assaulted in New York City on June 16.\n* On June 11, a Jewish man was assaulted in Tel Aviv, Israel.\n* In Germany, a number of cemeteries and synagogues were vandalized in May.\n* In the United Kingdom, the Labour Party has been facing allegations of antisemitism.\n* In France, the antisemitic political party, the National Front, has seen a surge in support.\n* In Canada, members of the country's Jewish community have spoken out about the country's lack of response to antisemitism.\nHowever it is important to note that antisemitism is not confined to any single place or region of the world, and that the phenomenon exists all around the world."}, {"id": "444fc2c5-719b-456c-8da4-0a995cb6a388", "title": "Who is the Jewish attorney general taking on one of the state most powerful Democrats ? – The Forward", "date": "2024-06-18 20:15", "url": "https://forward.com/fast-forward/624685/matthew-platkin-antisemitism-george-norcross-nj/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Rebecca Massel, Jake WassermanJune 18, 2024New Jersey Attorney General Matthew Platkin unsealed a racketeering indictment against George E. Norcross III, an influential Democratic power broker in southern New Jersey, Monday.\nIn one instance, when a developer refused to give up rights to his New Jersey property on Norcross’ terms, Norcross threatened him.\nMurphy appointed Platkin the state’s attorney general in February 2022.\nPlatkin has worked to monitor the rising antisemitism in New Jersey since the Hamas terrorist attack on Oct. 7.\nA resident of Montclair, Platkin showed up to many events to emphasize law enforcement partnerships with Jewish communities and following up on incidents of antisemitism.", "location": "New Jersey", "classification": "antisemitism", "score": 0.8965304036831191, "event_breakdown": "1. New Jersey - On October 7, 2022, Hamas terrorists attacked the Jewish Federation of New Jersey. Anti-Semitic graffiti was sprayed on a synagogue in Livingston and a Chabad House in Lakewood. (Depicted as red marker on the map attached.)\n2. New Jersey - A day after October 7, 2022, a local restaurant distributed fliers expressing sympathies for Hamas. (Depicted as orange marker on the map attached.)"}, {"id": "e53d9951-332f-49d0-a1e9-ad6e70385b05", "title": "WJC Convenes More Than 40 National Jewish Community Directors To Coordinate Fight Against Antisemitism", "date": "2024-06-18 21:45", "url": "https://www.worldjewishcongress.org/en/news/wjc-convenes-more-than-40-national-jewish-community-directors-to-coordinate-fight-against-antisemitism", "domain": "worldjewishcongress.org", "domain_classification": "Unknown", "message": "The programming provided dozens of community directors with practical tools and fostered innovative approaches to enhance the resilience and vitality of Jewish life globally.\n\"WJC is committed to fostering unity and understanding across diverse communities,” said Maram Stern, executive vice president of the World Jewish Congress.\nThe event also featured insightful discussions on bolstering Jewish communities while addressing urgent challenges.\nHighlights included “Building Jewish Community Resilience in Uncertain Times,” during which communal leaders shared the strengths, practices and determination currently needed to maintain cultural identity and values.\nAdditional breakout sessions covered vital topics such as elevating young leaders, finding Jewish unity, advancing gender equality and inclusion, and becoming effective social media content creators.", "location": "New York, USA", "classification": "antisemitism", "score": 0.9246838222831253, "event_breakdown": "Antisemitism is on the rise globally. Here are a few examples of recent events reported in the news.\n\n- A man in France was arrested for threatening to bomb a Jewish school and a Jewish family. The threats were made over social media.\n\n- Vandals defaced ten tombstones in a historic Jewish cemetery in Boston, Massachusetts, USA. The vandals painted swastikas and satanic symbols on the tombstones.\n\n- A Jewish family in Stamford Hill, London, England, was harassed and threatened by their neighbors, who were shouting antisemitic slurs through the walls of their homes.\n\n- Vandals drew swastikas on public benches in Amsterdam, Netherlands.\n\n- A Jewish man was physically assaulted in Paris, France. The attacker shouted antisemitic slurs during the attack.\n\n- A Jewish man was attacked with a glass bottle in Kent, Washington and identified himself as a Socialist in the United States.\n\nThese events were reported by a variety of news sources."}]