[{"id": "014fcb0c-4827-4a6f-bc85-7d1975024760", "title": "The fashionistas fighting antisemitism", "date": "2024-05-22 12:00", "url": "https://www.thejc.com/life-and-culture/the-fashionistas-fighting-antisemitism-g01oy9z5", "message": "Wearing his trademark kippah, influencer Benji Park has been a fixture on the front rows of London’s fashion scene for years.\n“I have become quite accustomed to getting death threats, I am quite desensitised to it.”For Park, the conflict has hit hard.\n“The moment Israel started to defend itself, the hate started; it didn’t take long,” says Park, who has lost 14,000 social media followers since October 7.\n“Antisemitism has spread through the fashion world and across the left.\nThere is life outside of social media.”", "location": "LONDON", "classification": "antisemitism", "score": 0.4778304351296485, "event_breakdown": "* Park lost 14,000 social media followers after Israel defended itself (October 7)\n* Antisemitism has spread through the fashion world (timeline not specified)"}, {"id": "f4aaa614-34e3-48d6-a03f-36548463b702", "title": "  A Sense of Belonging : Harvard Holds Inaugural Affinity Celebration for Jewish Graduates | News", "date": "2024-05-22 08:00", "url": "https://www.thecrimson.com/article/2024/5/22/inaugural-jewish-affinity-graduation-2024/", "message": "More than 100 Harvard affiliates gathered in the Student Organization Center at Hilles Monday evening for an inaugural Jewish graduates affinity ceremony co-hosted by Harvard Hillel and the University.\nThough Hillel has hosted affinity graduation ceremonies in the past, this is the first year Harvard has officially co-hosted the event.\nThe question that some of us asked in the Jewish community, ‘will you be Jewish leaders?’” Zarchi said.\nA student picks up their stole at the Jewish graduates affinity celebration.\nMoriah R. Lit, who will graduate from the Harvard Graduate School of Education this week, recalled how important a role Hillel, the University’s Jewish center, played in supporting Jewish students during her time at Harvard.", "location": "Hilles is the main building of Harvard University. It is located in the center of Harvard Yard in Cambridge, Massachusetts.", "classification": "antisemitism", "score": 0.932640241807564, "event_breakdown": ".\n* The University co-hosted an inaugural Jewish graduates affinity ceremony with Hillel this year."}, {"id": "6047b55d-5d08-4228-83a7-2a7642c45968", "title": "Taiwan , the  Axis of Genocide  and Holocaust amnesia - World Socialist Web Site", "date": "2024-05-22 05:45", "url": "https://www.wsws.org/en/articles/2024/05/21/pvte-m21.html", "message": "It is Germany that committed the first genocide of the last century, the Herero and Namaqua genocide between 1904 and 1908.\nWith social tensions heightening, the German ruling elite turned against its Jewish nationals.\nUnder this arrangement, 60,000 German Jews emigrated to Palestine between 1933 and 1939.\nThat was why German Zionist leaders embraced the Nuremberg laws.\nThis so-called Holocaust memory was instead Holocaust amnesia.", "location": "Germany", "classification": "antisemitism", "score": 0.858514117548836, "event_breakdown": "What are the locations of the antisemtism events in the text?\nGermany, Palestine"}, {"id": "7fcb3a79-88f7-4f2f-9353-0eb8a67121bd", "title": "Auschwitz Jewish Center Foundation ( AJCF ) Announces 2024 Gala Honorees ... ", "date": "2024-05-22 12:45", "url": "https://www.pr-inside.com/auschwitz-jewish-center-foundation-ajcf-announces-2024-gala-honorees-r5011169.htm", "message": "Partner of Quinn, Emanuel, Urquhart & Sullivan, to the Honorable John P. \"Sean\" Coffey of the US Navy, Leonard Fournette of the NFL, and the IL-USDocAid courageous doctors who volunteered to treat victims of mass atrocity, all represent allies and advocates dedicated to building a better future.\"\nThis year's honorees will be invited to participate in AJCF's mission in January 2025 to commemorate the upcoming 80th anniversary of the liberation of the Auschwitz-Birkenau camps.\nPrevious honorees included the Mayor of New York City, The Honorable Eric L. Adams, and former Governor Arnold Schwarzenegger, who visited Auschwitz and AJCF's campus, where he met with Holocaust survivors and made headlines around the world by renouncing hate.In addition to the honorees, the Gala also includes many Holocaust survivors as special guests.\nAJCF's American Service Academies Program (ASAP) is highlighted at the event.\nThis distinguished program selects a group of top cadets and midshipmen from the U.S. Army, Naval, Coast Guard, Air Force and Space Force academies for an intensive course in Ethical Responsibility in the Military.", "location": "BEVERLY HILLS, CALIFORNIA", "classification": "antisemitism", "score": 0.4088424592570681, "event_breakdown": "Antisemitism Events:\n\n1. Commemorative mission in January 2025 to commemorate the upcoming 80th anniversary of the liberation of the Auschwitz-Birkenau camps.\n2. Visit to Auschwitz by the American Service Academies Program (ASAP) cadets and midshipmen from the U.S. Army, Naval, Coast Guard, Air Force and Space Force academies.\n3. Renouncing hate by Arnold Schwarzenegger, who visited Auschwitz and AJCF's campus, where he met with Holocaust survivors and made headlines around the world.\n4. Press release from the Mayor of New York City, The Honorable Eric L. Adams, and former Governor Arnold Schwarzenegger, who visited Auschwitz and AJCF's campus, where he met with Holocaust survivors."}, {"id": "69bc0a8e-1275-41db-98aa-f4d4eb75e4fb", "title": "No confidence vote on Wake Forest President fails", "date": "2024-05-22 17:30", "url": "https://mcdowellnews.com/news/state-regional/education/no-confidence-wake-forest-university-pro-palestinian/article_59830681-114e-5894-bcd9-e0eba928b6b9.html", "message": "A no-confidence vote on the leadership of Wake Forest University President Susan Wente failed after not enough faculty members voted to move the effort forward on Monday afternoon.\n“There was no mention of students, no mention of the police, no mention of Gaza,” Yarfitz said of the meeting.\nVotes of no-confidence have been held at schools such as Indiana University, the University of Kentucky, Barnard College and, most recently, Columbia University, where arts and sciences faculty passed a vote of no-confidence against university President Minouche Shafik.\n‘Part of a pattern’“President Wente played the central role in the mistakes of the administration,” reads a statement at the beginning of the presentation.\n“Ideas in tension can bring vibrancy to our education, research and creative activities but can also create challenges.", "location": "Winston-Salem, North Carolina", "classification": "antisemitism", "score": 0.40669509028665746, "event_breakdown": ".\n1. On Monday evening, Wake Forest University President Susan Wente held a town hall-style meeting with students to address their concerns about the Gaza-Israel conflict in May. \n2. As of Tuesday afternoon, the request for a no-confidence vote on Susan Wente as president had failed after not enough faculty members voted to move the effort forward.\n3. Susan Wente's leadership team said that they will prioritize diversity and inclusion in upcoming strategic planning efforts.\n4. The meeting was looking to build collaboration based on a shared set of norms for civil discourse.\n5. None of the students at Monday's meeting were from Jewish organizations, and two students walked out in protest of what they perceived as one-sided discussions on the conflict.\n6. \n\nA separate statement protesting the university’s response claimed that numerous university events “which reinforced a pro-Israel narrative” took priority over other events.\n1. The police department of Wake Forest University refused to meet with students to discuss adapting the police's operation to be more respectful of student and faculty rights, according to Corey Rogers, a spokesperson for Wake Forest University Police Department.\n2. The faculty supported a scheduled appearance by Israeli Ambassador Michael Oren, which was opposed by some students who linked Israeli actions in the Middle East to the violence against Palestinians."}, {"id": "bc916d6e-3589-4f0d-aaa9-39d2a58e55d0", "title": "The students , united , will never be defeated", "date": "2024-05-22 02:00", "url": "https://honisoit.com/2024/05/the-students-united-will-never-be-defeated/", "message": "Clearly, media platforms are more curious about politicians’ response to the encampment rather than the encampment’s impacts on students and the education sector.\nOther tactics, including The Daily Californian’s 24-hour coverage and The George Washington Hatchet’s regular op-eds, centred student media within broader pro-Palestinian activism.\nMyth-bustingCritically, mainstream media outlets eclipse some of the key voices vital to the Gaza solidarity encampments: those of students.\nThese Israeli universities do not only operate on and profit off from stolen land: they perpetuate dispossession.\nAdditional information has been provided by Students Against War, USyd Education Action Group, and UniMelbforPalestine.", "location": "Sydney", "classification": "antisemitism", "score": 0.5317930474285641, "event_breakdown": "List Of Antisemitism Reports:\n\n- Students Against War, USyd Education Action Group, and UniMelb for Palestine unveil a banner with a \"drop money here\" sign that includes a Star of David symbolizing Jewish people and reads \"drop the Jews here\" at the Gaza Solidarity Encampment on May 19.\n- An unnamed campus organization at the Gaza Solidarity Encampment raises awareness of alleged \"Israeli atrocities\" through the distribution of face masks with an image that some say includes blood. (Location: Eastern Avenue, University of Sydney).\n- The Sydney Jewish student organization slams tents at the Gaza Solidarity Encampment for resembling striped concentration camp prisoner uniforms, tweeting the camps contributed to a tense and intimidating atmosphere. (Location: Sydney University)"}, {"id": "213de0bc-afd3-4025-a35a-da73807c7b3a", "title": "Some pro - Palestinian encampments want their schools to cut ties with Hillel , Chabad", "date": "2024-05-22 22:15", "url": "https://www.jta.org/2024/05/22/united-states/some-pro-palestinian-encampments-want-their-schools-to-cut-ties-with-hillel-chabad", "message": "At Drexel University in Philadelphia and the University of California, Santa Cruz, pro-Palestinian protesters have demanded their universities cut ties with, or “terminate” the presence of, the schools’ Hillel chapters.\n“Calling for a ‘complete boycott’ of and to ‘cut ties’ with Hillel — the center of Jewish life on most campuses… is antisemitic.\nAt the same time, it claims a mantle of being there for all Jewish students,” Rofeberg told the Jewish Telegraphic Agency.\nHe also specifically referenced the Hillel and Chabad demands as “unacceptably targeting… two Jewish campus organizations” in a campus-wide memo.\nThe directors of Chabad Serving Drexel University, meanwhile, said they weren’t fazed by the call to “immediately terminate” them.", "location": "Philadelphia", "classification": "antisemitism", "score": 0.9295637644019547, "event_breakdown": "Here is the list:\n- Pro-Palestinian protesters demand Drexel University in Philadelphia cut ties with Hillel chapter.\n- University of California, Santa Cruz students demand the university end its relationship with Hillel chapter.\n- In Philadelphia, director of Chabad Serving Drexel University says they aren’t fazed by calls to be terminated."}, {"id": "861f9436-f7e5-4679-aa87-71f5122451db", "title": "The strongest Jewish organization , from a cultural standpoint , lives in Portugal", "date": "2024-05-22 17:30", "url": "https://ejpress.org/the-strongest-jewish-organization-from-a-cultural-standpoint-lives-in-portugal/", "message": "By Gabriela CantergiAt the heart of the Jewish community of Oporto, a native of Brooklyn is affectionately called “the boss”.\nThe museums of the Jewish community of Oporto play an important national role, as does its art gallery, the largest Jewish library of the Iberian Peninsula and other cultural facilities.\nNow the Jewish community of Oporto is producing the documentary film “The 2000 Exiled Jewish Children” that will premiere in 2024.\nMoreover, B’nai B’rith Portugal, one of the branches of the Jewish community of Oporto includes members from all Portugal and all continents.\nIt could be assumed that the Portuguese state would be proud of the development of its Jewish community, taking into account that Europe has a plan to promote Jewish life.", "location": ")\nOporto, Portugal", "classification": "antisemitism", "score": 0.7757357677317955, "event_breakdown": "* In Oporto, Brooklyn native Gabriela Cantergi  is affectionately called \"the boss\" by a leading Jewish institution in Portugal.\n* A Jewish citizen of Oporto has covered recent history in the documentary \"The 2000 exiled Jewish children.\"\n* Recalling this, reading about B'nai B'rith Portugal, the Portuguese branch of a major Jewish organization, probably included reference to events and plans to promote a Jewish life for Portugal."}, {"id": "808841ca-4a35-4bfb-a7ec-9e51d33b5d8d", "title": "Jewish Social Club Celebrates 100 Years of Camaraderie and Service", "date": "2024-05-22 23:00", "url": "http://www.washingtonjewishweek.com/jewish-social-club-celebrates-100-years-of-camaraderie-and-service/", "message": "A local Jewish social club, the Amity Club, is celebrating its 100th anniversary and reflecting on the friendship, Jewish connection, philanthropy and fun that’s been at the organization’s core and is now more important than ever with the global rise in antisemitism.\nThe club began in 1924 when a group of Jewish professionals came together to play cards at a time when Jews weren’t allowed in many social organizations.\nThe group holds standard social club activities such as golf events and dinners with high-profile guest speakers, but members are also involved in the community and work to give back to the area.\nWollins said that the club is involved in two types of philanthropic work, which he described as either active or passive.\nWollins also spoke about the importance of having a Jewish social group while antisemitism is sharply rising and reflected on how the story today somewhat mirrors theclub’s founding.", "location": "Richmond, Virginia, USA", "classification": "antisemitism", "score": 0.9456977353451659, "event_breakdown": "null"}, {"id": "4cc2cbf0-ca14-403f-b3c2-23f0a2ae9134", "title": "Israeli Minister Warns Palestinian State Would Spell Israel  Destruction  ", "date": "2024-05-22 21:30", "url": "https://www.breitbart.com/politics/2024/05/22/exclusive-israeli-minister-warns-palestinian-state-would-spell-israels-destruction-bidens-pressure-plain-stupidity/", "message": "Rothman’s remarks follow a speech he delivered to a visiting IHF delegation currently visiting Israel to express solidarity with Jewish state.\nA two-state solution is the only way to guarantee the long-term security of both the Israeli and the Palestinian people.\nRead my latest in @Newsweek: https://t.co/ZqGbjeH8lx — Bassem Eid (@realbassemeid) January 28, 2024Despite the numerous proposals, every Israeli attempt to offer land concessions for a Palestinian state has been met with terror waves.\nAdditionally, Israeli Prime Minister Benjamin Netanyahu has vowed that he will not allow a Palestinian state as long as he remains in office.\nAccording to former President Donald Trump, President Biden “has totally abandoned Israel.”Imagine if Norway, Sweden, and Ireland had recognized the State of Al-Qaeda after 9/11.", "location": "Israel", "classification": "antisemitism", "score": 0.4764059415502993, "event_breakdown": "null"}, {"id": "e05a0974-5a06-4e7d-b83d-ba5e1888461d", "title": "Islamic News | What Did You Say ? ", "date": "2024-05-22 20:00", "url": "https://whatdidyousay.org/category/islamic-news/", "message": "Israeli Defense Forces say 10 of the hostages are Israeli citizens and two more are foreigners.\n“The released hostages’ convoy is currently making its way through Egypt to the meeting point with our soldiers at Kerem Shalom.\nBoth parties say the other instigated a fire-fight that took place at the site of one of the detonations.\nWhile the U.N. has already condmened the Oct. 7 massacre, experts who spoke at Israel’s Tuesday event say U.N. rights bodies “downplayed” and “minimised” the sexual violence.\nCiting privacy and confidentiality laws, Banks declined to say how many students were disciplined or provide more details but said he did not suspend all the hundreds in the hallway.", "location": "Based on the text provided, I was unable to determine a specific location for the event described.", "classification": "antisemitism", "score": 0.4173308253651529, "event_breakdown": "null"}]