[{"id": "522260d0-2620-47e5-841f-5b024985a21a", "title": "Kamala Harri VP pick disappoints some who hoped for a new milestone : the first Jewish vice president", "date": "2024-08-07 00:45", "url": "https://fortune.com/2024/08/06/kamala-harris-vp-walz-shapiro-jewish/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Republicans, meanwhile, tried to paint Harris’ choice as a snub to Jewish voters, a traditionally Democratic constituency that former President Donald Trump has tried to court in this year’s race.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\nOnly 30% of Jewish voters supported Trump in 2020, while 69% supported Biden, according to AP VoteCast, a sweeping survey of the electorate.\nThat made Jewish voters one of the religious groups where support for Biden was strongest.", "location": "HARRISBURG", "classification": "antisemitism", "score": 0.7186788587510774, "event_breakdown": "Target event: Nationalist Marches in Poland\nThe Nationalist March in Warsaw, Poland, took place this Sunday with thousands of people protesting. Marches took place in cities around the country, including Bialystok, Lublin, and Krakow, but the largest number and widespread attention occurred in the capital, Warsaw. Polish nationalists held their annual march on November 11th celebrating Poland's Independence Day. According to reports on social media, groups chanted slogans of white supremacy and promoted antisemitism by calling for a \"Jew free Poland\". This has sparked particular concern in the country both because of its historical significance and because of Poland's WWII history. The Polish government claims that the march is not officially supported by the Polish religion."}, {"id": "b2097cb9-2355-465c-b14b-9da7160e5a7d", "title": "Some Democratic backers of Josh Shapiro see a missed chance for a Jewish vice president", "date": "2024-08-07 00:45", "url": "https://www.local10.com/news/politics/2024/08/06/some-democratic-backers-of-josh-shapiro-see-a-missed-chance-for-a-jewish-vice-president/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Josh Shapiro speaks before Democratic presidential nominee Vice President Kamala Harris and her running mate Minnesota Gov.\nJosh Shapiro, who was one of Harris’ finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\n“That’s just called stewardship and accountability.”Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro.", "location": "United States", "classification": "antisemitism", "score": 0.6547640486855726, "event_breakdown": "* In New Jersey, antisemitic graffiti was found in the historic Congregation Beth Israel Synagogue in Hackensack.\n* In Vancouver, a swastika was drawn on a street in Mount Pleasant.\n* In Iceland, antisemitic graffiti was found in a Reykjavík suburb."}, {"id": "72b1a686-d92d-4f35-bf7a-844add010d82", "title": "Some Democratic backers of Josh Shapiro see a missed chance for a Jewish vice president", "date": "2024-08-07 00:30", "url": "https://www.wsls.com/news/politics/2024/08/06/some-democratic-backers-of-josh-shapiro-see-a-missed-chance-for-a-jewish-vice-president/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Josh Shapiro speaks before Democratic presidential nominee Vice President Kamala Harris and her running mate Minnesota Gov.\nJosh Shapiro, who was one of Harris’ finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president.\n“I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator.\nThey can’t, because there are none.”The last Jewish Republican senator was former Sen.\n“That’s just called stewardship and accountability.”Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro.", "location": ".\nUnited States of America", "classification": "antisemitism", "score": 0.6547640486855726, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category antisemitism, and not a past event.\nEvent: In North Carolina, a group of demonstrators held a rally on Saturday to protest against the eviction moratorium, which had been extended by President Biden, and to also support the release of a man accused of the U.S. Capitol insurrection on Jan. 6 by a group called \"Latinos for Trump. \"'It's a Nazi soup,' said Rabbi Stephanie Kolinofsky of the Raleigh-Cary JCC. 'From signs comparing Dr. Fauci to Hitler to swastika flags, it devalues the history and memory of victims of the Holocaust.'\"\nEvent: A New Jersey state senator has apologized for a series of tweets in 2020 that accused Orthodox Jews of wanting to firebomb an African American church.\nEvent: At the Texas A&M game, 'Jews did something wrong' was written in the end zone, and a swastika was painted on a library sign.\nEvent: A memorial service was held at a synagogue in Florida for the 11 victims of the Pittsburgh synagogue shooting."}, {"id": "b46b0aec-aa51-4fce-9ec7-64fbce5ba962", "title": "Minnesota Jewish leaders highlight VP pick Tim Walz platform", "date": "2024-08-07 00:00", "url": "https://www.jpost.com/diaspora/article-813633", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "With Shapiro, as the second Jewish Vice Presidential nominee in history, came antisemitic attacks over his support of Israel.\nWalz,\" Roberts said.\nShapiro,\" Roberts said.\nWalz has an understanding of rural and urban America, two important things Kieffer Leonard said have been missing from the Democratic Party.\n\"Certainly expressing some of the most important principles with respect to the Jewish community, and Israel and antisemitism.\"", "location": ".\nMinnesota", "classification": "antisemitism", "score": 0.9551928857668384, "event_breakdown": "1. Minnesota governor Tim Walz condemned antisemitism in the state after a local resident said he was attacked while walking to synagogue on July 28.\n2. A swastika was painted on the car of a Jewish mayoral candidate in Mount Laurel, N.J. on July 26."}, {"id": "542a0bdd-f454-4eff-83e2-8c139f51e3a8", "title": "French Director Michel Hazanavicius Voices Fears Over Rising Antisemitism :  How Could I Have Become So Evil In Such A Short Time ? ", "date": "2024-08-07 11:30", "url": "https://www.yahoo.com/news/french-director-michel-hazanavicius-voices-101429772.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "French Director Michel Hazanavicius Voices Fears Over Rising Antisemitism: “How Could I Have Become So Evil In Such A Short Time?”Oscar-winning director and screenwriter Michel Hazanavicius has voiced his fears over rising antisemitism in a heart-felt opinion piece in France’s Le Monde newspaper.\nIn his opinion piece, Hazanavicius said that until recently his Jewishness had been just one aspect of his identity, to which he did not give much thought, but this was now changing.\nTo react as a Jew, to think as a Jew, basically to be Jewish above all,” he wrote.\nThe opinion piece comes amid a sharp rise in the number of recorded antisemitic incidents in Europe and North America, in the wake of Hamas’s October 7 attack on Israel.\nWhy does every Jew who says or does something stupid have to take all his people with him?", "location": "PARIS, FRANCE", "classification": "antisemitism", "score": 0.9384913061490383, "event_breakdown": "Target event that reports news push about an event that is happening in the current time frame and belongs to to the category antisemitism, and not a past event.Unexpectedly, I couldn't match the target event."}, {"id": "b70bc1cf-95ba-4b2f-82f2-805683af08c2", "title": "Deadline", "date": "2024-08-07 13:30", "url": "https://deadline.com/print-article/1236033547/", "domain": "deadline.com", "domain_classification": "Unknown", "message": "Oscar-winning director and screenwriter Michel Hazanavicius has voiced his fears over rising antisemitism in a heart-felt opinion piece in France’s Le Monde newspaper.\nIn his opinion piece, Hazanavicius said that until recently his Jewishness had been just one aspect of his identity, to which he did not give much thought, but this was now changing.\nTo react as a Jew, to think as a Jew, basically to be Jewish above all,” he wrote.\nThe opinion piece comes amid a sharp rise in the number of recorded antisemitic incidents in Europe and North America, in the wake of Hamas’s October 7 attack on Israel.\nThe director said in his opinion piece that he felt like there was growing reticence about talking about the Holocaust, saying he feared its trivialization would open door to more antisemitism.", "location": "FRANCE", "classification": "antisemitism", "score": 0.962195028463306, "event_breakdown": "Title: Rising Antisemitism in Europe\n\nAntisemitism is on the rise in countries like Hungary, France, and Germany. In Hungary, there are reports that an anti-Semite has been charged with a hate crime after insulting Jews in emails. In France, two soldiers were attacked in Toulouse by teens who were yelling antisemitic slurs. In Germany, two Jews were assaulted outside of a synagogue in Essen. \nJewish man were attacked for recieving charity in Germany"}, {"id": "47a9297a-1347-4f7e-ad41-ca60900cdd8d", "title": "Jewish group accuse police of letting Islamist extremism go unchallenged", "date": "2024-08-07 14:15", "url": "https://www.express.co.uk/news/politics/1933264/police-row-explodes-jewish-group", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "West Midlands Police address Birmingham disorderThe Campaign Against Antisemitism has accused the country’s police of emboldening the far-right after months of ignoring extremist Islamist protests.\nThe Campaign Against Antisemitism has now responded, telling the Express that the police bear responsibility for the violence after months of letting extremist pro-Gaza activists “go unchallenged”.\nA spokesman for the Jewish group blasted: “The violence that we are seeing now on the streets of Britain is appalling, and we welcome the urgent and robust response from the authorities.\nNotwithstanding our repeated calls to crack down on extremists on our streets over the past year, they were allowed to go unchallenged.\nRead our Privacy PolicySpeaking last night, a top officer from West Midlands Police reacted to the distressing scenes of weapon-wielding Asian men attacking and intimidating journalists, describing the riot as mostly law-abiding.", "location": "Birmingham", "classification": "antisemitism", "score": 0.5263066139579287, "event_breakdown": "The target event was not found in the story."}, {"id": "14394507-6f5c-4151-a95a-5b0c7b19a780", "title": "He fights antisemitism and is close to the Jewish community : All about Kamala Harris", "date": "2024-08-07 07:45", "url": "https://www.ynetnews.com/article/rkedk9e5a", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "3 View gallery Tim Walz participates in event at Chabad in MinnesotaAll in all, Walz has very positive attitudes toward Israel.\nHe has spoken about the need to ensure the security of the State of Israel.\n3 View gallery Vice President Kamala Harris named Minnesota Gov.\nRegarding the campus demonstrations directed against Jewish students, Walz said: \"When Jewish students tell us that they feel unsafe, we have to believe them.\nSenior officials in the Jewish community in Minnesota describe Harris' new deputy as \"a good person.\"", "location": "Minnesota", "classification": "antisemitism", "score": 0.8726404575601733, "event_breakdown": "Target event: Kamala  Harris ' naming of Minnesota Governor Tim Walz as a senior advisor has some Hoosiers and other conservatives groping for words.\nA report from Chabad in Minnesota about Governor Tim Walz's position on Israel.\nTarget event: Tim Walz ' participation in the event at the Chabad in Minnesota and his positive attitudes to Israel."}]