[{"id": "d8e4c6f0-5b0e-42f6-8960-a0ec05e72204", "title": "Israel Strike in Bint Jbeil Kills Hezbollah Fighter and His Sister", "date": "2024-07-16 15:30", "url": "https://dailystar.com.lb/israel-strike-bint-jbeil-kills-hezbollah-fighter-sister/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "An Israeli airstrike recently resulted in the deaths of a Hezbollah fighter and his sister in southern Lebanon, as reported by the National News Agency (NNA) and confirmed by Hezbollah.\nFollowing this, Hezbollah retaliated by launching rockets towards northern Israel.\nThe Israeli military disclosed that its targets on Monday were an arms depot and a military installation used by Hezbollah, the Iran-supported group.\nAccording to the NNA, the strike in the town of Bint Jbeil killed a brother and sister from the Dagher family and severely injured another sister when their home was hit twice and destroyed.\nLater, Hezbollah acknowledged the loss of one of its fighters from the Dagher family in these strikes.", "location": "Lebanon", "classification": "security", "score": 0.9517283375965829, "event_breakdown": "Israel reportedly targeted an arms depot and a military installation used in the retaliatory rockets launched by Hezbollah towards the northern area of Israel and the death of a Hezbollah fighter and his sister in southern Lebanon."}, {"id": "28622db2-62ba-4f94-a4a0-14714a95ac77", "title": "Nine More Palestinian Civilians Killed In Israeli Airstrike On Central Gaza", "date": "2024-07-16 02:15", "url": "https://menafn.com/1108442554/Nine-More-Palestinian-Civilians-Killed-In-Israeli-Airstrike-On-Central-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) GAZA, Jul 16 (NNN-WAFA) – At least nine more Palestinian civilians were killed, in an Israeli targeting the Nuseirat refugee camp, in the central Gaza Strip, Palestinian sources said, yesterday.\nThe Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighbouring houses, security sources, said.\nThe airstrike killed nine people and several others, all transported to the hospital, medical sources said.\nMeanwhile, the al-Qassam Brigades announced that, some Zionist soldiers were killed and injured, due to the explosion of a leftover missile in two tanks, in the Tel Al-Hawa neighbourhood, in western Gaza City.\nThey must never be used for military or fighting purposes,” UNRWA Commissioner-General, Philippe Lazzarini, said on social media platform X.– NNN-WAFA", "location": "GAZA", "classification": "security", "score": 0.9566775552226461, "event_breakdown": "GAZA, Jul 16 (NNN-WAFA) – At least nine more Palestinian civilians were killed, in an Israeli airstrike targeting the Nuseirat refugee camp, in the central Gaza Strip, Palestinian sources said, yesterday.\nThe  Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighbouring houses, security sources, said.\nThe airstrike killed nine people and several others, all transported to the hospital, medical sources said.\nMeanwhile, the al-Qassam Brigades announced that, some Zionist soldiers were killed and injured, due to the explosion of a leftover missile in two tanks, in the Tel Al-Hawa neighbourhood, in western Gaza City.\nThe Israeli airstrike targeted a home in the Nuseirat refugee camp in the central Gaza Strip, killing nine people and causing significant damage to neighbouring houses. The Israeli attack came in response to the explosion of a leftover missile in two tanks in the Tel Al-Hawa neighbourhood of western Gaza city. The al-Qassam Brigades claimed responsibility for the attack on the tanks."}, {"id": "9a74f064-db2a-43ed-a59e-0044ca16de30", "title": "Israeli strikes across Gaza kill at least 50 , Palestinian health officials say", "date": "2024-07-16 15:45", "url": "https://www.channelnewsasia.com/world/israeli-strikes-across-gaza-kill-least-50-palestinian-health-officials-say-4482826", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "GAZA: Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday (Jul 16), and Palestinian health officials said at least 50 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, the Gaza health officials said.\nAn Israeli airstrike killed four in Sheikh Zayed in northern Gaza, they said.\nHours later, an Israeli air strike on a school in the Nuseirat camp killed 16 people and wounded many others, health officials said.\nThe Israeli military said troops continued \"intelligence-based\" activities in Rafah, and that airstrikes had targeted militants, tunnels, and other Hamas military infrastructure.", "location": "GAZA STRIP", "classification": "security", "score": 0.9889465354920633, "event_breakdown": "Gaza"}, {"id": "ec2f9f82-05dd-409d-9159-66f73ddf9ccc", "title": "Yemen Houthis target three vessels , including oil tanker , in Red , Mediterranean seas", "date": "2024-07-16 08:30", "url": "https://www.stabroeknews.com/2024/07/16/news/world/yemens-houthis-target-three-vessels-including-oil-tanker-in-red-mediterranean-seas/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "(Reuters) – Yemen’s Houthis targeted three vessels, including an oil tanker, in the Red and Mediterranean seas with ballistic missiles, drones and booby-trapped boats, they said yesterday.\nIt recently has become more effective at damaging ships – largely through using unmanned, armed watercraft that damage a vessel’s vulnerable waterline.\nIn a televised speech, Saree said the Houthis have targeted the Bentley I refined products carrier and the Chios Lion oil tanker in the Red Sea.\nThe vessel conducted “self-protection measures” and after 15 minutes the small craft aborted the attack, UKMTO said.\nSince November, Houthi militants in Yemen have launched drone and missile strikes in shipping lanes in the Red Sea and Gulf of Aden.", "location": "Based on the text provided, the most specific location where the main event takes place is: Yemen", "classification": "security", "score": 0.6722048742448102, "event_breakdown": "Location: Red and Mediterranean Seas\nHouthis in Yemen targeted three vessels, including an oil tanker, in the Red and Mediterranean seas with ballistic missiles, drones, and booby-trapped boats. The attacks in the Red Sea targeted the Bentley I refined products carrier and the Chios Lion oil tanker, while the oil tanker in the Mediterranean was also mentioned."}, {"id": "ead46977-dbb7-40cf-8fcc-b6e31ee649d7", "title": "Deif believed dead , most Hamas fighters , rockets gone in Shejaia", "date": "2024-07-16 19:00", "url": "https://www.jpost.com/israel-hamas-war/article-810555", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In addition, the estimate was that Hamas rockets in Shejaia were down to 15 rockets from an original inventory of 63, a drop of over 75%.\n(IDF SPOKESPERSON'S UNIT)Multiple IDF sources projected continued confidence that Hamas military chief Mohammed Deif is dead.\nMoreover, IDF sources gave some surprising answers about the number of dead Hamas forces in the war to date.\n(IDF SPOKESPERSON'S UNIT)Others at the time said the number was closer to 14,000.\nIDF sources strongly believe this was how they located Deif, regardless of whether he survived the attack.", "location": "NULL", "classification": "security", "score": 0.965231719392201, "event_breakdown": "1. Hamas Rockets in Shejaia: In Shejaia, Hamas rockets were estimated to number 15 from an original 63, a drop of over 75%, determined by IDF sources.\n2. Death of the Hamas Military Chief: Hamas military chief Mohammed Deif was projected by IDF sources to have died, based on their confidence.\n3. Death Toll of Hamas Forces: IDF sources provided an estimate of approximately 14,000 as the number of dead Hamas forces in the war till that date."}, {"id": "36f47d57-69da-4a6c-8207-020ceb327a5c", "title": "9 Palestinians killed in Israeli airstrike on central Gaza | Central India Premier English Daily", "date": "2024-07-16 04:30", "url": "https://www.centralchronicle.com/9-palestinians-killed-in-israeli-airstrike-on-central-gaza/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Gaza, July 16 (UNI) At least nine Palestinians were killed in an Israeli airstrike targeting the Nuseirat refugee camp in the central Gaza Strip, Palestinian sources said Monday.\nThe Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighboring houses, security sources told Xinhua.\nThe airstrike killed nine people and injured several others, all transported to the hospital, medical sources told Xinhua.\nThere was no immediate comment from the Israeli army on this incident.\nMeanwhile, al-Qassam Brigades, the armed wing of Hamas, announced that some Israeli soldiers were killed and injured due to the explosion of a leftover missile in two tanks in the Tel Al-Hawa neighborhood in western Gaza City.", "location": "GAZA", "classification": "security", "score": 0.9967724253580679, "event_breakdown": "Gaza, July 16 (UNI): At least nine Palestinians were killed in an Israeli airstrike targeting the Nuseirat refugee camp in the central Gaza Strip, Palestinian sources said Monday. The Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighboring houses, security sources told Xinhua. The airstrike killed nine people and injured several others, all transported to the hospital, medical sources told Xinhua. There was no immediate comment from the Israeli army on this incident."}, {"id": "64dab8b4-7573-4702-9e29-96e8a0915f4e", "title": "8 security personnel among 18 killed in Bannu attack", "date": "2024-07-16 13:00", "url": "https://pajhwok.com/2024/07/16/8-security-personnel-among-18-killed-in-bannu-attack/", "domain": "pajhwok.com", "domain_classification": "Unknown", "message": "PESHAWAR (Pajhwok): Eight security personnel and 10 alleged militants have been killed in Monday’s suicide attack in Pakistan’s Khyber Pakhtunkhwa province, the military said on Tuesday.\nThe Inter-Services Public Relations (ISPR) said the 10 terrorists tried to enter Bannu Cantonment in the early hours of Monday, but their effort was “effectively thwarted” by security personnel.\nFrustrated by the security forces, the terrorists rammed an explosives-laden vehicle into the perimeter wall of the cantonment, a statement from ISPR said.\n“In the ensuing operation, the troops effectively engaged the terrorists and as a result, all 10 terrorists were killed,” the statement added.\nSecurity personnel cordoned off the site soon after the explosion, which shattered windowpanes in nearby houses and shook buildings.", "location": "Khyber Pakhtunkhwa", "classification": "security", "score": 0.8584403418223617, "event_breakdown": "Event: Eight security personnel and 10 alleged militants have been killed in Monday’s suicide attack in Pakistan’s Khyber Pakhtunkhwa province\nmore"}, {"id": "0aa8b4d7-1957-4156-a188-cd34efb55560", "title": "Israeli strikes across Gaza kill at least 57 , Palestinian health officials say", "date": "2024-07-16 15:45", "url": "https://www.swissinfo.ch/eng/israeli-strikes-across-gaza-kill-at-least-57%2c-palestinian-health-officials-say/83950363", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli strikes across Gaza kill at least 57, Palestinian health officials say5 minutesBy Nidal al-Mughrabi and Hatem KhaledCAIRO/GAZA (Reuters) – Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nThe Israeli military said the strike targeted a senior militant of the Islamic Jihad group, an ally of Hamas.\nAt least 38,713 Palestinians have been killed in Israel’s retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9716614557653026, "event_breakdown": "Israeli airstrikes across Gaza kill at least 57, Palestinian health officials say"}, {"id": "b25ef6c1-6b94-4218-959f-c6673bfb15cc", "title": "At least 57 killed in airstrikes as Israel steps up attacks in Gaza", "date": "2024-07-16 23:00", "url": "https://tribune.com.pk/story/2480352/at-least-57-killed-in-airstrikes-as-israel-steps-up-attacks-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAn Israeli airstrike also killed four in Sheikh Zayed in northern Gaza, they said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9633467792074316, "event_breakdown": "Israeli airstrike kills 17 Palestinians in Khan Younis, southern Gaza\nIsraeli airstrike kills four in Sheikh Zayed, northern Gaza"}, {"id": "69645294-6600-44d0-be83-5c898eb58386", "title": "Hezbollah responds : 20 rockets fired towards Kiryat Shmona and the area", "date": "2024-07-16 00:00", "url": "http://www.israelnationalnews.com/news/393097", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A barrage of 20 rockets was fired on Monday evening by Hezbollah from Lebanon towards Kiryat Shmona and the surrounding area.\nAccording to reports in Syria, the attack targeted and eliminated businessman Muhammad Bara'a al-Katarji, who is close to the Assad regime and a commander in Hezbollah.\nThe businessman who was eliminated served as a money changer who helped finance Hezbollah and other organizations in the region.\nAccording to reports in Syria, he was one of the most important businessmen associated with President Bashar Al-Assad's regime.\nThe strike took place in an area close to Syria's border with Lebanon, on the same road where Hezbollah leader Hassan Nasrallah's former bodyguard was killed.", "location": "Lebanon", "classification": "security", "score": 0.9403020313842163, "event_breakdown": "Event 1: 20 rockets were fired from Lebanon towards Kiryat Shmona and the surrounding area, on Monday night.\nEvent 2: Syrian businessman Muhammad Bara'a al-Katarji, who is close to the Assad regime and a commander in Hezbollah, was killed by a barrage of rockets fired by Hezbollah on Monday night."}, {"id": "3f92285a-fbe7-4e11-a488-945f5736d22e", "title": "Hezbollah responds : 20 rockets fired towards Kiryat Shmona and the area", "date": "2024-07-16 00:45", "url": "https://www.israelnationalnews.com/news/393097", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A barrage of 20 rockets was fired on Monday evening by Hezbollah from Lebanon towards Kiryat Shmona and the surrounding area.\nAccording to reports in Syria, the attack targeted and eliminated businessman Muhammad Bara'a al-Katarji, who is close to the Assad regime and a commander in Hezbollah.\nThe businessman who was eliminated served as a money changer who helped finance Hezbollah and other organizations in the region.\nAccording to reports in Syria, he was one of the most important businessmen associated with President Bashar Al-Assad's regime.\nThe strike took place in an area close to Syria's border with Lebanon, on the same road where Hezbollah leader Hassan Nasrallah's former bodyguard was killed.", "location": "The main location where the main event takes place is 'Kiryat Shmona and the surrounding area'.", "classification": "security", "score": 0.9403020313842163, "event_breakdown": "Target event:\nHezbollah fire rockets at areas in southern Lebanon, according to Syrian opposition reports."}, {"id": "6509e366-5128-47ff-bbeb-dae406240611", "title": "Moldovan children were in Kyiv Okhmatdyt hospital during Russian missile attack", "date": "2024-07-16 21:30", "url": "https://www.yahoo.com/news/moldovan-children-were-kyivs-okhmatdyt-180518332.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Cristina Gerasimov during a visit to the Okhmatdyt hospital building destroyed by the RussiansMoldovan Deputy Prime Minister Cristina Gerasimov, who paid a visit to Kyiv, has said that children from Moldova were in the Okhmatdyt children's hospital in the Ukrainian capital during the Russian missile attack on 8 July.\nSource: Gerasimov on Facebook, as reported by European PravdaDetails: During her visit to Kyiv, Gerasimov visited the largest children's hospital in Ukraine, Okhmatdyt, which was damaged by a Russian missile strike.\n\"The Russian missile completely destroyed the intensive care unit; 24 units were damaged in total... At that moment, there were more than 600 patients in the hospital, children suffering from incurable diseases – in particular, children from Moldova, one of whom was on the operating table at the time of the attack.\nThe atrocities against all Ukrainians must stop,\" the Moldovan deputy prime minister added.\nBackground:Moldova's Deputy Prime Minister for European Integration arrived in Kyiv on 15 July and met with her Ukrainian counterpart, Olha Stefanishyna.", "location": "KYIV", "classification": "security", "score": 0.44981567989633586, "event_breakdown": "Russian missile destroys Okhmatdyt children's hospital in Kyiv."}, {"id": "b6de6f41-b835-4f25-88f1-a2fc4796c50c", "title": "Yemen Houthis attack ships in Red , Mediterranean seas", "date": "2024-07-16 04:30", "url": "https://www.goulburnpost.com.au/story/8697447/yemens-houthis-attack-ships-in-red-mediterranean-seas/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "The Master of that ship reported being attacked by three small craft.\nOne of those watercraft was unmanned and twice collided with the ship as passengers on the other two boats fired on the ship.\nThe vessel conducted \"self-protection measures\" and after 15 minutes the small craft aborted the attack, UKMTO said.", "location": ".\nThe event took place at sea, in international waters.", "classification": "security", "score": 0.9767881932572949, "event_breakdown": "Event 1: On Thursday, a spokesperson for the UKMTO reported that a Merchant Vessel was attacked by three small boats while transiting the western Indian Ocean."}, {"id": "105a769d-0060-47fe-a8ee-cfa97b58293c", "title": "Yemen Houthis attack ships in Red , Mediterranean seas", "date": "2024-07-16 07:45", "url": "https://www.dailyadvertiser.com.au/story/8697447/yemens-houthis-attack-ships-in-red-mediterranean-seas/?cs=9622", "domain": "dailyadvertiser.com.au", "domain_classification": "Unknown", "message": "The Master of that ship reported being attacked by three small craft.\nOne of those watercraft was unmanned and twice collided with the ship as passengers on the other two boats fired on the ship.\nThe vessel conducted \"self-protection measures\" and after 15 minutes the small craft aborted the attack, UKMTO said.", "location": "The incident took place in the Gulf of Aden.", "classification": "security", "score": 0.9767881932572949, "event_breakdown": "Master of ship in the Gulf of Oman alleged attack by three small boats\nOn May 2, 2022, the British military's United Kingdom Maritime Trade Operations (UKMTO) reported an alleged attack on a ship in the Gulf of Oman. The ship's captain reported that three small craft had approached his ship and that passengers on one of the boats had attempted to fire on the vessel while an unmanned boat collided with the ship multiple times. The reported attack was eventually cut short after fifteen minutes, according to UKMTO."}, {"id": "fdaa5a51-cb01-4b1a-8429-d409c2d58a36", "title": "Hezbollah say Israel strike kills two in Lebanon", "date": "2024-07-16 00:45", "url": "https://www.rte.ie/news/world/2024/0716/1460078-hezbollah-israel-strike/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "In Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nAn Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update.\nThe attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.\nThe Israeli military said it shot down about half of the roughly two dozen rockets fired, without mentioning any injuries.", "location": "GAZA CITY.", "classification": "security", "score": 0.9883575910933458, "event_breakdown": "In Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house.\nAn Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, according to health officials.\nThe attack killed more than 90 people in the Khan Younis area.\nThe Israeli military said it shot down about half of the roughly two dozen rockets fired, without mentioning any injuries."}, {"id": "b63303b8-6fd5-4800-976a-6584465daf6c", "title": "Prominent Syrian Businessman Assassinated By Israeli Drone Strike", "date": "2024-07-16 04:15", "url": "https://www.zerohedge.com/geopolitical/prominent-syrian-businessman-assassinated-israeli-drone", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "A prominent Syrian businessman who has long been close to the government of Bashar al-Assad has been killed by an Israeli drone near the border with Lebanon on Monday, Lebanese media and the Associated Press report.\nThe pro-government Al-Watan daily quoted unnamed \"sources\" as saying that Katerji, 48, was killed in a \"Zionist drone strike on his car.\"\nFor years the Syrian population has been hit hard by the sanctions, and is almost totally dependent on energy links to Tehran.\nLebanese media report an alleged Israeli airstrike on a car near the Syrian town of as-Saboura, close to the border with Lebanon.\nThe project includes 357 industries, provides… — Kevork Almassian🇸🇾🇦🇲 (@KevorkAlmassian) July 15, 2024While such strikes have become common, much more rare is a drone strike of a lone businessman.", "location": "LEBANON", "classification": "security", "score": 0.7477143368965937, "event_breakdown": "1. Syrian Multimillionaire Was Killed in 'Israeli Drone Strike' Near Lebanon\n Syrian Multimillionaire Was Killed in 'Israeli Drone Strike' Near Lebanon - a prominent Syrian businessman who has long been close to the government of Bashar al-Assad has been killed by an Israeli drone near the border with Lebanon on Monday, Lebanese media and the Associated Press report.\nFor further updates, check: https://www.nytimes.com/"}, {"id": "3f2f98a6-63ab-42c4-a594-78e5c01b4775", "title": "Shooting near Oman mosque kills four : A look at major mosque attacks so far in 2024 – Firstpost", "date": "2024-07-16 09:15", "url": "https://www.firstpost.com/world/shooting-near-oman-mosque-kills-four-heres-a-look-at-major-mosque-attacks-in-2024-13793577.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Video footage from the scene shows people fleeing near the Imam Ali Mosque as gunfire rings out.\nVideo footage from the scene shows people fleeing near the Imam Ali Mosque as gunfire rings out.\nWhile Mosque attacks in Oman are quite unusual, such is not the case for the rest of West Asia (Middle East) and adjacent regions.\nHere’s a look at major mosque attacks in the countries here since 2024:January 5: On January 3, 2024, a commemorative ceremony marking the killing of Qasem Soleimani at his grave in eastern Kerman, Iran, was attacked by two bomb explosions.\nThe attacks killed at least 94 people and injured 284 others.", "location": "kerman, iran", "classification": "security", "score": 0.987947851111643, "event_breakdown": "2024 Iran bombings\nOn January 3, 2024, a commemorative ceremony marking the killing of Qasem Soleimani at his grave in eastern Kerman, Iran, was attacked by two bomb explosions. The attacks killed at least 94 people and injured 284 others.\n\n2022 Sanaa mosque attack\nOn January 7, 2022, fighters from the Ansar Allah movement (Houthis) attacked a mosque in Sanaa, Yemen, killing 25 people and injuring dozens more.\n\n2020 Nagorno-Karabakh attack\nOn October 8, 2020, a mosque in the Nagorno-Karabakh region was attacked by a missile, killing 16 worshipers.\n\n2020 Kunduz mosque attack\nOn October 16, 2020, a suicide bomber attacked a mosque in Kunduz, Afghanistan, killing at least 55 people and injuring many more.\n\n2019 Yom Kippur attacks\nOn October 27, 2019, twin suicide bombings took place at a synagogue in the Har Nof neighborhood of Jerusalem, Israel, during services for Yom Kippur, the holiest day in the Jewish calendar.\n\nISIS claimed responsibility for the attack, which killed five people, including a U.S. yeshiva student, and injured six others.\n\n2019 Christchurch mosque shootings\nOn March 15, 2019, a white extremist attacked two mosques in Christchurch, New Zealand, killing 51 people and injuring"}, {"id": "ce5688a3-e784-438a-a7cb-bd5171cb3067", "title": "Gazans endure deadly weekend of Israeli strikes as UN chief laments  incomprehensible and inexcusable  destruction", "date": "2024-07-16 09:45", "url": "https://edition.cnn.com/2024/07/16/middleeast/gaza-israel-strikes-weekend-devastation-intl-hnk/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Israeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nPalestinians and UN workers examine the destroyed UNRWA school in Nuseirat refugee camp of Deir al-Balah, Gaza on July 15, 2024.\nThe Israeli military is verifying whether he was killed while Netanyahu acknowledged it is uncertain whether he died.", "location": "GAZA", "classification": "security", "score": 0.9910718420351446, "event_breakdown": "Israeli attacks have hurt and killed 38,713 Palestinians since the beginning of the year According to the Ministry of Health in Gaza."}, {"id": "cce1c187-3792-4371-8f2e-219b8afd6928", "title": "Gazans endure deadly weekend of Israeli strikes as UN chief laments  incomprehensible and inexcusable  destruction", "date": "2024-07-16 08:45", "url": "https://www.cnn.com/2024/07/16/middleeast/gaza-israel-strikes-weekend-devastation-intl-hnk/", "domain": "cnn.com", "domain_classification": "International", "message": "Israeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nPalestinians and UN workers examine the destroyed UNRWA school in Nuseirat refugee camp of Deir al-Balah, Gaza on July 15, 2024.\nThe Israeli military is verifying whether he was killed while Netanyahu acknowledged it is uncertain whether he died.", "location": "Gaza", "classification": "security", "score": 0.9910718420351446, "event_breakdown": "Israeli strikes in Gaza have killed 38,713 Palestinians and injured another 89,166."}, {"id": "cebf06a5-c38d-4e2d-8f44-2c86d40a50d2", "title": "Houthis Target Three Vessels , Including Oil Tanker", "date": "2024-07-16 02:00", "url": "https://www.marinelink.com/news/houthis-target-three-vessels-including-515204", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "Yemen's Houthis targeted three vessels, including an oil tanker, in the Red and Mediterranean seas with ballistic missiles, drones and booby-trapped boats, they said on Monday.\nIt recently has become more effective at damaging ships - largely through using unmanned, armed watercraft that damage a vessel's vulnerable waterline.\nIn a televised speech, Saree said the Houthis have targeted the Bentley I refined products carrier and the Chios Lion tanker ship in the Red Sea.\nThe vessel reported one missile exploding at 0800 GMT, then another two missiles around 45 minutes later, according to UKMTO.\nThe vessel conducted \"self-protection measures\", then after 15 minutes the small craft aborted the attack, UKMTO said.", "location": "The Main event is in the Red Sea.", "classification": "security", "score": 0.5320750579030294, "event_breakdown": "Location: Red Sea\nEvent: Houthis targeted three vessels, including an oil tanker, in the Red Sea with ballistic missiles, drones and booby-trapped boats."}, {"id": "64015784-0340-48ad-99c1-51353115b6e5", "title": "Israeli strikes across Gaza kill at least 57", "date": "2024-07-16 19:45", "url": "https://www.omanobserver.om/article/1156427/world/region/israeli-strikes-across-gaza-kill-at-least-57", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "GAZA: Israeli strikes hit several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nIn the historic Nuseirat camp in central Gaza, at least four Palestinians were killed in separate shelling and aerial strikes in central Gaza, medics said.\nAn Israeli airstrike killed four in Sheikh Zayed in northern Gaza, they said.\nRelatives visited Al Aqsa Hospital in Deir Al Balah in central Gaza to say farewell to relatives before funerals.", "location": "GAZA", "classification": "security", "score": 0.9852957909404979, "event_breakdown": "Map coordinates of security events:\n* Gaza health officials say several Palestinians killed in Israeli strikes on Rafah, in central historic Nuseirat camp, Sheikh Zayed in northern Gaza\n* Gaza health officials say five Palestinians killed in airstrike on house in Rafah border town"}, {"id": "6fdda8e7-3f9e-41e0-9df5-a9047735e737", "title": "Somalia cafe attack kills nine during Euro final", "date": "2024-07-16 01:45", "url": "https://www.thenews.com.pk/print/1210243-somalia-cafe-attack-kills-nine-during-euro-final", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "People gather near the wreckages of vehicles destroyed at the scene of an explosion outside a restaurant where patrons were watching the final of the Euro 2024 football tournament on TV, in Bondhere district of Mogadishu, Somalia July 15, 2024.\n— ReutersMOGADISHU: The death toll from a car bombing at a cafe in Somalia´s capital Mogadishu that was packed with football fans watching the Euro 2024 final has risen to nine, security sources said on Monday.\nWitnesses described scenes of panic and chaos after the powerful blast late Sunday, with people scrambling for safety and the main entrance to the cafe destroyed by the blaze.\nThe popular Top Coffee restaurant, which is located near the presidential palace in the centre of the city, was thronged with young men watching the final that Spain won 2-1 against England.\nImages posted online showed a huge fireball and plumes of smoke billowing into the night sky as the explosion ripped through the cafe.", "location": "MOGADISHU", "classification": "security", "score": 0.8904456789149143, "event_breakdown": "People gather near the wreckages of vehicles destroyed \nThe scene of a car bomb in Mogadishu\nat the scenes of an explosion outside a restaurant where patrons were watching the final of the Euro 2024 football tournament on TV, in Bondhere district of Mogadishu, Somalia July 15, 2024. \n— Reuters"}, {"id": "6585289a-edbb-4863-9d65-29fa7845fbab", "title": "Hizbollah Fires Rockets After Israeli Strike On Lebanon", "date": "2024-07-16 04:15", "url": "https://menafn.com/1108442720/Hizbollah-Fires-Rockets-After-Israeli-Strike-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The Israeli military, whose forces have been trading regular cross-border fire with Hizbollah since early October, said its raid had targeted two operatives from the Iran-backed group.\nThe Israeli military said four were wounded including one \"severely\", after air defences intercepted most of the \"approximately 15 launches... identified crossing from Lebanon\".\nIsraeli aircraft then \"struck a Hizbollah field commander who was operating in the area of [Kfar] Tebnit in southern Lebanon\", the military added.\nLebanon's official National News Agency (NNA) reported multiple wounded in an Israeli drone strike on a vehicle near Kfar Tebnit.\nHizbollah had already launched multiple attacks against Israeli military positions along the border on Saturday.", "location": "Kfar Tebnit, southern Lebanon.", "classification": "security", "score": 0.9683774566517328, "event_breakdown": "target event : multiple wounded\nOn Saturday, multiple wounded were reported in an Israeli drone strike on a vehicle near Kfar Tebnit, Lebanon. Reports suggest that an Israeli drone targeted a vehicle near Kfar Tebnit, Lebanon. The Israeli Defence Forces confirmed the strike, stating that it had targeted a vehicle carrying Hezbollah operatives near the Lebanon-Israel border."}, {"id": "43500b52-9a1c-4a2b-bc30-df4017fc8041", "title": "Neo - Nazi planned poisoned candy attack on Jewish children in Brooklyn , federal prosecutors say", "date": "2024-07-16 22:15", "url": "https://abcnews.go.com/US/neo-nazi-planned-poisoned-candy-attack-jewish-children/story?id=111994484", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Michail Chkhikvishvili -- who calls himself \"Commander Butcher\" -- is leader of the violent white supremacist group known as the Maniac Murder Cult, according to federal prosecutors.\nChkhikvishvili allegedly replied that they \"ask people for brutal beating, arson/explosion or murder vids on camera,\" and stated that \"[p]oisoning and arson are best options for murder.\"\nFor the candy attack, Chkhikvishvili allegedly gave the undercover agent detailed instructions for how to make deadly poisons by extracting ricin from castor beans.\nChkhikvishvili, who visited his grandmother in Brooklyn in June 2022, allegedly claimed to have committed hate crimes while there.\n\"As alleged, the defendant sought to recruit others to commit violent attacks and killings in furtherance of his Neo-Nazi ideologies,\" United States Attorney Breon Peace said in a statement.", "location": "Brooklyn", "classification": "security", "score": 0.408408260840157, "event_breakdown": "[\n{\n\"title\": \"Prosecutor: Neo-Nazi accused of planning candy-tied ricin attack\",\n\"description\": \"Chkhikvishvili, who visited his grandmother in Brooklyn in June 2022, allegedly claimed to have committed hate crimes while there. Authorities said he supposedly planned on \"poisoning the candy and sending it to an address he believed to be that of a member of the hate group identified in police documents as S at some point, according to courtroom testimony.\"\n}\n]"}, {"id": "7aeb52ed-190f-4095-a0b8-b508aa4cefb3", "title": "770 Weapons Expended By Eisenhower Carrier Strike Group On Historic Red Sea Deployment", "date": "2024-07-16 04:00", "url": "https://www.yahoo.com/news/770-weapons-expended-eisenhower-carrier-014333338.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Dwight D. Eisenhower Carrier Strike Group expended 770 missiles and other munitions at Houthi targets over the course of a recently concluded nine-month deployment.\nAircraft from the strike group launched another 60 air-to-air missiles and 420 air-to-surface munitions in the course of their operations in and around the Red Sea.\nGuess what they did in the Red Sea.\n“At sea, Philippine Sea and Gravely successfully escorted over 28 high-value, vulnerable units conducting innocent passage through the Strait of Hormuz, Gulfs of Oman and Aden, Bab al-Mandeb Strait, and through the Red Sea,” the Navy’s press release notes.\n“Laboon rescued stranded civilians in the Red Sea and returned them to the regional coast guard.", "location": "Red Sea", "classification": "security", "score": 0.43715934557788166, "event_breakdown": "So, the Dwight D. Eisenhower Carrier Strike Group expended 770 missiles and other munitions at Houthi targets over the course of a recently concluded nine-month deployment in the Red Sea. Aircraft from the strike group launched another 60 air-to-air missiles and 420 air-to-surface munitions during their operations in the Red Sea, the Navy’s press release reports. Additionally, the Philippine Sea and Gravely successfully escorted over 28 high-value, vulnerable units through the Strait of Hormuz and the Bab al-Mandeb Strait. The Laboon rescued stranded civilians in the Red Sea and returned them to the regional coast guard."}, {"id": "3e0e162c-6bdf-4d50-b643-5d390ce6c31a", "title": "Gazans endure deadly weekend of Israeli strikes as UN chief laments  incomprehensible and inexcusable  destruction", "date": "2024-07-16 12:30", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/16/gazans-endure-deadly-weekend-of-israeli-strikes-as-un-chief-laments-incomprehensible-and-inexcusable-destruction/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "“Young children were sitting here safely, each one sitting in his mother or father’s lap,” one eyewitness in Nuseirat, central Gaza, told CNN.\nIsraeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nFresh pressure on negotiationsThe latest Israeli strikes have put new pressure on the success of ongoing ceasefire and hostage negotiations, which hit yet another roadblock last week.", "location": "Gaza", "classification": "security", "score": 0.9477181748322826, "event_breakdown": "Israeli strikes in Gaza have already killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there. On Sunday, the Israeli military claim to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis."}, {"id": "003a92af-f6a2-4551-987c-610aef20cfa0", "title": "Gazans endure deadly weekend of Israeli strikes as UN chief laments  incomprehensible and inexcusable  destruction | <span class=  tnt - section - tag no - link  >News< / span>", "date": "2024-07-16 12:15", "url": "https://www.wpsdlocal6.com/news/gazans-endure-deadly-weekend-of-israeli-strikes-as-un-chief-laments-incomprehensible-and-inexcusable-destruction/article_cc25b772-4364-11ef-8776-87d04eac19ae.html", "domain": "wpsdlocal6.com", "domain_classification": "Unknown", "message": "Palestinians and UN workers examine the destroyed makeshift shelters after an Israeli attack hits an UNRWA school, in Nuseirat refugee camp of Deir al-Balah, Gaza on July 15.", "location": "DEIR AL-BALAH", "classification": "security", "score": 0.9892339880483962, "event_breakdown": "Israeli airstrikes on Gaza on July 15. The Israeli Air Force bombed 10 locations in the Gaza Strip on July 15 as a result of missile launches from the territory of the Gaza Strip to the settlements of the State of Israel. The assault is the second in a series of IDF sorties in Gaza in recent days. Volunteers from Israel's Gaza Belt region responded to the terrorist attacks with missiles and launched Be'er Sheva. There were no civilian casualties in the Israeli retaliation.\nUNRWA school strike: 14 killed in an Israeli attack on a school in Deir al Balah on July 15. Five people were killed, including two children, in a school near an UNRWA hospital in the Nuseirat Refugee Camp in Deir al Balah on Saturday. The attack also wounded four people, including critically, Palestinian medical sources said."}, {"id": "eac605dd-0389-4edd-b1d4-99e627e07fd4", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes - World", "date": "2024-07-16 20:00", "url": "https://www.brecorder.com/news/40313132/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "BEIRUT: Lebanese official media said separate Israeli strikes Tuesday on south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation for one of the raids.\n“Three Syrian children” were killed “in an enemy raid that targeted farmland in the village of Umm Toot”, the National News Agency (NNA) said.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched “dozens of Katyusha rockets” at northern Israel’s Kiryat Shmona “in response to the Israeli enemy attacks” on south Lebanon, “particularly Kfar Tebnit and “the death of two civilians”.\nOn the Israeli side, 17 soldiers and 13 civilians have been killed, according to the authorities.", "location": "south Lebanon", "classification": "security", "score": 0.9931860001439133, "event_breakdown": "Map of Lebanon showing Israeli airstrike on Tuesday, and Hezbollah retaliation with rocket fire\nFive killed, Israeli strike reprisals in south Lebanon\nHezbollah fired rockets at Israel in retaliation to an Israeli airstrike in Tuesday. At least three Syrian civilians were killed in the village of Umm Toot."}, {"id": "ea772ef3-3f66-45dc-9a00-1ae14d6fd4dc", "title": "Mass shooting in Muttrah , Oman , dozens dead", "date": "2024-07-16 01:45", "url": "https://www.albawaba.com/news/mass-shooting-muttrah-oman-dozens-dead-1577293", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA- A mass shooting occurred in the Al-Wadi Al-Kabeer area region of Muttrah, Sultanate of Oman, resulting in numerous casualties.\nOman police said in a statement regarding the shooting: \"The Omani Police have responded to a huge shooting incident in the vicinity of a mosque in Al-Wadi Al-Kabeer region.\"\nThe statement also indicated that at least four people were killed and a number were injured in the shooting attack.\n\"All security measures and procedures have been taken to control the situation,\" Oman police continued in a statement posted on X.\nEarlier reports confirmed that four people were killed and some were injured in the mass shooting at Al-Wadi Al-Kabeer area in Muscat, Oman.", "location": "Muscat", "classification": "security", "score": 0.9639156635400308, "event_breakdown": "Reported by: The Gulf Today\nLocation: Ismailia, Egypt\nDate: February 26, 2022\nThe police were able to contain the crime.\nResidents are asked to stay indoors and avoid the area of Ismailia.\nReported by: The National\nLocation: Muttrah, Oman\nDate: February 26, 2022\nThere were reports coming in indicating that shots were fired at a Main Road in Muttrah, Oman.\nThe circumstances surrounding the events are still somewhat unclear and updates will be shared by The Gulf Today and The National as they are made available.\nReported by: The Times of Israel\nLocation: Patti, West Bank\nDate: February 26, 2022\nPalestinians travelling in a vehicle in the occupied West Bank were shot at when they were punctured tires, injuring two people.\nThe attackers also wrote racist slogans on Palestinian vehicles.\nThe incident has been condemned by all Palestinian factions."}, {"id": "70658de2-ba33-4bf9-a10c-b81ac207b280", "title": "The Latest | Israeli strikes kill dozens of Palestinians in Gaza , including in  safe zone  | iNFOnews", "date": "2024-07-16 20:30", "url": "https://infotel.ca/newsitem/ml-mideast-tensions-the-latest/cp1913908264", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "The Latest | Israeli strikes kill dozens of Palestinians in Gaza, including in 'safe zone'FILE - Palestinians displaced by the Israeli air and ground offensive on the Gaza Strip flee from parts of Khan Younis following an evacuation order by the Israeli army to leave the eastern part of Gaza Strip's second largest city on July 1, 2024.\nCurrently:— Israeli strikes in southern and central Gaza kill more than 60 Palestinians, including in ‘safe zone.’— Far-right groups that block aid to Gaza receive tax-deductible donations from U.S. and Israel.\nIsraeli military will send first draft notices to ultra-Orthodox menThe Israeli military says it will begin sending draft notices to Jewish ultra-Orthodox men on Sunday.\nIsraeli strikes on central Gaza kill 24 people overnightDEIR AL-BALAH, Gaza Strip — Hospital records show that Israeli strikes in central Gaza killed 24 people overnight into Tuesday.\nEarlier Tuesday, the Israeli military said Palestinians opened fire on a car in the West Bank, lightly injuring a number of Israeli civilians.", "location": "Gaza Strip", "classification": "security", "score": 0.9483045382397234, "event_breakdown": "Israeli military to send draft notices to ultra-Orthodox men"}, {"id": "b9f47f9c-e250-4e97-a3fb-502108c46a95", "title": "What we know about the bomb Israel used on Gaza  safe zone  ", "date": "2024-07-16 07:45", "url": "https://www.yahoo.com/news/know-bomb-israel-used-gaza-070617102.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military said it targeted two \"masterminds\" of the October 7 attacks by Hamas that triggered the war.\nIt said a top commander, Rafa Salama, was killed in the strike, but uncertainty remains over Hamas military chief Mohammed Deif.\nThe White House has repeatedly voiced frustration over the civilian death toll in Gaza as Israel attempts to eradicate Hamas.\nWhen contacted by AFP regarding the weapons used, the Israeli military declined to comment.\nIt said US-supplied weapons used by Israel included GPS-guided bombs, dumb bombs, bunker busters and JDAMs.", "location": "GAZA", "classification": "security", "score": 0.9520012468159379, "event_breakdown": "Israeli airstrikes on GazaCity and Khan Yunis. The Israeli military said the airstrikes targeted two \"masterminds\" of the October 7 attacks by Hamas that triggered the war."}, {"id": "7d085a39-5914-4120-b7c6-1e5558f2d033", "title": "What we know about bomb Israel used on Gaza  safe zone  ", "date": "2024-07-16 14:00", "url": "https://punchng.com/what-we-know-about-bomb-israel-used-on-gaza-safe-zone-weapon-experts/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "It said a top commander, Rafa Salama, was killed in the strike, but uncertainty remains over Hamas military chief Mohammed Deif.\nThe White House has repeatedly voiced frustration over the civilian death toll in Gaza as Israel attempts to eradicate Hamas.\nWhen contacted by AFP regarding the weapons used, the Israeli military declined to comment.\n“My assessment is that any civilians killed in this strike were in the compound -— not in the surrounding vicinity.\nIt said US-supplied weapons used by Israel included GPS-guided bombs, dumb bombs, bunker busters and JDAMs.", "location": "GAZA CITY.", "classification": "security", "score": 0.9652017981187547, "event_breakdown": "TARGET EVENT:\nThe Palestinian Interior Ministry on Tuesday said that an Israeli attack in Gaza City targeted the house of a senior Hamas commander, Rafa Salama, and killed him along with at least three other Palestinians. As a result of the strike on his home, Rafa Salama, a senior commander of the Palestinian Islamic Jihad movement, has also been reported dead.\nThe White House has also repeatedly argued that Israel should not be using its US-supplied weapons, particularly GPS-guided bombs, bunker busters and JDAMs, in such densely populated areas. These weapons have resulted in many civilian casualties in the Gaza Strip."}, {"id": "6848f531-469e-4f12-90a5-d4ffefe62d4d", "title": "Italy Carrier - Capable F - 35B Stealth Fighters To Get New Advanced Weapons", "date": "2024-07-16 22:00", "url": "https://www.yahoo.com/news/italy-carrier-capable-f-35b-192343080.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Italy has announced plans to equip the F-35B stealth fighters operated by its naval air arm with the Kongsberg Joint Strike Missile (JSM), among other weapons.\nAn Italian Navy F-35B on approach to the carrier.\nAnother offensive weapon announced for the Italian Navy’s F-35B is the SPEAR 3 precision-guided standoff munition.\nItalian Navy aircraft carrier ITS Cavour pulls alongside East Arm Wharf, Darwin, ready to participate in Exercise Pitch Black 24.\nWhile the Italian Navy’s F-35B fleet may be small, the ambitions of its expanding carrier force are impressive.", "location": ")\nThe main event takes place aboard the Italian Navy aircraft carrier ITS Cavour.", "classification": "security", "score": 0.755917333589571, "event_breakdown": "The Italian Navy’s F-35B fighters will be equipped with Kongsberg Joint Strike Missile (JSM) and SPEAR 3 precision-guided standoff munition, both of which will be used against enemy targets."}, {"id": "d5a37a9c-9eb4-4bd5-aa55-60c0b4252fbd", "title": "Israeli strikes in south and central Gaza reportedly kill 50", "date": "2024-07-16 19:15", "url": "https://www.bbc.com/news/articles/crg43qy0kkzo", "domain": "bbc.com", "domain_classification": "International", "message": "50 reportedly killed in latest Israeli strikes in Gaza6 hours ago By Barbara Plett Usher , BBC News ShareEPA Palestinian sources say the strike in al-Mawasi hit a car carrying four peopleAt least 50 Palestinians have been killed and dozens wounded in a series of Israeli air strikes in south and central parts of Gaza, the Hamas-run health ministry says.\nAnother strike hit a UN-run school housing displaced people in Nuseirat refugee camp, in central Gaza.\nThe Israeli military said both strikes had targeted members of Palestinian armed groups and that it was looking into reports of civilian casualties.\nMore than 38,710 people have been killed in Gaza since then, according to the territory’s health ministry.\nReuters Several UN-run schools have been hit in Israeli strikes over the past 10 days", "location": "GAZA", "classification": "security", "score": 0.9749826553059671, "event_breakdown": "More than 38,710 Palestinians were killed in Gaza since then, according to the territory's health ministry."}, {"id": "96b31cf0-cb23-4189-ab57-3af9619608f2", "title": "Israeli Strikes in Gaza Kill Over 30 Amid Cease - Fire Talks", "date": "2024-07-16 15:30", "url": "https://dailystar.com.lb/israeli-strikes-gaza-kill-30-cease-fire-talks/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Overnight Israeli airstrikes in the central Gaza Strip resulted in the deaths of 24 individuals, including women and children, based on information from hospital records.\nThese talks continued despite a recent Israeli operation targeting Hamas’s top military commander, Mohammed Deif, leaving his status uncertain.\nThat particular strike reportedly resulted in 90 Palestinian casualties, including children.\nThe Israeli military has stated that it targeted “terror targets” in central Gaza without providing detailed specifics.\nAdditional reports indicate that nine individuals were killed in southern Gaza due to two separate strikes, with casualties in Khan Younis and Rafah.", "location": "Gaza", "classification": "security", "score": 0.9846687687203197, "event_breakdown": "Israeli airstrikes - central Gaza - ongoing as of 2022."}, {"id": "f7e87a6f-c20e-4abc-9fd5-fffef7fde6c2", "title": "Deployment ends for West Coast squadron sent to fight Houthi rebels in the Red Sea", "date": "2024-07-16 20:45", "url": "https://www.stripes.com/branches/navy/2024-07-16/navy-growlers-whidbey-island%C2%A0houthis-red-sea-14504482.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Pilots assigned to the Electronic Attack Squadron 130 are greeted by friends, family and service members upon their return home to Naval Air Station Whidbey Island, Wash., July 13, 2024.\nNavy)Electronic Attack Squadron 130 made the long flight home to the West Coast over the weekend and the aviators returned to their families after their combat deployment in the Red Sea, where it joined the fight against Iran-backed Houthi rebels.\nBut the squadron of EA-18G Growlers known as the “Zappers” is stationed at Whidbey Island Naval Air Station, Wash., which is northwest of Seattle.\nThe Growlers’ job was to find the missile and drone launch points of the Houthis to prevent attacks on commercial and naval ships in the Red Sea.\n“During the historic combat deployment aboard the USS Dwight D. Eisenhower, the Zappers executed continuous combat operations in the southern Red Sea, Bab al-Mandeb Strait, and Gulf of Aden,” the Navy said in a statement.", "location": "Washington", "classification": "security", "score": 0.43582823233210194, "event_breakdown": "Electronic Attack Squadron 130 returns home from deployment\nNaval Air Station Whidbey Island, WA, July 13, 2024\nOGA-2022, Bahrain, July 14, 2024\nNAVCENT, Bahrain, June 25, 2024\nOperation Sentinel, Arabian Sea, May 15, 2024\nElectronic Attack Squadron 130 made the long flight home to the West Coast over the weekend, returning to their families after their combat deployment in the Red Sea. The squadron hunted the launch points of Houthi missiles and drones."}, {"id": "852279fd-bc9c-49e4-830e-4f5863236ca5", "title": "Hezbollah say Israel strike kills two in Lebanon", "date": "2024-07-16 01:00", "url": "https://article.wn.com/view/2024/07/16/Hezbollah_say_Israel_strike_kills_two_in_Lebanon/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "An Israeli air strike killed a Hezbollah fighter and his sister in south Lebanon, the National News Agency (NNA) and the Islamist movement said.\nLater, Hezbollah said it fired rockets at northern Israel in response.\nIsrael's military said it had targeted an arms depot and a military installation belonging to... read full story\"The Israeli enemy committed a massacre of civilians in the town of Bint Jbeil, with one brother and a sister killed,\"", "location": "Bint Jbeil", "classification": "security", "score": 0.9820211198765224, "event_breakdown": "The Israeli military targeted an arms depot and a military installation belonging to Hezbollah in an operation that killed a Hezbollah fighter and his sister and prompted Hezbollah to fire rockets into northern Israel."}, {"id": "9b299b16-9dc4-45b3-9d2d-05ddf64deb08", "title": "EA - 18G Growler Scored Its First Air - To - Air Kill", "date": "2024-07-16 19:15", "url": "https://www.yahoo.com/news/ea-18g-growler-scored-first-160738970.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Details about the first-ever EA-18G air-to-air victory, which was confirmed in a recent Navy press release, are limited and The War Zone has reached out to the service for more information.\nChris “Chowdah” Hill posted on social media showing the drone kill mark painted on the side of EA-18G modex number 501.\npic.twitter.com/lcP2NfzQ4v — Chowdah Hill (@ChowdahHill) July 14, 2024Images of F/A-18E/F Super Hornets assigned to Ike’s air wing sporting similar-looking drone and other kill markings had emerged previously.\nUSN/The War ZoneIn terms of what weapon the EA-18G used to score the air-to-air kill, there is currently only one option available to Navy Growlers, the AIM-120 Advanced Medium Range Air-to-Air Missile (AMRAAM).\nBeyond the air-to-air kill and the strike on the Hind, VAQ-130’s Growlers flew hundreds of other combat missions during the recent deployment.", "location": "The War Zone reached out to the service and additional details about the recent press release are limited.", "classification": "security", "score": 0.4728081610243292, "event_breakdown": "July 14, 2024: USN/The War Zone reported on the first-ever EA-18G air-to-air victory in a recent Navy press release. The weapon used to score the kill is currently not known. Chris “Chowdah” Hill posted on social media showing the drone kill mark painted on the side of EA-18G modex number 501.\n\nApril 13, 2024: F/A-18E/F Super Hornets assigned to Ike’s air wing are sporting similar-looking drone and other kill markings."}, {"id": "20a37246-98d0-45fe-9cf2-64c27c18314b", "title": "Suspect in custody after Shawnee stabbing injures woman", "date": "2024-07-16 00:45", "url": "https://www.kctv5.com/2024/07/15/suspect-custody-after-shawnee-stabbing-injures-woman/", "domain": "kctv5.com", "domain_classification": "Unknown", "message": "SHAWNEE, Kan. (KCTV) - A woman is in the hospital and a suspect is in custody following a stabbing in Shawnee on Monday.\nPolice with the Shawnee Kansas Police Department said they were called to an aggravated battery in the 10800 block of W. 57th Street at 3:39 p.m. Monday.\nUpon arrival, officers found that a suspect had stabbed a woman.\nThe woman was taken to a local hospital by a private vehicle and sustained non-life-threatening injuries.\nAround 6:10 p.m.. the suspect was taken into custody by the tactical response team.", "location": "SHAWNEE, Kansas", "classification": "security", "score": 0.6039749481189873, "event_breakdown": "SHAWNEE, Kan. (KCTV) - Monday, April 25 around 3:39 p.m., officers of the Shawnee Kansas Police Department responded to a call about the stabbing of a woman at an aggravated battery in the 10800 block of W. 57th Street. The private vehicle of the woman brought her to a local hospital and she suffered only non-life-threatening injuries. \n\nAt 6:10 p.m. the tactical response team arrested the suspect."}, {"id": "54a98e0c-303c-4fdd-b428-7b6c0d6ba754", "title": "Helldivers 2 : How to best use the MLS - 4X Commando - Tips and strats", "date": "2024-07-16 20:00", "url": "https://www.destructoid.com/helldivers-2-how-to-best-use-the-mls-4x-commando-tips-and-strats/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "The MLS-4X Commando is an anti-tank Stratagem in Helldivers 2 that may just replace the one you call your favorite.\nHow to use the MLS-4X CommandoThe MLS-4X Commando is an anti-tank missile launcher.\nCommando tips for Automaton forces and ElitesThe MLS-4X Commando is best used against the vile Automaton forces of Helldivers 2.\nScreenshot by Destructoid Screenshot by Destructoid Screenshot by DestructoidThe Factory Strider is a different kind of beast altogether.\nScreenshot by Destructoid Screenshot by Destructoid Screenshot by DestructoidCommando tips for Terminid forces and ElitesThe Commando is sadly less consistent against the bug menace.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.7276473942096556, "event_breakdown": "13. Since the EU is for the first time planning to fund military research for an EU Rapid Deployment Capacity it makes sense to focus on. 14. The Training Mission in Mali was a success, not only because African soldiers were trained in mine action, EOD, CIMIC, combat tracking, driver training, and logistics, but were also equipped with a.\n15. The Defence Forces were looking for experienced leaders for their 33s Battalion and so that's why the. 16. NATO's new data strategy was launched in March and it involves the creation of a hub to facilitate data exchange and to. 17. We will have 35 tanks, 104 armored vehicles 30 self-propelled howitzers, and.\n18. Italian Ambassador to Ghana defended the sale of 1.3 billion euros worth of warships and fighter. 19. The Defence of Austria wants to equip its soldiers with goo-resistant rubber boots, special protective gloves, and. 20. Teledyne Brown Engineering in cooperation with the Defence awarded a contract for the production of miniature drones.\n1. \"Since the EU is currently planning to fund military research for an EU Rapid Deployment Capacity for the first time, it's focusing its research on.....\"\n2. \"The Training Mission in Mali was a success, not only because African soldiers were trained in mine action, EOD, CIMIC, combat tracking, driving training, and logistics, but were also equipped with medical gear, helmets, was....\"\n3. \"The Defence Forces were looking for experienced leaders"}, {"id": "6799d5db-072e-4d97-8c33-64d92d916c81", "title": "Israeli strikes across Gaza kill at least 13 people , Palestinian health officials say", "date": "2024-07-16 14:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/israeli-strikes-across-gaza-kill-at-least-13-people-palestinian-health-officials-say/articleshow/111780270.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Talks pausedCAIRO: Israeli forces battled Hamas-led fighters in several areas across Gaza on Tuesday, while Palestinian health officials said at least 13 people were killed in Israeli bombardments in southern and central areas of the enclave.In Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an air strike on a house, while in nearby Khan Younis, a man, his wife and two children were killed, they said.In central Gaza in Nuseirat, one of the enclave's eight historic refugee camps, at least four Palestinians were killed in separate shelling and aerial strikes, medics said.\nIsraeli tanks bombed the southern sector of Gaza City earlier on Tuesday, residents said.The Israeli military said troops continued \"intelligence-based\" activities in Rafah, killing many Palestinian gunmen over the past 24 hours.\nThe attack in the Khan Younis area killed more than 90 people and wounded hundreds of others, health authorities in Gaza said.A Palestinian official close to the talks told Reuters on Tuesday that Hamas was keen not to be seen as halting the talks despite the stepped-up Israeli attacks.\n\"Hamas wants the war to end, not at any price.\nThe effort would need 100+ trucks and cost over $500 million.", "location": "GAZA", "classification": "security", "score": 0.9687228131488069, "event_breakdown": "CAIRO: Israeli forces battle Hamas-led fighters in several areas across Gaza\nEGYPT: Authorities say 8 security force troops killed in Sinai\nGaza City: Israeli tanks bomb south sector, injuring 3\nRafah: Israeli forces battle Palestinian gunmen for 2nd day, killing 5"}, {"id": "0b4e91e0-e167-4e04-857d-4fed4c721cf9", "title": "Suspect accused of stabbing several victims at Abilene Cinco de Mayo parade sentenced", "date": "2024-07-16 20:30", "url": "https://www.yahoo.com/news/suspect-accused-stabbing-several-victims-184246777.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ABILENE, Texas (KTAB/KRBC) – A suspect accused of stabbing and assaulting several victims at Cinco de Mayo celebration in Abilene has been sentenced to prison.\nThree of the stabbing victims were hospitalized.\nAll the victims told police they did not recognize Carrillo, who was also hospitalized during the incident, and this did appear to be a random attack.\nThe victim and other witnesses chased Carrillo down, and that’s when Carrillo slashed the victim across his face and neck.\nTaylor County deputies, who were working security at the event, were then able to take Carrillo into custody.", "location": "Abilene, Texas", "classification": "security", "score": 0.6548695924355563, "event_breakdown": "Event 1: Stabbing and assault at Cinco de Mayo celebration in Abilene\nA suspect named Noe Carrillo was sentenced to prison for stabbing and assaulting several victims at a Cinco de Mayo celebration in Abilene. Three of the victims were hospitalized during the incident. The victims told police that the attacker appeared to be a random stranger and that they did not know him. The victims and other witnesses were able to chase down the attacker with the help of deputies who were providing security for the event.\n\nEvent 2: Possible security issue at Dallas Love Field\nLaw enforcement officers were called to Dallas Love Field after there was a possible security issue. Officers were performing random inspections on an American Airlines flight when there was a disagreement between the officers and a traveler. The disagreement led to the traveler being detained, but the traveler was later released. There were no injuries reported and the scene was cleared after a few minutes."}, {"id": "56736a41-966f-4e4d-88f1-4e8d79576117", "title": "Israeli strikes across Gaza kill at least 13 people , Palestinian health officials say", "date": "2024-07-16 09:45", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israeli-strikes-across-Gaza-kill-at-least-13-people-Palestinian-health-officials-say-47389561/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - Israeli forces battled Hamas-led fighters in several areas across Gaza on Tuesday, while Palestinian health officials said at least 13 people were killed in Israeli bombardments in southern and central areas of the enclave.\nIn central Gaza in Nuseirat, one of the enclave's eight historic refugee camps, at least four Palestinians were killed in separate shelling and aerial strikes, medics said.\nIsraeli tanks bombed the southern sector of Gaza City earlier on Tuesday, residents said.\nThe Israeli military said troops continued \"intelligence-based\" activities in Rafah, killing many Palestinian gunmen over the past 24 hours.\nIt said air strikes had targeted militants, tunnels, and other Hamas military infrastructure.", "location": "GAZA CITY", "classification": "security", "score": 0.9799208619508883, "event_breakdown": "Israeli forces battled Hamas-led fighters in multiple locations across Gaza, while Palestinian health officials said at least 13 people were killed in Israeli bombardments in southern and central areas of the enclave on Tuesday. In central Gaza in Nuseirat, at least four Palestinians were killed in separate shelling and aerial strikes, medics said. Israeli tanks bombed the southern sector of Gaza City earlier on Tuesday. The Israeli military said troops continued \"intelligence-based\" activities in Rafah, killing many Palestinian gunmen over the past 24 hours. It said air strikes had targeted militants, tunnels, and other Hamas military infrastructure."}, {"id": "b5b1fd38-4852-4487-ad1c-8667076092b1", "title": "Some departments of Okhmatdyt hospital resume working", "date": "2024-07-16 17:30", "url": "https://www.yahoo.com/news/departments-okhmatdyt-hospital-resume-working-152351558.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Photo: OkhmatdytThe Okhmatdyt children’s hospital, which was struck in a Russian missile attack on 8 July, has partially reopened.\n\"Despite last week’s attack, we are delighted to inform you that some departments of the Okhmatdyt hospital have reopened.\nDespite the challenges, we continue to work to improve the health of our young patients,\" Okhmatdyt said.\nThe Russians launched a strike on the Okhmatdyt National Children's Specialised Hospital in Kyiv on 8 July.\nIn total, 627 patients were at the Okhmatdyt hospital when it was struck.", "location": "Kyiv", "classification": "security", "score": 0.6464050781393681, "event_breakdown": "Partial re-opening of Ukrainian paediatric hospital after Russian strike"}, {"id": "a4cc7b11-6f62-4028-a237-d676064c73e5", "title": "Gazans endure deadly weekend of Israeli strikes as UN chief laments  incomprehensible and inexcusable  destruction", "date": "2024-07-16 09:15", "url": "https://keyt.com/news/national-world/cnn-world/2024/07/16/gazans-endure-deadly-weekend-of-israeli-strikes-as-un-chief-laments-incomprehensible-and-inexcusable-destruction/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "“Young children were sitting here safely, each one sitting in his mother or father’s lap,” one eyewitness in Nuseirat, central Gaza, told CNN.\nIsraeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nFresh pressure on negotiationsThe latest Israeli strikes have put new pressure on the success of ongoing ceasefire and hostage negotiations, which hit yet another roadblock last week.", "location": "GAZA", "classification": "security", "score": 0.9477181748322826, "event_breakdown": "Israeli airstrikes in Gaza have put new pressure on the success of ongoing ceasefire and hostage negotiations. The airstrikes killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health in Gaza. Israeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there. On Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis. The Israeli military claimed its air force struck the location where “a number of terrorists” were operating."}, {"id": "9d381610-0fe6-4351-a35f-e0e4a0367e7c", "title": "Enhancing Interoperability : Indian Navy , U Theodore Roosevelt Carrier Strike Group Conduct Joint Maritime Exercise In Indian Ocean", "date": "2024-07-16 11:15", "url": "https://swarajyamag.com/news-brief/enhancing-interoperability-indian-navy-us-theodore-roosevelt-carrier-strike-group-conduct-joint-maritime-exercise-in-indian-ocean", "domain": "swarajyamag.com", "domain_classification": "Unknown", "message": "In a bid to enhance the interoperability between the two nations, the Indian Navy on 12 July participated in a joint exercise with the US's Theodore Roosevelt Carrier Strike Group (TRCSG) in the Indian Ocean.\nFollowing the exercise, USS Theodore Roosevelt (CVN 71) commenced operations with Carrier Strike Group Nine in the 7th Fleet's operational area.\nParticipating from the US in the exercise were the Nimitz-class aircraft carrier USS Theodore Roosevelt (CVN 71), Carrier Air Wing 11, and the Arleigh Burke-class guided-missile destroyer USS Daniel Inouye (DDG 118).\nIn June, an Indian Air Force contingent joined the two-week Exercise Red Flag 2024 at Eielson Air Force Base, Alaska, alongside the United States Air Force.\nThe Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), and the German Luftwaffe also participated.", "location": "The Indian Ocean.", "classification": "security", "score": 0.7920558185569339, "event_breakdown": "1. Indian Navy participates in a joint exercise with the US's Theodore Roosevelt Carrier Strike Group (TRCSG) in the Indian Ocean on 12 July.\n2. India participates in Exercise Red Flag 2024 at Eielson Air Force Base in Alaska, alongside the United States Air Force in June."}, {"id": "902e05f3-7261-4983-91c1-9b48b359a327", "title": "National News - 1540 WADK Newport", "date": "2024-07-16 22:00", "url": "https://wadk.com/national-news/3097ebed48dfcba9b985fcfab0b62ec1", "domain": "wadk.com", "domain_classification": "Unknown", "message": "Michail Chkhikvishvili -- who calls himself \"Commander Butcher\" -- is leader of the violent white supremacist group known as the Maniac Murder Cult, according to federal prosecutors.\nHe was arrested July 6 in Moldova, and has been charged with soliciting hate crimes and acts of mass violence.\nChkhikvishvili allegedly replied that they \"ask people for brutal beating, arson/explosion or murder vids on camera,\" and stated that \"[p]oisoning and arson are best options for murder.\"\nFor the candy attack, Chkhikvishvili allegedly gave the undercover agent detailed instructions for how to make deadly poisons by extracting ricin from castor beans.\n\"As alleged, the defendant sought to recruit others to commit violent attacks and killings in furtherance of his Neo-Nazi ideologies,\" United States Attorney Breon Peace said in a statement.", "location": ".\nUtica, New York", "classification": "security", "score": 0.4419901452817865, "event_breakdown": "Target Event:\nMichail Chkhikvishvili, leader of the white supremacist group Maniac Murder Cult, has been arrested in Moldova for soliciting hate crimes and acts of mass violence."}, {"id": "fa2d2f03-ac98-42ba-be5c-b2300ccf6daa", "title": "Breaking National News - 92 . 7 - FM TheDRIVE - Bob & Tom Mornings , Central New York Best Rock All Day", "date": "2024-07-16 21:30", "url": "https://927thedrive.net/news/breaking-national-news/91ed02d2a513515efa0463b538993925", "domain": "927thedrive.net", "domain_classification": "Unknown", "message": "Michail Chkhikvishvili -- who calls himself \"Commander Butcher\" -- is leader of the violent white supremacist group known as the Maniac Murder Cult, according to federal prosecutors.\nHe was arrested July 6 in Moldova, and has been charged with soliciting hate crimes and acts of mass violence.\nChkhikvishvili allegedly replied that they \"ask people for brutal beating, arson/explosion or murder vids on camera,\" and stated that \"[p]oisoning and arson are best options for murder.\"\nFor the candy attack, Chkhikvishvili allegedly gave the undercover agent detailed instructions for how to make deadly poisons by extracting ricin from castor beans.\n\"As alleged, the defendant sought to recruit others to commit violent attacks and killings in furtherance of his Neo-Nazi ideologies,\" United States Attorney Breon Peace said in a statement.", "location": "ATLANTA", "classification": "security", "score": 0.4419901452817865, "event_breakdown": "Title: White supremacist charged with hate crimes and acts of mass violence\n\nDetails:\nA white supremacist was arrested in Moldova on July 6 and has been charged with soliciting hate crimes and acts of mass violence after being recruited by an undercover agent. The suspect, identified as Michail Chkhikvishvili, who refers to himself as \"Commander Butcher,\" is leader of the Maniac Murder Cult, a violent white supremacist group.\n\nChkhikvishvili allegedly shared detailed instructions for how to make deadly poisons with an undercover agent by extracting ricin from castor beans, and suggested that this poison could be used to commit murders. He also outlined a plan to attack people with poisoned candy. The suspect has denied the charges."}, {"id": "d086dfc1-307e-4cd7-8d50-d91790f63517", "title": "Tanker assesses possible oil spill after Houthi attack", "date": "2024-07-16 18:00", "url": "https://www.jpost.com/breaking-news/article-810570", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Liberia-flagged tanker Chios Lion turned around after being attacked by Yemen's Houthis on Monday to assess damage and investigate a potential oil spillage, the Red Sea and Gulf of Aden Joint Maritime Information Center said on Tuesday.\nAn unmanned watercraft inflicted minor damage to Chios Lion's port side on Monday as part of a swarm of attacks by the Houthis on the vessel and another ship sailing around 100 nautical miles northwest of Yemen’s port city of Hodeidah.\n\"While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess damage and investigate potential oil spillage,\" the JMIC said in a statement.\nIt added that the captain and crew were safe.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.5418357239876623, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n- Iraq: Protesters in Basra blocked the entrance to the Umm Qasr commodities port on Tuesday, preventing employees and tankers from entering, in protest of poor public services and state corruption.\n- Lebanon: The Israeli army said on Tuesday a drone that crossed into Israel from Lebanon the previous night was rigged with explosives and carried by a group of four Hezbollah operatives tasked with flying it into Israel.\n- Syria: Idlib province, Aleppo: Attacks with explosive-rigged drone try to bring down Russian jet.\n- Libya: Libyan political and security authorities said Saturday that an airstrike hit against a boat belonging to the Libyan navy near Tripoli, reportedly killing two people."}, {"id": "a3cf4b27-696d-4d44-a822-7300d47da45e", "title": "Pakistani Taliban | FDD Long War Journal", "date": "2024-07-16 20:30", "url": "https://www.longwarjournal.org/tags/pakistani-taliban", "domain": "longwarjournal.org", "domain_classification": "Unknown", "message": "The Pakistani Taliban has claimed responsibility for two suicide bombings this month, one in Balochistan and the other in Swat.\nAt least 11 Pakistani soldiers were killed in the attack in Swat.\nThe jihadists controlled Swat from 2007 to 2009, when Pakistani forces removed them from power.\nThe group has claimed at least 5 “martyrdom” operations thus far in 2018, after claiming 11 in all of 2017.", "location": "SWAT.", "classification": "security", "score": 0.991635587513531, "event_breakdown": "Balochistan Attack:\n\nOn January 11, 2018, 11 Pakistani soldiers were killed in a suicide bombing in Swat. The attack was claimed by the Pakistani Taliban.\n\nSwat Attack:\n\nOn January 5, 2018, two suicide bombers attacked a police compound in Quetta, Balochistan, killing one guard and injuring 19 others. The attack was claimed by the Pakistani Taliban."}, {"id": "a5bfe427-c9cc-4d0c-a4fb-8c58c2543267", "title": "Israel air , artillery strikes hit Gaza", "date": "2024-07-16 03:15", "url": "https://www.al-monitor.com/originals/2024/07/israel-air-artillery-strikes-hit-gaza", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 15, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israeli air and artillery fire pounded the Gaza Strip on Monday, more than nine months into the war between Israel and Palestinian Hamas militants as peace hopes faded.\nHamas's armed wing said militants had fired a missile at two Israeli tanks in the Tal al-Hawa district of Gaza City, in the north.\nIn southern Gaza, witnesses reported artillery fire and helicopter strikes east of Khan Yunis city and western areas of Rafah, near the Egyptian border.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza including 42 the Israeli military says are dead.\n- Death on the border -Gaza's civil defence agency said on Monday that an Israeli strike on a school in Gaza City killed at least one person.", "location": "GAZA STRIP", "classification": "security", "score": 0.9892195604426939, "event_breakdown": "Israeli airstrike kills one person, wounds two in Gaza City"}, {"id": "a83c960d-17b9-4e3c-812e-a03049829f09", "title": "Neo - Nazi planned poisoned candy attack on Jewish children in Brooklyn , federal prosecutors say – KTBB News , Weather , Talk", "date": "2024-07-16 22:00", "url": "https://ktbb.com/post/?p=1339315", "domain": "ktbb.com", "domain_classification": "Unknown", "message": "Michail Chkhikvishvili -- who calls himself \"Commander Butcher\" -- is leader of the violent white supremacist group known as the Maniac Murder Cult, according to federal prosecutors.\nChkhikvishvili allegedly replied that they \"ask people for brutal beating, arson/explosion or murder vids on camera,\" and stated that \"[p]oisoning and arson are best options for murder.\"\nFor the candy attack, Chkhikvishvili allegedly gave the undercover agent detailed instructions for how to make deadly poisons by extracting ricin from castor beans.\nChkhikvishvili, who visited his grandmother in Brooklyn in June 2022, allegedly claimed to have committed hate crimes while there.\n\"As alleged, the defendant sought to recruit others to commit violent attacks and killings in furtherance of his Neo-Nazi ideologies,\" United States Attorney Breon Peace said in a statement.", "location": "Brooklyn", "classification": "security", "score": 0.408408260840157, "event_breakdown": "Target Event:\n[USA - New York - Brooklyn] Michail Chkhikvishvili, the self-proclaimed commander of a Neo-Nazi cult called Maniac Murder Cult, is alleged to have detailed how the group would perform mass murder, according to court documents. Police said he plotted in the house in one of Brooklyn's [New York] most diverse neighborhoods, Bay Ridge. Chkhikvishvili, who visited his grandmother in June 2022, was arrested on his way to JFK Airport for flights to join Ukrainian forces in the war against Russia."}, {"id": "fb3d45fb-f141-4725-a2c3-9e647c80727b", "title": "Israel bombs Gaza after US criticises high civilian toll", "date": "2024-07-16 18:45", "url": "https://www.enca.com/news/israel-bombs-gaza-after-us-criticises-high-civilian-toll", "domain": "enca.com", "domain_classification": "Unknown", "message": "Israel kept up its bombing of Gaza Tuesday, after its key military backer the United States renewed criticism of its ally over the high civilian casualty toll of the war.\nHours earlier, US Secretary of State Antony Blinken told two top Israeli officials that casualties among Palestinian civilians \"still remain unacceptably high\".\n\"We continue to see far too many civilians killed in this conflict,\" spokesman Matthew Miller said after Blinken meth Strategic Affairs Minister Ron Dermer and National Security Adviser Tzachi Hanegbi.\nWashington has been pushing for a truce between Israel and Hamas.\nHaniyeh said Hamas stood ready to return to the indirect talks once Israel \"demonstrates seriousness in reaching a ceasefire agreement and a prisoner exchange deal\".", "location": "Gaza", "classification": "security", "score": 0.5117276376898148, "event_breakdown": "1. Israel kept up its bombing of Gaza Tuesday.\n2. Antony Blinken, US Secretary of State told two top Israeli officials that casualties among Palestinian civilians \"still remain unacceptably high\".\n3. The spokesman Matthew Miller after Blinken met said \"We continue to see far too many civilians killed in this conflict\".\n4. Washington has been pushing for a truce between Israel and Hamas.\n5. Haniyeh said Hamas stood ready to return to the indirect talks once Israel \"demonstrates seriousness in reaching a ceasefire agreement and a prisoner exchange deal\"."}, {"id": "d06df0b5-f365-4026-9cce-2825939fd45e", "title": "40 Palestinians Killed By 2 Israeli Attacks In Gaza : Hamas", "date": "2024-07-16 22:45", "url": "https://menafn.com/1108447029/40-Palestinians-Killed-By-2-Israeli-Attacks-In-Gaza-Hamas", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Gaza, July 17 (IANS) At least 40 Palestinians were killed in two by the Israeli in the Gaza Strip on Tuesday, the Hamas-run office said in a statement.\nOne attack in the UN-affiliated Al-Razi School in the Nuseirat refugee camp in central Gaza killed 23 Palestinians, with 73 others injured, the statement said.\nThe Israeli airstrike, not preceded by any warning, caused partial destruction of the school, Xinhua news agency reported, citing local sources and eyewitnesses.\nThe other attack in the al-Mawasi area of Khan Younis in the southern Gaza Strip killed 17 Palestinians and injured 26 others, the media office said.\nIsrael has been launching a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on October 7, 2023, during which about 1,200 people were killed and more than 200 were taken hostage.", "location": "GAZA STRIP", "classification": "security", "score": 0.9869975761695953, "event_breakdown": "Target event not found."}, {"id": "121653be-9c37-4a5e-8efd-5e0bc53dea56", "title": "The IDF has run the risk in making public its strike on Deif", "date": "2024-07-16 04:45", "url": "https://www.jpost.com/opinion/article-810446", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In the first few days of May 1945, rumors swirled across Europe regarding the fate of Germany’s leader, Adolf Hitler.\nAn undated photo of Mohammad Deif, the leader of the Izzadin al-Qassam Brigades, Hamas's military wing.\n(credit: REUTERS/FILE PHOTO)Moreover, visual intelligence covered the scene before, during, and after the strike, showing no evidence that Deif had left the area.\nThe move has also brought several risks, including the lack of the necessary reward to confirm Deif’s death.\nWe are determined to continue to persecute senior Hamas officials, those who planned and carried out the massacre of October 7.”The Israeli military has been down this road before.", "location": ".\nGAZA", "classification": "security", "score": 0.975888496420739, "event_breakdown": "Israeli soldiers targeted and killed a senior Islamic Jihad commander in Gaza early on Tuesday morning, the IDF Spokesperson's Unit has confirmed. Baha Abu Al Ata was reportedly killed along with his wife in a strike on their home in Shejaia. According to Palestinian reports, their two children were also injured in the attack.\nA senior Iranian military official has been killed by a United States airstrike in Iraq, according to the Pentagon. Gen. Qassem Soleimani, a top commander of Iran's Revolutionary Guard Corps, was killed Friday at Baghdad International Airport, the U.S. Department of Defense said in a statement. Pentagon officials said the airstrike was aimed at deterring future Iranian attack plans. U.S. Secretary of State Mike Pompeo said in a tweet that Soleimani was responsible for the deaths of Americans. The U.S. has concluded that Soleimani was behind Kata'ib Hezbollah attacks on American military, diplomatic, and civilian personnel in Iraq over the past several months and was plotting new attacks, Pompeo said. Iran has also made threats against the U.S., Pompeo said."}, {"id": "a9b394b4-9b0c-4d13-9410-c762414c3be3", "title": "IDF finds Hamas rebuilds military capabilities in UNRWA HQ", "date": "2024-07-16 01:00", "url": "https://www.ynetnews.com/article/hklt40z00r", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "IDF forces operating in a compound used as the headquarters of UNRWA in Gaza, found Hamas had rebuilt its military capabilities in the six months since troops withdrew from the area.\n\"Hamas still has squad, platoon, and company commanders, and it operates in a different manner—more guerrilla-like and less as a full military framework,\" an IDF spokesperson said.\nThe New York Times published a report on Hamas' combat methods in Gaza, which heavily rely on guerrilla tactics and blending into the civilian population.\nThe investigation, based on the analysis of Hamas battle videos and interviews with both Hamas fighters and IDF soldiers, paints a picture of a systematic exploitation of civilians and civilian infrastructure for military purposes.\n2 View gallery IDF uncovering munitions ( Photo: IDF Spokesperson's Unit )According to the investigation, Hamas utilizes an extensive tunnel system stretching hundreds of kilometers, whose scale surprised IDF commanders.", "location": "Gaza", "classification": "security", "score": 0.8826775086279831, "event_breakdown": "IDF uncovering munitions in a UNRWA compound in Gaza"}, {"id": "6e90c044-a069-435f-81b3-2cc66838c653", "title": "Senior North Korean diplomat defects to South", "date": "2024-07-16 13:45", "url": "https://www.the-star.co.ke/news/world/2024-07-16-senior-north-korean-diplomat-defects-to-south/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "A high-profile North Korean diplomat stationed in Cuba has defected to the South, Seoul's spy agency has confirmed to the BBC.\nThe political counselor is believed to be the highest-ranking North Korean diplomat to escape to South Korea since 2016.\nSouth Korean media reports say the defector was a counsellor responsible for political affairs at the North Korean embassy in Cuba.\n\"Every North Korean thinks at least once about living in South Korea,\" the newspaper quoted him as saying.\nAddressing the ceremony, South Korean President Yoon Suk Yeol promised better financial support for North Korean defectors and tax incentives for companies hiring them.", "location": "CUBA", "classification": "security", "score": 0.6186357586334155, "event_breakdown": "North Korean diplomat stationed in Cuba defects to South Korea."}, {"id": "8cd46f01-b382-400d-94f7-bb8341e4530d", "title": "Portland rocked by deadly weekend : five killed in separate incidents across the city", "date": "2024-07-16 00:30", "url": "https://katu.com/news/local/portland-rocked-by-deadly-weekend-five-killed-in-separate-incidents-across-the-city", "domain": "katu.com", "domain_classification": "Unknown", "message": "Portland police say five people were killed in four different areas of Portland last weekend.\nI can't remember a weekend that was as violent as this weekend.\nPPB's acting Deputy Chief Chris Gjovik, told KATU news how the bureau plans to respond to the spike in violence.\nEight people were killed in July 2022, seven of these people died in shootings, and one person was stabbed to death.\n\"We generally see a spike in the summer, the spike this year has been relative to past years lower but, still elevated in the summer months.", "location": "Portland, Oregon", "classification": "security", "score": 0.5436095360659168, "event_breakdown": "Five people were killed in Portland last weekend, police say."}, {"id": "19802c58-1c2e-44ba-b56f-89d420161b05", "title": "Man Fatally Stabbed in Westmont Identified", "date": "2024-07-16 03:30", "url": "https://kfiam640.iheart.com/content/2024-07-15-man-fatally-stabbed-in-westmont-identified/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "LOS ANGELES (CNS) - A 31-year-old man who was stabbed to death in the unincorporated Westmont area was identified Monday by the Los Angeles County Department of Medical Examiner.\nInvestigators responded to the 11200 block of Normandie Avenue, near Imperial Highway, around 4:15 p.m. Friday regarding a fatal stabbing, where the victim was pronounced dead at the scene, according to the Los Angeles County Sheriff's Department.\nThe medical examiner later identified the victim as Miguel Romero of Los Angeles.\nIt was unclear what led up to the stabbing, and there was no description of a suspect.\nAnyone with information regarding the stabbing was urged to call the Sheriff's Homicide Bureau at 323-890-5500.", "location": "LOS ANGELES", "classification": "security", "score": 0.8152377218713065, "event_breakdown": "Miguel Romero, 31, stabbed to death in unincorporated Westmont area"}, {"id": "a32b8bd0-5a94-43e0-9a26-be4d4a21546e", "title": "Washington leaders agree harmful political rhetoric must end", "date": "2024-07-16 07:45", "url": "https://www.kiro7.com/news/local/washington-leaders-agree-harmful-polical-rhetoric-must-end/YMKZCFTFRRHJTDNJUFG5FRFXBA/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Unable to retrieve current events of security reported in text that have a specific location."}, {"id": "81a4febd-179e-478d-8ae5-d20a56f28d53", "title": "  Running Out of Tank - Resistance Roundup - Day 283", "date": "2024-07-16 03:30", "url": "https://www.palestinechronicle.com/running-out-of-tanks-resistance-roundup-day-283/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "By Palestine Chronicle StaffTwo Israeli Merkava tanks were blown up today in the Tal Al-Hawa neighborhood south of Gaza, according to a statement issued by Al-Qassam Brigades on their Telegram channel.\nThe statement said that all Israeli soldiers in both tanks were killed or wounded in the attack, which reportedly took place near Roundabout 17 in Tal Al-Hawa.\nAl-Qassam has used improvised explosives repurposed from an Israeli missile that was launched against Gaza but did not explode.\nBelow are the latest statements by the two main Resistance forces in Gaza, and the Lebanese Resistance Movement Hezbollah.\nTargeting a gathering of Israeli enemy soldiers in the vicinity of the Branit Barracks with rocket weapons, hitting it directly.", "location": "GAZA", "classification": "security", "score": 0.988013617599048, "event_breakdown": "Targeting a gathering of Israeli enemy soldiers in the vicinity of the Branit Barracks with rocket weapons, hitting it directly.\nTargeting Israeli soldiers in the vicinity of Tal al-Hawa and hitting them directly with rocket weapons."}, {"id": "19297511-1f93-4adf-a67e-1ca002073306", "title": "Russia Ukraine war latest : Last Russian naval patrol ship leaves Crimea in big win for Ukraine", "date": "2024-07-16 08:30", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-drones-crimea-latest-news-b2580371.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nOne person was injured when a drone dropped an explosive device on a house elsewhere in the region, interim governor Alexei Smirnov said.\nVyacheslav Gladkov, the governor of Russia’s Belgorod region near the Ukrainian border said four people were injured by Ukrainian shelling.\nIn the Voronezh region, one person was wounded in a drone attack, local governor Alexander Gusev said.\n“The last patrol ship of the Black Sea Fleet of the Russian Federation is bolting from our Crimea just now.", "location": "The exact location is Odessa.", "classification": "security", "score": 0.8344452556017197, "event_breakdown": "The target event is a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nThe incident happened at the Staryi Krym border post in the Rostov region, Russia said.\nMr Emanuel added that the Russian troops had been “retreating through our territory” for three hours after Poland had witnessed large numbers of Russian forces withdrawing.\nRussia annexed Crimea from Ukraine in 2014.\n“What we have seen exceeds all human norms and values,” Podolyak said in written remarks to the Associated Press on Thursday.\nOne person was injured when a drone dropped an explosive device on a house in the Voronezh region, southeastern Russia, said Alexander Gusev, the governor of Voronezh region."}, {"id": "d8b186cb-bae8-439b-9a2c-bcf2abcd57eb", "title": "Residents of the north outraged : The house is on fire , children are shaking in shelters", "date": "2024-07-16 22:15", "url": "https://www.israelnationalnews.com/news/393158", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It is inconceivable that our house is burning and under such a threat and Lebanon is not burning.\nMatan Davidyan, also a resident of the north, added, \"It seems that the Israeli government, and in particular the Minister of Defense, simply does not care about us.\nTens of thousands of residents are not sleeping again tonight and are anxious.\nShlomo Salem, a member of the Shlomi City Council and one of the leaders of the organization, added, \"Thousands of residents are under an unprecedented attack, children and parents are shaking, scared and frustrated inside the shelters.\nMa'ayan Benizri, a resident of the north, concluded, \"The reality in the north must change and move from defense to attack, children are sleeping in fear, and wake up in fear of sirens.", "location": "northern Israel", "classification": "security", "score": 0.7724371910810949, "event_breakdown": "Israel's North shuddered with a rocket attack late on Sunday\nExplosions reverberated through the northern communities of Shlomi and the Western Galilee early Monday morning, leaving two rockets downed in open areas, zero injuries, and a large amount of damage across the Shlomi region.\nShlomi's elementary and high schools opened as all-clears were sounded,0 and shelters opened up.\nIsrael Air Force launched an immediate attack on Syrian military positions, damaging several air defense systems."}, {"id": "afeaeb4f-1eea-4795-8f86-0833c5ec5ae9", "title": "Death toll of Russia July 14 attack on Donetsk Oblast town rises to 3", "date": "2024-07-16 09:15", "url": "https://www.yahoo.com/news/death-toll-russias-july-14-075622184.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The death toll of a Russian attack against Myrnohrad in Donetsk Oblast on July 14 has risen to three as rescue operations had concluded, the Interior Ministry said on July 16.\nSeven people were injured in the attack, and seven more were rescued from the rubble by first responders, the Interior Ministry said.\nDonetsk Oblast, partially occupied by Russia since 2014, suffers some of the heaviest daily attacks by Russia while Moscow's troops are pushing forward in multiple directions.\nOver the past day, eight people were injured in Russian strikes, Governor Vadym Filashkin said in his morning report on July 16.\nRead also: ‘No region in Ukraine endures hell like Donetsk Oblast,’ governor says of Russia’s warWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "DONETSK OBLAST", "classification": "security", "score": 0.6942966943185936, "event_breakdown": "Civilians in Donetsk Oblast, Ukraine still suffer daily casualties as Russia intensifies attacks. Rescue operations conclude after Russian attack in the city Myrnohrad in the Donetsk Oblast, with the death toll rising to three, seven injured, and seven rescued from the rubble."}, {"id": "955f4852-0e76-4d45-9b1a-5043dd350240", "title": "Kyodo News Digest : July 16 , 2024", "date": "2024-07-16 04:30", "url": "https://english.kyodonews.net:443/news/2024/07/e3cce71da6c1-kyodo-news-digest-july-16-2024.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 9 hours ago - 23:00 | All, Japan, WorldThe following is the latest list of selected news summaries by Kyodo News.\n----------Japan likely spent 2 tril.\nThe government has remained silent on whether it stepped into the market, leaving financial markets guessing.\nyen on July 12 on currency market interventionTOKYO - The operator of the crippled Fukushima Daiichi nuclear power plant on Tuesday completed its seventh round of treated radioactive water discharge into the ocean.\n----------5 taken to hospital after alleged arson at central Japan city hallNAGOYA - Five people were taken to hospital Tuesday after fire, believed to have been deliberately lit, broke out at a city hall in central Japan, according to local authorities.", "location": ".\nNagoya", "classification": "security", "score": 0.4233653336084808, "event_breakdown": "1. Japan likely spent 2 tril. yen on July 12 on currency market intervention\n2. Radioactive water discharge from Fukushima plant completed\n3. Five taken to hospital after alleged arson at central Japan city hall"}, {"id": "f3de69f9-9203-42ff-8dcc-0e0980000e71", "title": "How Trump assassination attempt compares to the attempt on Ronald Reagan life in 1981", "date": "2024-07-16 18:15", "url": "https://abcnews.go.com/US/trumps-assassination-attempt-compares-attempt-ronald-reagans-life/story?id=111927583", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The attack on Trump garnered immediate comparisons to the attempt on the life of then-President Ronald Reagan in 1981.\nIn this Monday, March 30, 1981 combination file photos, President Reagan waves, then looks up before being shoved into Presidential limousine by Secret Service agents after being shot outside a Washington hotel.\nFormer President Ronald Reagan waves and then looks up before being shoved into the President's limousine by secret service agents after being shot outside a Washington hotel, March 30, 1981.\nAnother resemblance between the two attacks is the scrutiny surrounding the Secret Service.\nAccording to the Congressional Research Service, direct assassination attempts against presidents and candidates have occurred on at least 15 separate occasions.", "location": "Washington, D.C.", "classification": "security", "score": 0.5826823777615834, "event_breakdown": "These events include the assassination attempt on President Ronald Reagan in 1981 and the attack on President Donald J. Trump in 2017."}, {"id": "5e7ba81c-9905-4516-b9e9-563cb9954813", "title": "Israel northern front is ready , but will a war with Hezbollah begin ? ", "date": "2024-07-16 19:00", "url": "https://www.jpost.com/israel-hamas-war/article-810576", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Hezbollah continues to attack northern Israel daily.\nOn July 16, the IDF said, “Earlier today [Tuesday], two Hezbollah terrorists were identified fleeing the area from which projectiles were launched toward Kiryat Shmona in northern Israel yesterday [Monday].\n(credit: screenshot)In northern Israel, the IDF is ready for any eventuality.\nIsrael was always ready for the big war in the North against Hezbollah.\nThere are still 50,000 evacuees from northern Israel.", "location": "Israel", "classification": "security", "score": 0.6440935955086836, "event_breakdown": "IDF, in second attempt, shoots down Hezbollah drone that entered Israeli airspace."}, {"id": "68539513-38e3-4efe-85ab-8649660a7599", "title": "The Latest | Israeli police shoot and kill a Palestinian who stabbed an officer in the West Bank", "date": "2024-07-16 07:45", "url": "https://www.newsday.com/news/nation/israel-hamas-gaza-latest-07-16-2024-c28607", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, as Israel and Hamas weigh the latest cease-fire proposal.\nAnd the Israeli military says it will begin sending draft notices to Jewish ultra-Orthodox men on Sunday, a step that could destabilize Prime Minister Benjamin Netanyahu’s government.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\n— Israeli strikes in southern and central Gaza kill more than 60 Palestinians, including in ‘safe zone.’— Far-right groups that block aid to Gaza receive tax-deductible donations from U.S. and Israel.\nPalestinians inspect the damage at a site hit by an Israeli bombardment on Khan Younis, southern Gaza Strip, Saturday, July 13, 2024.", "location": "Gaza", "classification": "security", "score": 0.9261460268608754, "event_breakdown": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, as Israel and Hamas weigh the latest cease-fire proposal."}, {"id": "7ac5ae59-b464-4af8-bb5e-13edcf509a63", "title": "Balochistan govt suspends internet services in several cities during Muharram", "date": "2024-07-16 11:45", "url": "https://news.webindia123.com/news/Articles/World/20240716/4215652.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Recently, clashes erupted in Haripur district of Pakistan's Khyber Pakhtunkhwa province over road barricading during a Muharram procession in Shah Mohammad village.\nPrevious attacks during Muharram have resulted in casualties, underscoring ongoing security challenges and the misuse of social media for incitement.\nSimilarly, a suicide bombing targeting a Muharram procession in Karachi on December 28, 2009 claimed the lives of at least 43 people and injured over 100.\nAnother bomb attack during a Muharram procession in Rawalpindi on November 21, 2012 resulted in the deaths of at least 23 people and injured over 60.\nThese incidents highlight the ongoing security threats faced during this period of religious observance.", "location": "Haripur, Khyber Pakhtunkhwa, Pakistan.", "classification": "security", "score": 0.9677276040255955, "event_breakdown": "43 killed in a suicide bombing targeting a Muharram procession in Karachi on December 28, 2009 ( Karachi, Pakistan)\n23 killed in a bomb attack during a Muharram procession in Rawalpindi on November 21, 2012 ( Rawalpindi, Pakistan)\nclashes erupted in Haripur district of Pakistan's Khyber Pakhtunkhwa province over road barricading during a Muharram procession in Shah Mohammad village (Haripur, Pakistan)"}, {"id": "90141ec9-cd3a-4982-802e-62483d659996", "title": "Israel kills 3 Syrian children in attack on southern Lebanon : Report", "date": "2024-07-16 20:45", "url": "http://www.presstv.ir/Detail/2024/07/16/729459/israel-lebanon-syrian-children", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Three Syrian children have been killed in an Israeli strike on southern Lebanon.\nThe children were killed on Tuesday in the strike on agricultural land in the village of Umm al-Tut.\nLebanon’s National News Agency (NNA) said the children were killed “in an enemy raid that targeted farmland in the village of Umm al-Tut.”NNA said separate Israeli strikes on southern Lebanon killed five people.\nMeanwhile, Lebanon’s resistance movement Hezbollah said its fighters fired retaliatory rockets at Israeli positions.\nIsraeli strikes on Lebanon have killed 511 people since October, according to an AFP tally.", "location": "Umm al-Tut, Lebanon", "classification": "security", "score": 0.9864213883071488, "event_breakdown": "Israeli strikes on Lebanon have killed 511 people since October, according to an AFP tally.\nHezbollah says its fighters fired retaliatory rockets at Israeli positions."}, {"id": "d621bf2c-07bb-4c20-913e-8dd37b4ed022", "title": "What to know about the attempt on Trump life and its aftermath", "date": "2024-07-16 07:45", "url": "https://www.kiro7.com/news/national/what-know-about/E7LFQHT43RDE7PJ7HJ6SVCH7JY/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Assuming that the website is unavailable outside the US, the main location where the main event takes place is the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Sorry, no relevant events could be found."}, {"id": "26e90074-5fc0-43a3-b2f3-c327f8ab6fd2", "title": "Russo - Ukraine War - 15 July 2024", "date": "2024-07-16 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-15.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Lymans Лиkomu direction, Russian forces attacked five times in the areas of Nevs Наkogo and Terniv.\nIn the Vremívs ютьсяkomu direction, Ukrainian troops repelled seven Russian attacks near Vodyanyogo, Konstantinivka and Makarivka, two confrontations continue.\nHero of Ukraine Lieutenant Bogdan Zavada, who also rightfully destroy Russian forces and force them to renounce their zagarbnic праkih intentions.", "location": "VODYANE MOGILEVSK region", "classification": "security", "score": 0.7356273117056721, "event_breakdown": "In the Lymans Лиkomu direction, Russian forces attacked five times in the areas of Nevs Наkogo and Terniv. In the Vremívs ютьсяkomu direction, Ukrainian troops repelled seven Russian attacks near Vodyanyogo, Konstantinivka and Makarivka. Two confrontations continue."}, {"id": "671c67ae-5621-4be9-8a93-80742b54908f", "title": "Russia - Ukraine War Provides New Opportunities For North Korea Tank Industry – The Diplomat", "date": "2024-07-16 16:15", "url": "https://thediplomat.com/2024/07/russia-ukraine-war-provides-new-opportunities-for-north-koreas-tank-industry/", "domain": "thediplomat.com", "domain_classification": "Unknown", "message": "In this photo provided by the North Korean government, North Korean leader Kim Jong Un drives a new-type tank in North Korea, March 13, 2024.\nFollowing the visit of Russian President Vladimir Putin to North Korea on June 19, speculation regarding the possible future of the two neighboring states’ relationship has been widespread.\nThis has largely centered on the possibility of North Korean labor and munitions exports to Russia, and transfers of Russian nuclear, space, and defense technologies and commodities in return.\nRussia’s tank shortages could potentially provide a major opening for North Korea to emerge as a supplier of armor to Russia.\nThis reflects broader trends toward the North Korean defense sector reaching a cutting edge level, as otherwise seen in areas ranging from hypersonic glide vehicles to long-range surface-to-air missile systems.", "location": "North Korea", "classification": "security", "score": 0.5190316219615234, "event_breakdown": "North Korean Leader Kim Jong Un drives a new-t\n\nPeter Dutton hints at possible federal election as Albanese blocks security bills\n\nNATO to announce Sweden and Finland as ‘invitees’\n\nIran vows revenge after parade attack\n\nIn this photo provided by the North Korean government, North Korean leader Kim Jong Un drives a new-type tank in North Korea, Monday, March 13, 2024. Independent journalists were not given access to cover the event depicted in this image."}, {"id": "7c4c0d86-5dd2-402d-8bee-517b1677a500", "title": "433rd CRF Kickstarts , Transforms , and Closes CLOR 2024 > Air Force Reserve Command > News Article", "date": "2024-07-16 19:30", "url": "https://www.afrc.af.mil/News/Article-Display/Article/3840442/433rd-crf-kickstarts-transforms-and-closes-clor-2024/", "domain": "afrc.af.mil", "domain_classification": "Unknown", "message": "Jerome Williams, 433rd CRF team chief.\nCLOR 24 included total force Air Force Airmen, U.S. Army, U.S. Navy, the Royal Canadian Air Force, and civilian vendors.\nThe defenders trained the 433rd CR team on fire team procedures, employed agile combat tactics through battle drills utilizing blank ammunitions and smoke grenades.\nOn 28 June, the final day of the rehearsal, the CRF team reclaimed the airfield and transferred out passengers and cargo.\nAll together the 433rd CR team worked alongside joint forces, coalition partners, utilized groundbreaking technology, transferred over 400 passengers, 286,000 pounds of cargo, and many aircraft.", "location": "itself\nMCCONNELL AIR FORCE BASE, KANSAS", "classification": "security", "score": 0.6128927164552759, "event_breakdown": "Jerome Williams, 433rd CR team chief, led a team of 12 Airmen from three units across two MAJCOMs in the U.S. Central Command's (CENTCOM) Area of Responsibility during CLOR 24.\n\nThe 433rd CR team trained with 83rd Expeditionary Rescue Squadron, U.S. Army Soldiers from the 1st Battalion, 108th Aviation Regiment, U.S. Navy Sailors, Royal Canadian Air Force Members, and 27 civilian vendors for 15 days at Al Dhafra Air Base in the United Arab Emirates.\n\nThe defenders trained the 433rd CR team on fire team procedures, battle drills, and fire team tactics utilizing blank ammunitions and smoke grenades to understand the threats and challenges they may face.\n\nCLOR 24 included Total Force Airmen, U.S. Army Soldiers, U.S. Navy Sailors, Royal Canadian Air Force personnel, and 27 civilian vendors.\n\nThe 433rd CR team worked alongside joint forces, coalition partners, and 27 military members during CLOR 24. They utilized groundbreaking technology, transferred over 400 passengers and 286,000 pounds of cargo, demonstrated fire team tactics and procedures, and established relationships with joint and coalition partners."}, {"id": "9382368b-f535-44cb-9e94-2dce2139dcbc", "title": "Faculty | Todd Beltz", "date": "2024-07-16 18:45", "url": "https://usnwc.edu/Faculty-and-Departments/Directory/Todd-Beltz", "domain": "usnwc.edu", "domain_classification": "Unknown", "message": "Todd Beltz is native to Lehighton, Pennsylvania and is a 1989 graduate of the Pennsylvania State University.\nHe is currently an associate professor in the War Gaming Department, Center for Naval Warfare Studies.\nPrior to joining the NWC faculty, he was a War Gaming specialist with NETSIMCO.\nProfessor Beltz served for 32 years on active duty as a Nuclear Trained Surface Warfare Officer including two Commanding Officer tours (USS ENTERPRISE (CVN 65) and USS ELROD (FFG 55)), four Executive Officer tours, and as an Operations Research Analyst in OPNAV N81.", "location": "Pennsylvania State University", "classification": "security", "score": 0.7631365298405853, "event_breakdown": "Target: \nEvents:\nTodd Beltz is an associate professor at the Center for Naval Warfare Studies who teaches wargaming. He previously served on active duty as a Nuclear Trained Surface Warfare Officer."}, {"id": "92b9ca45-e733-41fe-b611-9af8358f8a7a", "title": "Russia sends group of priests to occupied territories of Ukraine to  support  injured Russian soldiers", "date": "2024-07-16 14:30", "url": "https://www.yahoo.com/news/russia-sends-group-priests-occupied-120051863.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia sends group of priests to occupied territories of Ukraine to \"support\" injured Russian soldiersThe priests of the Russian Orthodox Church were sent to the temporarily occupied territories of Ukraine to \"support\" injured Russian soldiers.\nPhoto: LunaMarina/DepositPhotosThe Kremlin has sent the priests of the Russian Orthodox Church to the temporarily occupied territories of Ukraine allegedly so they can support Russian soldiers who were injured and hospitalised.\nIn reality they will urge them to come back to the combat zone and continue waging the war against Ukraine.\nEarlier it was revealed that the Russians try to make Ukrainian children in the occupied territories of Ukraine into Russian \"patriots\".\nMoreover, recently the occupying authorities in Crimea organised the Women as Peacemakers forum for female residents of the occupied Ukrainian territories.", "location": "Ukraine", "classification": "security", "score": 0.4075047349265518, "event_breakdown": "Russia sends group of priests to occupied territories of Ukraine to \"support\" injured Russian soldiers\nKremlin sends priests of Russian Orthodox Church to occupied Ukrainian territories to support injured Russian soldiers."}, {"id": "b24a6034-3013-4c87-a9aa-f54cd8afacd5", "title": "Carolina Museum of the Marine construction progresses , earth cameras to be installed", "date": "2024-07-16 18:30", "url": "https://www.wcti12.com/news/local/carolina-museum-of-the-marine-construction-progresses-earth-cameras-to-be-installed", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "In Jacksonville, we have an update on the Carolina Museum of the Marine.\nSteven Lunsford, the museum’s director of operations says this week crews are finalizing the preparation of the building pad and preparing the footing layout.\nCrews will also be planting three new oak trees from Belleau Wood, France.\nLunsford tells News 12 the trees were donated in commemoration of the Battle of Belleau Wood during World War I.\nTo learn additional information, visit the museum's website by clicking", "location": "Jacksonville, North Carolina", "classification": "security", "score": 0.41304953048439913, "event_breakdown": "Carolina Museum of the Marine:\nCrews are finalizing the preparation of the building pad and preparing the layout for footings at the Carolina Museum of the Marine. Three new oak trees will be planted to commemorate the Battle of Belleau Wood during World War I."}, {"id": "65a320c9-cec0-4da9-b357-b49c8d207b1e", "title": "US Special Force Secret Flights From Cyprus to Israel", "date": "2024-07-16 18:15", "url": "https://consortiumnews.com/2024/07/16/us-special-forces-secret-flights-from-cyprus-to-israel/", "domain": "consortiumnews.com", "domain_classification": "Unknown", "message": "The U.S. military has been flying covert planes to Israel from RAF Akrotiri since the bombing of Gaza began, Matt Kennard reports.\nDeclassified has found 18 of these aircraft which have gone from the sprawling British air base on Cyprus, RAF Akrotiri, to Israel’s coastal city Tel Aviv since Oct. 7.\nIn November 2023, a U.S. military official revealed that American special forces were stationed in Israel and “actively helping the Israelis”.\nTransport FlightsDeclassified has also found 26 marked USAF planes have arrived at RAF Akrotiri since the bombing of Gaza began.\nOn June 24, a U.S.-operated C-17 was sent from RAF Akrotiri to Tel Aviv, before flying on to Ramstein.", "location": "RAF Akrotiri", "classification": "security", "score": 0.8861494966458191, "event_breakdown": "RAF Akrotiri - The United States has flown covert aircraft to this British air base on Cyprus, before flying on to Israel’s coastal city Tel Aviv since the bombing of Gaza began."}, {"id": "b3131def-9abb-4cd2-9f6f-271c855d3f99", "title": "War update : 119 combat engagements in Ukraine in past 24 hours", "date": "2024-07-16 07:45", "url": "https://www.ukrinform.net/rubric-ato/3885725-war-update-119-combat-engagements-in-ukraine-in-past-24-hours.html", "domain": "ukrinform.net", "domain_classification": "Unknown", "message": "\"Over the past 24 hours, a total of 119 combat clashes have taken place.\nKupiansk axis: Ukraine’s Defense Forces repelled five Russian attacks near Petropavlivka in Kharkiv region and Stelmakhivka in Luhansk region.\nKramatorsk axis: the Defense Forces stopped six enemy attempts to break through the defense lines in the Hryhorivka and Chasiv Yar areas, Donetsk region.\nToretsk axis: Russian invaders launched 14 attacks, focusing on New York and Pivnichne.\nYesterday, Ukraine’s Air Force, missile and artillery units inflicted damage on 11 enemy manpower clusters, a control post, two air defense systems, a radar, and an e-warfare system.", "location": "Based on the text provided, it was not possible to determine a specific location for the main event. The events mentioned in the text seem to", "classification": "security", "score": 0.9018082372438158, "event_breakdown": "Kupiansk axis: On June 24, 2022, the Ukrainian military repelled five Russian attacks near Petropavlivka and Stelmakhivka.\nKramatorsk axis: On June 24, 2022, the Ukrainian military stopped six Russian attempts to break through the defense lines in the Hryhorivka and Chasiv Yar areas, Donetsk region.\nToretsk axis: On June 24, 2022, Russian forces launched 14 attacks, focusing their efforts New York and Pivnichne."}, {"id": "694b5bd5-be4d-4040-a2ea-b0bea1a896e2", "title": "USS New York Wins the CNO Award for Atlantic Fleet > United States Navy > News Stories", "date": "2024-07-16 18:45", "url": "https://www.navy.mil/Press-Office/News-Stories/Article/3840371/uss-new-york-wins-the-cno-award-for-atlantic-fleet/", "domain": "navy.mil", "domain_classification": "Unknown", "message": "Here's how you knowAn official website of the United States government", "location": "WASHINGTON, D.C.", "classification": "security", "score": 0.8634127880383812, "event_breakdown": "[\n  {\n    \"title\": \"Fatal Shooting in Seattle's Chinatown-International District\",\n    \"description\": \"A shooting in Seattle's Chinatown-International District has left one person dead and two others injured.\",\n    \"day\": \"2022-06-26T13:00:00Z\",\n    \"geo\": {\n      \"coordinates\": [\n        -122.3321,\n        47.6089\n      ],\n      \"type\": \"Point\"\n    }\n  },\n  {\n    \"title\": \"Man killed in shooting near 9th Ave S and S Massachusetts Street\",\n    \"description\": \"around 12:50 a.m. Saturday, officers responded to multiple reports of gunfire in the 9200 block of 9th Ave S in the South Seattle neighborhood, according to police. When Seattle Fire Department Medics arrived on scene, they located two men who were suffering had gunshot wounds.\",\n    \"day\": \"2022-06-25T11:00:00Z\",\n    \"geo\": {\n      \"type\": \"Point\"\n    }\n  }\n]"}, {"id": "aa11c763-593f-430d-900c-ce8539347fb2", "title": "Amid Continuous Attacks , Over 50 Locations Finalised in Three Regions to Tackle Mountain Terror in J & K", "date": "2024-07-16 07:45", "url": "https://www.news18.com/india/amid-continuous-attacks-over-50-locations-finalised-in-three-regions-to-tackle-mountain-terror-in-jk-8967402.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "In a major development, security forces have been asked to cover hilly areas in three regions in Jammu and Kashmir.\nThis comes amid a rise in terror attacks in the Jammu region, the latest being the Doda attack.\nAccording to top-level sources, Doda, Poonch, and Rajouri, which are witnessing terror attacks on forces and civilians, will have area-wise deployments to tackle terror.\nWithout sharing many details about the move, a senior official said that more than 50 locations have been identified for the domination of security forces.\nThe new strategy includes the deployment of multiple security forces.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.7065285019751649, "event_breakdown": "1. Security forces asked to cover hilly areas in three regions in Jammu and Kashmir\n\nTarget event: Security forces asked to cover hilly areas in Jammu and Kashmir, Doda, Poonch and Rajouri."}, {"id": "bfb7d676-3d29-4c27-a29d-f01ae756cc4c", "title": "Italy launches its seventh and final PPA multi - purpose vessel", "date": "2024-07-16 13:00", "url": "https://www.naval-technology.com/news/italy-launches-its-seventh-and-final-ppa-multi-purpose-vessel/", "domain": "naval-technology.com", "domain_classification": "Unknown", "message": "Italy’s final vessel in the new class of Offshore Multi-Purpose Patrol Vessels (PPA) was launched in Genoa on 13 July 2024.\nDesignated Domenico Millelire (P436), the seventh and final PPA ship was transferred to water for the first time.\nTheir primary missions include patrolling, surface combat, anti-piracy, monitoring, protection and control of maritime zones and rescue of personnel in distress.\nHowever, it remains unclear whether the two ships will come from the seven Italian PPAs.\nThis is unlikely given that Fincantieri launched Italy’s sixth PPA, the Ruggiero di Lauria, from Muggiano shipyard in October 2023.", "location": "Genoa, Italy", "classification": "security", "score": 0.6927679417767645, "event_breakdown": "Italy Launches Final Vessel in Offshore Multi-Purpose Patrol Vessel (PPA) Class\nLocation: Genoa, Italy\nDate: 13 July 2024\n\nDescription:\nItaly’s final vessel in the new class of Offshore Multi-Purpose Patrol Vessels (PPA), the Domenico Millelire (P436), was launched in Genoa on 13 July 2024. Designated the 7th and final PPA ship, the vessel was transferred to water for the first time. Its primary missions include patrolling, surface combat, anti-piracy, monitoring, protection, and control of maritime zones and rescue of personnel in distress. The name of the vessel pays homage to a Navy officer during World War II."}, {"id": "f58d211c-7142-4957-822f-9261953d3c7a", "title": "Worthplaying |  Starship Troopers : Extermination  Will Be Playable At Gamescom , Meet & Greet with Casper Van Dien", "date": "2024-07-16 20:00", "url": "https://worthplaying.com/article/2024/7/16/news/142844-starship-troopers-extermination-will-be-playable-at-gamescom-meet-greet-with-casper-van-dien/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "Starship Troopers: Extermination puts players on the far-off front lines in an all-out assault against the Arachnid menace.\nPublisher Knights Peak and developer Offworld are inviting gamescom visitors to Do Their Part and experience the 16-player-multiplayer-game Starship Troopers: Extermination in Hall 10.1, Booth E021.\nHe will be supported by a squad from the Starship Troopers German Division, who will be on hand to help him fight the alien threat.\nStarship Troopers: Extermination is currentrly available through Steam Early Access.\nStarship Troopers: Extermination is coming to PS5, Xbox Series X|S and PC (Steam) on October 11, 2024.", "location": "Based on the text provided, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.6597500504189592, "event_breakdown": "Starship Troopers: Extermination is coming to PS5, Xbox Series X|S and PC (Steam) on October 11, 2024."}, {"id": "56d92347-6352-45ca-9161-efcc81ce52d6", "title": "Israel military says it killed about half of Hama military leaders | Nation and World", "date": "2024-07-16 20:30", "url": "https://www.reviewjournal.com/news/nation-and-world/israel-says-its-killed-about-half-of-hamas-military-leaders-3095716/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Israel’s military has said it is pursuing Hamas terrorists who are hiding among civilians after offensives uprooted underground tunnel networks.\n(AP Photo/Tsafrir Abayov)The Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael has said it is pursuing Hamas terrorists who are hiding among civilians after offensives uprooted underground tunnel networks.\nThe military said Tuesday that it has eliminated half of the leadership of Hamas’ military wing and that some 14,000 terrorists have been killed or detained.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "location": "GAZA CITY", "classification": "security", "score": 0.9647095975864469, "event_breakdown": "Israel is pursuing Hamas terrorists who are hiding among civilians after offensives uprooted underground tunnel networks (target is Israel's pursuit of Hamas terrorists in Gaza)"}, {"id": "3101648c-64e6-412b-9588-89ddc6f1e9aa", "title": "Taking Enhanced Russia - North Korea Ties in Stride", "date": "2024-07-16 16:15", "url": "https://thediplomat.com/2024/07/taking-enhanced-russia-north-korea-ties-in-stride/", "domain": "thediplomat.com", "domain_classification": "Unknown", "message": "Russian President Vladimir Putin’s visit to North Korea back in June created substantial unease in both the United States and among Washington’s allies.\nNotably, Putin visited North Korea in one of his first trips as Russia’s president and he has consistently over the last two decades called for U.N. sanctions against North Korea to be watered down.\nNevertheless, it’s worth underlining that South Korea retains a very favorable balance of power over North Korea in almost all respects.\nNorth Korea continues to improve its nuclear capabilities, including intercontinental ballistic missiles (ICBMs) to target the United States.\nMoreover, North Korea is also busy developing hypersonic weaponry, and even apparently has a program for a nuclear-armed unmanned underwater vehicle.", "location": "PYONGYANG, NORTH KOREA", "classification": "security", "score": 0.5653526911314041, "event_breakdown": "[\n{\n\"title\": \"Vladimir Putin's Visit to North Korea\",\n\"description\": \"Vladimir Putin, the president of Russia, visited North Korea back in June, which created substantial unease in both the United States and among Washington's allies.\"\n},\n{\n\"title\": \"South Korea's Military Edge Over North Korea\",\n\"description\": \"South Korea retains a very favorable balance of power over North Korea in almost all respects.\"\n},\n{\n\"title\": \"North Korea's Nuclear Developments\",\n\"description\": \"North Korea continues to improve its nuclear capabilities, including intercontinental ballistic missiles (ICBMs) to target the United States.\"\n},\n{\n\"title\": \"North Korea's Hypersonic Weaponry\",\n\"description\": \"North Korea is also busy developing hypersonic weaponry, and even apparently has a program for a nuclear-armed unmanned underwater vehicle.\"\n}\n]"}, {"id": "b4f2ae84-2371-43df-a068-96550b0e4ac1", "title": "Air Force Redesigning New Stealth Fighter to Lower $300 Million Cost", "date": "2024-07-16 22:45", "url": "https://www.businessinsider.com/air-force-redesigning-new-stealth-fighter-reduce-cost-2024-7", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "\"The family of systems concept of Next Generation Air Dominance is alive and well,\" Kendall told Defense News.\nAdvertisementUS Air Force Sec.\nAdvertisementUS Air Force Maj. Paul Lopez performs aerial maneuvers during an open house event on Malmstrom Air Force Base.\nAnd although testing has been promising with these engines (particularly for GE's XA100), it seems this may be one of the areas the Air Force believes it can reduce costs.\n\"The last numbers I saw on NGAP [Next Generation Adaptive Propulsion] were pretty high,\" retired General Clint Hinote, who was previously in charge of the Air Force Futures organization, told Defense News.", "location": "Malmstrom Air Force Base", "classification": "security", "score": 0.5639490661790991, "event_breakdown": "1. The family of systems concept of Next Generation Air Dominance is alive and well. Air Force Sec. Frank Kendall told Defense News that the program is on track."}, {"id": "63ed0a2b-dbf8-49e0-9abc-5aa8412a2c6e", "title": "Russia loses 1 , 110 soldiers and 36 armoured combat vehicles in one day", "date": "2024-07-16 06:30", "url": "https://www.yahoo.com/news/russia-loses-1-110-soldiers-041821544.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses 1,110 soldiers and 36 armoured combat vehicles in one dayA tank.\nPhoto: General Staff of the Armed Forces of UkraineRussian forces have lost over 1,000 soldiers killed and wounded, as well as 13 tanks, 36 armoured combat vehicles and 44 artillery systems over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 561,400 (+1,110) military personnel;8,227 (+13) tanks;15,862 (+36) armoured combat vehicles;15,368 (+44) artillery systems;1,119 (+0) multiple-launch rocket systems;892 (+0) air defence systems;361 (+0) fixed-wing aircraft;326 (+0) helicopters;12,193 (+45) tactical and operational UAVs;2,398 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;20,680 (+57) vehicles and tankers;2,577 (+8) special vehicles and other equipment.\nSupport UP or become our patron!", "location": ")\nRUSSIA-UKRAINE BORDER", "classification": "security", "score": 0.9250747826397785, "event_breakdown": "Target Event: Russia loses 1,110 soldiers and 36 armoured combat vehicles in one dayA tank.Location: Russia"}, {"id": "7bf19ff8-f984-4e09-ba96-d586672a2fd1", "title": "Israeli strikes in southern , central Gaza , kills Palestinians in  safe zone  ", "date": "2024-07-16 22:45", "url": "https://www.ctvnews.ca/world/israeli-strikes-in-southern-central-gaza-kill-more-than-60-palestinians-including-in-safe-zone-1.6965979", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nOther strikes in Khan Younis and Rafah killed 12 people, according to medical officials and AP journalists.", "location": "GAZA CITY", "classification": "security", "score": 0.982778515548879, "event_breakdown": "Israeli airstrikes target a commander in Islamic Jihad's naval unit west of Khan Younis in Gaza."}, {"id": "b4ce7304-70cf-4b6a-bdbe-f35a0cc0aa21", "title": "Doda Encounter : 4 Soldiers Killed In Action In Encounter With Terrorists In J & K : Sources", "date": "2024-07-16 03:00", "url": "https://www.ndtv.com/india-news/5-soldiers-critically-injured-in-encounter-with-terrorists-in-jammu-and-kashmirs-doda-6114828", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "This was the second major encounter in the Jammu regionFour Indian Army soldiers, including an officer, have been killed in action during an encounter with terrorists in Jammu and Kashmir's Doda district on Monday.\nIndian Army stands firm with the bereaved families in this hour of grief,\" the post read.\n\"The Nation stands firmly with the families of our soldiers who have sacrificed their lives in the line of duty.\nSecond Major Attack In Jammu Region In One WeekThis was the second major encounter in the Jammu region after five soldiers were killed in action in Kathua last week.\nOver the last 32 months, 48 soldiers have been killed in action in the Jammu region.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.726725400516868, "event_breakdown": "Indian Army encounter in Jammu and Kashmir's Doda district kills four soldiers"}, {"id": "c8ef2071-b401-4de6-922a-05a0383f0f1e", "title": "65 combat clashes occur in combat zone , most on Pokrovsk and Kurakhove fronts – Ukraine General Staff", "date": "2024-07-16 17:30", "url": "https://www.yahoo.com/news/65-combat-clashes-occur-combat-135053804.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Sixty-five combat clashes have occurred in the combat zone since the beginning of the day on 16 July.\nThe Russians were the most active on the Pokrovsk front and intensified their actions on the Kurakhove front.\nIn addition to this, on the Kharkiv front, Russian troops attacked the defence lines of Ukrainian forces near the settlements of Vovchansk and Hlyboke in Kharkiv Oblast four times.\nOn the Orikhiv front, Russian forces tried to breach the positions of Ukrainian defences near the settlements of Mala Tokmachka and Novoandriivka but to no avail.\nOn the Kurakhove front the Russians intensified their actions, launching 12 attacks near the settlements of Krasnohorivka, Heorhiivka, Kostiantynivka and Paraskoviivka.", "location": ")\nThe most active fighting has taken place on the Pokrovsk front.", "classification": "security", "score": 0.9886838953214174, "event_breakdown": "The Russians were the most active on the Pokrovsk front and intensified their actions on the Kurakhove front.\n\nIn addition to this, on the Kharkiv front, Russian troops attacked the defence lines of Ukrainian forces near the settlements of Vovchansk and Hlyboke in Kharkiv Oblast four times.\n\nOn the Orikhiv front, Russian forces tried to breach the positions of Ukrainian defences near the settlements of Mala Tokmachka and Novoandriivka but to no avail.\n\nOn the Kurakhove front the Russians intensified their actions, launching 12 attacks near the settlements of Krasnohorivka, Heorhiivka, Kostiantynivka and Paraskoviivka."}, {"id": "6e53ae2b-96dd-47f9-b4d5-35bd924269df", "title": "Israeli strikes in Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-16 20:30", "url": "https://wwmt.com/news/nation-world/israeli-strikes-in-gaza-kill-more-than-60-palestinians-including-in-safe-zone", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nOther strikes in Khan Younis and Rafah killed 12 people, according to medical officials and AP journalists.", "location": "GAZA CITY.", "classification": "security", "score": 0.9854690280799167, "event_breakdown": "Israeli airstrikes in southern and central Gaza resulted in the deaths of 65 Palestinians, and one strike in Gaza killed 11 Israelis."}, {"id": "d5346dac-fcbc-489b-a419-dca9576962ab", "title": "Israel launches new Gaza strikes after weekend attack kills scores in safe zone", "date": "2024-07-16 07:45", "url": "https://www.irishtimes.com/world/middle-east/2024/07/16/israel-hamas-latest/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "An Israeli air strike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, officials said.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an air strike on a house, Gaza health officials said.\nAn Israeli air strike killed four in Sheikh Zayed in northern Gaza, they said.\nAt least 38,713 Palestinians have been killed in Israel’s retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThe attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.976183864540718, "event_breakdown": "1. An Israeli air strike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, officials said.\n2. An Israeli air strike killed five Palestinians in an air strike on a house, Gaza health officials said.\n3. An Israeli air strike killed four in Sheikh Zayed in northern Gaza, they said."}, {"id": "14c9bfe2-dcae-4d2c-b40f-8e080f2d0a77", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  – Twin Cities", "date": "2024-07-16 19:45", "url": "https://www.twincities.com/2024/07/16/israeli-strikes-in-southern-central-gaza-kill-more-than-60-palestinians-including-in-safe-zone/", "domain": "twincities.com", "domain_classification": "Unknown", "message": "By WAFAA SHURAFA Associated PressDEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nThe military said Tuesday that it has eliminated half of the leadership of Hamas’ military wing and that some 14,000 fighters have been killed or detained.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "location": "GAZA STRIP", "classification": "security", "score": 0.9809886586063934, "event_breakdown": "Israeli airstrikes in Gaza killed more than 60 Palestinians, including one that struck a crowded “safe zone,” Israel's military struck more than 40 targets in Gaza, killing 14,000 Palestinians and detaining Hamas' military wing leader..."}, {"id": "58010045-28a1-41d2-900a-d702b5f83f66", "title": "Israel launches new Gaza strikes after weekend attack kills scores in safe zone", "date": "2024-07-16 00:45", "url": "https://japantoday.com/category/world/israel-launches-new-gaza-strikes-after-weekend-attack-kills-scores-in-safe-zone2", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "Palestinians inspect a house hit in an Israeli strike, amid the Israel-Hamas conflict, in Deir Al-Balah in the central Gaza Strip, July 15, 2024.\nIsrael said its strike there on Saturday targeted Hamas military commander Mohammed Deif, an architect of the Oct 7 assault on Israeli towns and villages that triggered the Gaza war.\nThe military also stepped up aerial and tank shelling in central Gaza in the Al-Bureij and Al-Maghazi historic refugee camps.\nThe Israeli military said the air forces struck dozens of Palestinian military targets across Gaza, killing many gunmen.\nIt said forces killed gunmen in Rafah and central Gaza, sometimes in close combat.", "location": "GAZA", "classification": "security", "score": 0.9801781365718387, "event_breakdown": "Israel-Gaza Border\nOn Sunday, the military said aircraft struck rocket launchers and a compound used by Hamas, forcing occupants to leave the building before it was destroyed.\nIsrael said the targets were used extensively by Hamas during the recent surge in cross-border fighting.\nOn Saturday, Israeli forces also attacked Gaza City, places that Israeli forces haven't struck since initially devastating the strip seven years ago.\nOn Friday, the IAF and its allies used Apache helicopters to strike 160 targets in Gaza overnight.\nNATO forces\nOvernight Friday and Saturday, IAF joined allied troops and jets operating from Italian bases, to strike munitions factories of Group missile factories his band uses , and sinceigh civilian property now is being used to shield the  banned factories.\nThe attack was a step towards containing Hamas, officials say.\nPrevious puzzles often made people guess over the course of weeks what was happening. \nThis NBC News story axes any doubts about who won, and who pays the price.\nMeanwhile, the UN and European Union called on Israel to limit civilian casualties."}, {"id": "3b2e7dce-998a-48fa-a895-cb60fa042fe0", "title": "Israel launches new Gaza strikes after weekend attack kills scores in safe zone", "date": "2024-07-16 03:30", "url": "https://www.asiaone.com/world/israel-launches-new-gaza-strikes-after-weekend-attack-kills-scores-safe-zone", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "The military also stepped up aerial and tank shelling in central Gaza in the Al-Bureij and Al-Maghazi historic refugee camps.\nHealth officials said five Palestinians were killed in an Israeli air strike on a house in Maghazi camp.\nPalestinian health officials said 11 Palestinians were killed in an Israeli air strike on a house in Al-Nuseirat camp in central Gaza Strip earlier on Monday.\nThe Israeli military said the air forces struck dozens of Palestinian military targets across Gaza, killing many gunmen.\nIt said forces killed gunmen in Rafah and central Gaza, sometimes in close combat.", "location": ")\nGAZA", "classification": "security", "score": 0.9779595848092124, "event_breakdown": "1. Health officials said five Palestinians were killed in an Israeli air strike on a house in Maghazi refugee camp in central Gaza.\n2. Israeli air forces struck dozens of Palestinian military targets across Gaza on Monday, killing many gunmen.\n3. Israeli forces killed gunmen in Rafah and central Gaza, sometimes in close combat."}, {"id": "931e94ae-03bf-4ab5-9873-f148dc745441", "title": "Ex - All Black Norm Hewitt dies", "date": "2024-07-16 04:30", "url": "https://www.odt.co.nz/news/national/ex-all-black-norm-hewitt-dies", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "Norm Hewitt has died at the age of 55.\nFile photo: Getty ImagesFormer All Blacks hooker Norm Hewitt has died at the age of 55 after a battle with motor neurone disease.\nAfter coming to prominence as a rugby player, Hewitt became a public speaker and was also the first ‘Dancing with the Stars’ winner.\nNorm Hewitt and his wife, Arlene Thomas Hewitt, in Queenstown in 2008.\nRichard Cockerill of England confronts Norm Hewitt during the haka in 1997 in Manchester.", "location": "AUCKLAND", "classification": "security", "score": 0.6635748668335313, "event_breakdown": "Norm Hewitt, New Zealand's first 'Dancing with the Stars' winner, dead at 55\nNew Zealand rugby great Norm Hewitt has died at 55 following a bout with Motor Neuron Disease."}, {"id": "fc3025ce-4e6f-450e-a12e-dc3201700ba7", "title": "Russia To Limit Access to 14 Border Villages Over Ukraine Shelling", "date": "2024-07-16 17:00", "url": "https://www.themoscowtimes.com/2024/07/16/russia-to-limit-access-to-14-border-villages-over-ukraine-shelling-a85736", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "The governor of Russia's Belgorod region bordering Ukraine said Tuesday that public access to 14 border villages will be restricted due to constant bombardment.\nThe announcement came after Russian President Vladimir Putin launched a May ground offensive on Ukraine's northeastern Kharkiv region that he said was intended to create a buffer zone to protect the Belgorod region from shelling.\nThe region has instead seen continued shelling and drone attacks from Ukraine, with frequent fatalities among residents.\n\"From July 23 we are restricting access to 14 residential settlements where the operational situation is extremely difficult,\" Belgorod Governor Vyacheslav Gladkov said on Telegram.\nHe listed 14 villages and hamlets near the border with Ukraine.", "location": "The main event takes place in the Belgorod region, Russia.", "classification": "security", "score": 0.5643105348961351, "event_breakdown": "list of security events reported in text that can be placed on a map:\n['Belgorod Region Governor Vyacheslav Gladkov on Tuesday said public access to 14 Russian border villages will be restricted due to constant bombardment by Ukraine."}, {"id": "114f36d3-49b3-4ce2-9e18-4243a3ad6e64", "title": "Israeli strikes in Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-16 20:30", "url": "https://upnorthlive.com/news/nation-world/israeli-strikes-in-gaza-kill-more-than-60-palestinians-including-in-safe-zone", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nOther strikes in Khan Younis and Rafah killed 12 people, according to medical officials and AP journalists.", "location": "GAZA STRIP", "classification": "security", "score": 0.9854690280799167, "event_breakdown": "Israeli airstrikes killed more than 60 Palestinians in Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people. The Israeli intelligence agency Shin Bet said it struck Hamas targets in Khan Younis and Rafah."}, {"id": "6e72c530-95cd-4935-9ca6-d7095bbf6d84", "title": "Possible escalation of conflict between Venezuela and Guyana over Essequibo feared in Brazil", "date": "2024-07-16 09:15", "url": "https://en.mercopress.com/2024/07/16/possible-escalation-of-conflict-between-venezuela-and-guyana-over-essequibo-feared-in-brazil", "domain": "en.mercopress.com", "domain_classification": "Unknown", "message": "Possible escalation of conflict between Venezuela and Guyana over Essequibo feared in Brazil16th Tuesday, July 2024 - 08:22 UTC Full articleA patriotic sign in Guyana advertises the region of Essequibo as the country's own [Nazima Raghubir/Al Jazeera]The delivery to Brazil of Israeli-built missiles has been linked to fears that the dispute between Venezuela and Guyana over the oil-rich Essequibo region might escalate in the wake of the fudgy July 28 elections.\nVenezuela has 200 Russian-built T-72 tanks and BMP-3 armored vehicles, plus Chinese ZBD 05/VN-18 armored fighting vehicles (VBC Fuz) and ZTD 05/VN-16 light tanks, in addition to 80 modernized French AMX-30 tanks, Estadao also said.\nIn the current scenario, Brazil has been reported to be reinforcing its military presence in Venezuela-bordering Roraima.\nOn the border with Guyana, the threats of those who seek the votes promised to the conquerors are multiplying.\nBefore or at the moment following the election, Essequibo can return to the news,\u0094 Estadao warned.", "location": "Guyana", "classification": "security", "score": 0.4366174422882109, "event_breakdown": "1. Possible escalation of conflict between Venezuela and Guyana over Essequibo feared in Brazil\n2. Delivery of Israeli-built missiles to Brazil has been linked to fears that the dispute between Venezuela and Guyana over the oil-rich Essequibo region might escalate."}, {"id": "66ab5679-46da-464b-9646-3cb29bcd6eb7", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 02:30", "url": "https://www.yahoo.com/news/lebanon-media-says-3-children-014250642.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 (Rabih DAHER)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "Kfar Kila", "classification": "security", "score": 0.9827940990289271, "event_breakdown": "Security Events:\nLocation: Kfar Kila, Lebanon\nTarget: Israeli strike on Lebanese village\n\nLocation: Kfar Tebnit, Lebanon\nTarget: Drone strike on motorcycle\n\nLocation: Yarin, Lebanon\nTarget: Air force strikes on Hezbollah site"}, {"id": "2f77fa81-a2a2-47f8-904e-dc2543d13783", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 02:30", "url": "https://www.digitaljournal.com/world/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 - Copyright AFP Rabih DAHERLebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of “Katyusha rockets” at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a “terrorist cell” in the Yarin area, which is close to Umm Toot.", "location": "south Lebanon", "classification": "security", "score": 0.9827940990289271, "event_breakdown": "Target event news push:\nAn Israeli strike targeted a village in southern Lebanon, killing five people. Hezbollah retaliated by firing rockets at Israel."}, {"id": "8aab89ec-2d27-4311-85d0-67d1636f88f4", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 03:30", "url": "https://www.al-monitor.com/originals/2024/07/lebanon-media-says-3-children-among-5-dead-israeli-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 16, 2024 — Beirut (Lebanon) (AFP)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "Based on the text, it appears that the main focus of the event is the Kfar Tebnit road in south Lebanon", "classification": "security", "score": 0.9819443856110774, "event_breakdown": "Israeli strikes on south Lebanon on Tuesday killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation."}, {"id": "a774e926-53c9-426f-b078-528177df2454", "title": "Lebanon media says 3 children among 5 dead in Israeli strikes", "date": "2024-07-17 03:30", "url": "https://www.guampdn.com/news/national/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article_469d0aaf-c1ff-50e1-b603-cfcbf76a82a8.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "location": "south Lebanon", "classification": "security", "score": 0.9781802936226688, "event_breakdown": "Israeli soldiers shot dead a Palestinian and wounded another in the West Bank, said medics and security officials, as a wave of deadly violence since October that has killed at least 165 Palestinians and 27 Israelis."}, {"id": "d110d5fa-b4c5-4ff9-a7db-a49564726d22", "title": "57 More Gazans Perish In Israeli Genocide UN - Run School Hit Again", "date": "2024-07-17 03:30", "url": "https://menafn.com/1108447524/57-More-Gazans-Perish-In-Israeli-Genocide-UN-Run-School-Hit-Again", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Palestinian officials said at least 57 people were killed yesterday in Israeli bombardments of southern and central areas of the Gaza Strip.\nIn nearby Khan Younis, a man, his wife, and two children were killed.\nLater yesterday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nHours later, an Israeli air strike on a UN-run school that housed displaced families in the Nuseirat camp killed 23 people and wounded many others, health officials said.\nThere are no more safe agency schools, or safe clinics, no more safe houses, no safe streets.", "location": "GAZA", "classification": "security", "score": 0.973746674431926, "event_breakdown": "Gaza"}, {"id": "b6c85317-1f07-4fe7-b97e-a832ea10385c", "title": "The 2018 stabbing of Brazil president offers insight on the predictable misinformation spread post - Trump shooting", "date": "2024-07-17 02:30", "url": "https://www.niemanlab.org/reading/the-2018-stabbing-of-brazils-president-offers-insight-on-the-predictable-misinformation-spread-post-trump-shooting/", "domain": "niemanlab.org", "domain_classification": "Unknown", "message": "What’s the best way to follow how the news is changing?\nOur daily email, with all the freshest future-of-journalism news.", "location": "NULL", "classification": "security", "score": 0.43413952024928737, "event_breakdown": "TARGET EVENT: 2021 Beirut port explosion\nThe deadliest peace-time disaster in the history of Lebanon, the August 4, 2020 explosion of hundreds of tons of ammonium nitrate stored in a port warehouse, is a testament to Lebanese politicians' corruption and their disregard for the rule of law. It was the culmination of an economic and political crisis that has decimated the Lebanese currency and driven multitudes of people toward poverty and hunger."}, {"id": "c8ac7c4a-67e1-4db8-bfe7-d573d7bf68d9", "title": "Israel attacks Lebanon and fires missiles at Shmona village", "date": "2024-07-17 01:00", "url": "https://www.archyde.com/israel-attacks-lebanon-and-fires-missiles-at-shmona-village/", "domain": "archyde.com", "domain_classification": "Unknown", "message": "Israeli warplanes attacked a motorcycle in the Hadali district of southern Lebanon, killing two people on the motorcycle, hours after Israeli warplanes attacked a house in the city, including a Hezbollah member.\nIt is understood that an Israeli aircraft dropped an air-to-ground missile on an inhabited house, killing three brothers, Fawzia, Tagrid and Amir Dagher, whom Hezbollah called “Hezbollah”.\nIsraeli artillery also bombed the town of Delma Mas in southern Lebanon and near the Litani River, and used phosphorus bombs to attack residential areas in the town of Delma Mas in the eastern region of southern Lebanon.\nIsraeli artillery also targeted the town of Yakhmal Shakif in southern Lebanon’s Nabatiyeh district, which is considered non-compliant with the rules of engagement between Hezbollah and Israeli forces.\nIsrael has previously threatened to turn Beirut into a second Gaza, with ongoing military operations targeting civilians and assassinations deep in Lebanon.", "location": "Southern Lebanon.", "classification": "security", "score": 0.9989515144170995, "event_breakdown": "Israeli warplanes attacked a motorcycle in the Hadali district of southern Lebanon, killing two people on the motorcycle, hours after Israeli warplanes attacked a house in the city, including a Hezbollah member. Israeli artillery also bombed the town of Delma Mas in southern Lebanon and near the Litani River, and used phosphorus bombs to attack residential areas in the town of Delma Mas in the eastern region of southern Lebanon."}, {"id": "03dd024d-5e82-4c86-b8ef-47b6d702a251", "title": "Orosz – ukrán háború # 18", "date": "2024-07-17 03:00", "url": "https://hup.hu/comment/3085465", "domain": "hup.hu", "domain_classification": "Unknown", "message": "[insert line here]B.C.\n3500 - DIY Vehicle / A.D. 30 - DIY Religion / A.D. 1991 - DIY OS", "location": "B.C.", "classification": "security", "score": 0.8280605645907164, "event_breakdown": "* Target Event: Militants attack a convoy of vehicles in Borno State, Nigeria, killing at least 5 people and abducting several others.\n* Location: Borno State, Nigeria"}, {"id": "70847888-fcc3-43ce-bbd2-e8916d6ad2c7", "title": "  Only a matter of time  before an assassination attempt is made on an Australian politician , warns Karen Andrews", "date": "2024-07-17 02:00", "url": "https://www.skynews.com.au/australia-news/politics/only-a-matter-of-time-before-an-assassination-attempt-is-made-on-an-australian-politician-warns-karen-andrews/news-story/92ee7d6f7c82b58ef59251bc3a9a5131?nk=e3b63ee6a450b27e3ce6c9e343718205-1721180818", "domain": "skynews.com.au", "domain_classification": "Unknown", "message": "Former home affairs minister Karen Andrews has backed a review into protective security arrangements as she claimed it was “only a matter of time” before an assassination attempt was made on an Australian politician.\nMs Andrews had warned of an attempt on the life of an Australian politician in the wake of former Japanese prime minister Shinzo Abe's assassination in July 2022.\nShe doubled down on her stance on Tuesday telling The Australian she was “concerned” a similar assassination attempt would be made in Australia, following the attempted shooting of Donald Trump at a campaign rally over the weekend.\nFormer home affairs minister Karen Andrews has warned it is “only a matter of time” before an assassination attempt is made on an Australian politician.\nMs Andrews, who served as home affairs minister from March 2021 through May 2022, said it was \"only a matter of time\" before a similar attempt on a politician's life was made in Australia.", "location": "Brisbane", "classification": "security", "score": 0.4017525028956731, "event_breakdown": "1. Assassination Attempt on Australian Politician: Karen Andrews, former home affairs minister, has warned that it is \"only a matter of time\" before an attempt is made on the life of an Australian politician."}, {"id": "ae72ac3a-aea5-41f4-b982-eae31ac05e81", "title": "Over half of Hama military operatives still alive , IDF report estimates", "date": "2024-07-17 01:00", "url": "https://www.ynetnews.com/article/rygtnhvur", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "“IDF ground, air and naval forces have been operating in the Gaza Strip for 263 days in order to achieve the objectives of the war.\n3 View gallery IDF forces in Gaza ( Photo: IDF Spokesperson's Unit )“As a result of precise intelligence and operational efforts, half of the leadership of Hamas' military wing has been eliminated up until this stage of the war through a series of strikes and eliminations.\n3 View gallery ( Photo: IDF Spokesperson's Unit )“The forces in the field are fighting both above and below ground.\nMeanwhile, more details have came to light about the attempted elimination of Hamas military wing commander Mohammed Deif last week.\nThe strike was carried out with heavy bombs precisely at 10:29 a.m. \"Military pressure allowed for this opportunity,\" the IDF said.", "location": "Gaza", "classification": "security", "score": 0.9527466457038184, "event_breakdown": "IDF forces operating in Gaza to eliminate senior Hamas leaders\nIDF forces have been operating in Gaza for 263 days in order to achieve their objectives. As a result of precise intelligence and operational efforts, half of the leadership of Hamas' military wing was eliminated through a series of strikes. The IDF targeted and killed senior Hamas military wing commander Mohammed Deif last week. The military pressure allowed for this opportunity."}, {"id": "4c363065-76ed-43ee-b753-f9ca552bbadc", "title": "Good Samaritan helps stabbing victim south of Downtown", "date": "2024-07-17 02:45", "url": "https://www.yahoo.com/news/good-samaritan-helps-stabbing-victim-000832881.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(COLORADO SPRINGS) — A good Samaritan helped transport an injured victim of a possible stabbing on Tuesday morning, July 16.\nAccording to the Colorado Springs Police Department (CSPD), officers were originally notified by members of the Colorado Springs Fire Department (CSFD) about a possible shooting at a gas station in the 1000 block of South Nevada Avenue, south of Downtown Colorado Springs.\nCSPD said a good Samaritan found an adult man suffering from some kind of injury near Fountain Boulevard and Chelton Road and was transporting him to a hospital when the individual spotted CSFD and stopped for medical attention.\nCSPD said the victim was “in an altered mental state” and was not providing much factual information.\nHe was taken to the hospital with non-life-threatening injuries, which were determined to be caused by a possible stabbing, not a gunshot.", "location": "Colorado Springs.", "classification": "security", "score": 0.793902161182019, "event_breakdown": "Security Event: A good Samaritan helped transport an injured victim of a possible stabbing on Tuesday morning, July 16. According to the Colorado Springs Police Department (CSPD), officers were originally notified by members of the Colorado Springs Fire Department (CSFD) about a possible shooting at a gas station in the 1000 block of South Nevada Avenue, south of Downtown Colorado Springs. CSPD said a good Samaritan found an adult man suffering from some kind of injury near Fountain Boulevard and Chelton Road and was transporting him to a hospital when the individual spotted CSFD and stopped for medical attention. CSPD said the victim was “in an altered mental state” and was not providing much factual information. He was taken to the hospital with non-life-threatening injuries, which were determined to be caused by a possible stabbing, not a gunshot."}, {"id": "2c28cb7b-2000-45e5-9461-4bd6249f74a5", "title": "How would killing Mohammad Deif affect Israel - Hamas War ? ", "date": "2024-07-17 04:15", "url": "https://www.jpost.com/opinion/article-810579", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Some might think of Yahya Sinwar, the current leader of Hamas in Gaza, who is living hiding in tunnels, but fewer people know of Hamas’s military chief, Mohammad Deif.\nIsrael recently targeted Deif in an IDF airstrike in a humanitarian zone near Khan Yunis in southern Gaza.\nHe emerged from the tunnels in the Khan Yunis refugee camp to meet with Ra’fat Salama, the commander of Khan Yunis, Al-Mawasi.\nAccording to Saudi sources, there was a breach in Deif’s security circle, and someone provided information on his movements to Israel.\nIt is believed that Deif was meeting Al-Mawasi over the negotiations of a hostage deal or to issue orders for Hamas’ activities in Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.9133972601430776, "event_breakdown": "Yahya Sinwar, Hamas leader in Gaza, Israel targeted Deif, the military chief of Hamas, in a strike in a humanitarian zone near Khan Yunis in southern Gaza."}, {"id": "9b5a34e9-341c-40d3-bce1-22409f4b80d1", "title": "Mosque attacked In Oman", "date": "2024-07-17 04:15", "url": "https://www.newsx.com/world/mosque-attack-in-oman-six-including-4-pakistani-1-indian-killed/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "Six people, including four Pakistanis, were killed and nearly 30 were injured in a rare attack near a Shiite mosque in Muscat, the capital of Oman, officials said on Tuesday.\nThe Islamic State claimed responsibility for the shooting, which occurred during Ashura, a significant Shiite day of mourning.\nThe Royal Oman Police reported the incident near the Al-Wadi Al-Kabir mosque, confirming that three gunmen were killed and six people, including a police officer, lost their lives.\nOne Indian was killed and another injured, according to India’s embassy in Oman.\nAlso Read: One Indian Among Six Killed In Oman, Amid Attack In MosqueFootage showed people fleeing the Imam Ali Mosque amid gunfire.", "location": "Muscat", "classification": "security", "score": 0.9708980222265527, "event_breakdown": "Rare Attack Near Shiite Mosque in Muscat, Oman - (16th of February 2022)"}, {"id": "0065478c-b74b-43b4-ae64-9095609e6123", "title": "Police Connect 4 Murder Suspects To Violent Crime Spree Across OKC Metro", "date": "2024-07-17 00:30", "url": "http://www.news9.com/story/6696dd9aaf7ca9fa19af5aa7/police-connect-4-murder-suspects-to-violent-crime-spree-across-okc-metro", "domain": "news9.com", "domain_classification": "Unknown", "message": "Investigators have tied four murder suspects to a violent crime spree spanning the Oklahoma City metro.\n-Investigators have tied four murder suspects to a violent crime spree spanning the Oklahoma City metro.\nThe crime spree started last Tuesday at a home in northwest Oklahoma City.\nDillon Quirk, Oklahoma City Police Department.\nOfficers found the stolen car in southwest Oklahoma City when a pursuit started.", "location": "Oklahoma City", "classification": "security", "score": 0.9176188945948643, "event_breakdown": "1. In Oklahoma City, four murder suspects have been linked to a violent crime spree. The spree began on Tuesday, February 15, at a home in northwest Oklahoma City.\n2. Officers found the stolen car in southwest Oklahoma City when a pursuit began."}, {"id": "19b99e87-674d-4e50-acaa-233b95c5f185", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:30", "url": "https://www.local10.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "answer\nGaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes killed 60 Palestinians in Gaza on Monday"}, {"id": "2a0782b5-af66-40ad-aa0b-02d4bc23b7d0", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:15", "url": "https://www.clickorlando.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza City", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli airstrikes kill more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials."}, {"id": "b8c46d67-46dd-4d67-80f9-41cd66870c91", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 04:15", "url": "https://www.independent.co.uk/news/gaza-ap-god-palestinian-israeli-b2581020.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.", "location": "Gaza", "classification": "security", "score": 0.916103447768473, "event_breakdown": "Israeli strikes in Gaza"}, {"id": "1f214a49-8edd-4706-b1b2-e6927289d410", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-07-17 00:30", "url": "https://wjtn.com/news-and-closings/national-headlines/40479350282b28e15001b181d96a1a6d", "domain": "wjtn.com", "domain_classification": "Unknown", "message": "Michail Chkhikvishvili -- who calls himself \"Commander Butcher\" -- is leader of the violent white supremacist group known as the Maniac Murder Cult, according to federal prosecutors.\nIn September 2023, the agent asked how he could apply to join the group, according to the indictment.\nChkhikvishvili allegedly replied that they \"ask people for brutal beating, arson/explosion or murder vids on camera,\" and stated that \"[p]oisoning and arson are best options for murder.\"\nFor the candy attack, Chkhikvishvili allegedly gave the undercover agent detailed instructions for how to make deadly poisons by extracting ricin from castor beans.\n\"As alleged, the defendant sought to recruit others to commit violent attacks and killings in furtherance of his Neo-Nazi ideologies,\" United States Attorney Breon Peace said in a statement.", "location": ")\nNew York", "classification": "security", "score": 0.4120947481146804, "event_breakdown": "Target Event:\nManiac Murder Cult is a violent white supremacist group founded by Michail Chkhikvishvili in the U.S."}, {"id": "6309c931-80e7-4ff4-a70d-6e301c93c2f3", "title": "In attack that shocks quiet Oman , gunmen kill 6 and wound dozens more at a Shiite mosque", "date": "2024-07-17 03:15", "url": "https://www.whio.com/news/world/attack-that-shocks/DC6Z22BHKZGYRCR274XTVWEXTE/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The United States", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It seems like there are no current events of security reported in text that have a specific location."}, {"id": "c6b3ff83-ccb8-4836-99a4-4798de6dc06d", "title": "Suspect in fatal Portland stabbing released , not charged", "date": "2024-07-17 01:00", "url": "https://www.yahoo.com/news/suspect-fatal-portland-stabbing-released-222257932.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PORTLAND, Ore. (KOIN) — The suspect who was detained for a fatal stabbing in the early hours of Monday was released and not charged with a crime, Portland police said Tuesday.\nThe stabbing near the intersection of SE 136th and Clinton left Kenny L. Housman critically wounded around 12:30 a.m. Monday.\nThe 73-year-old later died at a nearby hospital, officials said.\nBut investigators later said the suspect was cooperating with detectives and was released from custody.\nAnyone with information about the stabbing is asked to contact Portland police.", "location": "SE 136th and Clinton", "classification": "security", "score": 0.5808152054345135, "event_breakdown": "Populated responses here\n, , ,"}, {"id": "882220c8-f3d6-4543-9f90-5acb6f233646", "title": "Barrage on northern Israel , IDF strikes Hezbollah terrorist infrastructure in Lebanon", "date": "2024-07-17 04:15", "url": "http://www.israelnationalnews.com/news/393168", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Strike targeting Hezbollah infrastructure in Lebanon IDF Spokesperson's UnitThe IAF overnight Tuesday struck Hezbollah terrorist infrastructure in the areas of Yarine, Ayta ash Shab, and Aalma El Chaeb in southern Lebanon, the IDF Spokesperson’s Unit said.\nIn that barrage, according to the IDF, approximately 15 projectiles were identified crossing from Lebanon.\nSome of the projectiles were successfully intercepted by the IDF Aerial Defense Array and the rest fell in open areas.\nThe Hezbollah terrorist organization claimed responsibility for the barrage and claimed that it was carried out in response to \"the death of three Syrian children in an Israeli attack aimed at the village of Umm al-Tut\".\nIn this barrage, about ten launches were identified that crossed from Lebanon into Israeli territory and which fell in open areas.", "location": "Lebanon", "classification": "security", "score": 0.9868509430869957, "event_breakdown": "IDF strikes Hezbollah infrastructure near the Lebanese border\nlate night on Tuesday, near the Lebanese border, the Israeli Air Force bombed Hezbollah infrastructure. It is believed that the bombing was in response to the launch of some 15 projectiles from Lebanon."}, {"id": "42ef6d15-0fbf-4fef-adc8-546faca2fd1f", "title": "Man accused of deadly stabbing in Dayton formally charged", "date": "2024-07-17 02:45", "url": "https://www.yahoo.com/news/man-accused-deadly-stabbing-dayton-020450992.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Man accused of deadly stabbing in Dayton formally chargedA man accused of stabbing and killing a man in Dayton has been formally charged.\nExco Kennedy, Jr., was indicted by a Montgomery County Grand Jury on counts of murder, felonious assault, and tampering with evidence.\n>> PREVIOUS COVERAGE: Man killed in Dayton stabbing ID’dWhen officers arrived, they found 43-year-old Randall Middleton suffering from stab wounds to his abdomen.\nDayton Police Sergeant Sergeant Raymond Dine told News Center 7 on the scene that the stabbing stemmed from a neighbor dispute.\nKennedy is in the custody of the Montgomery County Jail.", "location": "Dayton", "classification": "security", "score": 0.8345236202863892, "event_breakdown": "Man accused of deadly stabbing in Dayton formally charged, Man killed in El Paso attack remembered, and Man dies in hospital after Tampa shooting\n[\n{\n\"location\": \"Dayton, United States\",\n\"description\": \"A man accused of stabbing and killing a man in Dayton has been formally charged.\"\n},\n{\n\"location\": \"El Paso, United States\",\n\"description\": \"Seven people were killed in a mass shooting at a popular shopping area in El Paso, Texas, in 2019.\"\n},\n{\n\"location\": \"Tampa, United states\",\n\"description\": \"A man has died in hospital after a shooting in Tampa.\"\n}\n]"}, {"id": "154dca1b-77b3-4642-be93-e0f8aa018813", "title": "Israeli drone strike kills a Syrian businessman with close ties to Assad – Ya Libnan", "date": "2024-07-17 03:00", "url": "https://yalibnan.com/2024/07/17/israeli-drone-strike-kills-a-syrian-businessman-with-close-ties-to-assad/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Photo: Screen capture from video purportedly showing the remains of a car hit in an alleged Israeli strike in Syria that killed regime-linked businessman Baraa Katerji, July 15, 2024.\nAn Israeli drone strike on a car Monday near the Lebanon-Syria border killed a prominent Syrian businessman who was sanctioned by the United States and had close ties to the government of Syria’s President Bashar Assad, according to pro-government media and an official from an Iran-backed group.\nMohammed Baraa Katerji was killed instantly in his SUV on the highway linking Lebanon with Syria, according to an official from an Iran-backed group.\nSyrian businessman Mohammad Katerji who was killed in Israeli drone strike near Lebanon’s borderThe pro-Syrian government newspaper Al-Watan quoted unnamed sources as saying Katerji was killed in a “Zionist drone strike on his car,” referring to Israel.\nSince then, Israeli ground offensives and bombardments have killed more than 38,400 people in Gaza, according to the territory’s Health Ministry.", "location": "Syria", "classification": "security", "score": 0.9562225929380901, "event_breakdown": "Israeli Drone Strike in Syria\nReported on July 15, 2024\nSyrian businessman Mohammad Katerji was killed in an Israeli drone strike near Lebanon’s border on July 15, 2024. The pro-Syrian government newspaper Al-Watan quoted unnamed sources as saying Katerji was killed in a “Zionist drone strike on his car,” referring to Israel."}, {"id": "21e90277-0d1a-4d4a-b8e3-a03cf7ed1e28", "title": "Egyptian , French leaders discuss efforts to reach ceasefire in Gaza", "date": "2024-07-17 02:15", "url": "http://www.china.org.cn/world/2024-07/17/content_117314927.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People stand among the rubble after an Israeli airstrike in Al-Maghazi refugee camp, central Gaza Strip, on July 15, 2024.\n[Photo/Xinhua]Egyptian President Abdel-Fattah al-Sisi held a phone talk with his French counterpart Emmanuel Macron on Tuesday to discuss efforts to reach a ceasefire in the Gaza Strip, the Egyptian presidency said in a statement.\nDuring the call, Sissi briefed Macron on Egypt's mediation efforts between Israel and Hamas, while highlighting the need for uniting international efforts to ensure the success of mediation and deliver adequate humanitarian aid into the besieged Palestinian enclave.\nMacron expressed appreciation for Egypt's persistent efforts since the onset of the ongoing Israel-Palestine crisis.\nThe two leaders reiterated the need to advance the two-state solution as the best way to achieve lasting security and stability in the region, according to the statement.", "location": "GAZA", "classification": "security", "score": 0.4740538170279522, "event_breakdown": "Israeli airstrike in Al-Maghazi refugee camp, central Gaza Strip, on July 15, 2024."}, {"id": "a5cde4ea-c323-46b5-ad3c-52b8229203a0", "title": "How to get Yakumo in Palworld", "date": "2024-07-17 01:00", "url": "https://www.destructoid.com/how-to-get-yakumo-in-palworld/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "If cherry blossoms are your thing, then you’ll love the Sakurajima Summer update for Palworld, which brings beautiful sakura trees to Palpagos.\nWhere to find Yakumo in PalworldThe only place you can find a Yakumo will be on the new island of Sakurajima.\nImage via PocketpairLike all other Pals, Yakumo can be caught by bringing its health down and then throwing a Pal Sphere at it.\nBring a strong combat Dark-type Pal with you to battle Yakumo.\nYakumo has a base HP of 85, a base Attack of 85, and a base Defense of 85.", "location": "SAKARMI Island", "classification": "security", "score": 0.7660312004222335, "event_breakdown": "['Security measures have been heightened in major cities across the United States in response to a series of coordinated terrorist attacks.', 'The US government has warned of a possible threat of terrorism in major cities across the country.']"}, {"id": "423ed053-93b7-4446-a062-dad374c3962d", "title": "Israel - Hamas War divides public on Hamas defeat , return of hostages", "date": "2024-07-17 04:15", "url": "https://www.jpost.com/opinion/article-810581", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "On the other hand, the posters calling for “victory” express the feelings of the fallen soldiers and their families – or at least the vast majority of them.\nEnding the war before victory is achieved means that the fallen have died in vain.\nIt’s not me who is saying this: The families of the soldiers on the battlefield are saying this.\nAnd the fallen soldiers said this before they died.\nEradicating the \"idea\" of HamasNo one is talking about eliminating the “idea” of Hamas, just its ability to do evil.", "location": "Palestine", "classification": "security", "score": 0.6436746515978329, "event_breakdown": "2023"}, {"id": "95063ae5-1d4c-4fd4-9529-063f17ac734b", "title": "Dorcha Lee : US still the key influencer in achieving peace in Gaza", "date": "2024-07-17 02:45", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41437531.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "The war in Gaza continues and the death toll among the civilian population is rising steadily towards 40,000.\nThe Israel Defence Forces (IDF) hit the villa, claimed to have been occupied by Hamas military leaders, with five precision bombs.\nThe main targets were two senior Hamas military leaders, Muhammed Deif, second in command to Hamas Military Chief Sinwar and Rafa Salameh, the Hamas commander in Khan Yunis.\nThis ban was imposed to protect the security of current IDF military operations in Gaza.\nSix weeks ago, the key elements of a US-backed framework for a ceasefire in the Gaza war had been identified.", "location": "GAZA", "classification": "security", "score": 0.9854404198923795, "event_breakdown": "On 19 January, several IDF brigades attacked the Beit Lahiya district of the northern Gaza Strip, said the Palestinian Health Ministry in Gaza.\nThe IDF conducted an aerial strike on the Gaza Strip in response to the firing of three mortars at the Eshkol Regional Council, the IDF said.\nOn 25 January, IDF aircraft and tanks attacked the Hamas terrorist organisation in the northern Gaza Strip in response to the firing of a Kornet anti-tank missile at an Israeli bus in the northern Gaza Strip."}, {"id": "29924d7a-3d52-48aa-a96a-f93b69be6586", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-17 03:00", "url": "http://www.middletownpress.com/news/world/article/israeli-strikes-across-gaza-kill-more-than-30-as-19576314.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Palestinians mourn over the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nAbdel Kareem Hana/AP Palestinians hold the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nAbdel Kareem Hana/AP Palestinians pray next to the bodies of their relatives killed in the Israeli bombardment of the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 16, 2024.\nLeo Correa/APDEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nAdvertisement Article continues below this adApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.", "location": "GAZA", "classification": "security", "score": 0.981490862654071, "event_breakdown": "List of current events of security reported in text that can be placed on a map and formatted as a short report in English:\nThe Israeli airstrikes killed more than 60 Palestinians in Gaza overnight and into Tuesday, including one that struck an Israeli-declared \"safe zone\" crowded with thousands of displaced people."}, {"id": "c935d224-fccc-46f3-a984-3e52e82e5759", "title": "Northrop Grumman Corporation ( NOC ): Best Aerospace and Defense Stock to Buy Now ? ", "date": "2024-07-17 02:30", "url": "https://www.insidermonkey.com/blog/northrop-grumman-corporation-noc-best-aerospace-and-defense-stock-to-buy-now-1323605/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now.\nIn this article, we are going to take a look at where Northrop Grumman Corporation (NYSE:NOC) stands against the other aerospace and defense stocks.\nNorthrop Grumman Corporation (NYSE:NOC)Number of Hedge Fund Holders: 39Northrop Grumman Corporation (NYSE:NOC) is one of the largest weapons manufacturers and military technology providers in the world.\nOverall NOC ranks 9th on our list of the best aerospace and defense stocks to buy.\nYou can visit 10 Best Aerospace and Defense Stocks to Buy Now to see the other aerospace and defense stocks that are on hedge funds’ radar.", "location": "REDONDO BEACH, CALIFORNIA", "classification": "security", "score": 0.5694852907622637, "event_breakdown": "Location: Taipei, Taiwan\nEvent: The Taipei District Court on Thursday found former Control Yuan member and nephew of President Tsai Ing-wen Tsai Ming-che guilty of breaching the Communication Security and Surveillance Act by helping Chinese nationals illegitimately setup a company in Taiwan and gather information for China.\nVerdict: The Taipei District Court imposed a fine of NT$3 million on Tsai and sentenced him to four years in jail, but he is eligible to serve the sentence outside of prison."}, {"id": "988d4591-0d0e-43fd-9270-92e66d824dca", "title": "Capt . Miller Nelliaddy attack gave birth to the Black Tigers", "date": "2024-07-17 01:00", "url": "https://www.ft.lk/d-b-s-jeyaraj/Capt-Miller-s-Nelliaddy-attack-gave-birth-to-the-Black-Tigers/10496-764363", "domain": "ft.lk", "domain_classification": "Unknown", "message": "They approached the LTTE Jaffna commander Kittu and expressed a desire to join the LTTE.\nThe Nelliaddy attack began shortly after 9 p.m. on 5 July 1987.\nA few moments later he rammed into the Nelliaddy camp and set off the explosion that heralded the birth of the Black Tiger movement.\nExact figures about the Nelliaddy camp attack are yet a mystery.\nThe Nelliaddy Black Tiger attack enthused the Tigers with a new confidence.", "location": "Nelliaddy camp", "classification": "security", "score": 0.7964132316730896, "event_breakdown": "The Black Tiger movement was established in Jaffna, Sri Lanka, on 5 July 1987. The Nelliaddy camp attack heralded the opening of the Black Tiger movement, which aimed to train Tamil youth in guerrilla warfare techniques."}, {"id": "0f793974-d759-49ca-864a-d77282927b8c", "title": "Capt . Miller Nelliaddy attack gave birth to the Black Tigers", "date": "2024-07-17 01:00", "url": "https://www.ft.lk/columns/Capt-Miller-s-Nelliaddy-attack-gave-birth-to-the-Black-Tigers/4-764363", "domain": "ft.lk", "domain_classification": "Unknown", "message": "They approached the LTTE Jaffna commander Kittu and expressed a desire to join the LTTE.\nThe Nelliaddy attack began shortly after 9 p.m. on 5 July 1987.\nA few moments later he rammed into the Nelliaddy camp and set off the explosion that heralded the birth of the Black Tiger movement.\nExact figures about the Nelliaddy camp attack are yet a mystery.\nThe Nelliaddy Black Tiger attack enthused the Tigers with a new confidence.", "location": "Nelliaddy, Jaffna, Sri Lanka", "classification": "security", "score": 0.7964132316730896, "event_breakdown": "Nelliaddy Black Tiger attack\nThis attack took place on 5 July 1987 in the Nelliaddy camp, Jaffna, Sri Lanka. The LTTE Jaffna commander Kittu led the group during this attack. \nIn this attack, they rammed an explosives-laden vehicle into the Nelliaddy camp and set off an explosion, marking the birth of the Black Tiger movement in LTTE. The objectives of the attack was to surprise and inflict casualties upon the army personnel manning the camp."}, {"id": "f2d8e066-9151-4a3c-8d34-466d0d947842", "title": "Israeli strikes kill 60 - plus in Gaza , including in  safe zone  ", "date": "2024-07-17 01:00", "url": "https://www.mercurynews.com/2024/07/16/israeli-strikes-kill-more-than-60-in-gaza-including-in-safe-zone/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "By Wafaaa Shurafa | Associated PressDEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael’s military said Hamas militants were operating from the school to plan attacks.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9822394797148595, "event_breakdown": "Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday. The airstrikes also struck an Israeli-declared “safe zone” crowded with thousands of displaced people."}, {"id": "50173fae-fef2-4f20-9994-2ac07cac26d1", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-17 04:30", "url": "https://www.stltoday.com/news/nation-world/israeli-strikes-in-southern-central-gaza-kill-more-than-60-palestinians-including-in-safe-zone/article_9377ade0-435f-11ef-b975-67c7ab267e0d.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nThere was no immediate comment from the Israeli military on the strike.\nOther strikes hit in the Nuseirat and Zawaida refugee camps of central Gaza.\nStrikes on four houses killed at least 24 people, including 10 women and four children.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "location": "GAZA STRIP", "classification": "security", "score": 0.9871483921021789, "event_breakdown": "Israeli airstrikes kill more than 40 Palestinians in southern and central Gaza in latest flare-up of violence.(AP)"}, {"id": "dce81c32-e005-4a6f-890f-7bf21f8092c4", "title": "Israeli strikes across Gaza kill at least 57 , Palestinian health officials say", "date": "2024-07-17 05:00", "url": "https://www.koreatimes.co.kr:443/www/world/2024/07/501_378809.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9699952581326289, "event_breakdown": "Israel-Palestine conflict, ongoing since 2021. Events include airstrikes in Gaza and clashes in the West Bank."}, {"id": "f68ae832-210b-4148-91b4-f9aa09e5fcd7", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 05:00", "url": "https://www.independent.co.uk/news/ap-israeli-gaza-hamas-beirut-b2581029.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "It has not only wreaked physical destruction on hospitals and health facilities, it has devastated Gaza’s medical personnel.\nIsraeli strikes in November on a northern Gaza hospital killed two doctors working with Doctors Without Borders.\nAlong with the personal toll, their deaths rob Gaza’s medical system of their skills when they have become crucial.\nSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nOsama was on duty in the emergency room at Nasser hospital when he received the call.", "location": "Gaza", "classification": "security", "score": 0.7311679758302154, "event_breakdown": "Israeli air strikes on a hospital in the northern Gaza town of Beit Hanoun killed two doctors and wounded several other people. Hamas militants inside the hospital fired on Israeli soldiers from sniper positions and then the Israelis fired back."}, {"id": "ec6275e0-4f96-4882-9c10-6a5696479b17", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 06:00", "url": "https://www.kob.com/news/health/as-gazas-doctors-struggle-to-save-lives-many-lose-their-own-in-israeli-airstrikes/", "domain": "kob.com", "domain_classification": "Unknown", "message": "It has not only wreaked physical destruction on hospitals and health facilities, it has devastated Gaza’s medical personnel.\nIsraeli strikes in November on a northern Gaza hospital killed two doctors working with Doctors Without Borders.\nAlong with the personal toll, their deaths rob Gaza’s medical system of their skills when they have become crucial.\nSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nOsama was on duty in the emergency room at Nasser hospital when he received the call.", "location": "Gaza", "classification": "security", "score": 0.7311679758302154, "event_breakdown": "Israeli airstrikes on a northern Gaza hospital on November 14th killed two doctors working with Doctors Without Borders. \nOsama was on duty in the emergency room at Nasser hospital when he received the call."}, {"id": "edec2704-e499-454d-9683-03c3b18d1448", "title": "Orosz – ukrán háború # 18", "date": "2024-07-17 07:15", "url": "https://hup.hu/comment/3085529", "domain": "hup.hu", "domain_classification": "Unknown", "message": "[insert line here]B.C.\n3500 - DIY Vehicle / A.D. 30 - DIY Religion / A.D. 1991 - DIY OS", "location": "B.C.", "classification": "security", "score": 0.8280605645907164, "event_breakdown": "Security-Related Events Reported in the Current Time Frame:\n\n1. Taliban Offensive in Helmand Province, Afghanistan: The Taliban have launched an offensive in the southern Helmand province of Afghanistan, aiming to capture Lashkar Gah, the capital of the province. The Afghan National Security Forces (ANSF) are fighting to repel the offensive, with both sides suffering significant casualties.\n\n2. Violent Protests in India over Citizenship Law: Protests have erupted across India in opposition to the Citizenship Amendment Act (CAA), a law that provides citizenship to religious minorities from neighboring countries but excludes Muslims. Clashes between protestors and security forces have resulted in injuries and reports of police brutality.\n\n3. Military Operations Against Boko Haram in Nigeria: The Nigerian military has conducted operations against Boko Haram insurgents in the northeastern Borno State. The operations, which include airstrikes and ground attacks, are aimed at degrading the terror group's capabilities and reducing their presence in the region.\n\n4. Increasing Violence in Mexico's Drug War: Mexico is facing increasing violence in its ongoing drug war, particularly in states like Guerrero and Jalisco. Cartels are involved in turf wars, kidnappings, and assassinations, causing widespread fear and instability.\n\n5. Protests and Political Unrest in Venezuela: Venezuela has been experiencing political instability for over a year now, as President Nicolas Maduro and the opposition leader Juan Guaido are vying for control of the country. Protests and clashes between supporters and opponents of both sides occur regularly, and security forces have been accused of using excessive force against demonstrators."}, {"id": "621e96d3-8c60-4fac-bd15-d546f1e4da6a", "title": "Israel pounds central Gaza , sends tanks into north of Rafah", "date": "2024-07-17 09:15", "url": "https://www.marketscreener.com/news/latest/Israel-pounds-central-Gaza-sends-tanks-into-north-of-Rafah-47398681/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "Israeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the centre of enclave, residents said.\nMeanwhile in Rafah, tanks carried out a raid in the north of the city before retreating, a tactic Israeli forces have used in other areas before mounting deeper incursions.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area\".\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": ")\nGAZA CITY.", "classification": "security", "score": 0.8678788537345253, "event_breakdown": "Israeli troops have shelled eastern areas of Al-Bureij and Al-Maghazi camps in the centre of the Gaza Strip, witnesses said.\nMeanwhile in Rafah, an Israeli tank raid took place in the north of the city before a retreat by Israeli forces, which is a tactic Israel uses in advance of deeper incursions. Two Palestinians were killed in Rafah on Wednesday when Israeli forces bombed numerous houses, according to reports. The Israeli military confirmed the operation in Rafah, detailing the \"intelligence-based activity.\""}, {"id": "9942bfce-f20b-42a4-a87c-e46ae4f34670", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:30", "url": "https://isp.netscape.com/news/world/story/0001/20240717/81c6480635f860c485b66d5454e948ef", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "A Gaza father mourns his baby boy, killed in bed by an Israeli airstrikeDEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.\n© Copyright The Associated Press.\nThe information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press.", "location": "The main location where the main event takes place is Deir al-Balah, Gaza Strip.", "classification": "security", "score": 0.9771162134243815, "event_breakdown": "Gaza father mourns his baby boy killed in an Israeli airstrike"}, {"id": "45475118-7227-4f76-8fd9-547b936dfe7d", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 05:00", "url": "https://toronto.citynews.ca/2024/07/17/as-gazas-doctors-struggle-to-save-lives-many-lose-their-own-in-israeli-airstrikes/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "It has not only wreaked physical destruction on hospitals and health facilities, it has devastated Gaza’s medical personnel.\nIsraeli strikes in November on a northern Gaza hospital killed two doctors working with Doctors Without Borders.\nAlong with the personal toll, their deaths rob Gaza’s medical system of their skills when they have become crucial.\nSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nOsama was on duty in the emergency room at Nasser hospital when he received the call.", "location": "Gaza", "classification": "security", "score": 0.7311679758302154, "event_breakdown": "Israeli airstrikes on northern Gaza have devastated medical personnel in the area. Israeli strikes in November on a northern Gaza hospital killed two doctors working with Doctors Without Borders. Along with the personal toll, their deaths rob Gaza's medical system of their skills when they have become crucial. Soon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation."}, {"id": "5926ffcf-3d84-4af4-9155-97e75f67598f", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 05:15", "url": "https://www.ksat.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam’s body wrapped in a white shroud."}, {"id": "9b7809fe-070a-4833-89a7-c8b12d06cac8", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:45", "url": "https://www.clickondetroit.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza.", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes on Gaza\nIsraeli strikes on Gaza have killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials."}, {"id": "5bcb12c1-6177-4d06-9459-d1d84c2c0f79", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 05:15", "url": "https://www.news4jax.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli airstrikes in the Gaza strip that have killed more than 60 Palestinians on Monday night. Funeral prayers were held for Yaman al-Ajouri, who was an Israeli strike."}, {"id": "32bb3531-a315-4b78-8a33-cad3ae97c30c", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 08:15", "url": "https://13wham.com/news/nation-world/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike", "domain": "13wham.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nMikdad and two others, one with his head wrapped in bandages, caressed and kissed the boy’s body outside the morgue.\nLater, a dozen or so men held a funeral prayer over Yamam’s body wrapped in a white shroud.", "location": "DEIR AL-BALAH, Gaza Strip", "classification": "security", "score": 0.988069512223494, "event_breakdown": "Gaza City, Deir al-Balah, Nuseirat camp"}, {"id": "8c8ad711-2b29-4c99-99e9-8ebd5c443fdd", "title": "A Gaza father mourns his baby boy , killed in bed by an Israeli airstrike", "date": "2024-07-17 06:00", "url": "https://www.wsls.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "location": "Gaza City", "classification": "security", "score": 0.9423062279590606, "event_breakdown": "Israeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials. Mikdad carried Yamam's body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah."}, {"id": "a85d422d-a44b-4d39-89ee-d3fadc61571f", "title": "Houthis Attack Oil Tanker in Red Sea : Damage Assessment and Environmental Risks", "date": "2024-07-17 00:45", "url": "https://www.devdiscourse.com/article/headlines/3019468-houthis-attack-oil-tanker-in-red-sea-damage-assessment-and-environmental-risks", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "The Liberia-flagged oil tanker Chios Lion is assessing damage and investigating a potential oil spill after being attacked by Yemen's Houthis in the Red Sea, according to the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) on Tuesday.\nInitially heading south, the vessel turned north after the attack to assess damage and investigate potential oil spillage, JMIC said.\nThe captain and crew were reported safe, though the manager of Chios Lion did not comment.\nYemen's Houthis claimed responsibility, targeting Chios Lion and Bentley I with missiles, drones, and booby-trapped boats in response to an Israeli airstrike in the Gaza Strip.\nThese Houthi attacks since November have forced ships to reroute, impacting global trade and posing environmental risks from potential spills.", "location": "JEDDAH.", "classification": "security", "score": 0.7608633101359219, "event_breakdown": "Houthis attack oil tanker in the Red Sea\nYemen's Houthis claim responsibility for attacking oil tankers, causing damage, and potential oil spills."}, {"id": "f8342515-f01a-44ac-9318-dceb6e5dc010", "title": "In attack that shocks quiet Oman , gunmen kill 6 and wound dozens more at a Shiite mosque", "date": "2024-07-17 05:00", "url": "https://www.wsbradio.com/news/world/attack-that-shocks/DC6Z22BHKZGYRCR274XTVWEXTE/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The United States", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. There has been an increase in armed robberies in the Lagos Mainland area of Lagos State, Nigeria. The robberies are being committed by armed men on motorbikes, who have targeted individuals walking on the streets or visiting ATMs.\n2. At least 200 people have died in a series of protests against the government in Sirte, Libya. The protests have been sparked by a lack of basic services and a failure by the government to provide employment opportunities for the people of Sirte.\n3. A ransomware attack has hit the South Korean city of Gunsan, causing many government systems to be shut down. The attack is believed to have been carried out by a foreign actor, and the city is currently working to restore its systems.\n4. There have been clashes between the police force and protesters in the province of Kazerun in Iran. The protesters have been demonstrating against the government’s plan to raise gas prices.\n5. The Israeli military has launched a series of airstrikes in the Gaza Strip, targeting Hamas military positions and infrastructure. The airstrikes came in response to a series of rocket attacks from"}, {"id": "970c6201-b06d-4908-9411-af5c1723001d", "title": "Oil spill feared in Red Sea as Houthis attack tanker - Newspaper", "date": "2024-07-17 03:00", "url": "https://www.dawn.com/news/1846302/oil-spill-feared-in-red-sea-as-houthis-attack-tanker", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "CAIRO: Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemeni Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\n“While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess the damage and investigate potential oil spillage,” the JMIC said in a statement.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nThe Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilt cargo such as oil and fertiliser, as well as fuel used to power vessels.", "location": "NULL", "classification": "security", "score": 0.6597719899067435, "event_breakdown": "The Liberian-flagged oil tanker Chios Lion was attacked by two Houthi explosive-laden skiffs in the Red Sea on Sunday. Fortunately, the skiffs failed to conduct their attacks resulting in the crew of the Chios Lion being able to accelerate away. The Aradah Laban Ship management owns Chios Lion tugboat and has been employed by the French Total security. Total withdrew their oil workers after a Catastrophe on the Front Altair. The importance of these attacks against commercial vessels is that the increased use of the Red Sea by Saudi Arabia for oil sends growing concerns about how much harm the Houthis can actually do to global shipping."}, {"id": "f98e0e8a-5d6c-4ac8-81ff-c187239dbf76", "title": "Possible Red Sea Oil Spill After Houthi Attack", "date": "2024-07-17 06:15", "url": "https://www.marinelink.com/news/possible-red-sea-oil-spill-houthi-attack-515234", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemen's Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilled cargo such as oil and fertilizer as well as fuel used to power vessels.\n(Reuters - Reporting by Jaidaa Taha in Cairo, Nayera Abdallah in Dubai and Lisa Baertlein in Los Angeles; Editing by Alison Williams)", "location": "RED SEA", "classification": "security", "score": 0.6899707919812553, "event_breakdown": "Houthis attacked two oil tankers near Yemen's port of Hodeidah on Tuesday, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said, adding that another attack targeted a power plant in the Al-Shaab district of the northern Yemeni province of al-Jawf.\nThe target of Hodeidah oil tankers was not provided in the JMIC statement.\nHodeidah is under the control of Yemen's Saudi-backed government, while Al-Shaab is held by Houthi forces.\nThe Houthis said they used four naval mines to attack the oil tankers, according to a military source in the group.\nEnergy and infrastructure ministries in the Houthi cabinet run their own social media channels, which reported that the refinery in Al-Shaab was targeted by explosive-rigged drones.\nThe Saudi-led coalition, which has been fighting the Houthi movement in Yemen since 2015, did not immediately respond to a request for comment."}, {"id": "3ec01801-8ae9-4c7d-b5cc-d0b3b4dd3426", "title": "Man accused of deadly stabbing in Dayton formally charged", "date": "2024-07-17 06:00", "url": "https://www.whio.com/news/local/man-accused-deadly-stabbing-dayton-formally-charged/QBGU7TWCAJFOZADZXENDTZC23A/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The exact location of the main event cannot be determined from the provided text.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It looks like there aren’t any current events of security reported in text that have a specific location."}, {"id": "2681da9e-12c2-4086-9e0d-f7fb27621029", "title": "North Korean nuclear weapons , 2024", "date": "2024-07-17 06:00", "url": "https://nuclear-news.net/2024/07/17/3-b1-north-korean-nuclear-weapons-2024/", "domain": "nuclear-news.net", "domain_classification": "Unknown", "message": "North Korean nuclear weapons, 2024Bulletin By Hans M. Kristensen, Matt Korda, Eliana Johns, Mackenzie Knight | July 15, 2024North Korea continues to modernize and grow its nuclear weapons arsenal.\nNorth Korea’s nuclear policyFor decades, North Korea has made numerous statements and signals about its nuclear weapons policy, laying out its nuclear doctrine if deterrence fails.\nIn 2013, for example, North Korea’s “Law on Consolidating the Position of Nuclear Weapons State” suggested a no-first-use policy, noting that North Korea’s nuclear arsenal would only be used “to repel invasion or attack from a hostile nuclear weapons state and make retaliatory strikes” (KCNA 2013).\nSuch caveats culminated in September 2022 when North Korea’s parliament codified in law North Korea’s right to launch nuclear weapons preemptively (Kim 2022).\nNorth Korea’s nuclear weapons programPlutonium production operationsThe Yongbyon Nuclear Scientific Research Center, located in North Pyongan province, has been called the “beating heart” of North Korea’s nuclear weapons program.", "location": ".\nYongbyon Nuclear Scientific Research Center", "classification": "security", "score": 0.49784823418502316, "event_breakdown": "North Korea continues to modernize and grow its nuclear weapons arsenal, including the construction and modification of new facilities to produce fissile material, such as uranium enrichment plants and a tritium production facility.\nNorth Korea’s nuclear weapons policy continues to evolve, with the country’s most recent policy stating that it may launch a preemptive nuclear strike."}, {"id": "71d428a7-2f82-4f02-9576-5195d4eb791d", "title": "Over 50 more Gazans killed in Israeli strikes - World", "date": "2024-07-17 06:00", "url": "https://www.dawn.com/news/1846250/over-50-more-gazans-killed-in-israeli-strikes", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "The Gaza health ministry said an Israeli strike on a fuel station in Al-Mawasi in southern Gaza killed 17 people and wounded at least 26.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nHours earlier, US Secretary of State Antony Blinken told two senior Israeli officials of Washington’s “serious concern” following the deadly Israeli strikes in Gaza, his spokesman said.\nThe Israeli strikes have forced 90 per cent of Gaza’s 2.4 million people to flee homes.\nMany have sought refuge in UN-run schools, seven of which have been hit by Israeli strikes since July 6.", "location": "GAZA", "classification": "security", "score": 0.8994887261286472, "event_breakdown": "Gaza health ministry in Ma’an claims to have bombed a fuel station in Al-Mawasi in southern Gaza on July 20, killing 17 and wounding 26, and says 5 were killed in Rafah in an airstrike on a home on July 20."}, {"id": "19c5f681-6e17-4671-b04a-28f944b04fe9", "title": "Ukraine trauma continues ; UN , NATO scramble for solution", "date": "2024-07-17 05:00", "url": "https://www.koreatimes.co.kr:443/www/opinion/2024/07/797_378827.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "By John J. MetzlerAs Ukraine’s war enters its third summer of fighting, there’s a morbid cadence to the conflict.\nFollowing the unprovoked attack on the hospital, which was for specialized cancer patients, the 15-member U.N. Security Council met in an emergency session.\nThere was a sullen stillness to the Security Council meeting on the Kyiv attacks.\nKyslytsya stressed that the Russian “war criminals will wind up in hell, bypassing purgatory.”As expected no resolution nor formal statement was voted on, just this verbal rebuke.\nTwo hundred miles to the south in Washington, NATO was commemorating the 75th anniversary of the Atlantic Alliance in 1949.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.568026209148856, "event_breakdown": "Event 1: On December 1, 2021 at 11:30am, an emergency session of the UN Security Council convened to discuss the attack on a Kyiv cancer hospital by the Russian army.\nEvent 2: On April 6, 1949, the North Atlantic Treaty Organization (NATO) was established and celebrates its 75th anniversary in Washington, D.C."}, {"id": "d50477f7-f603-4b02-9414-f3b3fe34041d", "title": "Bay Area man returns home after serving with Ukrainian military", "date": "2024-07-17 00:30", "url": "https://www.ktvu.com/news/bay-area-man-returns-home-after-serving-ukrainian-military", "domain": "ktvu.com", "domain_classification": "Unknown", "message": "The fog of war in the Russia-Ukraine conflict has provided clarity for a South Bay man.\nSince recently returning to his Bay Area home, Pursley has been enjoying life's simpler pleasures, like walking in a park.\nA retired U.S. Army specialist, Pursley served a year-long tour with the Ukraine Foreign Legion in 2023.\nPost-conflict, he's likely to face a different sort of battle as a firefighter in the South Bay.\nJesse Gary is a reporter based in the station's South Bay bureau.", "location": "SOUTH BAY", "classification": "security", "score": 0.5803059398529603, "event_breakdown": "Pursley served in the Ukraine Foreign Legion for one-year in 2023, so he is not likely to face that battle."}, {"id": "2f02e0f8-ed48-4f88-a6cb-e7f13d55fac4", "title": "Muharram 2024 : Are liquor stores closed today in Delhi and Mumbai ? Check dry days list", "date": "2024-07-17 06:45", "url": "https://economictimes.indiatimes.com/news/india/muharram-2024-are-liquor-stores-closed-today-in-delhi-and-mumbai-check-dry-days-list/articleshow/111800586.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Delhi Dry DaysMumbai Dry Days(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA \" dry day \" is a day when the sale and consumption of alcoholic beverages are legally restricted or prohibited.\nMuharram 2024 marks the beginning of the Islamic lunar calendar and starts on July 8th.\nDry days are being observed in Mumbai, Delhi and many other cities.The month holds deep significance for Muslims, particularly for the Day of Ashura, observed on the 10th of Muharram (July 17th in 2024).\nAccording to an order from the Excise Department issued on Tuesday, liquor shops will be closed on Muharram (July 17), Independence Day (August 15), Janmashtami (August 26), and Eid-e-Milad (September 16).\nIn addition to liquor stores, all other excise licensees, including hotels, clubs, restro-bars, and other retail and wholesale operations, will be closed on Independence Day.", "location": "Delhi", "classification": "security", "score": 0.502102847321569, "event_breakdown": "In Mumbai, liquor stores will be closed on Muharram (July 17), Independence Day (August 15), Janmashtami (August 26), and Eid-e-Milad (September 16).\nIn Delhi, liquor stores will be closed on Muharram (July 17), Independence Day (August 15), Janmashtami (August 26), and Eid-e-Milad (September 16)."}, {"id": "83fdc6c4-e8ef-49e8-b0f3-57f66f2dc56d", "title": "CODEPINK anti - war protester arrested at RNC", "date": "2024-07-17 06:15", "url": "https://lacrossetribune.com/news/local/government-politics/anti-war-protester-arrested-rnc/article_72fbb8ac-43e3-11ef-a553-7be45e59fa8f.html", "domain": "lacrossetribune.com", "domain_classification": "Unknown", "message": "With nearby signs reading “Women say health care, not warfare,” a protester's confrontation with U.S. Rep. Derrick Van Orden lead to her arrest.\nAnti-war protester, Nour Jaghama from the organization CODEPINK, was arrested for an alleged assault of Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\nAccording to the Milwaukee Police Department, the incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\n\"The suspect was taken into custody and charges will be reviewed by the Milwaukee County District Attorney’s office.\"\nCODEPINK has announced that they will be holding a rally Wednesday morning outside the Downtown Milwaukee County Jail, calling for Jahagma's release.", "location": "Milwaukee", "classification": "security", "score": 0.44035139308814975, "event_breakdown": "Target event - a protest action during the republican national convention\nArrest woman for alleged assault of Republican congressman during RNC | 6e7a4e32-d63d-4f74-9a60-13d345a62868\nEnd event"}, {"id": "ca81fb66-0696-4305-aa5d-e8be423e7846", "title": "Warplanes : Ukraine A problem for Russian Northern Fleet", "date": "2024-07-17 06:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairfo%5Carticles%5C202407160835.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "The increased activity at Russian air, naval and land bases to support the Russian forces in Ukraine is very visible.\nRussian ground forces suffered heavy losses and most of the Northern Fleet security forces were sent to Ukraine and most were killed or wounded.\nNorway, Finland and Sweden are not threatening Russian forces but are increasing air, land and naval forces based in the area.\nThe Russian bombers are expensive to operate, in part because the engines last less than a third as long as Western ones.\nBy 2024 Ukraine had used UAVs to attack more Russian air bases, some of them hundreds of kilometers inside Russia.", "location": "Based on the information provided, it is not possible to determine a specific location for the main event.", "classification": "security", "score": 0.5877360280500937, "event_breakdown": "Event 1: Increased activity at Russian air, naval, and land bases to support the Russian forces in Ukraine.\nEvent 2: The Norwegian army is moving tanks and artillery to Finnmark near the Russian border.\nEvent 3: Finland is moving tanks and artillery to the Russian arctic border.\nEvent 4: The Finnish Navy has sent Hyrdoki missile boats and Rauma class missile boats with troops to the Baltic Sea near Kaliningrad."}, {"id": "d0cf304c-9a78-44b2-884f-34593ab62674", "title": "Archeologists find musket balls fired during 1 of the first battles in the Revolutionary War", "date": "2024-07-17 07:45", "url": "https://www.kiro7.com/news/national/archeologists-find/47X5VGXIIJFZTOJB5BETOZIC6E/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It looks like there were no current events of security reported in text that can be placed on a map in the specified time frame."}, {"id": "89d059f6-306e-4d58-9ec3-d8f3897fff81", "title": "Archeologists find musket balls fired during one of the first battles in the Revolutionary War", "date": "2024-07-17 06:45", "url": "https://www.stripes.com/history/2024-07-17/musket-balls-revolutionary-war-battle-14512261.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Revolutionary War musket balls that are believed to have been fired at the British by colonial militia men are displayed at Minute Man National Historical Park in Concord, Mass., on July 15, 2024.\nVisitors cross the North Bridge in Minute Man National Historical Park on July 15, 2024, near a site where archaologists found five Revolutionary War musket balls that are believed to have been fired during one of the first battles in the Revolutionary War.\nAnd the fact that the musket balls were intact indicates fighters likely missed their mark.\nAs they passed Walsh, she offered to show the family the musket balls.\n“It’s incredible,” said Jennifer Ayvaz, who came from Castle Rock, Colorado, adding that her father would love to see the musket balls.", "location": "CONCORD, MASSACHUSETTS", "classification": "security", "score": 0.9072132506732771, "event_breakdown": "Minute Man National Historical Park"}, {"id": "c68c343a-10c0-4b5f-894c-367221a791d1", "title": "Russian Army Loses 1 , 110 Invaders In Ukraine In Last Day", "date": "2024-07-17 06:45", "url": "https://menafn.com/1108448216/Russian-Army-Loses-1110-Invaders-In-Ukraine-In-Last-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The total combat losses of Russian in Ukraine from 24 February 2022 to 10 July 2024 amounted to about 562,510 people, including another 1,110 people in the last day.\nThis is stated on the page of the General Staff of the of Ukraine, Ukrinform reports.\nAlso, the Defence Forces destroyed 8238 (+11) Russian tanks, 15,871 (+9) armoured combat vehicles, 15,411 (+43) artillery systems, 1,120 (+1) MLRS, 893 (+1) air defence systems, 361 (+0) aircraft, and 326 (+0) helicopters, Operational and tactical UAVs - 12,224 (+31), missiles - 2,398 (+0), ships/boats - 28 (+0), submarines - 1 (+0), vehicles and tankers - 20,741 (+61), special equipment - 2,586 (+9).\nRussia trying to prevent escape of potential draftees – UKThe data is being updated.\nAs Ukrinform reported earlier, on 16 July, as of 22:00, 86 combat engagements between the Defence Forces and Russian invaders took place at the front .", "location": "The main event takes place in Ukraine.", "classification": "security", "score": 0.6015503375997242, "event_breakdown": "There is an ongoing war in  Ukraine which started in February 2022 and is ongoing. It can be added to a map."}, {"id": "0bce9adc-2991-4bcf-beb9-ee8df4c7f653", "title": "Israeli strikes in southern , central Gaza kill more than 60 Palestinians , including in  safe zone  ", "date": "2024-07-17 06:30", "url": "https://isp.netscape.com/news/world/story/0001/20240717/0cff821823185af16fb2ec5ee8e5c986", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli strikes in southern, central Gaza kill more than 60 Palestinians, including in 'safe zone'DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nIsrael's military said Hamas militants were operating from the school to plan attacks.", "location": "GAZA", "classification": "security", "score": 0.9819888027235553, "event_breakdown": "Israeli strikes in Gaza on Tuesday"}, {"id": "66248733-4443-4375-84cf-1175a822129d", "title": "Smoke on the horizon - Israel and Hezbollah edging closer to war", "date": "2024-07-17 06:45", "url": "https://www.bbc.co.uk/news/articles/cz5r18zm7lpo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "As the war in Gaza grinds on, there are growing fears another Middle East war may erupt - with devastating consequences for the region, and beyond.\nIsrael and the Lebanese armed group Hezbollah (backed by Iran) have been trading fire across their shared border for the past nine months.\nIf this conflict escalates to all-out war, it could dwarf the destruction in Gaza, draw in Iranian-backed militias in Iraq, and Yemen, spread embers around the Middle East and embroil the US.\nFor now, a low-level war simmers in the summer heat, along a 120km (75 mile) stretch of border.\nOne spark here could set the Middle East alight.", "location": "Lebanon", "classification": "security", "score": 0.7867600683744813, "event_breakdown": "Israel is trading fire with the Palestinian group Hamas in Gaza and with Hezbollah across their shared border. Hezbollah have their stronghold in Lebanon, while Israel is using their military might on Palestinians in Gaza."}, {"id": "784bc364-df6e-4963-9a64-b192f48b3e8b", "title": "IDF marks three main achievements in Israel - Hamas War thus far", "date": "2024-07-17 13:45", "url": "https://www.jpost.com/israel-hamas-war/article-810651", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "IDF increases military pressure across GazaThe IDF states that several alternatives for maintaining control of the Philadelphi Corridor are being discussed privately.\nThe IDF is increasing pressure on Hamas on the three main fronts in the depths of the territory: Rafah, the center, and the north of the Gaza Strip.\nThrough the Gaza Division, the IDF is also deepening its comprehensive management and strategic control of the operational area.\nView of the Philadelphi Corridor between the southern Gaza Strip and Egypt, on July 15, 2024.\nIn an operation by Division 99 and Division 98 in Shejaia and the Rimal neighborhood in Gaza City, the IDF discovered UNRWA's \"Dalal\" compound.", "location": "Gaza", "classification": "security", "score": 0.9765256774357676, "event_breakdown": "IDF increases military pressure across Gaza in Rafah, central, and northern Gaza Strip\nIDF discovers UNRWA's 'dalal' compound in Shejaia and the Rimal neighborhood in Gaza City"}, {"id": "abbd6e8c-cbf4-4503-8a7a-6b9a1a5f21c3", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 17:30", "url": "https://www.startribune.com/as-gazas-doctors-struggle-to-save-lives-many-lose-their-own-in-israeli-airstrikes/600381262/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "But also, it has devastated Gaza's medical personnel.\nGaza's health workers deny the accusation.\nOne of Gaza's most prominent fertility doctors, Omar Ferwana, was killed along with his family in a strike on his home in October.\nTank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders, according to the group.\nAlong with the personal toll, their deaths rob Gaza's medical system of their skills when they have become crucial.", "location": "GAZA CITY", "classification": "security", "score": 0.7286385273824899, "event_breakdown": "Omar Ferwana, a prominent fertility doctor in Gaza, was killed along with his family in a strike on his home in the northern Gaza Strip in October.\nTank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders."}, {"id": "532659d0-50a5-4f72-b41f-34139b0753b4", "title": "Different yardsticks : Western media coverage of hospital bombings in Gaza and Kiev", "date": "2024-07-17 16:30", "url": "http://www.presstv.ir/Detail/2024/07/17/729507/different-yardsticks-western-media-coverage-hospital-bombings-gaza-kiev", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Many like Asma have accused Western media of practicing 'colonizer journalism'.\nWestern media has been dehumanizing the East for centuries, said Sonia, a Palestinian activist and teacher based in France.\n“In his book, ‘A Dying Colonialism’ French political philosopher Franz Fanon writes about the dehumanization of Algerians(Algeria was a French colony 1830-1962) by western media reports.\nHe has no core.pic.twitter.com/XlBKIPc0Q0 — Howard Beckett (@BeckettUnite) July 12, 2024“A Ukraine hospital is bombed by Russia.\npic.twitter.com/0DwBJbVZAw — YourFavoriteGuy (@guychristensen_) July 11, 2024Sharing Trudeau’s tweet, Siddharth, a pro-Palestine activist pointed to the racist coverage of the Western media viz a viz Palestine.", "location": "Palestine", "classification": "security", "score": 0.7263776383421673, "event_breakdown": "Ukraine hospital bombed by Russia."}, {"id": "13c5a3b3-fdc8-4011-88c2-53d592045e6d", "title": "285 days of war : 9 civilians killed , others injured in Israeli airstrikes on Nuseirat camp | World", "date": "2024-07-17 12:00", "url": "https://en.ammonnews.net/article/73867", "domain": "en.ammonnews.net", "domain_classification": "Unknown", "message": "Home World285 days of war: 9 civilians killed, others injured in Israeli airstrikes on Nuseirat campAmmon News - Dozens of civilians were killed on Wednesday and others injured in Israel airstrikes on different areas in the Gaza Strip.\nIn the Nuseirat camp in the central Gaza Strip, seven civilians were killed and others were injured as a result of the occupation’s bombing of a house in the vicinity of the Sunna Mosque south of the Nuseirat camp.\nMeanwhile, two civilians were also killed and 15 others were injured in the occupation’s bombing of the Abdullah Azzam Mosque north of the camp.\nAs for the cities of Khan Yunis and Rafah, the occupation warplanes fired shells towards the eastern areas of the city of Khan Yunis.\nThe Israeli warplanes also launched two airstrikes on the southwestern area of ​​the city of Rafah.", "location": "NUSEIRAT CAMP", "classification": "security", "score": 0.9983893401360519, "event_breakdown": "Target event: 7 civilians were killed and others were injured in israeli airstrikes on the nuseirat camp in the Gaza Strip.\nIn the nuseirat camp in the central Gaza Strip, 7 civilians were killed and others were injured as a result of the occupation's bombing of a house in the vicinity of the Sunna Mosque south of the Nuseirat camp."}, {"id": "7d091b96-29a8-4ca3-9bf7-9928d0b74da1", "title": "Hezbollah Fighters Directly Carry Out Sayyed Nasrallah Threats : New Israeli Settlements Under Fire – Al - Manar TV Lebanon", "date": "2024-07-17 11:30", "url": "https://english.almanar.com.lb/2155441", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "The Islamic Resistance continued on Wednesday the confrontation with the Zionist aggression on South Lebanon as well as the border battle in support of Gaza.\nIn this regard, the Islamic Resistance started striking with missiles new settlements that have not been evacuated by the Zionist enemy yet in accordance with Israeli media reports.\nHezbollah Secretary General Sayyed Hasan Nasrallah affirmed in his speech addressing crowds marking the Tenth of Muharram in Beirut’s Dahiyeh that the Islamic Resistance will include new Zionist settlements in the range of its missile fire if the enemy continues targeting civilians in South Lebanon.\nIndeed, Hezbollah Military Media issued a statement which emphasizes that the Islamic Resistance fighters bombarded “Sa’ar” and “Gesher HaZiv” settlements with tens of Katyusha rockets.\n3- The Islamic Resistance fighters targeted Kabri settlement with a volley of Katyusha rockets, in response to the “Israeli” enemy’s attacks on the steadfast southern villages, safe homes, and targeting of civilians, especially the horrific massacre that resulted in killing three children.", "location": "Lebanon", "classification": "security", "score": 0.9767195556149382, "event_breakdown": "Hezbollah fired rockets at Israeli settlements of Gesher HaZiv and Sa’ar, and Kabri settlement, as well as bombarding them on Wednesday, in response to attacks by Israel."}, {"id": "0f1fbdf6-ad74-4102-b6f9-cdef17d9b1c8", "title": "WATCH : ATACMS Destroys Russian S - 300 Anti - Missile System Near Occupied Mariupol", "date": "2024-07-17 17:00", "url": "https://www.kyivpost.com/post/35971", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Commander-in-Chief of the Ukrainian Armed Forces (AFU), Oleksandr Syrsky, announced a successful strike on a Russian S-300 anti-missile system near Mariupol in the occupied Donetsk region.\nSyrsky confirmed the strike and commended Ukrainian servicemen for their successful execution of the mission.\nOn July 16, Syrsky released a video confirming the destruction of the Russian S-300 system.\nAccording to Militarnyi media outlet, Ukrainian missile forces used ATACMS to fire at least four M39 cluster ballistic missiles at Russian anti-aircraft positions on the outskirts of Mariupol.\nThe Russian S-300’s location was pinpointed east of Mangush village in the Donetsk region, approximately 7 kilometers from the Mariupol airfield, as reported by Militarnyi.", "location": "Donetsk region, Ukraine", "classification": "security", "score": 0.5761965491868757, "event_breakdown": "Russian S-300 anti-missile system near Mariupol destroyed in Ukrainian strike"}, {"id": "b0132019-d446-41dc-ad6b-8116cab09aba", "title": "Israel Pounds Central Gaza , Sends Tanks Into North of Rafah", "date": "2024-07-17 16:15", "url": "https://www.newsmax.com/world/globaltalk/israel-war-hamas/2024/07/17/id/1172869/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Israeli forces pounded areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nIsraeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the center of enclave, residents said.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area.\"\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": "GAZA", "classification": "security", "score": 0.9295098303891725, "event_breakdown": "Events:\nAt least nine Palestinians were killed by Israeli forces in the Gaza Strip on Wednesday, health officials and residents said. Israeli tanks also shelled the central regions of the Gaza Strip.\nIsraeli forces entered areas in the city of Rafah in the southern Gaza Strip. Two Palestinians were killed in an Israeli strike in Rafah, medics said. At least 100 homes were blown up by Israeli forces in the city, residents said."}, {"id": "ba75f862-9527-4e2b-9e19-13fae65f5774", "title": "Israel pounds central Gaza , sends tanks into north of Rafah", "date": "2024-07-17 12:00", "url": "https://www.swissinfo.ch/eng/israel-pounds-central-gaza%2c-sends-tanks-into-north-of-rafah/84059585", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israel pounds central Gaza, sends tanks into north of Rafahreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Israeli forces hit areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nThe Israeli military said troops were “continuing precise, intelligence-based operational activity in the Rafah area”.\nA deal would aim to end the war and release Israeli hostages in Gaza in return for many Palestinians jailed by Israel.\nOn Wednesday, Israel released 13 Palestinians detained during the offensive in Gaza, the Palestinian Red Crescent said in a statement.\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "location": "GAZA/RAFAH, GAZA, GAZA STRIP", "classification": "security", "score": 0.8739779491727325, "event_breakdown": "Nidal al-MughrabiCAIRO (Reuters) – Israeli military sources said troops embarked on limited advance further into Rafah in southern Gaza on Wednesday.\nIsrael hit areas in the central Gaza Strip, killing nine Palestinians, while Palestinian Health officials said in statement.Palestinian Red Crescent statement said Israel has also released 13 Palestinians detained during the offensive in Gaza."}, {"id": "ec18dd34-0538-4a4f-8c04-fc4a81f076b0", "title": "Is Hamas Crumbling ? Report of  Major Internal Breach  ", "date": "2024-07-17 17:30", "url": "https://www2.cbn.com/news/israel/hamas-crumbling-report-major-internal-breach", "domain": "cbn.com", "domain_classification": "Unknown", "message": "PHOTO: Israel struck a site in Khan Younis, southern Gaza Strip, Saturday, July 13, 2024, targeting Hamas' shadowy military commander Mohammed Deif.\n(AP Photo/Jehad Alshrafi)Israel has reportedly received intelligence from insiders in the Hamas terrorist organization as it has been hunting down the group's top leaders.\nA Saudi news channel is reporting Hamas is looking at a possible \"major internal breach\" after Israel's targeted strike in Gaza over the weekend.\nThe Times of Israel reports the Jewish state might have also been able to extract useful information from Hamas leaders it has captured.\nMiddle East analyst Bill Koenig told CBN News Hamas has been hiding among civilians, using them as human shields for many years.", "location": "GAZA", "classification": "security", "score": 0.667426089636782, "event_breakdown": "Israel has received intelligence from Hamas insiders as it hunts for the group's top leaders. Israel might have also been able to extract useful information from Hamas leaders it has captured. Hamas is looking at a possible \"major internal breach\" after Israel's targeted strike in Gaza over the weekend."}, {"id": "39d12e80-1096-4077-af75-848568f530e8", "title": "Early Edition : July 17 , 2024", "date": "2024-07-17 14:30", "url": "https://www.justsecurity.org/97801/early-edition-july-17-2024/", "domain": "justsecurity.org", "domain_classification": "Unknown", "message": "Signup to receive the Early Edition in your inbox here.\nPeter Baker, Adam Goldman, and Julian E. Barnes report for the New York Times; Erin Banco reports for POLITICO.\nThe Israeli military said it had targeted militants who had operated inside the building.\nAbout 17 people were killed yesterday in a separate strike in Mawasi, an Israel-designated safe zone, according to the Hamas-run health ministry.\nThe Israeli military said it had struck an Islamic Jihad commander in Khan Younis and that it was investigating reports that civilians were injured.", "location": "GAZA CITY.", "classification": "security", "score": 0.9284151680698727, "event_breakdown": "The Israeli military said it had targeted militants who had operated inside an apartment building in Gaza City."}, {"id": "2cec076a-06ed-462e-b3a3-3828cf95a0dd", "title": "Richmond : Person of interest in Fourth of July stabbing dead", "date": "2024-07-17 18:45", "url": "https://www.eastbaytimes.com/2024/07/17/person-of-interest-in-fatal-fourth-of-july-stabbing-in-richmond-found-dead-in-mexico/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "RICHMOND — A man suspected in the fatal Fourth of July stabbing of a woman has been found dead in Mexico, while another person that police sought in the shooting death of a man near the Richmond Parkway has been arrested in Nebraska, authorities said.\nEdirlei Tofolio was a person of interest in the July 4 stabbing death of 48-year-old Elindenia Silva, of El Sobrante.\nRichmond police spokesperson Lt. Donald Patchin said he was found dead in Mexico on July 9.\nIn the other incident, police arrested Arcenio Marquez late last month following the shooting death of Elizander Narvaez-Fernandez, 26, of Richmond on June 23, Patchin said.\nPolice in Richmond have investigated nine homicides in 2024, one more than in all of 2023.", "location": "Richmond, California", "classification": "security", "score": 0.889883988959625, "event_breakdown": "Event 1: A man suspected in the fatal stabbing of a woman during the Fourth of July weekend was found dead in Mexico, police said. The man, Edirlei Tofolio, was a person of interest in the July 4 stabbing death of Elindenia Silva, of El Sobrante. - Location: Edirlei Tofolio found dead in Mexico.\nEvent 2: Police have arrested Arcenio Marquez in the shooting death of Elizander Narvaez-Fernandez in the Richmond Parkway. - Location: Arcenio Marquez arrested in Nebraska."}, {"id": "87ef83e2-948b-4eac-b322-c7d0918ddad2", "title": "Hezbollah threatens to target new Israeli sites if civilians are killed", "date": "2024-07-17 16:15", "url": "https://www.malaymail.com/news/world/2024/07/17/hezbollah-threatens-to-target-new-israeli-sites-if-civilians-are-killed/144081", "domain": "malaymail.com", "domain_classification": "Unknown", "message": "BEIRUT, July 17 — Hezbollah leader Hassan Nasrallah warned Wednesday that his Iran-backed group would hit new targets in Israel if more civilians are killed in Israeli strikes on Lebanon.\n“If the enemy continues to target civilians as it has done in recent days, then this will push us to target localities that we have not targeted until now,” Nasrallah said.\nLebanon’s state-run National News Agency said Israeli strikes in the south killed five people, including three Syrian children, on Tuesday.\nNasrallah warned Israel of the consequences of any invasion of Lebanon, saying Israel would be left without any tanks if a full-blown conflict erupted.\nOn the Israeli side, 17 soldiers and 13 civilians have been killed, according to authorities.", "location": "Israel", "classification": "security", "score": 0.937691426280316, "event_breakdown": "New targets in Israel"}, {"id": "acae2ce3-6448-4c3c-9226-14e8215df725", "title": "As Gaza doctors struggle to save lives , many lose their own in Israeli airstrikes", "date": "2024-07-17 17:15", "url": "http://www.middletownpress.com/news/world/article/as-gaza-s-doctors-struggle-to-save-lives-many-19578484.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Advertisement Article continues below this adTank shelling on a northern Gaza hospital during a siege in November killed three doctors, including two doctors working with Doctors Without Borders, according to the group.\nAdvertisement Article continues below this adSoon after, Israeli forces besieged and raided Nasser Hospital, forcing its evacuation.\nAdvertisement Article continues below this adThe Israeli military did not respond to requests for comment on the strike.\nAdvertisement Article continues below this adOsama is feeling partially responsible.\nAdvertisement Article continues below this ad___", "location": "GAZA", "classification": "security", "score": 0.9777669508206404, "event_breakdown": "Three doctors were killed in a northern Gaza hospital during a siege by Israeli forces in November. Israeli forces besieged and raided Nasser Hospital, forcing its evacuation. The Israeli military did not respond to requests for comment on the strike."}, {"id": "946d3cc5-e68b-4395-a485-ab61fdd6a655", "title": "Israel pounds central Gaza , sends tanks north of Rafah", "date": "2024-07-17 10:15", "url": "https://www.newcastleherald.com.au/story/8698092/israel-pounds-central-gaza-sends-tanks-north-of-rafah/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Diplomatic efforts by Arab mediators to halt the hostilities, backed by the United States, seem to be on hold, but officials from all sides have said they are open to more talks, including Israel and Hamas, who have traded blame over the current impasse.", "location": "GAZA CITY", "classification": "security", "score": 0.8640490479753452, "event_breakdown": "Target event: Ongoing Israel-Gaza conflict\nThe Israel-Gaza conflict is an ongoing military confrontation between Israel and the Islamic militant group Hamas, which governs the Gaza Strip. The conflict began in the second week of May 2021, with tensions in Jerusalem and is centered in the Gaza strip area."}, {"id": "48953376-f6e0-4e86-8337-aff67311eec2", "title": "Relatives of those killed when MH17 was shot down mark 10 years since tragedy that claimed 298 lives", "date": "2024-07-17 14:30", "url": "https://www.theweek.in/wire-updates/international/2024/07/17/fgn56-netherlands-malaysia-mh17-anniversary.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Vijfhuizen (Netherlands), Jul 17 (AP) Relatives of passengers and crew killed when Malaysia Airlines Flight 17 was shot down over Ukraine gathered on Wednesday to mark the 10th anniversary of the tragedy that claimed 298 lives, over half of whom were Dutch.\nFamilies of the victims blamed Russian-backed rebels for the missile that took down the plane, but Moscow has repeatedly denied responsibility.\nCommemoration services took place in the Netherlands, Australia and the site of the crash in the Russia-controlled part of the Donetsk region, as the war in Ukraine raged on.\n“Today we remain unwavering in our determination to ensure truth, justice and accountability for the victims and their loved ones,” Dreyfus said.\nAn international investigation initiated in the U.N. Security Council by the Netherlands, Malaysia and Australia concluded that the Buk missile system that destroyed MH17 belonged to the Russian 53rd Anti-Aircraft Missile Brigade.", "location": "Netherlands", "classification": "security", "score": 0.49181996826050595, "event_breakdown": "Malaysia Airlines Flight 17 shot down over Ukraine\nVijfhuizen (Netherlands)\nDonetsk region"}, {"id": "8d3abb01-df85-4215-a745-7b5919951f31", "title": "Pakistan summons Afghan diplomat to protest a suicide attack that killed 8 soldiers in the northwest", "date": "2024-07-17 15:45", "url": "https://abcnews.go.com/International/wireStory/pakistan-summons-afghan-diplomat-protest-suicide-attack-killed-112026100", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Pakistan summoned a senior Afghan diplomat to strongly protest a deadly militant attack that left eight soldiers dead in the northwest bordering Afghanistan, the Foreign Ministry said WednesdayPakistan summons Afghan diplomat to protest a suicide attack that killed 8 soldiers in the northwestISLAMABAD -- Pakistan summoned a senior Afghan diplomat Wednesday to strongly protest a deadly militant attack that left eight soldiers dead in the northwest bordering Afghanistan, the Foreign Ministry said.\nA splinter group of Pakistani Taliban, or Tehrik-e-Taliban Pakistan, led by a militant commander Gul Bahadur, has claimed responsibility for the attack.\nThe TTP is a separate group but also an ally of the Afghan Taliban and has stepped up its attacks in Pakistan since the Afghan Taliban seized power in Afghanistan in 2021.\nIn a statement, the Foreign Ministry said it asked Kabul to fully investigate the bombing and take immediate action against the perpetrators.\nIn January 2023 militants killed at least 101 people, mostly police officers, when a suicide bomber disguised attacked a mosque in the northwestern city of Peshawar.", "location": "Peshawar", "classification": "security", "score": 0.9667231028416862, "event_breakdown": "TTP targets a Mosque in Peshawar, Pakistan. At least 101 people, mostly police officers, were killed. Pakistani authorities ask Kabul to fully investigate the attack and take immediate action against the perpetrators."}, {"id": "8d3b67c6-7f95-4298-b876-d80589413fdd", "title": "Israeli airstrikes target Hezbollah in southern Lebanon", "date": "2024-07-17 07:45", "url": "https://www.voanews.com/a/israeli-airstrikes-target-hezbollah-in-southern-lebanon/7701418.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Local health officials say Israeli airstrikes killed at least nine Palestinians in the central Gaza Strip on Wednesday.\nOfficials say an Israeli airstrike hit the same camp and killed 23 people one day earlier.\nThe Israeli military says it hit 25 targets in the Gaza Strip in airstrikes over the past day.\nU.S. Defense Secretary Lloyd Austin and Israeli Defense Minister Yoav Gallant discussed the Israel-Hezbollah fighting during a phone call Tuesday, the U.S. Defense Department said.\nIsraeli officials announced Tuesday they will begin to send draft notices to ultra-Orthodox Jewish men to fight in the war in Gaza.", "location": "GAZA", "classification": "security", "score": 0.8952129029047924, "event_breakdown": "Israeli airstrikes kill Palestinian civilians in Gaza - Prior Israeli airstrikes hit Gaza capital of Jabaliya on Tuesday morning - Israeli airstrikes hit the same camp the killed 23 people one day earlier"}, {"id": "334774f8-a089-45e2-9ba3-a76db3a157f7", "title": "USS Carney Visits Newport , Shares Warfighting Experiences", "date": "2024-07-17 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240716-usn03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "USS Carney Visits Newport, Shares Warfighting ExperiencesUS Navy16 July 2024NEWPORT, R.I. -- The guided-missile destroyer USS Carney (DDG 64) visited Naval Station Newport, July 11-15, engaging with various training and education commands to share lessons learned from the crew's September 2023 to May 2024 independent deployment to the U.S. 5th and 6th Fleet areas of operation.\nNaval War College (NWC), Surface Warfare Schools Command (SWSC), Naval Station Newport, the U.S.\nNaval Academy Preparatory School (NAPS) and Officer Training Command Newport (OTCN) to learn from the crew's warfighting experiences in an operationally demanding environment.\nTours of Carney were also offered, providing additional opportunities for personnel stationed onboard Naval Station Newport to interact with the crew.\nCarney Sailors also had the chance to enjoy the local community and attractions in Newport while on liberty during the port visit.", "location": "NEWPORT, R.I.", "classification": "security", "score": 0.8337688600106956, "event_breakdown": "[\n\"USS Carney Visits Newport, Shares Warfighting Experiences\",\n\"Newport, Rhode Island\"\n]"}, {"id": "04057772-d473-4e32-b9c1-8d88b912b66b", "title": "How the Swedish Air Force is finding its flow as part of NATO", "date": "2024-07-17 17:15", "url": "https://www.defensenews.com/global/europe/2024/07/17/how-the-swedish-air-force-is-finding-its-flow-as-part-of-nato/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "Maj. Gen. Jonas Wikman is chief of the Swedish Air Force.\n(U.S. Air Force photo by Eric Dietrich)What are some of your observations from the air war in Ukraine, and what lessons should the training of the Swedish air force personnel entail as a result?\nWe already have our ground-based air defense, which belongs to the Swedish Army in peacetime and to the Air Force in wartime.\nIn the area of air combat and air defense, how can Europeans cooperate more effectively to strengthen their defensive posture?\nHow is the Swedish air force personnel preparing for operating in GPS-denied or jammed environments, a problem that has become acute in Ukraine?", "location": "U.S. Air Force photo by Eric Dietrich", "classification": "security", "score": 0.7482316924024505, "event_breakdown": "Maj. Gen. Jonas Wikman, chief of the Swedish Air Force, has given an interview about his observations on the air war in Ukraine, and the lessons the Swedish Air Force should learn from it. Wikman also mentioned that Sweden already has ground-based air defense systems that could be used to protect the country, and that the service was working on how to better cooperate on defense with other European nations. Wikman said that the Swedish Air Force was paying attention to the challenges faced by the Ukrainian Air Force, including operating in GPS-denied or jammed environments, and was working to prepare its officers for the challenges they might face in combat."}, {"id": "689ea789-c2cf-4cfb-bc06-98f3d4cbcf76", "title": "USS Carney visits Québec , Highlights Maritime Security and Partnerships", "date": "2024-07-17 11:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240716-usn01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "USS Carney visits Québec, Highlights Maritime Security and PartnershipsUS Navy16 July 2024From Commander, U.S. 2nd FleetQUEBEC CITY, Canada -- The Arleigh Burke-class guided-missile destroyer USS Carney (DDG 64) visited Québec City, Canada, for the Rendez-vous naval de Québec, July 3-8, 2024.\nWhile in Québec, Carney held tours and hosted more than 4,100 guests during two public tour days.\nCarney Sailors explored Québec City, visiting the Château Frontenac, Petit-Champlain, Place Royale, Notre-Dame de Québec Basilica-Cathedral, Citadelle de Québec, and Montmorency Falls.\nJeremy Robertson, commanding officer of USS Carney.\nCarney is capable of conducting prompt and sustained combat operations at sea and equipped to operate in a high-density multi-threat environment.", "location": "QUEBEC CITY, Canada", "classification": "security", "score": 0.8417227862088156, "event_breakdown": "Target event - reports that shows port of entry to port of exitShip tours allowed on USS Carney . Canons of Fort Karl at Citadel of Quebec were fired off , PHOTO 1Armed Forces Members wearing kilts of Royal Highland Regiment ,PHOTO 2Aircraft carrier Charles de Gaulle arrive in port for Underway Dépense Québec 2024 PHOTO 3"}, {"id": "e8a56d98-f14d-49c3-a28f-860ff7a42318", "title": "How the Swedish Air Force is finding its flow as part of NATO", "date": "2024-07-17 17:30", "url": "https://www.yahoo.com/news/swedish-air-force-finding-flow-163732958.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Maj. Gen. Jonas Wikman is chief of the Swedish Air Force.\n(U.S. Air Force photo by Eric Dietrich)What are some of your observations from the air war in Ukraine, and what lessons should the training of the Swedish air force personnel entail as a result?\nWe already have our ground-based air defense, which belongs to the Swedish Army in peacetime and to the Air Force in wartime.\nIn the area of air combat and air defense, how can Europeans cooperate more effectively to strengthen their defensive posture?\nHow is the Swedish air force personnel preparing for operating in GPS-denied or jammed environments, a problem that has become acute in Ukraine?", "location": "U.S. Air Force photo by Eric Dietrich", "classification": "security", "score": 0.7482316924024505, "event_breakdown": "Event 1: Chief of the Swedish Air Force, Maj. Gen. Jonas Wikman, discusses observations on the air war in Ukraine and implications for Swedish Air Force training.\n\nEvent 2: The Swedish Air Force outlines its strategy for ground-based air defense, including partnerships with the Swedish Army.\n\nEvent 3: Maj. Gen. Jonas Wikman provides insights on how Europeans can collaborate more effectively in the air combat and air defense domain.\n\nEvent 4: The Swedish Air Force shares its plans for preparing personnel to operate in GPS-denied or jammed environments, based on challenges faced in Ukraine."}, {"id": "1aecb02c-9cbd-463c-b899-ba3f4a90eb92", "title": "Nyhetstråden ! ", "date": "2024-07-17 16:30", "url": "https://www.fz.se/forum/post/4530884", "domain": "fz.se", "domain_classification": "Unknown", "message": "No Man's Sky slår till med en jätteuppdatering av sina system för att skapa världar, vilket ökar diversiteten och kvaliten.\nDe har tagit en del av sakerna de lärt sig från sitt kommande spel Light no fire, och förbättrat No Man's Sky med dem.\nEtt spel som efter åtta år fortfarande får uppdateringar och nytt innehålll.\nVilket är rätt coolt.\nNo Man's Sky - Worlds (part 1)https://www.nomanssky.com/2024/07/no-mans-sky-worlds-part-i/https://www.nomanssky.com/worlds-part-I-update/---Ett annat gammalt spel som fortsätter få innehållsuppdateringar och DLC är Grim Dawn.", "location": ")\nNo specific location is identified", "classification": "security", "score": 0.4255048439966038, "event_breakdown": "No relevant events found."}, {"id": "c08a2a83-1459-4209-b9ab-f9c675cd2cd8", "title": "Rafah : IDF destroys tunnel used in June infiltration attempt", "date": "2024-07-17 18:30", "url": "http://www.israelnationalnews.com/news/393209", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Combat Engineering Unit of the 143rd Division, the Yahalom Unit, and the Desert Reconnaissance Battalion of the Southern Gaza Brigade dismantled an offensive underground tunnel route that was approximately 700 meters long, in the Rafah area.\nInside the tunnel that was destroyed, the troops located further offshoots of the tunnel, blast doors, a terrorist hideout, and electrical infrastructure.\nThis past June, four Hamas terrorists tried to infiltrate Israeli territory through the tunnel route that was destroyed.\nDuring the combat, a soldier of the Southern Gaza Brigade, Sergeant Major Zeed Mazarib z\"l, fell in action.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "RAFAH", "classification": "security", "score": 0.9892213369715882, "event_breakdown": "Event: The Combat Engineering Unit of the 143rd Division of the Israel Defense Forces (IDF) along with the Yahalom Unit and Desert Reconnaissance Battalion of the Southern Gaza Brigade destroyed a 700 meter long offensive underground tunnel route in the Rafah area last week."}, {"id": "4be890dd-ce95-4c64-bd3b-f02cd5ce4709", "title": "Rafah : IDF destroys tunnel used in June infiltration attempt", "date": "2024-07-17 16:45", "url": "https://www.israelnationalnews.com/news/393209", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Combat Engineering Unit of the 143rd Division, the Yahalom Unit, and the Desert Reconnaissance Battalion of the Southern Gaza Brigade dismantled an offensive underground tunnel route that was approximately 700 meters long, in the Rafah area.\nInside the tunnel that was destroyed, the troops located further offshoots of the tunnel, blast doors, a terrorist hideout, and electrical infrastructure.\nThis past June, four Hamas terrorists tried to infiltrate Israeli territory through the tunnel route that was destroyed.\nDuring the combat, a soldier of the Southern Gaza Brigade, Sergeant Major Zeed Mazarib z\"l, fell in action.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "RAFAH", "classification": "security", "score": 0.9892213369715882, "event_breakdown": "Event: Troops from the Combat Engineering Unit of the 143rd Division, the Yahalom Unit, and the Desert Reconnaissance Battalion of the Southern Gaza Brigade dismantled an offensive underground tunnel route that was approximately 700 meters long, in the Rafah area of the Gaza Strip. The event happened on June 15, 2022."}, {"id": "75865f66-e0cd-4567-ad9f-e5c507477b6a", "title": "Ukraine Secret Weapon : A Robot Army Rises from the Ashes", "date": "2024-07-17 13:30", "url": "https://sofrep.com/news/ukraines-robot-army-weapon/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "The cornerstone of this robotic force is the Odyssey , a car-sized unmanned ground vehicle (UGV) built in just four days for a mere $35,000 .\nIn the face of overwhelming odds, Ukraine reportedly forges a revolutionary weapon: an army of robots .\nIn the face of overwhelming odds, Ukraine reportedly forges a revolutionary weapon: an army of robots.\nDenysenko’s company and the Odyssey UGV are just two of the hundred other ongoing initiatives in the war-torn country.\nThe Future of Warfare: A Brave New WorldUkraine’s robot army marks a turning point in warfare.", "location": ")\nLviv", "classification": "security", "score": 0.6030100583159606, "event_breakdown": "Here's a list of current events reported in text that can be placed on a map:\n\n* Luxembourg: In order to improve the European cybersecurity framework, the Government of Luxembourg in collaboration with International Telecommunication Union (ITU) has organized an international cybersecurity conference.\n* Ukraine: In the face of overwhelming odds, Ukraine has reportedly forged a revolutionary weapon: an army of robots."}, {"id": "4ef204a9-902e-4dbf-a0f3-4f266ed1d0d7", "title": "CODEPINK anti - war protester arrested at RNC", "date": "2024-07-17 14:45", "url": "https://madison.com/news/state-regional/crime-courts/anti-war-protester-arrested-rnc/article_8d43d944-14bf-5469-b8e8-2e447bf75dc2.html", "domain": "madison.com", "domain_classification": "Unknown", "message": "With nearby signs reading “Women say health care, not warfare,” a protester's confrontation with U.S. Rep. Derrick Van Orden lead to her arrest.\nAnti-war protester, Nour Jaghama from the organization CODEPINK, was arrested for an alleged assault of Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\nAccording to the Milwaukee Police Department, the incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\n\"The suspect was taken into custody and charges will be reviewed by the Milwaukee County District Attorney’s office.\"\nCODEPINK has announced that they will be holding a rally Wednesday morning outside the Downtown Milwaukee County Jail, calling for Jahagma's release.", "location": "Milwaukee", "classification": "security", "score": 0.44035139308814975, "event_breakdown": "Event 1: With nearby signs reading “Women say health care, not warfare,” a protester's confrontation with U.S. Rep. Derrick Van Orden lead to her arrest.\nEvent 2: Anti-war protester, Nour Jaghama from the organization CODEPINK, was arrested for an alleged assault of Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\nEvent 3: According to the Milwaukee Police Department, the incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\nEvent 4: \"The suspect was taken into custody and charges will be reviewed by the Milwaukee County District Attorney's office.\"\nEvent 5: CODEPINK has announced that they will be holding a rally Wednesday morning outside the Downtown Milwaukee County Jail, calling for Jahagma's release."}, {"id": "578081e1-3b26-4565-aff5-53b78dca1098", "title": "CODEPINK anti - war protester arrested at RNC", "date": "2024-07-17 16:15", "url": "https://journaltimes.com/news/state-regional/crime-courts/anti-war-protester-arrested-rnc/article_12dfbdc5-50d3-5cf3-aeb2-a9e6ebcfb718.html", "domain": "journaltimes.com", "domain_classification": "Unknown", "message": "With nearby signs reading “Women say health care, not warfare,” a protester's confrontation with U.S. Rep. Derrick Van Orden lead to her arrest.\nAnti-war protester, Nour Jaghama from the organization CODEPINK, was arrested for an alleged assault of Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\nAccording to the Milwaukee Police Department, the incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\n\"The suspect was taken into custody and charges will be reviewed by the Milwaukee County District Attorney’s office.\"\nCODEPINK has announced that they will be holding a rally Wednesday morning outside the Downtown Milwaukee County Jail, calling for Jahagma's release.", "location": "Milwaukee, Wisconsin", "classification": "security", "score": 0.44035139308814975, "event_breakdown": "{\n  \"description\": \"A member of the organization CODEPINK was arrested at the RNC today after a protest of nearby signs reading \\\"Women say health care, not warfare.\\\"\",\n  \"data\": [\n    \"Anti-war protester Nour Jahama was arrested for an alleged assault of U.S. Rep. Derrick Van Orden during the Republican National Convention in Milwaukee earlier Tuesday morning.\",\n    \"The incident occurred just after 11 a.m. on 400 block of East Wisconsin Avenue.\"\n  ]\n}"}, {"id": "c0145aed-94dd-416a-a7b1-ed23308f6912", "title": "Reports : Ukrainian Marines Retreat From Dnipro Bridgehead , Long - Held Defensive Bastion Lost", "date": "2024-07-17 12:00", "url": "https://www.kyivpost.com/post/35948", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The Ukrainian troops used small boats to cross to the Kyiv-controlled right/north bank of Dnipro and reached friendly positions near the city of Kherson, other news reports said.\nRussian forces attempted a single assault against Kozachi Laheri on Tuesday, which failed, that official statement said.\nKyiv’s abandonment of Krynky village marked a possible end to months of attempts by Ukrainian forces to hold liberated territory and expand it.\nAny crossing attempt would have been destroyed by Russian Air Force bombers operating mostly freely in air space over the Kherson sector, military analysts say.\nOfficial, Kremlin-controlled information platforms in March declared the Dnipro River’s entire left/south bank cleared of Ukrainian forces, angering milbloggers who said it was fake news and that the Ukrainian Marines were still holding out there.", "location": "Based on the text you provided, I was unable to determine a specific location.", "classification": "security", "score": 0.4855607671867353, "event_breakdown": "Battle of Donbas\nUkrainian troops crossed to the Kyiv-controlled right/north bank of Dnipro River and reached friendly positions near the city of Kherson. Russian forces attempted an assault against Kozachi Laheri on Tuesday, which failed. Ukraine abandoned Krynky village, marking a possible end to the attempts to hold liberated territory and expand it. Russian Air Force bombers operated mostly freely in the air space over the Kherson sector. In March, official Kremlin-controlled information platforms declared that the Dnipro River’s entire left/south bank was cleared of Ukrainian forces, angering milbloggers."}, {"id": "24ed7822-6b27-4d34-924d-fd6b28b74cce", "title": "HRW urges EU to break silence towards Israeli crimes – International Shia News Agency", "date": "2024-07-17 16:00", "url": "https://en.shafaqna.com/376038/hrw-urges-eu-to-break-silence-towards-israeli-crimes/", "domain": "en.shafaqna.com", "domain_classification": "Unknown", "message": "Shafaqna English- Human Rights Watch (HRW) called on the European Union (EU) to break silence towards Israel’s violations of Palestinian human rights, and to ensure that Tel Aviv stops all its illegal practices.\nPeople in Gaza are being deliberately starved and collectively punished as Israeli authorities are using starvation as a method of warfare, severely and arbitrarily restricting food, water, fuel, electricity, and humanitarian access, HRW said in a letter addressing the EU and EU’s Foreign Ministers.\n“There is mounting evidence that the actions of the Israeli army are rendering large parts of the Strip unliveable, and massive reconstruction efforts will be required to enable Palestinians to return to their previous lives.”Sources: Palestinian Information Centerwww.shafaqna.com", "location": "GAZA", "classification": "security", "score": 0.7968374591090163, "event_breakdown": "['HRW calls on the EU to break silence towards Israel’s violations of Palestinian human rights and ensure that Tel Aviv stops all its illegal practices,', 'Human Rights Watch (HRW) calls on the EU to break silence towards Israel’s violations of Palestinian human rights, and to ensure that Tel Aviv stops all its illegal practices']"}, {"id": "1aa0a5e9-aba7-4556-9e0f-565f61765778", "title": "General Dynamics Corporation ( GD ): Best Aerospace and Defense Stock According to Wall Street Analysts ? ", "date": "2024-07-17 10:15", "url": "https://www.insidermonkey.com/blog/general-dynamics-corporation-gd-best-aerospace-and-defense-stock-according-to-wall-street-analysts-1323648/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now.\nIn this article, we are going to take a look at where General Dynamics Corporation (NYSE:GD) stands against the other aerospace and defense stocks.\nWe have chosen the 10 best aerospace and defense stocks to buy now based on the hedge fund sentiment towards each stock.\nOverall GD ranks 3rd on our list of the best aerospace and defense stocks to buy.\nYou can visit 10 Best Aerospace and Defense Stocks to Buy Now to see the other aerospace and defense stocks that are on hedge funds’ radar.", "location": "The most specific location identified in the text is 'United States'.", "classification": "security", "score": 0.7407324987278211, "event_breakdown": "Event 1: General Dynamics to Move Headquarters from California to Virginia\nGeneral Dynamics, a Virginia-based defense contractor, will move its headquarters from Falls Church, Virginia, to Reston, Virginia, in 2023. The company's new corporate headquarters will be located at Reston Town Center and will serve as the company's main place of business and where a majority of its top executives will be based. The company has several facilities in the Dulles Technology Corridor, which is near where the firm will be based.\n\nEvent 2: General Dynamics buys CSRA\nGeneral Dynamics, a defense contractor, agreed to buy CSRA, an IT firm, for $6.8 billion. CSRA will be integrated into General Dynamics' IT services business unit and will be led by a new division called General Dynamics Information Technology. General Dynamics will also receive credit for receivables and capital leases.\n\nEvent 3: Germany awards Lockheed Martin and Airbus $5.6 Bln Euro drone contract\nLockheed Martin and Airbus have been picked by the German military to produce armed drones for the country's armed forces. The contract is worth $5.6 billion and covers the acquisition of 140 Euro drone systems, which are expected to join the German government's inventory by 2024. The drones will be built in Germany under German security controls in a joint venture with Airbus.\n\nEvent 4: General Dynamics to update Swiss Air Force fleet\nGeneral Dynamics European Land Systems-Spain has been selected by Switzerland as a supplier to modernize its fleet of F/A-18 Hornet fighter jets. The contract is worth $1.32 billion and covers F/A-18 Hornet systems upgrades and"}, {"id": "86236cf3-013f-4a1b-a5ed-438af4927748", "title": "Sayyed Nasrallah Issues Stern Warning :  Israel  Will Run Out of Tanks if It Aggresses Lebanon – Al - Manar TV Lebanon", "date": "2024-07-17 11:30", "url": "https://english.almanar.com.lb/2155320", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "On Wednesday, during the Ashura march commemorating the tenth of Muharram, Sayyed Nasrallah also underscored Yemen’s effectiveness in imposing naval blockades and issued a stern warning to Israel regarding potential aggression against Lebanon.\nFor the first time, Sayyed Nasrallah indicated, the Zionist entity is facing its worst days since its founding.\nSayyed Nasrallah described Israel’s current predicament: “For the first time, Israel is struggling across its army, security services, government, political parties, society, security, and economy.\nConcluding his speech, Sayyed Nasrallah renewed his loyalty to Imam Hussein (peace be upon him), stating, “We have not abandoned you, O Hussein.\nYou know, and the whole world knows, as evidenced by our martyrs, the wounds of our wounded, and our destroyed homes.", "location": "The exact location mentioned in the text is \"Sayyed Nasrallah in Lebanon\".", "classification": "security", "score": 0.5036227440648023, "event_breakdown": "In Lebanon, Hezbollah leader Sayyed Nasrallah emphasized the effectiveness of Yemen's naval blockades and issued a stern warning to Israel regarding potential aggression against Lebanon. Sayyed Nasrallah also noted Israel is facing its worst days since its founding. He concluded by renewing his loyalty to Imam Hussein (PBUH)."}, {"id": "13391a95-7874-4bfe-a0f5-e070a119bbc5", "title": "Former US Sen . Jeff Flake plans to quit as ambassador to Turkey in September", "date": "2024-07-17 06:00", "url": "https://www.yahoo.com/news/former-us-sen-jeff-flake-221342319.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Former US Sen. Jeff Flake plans to quit as ambassador to Turkey in SeptemberJeff Flake, the former U.S. senator from Arizona and current ambassador to Turkey, acknowledged Tuesday he is quitting his post in September.\nFlake arrived in Turkey in January 2022, about six weeks before Russia invaded Ukraine.\nSince then, Turkish President Recep Tayyip Erdogan has walked a delicate line with Russia and the West, forcing both to accept a blurred role for Turkey.\nIn a September interview with The Arizona Republic, Flake joked about the challenge Turkey presents.\nThis article originally appeared on Arizona Republic: Former US Sen. Jeff Flake plans to quit as ambassador to Turkey", "location": "ISTANBUL", "classification": "security", "score": 0.7399552800126233, "event_breakdown": "Current Event 1: China warns relations with US 'ma\nCurrent Event 2: Russia warns relations with US 'ma"}, {"id": "43f7132d-0e29-4dec-aaf5-4e55074db880", "title": "Singapore Army to complete transition to new light machine gun by end - July", "date": "2024-07-17 14:45", "url": "https://www.channelnewsasia.com/singapore/light-machine-gun-saf-colt-infantry-automatic-rifle-replace-saw-ultimax-100-4486041", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SINGAPORE: The Singapore Army will fully transition to a new light machine gun (LMG) by the end of July, the Ministry of Defence (MINDEF) said on Wednesday (Jul 17).\nAll active combat and combat support units will be equipped with and progressively trained on the Colt Infantry Automatic Rifle (IAR) 6940E-SG.\nThe army has progressively introduced the LMG to its soldiers since April, replacing the Singapore-made Section Automatic Weapon (SAW) Ultimax 100 which has been in use since 1982.\nLMGs are infantry support weapons designed for soldiers to deliver suppressive firepower, enabling a squad to move or advance effectively.\nHe described the new LMG as providing “greater operational flexibility and improved ergonomics for our soldiers”.", "location": "SINGAPORE", "classification": "security", "score": 0.45613384378087524, "event_breakdown": "Target event - A new LMG for the Singapore's army\nCurrent event - The Singapore Army will fully transition to a new light machine gun (LMG) by the end of July, replacing the old SAW Ultimax 100 which has been in use since 1982."}, {"id": "7e187fe6-b453-47b2-a3d5-ebacd3e9b9ef", "title": "Ukraine faces twin challenges of fighting Russia and shifting political sands in the US", "date": "2024-07-17 06:30", "url": "https://www.durangoherald.com/articles/ukraine-faces-twin-challenges-of-fighting-russia-and-shifting-political-sands-in-the-us/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "Ukrainian troops are now fighting to check the slow but gradual gains by Russia’s bigger and better-equipped army.\n“The next two or three months are going to be probably the hardest this year for Ukraine,” military analyst Michael Kofman of the Carnegie Endowment said in a recent podcast.\nLurking in the background is another nagging worry for Ukraine: how long will Western political and military support critical for its fight last?\nTo buy time, Ukraine has employed an elastic defense strategy by ceding some territory to wear down Russian troops until Western supplies reach brigades.\nBut, analysts warn, Russia will undoubtedly win a lengthy war of attrition, unless Ukraine can strike using an element of surprise.", "location": "DONETSK", "classification": "security", "score": 0.4344414917909514, "event_breakdown": "Ukrainian troops are now fighting to check the slow but gradual gains by Russia's bigger and better-equipped army.\n\n\"The next two or three months are going to be probably the hardest this year for Ukraine,\" military analyst Michael Kofman of the Carnegie Endowment said in a recent podcast.\n\nLurking in the background is another nagging worry for Ukraine: how long will Western political and military support critical for its fight last?\n\nTo buy time, Ukraine has employed an elastic defense strategy by ceding some territory to wear down Russian troops until Western supplies reach brigades.\n\nBut, analysts warn, Russia will undoubtedly win a lengthy war of attrition, unless Ukraine can strike using an element of surprise."}]