[{"id": "66c9cc64-ed6e-4445-b038-74a5b88e0bce", "title": "MTA members divided over union injection into debate over Israel - Hamas war", "date": "2024-05-18 00:15", "url": "https://www.bostonglobe.com/2024/05/17/metro/mta-anti-semitic-jewish-palestine/", "message": "Garcia’s support for the MTA withered with each new action, as she and other Jewish members repeatedly raised concerns about antisemitism.\nAdvertisementThe division over the Israel-Hamas war is pitting members against one another in the state’s largest teachers union.\nThe MTA is far from being alone in contending with differing viewpoints on the Israel-Hamas war among its members.\nThe MTA first officially waded into the Israel-Hamas war on Nov. 4, when its executive board called for a cease-fire between Israel and Hamas.\nMany Jewish members urged the MTA to scrap the webinar.", "location": "California", "classification": "antisemitism", "score": 0.6700382916622363, "event_breakdown": "Event 1: Garcia's and other Jewish members raised concerns about antisemitism in relation to the MTA's actions.\nEvent 2: Jewish members urged the MTA to scrap a webinar about the Israel-Hamas war.\nEvent 3: The MTA's executive board called for a cease-fire between Israel and Hamas, which divided the members."}, {"id": "76bd1f05-6dc4-43ff-85af-b506a759bf98", "title": "Faith leaders urge UCSD to bar Islamophobic speakers from campus", "date": "2024-05-18 02:15", "url": "https://www.yahoo.com/news/faith-leaders-urge-ucsd-bar-000819144.html", "message": "SAN DIEGO (FOX 5/KUSI) — A coalition of faith leaders gathered at UC San Diego on Friday to call on the university’s administration to do better to address Islamophobia on campus after a student organization hosted a controversial speaker known for anti-Muslim rhetoric.\nThe collective of faith leaders, which included Islamic, Christian and Jewish clergy, described his presence on campus as an exemplar of a larger rise in Islamophobia spurred by the Israel-Hamas war that has made Muslim UCSD students feel unsafe on campus.\n“We are here to tell the UCSD Administration, the chancellor, that these speakers are not welcome,” said Taha Hassane, imam of the Islamic Center of San Diego.\nHundreds of campus community members have also begun to call for Khosla’s resignation over his response to the encampment.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News.", "location": "SAN DIEGO (FOX 5/KUSI) — A coalition of faith leaders", "classification": "antisemitism", "score": 0.8677249379219478, "event_breakdown": ".\n* A Muslim student organization hosted a controversial speaker known for anti-Muslim rhetoric at UCSD.\n* A coalition of faith leaders gathered at UCSD to express concerns about the speaker's presence on campus and call on the administration to address this issue.\n* Anti-Semitism events related to the speaker included him making anti-Muslim comments and using derogatory language toward Jewish students.\n* Chancellor Khosla's response to the encampment on campus is being criticized by campus community members, some of whom are calling for his resignation."}, {"id": "b65efeae-1460-4774-a6e8-8dde7a9ab27b", "title": "College Professors Are Being Fired for Activism on Gaza War", "date": "2024-05-18 04:45", "url": "https://theintercept.com/2024/05/16/university-college-professors-israel-palestine-firing/", "message": "That’s because many of the professors most supportive of Palestine don’t have jobs anymore.\nFrom campus to campus, professors have defended students’ right to protest, but when scholars themselves espouse support for Palestine and opposition to the Israeli state, professional consequences have frequently been grave.\nBy and large, professors facing job loss and suspensions over Palestine have brought these allegations into public view by speaking out themselves.\nAll of them have been in support of the Palestinian cause.”We are at the dawn of a “new McCarthyism,” Levy said.\nIn the last months, school administrators called in riot cops to clear student encampments and arrest thousands at Columbia University, City College of New York, Emerson College, Emory University, New York University, the University of Austin at Texas, and more.", "location": "Based on the text, I did not find a specific location for the event described.", "classification": "antisemitism", "score": 0.9257411624988876, "event_breakdown": "Antisemitism events:\n1. Call for Boycott, Divestment, and Sanctions (BDS) to pressure Israel into ending the occupation of Palestinian land and to grant equality to Palestinian citizens.\n2. Report criticizing the anti-Israeli occupation policies on college campuses in a speech by a professor.\n3. Suspension and firing of professors for their anti-Israel stance.\n4. Riot police clearing student encampment on university campuses and arresting thousands of students.\n5. Calling for a campaign against the Israeli State of Israel and to promote its downfall."}, {"id": "67cd054a-217e-4d89-802c-89be4117e6aa", "title": "Rudy Rochman , Oct . 7 survivors tell their story to London Jewry", "date": "2024-05-18 08:15", "url": "https://www.jpost.com/israel-hamas-war/article-801619", "message": "Rudy Rochman, a Jewish rights activist with a large social media following, facilitated a conversation between two October 7 survivors and a group of young professionals in London on Wednesday.\nThe event, organized by the Jewish Learning Exchange (JLE), was attended by 250 young professionals who heard from husband and wife October 7 survivors, Shaled and Yifrat Porat.\nWhile Shaked fought off the terrorists, Yafet and their three children closed themselves in their home’s shelter.\nIt is this feeling of togetherness that has kept us going as a nation, and we feel it here tonight in London, too.\nFighting antisemitism on campusRochman also spoke with Sacha Johnstone, JLE Young Professional Consultant, and discussed the mass student protests and “encampments” at Columbia and New York Universities.", "location": "LONDON", "classification": "antisemitism", "score": 0.8509203954309412, "event_breakdown": "Event: Jewish rights activist Rudy Rochman facilitated a conversation between two October 7 survivors and a group of young professionals in London on Wednesday.\nEvent: The event, organized by the Jewish Learning Exchange (JLE), was attended by 250 young professionals who heard from husband and wife October 7 survivors, Shaled and Yifrat Porat.\nEvent: Rudy Rochman spoke with Sacha Johnstone, JLE Young Professional Consultant, and discussed the mass student protests and “encampments” at Columbia and New York Universities."}, {"id": "46f2d871-4c73-43c4-85e9-e6db818930d7", "title": "Jewish students fear grad disruptions , dont feel safe on campus : poll", "date": "2024-05-18 18:00", "url": "https://nypost.com/2024/05/18/us-news/jewish-students-fear-grad-disruptions-dont-feel-safe-on-campus-poll/", "message": "Anti-Israel protests on campuses have left a majority of Jewish students feeling less safe at school, with 40% saying they feel they must hide their Jewish identities, a new survey found.\nHillel International, a Jewish campus organization, polled 310 students across the country and found four in 10 admitted to hiding their Jewish identities on campus and 32% have been too afraid to attend religious events.\n6 Forty percent of the students polled have felt the need to hide their Jewish identity from others on campus.\nJames Keivom6 Some Jewish students even reported not wanting to return to campus next fall.\n“Jewish students, and all students, deserve to pursue their education and celebrate their graduations free from disruption, antisemitism, and hate,” said Adam Lehman, president and CEO of Hillel.", "location": "The survey found that 40% of Hillel's 310 students polled had felt the need to hide", "classification": "antisemitism", "score": 0.9725924867349366, "event_breakdown": "- Hillel International conducted a poll and found that 40% of Jewish students are hiding their identity.\n- According to the poll, 32% of students are afraid to attend religious events.\n- One student said, “I don't answer to my name in my community anymore'."}]