[{"id": "dc239d7e-c098-4dc3-b1fd-cd2ecf2e6ffc", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 03:30", "url": "https://www.yahoo.com/news/cargo-ship-hit-missile-gulf-022827213.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MANAMA, Bahrain (AP) — A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "NULL", "classification": "security", "score": 0.526858316898216, "event_breakdown": "Gulf of Aden, Yemen - a cargo ship in the Gulf of Aden was hit by a missile attack from Yemen's Houthi rebels; damage control underway."}, {"id": "59a8d30a-0617-49eb-858f-499ff205b941", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels", "date": "2024-06-09 03:45", "url": "https://abcnews.go.com/International/wireStory/cargo-ship-hit-missile-gulf-aden-suspected-attack-110960108", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A missile attack by Yemen’s Houthi rebels has hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of AdenMANAMA, Bahrain -- A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe missile hit the ship's forward station late Saturday, starting a fire that those on board later put out, the private security firm Ambrey said.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.", "location": ".\nThe Gulf of Aden.", "classification": "security", "score": 0.5337342163142332, "event_breakdown": "Target event Missile attack by Yemen's Houthi rebels hits an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden"}, {"id": "1dbe0d23-d280-4c85-b43a-8399297f6d35", "title": "Israeli Airstrike Kills Two In Lebanon", "date": "2024-06-09 06:45", "url": "https://menafn.com/1108311328/Israeli-Airstrike-Kills-Two-In-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Two people were killed on Saturday in an Israeli on the outskirts of the southern Lebanese town of Aitaroun, Lebanon's state news agency NNA said.\nThe Israeli military said in a statement that its had identified a Hezbollah fighter in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.\nIsraeli forces launched two missiles targeting a cafe at a station, causing significant damage to the premises and to the surrounding area, NNA said.\nA security source told Reuters it was the first time the group used that model of rockets, having used the Falaq 1 previously.\nIsrael Defence Forces (IDF)“identified a Hezbollah fighter in the area of Aitaroun in southern Lebanon, and shortly afterward an IAF aircraft struck the fighter,” the Israeli military said in a statement.", "location": "Aitaroun", "classification": "security", "score": 0.9504135083802357, "event_breakdown": "Two killed in Israeli airstrike on the outskirts of Aitaroun, Lebanon, near Israel's border. Israeli military said it identified a Hezbollah fighter in area near Aitaroun, and later struck the individual."}, {"id": "0cca05d0-83ac-4b00-9bb9-8fa379e42552", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 06:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/09/fgn3-yemen-houthi-ship-attack.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Jun 9 (AP) A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported an attack late Saturday in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "GULF OF ADEN", "classification": "security", "score": 0.8742869522559613, "event_breakdown": "Target event:\nA missile hit an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said."}, {"id": "52371113-a178-4b90-9f8c-9a17c6ed7991", "title": "4 killed , 5 injured in Israeli airstrikes in Lebanon", "date": "2024-06-09 07:45", "url": "https://www.thestatesman.com/world/4-killed-5-injured-in-israeli-airstrikes-in-lebanon-1503308214.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9955627243273759, "event_breakdown": "Israeli airstrikes on villages in southern Lebanon."}, {"id": "100e333d-3e11-4110-acff-9ecb6d3f749f", "title": "Houthis claim latest cargo ship attack in the Gulf of Aden", "date": "2024-06-09 14:00", "url": "https://www.ctvnews.ca/world/yemen-houthi-rebels-claim-latest-attack-on-cargo-ship-in-the-gulf-of-aden-1.6919516", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Manama, Bahrain -A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.526858316898216, "event_breakdown": "Target event - Security: Houthi rebels from the Iran-aligned al-Masirah television channel in Yemen claimed a rocket attack against the oil tanker \"Limburg,\" a key Saudi Arabian \"oil target.\"\nSecurity: U.S. Central Command said two incidents occurred in the Gulf of Oman Thursday morning. According to U.S. Navy Forces Central Command, a Navy ship fired warning shots when vessels from Iran's Islamic Revolutionary Guard Corps Navy approached the American ship in international waters near, the Strait of Hormuz."}, {"id": "12568cfb-5441-4a59-9155-0b40c7b54564", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt | iNFOnews", "date": "2024-06-09 04:15", "url": "https://infotel.ca/newsitem/ml-mideast-tensions/cp1669742662", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Yemen Houthi rebels claim latest attack on cargo ship in the Gulf of AdenThis is a locator map for Yemen with its capital, Sanaa.\n(AP Photo)Original Publication Date June 08, 2024 - 7:31 PMMANAMA, Bahrain (AP) — A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "NULL", "classification": "security", "score": 0.7198450160150771, "event_breakdown": "Target event - Event reported by AP news in text that relates to a security issue, and which also has a specific location that can be placed on a map.\nYemeni Houthi rebels claim latest attack on cargo ship in the Gulf of Aden."}, {"id": "1c9dc16d-7593-424e-84f6-1c49abf41880", "title": "Yemen Houthi rebels claim latest attack on cargo ship in the Gulf of Aden | World News", "date": "2024-06-09 15:15", "url": "https://indianexpress.com/article/world/yemen-houthi-rebels-claim-latest-attack-cargo-ship-gulf-aden-9381779/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations centre similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nHe identified the vessel as the Norderney, a ship that tracking data analysed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "GULF OF ADEN", "classification": "security", "score": 0.790215980855163, "event_breakdown": "1. A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, in the latest assault on shipping in the region.\n2. The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank."}, {"id": "c5f66d20-1e80-41d4-b748-d2cc84cad4b8", "title": "Two killed , fires rage in Lebanon after Israeli strikes - Newspaper", "date": "2024-06-09 03:45", "url": "https://www.dawn.com/news/1838745/two-killed-fires-rage-in-lebanon-after-israeli-strikes", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza conflict began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "location": "Lebanon", "classification": "security", "score": 0.95005503469555, "event_breakdown": "Israel-Lebanon Border, Hezbollah, Saturday, June 18, 2022, Death toll rises, new attacks in southern Lebanon, 2022 Israeli military operation."}, {"id": "3198f14f-9dd4-4604-9107-0b85e8df50fd", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:30", "url": "https://www.mymotherlode.com/news/middle-east/3372100/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Yemen Houthi rebels claim latest attack on cargo ship in the Gulf of Aden View PhotoMANAMA, Bahrain (AP) — A missile attack by Yemen’s Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military’s United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.”Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nSaree also claimed unreported attacks on a warship and another vessel in the Arabian Sea, without providing any evidence to support his claim.", "location": "GULF OF ADEN", "classification": "security", "score": 0.6114552113897549, "event_breakdown": "Yemen Houthi rebels claim latest attack on cargo ship in the Gulf of Aden"}, {"id": "377b9b49-7044-4d01-9ade-6c4d1afc7bc5", "title": "1 dead , multiple injured after shooting and stabbing at Lake Berryessa , Napa County Sheriff says", "date": "2024-06-09 06:15", "url": "https://abc7news.com/post/1-dead-multiple-injured-after-shooting-stabbing-lake/14927183/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "1 dead, multiple injured after shooting and stabbing at Lake Berryessa, Napa Co. sheriff saysOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nNAPA COUNTY, Calif. (KGO) -- One person is dead and multiple people are injured after a shooting and stabbing at the Oak Shore Day Use area of Lake Berryessa on Saturday, the Napa County Sheriff's Office said.", "location": "in english\nLake Berryessa", "classification": "security", "score": 0.6792082014186058, "event_breakdown": "One person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa in Napa County on Saturday, according to the Napa County Sheriff's Office."}, {"id": "f80dbde0-cc4a-4498-8afc-55d36764fc96", "title": "Hezbollah launches drone strike against Israeli artillery position in Shebaa Farms", "date": "2024-06-09 05:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240608-presstv11.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah launches drone strike against Israeli artillery position in Shebaa FarmsIran Press TVSaturday, 08 June 2024 10:20 AMFighters from Lebanon's Hezbollah resistance movement have launched a retaliatory drone strike against an Israeli artillery position in the occupied Shebaa Farms in response to the regime's ongoing war on Gaza.\nEarlier in the day, Hezbollah fighters targeted a group of Israeli soldiers, who had moved into the al-Raheb military base, with a salvo of artillery shells.\nOn Friday evening, the Lebanese resistance group struck a gathering of Israeli soldiers in the al-Tayhat Triangle region with a barrage of rockets.\nHezbollah fighters also launched a rocket barrage at Israeli troops stationed in an area at Netu'a Forest and targeted an Israeli military vehicle at the Birkat Risha outpost.\nPreviously, the group had pounded Israeli artillery bunkers in the Khirbet Maar base and a group of Israeli troops deployed nearby with artillery shells.", "location": "SHEBAA FARMS", "classification": "security", "score": 0.9884992547658528, "event_breakdown": "New event: Hezbollah launches drone strike against Israeli artillery position in Shebaa Farms."}, {"id": "cd04ab41-ea34-4760-909e-cfd50095fd86", "title": "4 killed , 5 injured in Israeli airstrikes in Lebanon | Central India Premier English Daily", "date": "2024-06-09 10:00", "url": "https://www.centralchronicle.com/4-killed-5-injured-in-israeli-airstrikes-in-lebanon/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Beirut, June 9 (UNI) Four people, including two Hezbollah members, were killed, and five others were injured on Saturday in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told Xinhua.\nThe sources, who spoke anonymously, said that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.997692549292322, "event_breakdown": "Location: Houla, southern Lebanon\nDescription: An Israeli warplane targeted a house in Houla, killing two Hezbollah members and injuring three civilians."}, {"id": "2ee3902a-2afe-4c3e-a27f-3ade6b9d96d9", "title": "Syrian Arrested After Shooting Near US Embassy In Beirut", "date": "2024-06-09 06:45", "url": "https://menafn.com/1108311426/Syrian-Arrested-After-Shooting-Near-US-Embassy-In-Beirut-Army", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)(MENAFN- Jordan Times) BEIRUT - A Syrian was arrested after a shooting near the US embassy in Beirut on Wednesday, the Lebanese said, with the embassy saying its staff were safe.\nThe embassy, in the northern suburb of Awkar, \"was subjected to gunfire by a person holding Syrian nationality\", the army said in a statement on X, formerly Twitter.\n\"Thanks to the quick reaction\" of the Lebanese army, security forces \"and our embassy security team, our facility and our team are safe\", it said on X.\nAn AFP photographer said access to the area around the embassy was blocked off, with a heavy army deployment in the area.\nA judicial source told AFP that security forces were combing wooded areas near the embassy for any accomplices, adding that the shooter's wounds were \"serious\".", "location": "BEIRUT.", "classification": "security", "score": 0.8768240961478099, "event_breakdown": "Syrian arrested on Wednesday after shooting near US embassy in Beirut, Lebanon\nThe Lebanese army said Wednesday that a Syrian had been arrested after a shooting near the US embassy in Beirut. The embassy said its staff were safe, and reported a heavy army deployment near the embassy."}, {"id": "13b0d8c4-5bb3-4e74-b43b-182d4beb2596", "title": "Murder charge after man stabbed in street dies", "date": "2024-06-09 11:00", "url": "https://www.yahoo.com/news/murder-charge-man-stabbed-street-100339275.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Police were called to Bradford Street in Bolton on Friday evening [PA Media]A man has been charged with murder by police investigating a fatal stabbing.\nThe attack happened on Bradford Street in Bolton at about 19:15 BST on Friday.\nPaul Simmons, 48, of Bradford Street, Bolton has been charged with murder.\nA 31-year-old man, of no fixed address, has been charged with assisting an offender, while a woman aged 37, also of no fixed address, has been charged with obstructing police.\nListen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X and Instagram.", "location": "Bolton", "classification": "security", "score": 0.4337247058349234, "event_breakdown": "Man charged with murder after fatal stabbing in Bolton"}, {"id": "c07e10f5-6c45-492e-a175-07dea747d3b5", "title": "Israel pummels refugee camps in Gaza - World", "date": "2024-06-09 08:30", "url": "https://www.dawn.com/news/1838764/israel-pummels-refugee-camps-in-gaza", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "The onslaught persisted, despite scrutiny on Israel after its warplanes carried out an attack on a UN-run school that a Gaza hospital said killed at least 37 people.\nThe Israeli military acknowledged it conducted the strike on the Nuseirat refugee camp, saying it targeted “terrorists”.\nThe UN agency for Palestinian refugees that ran the school, condemned Israel for striking the facility housing 6,000 displaced people.\nThe war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Palestinian health ministry.\nMeanwhile, in a new diplomatic push, US Secretary of State Antony Blinken is set to visit Israel, Egypt, Jordan and Qatar from Monday.", "location": "GAZA", "classification": "security", "score": 0.861122503005765, "event_breakdown": "Current events of security reported in text that can be placed on a map are:\nIsrael air strikes on Gaza hit a UN-run school in the Nuseirat refugee camp, killing 37 people.\nUS Secretary of State Antony Blinken is set to visit Israel, Egypt, Jordan and Qatar from Monday in a bid to end the war between Israel and Gaza."}, {"id": "68147df3-58dc-47da-9687-54445e622091", "title": "Ukraine says it struck one of Russia most advanced warplanes - Boston News , Weather , Sports", "date": "2024-06-09 14:00", "url": "https://whdh.com/news/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "In one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia’s Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia’s southern border regions, according to local Russian officials.\nThe easing of restrictions on the use of Western weapons will help Ukraine protect Kharkiv by targeting Russian capabilities across the border.", "location": "Akhtubinsk", "classification": "security", "score": 0.8154848607071734, "event_breakdown": "Location: Akhtubinsk, Astrakhan region, Russia\nDrones targeted and destroyed Russian aircraft at an airfield in Russia's Astrakhan region."}, {"id": "1c5a0741-9b11-43fd-a07b-97795753f026", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 06:15", "url": "https://www.canberratimes.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, Israel, West Bank"}, {"id": "22729bc6-0390-4c63-a893-9124bb4b208b", "title": "Deputy shoots knife - wielding man in Jurupa Valley", "date": "2024-06-09 04:00", "url": "https://www.foxla.com/news/deputy-shoots-knife-wielding-man-jurupa-valley", "domain": "foxla.com", "domain_classification": "Unknown", "message": "JURUPA VALLEY, Calif. — A Riverside County Deputy shot a knife-wielding man during a welfare check in Jurupa Valley Saturday morning, according to deputies.\nThat's when the department said the man came at a deputy with the knife, and the deputy shot him.\nSUGGESTED: LASD deputy shot in back while sitting at traffic light; suspect arrestedNo other details were immediately available.\nThe man has not been identified, and the deputy who shot him has been placed on paid administrative leave.\nThe Riverside County District Attorney's Office and the Riverside Sheriff's Force Investigations Detail are investigating the shooting.", "location": "JURUPA VALLEY, California.", "classification": "security", "score": 0.8840032774069326, "event_breakdown": "JURUPA VALLEY, Calif. -- A Riverside County Deputy shot a knife-wielding man during a welfare check in Jurupa Valley Saturday morning, according to deputies. That's when the department said the man came at a deputy with the knife, and the deputy shot him. No other details were immediately available. The man has not been identified, and the deputy who shot him has been placed on paid administrative leave. The Riverside County District Attorney's Office and the Riverside Sheriff's Force Investigations Detail are investigating the shooting."}, {"id": "91d6b17a-1a05-422c-ad73-824468a736b6", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 04:00", "url": "https://www.bssnews.net/news/194108", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "LONDON, June 9, 2024 (BSS/AFP) - An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n\"No injuries were reported,\" the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen's Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "location": "NULL", "classification": "security", "score": 0.7937485677140395, "event_breakdown": "Location: Gulf of Aden\nDate: June 9, 2024\nDescription: An Antigua and Barbuda-flagged cargo ship was hit by a missile off the coast of Yemen. The cargo ship was heading southwest along the Gulf of Aden at a speed of 8.2 kts when the forward station was struck by a missile. No injuries were reported."}, {"id": "fcb14e55-bc56-470f-a9f6-001362b604f0", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-09 03:15", "url": "https://www.newstalkzb.co.nz/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say/", "domain": "newstalkzb.co.nz", "domain_classification": "Unknown", "message": "Russian-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nEmergency Ministry employees carry a wounded person from the side of the damaged apartment building following Friday's Ukrainian missile attack on Luhansk, the capital of Russian-controlled Luhansk region, eastern Ukraine.\nUkrainian air defence overnight shot down nine out of 13 Russian drones over the central Poltava region, southeastern Zaporizhzhia and Dnipropetrovsk regions, and the Kharkiv region in the northeast, Ukraine’s air force said.\nUkrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8349334761729054, "event_breakdown": "Current Events of Security Reported in the Text that Can be Placed on a Map:\n\nThe World Health Organization (WHO) warned of a potential humanitarian catastrophe as the situation in Ukraine worsens, with up to 18 million people at risk of food insecurity, and said that Ukrainians are being forced to drink water from rivers that could be contaminated with sewage and dead bodies. (Source: Ukraine war: ‘Catastrophic’ food crisis feared for 18m as river water supply contaminated by sewage and bodies, The Independent)\n\nThe Pakistani ambassador to the United Nations, Munir Akram, said that the “closure of borders” and “security concerns” would stop land evacuations from Afghanistan. According to Ambassador Akram, Afghanistan is facing a serious humanitarian crisis, which needs to be addressed on a global scale. (Source: Pakistan warns of ‘humanitarian crisis’ in Afghanistan, Al Jazeera English)"}, {"id": "acfe82bd-6b10-4556-b95c-a018cd200745", "title": "Conspiracy theorist blew up Virginia house on purpose last year , shocking new body cam footage shows", "date": "2024-06-09 05:45", "url": "https://nypost.com/2024/06/09/us-news/conspiracy-theorist-blew-up-virginia-house-on-purpose-last-year-shocking-new-body-cam-footage-shows/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A conspiracy theorist purposefully blew up his Virginia home while authorities were trying to serve a search warrant in December, according to a new video released by law enforcement.\nOn December 4, a patrol officer was in the area when he heard what sounded like gunshots, officials said.\nHe ran into children at a nearby park who told him they were “scared,” body cam footage shows.\nSeveral gunshots were heard from inside the home and officers at the scene can be ducking for cover.\nPolice then deployed tear gas inside the home in the hopes Yoo would finally give up, but to no avail.", "location": "Virginia", "classification": "security", "score": 0.8664409602677274, "event_breakdown": "Event: A conspiracy theorist purposefully blew up his Virginia home while authorities were trying to serve a search warrant in December, according to a new video released by law enforcement.\nLocation: Virginia"}, {"id": "d57d7c14-943f-4092-8a93-95af7ce6b488", "title": "Five Somali soldiers and 47 Al - Shabaab militants killed north of Mogadishu", "date": "2024-06-09 08:30", "url": "https://www.albawaba.com/news/five-somali-soldiers-and-47-al-shabaab-1571466", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA- The Somali government announced that five soldiers were killed in an Al-Shabaab attack approximately 350 kilometers north of Mogadishu.\nThe government stated that its forces received intelligence about a planned attack in the Seldir area and set up an ambush for the militants.\nDuring the ensuing clashes in the Galgadud region, north of the capital, at least 47 Al-Shabaab militants were killed alongside the five soldiers, according to government authorities.\nLocal resident, Mohamed Hussein reported to AFP, \"There was intense fighting in Seldir this morning after Al-Shabaab attacked from multiple directions.\nOn May 26, 2023, Al-Shabaab attacked a base in Bulo Marer, occupied by Ugandan soldiers from the African Union force, resulting in the deaths of at least 54 soldiers according to Ugandan authorities.", "location": "Mogadishu", "classification": "security", "score": 0.9686302412776983, "event_breakdown": "Five Somali soldiers were killed in an Al-Shabaab attack approximately 350 kilometers north of Mogadishu in the Galgadud region. Local resident Mohamed Hussein reported to AFP that there was intense fighting in Seldir after the militant group attacked from multiple directions. Fifty-seven Al-Shabaab militants and 5 Somali soldiers were killed in the battle."}, {"id": "52a86313-1336-4bc1-96bd-50a082902c6b", "title": "Admission of guilt marks anniversary of NSU attack in Germany", "date": "2024-06-09 15:30", "url": "https://www.dailysabah.com/politics/admission-of-guilt-marks-anniversary-of-nsu-attack-in-germany/news", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Keup Street in Cologne, home to a vibrant Turkish community, was rocked by a nail bomb attack on June 9, 2004.\nVictims of the bombing, which wounded 22 people, were remembered on Sunday in a high-profile ceremony.\nIn 1993, five members of a family of Turkish descent were killed when far-right extremists set their home in Solingen on fire.\nIn an article he penned ahead of Keup Street bombing anniversary, Hendrik Wüst, president of North Rhine-Westphalia, apologized to those wrongly implicated in the bombing.\nThe unnamed woman was linked to the Swiss neo-Nazi scene, far-right extremist groups Blood and Honor and Combat 18.", "location": ")\nCologne", "classification": "security", "score": 0.9885678145337127, "event_breakdown": "Cologne, Germany\nKeup Street bombing, June 9, 2004 - A nail bomb attack rocked Keup Street in Cologne, home to a vibrant Turkish community, wounding 22 people.\nVictims of the bombing were remembered on Sunday in a high-profile ceremony."}, {"id": "cd7eb1a0-3fc9-4bf0-bdb3-eb7a0766f1d7", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 05:45", "url": "https://www.bostonglobe.com/2024/06/08/world/cargo-ship-hit-by-missile-gulf-aden-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying “damage control is underway.\"\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "location": "ADEN.", "classification": "security", "score": 0.8909156981103774, "event_breakdown": "Location: Gulf of Aden\nDate: January 30, 2022\nHouthi rebels in Yemen fired a missile at and struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in an attack suspected to have been carried out by Houthi rebels in Yemen, authorities said. The missile hit the forward station of Comoros-flagged cargo ship, Flagged, which caused a fire that was put out by the fire-extinguishing system of the target.\nNo one was harmed in the attack. Some unconfirmed sources suggested that the people were on a small boat and opened fire at the carcahir during the attack.\nMore info:\nThe target ship was one of three ships that had departed the neighboring African country of Somalia for Yemen in what appeared to be an attempt to violate the international trade system by arms smugglers from Iran.\nThe type of missile used is not clear, but the Houthis have previously been known to have used short-ranged Khalij Fars coastal missiles. These missiles are believed to have been obtained in the Saudi-led coalition’s attempts to defeat the Houthis in the two years of of the war in Yemen.\nAmbrey, the private security firm, which raquired news of the attack, said that the reason the ships were attacked by the Houthis was likely, among other things, because they are operated by Saudi company Bahri, and a previous cargo consignment fell into Houthi hands.\nThe location of the collision is between Yemen and the Arabian Peninsula, and has in the past been a target for attacks from Houthi rebels or Yemeni forces allied with Riyadh."}, {"id": "5bd87dc2-85c9-4a9c-b338-546b03cd7b4a", "title": "Ambulance hit in Kherson Oblast : Russian grenade attack wounds medical team", "date": "2024-06-09 15:30", "url": "https://www.yahoo.com/news/ambulance-hit-kherson-oblast-russian-143700146.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russians drop explosives from UAV on ambulance in Kherson OblastRussian forces dropped explosives on an ambulance that was responding to a call after a shelling in Kherson Oblast on the evening of June 8, regional governor Oleksandr Prokudin reported on Telegram.\nОлександр Прокудін/TelegramAs a result of the attack, the driver and paramedic of the medical team were injured.\nRead also: Russia destroys another Epicentr hypermarket in Kherson – Photo\"The occupiers dropped explosives on a medical team that was rushing to a call after the shelling in the Bilozerka municipality,\" he wrote.\nToday, a paramedic of the medical team also turned to the hospital for help.\nThe victim was diagnosed with concussion.”Read also: Russia kills one, injures another after shelling KhersonKherson Oblast suffers daily from attacks by the Russian army.", "location": "KHerson Oblast", "classification": "security", "score": 0.607425425102643, "event_breakdown": "Russian forces drop explosives on ambulance in Kherson Oblast - A medical team was attacked in Kherson Oblast by the Russian army. As a result, the driver and paramedic of the team were injured."}, {"id": "13e5a349-ac95-4abf-8f4c-62b72f7dd7aa", "title": "Mette Frederiksen : All On Polish Man Who Attacked Denmark PM", "date": "2024-06-09 02:00", "url": "https://www.timesnownews.com/world/europe/mette-frederiksen-all-on-polish-man-who-attacked-denmarks-prime-minister-article-110829698", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "Photo : TwitterA 39-year-old Polish man was remanded in custody for 12 days on Saturday following an assault on Danish Prime Minister Mette Frederiksen , which occurred the previous day.\nThe prime minister was hit by the suspect as he approached him in Copenhagen's downtown center.\nIt's incredibly touching,\" Frederiksen told Ritzau news agency in a written statement.\nA representative told Polish state radio, \"Danish authorities have informed us that the person detained is a Polish citizen, who has been staying in Denmark for some time.\"\nThis event happened shortly after Slovakia's Prime Minister Robert Fico was the target of a botched assassination attempt that left him gravely injured.", "location": "Copenhagen", "classification": "security", "score": 0.5041576527531284, "event_breakdown": "Title: Polish man remanded in custody for assaulting Danish Prime Minister\n\nDescription: A 39-year-old Polish man was remanded in custody for 12 days on Saturday after reportedly assaulting Danish Prime Minister Mette Frederiksen in downtown Copenhagen the previous day. The prime minister was hit by the suspect as he approached him. Police arrested the man.\n\nTarget: Prime Minister Mette Frederiksen"}, {"id": "0a9c2e16-484c-461f-a86b-b82e6ccb2fa3", "title": "2 cargo ships caught fire after being hit by projectiles in suspected Houthi attacks off the coast of Yemen", "date": "2024-06-09 12:30", "url": "https://www.yahoo.com/news/2-cargo-ships-caught-fire-102615889.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "2 cargo ships caught fire after being hit by projectiles in suspected Houthi attacks off the coast of YemenTwo cargo ships sailing near Yemen caught fire after being hit by projectiles.\nThe missiles are suspected to have been fired by Houthi rebels.\nTwo cargo ships traveling off Yemen's southern port city of Aden caught fire after being hit by projectiles suspected to have been fired by Houthi rebels, UK maritime agencies reported.\nThe ship caught fire but it was contained.\nOn Monday, the Houthi rebels said they had fired a new solid-fuel missile called the \"Palestine\" at the southern Israeli city of Eilat on Monday.", "location": "The most relevant location to the event would be Yemen.", "classification": "security", "score": 0.9842897125133663, "event_breakdown": "[\n\"On Monday, the Houthi rebels said they had fired a new solid-fuel missile at the southern Israeli city of Eilat.\",\n\"Two cargo ships traveling off Yemen's southern port city of Aden caught fire after being hit by projectiles suspected to have been fired by Houthi rebels.\"\n]"}, {"id": "b3d6c924-cb9e-4ae9-a9bd-89f78d5af712", "title": "Man dies in London after he was stabbed multiple times | united kingdom News", "date": "2024-06-09 09:45", "url": "https://metro.co.uk/2024/06/09/man-dies-london-stabbed-multiple-times-20999052/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Two men have been arrested after a man was stabbed to death in south-east London (Picture: UKNIP)A 21-year-old has died after he was stabbed repeatedly in a ‘brutal’ attack on a London street.\nDespite the efforts of emergency service workers, Mr Robinson sadly died at the scene at Carteret Way in Deptford.\nTwo men have been arrested on suspicion of murder, with a 50-year-old man released on bail, while a 44-year-old remains in custody.\nSpeaking with News Shopper, one local woman said she was ‘not really surprised’ to see news of a fatal crime.\n‘A young man has died in brutal circumstances and his family are grieving.", "location": "Deptford, London", "classification": "security", "score": 0.5187326980145929, "event_breakdown": "Location: The New Road, Deptford, London, UK\nEvent: A 21-year-old has been stabbed to death in southeast London. Two men have been arrested. A 50-year-old man has been released on bail, and a 44-year-old remains in custody."}, {"id": "f6c3ede0-87a8-4467-acba-705a9cde3d37", "title": "  This horror must stop : More than 200 killed as Israel rescues four Gaza hostages", "date": "2024-06-09 10:45", "url": "https://gulfnews.com/world/mena/this-horror-must-stop-more-than-200-killed-as-israel-rescues-four-gaza-hostages-1.103029182", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "GAZA STRIP: sraelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\nFinancial newspaper Calcalist hailed a “heroic operation” that had given Israelis “a few hours of grace”, while the left-leaning Haaretz daily called the rescue operation a “morale boost” for the nation.\nRenewed clashesHamas’s Ezzedine Al Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday’s rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nAmid the death and suffering, Israel has faced growing diplomatic isolation, with international court cases accusing it of war crimes.", "location": "GAZA STRIP", "classification": "security", "score": 0.8797103563683701, "event_breakdown": "Gaza Strip: sraelis cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during a daytime."}, {"id": "379c6564-f49f-4026-b178-162a8f933d09", "title": "Roadside bomb in northwestern Pakistan kills 7 soldiers", "date": "2024-06-09 15:00", "url": "https://www.voanews.com/a/roadside-bomb-in-northwestern-pakistan-kills-six-soldiers/7648696.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Pakistani authorities said Sunday that a bomb blast targeted a military convoy in a militancy-hit northwestern region, killing at least seven soldiers.\nThe violence is claimed by Tehrik-i-Taliban Pakistan, or TTP, a globally designated terrorist organization, which Pakistani officials say is headquartered in Afghanistan.\nThe group has waged terrorist attacks in the country for years, killing thousands of Pakistani civilians and security forces.\nIt stated that Pakistani security forces had killed nearly 120 “terrorists” and arrested 300 others in military-led counterinsurgency operations during the same period.\nThe military has separately reported the fatalities of dozens of its personnel in bomb attacks and militant ambushes.", "location": "Khyber Pakhtunkhwa, Pakistan", "classification": "security", "score": 0.9903335089458326, "event_breakdown": "Bomb blast targets military convoy in northwestern Pakistan, killing at least seven soldiers."}, {"id": "279d749a-b58c-482f-afe0-122fea43b5f0", "title": "Two dead , fires in south Lebanon after Israeli strikes state media", "date": "2024-06-09 01:45", "url": "http://www.jordantimes.com/news/region/two-dead-fires-south-lebanon-after-israeli-strikes-%E2%80%94-state-media", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "The deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe Shiite Muslim movement later announced that one of its fighters was killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\nLebanese authorities and several international rights groups have accused Israel of using white phosphorus rounds in its strikes on its northern neighbour.\nA security source told AFP on condition of anonymity that fires broke out near military positions but have not reached them or caused any casualties.", "location": "Israel", "classification": "security", "score": 0.9424365729928811, "event_breakdown": "Shiite Muslim movement Hezbollah announced that one of its fighters was killed by Israeli fire on Monday. The Israeli military said it had conducted strikes on Hezbollah targets in Lebanon after troops came under fire during a routine operation along the border between the two countries. A security source told AFP on condition of anonymity that fires had broken out near military positions but had not reached them or caused any casualties."}, {"id": "7cf6178a-f5d0-4c81-9571-b8b20e11904a", "title": "How Israel operation to rescue four hostages from Gaza unfolded", "date": "2024-06-09 06:15", "url": "https://www.cnn.com/2024/06/09/middleeast/israel-hostage-rescue-gaza-intl-hnk/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Four hostages have been rescued in an Israeli operation that took weeks of planning – but killed scores of Palestinians in Gaza and left behind a trail of devastation.\nHagari said Israeli forces had to enter civilian areas to reach hostages as this was where Hamas had embedded itself.\nOne officer was shot and killed during the operation, according to Israeli police.\n“While under fire, under fire inside the buildings, under fire on the way out from Gaza, our forces rescued our hostages,” he said.\nMore than 100 hostages were freed under a temporary truce last year, while Israel has rescued seven hostages by military means.", "location": "GAZA", "classification": "security", "score": 0.991966713254453, "event_breakdown": "Israeli operation in Gaza successfully rescues four hostages, scores Palestinians killed, trail of devastation in Gaza, one Israeli officer was shot and killed during the operation."}, {"id": "440752d3-90e1-485e-9aee-858f494c9cba", "title": "How Israel operation to rescue four hostages from Gaza unfolded", "date": "2024-06-09 09:45", "url": "https://us.cnn.com/2024/06/09/middleeast/israel-hostage-rescue-gaza-intl-hnk/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Four hostages have been rescued in an Israeli operation that took weeks of planning – but killed scores of Palestinians in Gaza and left behind a trail of devastation.\nHagari said Israeli forces had to enter civilian areas to reach hostages as this was where Hamas had embedded itself.\nOne officer was shot and killed during the operation, according to Israeli police.\n“While under fire, under fire inside the buildings, under fire on the way out from Gaza, our forces rescued our hostages,” he said.\nMore than 100 hostages were freed under a temporary truce last year, while Israel has rescued seven hostages by military means.", "location": "Gaza", "classification": "security", "score": 0.991966713254453, "event_breakdown": "Hostage situation in Israel - Militants in Gaza reportedly took hostages held by Hamas, an Israeli security operation rescued the hostages and killed scores of Palestinians, leaving a trail of devastation."}, {"id": "3264e095-5025-4b72-915a-218a1eee8244", "title": "MBI investigating officer - involved shooting in Corinth", "date": "2024-06-09 01:45", "url": "https://www.yahoo.com/news/mbi-investigating-officer-involved-shooting-225955949.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MEMPHIS, Tenn. — The Mississippi Bureau of Investigation (MBI) is investigating an officer-involved shooting in Corinth, Mississippi involving the Alcorn County Sheriff’s Office that occurred on June 8.\nDeputies with the Alcorn County Sheriff’s Office responded to a call for service on County Road 575 in Corinth, Mississippi at approximately 3:30 p.m.\nThe first deputy on the scene observed a white male striking a white female, later identified as his mother in the head with an object.\nAs the subject continued to strike his mother in the head the deputy then fired his service weapon striking the male subject.\nUpon completing the investigation, MBI agents said they would share their findings with the Attorney General’s office.", "location": "CORINTH, Mississippi.", "classification": "security", "score": 0.5147820619242709, "event_breakdown": "MEMPHIS, Tenn. — The Mississippi Bureau of Investigation (MBI) is investigating an officer-involved shooting in Corinth, Mississippi involving the Alcorn County Sheriff’s Office that occurred on June 8.\nDeputies with the Alcorn County Sheriff’s Office responded to a call for service on County Road 575 in Corinth, Mississippi at approximately 3:30 p.m.\nThe first deputy on the scene observed a white male striking a white female, later identified as his mother in the head with an object.\nAs the subject continued to strike his mother in the head the deputy then fired his service weapon striking the male subject.\nUpon completing the investigation, MBI agents said they would share their findings with the Attorney General’s office."}, {"id": "fa0f767c-4ce5-41b1-a5bf-726865c59288", "title": "Detectives issue further appeal as Deptford murder victim named", "date": "2024-06-09 11:15", "url": "https://news.met.police.uk/news/detectives-issue-further-appeal-as-deptford-murder-victim-named-484871", "domain": "news.met.police.uk", "domain_classification": "Unknown", "message": "Detectives are appealing for witnesses, footage and information as they continue to investigate a murder in Deptford.\nPolice were called at approximately 22:35hrs on Thursday, 6 June to reports of a stabbing in Carteret Way, SE8.\nOfficers and London Ambulance Service attended but despite their best efforts the victim sadly died at the scene.\nHis family has been informed and the man has been identified as 21-year-old Robert Robinson who lived locally.\nFootage, images and information can be uploaded, anonymously if you wish, to: https://mipp.police.uk/operation/01MPS24W58-PO1You can also provide information 100% anonymously to the independent charity Crimestoppers on 0800 555 111.", "location": "DEPTFORD", "classification": "security", "score": 0.7925449856682767, "event_breakdown": "Detectives are appealing for witnesses, footage and information as they continue to investigate a murder in Deptford. Police were called at approximately 22:35hrs on Thursday, 6 June to reports of a stabbing in Carteret Way, SE8. Officers and London Ambulance Service attended but despite their best efforts the victim sadly died at the scene."}, {"id": "cd6f1062-ab67-4bbf-ac8c-01ab722f77fe", "title": "Mom of Palestinian boy fatally stabbed in Will County files suit against alleged killer", "date": "2024-06-09 00:00", "url": "https://pantagraph.com/news/state-regional/crime-courts/mom-of-palestinian-boy-fatally-stabbed-in-will-county-files-suit-against-alleged-killer/article_560188fd-71b3-5980-8e45-ae9c6f540c4b.html", "domain": "pantagraph.com", "domain_classification": "Unknown", "message": "JOLIET — Months after surviving a knife attack in unincorporated Will County that killed a 6-year-old Palestinian boy, the child’s mother has sued the alleged attacker, his wife and brother for wrongful death, battery and negligence.\nThe 39-page complaint states that Shahin had identified the rental property through Daniel Czuba and moved in about two years before the attack.\nWhen Shahin told Mary Czuba about those interactions, Mary Czuba allegedly assured her that she and Wadea were safe.\nAccording to the complaint, Czuba first attacked Shahin while she was giving Wadea a bath and returned to stab Wadea after she had called 911 and before authorities arrived.\nCzuba’s next criminal court date is 9:30 a.m. June 14, according to Will County sheriff records.", "location": "Will County, Illinois", "classification": "security", "score": 0.49824611045161266, "event_breakdown": "Push reporting that a woman is suing the alleged attacker, his wife and brother for wrongful death, battery and negligence in connection with a fatal knife attack in the unincorporated Will County area near Joliet, Illinois. The 39-page complaint identifies the attacker as Daniel Czuba. (willcosun.com)"}, {"id": "265aa706-cb64-4618-bb8f-4c451baecc13", "title": "First Time The Most Modern Su - 57 Fighter Was Damaged In Russia", "date": "2024-06-09 10:00", "url": "https://charter97.org/en/news/2024/6/9/598220/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "First Time The Most Modern Su-57 Fighter Was Damaged In Russia 48 9.06.2024, 9:2626,510The aircraft fell under attack at the Akhtubinsk air base 600 km from the front line.\nOn June 8, a Su-57 multifunctional fighter of the aggressor state was hit on the territory of the Akhtubinsk airfield in the Astrakhan region of the Russian Federation, located 589 kilometers from the line of contact.\nThis is reported by the Ukrainian Defence Intelligence (GUR) with reference to satellite images of the aircraft location at the airfield.\nReferenceThe Su-57 is the most modern Russian fighter jet, which is capable of using the Kh-59 and Kh-69 missiles.\nFew units of these combat aircraft are in service with the Russian Aerospace Forces.", "location": "AHTUBINSK", "classification": "security", "score": 0.7180540665826601, "event_breakdown": "Target event: New Russian Su-57 fighter damaged in first combat\nFirst combat use of Russian Su-57 fighter aircraft in June 2024 at Akhtubinsk air base 600 kilometers from the front line."}, {"id": "88c51ddf-21c9-4ccf-a41b-83a2ad353ec0", "title": "Italy hard - right leader tells EU center parties their time is up as she votes in European election", "date": "2024-06-09 00:00", "url": "https://www.pbs.org/newshour/world/italys-hard-right-leader-tells-eu-center-parties-their-time-is-up-as-she-votes-in-european-election", "domain": "pbs.org", "domain_classification": "Unknown", "message": "ROME (AP) — Prime Minister Giorgia Meloni joined voters in Italy and a half dozen European Union nations in casting a ballot during the penultimate day of European Union parliamentary elections on Saturday.\nThe bloc’s premier hard-right politician threw down the gauntlet to the traditional center parties, telling them their time to run the EU as they liked was up.\nHe attacked the European Union, suggesting he was a victim because of his views that differ sharply from the EU’s mainstream.\nThe result could expand Meloni’s influence in the EU, as von der Leyen has not ruled out a coalition with her group.\nThe main voting day is Sunday, with citizens in 20 European countries, including Germany, France and Poland, casting their ballots for the 720-seat European Parliament.", "location": "The main location where the main event takes place is ROME, Italy.", "classification": "security", "score": 0.5022457042014201, "event_breakdown": "Giorgia Meloni, the leader of the hard-right Brothers of Italy party, cast her ballot in the European Parliament elections in Rome. She called on Europe's center-right and center-left parties to stop treating Europe's hard-right as pariahs if they want to undermine the threat to Europe's future from nationalists."}, {"id": "450bfd89-ec2f-4840-97d2-54841909d647", "title": "1 dead in Modesto stabbing ; police say there is no threat to the public", "date": "2024-06-09 08:15", "url": "https://www.cbsnews.com/sacramento/news/1-dead-in-modesto-stabbing-police-say-there-is-no-threat-to-the-public/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "MODESTO — Detectives say they believe a stabbing that left one person dead in Modesto Saturday night is an isolated incident.\nThe Modesto Police Department says officers responded to the 1300 block of Trenary Way just before 8 p.m. to investigate reports of a stabbing.\nAt the scene, first responders found one victim who was quickly transported to the hospital.\nDetectives with Modesto police's Investigative Services Division are at the scene, and a heavy police presence remained in the area throughout the night.\nPolice say there is no threat to the public.", "location": "MODESTO", "classification": "security", "score": 0.8723923626763149, "event_breakdown": "Security Event:\nPerson Killed in Modesto Stabbing\nOn Saturday, June 30 the Modesto Police Department responded to reports of a stabbing on Trenary Way. Officers found a victim who was taken to the hospital and later pronounced dead. The Modesto Police Department says there is no threat to the public & that the incident is isolated."}, {"id": "3769a3ae-1e74-4753-8a84-18d1317f3ef4", "title": "Islamic terrorists storm construction site killing four in latest bloodbath", "date": "2024-06-09 07:45", "url": "https://www.express.co.uk/news/world/1908977/al-shabab-fighters-kill-four-workers-kenya", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Islamic militants killed four construction workers in the bloody attack.\nFour men working at a hospital construction site in northern Kenya near a refugee camp and the border with Somalia were shot dead by Islamic militants.\nA group of eight workers were resting on Friday when they were attacked, leaving four shot dead at close range.\nThe hospital construction site is near Kenya’s largest refugee camp, Dadaab, and the border with Somalia where the al-Shabab militant group is based.\nGarissa County has in the past been attacked by al-Shabab militants who cross through the porous border.", "location": "Garissa County, Kenya", "classification": "security", "score": 0.991419311180573, "event_breakdown": "Event 1: Four construction workers were shot dead by Islamic militants in a hospital construction site near Kenya’s largest refugee camp, Dadaab, on Friday."}, {"id": "e81c3659-7ff3-40af-8019-baad16c0de67", "title": "Your time is up , Italy hard - right leader tells EU center parties as she votes in European election", "date": "2024-06-09 15:45", "url": "https://www.timesfreepress.com/news/2024/jun/09/your-time-is-up-italys-hard-right-leader-tells-eu-center-parties-as-she-votes-in-european-election-tfp/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "ROME (AP) — Prime Minister Giorgia Meloni joined voters in Italy and a half dozen European Union nations in casting a ballot during the penultimate day of European Union parliamentary elections on Saturday.\nThe bloc's premier hard-right politician threw down the gauntlet to the traditional center parties, telling them their time to run the EU as they liked was up.\nHe attacked the European Union, suggesting he was a victim because of his views that differ sharply from the EU's mainstream.\nThe result could expand Meloni's influence in the EU, as von der Leyen has not ruled out a coalition with her group.\nThe main voting day is Sunday, with citizens in 20 European countries, including Germany, France and Poland, casting their ballots for the 720-seat European Parliament.", "location": "ROME", "classification": "security", "score": 0.5022457042014201, "event_breakdown": "Giorgia Meloni, Prime Minister of Italy, cast vote on the penultimate day of European parliamentary elections, and says she is ready for anti-establishment push in EU"}, {"id": "0afd43bf-755d-4fae-a2b3-294ad8920a8d", "title": "Israel rescues four hostages in Gaza raid that Hamas says kills 210 Palestinians", "date": "2024-06-09 04:30", "url": "https://www.koreatimes.co.kr:443/www/world/2024/06/501_376208.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Israelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\n\"We all felt that we wouldn't survive,\" she told AFP, condemning \"this brutal occupation that will not let us live.\"\nFinancial newspaper Calcalist hailed a \"heroic operation\" that had given Israelis \"a few hours of grace,\" while the left-leaning Haaretz daily called the rescue operation a \"morale boost\" for the nation.\nRenewed clashesHamas's Ezzedine Al-Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday's rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.", "location": "GAZA", "classification": "security", "score": 0.8685704755866627, "event_breakdown": "IDF rescues hostages from Gaza, clashes erupt\nIDF rescues hostages from Gaza, clashes erupt"}, {"id": "18e1c179-9bbf-4746-8988-b8b8fbf12ea5", "title": "Torah scroll dedicated in honor of Dee family", "date": "2024-06-09 11:15", "url": "https://www.israelnationalnews.com/news/391297", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Last Thursday, approximately 4,000 students from Efrat dedicated a Torah scroll in memory of the members of the Dee family who were murdered in a shooting attack at Hamra Junction on April 7, 2023.\nAt the request of the Etzion Police Station, volunteers from the Israel Dog Unit, a nonprofit specializing in working dogs, led the festive parade that accompanied the dedication.\nThe Torah was funded through donations raised by approximately 50,000 students in 500 kindergartens and 130 schools from the Jerusalem Education District.\nFollowing the parade, the Torah was brought to the Orot Etzion school, where Yehuda Dee recently finished his studies.", "location": "OROT ETZION", "classification": "security", "score": 0.7405324913159714, "event_breakdown": "April 7, 2023: A shooting attack at Hamra Junction in the Judea and Samaria region leaves five members of the Dee family dead."}, {"id": "8a6c17ff-dcb4-4df5-8136-6d8c9a89b1b0", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 10:45", "url": "https://abcnews.go.com/International/wireStory/ukraine-struck-russias-advanced-warplanes-110962448", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Its distance from Ukraine suggests it was most likely hit by drones.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, points to the likely use of Ukrainian-made drones.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nRussia's Su-57 fleet has been largely absent from the skies over Ukraine, and has instead been used to fire long-range missiles across the border.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "location": "Akhtubinsk", "classification": "security", "score": 0.8604080695403366, "event_breakdown": "1. Akhtubinsk Airstrip, Astrakhan region, Russia - Likely hit by drones late on Saturday, April 30, 2022. The airstrip sustained minor damage.\n2. Belgorod province, Russia - Hit by three Ukrainian drones late on Saturday, April 30, 2022. Windows were blown out at a factory, but no casualties were reported."}, {"id": "87fa096a-4873-4c05-b5fe-f7a249309042", "title": "Ukraine Claims It Struck Russia Ultra - Modern , Most Advanced Su - 57 Warplane", "date": "2024-06-09 15:15", "url": "https://www.news18.com/world/ukraine-claims-it-struck-russias-ultra-modern-most-advanced-su-57-warplane-8926789.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine’s first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow’s most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia’s Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia’s southern border regions, according to local Russian officials.", "location": "Akhtubinsk", "classification": "security", "score": 0.8210073279630811, "event_breakdown": "Location: Akhtubinsk, Astrakhan\nReported event: Successful strike on a Su-57 Russian fighter plane at the Akhtubinsk airstrip"}, {"id": "05db97ff-befc-49a3-b17f-94ac95ccd70a", "title": "Ukraine says it struck one of Russia most advanced warplane", "date": "2024-06-09 12:30", "url": "https://www.ctvnews.ca/world/ukraine-says-it-struck-one-of-russia-s-most-advanced-warplanes-1.6919502", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.", "location": "Akhtubinsk airstrip", "classification": "security", "score": 0.8210073279630811, "event_breakdown": "Russia shoots down three Ukrainian drones in Astrakhan region, according to Defense Ministry; and Ukraine continues to strike Russian airfields and military targets with drones."}, {"id": "457763cc-e9c3-4911-b6f6-9eb93dd43148", "title": "Ukraine Says it Struck One of Russia Most Advanced Warplanes", "date": "2024-06-09 11:15", "url": "https://www.newsmax.com/newsfront/russia-ukraine-war-su57-fighter/2024/06/09/id/1168017/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.", "location": "Akhtubinsk", "classification": "security", "score": 0.8210073279630811, "event_breakdown": "New event: Russia's Defense Ministry said Saturday its forces shot down three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip."}, {"id": "46d72608-83f4-49e3-adb2-cda43a58d305", "title": "Hamas says more than 200 killed as Israel rescues four Gaza hostages", "date": "2024-06-09 06:45", "url": "https://www.al-monitor.com/originals/2024/06/hamas-says-more-200-killed-israel-rescues-four-gaza-hostages-0", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "The Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres, charges the militants deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "location": "Gaza", "classification": "security", "score": 0.8569801673199909, "event_breakdown": "Israeli soldiers killed Hamas commander Hamam Al-Mishal\nThe Israeli army said that militants in the Gaza Strip fired a rocket-propelled grenade (RPG) at soldiers in southern Israel on Sunday night.\nIsraeli soldiers killed Hamas commander Hamam Al-Mishal, 22, on Sunday in the Gaza Strip. The IDF said Mishaal was planning to carry out a \"complex attack\" against Israeli troops."}, {"id": "56ecf25f-5c49-4a6d-bd28-34a2ba003b86", "title": "Palestinians describe carnage in Israel hostage rescue operation", "date": "2024-06-09 10:45", "url": "https://www.bbc.co.uk/news/articles/cw44ve90dppo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The Hamas-run health ministry in Gaza says an Israeli raid on a refugee camp - which led to the rescue of four hostages - killed 274 people, including children and other civilians.\nOn Saturday Israel's forces, backed by air strikes, fought intense gun battles with Hamas in and around the Nuseirat refugee camp, freeing the captives.\nBut the latest figures from the Hamas-run health ministry in Gaza would, if confirmed, make it one of the deadliest days of the conflict so far.\n\"Reports from Gaza of another massacre of civilians are appalling,\" he wrote on X.\nAn Israeli minister said that instead of condemning Hamas for hiding behind civilians, the EU had condemned Israel for saving its citizens.", "location": "GAZA", "classification": "security", "score": 0.6574325845931216, "event_breakdown": "[\n\"On Saturday, Israeli forces seized control of a Gaza-governed refugee camp, after intense gun battles with Hamas on Saturday in which hostages were held, placing the entire operation under scrutiny as both the death toll and the number of displaced persons are a serious concern,\"\n]"}, {"id": "3e205a17-b7a9-4307-8d8a-5a7cea86da32", "title": "Two killed in south Lebanon as Hezbollah - Israel fighting escalates – Ya Libnan", "date": "2024-06-09 02:15", "url": "https://yalibnan.com/2024/06/09/two-killed-in-south-lebanon-as-hezbollah-israel-fighting-escalates/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "[Rabih Daher/AFP] June, 8 , 2024Latest attacks come as Israeli officials have been calling for expansion of fighting along Israel-Lebanon border.\nAt least two people have been reported killed in southern Lebanon as cross-border fighting between Hezbollah and Israel continues amid the threat of wider war.\nThe two killings were the result of Israeli attacks on the outskirts of the town of Aitaroun, Lebanon’s state-run National News Agency (NNA) reported on Saturday.\nIsraeli attacks since October 7 have killed more than 300 members of Hezbollah and about 80 civilians, according to the group and Lebanese officials.\nAttacks from Lebanon on Israel have killed 18 Israeli soldiers and 10 civilians, the Israeli military has said.", "location": "AEtaroun", "classification": "security", "score": 0.9919293364760988, "event_breakdown": "Israeli attacks since October 7 have killed more than 300 members of Hezbollah and about 80 civilians in Lebanon, according to the group and Lebanese officials."}, {"id": "616aa3bd-f7e4-42db-8f74-3810094de3b2", "title": "Manhunt underway after man , 30s , killed in suspected stabbing in Finglas", "date": "2024-06-09 12:30", "url": "https://www.irishexaminer.com/news/arid-41412559.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "A manhunt is underway for a convicted killer who is suspected of stabbing a man to death on Sunday.\nA man in his 30s was fatally stabbed in Finglas, Dublin, shortly after 1am.\n\"Shortly after 1am, gardaí and emergency services attended a residence in the Scribblestown area where a man in his 30s was found with serious injuries.\n\"A senior investigating officer (SIO) has been appointed to lead the inquiry, and an incident room has been established at Finglas Garda Station.\nGardaí are appealing for witnesses to come forward, particularly those who were in the Scribblestown area between midnight and 1am.", "location": "Finglas, Dublin", "classification": "security", "score": 0.8866095928824326, "event_breakdown": "Gardaí are appealing for witnesses to come forward, particularly those who were in the Scribblestown area between midnight and 1am. Anyone with information is asked to contact Finglas Garda Station on 01 6667500."}, {"id": "fee668cd-b944-4b70-9ca2-616b7f91ab85", "title": "Russo - Ukraine War - 08 June 2024", "date": "2024-06-09 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussians carried out more than 2,800 shelling on the positions of Ukrainian troops and settlements using different types of weapons.\nIn the Lyman direction, Russian forces tried seven times to advance in the direction of settlements Nevske, Terni, Ivanivka, Torske and Dibrova.\nThe AFU losses amounted to up to 135 Ukrainian troops, five motor vehicles, and one 122-mm 2S1 Gvozdika self-propelled artillery system.", "location": "ODESSA", "classification": "security", "score": 0.48996078499392104, "event_breakdown": "Reported Location: Ukraine\nReported Date: 24 February 2022\nRussian forces shelled the positions of Ukrainian troops and settlements in more than 2,800 locations using different types of weapons, initiating the largest European war since the Great Patriotic War.\nRussia attacks Ukraine, initiating the largest European war since the Great Patriotic War."}, {"id": "bf850c88-36b8-4d23-88e8-99770fed7daf", "title": "Forces : The Ukraine War and the American Army", "date": "2024-06-09 07:00", "url": "http://www.strategypage.com/%5Chtmw%5Chtworld%5Carticles%5C2024060802636.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "June 8, 2024: The Ukraine War is very much an American war because Russia and the United States have been the major military powers, and opponents, since the end of World War II.\nThis includes Korea (1950-53), Vietnam (1964-73), Kosovo War (1989-96), Gulf (Iraq) War (1990-91), Afghanistan War (2001-2021), Iraq/Islamic terrorists (2003-2011), Iraq Intervention (2014-2021), Syrian Civil War (ongoing since 2014).\nIn addition to these wars that involved American forces, often mainly airpower, there were dozens of smaller interventions which also involved few American troops other than airpower or warships offshore.\nThis includes the Ukraine War (ongoing since 2022) that began when Russia invaded Ukraine.\nThis has been the case since victory in the Spanish American War that lasted from April to December 1898.", "location": "KYIV", "classification": "security", "score": 0.7163468424136018, "event_breakdown": "Current events of security that are reported in text that can be placed on a map:\n- The Ukraine War: Ongoing since 2022, when Russia invaded Ukraine."}, {"id": "f0392a98-13c3-42c5-9da5-c33eb0e2cde7", "title": "Jordan , Egypt Condemn Israeli Rescue of Hostages ; EU , UN Officials Join In", "date": "2024-06-09 01:30", "url": "https://freerepublic.com/focus/f-news/4243118/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Jordan, Egypt Condemn Israeli Rescue of Hostages; EU, UN Officials Join InBreitbart ^ | 06/08/2024 | Joel B PollackPosted on by ChicagoConservative27Egypt and Jordan, two countries that have peace treaties with Israel, condemned the Israeli rescue of four hostages on Saturday — as did officials from the European Union (EU) and United Nations (UN) — over Palestinian casualties.\nby 2 posted onby CatOwner (Don't expect anyone, even conservatives, to have your back when the SHTF in 2021 and beyond.)\nby 3 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nby 4 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nTruly 200 “palestinians” some 80% of whom support Hamas, were killed as well as the Israeli Police commando chief to rescue 4 hostages... alive.", "location": "Israel", "classification": "security", "score": 0.45136770033879, "event_breakdown": "In the coming week, the EU and UN are expected to vote on a resolution condemning Israel's actions."}, {"id": "e2ed92d4-c900-45fe-a4c6-7e29e18da4fd", "title": "North Korea sends another wave of trash balloons into South Korea", "date": "2024-06-09 07:45", "url": "https://www.cnn.com/2024/06/09/asia/north-korea-balloons-response-intl-hnk/", "domain": "cnn.com", "domain_classification": "International", "message": "About 330 balloons carrying bags of trash had been sent by North Korea since Saturday night, of which about 80 have landed in South Korea, Seoul’s Joint Chiefs of Staff (JCS) said on Sunday.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nTrash from a balloon presumably sent by North Korea lies on scattered the ground in Seoul, South Korea on June 9, 2024.\nSouth Korea Joint Chiefs of Staff/APIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "location": "Seoul", "classification": "security", "score": 0.40302095751803174, "event_breakdown": "List of current events of security that can be placed on map:\n- North Korea uses balloons to send bags of trash to South Korea since Saturday"}, {"id": "0986ec91-6968-4102-9a1c-8c043f7e4f2a", "title": "North Korea sends another wave of trash balloons into South Korea", "date": "2024-06-09 08:45", "url": "https://edition.cnn.com/2024/06/09/asia/north-korea-balloons-response-intl-hnk/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "About 330 balloons carrying bags of trash had been sent by North Korea since Saturday night, of which about 80 have landed in South Korea, Seoul’s Joint Chiefs of Staff (JCS) said on Sunday.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nTrash from a balloon presumably sent by North Korea lies on scattered the ground in Seoul, South Korea on June 9, 2024.\nSouth Korea Joint Chiefs of Staff/APIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "location": "Seoul, South Korea", "classification": "security", "score": 0.40302095751803174, "event_breakdown": "Target event: The international news showp that security events from North Korea.\nNorth Korea has been sending giant balloons carrying bags of trash on a bitter row with South Korea about leaflets | balloons that are banned by new city laws."}, {"id": "b1db3d23-536b-4699-b518-337c53fb2dc0", "title": "North Korea sends another wave of trash balloons into South Korea - LocalNews8 . com", "date": "2024-06-09 11:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/09/north-korea-sends-another-wave-of-trash-balloons-into-south-korea/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Around 1,060 balloons from the North have made it into South Korean territory since May 28, according to a CNN tally.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nThe South Korean military responded on Sunday afternoon local time by playing a loudspeaker broadcast into North Korea, according to the JCS.\nIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "location": "South Korea", "classification": "security", "score": 0.44366091028618493, "event_breakdown": "North Korea is sending giant balloons with trash, soil, pieces of paper and plastic, and what South Korean authorities described as \"filth\" over the border as a response to South Korea's years-long practice of sending balloons with anti-North Korea leaflets."}, {"id": "235ebceb-9c4a-40dc-b9c9-2a04b7578e76", "title": "World War II veteran , 100 , and his 96 - year - old sweetheart bride tie the knot near the Normandy D - Day beaches", "date": "2024-06-09 06:30", "url": "https://www.dailymail.co.uk/news/article-13510147/WWII-veteran-100-96-Normandy-D-Day-beaches.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A World War II veteran and centenarian and his 96-year-old sweetheart bride tied the knot near the D-Day beaches of Normandy.\nOn June 8, Harold Terens and Jeanne Swerlin tied the knot inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens was sent to repair returning planes from France to they could rejoin the battle.\nOn D-Day, Terens was sent to repair returning planes from France to they could rejoin the battle.\nWhen he returned from the war, Terens married his first wife Thelma in 1948.", "location": "Normandy, France", "classification": "security", "score": 0.6179946351758484, "event_breakdown": "Current Event:\nA World War II veteran and centenarian and his 96-year-old sweetheart bride reportedly tied the knot near the D-Day beaches of Normandy, France on June 8."}, {"id": "a2c2a4b9-433d-4cf0-a5d8-e8190f89af8b", "title": "Troops from multiple units | IDF releases more information about Operation Arnon", "date": "2024-06-09 15:15", "url": "https://www.israelnationalnews.com/news/391319", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Paratroopers Brigade Combat Team led the rescue and the special forces under fire and brought them to the helicopter boarding point in the heart of the Gaza Strip.\nSoldiers from the Paratroopers Reconnaissance Unit, the Transport Unit (5515), Shayetet 13, the Givati Reconnaissance Unit, and an armored battalion (532) operated with the combat team in the operation.\nThe Kfir Brigade Combat Team operated for several hours in the area.\nThe combat team operated with soldiers from the Paratroopers Brigade and a special force from the Duvdevan Unit.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "GAZA STRIP", "classification": "security", "score": 0.8460434012753903, "event_breakdown": "The current event that took place is the rescue of IDF soldiers in the heart of the Gaza Strip that was led by a combat team from the Paratroopers Brigade. The rescue operation involved soldiers from the Paratroopers Reconnaissance Unit, the Shayetet 13, the Givati Reconnaissance Unit, an armored battalion, and a special force from the Duvdevan Unit."}, {"id": "9126e787-8f7a-492e-a7e8-5bbca82549ac", "title": "Russia Combat Losses Up By 1 , 270 In Past Day", "date": "2024-06-09 08:15", "url": "https://menafn.com/1108311711/Russias-Combat-Losses-Up-By-1270-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia has lost a total of 518,560 and officers killed and wounded in action since the full-scale invasion, according to the estimates drawn by the Ukrainian side.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nIn the past day alone, these losses rose by 1,270, the Ukrainian military notes.\nFinland's military aid to Ukraine includes latest products under developmentThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, special operations units from Ukraine's Security Service in the past week engaged nine Russian tanks and four air defense systems, as well as eliminated 212 invaders.", "location": "Kyiv", "classification": "security", "score": 0.748958500276326, "event_breakdown": "Location: Ukraine\nEvent: Russia loses 518,560 soldiers since full-scale invasion\nOn June 21, Russia suffered 1,270 military casualties, bringing its total number of losses to 518,560, since the full-f\n\n\n(MENAFN - UkrinForm) Росії втратили 518560 солдат і кадрове ушкодження з часу початку масової операції на Україні.\nЦі погадування невеликість;\n\nЦього зазначили Генеральний штаб оперативної зброї Збройних Сил України.\n\nRussian Federation loses 518560 soldiers since full-scale invasion\nJune 21: Russia suffers 1,270 military casualties, bringing total number of losses to 518,560. Ukraine, Russian Federation"}, {"id": "0af27a80-c9cd-4e3d-b38a-619352ee9fe6", "title": "Israel Pounds Central Gaza as Palestinian Death Toll in Hostage Rescue Raid Rises to 274", "date": "2024-06-09 15:00", "url": "https://www.newsmax.com/headline/israel-gaza/2024/06/09/id/1168019/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Palestinians remained in shock over Saturday's death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nSixty-four of the dead were children and 57 were women, the Hamas-run Gaza government media office said on Sunday.\nHamas' armed wing said on Sunday three Israeli hostages, including one with U.S. citizenship, were killed during the raid, but provided no names.\nA Hamas assertion on Saturday that some hostages had died was rejected as \"a blatant lie\" by the Israeli military.\nPalestinian medics said an Israeli airstrike on a house in Tel Al-Sultan in western Rafah killed two people.", "location": "GAZA", "classification": "security", "score": 0.8777000806162691, "event_breakdown": "Palestinians continued to seek humanitarian aid to sustain their emergency first responders and congratulate first responders on Saturday's death toll, which Israel said included two of its soldiers and was targeting the Hamas military chief."}, {"id": "ed40d979-624d-4354-ac91-4ff3452b5181", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC Bay Area", "date": "2024-06-09 07:00", "url": "https://www.nbcbayarea.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3561050/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later.", "location": "Normandy, France", "classification": "security", "score": 0.45923979372213614, "event_breakdown": "1. World War II veteran Harold Terens and his sweetheart Jeanne Swerlin tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "353ff0b4-4b6d-46d2-984b-cf2bb4dbf559", "title": "Israel cheers rescue of 4 hostages as Hamas says raid killed 274", "date": "2024-06-09 11:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-cheers-rescue-4-hostages-hamas-says-raid-killed-274", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 9, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\nFinancial newspaper Calcalist hailed a \"heroic operation\" that had given Israelis \"a few hours of grace\", while the left-leaning Haaretz daily called the rescue operation a \"morale boost\" for the nation.\n- Renewed clashes -Hamas's Ezzedine Al-Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday's rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nHamas has insisted on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands that Israel has firmly rejected.", "location": "GAZA", "classification": "security", "score": 0.956249529828291, "event_breakdown": "Israeli hostages rescue from Gaza Strip"}, {"id": "2b729703-9ad8-4e9b-a325-bff760f51df6", "title": "Neo - Nazi group Blood Tribe claims responsibility for swastika displays in Pierre , Deadwood", "date": "2024-06-09 08:15", "url": "https://www.yahoo.com/news/nazi-supporters-attempt-rally-sd-012735156.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Christopher Pohlhaus, leader of Blood Tribe, a neo-Nazi group, claimed his members were responsible for the display in a hostile response to South Dakota Gov.\nAccording to the Anti-Defamation League, the Blood Tribe is a neo-Nazi group which depicts itself as a hardcore white supremacist group and reveres Nazi dictator Adolf Hitler as a deity.\nHe added South Dakota Highway Patrol officers gave them orders to disperse as a result, to which they immediately complied.\nA group of people believed to be part of the neo-Nazi group \"Blood Tribe\" march behind swastika flag-bearers in Deadwood, South Dakota, Saturday, June 8, 2024.\nAccording to the ADL, Blood Tribe has held various protests across the country since at least March 2023.", "location": "South Dakota.", "classification": "security", "score": 0.8053943930881566, "event_breakdown": "Map data unavailable"}, {"id": "a3c86b97-fb9a-4923-b5ca-16df5162e2cd", "title": "MoreCPs v2 . 0 file", "date": "2024-06-09 05:00", "url": "https://www.moddb.com/mods/more-cps/downloads/morecps-v20", "domain": "moddb.com", "domain_classification": "Unknown", "message": "This mod changes the command point limit (population limit) so that it is 3x higher in skirmish and x2 higher in the campaign.\nFor good factions, the command point limit is now 600 (For the campaign it now starts at 300 and caps at 600).\nFor evil factions, the command point limit is now 1200 (For the campaign it now starts at 600 and caps at 1200).\nFor good factions, the command point limit is now 600 (For the campaign it now starts at 300 and caps at 600).\nFor evil factions, the command point limit is now 1200 (For the campaign it now starts at 600 and caps at 1200).", "location": "Based on the text provided, I was not able to find a specific location for the event described.", "classification": "security", "score": 0.4402430179566273, "event_breakdown": "Security forces in the Philippines have arrested a suspected terrorist in a raid on a house on the island of Mindanao. The suspect was allegedly planning an attack on a shopping centre in Manila.\nSecurity forces in Somalia have arrested a suspected terrorist in a raid on a house in Mogadishu. The suspect was allegedly planning an attack on a hotel in Mogadishu.\nSecurity forces in Pakistan have arrested a suspected terrorist in a raid on a house in Lahore. The suspect was allegedly planning an attack on a military base in Lahore."}, {"id": "604d25c7-d845-4350-9103-46d265280b05", "title": "  גיבור ישראל : Fallen Officer Also Saved Countless Lives On Oct . 7th – The Yeshiva World", "date": "2024-06-09 01:45", "url": "https://www.theyeshivaworld.com/news/israel-news/2289284/%D7%92%D7%99%D7%91%D7%95%D7%A8-%D7%99%D7%A9%D7%A8%D7%90%D7%9C-fallen-officer-also-saved-countless-lives-on-oct-7th.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Yamam Commander Arnon Zamora, H”yd, 36, heroically led Israeli forces in one of the most daring rescue operations in IDF history and tragically paid with his life.\nAfter he retrieved the hostages, he was critically wounded when dozens of terrorists opened fire on the Israeli forces with RPGs, machine guns and rifles.\nZamora also saved countless lives on October 7th when he led the battle against Hamas terrorists near the southern community of Yad Mordechai.\nHe killed dozens of terrorists and prevented them from infiltrating the kibbutz.\nWhen the battle at Yad Mordechai ended, he continued battling terrorists at the Nachal Oz and Be’eeri kibbutzimThe rescue operation has been renamed Operation Arnon in his honor.", "location": "The main focus of the event takes place at Yad Mordechai, a southern community in Israel.", "classification": "security", "score": 0.9743430730211361, "event_breakdown": "Operation Arnon - An IDF operation, commandeered by Yamam Commander Arnon Zamora, H\"yd, 36, aimed at saving hostages trapped in a Hamas-run underground terror tunnel. He heroically led the forces but was mortally wounded during the rescue mission. The battle occurred near the southern Israeli community of Yad Mordechai."}, {"id": "d57b1b5d-2e0d-4588-a917-3d578cf6e16d", "title": "Bomber memorial and tourist - attracting market structure - latest North Lincolnshire applications", "date": "2024-06-09 06:45", "url": "https://www.grimsbytelegraph.co.uk/news/local-news/bomber-memorial-tourist-attracting-market-9327737", "domain": "grimsbytelegraph.co.uk", "domain_classification": "Unknown", "message": "Sign up to the Grimsby Live newsletter for daily updates and breaking newsA new Halifax bomber memorial is in the works in North Lincolnshire.\nA similar grant has been sought for the bomber memorial, and is subject to it getting planning permission.\nRead on below for recent North Lincolnshire planning applications, including a market cross that attracts visitors from around the world.\nA Halifax II crashed into a house in Kirton in Lindsey near the proposed memorial during the Second World War.\nEpworth market crossEpworth Town Council has sought permission to spruce up its market cross.", "location": "Kirton in Lindsey", "classification": "security", "score": 0.7720101825722478, "event_breakdown": "New Halifax bomber memorial proposed in North Lincolnshire\nHalifax bomber memorial sought in Kirton Lindsey\nKirton Lindsey is locate north Lincolnshire"}, {"id": "4dc09eb6-398d-4918-a458-5f43e40ca9c4", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 07:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/articleshow/110830596.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "DUBAI: A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.The Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the US Maritime Administration.\nA US-led airstrike campaign has targeted the Houthis since January, with a series of strikes May 30 killing at least 16 people and wounding 42 others, the rebels say.But while gaining more attention internationally, the secretive group has cracked down at dissent at home.\nEleven Yemeni employees of United Nations agencies and others working for aid groups have been detained by the Houthis under unclear circumstances, as the rebels face increasing financial pressure and airstrikes from the US-led coalition.\nThe rebels also recently sentenced 44 people to death.", "location": "YEMEN", "classification": "security", "score": 0.9727372546069093, "event_breakdown": "Gulf of Aden (Please clarify the exact place or add additional info if there is more than 1 place by the same name)"}, {"id": "eb75d85a-efe4-4c45-919e-134054e8531e", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels . No one hurt", "date": "2024-06-09 04:15", "url": "https://www.startribune.com/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/600372115/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "MANAMA, Bahrain — A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying ''damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "MANAMA", "classification": "security", "score": 0.526858316898216, "event_breakdown": "Location: Gulf of Aden, Yemen\nEvent: Houthi rebels launched missile attack on cargo ship\nReported by: AP\nTarget event: Houthi rebels attack vessel in the Gulf of Aden\nTargets: The Norderney cargo ship\nReported by: AP\nTargets: The Norderney cargo ship"}, {"id": "5dd5cbd5-506e-421a-9adf-0ce9001ff693", "title": "Yemen Houthi Rebels Claim Latest Attack on Cargo Ship in the Gulf of Aden", "date": "2024-06-09 15:00", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthi-rebels-ship-attack-israel-hamas-war/2024/06/09/id/1168032/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "MANAMA, Bahrain (AP) — A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.526858316898216, "event_breakdown": "Yemen\nSaudi Arabia"}, {"id": "c377f2d1-084b-4e5c-a445-95f8ab36c141", "title": "2 killed , fires rage in Lebanon after Israeli strikes - World", "date": "2024-06-09 08:30", "url": "https://www.dawn.com/news/1838745/2-killed-fires-rage-in-lebanon-after-israeli-strikes", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza conflict began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "location": "Israel", "classification": "security", "score": 0.95005503469555, "event_breakdown": "Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, causing multiple brush fires on both sides of the Israel-Lebanon border."}, {"id": "5c609ecc-ccfc-4386-84f1-8d9d8894cc81", "title": "4 killed , 5 injured in Israeli airstrikes in Lebanon", "date": "2024-06-09 07:15", "url": "https://www.mangalorean.com/4-killed-5-injured-in-israeli-airstrikes-in-lebanon/", "domain": "mangalorean.com", "domain_classification": "Unknown", "message": "4 killed, 5 injured in Israeli airstrikes in LebanonBeirut: Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9965447782784461, "event_breakdown": "4 killed, 5 injured in Israeli airstrikes in Lebanon."}, {"id": "a02b7227-0546-4a9b-ab36-3188a007fd76", "title": "NWester : Stay the night at Wilson missile silo turned Airbnb", "date": "2024-06-09 15:00", "url": "https://hayspost.com/posts/0671be05-ead3-4f8f-b33f-8395689485d3", "domain": "hayspost.com", "domain_classification": "Unknown", "message": "Photo by Tony Guerrero/Hays PostBy TONY GUERREROHays PostWILSON—Take cover and spend the night in an underground missile base in Wilson, transformed into a tourist stop and Airbnb.\nPhoto by Tony Guerrero/Hays PostThe 176-foot-deep silo with 70 feef of water inside where the missile was once stored.\nPhoto by Tony Guerrero/Hays PostThe silo was decommissioned in 1965 after four years of operation.\nThe blast doors above the missile silo made from 9 feet of concrete.\nPhoto by Tony Guerrero/Hays PostThe entrance to the missile base next to a small island.", "location": "WILSON", "classification": "security", "score": 0.7184256069432843, "event_breakdown": "Target event not found"}, {"id": "01cabfbf-350d-44d2-9daa-19ece9613bd7", "title": "Ukraine stabilizes the north after surprise Russian push – but faces fresh pressure in the east", "date": "2024-06-09 16:00", "url": "https://www.egyptindependent.com/ukraine-stabilizes-the-north-after-surprise-russian-push-but-faces-fresh-pressure-in-the-east/", "domain": "egyptindependent.com", "domain_classification": "Unknown", "message": "For much of the war, Ukraine has been constrained when it comes to using powerful Western weapons against Russia.\nKostiantyn Liberov/Libkos/Getty ImagesNortheast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nBut “most of the city is under the control of the Ukrainian Defense Forces” Voloshyn told CNN.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February.\nWestern weapons and a new push to draft more soldiers in to the Ukrainian military could give Ukraine the boost it needs.", "location": "KHARKIV", "classification": "security", "score": 0.7594774760509259, "event_breakdown": "Northeast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka."}, {"id": "9531e550-1dac-4db7-9247-104d37ef6e1f", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 15:30", "url": "https://economictimes.indiatimes.com/news/defence/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/articleshow/110847383.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "but I cannot report a comment as slanderous or offensive when it is not. Please rephrase your question.", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n- Taliban takes over Afghanistan\n- Earthquake in Haiti\n- Protests in Iraq\n- Wildfire in California"}, {"id": "494b0fa3-f20c-4bc3-9709-627e0a4cfecf", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 15:00", "url": "https://www.ksat.com/news/world/2024/06/09/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "location": "Akhtubinsk", "classification": "security", "score": 0.6978922606421268, "event_breakdown": "The Afghan Armed Forces have captured a prison that was under Taliban's control. The Taliban had freed thousands of prisoners from this prison in a shocking move."}, {"id": "51fe380c-0c3b-4595-b64c-593a42558aec", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 14:00", "url": "https://www.clickondetroit.com/news/world/2024/06/09/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "location": "BELGOROD", "classification": "security", "score": 0.6978922606421268, "event_breakdown": "Event: Three drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said the region's governor.\nEvent: The Russian military on Saturday claimed to have shot down three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip."}, {"id": "27e0a31f-9f1c-4f72-8cbc-9bfc3192e8b2", "title": "Ukraine says it struck one of Russia most advanced warplanes – Metro US", "date": "2024-06-09 15:45", "url": "https://www.metro.us/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "domain": "metro.us", "domain_classification": "Unknown", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nIn January, drones hit a gas terminal near St. Petersburg that lies over 1,000 kilometres (620 miles) north of the border.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "location": "Akhtubinsk", "classification": "security", "score": 0.8768418238648815, "event_breakdown": "Event 1: Ukraine Strikes Russian Military Airfield\nOn Monday, April 25, Ukraine launched an attack on a Russian military base in Akhtubinsk, about 100 miles inside Russia. The strike occurred shortly after its Western allies permitted Ukraine to use Western weaponry for limited strikes inside Russia. In addition, Ukraine had claimed responsibility for multiple recent attacks on Russian military sites in Belgorod.\nEvent 2: Russia has struck Ukraine with rockets\nThis week, Russian forces fired rockets at a Ukrainian military test site and caused significant damage, Ukrainian officials stated.\nEvent 3: Russia has claimed responsibility for an attack on an ammunition depot\nIn the aftermath of the attack on Ukraine, Russian officials claimed they hit an ammunition depot in Chernihiv in northern Ukraine with an Iskander ballistic missile.\nEvent 4: Takehiko Yamamoto has taken over as Japan's deputy defense minister\nThe Japanese government has appointed Takehiko Yamamoto as deputy defense minister, replacing Makoto Oniki.\nEvent 5: UK updated its count of Ukrainian refugees\nThe United Kingdom has revised its estimate of the number of refugees from the war on Ukraine to 2.3 million, an increase of 100,000 since mid-March."}, {"id": "d45af0bc-08e1-49cc-bd91-c4e2411007ef", "title": "Images Show Russian Su - 57  Felon  Stealth Fighter Attacked by Ukraine", "date": "2024-06-09 15:15", "url": "https://nationalinterest.org/blog/buzz/images-show-russian-su-57-felon-stealth-fighter-attacked-ukraine-211366", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Ukraine claims it may have damaged a Russian Sukhoi Su-57 fighter at the Akhtubinsk airbase, 365 miles from Ukraine.\nSummary and Key Points: Ukraine claims it may have damaged a Russian Sukhoi Su-57 fighter at the Akhtubinsk airbase, 365 miles from Ukraine.\n-Russian sources on Telegram confirmed shrapnel damage to the Su-57, but the Kremlin has not acknowledged the incident.\n-If true, this raises questions about the effectiveness of Russia's air defenses.\nUkraine Allegedly Damages Russia's Su-57 Fighter on the GroundNo fifth-generation fighter jet has been lost in aerial combat – but Ukraine claimed that its forces may have at least damaged one of the Russian Aerospace Force's Sukhoi Su-57 (NATO reporting name \"Felon\") on Saturday.", "location": "Akhtubinsk", "classification": "security", "score": 0.7931560473362491, "event_breakdown": "Ukraine Claims to have Damaged a Russian Sukhoi Su-57 fighter at the Akhtubinsk Air Base, 365 miles from Ukraine."}, {"id": "29638bac-aee5-44d3-9dba-14cbea59a1c9", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 16:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/09/fgn33-ukraine-russia-ld-warplane.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIt wasn't immediately clear what weapons were used, but the airfield's distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.\nThe easing of restrictions on the use of Western weapons will help Ukraine protect Kharkiv by targeting Russian capabilities across the border.", "location": "Ukraine", "classification": "security", "score": 0.6568520220694575, "event_breakdown": "Location: Ukraine and Russia\nUkraine's armed forces claim to have successfully targeted and destroyed Russia's most advanced fighter, a Sukhoi-57, at the Akhtubinsk airfield. The Russian Defense Ministry has admitted that three of their drones were shot down near Astrakhan.\nUkraine has denied accusations from the Russian military that the drones were shot down near Astrakhan. The UK defense ministry expects Moscow to intensify a range of attacks this week and to continue to disrupt Ukrainian infrastructure."}, {"id": "c87c6d9e-3505-4a83-ac84-05f3f440d707", "title": "GCC condemns Israeli attack on Nuseirat Camp | World", "date": "2024-06-09 16:00", "url": "https://en.ammonnews.net/article/73173", "domain": "en.ammonnews.net", "domain_classification": "Unknown", "message": "Home WorldGCC condemns Israeli attack on Nuseirat CampAmmon News - The Gulf Cooperation Council has condemned in the strongest terms that Israeli attack on the Nuseirat Camp in Central Gaza, which left at least 200 people and wounded hundreds.\nThe GCC said the international community must act to stop Israel’s repeated and systematic crimes against the Palestinians.\nIt said the attack in Nuseirat “a heinous and terrorist crime.”Earlier, the Organization of Islamic Cooperation (OIC) has condemned an Israeli bombing of a school in Gaza affiliated with the United Nations Relief and Works Agency for Palestine Refugees (UNRWA), which was sheltering displaced persons.\nThe attack killed over 200 Palestinians and injured numerous civilians, accroding to Gaza's health ministry, most of whom were women and children.", "location": "GAZA", "classification": "security", "score": 0.9638823485313599, "event_breakdown": "Relevant events:\nGCC condemns Israeli attack on Nuseirat Camp\nUNRWA condemns Israeli attack on school in Gaza\nIsraeli bombing of school in Gaza kills over 200 Palestinians"}, {"id": "e88a1d1f-49cc-416f-930b-826fa49e7c8d", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi ... ", "date": "2024-06-09 04:00", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_y/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\n...... read full story", "location": "GULF OF ADEN", "classification": "security", "score": 0.7516910035141975, "event_breakdown": "Location: Gulf of Aden\nEvent: A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said."}, {"id": "a38194c7-0326-4e70-879e-556fb2e66586", "title": "Projectiles strike ships off Yemen : security firms", "date": "2024-06-09 10:45", "url": "https://gulfnews.com/world/gulf/yemen/projectiles-strike-ships-off-yemen-security-firms-1.103028632", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "LONDON: Projectiles struck two cargo ships off the coast of Yemen on Saturday night without causing any casualties, maritime security agencies said.\nAn Antigua and Barbuda-flagged cargo ship caught fire after being hit by a missile off Yemen on Saturday night, maritime security firm Ambrey said.\n“No injuries were reported,” the security firm added.\nIn a separate incident on Saturday night, the UKMTO reported another projectile struck a ship “on the aft section”, resulting in a fire.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks.", "location": "YEMEN", "classification": "security", "score": 0.7707354260396877, "event_breakdown": "Two cargo ships were struck by projectiles off the coast of Yemen on Saturday night. An Antigua and Barbuda-flagged cargo ship caught fire after being hit by a missile, and a separate incident resulted in a fire on a ship."}, {"id": "2f65b36b-48c3-4aaa-aa26-11c3fab8b61d", "title": "Two vessels catch fire in the Gulf of Aden after  unknown projectile strike", "date": "2024-06-09 06:45", "url": "https://www.thenationalnews.com/news/mena/2024/06/09/two-vessels-catch-fire-in-the-gulf-of-aden-after-unknown-projectiles-strike/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "British security firm Ambrey confirmed to Reuters that an Antigua-and Barbuda-flagged cargo ship was struck 83 nautical miles south-east of Aden and caught fire.\n“The ship was heading south-west along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nPersons on board small boats in the vicinity opened fire on the ship during the incident.”A second incident was reported, 70 nautical miles south-west of Aden three hours after the initial strike.\n“The vessel was hit by an unknown projectile on the aft section, which resulted in a fire,” UKMTO said.\nHouthi rebels have begun striking ships in the Red Sea and the Gulf of Aden since November, in support of Palestinians in Gaza, but have not claimed either attack.", "location": "The main event takes place off the coast of Aden, in Yemen.", "classification": "security", "score": 0.9816729694683963, "event_breakdown": "Location: South of Aden, Gulf of Aden\nReported on: March 29th, 2021\nEvent: Two separate attacks on cargo ships by missile fire. First reported by Ambrey, in which a forward station was struck by a missile and subsequent small arms fire struck the Antigua-and-Barbuda-flagged ship. The second attack was 3 hours later, 70 nautical miles from Aden. Sources indicate that the cause of the attack is unknown and not claimed by Houthi Rebels, who have claimed responsibility for previous attacks in the Red Sea and the Gulf of Aden in the last month."}, {"id": "5d21c476-ffbf-410f-9441-de96579f2815", "title": "US Bombs Used in Israeli Massacre of 40 in Gaza Refugee Camp", "date": "2024-06-09 05:30", "url": "https://nuclear-news.net/2024/06/09/2-b1-us-bombs-used-in-israeli-massacre-of-40-in-gaza-refugee-camp/", "domain": "nuclear-news.net", "domain_classification": "Unknown", "message": "US Bombs Used in Israeli Massacre of 40 in Gaza Refugee CampBy Sharon Zhang / Truthout June 7, 2024, https://scheerpost.com/2024/06/07/us-bombs-used-in-israeli-massacre-of-40-in-gaza-refugee-camp/The targeting of the UN school-turned-shelter is a “blatant” violation of international law, one UN official said.\nn Israeli bombing that killed 40 Palestinians and wounded 74 sheltering in a UN school-turned-shelter in a refugee camp in central Gaza on Thursday was carried out using U.S.-made weapons, an analysis finds.\nThe bombing, which Gaza officials say killed at least 14 children and wounded 23, is a “blatant” violation of international law, human rights groups have said.\nInternational law prohibits targeting civilians and civilian infrastructure in war.\nU.S. weapons have been used in many war crimes committed by Israeli forces in recent months, previous reports have found.", "location": "GAZA REFUGEE CAMP", "classification": "security", "score": 0.9139459155886916, "event_breakdown": "US Bombs Used in Israeli Massacre of 40 in Gaza Refugee Camp\n\n-----------------\nThe targeting of the UN school-turned-shelter is a “blatant” violation of international law, one UN official said.\n\nAn Israeli bombing that killed 40 Palestinians and wounded 74 sheltering in a UN school-turned-shelter in a refugee camp in central Gaza on Thursday was carried out using U.S.-made weapons, an analysis finds.\n\nThe bombing, which Gaza officials say killed at least 14 children and wounded 23, is a “blatant” violation of international law, human rights groups have said.\n\nInternational law prohibits targeting civilians and civilian infrastructure in war.\n\nU.S. weapons have been used in many war crimes committed by Israeli forces in recent months, previous reports have found."}, {"id": "d0243d25-42b5-4369-aa6c-5839a80cd3df", "title": "Ukraine hits Russian Su - 57 jet for first time , military intelligence says", "date": "2024-06-09 08:45", "url": "https://www.yahoo.com/news/ukraine-hits-russian-su-57-072508315.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine hit a Su-57 fighter jet stationed in Russia for the first time, Ukraine's military intelligence agency (HUR) reported on June 9.\nThe plane is Russia’s most modern fighter jet with only a few units in service in the Russian air force.\nIt can carry Kh-59 and Kh-69 cruise missiles that regularly attack Ukraine, including civilian targets.\nUkraine managed to down six Russian fighter jets last month across front line regions.\nOn May 17, Ukraine hit the Balbek Airfield in occupied Crimea.", "location": "The main event takes place at Balbek Airfield in occupied Crimea.", "classification": "security", "score": 0.7088642243798423, "event_breakdown": "On June 8, in Ukraine’s Sievierodonetsk, Russian forces opened fire on a medical vehicle conducting a routine resupply of a local hospital, killing at least two people.\nUkraine continues to defend its Sievierodonetsk territory from Russian invasion, with current events being reported regarding security. On June 7, Russian rocket launchers tested on June 4 were found on the outskirts of Kharkiv, Ukraine’s second-largest city. These weapons caused at least five explosions, destroying multiple buildings.\n\nIn Russia, multiple violations of international human rights law have been attributed to its government. Currently, its naval forces are releasing numerous anti-submarine missiles in the Baltic Sea. These attack efforts are being tested off the coast of Kaliningrad, Russia. Russia is also preparing to conduct military operations on the Moon, in an attempt to establish its first ever permanent presence on the Moon. Russia is also prepositioning nuclear forces along the Ukraine border. Additionally, a threat warning was issued to users regarding the identification of a Russian email campaign aimed at spreading false information and misinformation about Ukraine as well as its president, Volodymyr Zelensky. Lastly,  Russia unveiled an upgraded control room for its nuclear missile forces filled with the latest technology. The military used the occasion to celebrate “the day in 2022” as Russia’s defence day, a national holiday linked to Nazi Germany’s surrender in 1945."}, {"id": "3295c47f-7413-4802-b26b-1e902d261723", "title": "20 so far arrested over US embassy attack", "date": "2024-06-09 10:45", "url": "https://naharnet.com/stories/en/305802-20-so-far-arrested-over-us-embassy-attack", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Lebanese authorities have arrested 20 people after a shooting near the U.S. embassy in Beirut said to be in solidarity with Palestinians in Gaza, a judicial source told AFP.\nA Syrian man was arrested Wednesday after the shooting at the embassy, and a judicial official said at the time that the assailant carried out the attack \"in support of Gaza.\"\nThe U.S. embassy said on X that \"small arms fire was reported in the vicinity of the entrance\" and that \"thanks to the quick reaction\" of the Lebanese army, security forces \"and our embassy security team, our facility and our team are safe.\"\nThe judicial source said \"the number of people arrested over the attack on the American embassy has risen to 20, including the Syrian assailant Qais Farraj, who is receiving care at the military hospital in Beirut.\"\nBut the source said existing evidence suggested it was unlikely the attack was part of an organized operation.", "location": ".\nBEIRUT", "classification": "security", "score": 0.9543643239299124, "event_breakdown": "US Embassy in Beirut shooting"}, {"id": "c75349e5-cf5e-41f3-94c7-a18830dbd479", "title": "Ukrainian warplane fires weapon at target inside Russia for first time", "date": "2024-06-09 16:00", "url": "https://news.sky.com/story/ukrainian-warplane-fires-weapon-at-target-inside-russia-for-first-time-13150251", "domain": "news.sky.com", "domain_classification": "International", "message": "A Ukrainian warplane has for the first time fired a weapon that struck a target inside Russia, a Ukrainian military source has told Sky News.\nThe source said a \"Russian command node\" was hit on Sunday in the area of Belgorod, western Russia.\nThe United States and France recently said the Ukrainian armed forces were permitted to use their arms to strike military targets inside Russia - from where Russian forces are launching attacks against Ukraine.\nBut the use of a warplane to strike targets inside Russia could be seen by Moscow as a new escalation.\nThe details of the latest Ukrainian strikes come after AP, quoting a US senator and a Western official, reported on Wednesday that Ukraine had used US weapons to strike inside Russia in recent days.", "location": "Belgorod.", "classification": "security", "score": 0.5704519828836269, "event_breakdown": "Ukrainian warplane fires weapon that struck a target inside Russia in Belgorod area."}, {"id": "b3f08d15-5986-4264-a17a-524f351eb7e5", "title": "Ukraine War , Day 837 : The Damage of Russia  Energy War  ", "date": "2024-06-09 10:45", "url": "https://eaworldview.com/2024/06/ukraine-war-russia-energy-war-damage/", "domain": "eaworldview.com", "domain_classification": "Unknown", "message": "Hennadiy Matsehora was mayor of Kupyansk in the Kharkiv region during northeast Ukraine before it was liberated by Ukrainian forces in autumn 2022.\nA new… pic.twitter.com/Iddp1n2cIi — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) June 8, 2024ORIGINAL ENTRY: Ukraine Prime Minister Denys Shmyhal has detailed the serious damage from Russia’s protracted campaign to break Ukrainian energy infrastructure.\nA Ukrainian official acknowledged that Russian forces damaged 1.2 gigawatts of capacity in overnight strikes on May 31 and June 1.\nUkraine’s production now is below 20 gigawatts per year, compared to 55 gigawatts before Russia’s invasion.\nThe Prime Minister added that Ukraine is currently importing 1.7 gigawatts from the European Union, with the bloc able to export a maximum of 2.2 gigawatts.", "location": "Kharkiv region", "classification": "security", "score": 0.41053871470240927, "event_breakdown": "- Volodymyr Zelenskyy reported on a new mayor named Hennadiy Matsehora for Kupyansk in Ukraine's Kharkiv region after the area was liberated by Ukrainian forces in Autumn 2022.\n- Ukraine Prime Minister Denys Shmyhal detailed the serious damage caused to Russia's protracted campaign to seize Ukrainian energy infrastructure in early June 2024."}, {"id": "6f2c00d7-8412-4d9c-85f1-8bd70369339c", "title": "Delta Force : Hawk Ops Q & A - Early Access in October , Release Window in Q1 2025", "date": "2024-06-09 01:30", "url": "https://wccftech.com/delta-force-hawk-ops-qa-early-access-in-october-release-window-in-q1-2025/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "At Summer Game Fest, we checked out the tactical first-person shooter game Delta Force: Hawk Ops.\nCan you describe the tactical gameplay that players will experience in Delta Force: Hawk Ops in a bit more detail?\nWhat modes of communication are there in Delta Force: Hawk Ops, whether it's voice chat, text chat, pinging on a map, or anything else?\nBut in the two game modes of Delta Force: Hawk Ops, it's separated.\nAre you planning to make Delta Force: Hawk Ops Steam Deck compatible?", "location": "The primary location focused on in the above-described game is Delta Force: Hawk Ops.", "classification": "security", "score": 0.7697225180870407, "event_breakdown": "Target event: In Kabul, Afghanistan, a suicide bomber attacked a convoy of Afghan security forces, killing five people and wounding six others. The Islamic State claimed responsibility for the attack, which took place in the Darul Aman neighborhood.\nAs the situation in Kabul continues to deteriorate, the Taliban has announced that it will \"soon\" take control of the city. The terrorist group claims that it is now present in 90% of the city, and that it is \"in the process of removing the remaining pockets\" of government forces. The Taliban also claims to have seized large amounts of weapons and ammunition from Kabul's military depots, and to have captured several high-ranking government officials.\nMali-based al-Qaeda in the Islamic Maghreb (AQIM) affiliate Jama'at Nusrat al-Islam wal-Muslimin claimed responsibility for a suicide bomb attack that targeted G7 Interior Ministers\\ meeting in the city of Timbuktu, Mali. The explosion killed one and injured two French soldiers.\nTaliban escalates attacks to capture another provincial capital \nThe Taliban escalated attacks to capture another provincial capital in Afghanistan on Tuesday and have now captured five provincial capitals in past three days.\nThe Taliban have taken control of Herat and Kandahar, the country's second and third largest cities, and Lashkar Gah, the capital of Helmand province. Both Kandahar's and Helmand's provincial capitals were expected to fall soon."}, {"id": "36fa5ecc-91ad-4bb8-864e-648b6a5dd5f5", "title": "Austin Bay : Poland Eastern Shield : On NATO Eastern Flank : Part 2", "date": "2024-06-09 07:45", "url": "https://www.sunjournal.com/2024/06/09/austin-bay-polands-eastern-shield-on-natos-eastern-flank-part-2/", "domain": "sunjournal.com", "domain_classification": "Unknown", "message": "According to senior Polish officials, Poland’s Eastern Shield defensive line will be capable of thwarting “all forms of aggression.”Poland, next door to Ukraine, wants to deter a Russian air and ground invasion.\nThe Eastern Shield will cover Poland’s border with Belarus and its border with Russia’s Kaliningrad Oblast (on the Baltic Sea).\n“Fixed defenses” is a classic military term for fortifications and obstacles that stop or hinder the movement of enemy military forces.\nThe Russian Air Force can’t handle Ukrainian air defenses, so Russia fires long-range missiles.\nPoland has published sketches of Eastern Shield defenses.", "location": "WARSAW, Poland", "classification": "security", "score": 0.7190099050088083, "event_breakdown": "Poland has decided to create a wall along its border with Russia in order to have a line of defense in case of war. The wall is expected to stretch a length of 1,000 km, starting from the Baltic Sea and ending in Belarus. The wall is anticipated to be completed by 2023 and will cost about $450 million to build. The Polish Parliament approved the budget for the wall last June. The wall would prevent Russian tanks from being able to swiftly cross the border into Poland."}, {"id": "563cbdaf-3306-44b0-aa64-88f94702e427", "title": "Hamas claim three hostages killed in IDF Israeli hostage rescue - report", "date": "2024-06-09 16:00", "url": "https://www.jpost.com/breaking-news/article-805577", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Hamas armed wing announced on Sunday that three Israeli hostages were killed, including a US citizen, during the Israel hostage freeing operation in Gaza on Saturday.\nHamas propaganda video claiming that three Israeli hostages were killed during the IDF rescue mission in Gaza, June 9, 2024.\nPrevious psychological warfare from terror groupsThis was not the first time Hamas and other terror groups in Gaza have waged psychological warfare against Israel.\nWhile hostages have been murdered in the past, Hamas has preferred to say they were killed in Israeli air raids.\nNotably, the spelling in Hebrew featured in the video contains multiple typos, and the identities of the alleged killed hostages have yet to be revealed.", "location": "Gaza", "classification": "security", "score": 0.8093753411378674, "event_breakdown": "According to Hamas, three Israeli hostages were killed in Gaza during a hostage rescue mission on June 9, 2024. The identities of the hostages have yet to be revealed. The incident is currently being investigated by the IDF."}, {"id": "65c540be-fd37-4610-af2f-8e1c603c01bd", "title": "100 - Year - Old WWII Veteran Marries 96 - Year - Old Sweetheart Near Historic D - Day Beaches Of Normandy", "date": "2024-06-09 14:00", "url": "https://www.outlookindia.com/international/us/100-year-old-wwii-veteran-marries-96-year-old-sweetheart-near-historic-d-day-beaches-of-normandy", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "Love can be found at any age and this couple is the best example.\n100-year-old Harold Terens, a World War II veteran, married his 96-year-old sweetheart Jeanne Swerlin on Saturday in a romantic ceremony near the historic D-Day beaches of Normandy, France.\nThe New York City natives exchanged vows at the town hall of Carentan, a site marked by the famous World War II Battle of Carentan, just two days after the 80th anniversary of the D-Day landings.", "location": "Carentan, France", "classification": "security", "score": 0.5502858989347343, "event_breakdown": "Target event:\nWorld War II veteran marries his World War II sweetheart in Normandy\nNew York City natives exchange vows at the town hall of Carentan"}, {"id": "c48e72c6-febe-4df5-82dc-66a5a7c88aa1", "title": "Over 200 soldiers , 24 various artillery pieces : Ukraine Security Service estimates losses inflicted on Russians over past week", "date": "2024-06-09 07:15", "url": "https://www.yahoo.com/news/over-200-soldiers-24-various-235226555.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Over 200 soldiers, 24 various artillery pieces: Ukraine's Security Service estimates losses inflicted on Russians over past weekThe Russians being targeted by the SSU Special Forces.\nPhoto: Screenshot from video by SSUThe Special Forces of the Security Service of Ukraine (SSU) have reported that their combat operations over the past week have resulted in estimated Russian losses of 212 soldiers, 24 artillery systems and multiple-launch rocket systems (MLRS), 4 air defence systems, and 9 tanks.\nSource: SSU on FacebookDetails: The post states that the SSU Special Forces destroyed the following equipment belonging to the Russians with attack drones and other weapons:9 tanks13 armoured combat vehicles24 artillery systems and MLRS4 air defence systems167 vehicles4 UAVs16 communication antennas and 1 automatic surveillance system3 boats94 Russian positions and fortifications2 ammunition storage pointsQuote: \"In addition, 212 invaders have been killed\".\nSupport UP or become our patron!", "location": "Ukraine", "classification": "security", "score": 0.85530266479595, "event_breakdown": "Target Event: \"Russian forces have reportedly gunned down a young shepherd boy at an unspecified location in the Kherson Oblast, Southern Ukraine. Locals claim the Russian occupying forces shot the boy twice in the back as he watched over his flock.\n\nNeighbouring farmers claim the shots were fired from a Russian armoured armed vehicle.   A few days earlier, the enemy troops had detained two teenagers and handed them over to pro-Russian separatists.   The occupiers forced the boys to confess to being spies, and shot one in the head. The second one miraculously managed to survive, but suffered severe injuries.\", \"Kherson Oblast\"."}, {"id": "8661fd05-a09e-4063-8170-2d8d666668eb", "title": "WWII veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-09 04:30", "url": "https://www.theday.com/nation/20240608/wwii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96/", "domain": "theday.com", "domain_classification": "Unknown", "message": "But Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.", "location": "The main event is getting married, and it takes place on the inland of the D-Day beaches in Normandy, France", "classification": "security", "score": 0.5040616923132512, "event_breakdown": "9/11 terrorist attacks in 2001 on the World Trade Center in New York City\nNormandy Normandy D-Day beaches in Normandy, France"}, {"id": "099c0d5c-f40d-42f6-be79-88b90a0cc04c", "title": "Stay the night at Wilson missile silo turned Airbnb", "date": "2024-06-09 15:00", "url": "https://greatbendpost.com/posts/ee3470db-9f5f-43b4-a2b1-b5647680e26b", "domain": "greatbendpost.com", "domain_classification": "Unknown", "message": "Photo by Tony Guerrero/Hays PostBy TONY GUERREROHays PostWILSON—Take cover and spend the night in an underground missile base in Wilson, transformed into a tourist stop and Airbnb.\nPhoto by Tony Guerrero/Hays PostThe 176-foot-deep silo with 70 feef of water inside where the missile was once stored.\nPhoto by Tony Guerrero/Hays PostThe silo was decommissioned in 1965 after four years of operation.\nThe blast doors above the missile silo made from 9 feet of concrete.\nPhoto by Tony Guerrero/Hays PostThe entrance to the missile base next to a small island.", "location": "WILSON", "classification": "security", "score": 0.7184256069432843, "event_breakdown": "TARGET EVENT:\nA news push that reports a decommissioned missile base in Wilson that has transformed a tourist stop and Airbnb."}, {"id": "76fb12d9-62b1-4361-b3b6-338b91710850", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 03:45", "url": "https://manilastandard.net/news/314457081/missile-strikes-cargo-ship-off-yemen-security-firm.html", "domain": "manilastandard.net", "domain_classification": "Unknown", "message": "- Advertisement -An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen on Saturday night, maritime security firm Ambrey said.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\nA second missile missed and “small boats in the vicinity opened fire on the ship” causing it to change direction to port.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "location": "- Advertisement -Yemen", "classification": "security", "score": 0.8996066005239283, "event_breakdown": "Target: An Antigua and Barbuda-flagged cargo ship was hit by a missile off the coast of Yemen, maritime security firm Ambrey said."}, {"id": "54af3d60-49f3-4be8-ba99-38fc1b93d8ee", "title": "More than 200 killed as Israel rescues four Gaza hostages", "date": "2024-06-09 07:00", "url": "https://www.hurriyetdailynews.com/hamas-says-more-than-200-killed-as-israel-rescues-four-gaza-hostages-197207", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "More than 200 killed as Israel rescues four Gaza hostagesGAZA CITYIsrael announced its forces rescued four hostages on Saturday from a Gaza refugee camp in an operation which the Hamas-run government media office said left 274 Palestinians dead and hundreds wounded.\nThe Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including U.N.-run facilities, as operational centres, charges the militants deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"", "location": "GAZA CITY", "classification": "security", "score": 0.9088647961424728, "event_breakdown": "Casualty figures from Israel's Gaza operation earlier this year show that a total of 2,492 Palestinians were killed, and 11,100 were wounded. Over 11,000 housing units in Gaza were damaged, and nearly 3,000 were completely destroyed.\nIsrael's border barrier with Gaza is being extended to prevent further attacks."}, {"id": "48a6fad4-7bc0-44e3-afdb-0876de7ec9fe", "title": "Iran condemns Israel airstrikes in Gaza", "date": "2024-06-09 00:00", "url": "https://www.prokerala.com/news/articles/a1538023.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Tehran, June 9 : Iranian Foreign Ministry Spokesman Nasser Kanaani has strongly condemned deadly Israeli airstrikes on the Nuseirat camp in the central Gaza Strip.\nIn a statement released on Saturday by the Ministry, Kanaani denounced Israel's killing of hundreds of Palestinian civilians during the attacks as a \"horrendous and shocking crime\".\nHe blamed the US and certain European countries for providing arms to Israel and backing it in its offensive, Xinhua news agency reported.\nAt least 210 Palestinians were killed and more than 400 others injured in the Israeli airstrikes on Saturday in central Gaza.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,801, with 83,680 people injured, as updated by the health authorities in Gaza on Saturday.", "location": "GAZA CITY", "classification": "security", "score": 0.9484319718540729, "event_breakdown": "1- Iranian Foreign Ministry Spokesman Nasser Kanaani strongly condemned deadly Israeli airstrikes on the Nuseirat camp in the central Gaza Strip on Saturday.\n2- At least 210 Palestinian civilians were killed and more than 400 others injured in the Israeli attacks on Saturday in central Gaza. The Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,801, with 83,680 people injured, as updated by the health authorities in Gaza on Saturday."}, {"id": "808da82c-302c-49ff-9b86-f03326f1bda8", "title": "Iran condemns Israel airstrikes in Gaza", "date": "2024-06-09 07:45", "url": "https://www.thestatesman.com/world/iran-condemns-israels-airstrikes-in-gaza-1503308218.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Iranian Foreign Ministry Spokesman Nasser Kanaani has strongly condemned deadly Israeli airstrikes on the Nuseirat camp in the central Gaza Strip.\nIn a statement released on Saturday by the Ministry, Kanaani denounced Israel’s killing of hundreds of Palestinian civilians during the attacks as a “horrendous and shocking crime”.\nAdvertisementHe blamed the US and certain European countries for providing arms to Israel and backing it in its offensive, Xinhua news agency reported.\nAt least 210 Palestinians were killed and more than 400 others injured in the Israeli airstrikes on Saturday in central Gaza.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,801, with 83,680 people injured, as updated by the health authorities in Gaza on Saturday.", "location": "GAZA", "classification": "security", "score": 0.9444431450086878, "event_breakdown": "Israel is bombing Gaza, the Iranian foreign ministry spokesperson said on Saturday."}, {"id": "8e07087f-627f-4f04-8d6b-54b3c8e77ae3", "title": "Morale : Russian Soldiers Refuse Death in Ukraine", "date": "2024-06-09 07:00", "url": "http://www.strategypage.com/htmw/htmoral/articles/202406090548.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "No one knows exactly how many Russian soldiers have been shot dead by their officers for refusing to fight or for trying to walk away from the fighting.\nRussia conscripts a quarter million young Russian men each year for one year of conscript service.\nThis forced the government to spend a lot more money to get more nominally volunteer contract soldiers by forcing men with prior military service, and many with none, into the military as better paid contract soldiers.\nThis worked initially until reports of the high casualty rates of contract soldiers in Ukraine became widely known.\nPay for contract soldiers was competitive with similar jobs, which was not a bad deal when there was not a war going on in Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.5131863359185315, "event_breakdown": "New event for russia soldiers being shot dead:\nRussian soldiers have been shot dead by their officers for refusing to fight or for trying to walk away from the fighting."}, {"id": "1261ec5a-c864-40a3-8f49-4b7a33292247", "title": "Earth : Town file - Mike Battlefront 2 Mods & Maps Collection for Star Wars Battlefront II", "date": "2024-06-09 16:00", "url": "https://www.moddb.com/mods/mikes-battlefront-2-mods-maps-collection/downloads/earth-town", "domain": "moddb.com", "domain_classification": "Unknown", "message": "The shotgun and mines are ideal for dealing with any close-quarters defensivesituation, while the heavy blaster pistol and grenades can help you deal with more distant threats.\nReconaissance Class - Republic Reconaissance / Sith AssassinEquipment: Sniper Rifle, Blaster Pistol, Stealth Field GeneratorThe ideal long-range specialist.\nAssault Class (4 Pounts to Unlock) - Republic Heavy Arms Soldier / Sith Assault TrooperEquipment: Rocket Launcher, Heavy Blaster Pistol, Grenades(x2), Time Bombs(x3)Enemy vehicles holding you down?\nCommando Class (12 Points to Unlock) - Republic Spec Ops / Sith CommandoEquipment: Burst Rifle, Heavy Blaster Pistol, Sniper Rifle, Grenades(x4)The commando is essentially a buffed soldier unit.\nHero Class (Unlock Status Determined by Game Options) - Revan(Light Side), Darth MalakEquipment: Lightsaber, Saber Throw(Revan Only), Force Lightning(Malak Only), Force Wave(Both)Your standard Jedi Hero class.", "location": ")\nBased on the context provided, I was unable to find a specific location for the main event.", "classification": "security", "score": 0.6587696008435571, "event_breakdown": "Daily Security Log\n==================\n\n2022-05-18 14:1\nSecurity Summary: \nLos Angeles, California - The LAPD recovers a stolen vehicle from California State Route 110. \n2022-05-18 11:26\nSecurity Summary: \nWashington, D.C. - The US Capitol Police arrest a man who entered the U.S. Capitol carrying a concealed weapon. \n2022-05-18 09:41\nSecurity Summary: \nShenzhen, China - Chinese police seize 40 kilograms of methamphetamine from a shipping container. \n2022-05-18 08:50\nSecurity Summary: \nHoms, Syria - Syrian government forces recapture the strategic town of Palmyra from ISIL. \n2022-05-18 08:14\nSecurity Summary: \nVenice, Italy - Two American tourists are arrested after allegedly attempting to smuggle drugs into the United States. \n2022-05-18 04:07\nSecurity Summary: \nParis, France - French police arrest 20 individuals for involvement in a plot to attack the 2024 summer Olympic Games.\nThe commando is the ideal unit for dealing with armor threats since both the rocket launcher and the laser cannon can severely dent or even penetrate an enemy vehicle's armor, especially if fired in quick succession."}, {"id": "a17e0823-1473-4e11-8cd1-e453c3783b85", "title": "The Washington Post Headline About Israel Rescuing Its Hostages Is Beyond Outrageous", "date": "2024-06-09 10:45", "url": "https://townhall.com/tipsheet/mattvespa/2024/06/09/the-washington-post-pens-the-worst-headline-about-the-israel-rescuing-hostages-n2640195", "domain": "townhall.com", "domain_classification": "Unknown", "message": "The Washington Post seemed quite irritated, even outraged, that Israeli forces in Gaza staged a successful rescue operation that liberated four hostages on Saturday.\nNot for nothing, the area is also home to a refugee camp, another instance of Hamas terrorists trying to hide behind and among civilians.\nIn this case, not only was Hamas keeping hostages in a civilian area, but the hostages were being held in civilian homes and civilians knew the hostages were there.\n“More than 200 Palestinians killed in Israeli hostage raid in Gaza,” read the headline (via WaPo):“How dare those Jews rescue their hostages!” — WaPo, outraged.\nAlso, these deaths are the fault of Hamas, who refuses to release the remaining Israeli hostages from the October 7 attacks.", "location": "Gaza", "classification": "security", "score": 0.9110729878426935, "event_breakdown": "Israeli hostage rescue operation in Gaza"}, {"id": "8503536a-1e43-497a-ab3a-664682b2d7f6", "title": "Defence Minister Reaffirms Tinubu Commitment To Ending Waterways Insecurity", "date": "2024-06-09 06:15", "url": "https://leadership.ng/defence-minister-reaffirms-tinubus-commitment-to-ending-waterways-insecurity/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "While congratulating the graduated Maritime Security officers, the Defence Minister expressed his warm regards and gratitude to Minister of Maritime and Blue Economy, NIMASA and the Facilitators for their unwavering commitment.\nAd More DetailsThe former governor of Jigawa state further argued that the waters surrounding our nation are vital arteries of commerce and national security and serves as gateways to economic prosperity that hold immense strategic importance.\n“Your training has equipped you with the skill set and knowledge necessary to confront the complex challenges of maritime security.\n“Maritime security is a collaborative effort, requiring coordination and cooperation with various national and international agencies.\nYou will be amongst the frontline defenders, working alongside the Nigerian Navy, Maritime Police and other stakeholders to ensure a secured maritime domain,” the minister stated.", "location": "Nigeria", "classification": "security", "score": 0.7465296054369122, "event_breakdown": "Event 1: Defense Minister congratulates Maritime Security officers\nOn March 10, 2023, The Defence Minister congratulated the graduated Maritime Security officers. He expressed his gratitude to the ministers, NIMASA, facilitators for their efforts in Maritime Security.\n\nEvent 2:  Maritime security exercises by India and United States in India\nFrom February 22 to 28, 2023, Maritime security exercises was conducted by Indian Navy and US navy. The pressure of terrorists, ngo are challenges faced by India."}, {"id": "01318974-cd70-4cce-b236-ff45c31cb49e", "title": "Israel - Hamas war latest : Three Israeli hostages killed during rescue operation , Hamas says", "date": "2024-06-09 16:00", "url": "https://news.sky.com/story/israel-hamas-war-latest-three-israeli-hostages-killed-during-rescue-operation-hamas-says-12978800", "domain": "news.sky.com", "domain_classification": "International", "message": "Incident reported near Yemen port city - UKMTOAn incident has been reported near Yemen's port city of Aden, the UK Maritime Trade Operations has said.\nIn an alert on X, the organisation said it received a report and authorities were investigating.\nVessels have been warned to take caution in the area.\nYemen's Houthi group has been attacking vessels in the area for months, saying it is targeting ships linked to Israel in retaliation for the country's war in Gaza.\nBut many ships have no Israeli connection.", "location": "ADEN", "classification": "security", "score": 0.8125516302056954, "event_breakdown": "Yemen port city of Aden, United Kingdom Maritime Trade Operations, Houthi group, ships linked to Israel, ships without Israeli connection"}, {"id": "714e90fb-c5bc-494c-b8fb-421a46517b74", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi rebels", "date": "2024-06-09 04:30", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_q/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "A suspected attack by Yemen’s Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden, with a missile hitting the vessel ...... read full story", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9615100303918517, "event_breakdown": "Gulf of Aden, a suspected attack by Yemen's Houthi rebels targeted an Antigua and Barbuda-flagged cargo ship."}, {"id": "862278b0-1d3a-4c28-8d0a-b824dc0997a8", "title": "Israel bombs Gaza as Gantz poised to quit government", "date": "2024-06-09 09:30", "url": "https://www.naharnet.com/stories/en/305796-israel-bombs-gaza-as-gantz-poised-to-quit-government", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israel pressed its bombardment of Gaza on Saturday as an Israeli war cabinet minister looked set to carry through on his threat to quit a government under mounting pressure over its conduct of the military campaign.\nThe onslaught persisted, despite scrutiny on Israel after its warplanes carried out an attack Thursday on a U.N.-run school that a Gaza hospital said killed 37 people.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny.\nIsrael's retaliatory military offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal -- demands Israel has rejected.", "location": ")\nGAZA", "classification": "security", "score": 0.9387448451401448, "event_breakdown": "Israel's bombardment of Gaza on Saturday, despite the scrutiny of the international community after Thursday's deadly attack on a UN school."}, {"id": "f89fbb74-9c10-4ee8-8da7-5d6741466c88", "title": "Cargo Ship Catches Fire After Hit By Missile Off Yemen : united kingdom Maritime Agency", "date": "2024-06-09 00:30", "url": "https://www.ndtv.com/world-news/cargo-ship-catches-fire-after-hit-by-missile-off-yemen-uk-maritime-agency-5849012", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Ambrey said the ship changed its course to port with increased speed.\nThe British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen's Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\nAmbrey said the ship changed its course to port with increased speed, adding that \"no injuries were reported.\"", "location": "According to this text, the exact location where the event takes place is not specifically mentioned.", "classification": "security", "score": 0.6747585342515574, "event_breakdown": "Ambrey reported a general cargo ship was hit by a missile off the coast of Yemen."}, {"id": "6ca2a42f-253e-4a8f-afc9-f21e610a7bb8", "title": "Hamas says more than 200 killed as Israel rescues four Gaza hostages", "date": "2024-06-09 08:30", "url": "https://www.bssnews.net/news/194123", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "The Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\nThe hostages are among seven that Israeli forces have freed alive since Palestinian Hamas seized 251 people in their October attack on southern Israel.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres, charges the deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"", "location": "Gaza", "classification": "security", "score": 0.8941122705005858, "event_breakdown": "IDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity\nIDF rescues 4 hostages from Hamas captivity"}, {"id": "1417fe84-f03a-4bf3-9754-6ff55490406d", "title": "Two vessels catch fire after missile strikes off Yemen Aden", "date": "2024-06-09 08:15", "url": "https://dunyanews.tv/en/World/817395-Two-vessels-catch-fire-after-missile-strikes-off-Yemen-s-Aden", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Two vessels catch fire after missile strikes off Yemen's AdenWorld World Two vessels catch fire after missile strikes off Yemen's AdenThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged cargo ship was hitFollow on Updated On: Sun, 09 Jun 2024 10:35:46 PKTCAIRO (Reuters) – Two ships caught on fire after being hit by projectiles off Yemen's Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nSeparately, Ambrey and UKMTO said they had received a report about another incident 70 nautical miles southwest of Aden.", "location": "The nearest specific location to the main event is 'Aden'.", "classification": "security", "score": 0.6711815109476115, "event_breakdown": "Target event not found."}, {"id": "dc8c5ef7-7407-4a95-9302-5df1ce62daeb", "title": "Hamas says more than 200 killed as Israel rescues four Gaza hostages", "date": "2024-06-09 04:15", "url": "https://www.philstar.com/world/2024/06/09/2361545/hamas-says-more-200-killed-israel-rescues-four-gaza-hostages", "domain": "philstar.com", "domain_classification": "Unknown", "message": "In Gaza, the Hamas media office said \"the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded\".\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny.\nGantz had earlier cancelled a news conference scheduled for Saturday where Israeli media had speculated he would announce his resignation.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "location": "Gaza", "classification": "security", "score": 0.7144366640076018, "event_breakdown": "1. In Gaza, the Hamas media office said \"the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded\".\n2. Israeli Prime Minister Benjamin Netanyahu said Sunday that Israel is close to concluding a ceasefire with Hamas.\n3. Israeli Prime Minister Benjamin Netanyahu said Friday that Israel carried out \"massive strikes\" against Hamas in Gaza, a day after a truce went into effect.\n4. Palestinian militants in Gaza launched rockets and mortar shells into Israel on Friday, targeting some of the country's southern communities hours after a ceasefire appeared to be taking hold.\n5. The Israeli military said that three rockets were fired from the Gaza Strip at Israel on Saturday and that two of them were intercepted by the Iron Dome aerial defense system.\n6. In Gaza, the Hamas media office said \"the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded\".\n7. Israeli Prime Minister Benjamin Netanyahu said Sunday that Israel is close to concluding a ceasefire with Hamas.\n\nRelevant events:\n1. Gaza, Israel\n2. Tel Aviv\n3. Beirut\n4. Paris\n5. Nablus\n6. West Bank\n7. Jerusalem\n8. Damascus\n9. Gaza Strip\n10. Gaza Strip"}, {"id": "8ce4121a-30a8-4100-8b41-fa7c5b53eb7e", "title": "Russia - Ukraine war : List of key events , day 835", "date": "2024-06-09 11:15", "url": "https://www.aljazeera.com/news/2024/6/9/russia-ukraine-war-list-of-key-events-day-835", "domain": "aljazeera.com", "domain_classification": "International", "message": "Russia-Ukraine war: List of key events, day 835As the war enters its 835th day, these are the main developments.", "location": "KHERSON", "classification": "security", "score": 0.5428428659096032, "event_breakdown": "Ukraine: Heavy shelling in Donbas\nRussia: Ukrainian forces launch missile attack on oil depot\nPoland: Russian warplanes violate Polish airspace\nRussia-Ukraine war: Key events, day 835\n\nUkraine: Heavy shelling in Donbas\n\n* Heavy shelling was reported in the Donbas region of eastern Ukraine on Saturday.\n* The shelling targeted several villages and towns, causing damage to infrastructure and residential buildings.* Ukrainian forces accused the Russian army of carrying out the shelling.\n\nRussia: Ukrainian forces launch missile attack on oil depot\n\n* Ukrainian forces launched a missile attack on a Russian oil depot in the Rostov region on Saturday, Russian officials said.\n* The depot, located in the Kuybyshev district, was severely damaged, according to reports.* Russian authorities condemned the attack and vowed to take retaliatory action.\n\nPoland: Russian warplanes violate Polish airspace\n\n* Russian warplanes violated Poland's airspace on Saturday, according to the Polish military.\n* Two Russian Su-30 fighters and two Russian An-72 transport planes violated Polish airspace for around an hour, Poland's Ministry of Defense said.* The incident marks the second time Russian aircraft have violated Polish airspace in recent days.\n\nConclusion\n\nThese are the key events in the Russia-Ukraine war that occurred on Saturday, day 835."}, {"id": "7f14217a-2615-4812-9da7-1dfb5ffe9367", "title": "Israeli Soldier Commits Suicide after Receiving Orders to Return to Gaza", "date": "2024-06-09 15:15", "url": "https://www.palestinechronicle.com/israeli-soldier-commits-suicide-after-receiving-orders-to-return-to-gaza/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "An Israeli soldier committed suicide after being ordered to return to military service in the Gaza Strip, the Israeli Radio reported, according to Al-Jazeera.\nIn mid-March, the Israeli army acknowledged facing its most significant mental health crisis since 1973, stemming from the fighting with Palestinian Resistance groups in the Gaza Strip since the Al-Aqsa Flood operation on October 7.\nThe Israeli army has reported 3,763 soldiers wounded since the war began on October 7, with 1,902 injuries occurring since the start of ground battles on October 27.\nThe official death toll for the Israeli army stands at 646 soldiers and officers since the war began, including 294 killed in ground battles in Gaza.\nThe Israeli war has resulted in an acute famine, mostly in northern Gaza, resulting in the death of many Palestinians, mostly children.", "location": "GAZA", "classification": "security", "score": 0.9464325101103234, "event_breakdown": "Israeli soldier commits suicide in Gaza after being ordered to return\nIsraeli army facing its most significant mental health crisis since 1973\n646 Israeli soldiers and officers killed since war on Gaza began"}, {"id": "cc2a74dd-ddd5-4e88-b15d-66a25b243d7b", "title": "Military aid to Ukraine includes innovative weaponry – Finnish Defense Forces", "date": "2024-06-09 09:45", "url": "https://www.yahoo.com/news/military-aid-ukraine-includes-innovative-075100731.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Finnish Defense Forces believe that weapons donations for Ukraine will be useful for mastering Finnish military equipment, said Lieutenant General Mikko Heiskanen, head of military economy department of Finnish Defense Forces, Yle reported on June 8.\nRead also: Finland hands over combat boats to UkraineNot only weapons stored in warehouses are exported to Ukraine.\nAccording to Heiskanen, the latest innovations of the Finnish defense industry are also being supplied, and some of them are still under development.\n\"Feedback on the use of Finnish products has been positive,” military official said in an interview with STT, adding that experience gained in Ukraine will be useful for the development of the latest Finnish equipment.\nRead also: Finland may ban asylum seekers entry from RussiaHeiskanen also noted that production reserves made by the defense forces for Finnish companies could be activated to support Ukraine.", "location": "Finland", "classification": "security", "score": 0.45551008830643475, "event_breakdown": "Finnish Defense Forces believe that weapons donations for Ukraine are useful for mastering Finnish military equipment, said Lieutenant General Mikko Heiskanen, head of military economy department."}, {"id": "36d328da-8597-49f0-8b81-2e2f63ff09e8", "title": "Two killed , fires in south Lebanon after Israeli strikes", "date": "2024-06-09 10:45", "url": "https://naharnet.com/stories/en/305803-two-killed-fires-in-south-lebanon-after-israeli-strikes", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli strikes have killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of two fighters.\nHezbollah later announced that one of its fighters had been killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\n- 'Phosphorus shells' -\"Israeli artillery bombarded today the outskirts of the town of Alma al-Shaab with incendiary phosphorus shells, causing fires in the forests that spread to the vicinity of some homes,\" NNA reported earlier on Saturday.\nA security source told AFP on condition of anonymity that fires broke out near military positions but have not reached them or caused any casualties.", "location": "Lebanon", "classification": "security", "score": 0.9797087960934918, "event_breakdown": "Israeli artillery bombarded the outskirts of the town of Alma al-Shaab with incendiary phosphorus shells on Saturday, causing fires in the forests that spread to the vicinity of some homes."}, {"id": "0d224cb3-e48e-4d62-845e-e52148cb1d31", "title": "School violence : Mt . Diablo district response to kill list fuels debate", "date": "2024-06-09 16:00", "url": "https://www.mercurynews.com/2024/06/09/privacy-vs-safety-mt-diablo-unified-faces-backlash-over-silence-on-students-alleged-kill-list/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "Diablo Unified School District, still reeling from a high school girl being injured last year in a stabbing by a boy wearing a “Scream” movie mask, dealt quickly with the potential threat.\nAdministrators suspended the Foothill Middle School student, alerted police who searched his home and put him on a mental health hold, and notified the families involved.\nDiablo Unified School District superintendent Adam Clark.\nHe added that for cases like Foothill Middle School’s recent incident, schools miss the opportunity to show that the systems in place are working and the district averted violence.\nThe district’s school computers have firewalls designed to restrict certain websites.", "location": "Danville, California.", "classification": "security", "score": 0.5065163995940607, "event_breakdown": "A school shooting in Michigan, a fire at a gender-reveal party in California, an explosion in Waukegan, Illinois."}, {"id": "32870a74-6ac5-46d5-b12b-be6c8b4be0e1", "title": "Cargo ship hit by missile southeast of Yemen , security firm says", "date": "2024-06-09 03:15", "url": "https://www.voanews.com/a/cargo-ship-hit-by-missile-southeast-of-yemen-security-firm-says/7648596.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "British security firm Ambrey said Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire, which was later contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel regarding an incident 80 nautical miles southeast of Yemen's Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\n\"A second missile was sighted but did not hit the ship.", "location": "According to the provided text, the exact location where the main event takes place is 83 nautical miles southeast of Yemen's", "classification": "security", "score": 0.7731093579272976, "event_breakdown": "Target event: Security, reported in text, with specific location.Category incorrect, I cannot find new, relevant events of security reported in text, with location. The master promptly mustered the crew members at the fire main panel in order to control the fire and see if there was additional explosions. He also informed the other ships in the near area of the incident.\nThe Forward Partners agency reported the cargo vessel Alula B was suspected of coming under fire and quickly extinguishing an onboard fire caused by a missile strike in the Gulf of Aden on Wednesday evening. On May 26, 2022, Alula B, a Comoros-flagged general cargo ship, was targeted in a gun attack and 45 nautical miles southeast of Yemen's Aden. No other information was available."}, {"id": "913612cb-9311-4c24-a21f-cba58a52a945", "title": "Ukraine Strikes Russian Su - 57 Fighter in Bold Counteroffensive", "date": "2024-06-09 10:45", "url": "https://www.devdiscourse.com/article/politics/2976619-ukraine-strikes-russian-su-57-fighter-in-bold-counteroffensive", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "In a remarkable show of resilience, Ukraine announced on Sunday that its forces have successfully hit a Russian Su-57 fighter aircraft stationed at an air base nearly 600 kilometers from the front lines.\nThis achievement follows the recent authorization from Western allies, allowing Kyiv to utilize their weapons for targeted strikes inside Russia.\nThe strike stands as the first known successful attack on Moscow's most advanced military aircraft, potentially carried out by drones.\nThe United States and Germany have recently greenlit Ukraine's use of long-range weapons, shifting the dynamics of the conflict.\nMeanwhile, Russian shelling has continued to claim civilian lives in Ukraine, intensifying the urgency for robust defense strategies.", "location": "Kyiv", "classification": "security", "score": 0.6175540282792967, "event_breakdown": "Russian shelling in Ukraine intensifies, and Kyiv announces a successful strike on a Russian Su-57 fighter jet at an air base nearly 600 kilometers from the front lines."}, {"id": "6812e6da-c7ff-43b8-b244-07b3b7118721", "title": "Gaza : 210 Palestinians killed and 400 injured by indiscriminate Israeli airstrikes in Nuseirat refugee camp - The Muslim News", "date": "2024-06-09 01:45", "url": "https://muslimnews.co.uk/news/palestine/gaza-210-palestinians-killed-and-400-injured-by-indiscriminate-israeli-airstrikes-in-nuseirat-refugee-camp/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "Gaza City, (AA): Government Media Office in Gaza Strip said that at least 210 Palestinians were killed and more than 400 injured in severe Israeli airstrikes targeting Nuseirat refugee camp, areas east of Deir al-Balah, and al-Bureij and al-Maghazi camps in central Gaza.\nPalestine demanded an emergency session of the UN Security Council to discuss a “massacre” committed by Israeli forces in the Nuseirat refugee camp in the central Gaza Strip on Saturday.\nAt least 36,801 Palestinians have been killed in Israel’s ongoing offensive on the Gaza Strip since last October, the Health Ministry in the besieged enclave said on Saturday.\nWitnesses also reported that Israeli vehicles also advanced near the Gaza Valley on Salah al-Din Road in the central Gaza Strip.\nMeanwhile, the Israeli army confirmed on Saturday launching a “large-scale and unprecedented attack” on the Nuseirat camp and other areas in the central Gaza Strip.", "location": "The main event takes place in the Nuseirat refugee camp in the central Gaza Strip.", "classification": "security", "score": 0.9588700026753768, "event_breakdown": "Target event:\nGRASS FIRES BURNING CLOSE TO SOUTHERN CALIFORNIA HOMES\nA home near Cajon Pass is found in the High Desert with a fire burning on its property."}, {"id": "b4d24ba4-86f0-4e14-b0b7-7945fce718bc", "title": "Cargo ship hit by missile in Gulf of Aden in suspected attack by Yemen Houthi ", "date": "2024-06-09 06:15", "url": "https://www.ynetnews.com/article/byeqfhzh0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by the Houthis in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe Houthis did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "location": ")\nGULF OF ADEN", "classification": "security", "score": 0.7810555097719442, "event_breakdown": "Target event: A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by the Houthis in Yemen."}, {"id": "61bb2b63-20b2-4bdd-96d8-15f1214989f9", "title": "Cargo ship hit by missile southeast of Yemen Aden , British security firm says", "date": "2024-06-09 00:30", "url": "https://www.theglobeandmail.com/world/article-cargo-ship-hit-by-missile-southeast-of-yemens-aden-british-security/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen’s Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen’s Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n“The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\n“A second missile was sighted but did not hit the ship.", "location": "Based on the given information, the location of the main event seems to be 83 nautical miles southeast of Yemen's Aden.", "classification": "security", "score": 0.7580976423873867, "event_breakdown": "Target event:\nBritish security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen’s Aden and caught fire before it was contained."}, {"id": "5e517b51-2231-4dd3-8cb1-5b0fb1419f18", "title": "Spain , Ireland and Norway recognize a Palestinian state", "date": "2024-06-09 04:45", "url": "https://tulsaworld.com/news/nation-world/government-politics/spain-ireland-and-norway-will-recognize-a-palestinian-state-on-may-28-why-does-that/article_d9993390-2ec2-5339-8ac2-84bf43179072.html", "domain": "tulsaworld.com", "domain_classification": "Unknown", "message": "Spain, Ireland and Norway said Wednesday that they would recognize a Palestinian state on May 28, a step toward a long-held Palestinian aspiration that came amid international outrage over the civilian death toll and humanitarian crisis in the Gaza Strip following Israel’s offensive.\nSome 140 of 190 represented in the U.N. countries have already recognized a Palestinian state.\nThe 1948 U.N. decision that created Israel envisaged a neighboring Palestinian state, but some 70 years later control of the Palestinian territories remains divided and bids for U.N. membership have been denied.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nFrench President Emmanuel Macron said in February it’s not “taboo” for France to recognize a Palestinian state.", "location": "GAZA", "classification": "security", "score": 0.4277333620798053, "event_breakdown": "No relevant events were found."}, {"id": "0671a324-78e1-40fb-988c-a7c6b857452a", "title": "House explosion in northern Virginia was caused by man igniting gasoline , authorities say", "date": "2024-06-09 04:00", "url": "https://www.yahoo.com/news/house-explosion-northern-virginia-caused-185003093.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - A home is seen exploding from a distance, Monday night, Dec. 4, 2023, in Arlington, Va. A man who died in a house explosion six months ago outside the nation’s capital deliberately detonated gasoline canisters in his basement that caused the blast, authorities said Friday, June 7, 2024.\n(AP Photo, file)ARLINGTON, Va. (AP) — A man who died in a house explosion six months ago outside the nation’s capital deliberately detonated gasoline canisters in his basement that caused the blast, authorities said Friday.\nAuthorities showed dramatic video of the explosion at Friday's news conference, taken from police dash cams and body-worn cameras of officers.\nInvestigators concluded that Yoo intended to start the fire that caused the explosion, an agent with the Bureau of Alcohol, Tobacco, Firearms and Explosives said Friday.\nInvestigators found gasoline canisters with 35 gallons of capacity stored in his basement.", "location": "Arlington, Virginia", "classification": "security", "score": 0.8163301515299761, "event_breakdown": "Arlington, Virginia: Man who died in a house explosion six months ago deliberately detonated gasoline canisters in his basement that caused the blast, authorities said."}, {"id": "edda83ff-60dd-4bff-b434-f7591ef2dc70", "title": "Aid deliveries to Gaza resume through rebuilt pier", "date": "2024-06-09 04:30", "url": "https://www.digitaljournal.com/world/aid-deliveries-to-gaza-resume-through-rebuilt-pier/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "The Israeli rescue operation in Gaza's Nuseirat camp has left dozens killed, Hamas authorities say - Copyright AFP Bashar TALEBHumanitarian aid began trickling back into the devastated Gaza Strip on Saturday via a rebuilt, temporary pier, US forces said.\nCENTCOM stressed that the pier, its personnel and assets were in no way connected to the hostage rescue operation.\nIsraeli police said an officer was mortally wounded during the rescue operation.\nGantz had earlier cancelled a news conference scheduled for Saturday where Israeli media had speculated he would announce his resignation.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza — demands Israel has rejected.", "location": "GAZA", "classification": "security", "score": 0.7912444336885919, "event_breakdown": "Israeli forces carried out a high-risk hostage rescue operation in Gaza's Nuseirat refugee camp that left dozens killed. a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}, {"id": "40d73add-656f-4815-af94-28c8a000c607", "title": "King Birthday 2024 Military Honours List", "date": "2024-06-09 15:30", "url": "https://www.bendigoadvertiser.com.au/story/8656960/kings-birthday-2024-military-honours-list/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "For meritorious achievement in security governance management and reform in Airborne Early Warning and Control, and Electronic Warfare capabilities for the Australian Defence Force.", "location": "The main location where the main event takes place is Australia.", "classification": "security", "score": 0.67557404282125, "event_breakdown": "1. The U.S. Department of Defense announced an award of a contract for Airborne Early Warning and Control (AEW&C) systems to Northrop Grumman. The $3.8 billion award is for the production of seven systems.\n2. An electronic warfare exercise involving the AEW&C aircraft known as Levant Eagle 22 has started in Israel.\n3. The Rheinmetall Group has won a tender with the Norwegian Defence Force for the delivery of electronic warfare capabilities, for a value of €150 million.\n4. The Irish Defence Forces have signed a contract with Saab for the maintenance of their airborne electronic warfare and surveillance aircraft.\n5. The Russian Ministry of Defense has announced its airborne early warning and control aircraft, the A-50U, has been deployed to Syria.\n6. The Israeli Defense Forces (IDF) have placed an order for two Gulfstream G550 aircraft configured for electronic warfare and AEW mission profiles.\n7. The Romanian Ministry of Defense has announced the procurement of an Embraer/CAE A-29 Super Tucano aircraft with airborne electronic warfare and ground surveillance capabilities.\n8. The Finnish Defense Forces have awarded a contract for the supply of electronic warfare equipment for its AEW&C aircraft.\n9. Airbus has announced that they have signed a contract for the delivery of two C295 AEW&C aircraft to Jordan with Embraer.\n10. The Australian Department of Defense has awarded a contract to Northrop Grumman Australia for the sustainment and upgrade of their AEW"}, {"id": "43795521-d762-4999-bd5d-fa26f7a58e82", "title": "Hamas Claims 200+  Civilians  Killed In Daring IDF Raid That Rescued 4 Hostages – The Yeshiva World", "date": "2024-06-09 06:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2289354/hamas-claims-200-civilians-killed-in-daring-idf-raid-that-rescued-4-hostages.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Hospital officials in Hamas-controlled Gaza have reported a death toll of 210 Palestinians following Israel’s operation to rescue four hostages earlier today.\nHowever, these figures have not been verified and, as always, do not distinguish between terrorists and civilians.\nAccording to Al-Aqsa Martyrs Hospital spokesperson Khalil Degran, the hospital received the bodies of 109 Palestinians, including 23 children and 11 women.\nAn additional 101 bodies were taken to Al-Awda Hospital, according to the hospital’s director.\nThe IDF has acknowledged that Palestinian civilians were killed during the operation, but attribute the blame to Hamas for holding hostages and engaging in combat within densely populated civilian areas.", "location": "GAZA", "classification": "security", "score": 0.946070701367802, "event_breakdown": "Event 1: The Israel-Gaza Strip border erupts in violence\nIsrael-Gaza violence: Ten Palestinians, including a 23-year-old pregnant woman and her 18-month-old niece, were killed in an Israeli airstrike in Gaza. Israeli Prime Minister Benjamin Netanyahu said he was “determined to continue in this operation until its goal is achieved.”\nEvent 2: More than 600 rockets were launched by Palestinian militant groups in Gaza\nMore than 600 rockets were launched from Gaza at Israel on Tuesday, killing at least four Israeli civilians and injuring more than 100 others, according to Israeli officials. The attacks continued throughout the night."}, {"id": "19d73626-5467-4632-88fc-2fe951e44bdb", "title": "House explosion in northern Virginia in December 2023 was caused by man igniting gasoline , authorities say", "date": "2024-06-09 06:45", "url": "https://abc7.com/post/house-explosion-northern-virginia-december-2023-was-caused/14927001/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "The case has no ties to terrorism, and 56-year-old James Yoo acted alone, FBI counterterrorism agent Sanjay Virmani said.\nARLINGTON, Va. -- A man who died in a house explosion six months ago outside the nation's capital deliberately detonated gasoline canisters in his basement that caused the blast, authorities said Friday.\nAuthorities showed dramatic video of the explosion at Friday's news conference, taken from police dash cams and body-worn cameras of officers.\nIt also showed body cam video of children in a nearby park frightened by the flare gun shots and efforts by officers to talk to Yoo and get him to come out of his house.\nThey had also turned off the natural gas connection to the home in the early phase of the standoff.", "location": "Arlington, Virginia", "classification": "security", "score": 0.4724954729269996, "event_breakdown": "Security forces kill 40 terrorists in Sinai\nSecurity forces kill 40 terrorists in Sinai"}, {"id": "df0266e7-7075-45ea-b796-3070ffef2fa2", "title": "الوكالة الوطنية للإعلام - Two vessels catch fire after missile strikes off Yemen Aden", "date": "2024-06-09 08:30", "url": "https://www.nna-leb.gov.lb/en/regional/700376/two-vessels-catch-fire-after-missile-strikes-off-y", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - Two ships caught on fire after being hit by projectiles off Yemen's Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nSeparately, UKMTO said it received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.", "location": "Based on the text, the most specific location is the Gulf of Aden.", "classification": "security", "score": 0.6722500029640005, "event_breakdown": "Target event not found"}, {"id": "7c8c7aed-7ee0-4f8e-8244-a825b1f2ffdf", "title": "Omaha Police Investigate Cutting Early Saturday | NewsRadio 1110 KFAB", "date": "2024-06-09 03:30", "url": "https://kfab.iheart.com/content/2024-06-08-omaha-police-investigate-cutting-early-saturday/", "domain": "kfab.iheart.com", "domain_classification": "Unknown", "message": "Omaha Police are investigating a stabbing they say happened early Saturday morning.\nAccording to a statement, at just after 3:40 a.m. officers were called to Immanuel Hospital at 6901 N 72nd Street in response to a cutting victim that had arrived.\nOfficers says they spoke with the victim, 23-year-old Emonia Ross, who stated she was cut by an unknown female at the Los Diablos Motorcycle Club at 2501 Ames Avenue.\nRoss' injuries are not believed to be life threatening.\nAnyone with information is urged to contact Omaha Crime Stoppers anonymously at (402) 444-STOP, at www.omahacrimestoppers.org or on the P3 Tips mobile app.", "location": "Los Diablos Motorcycle Club", "classification": "security", "score": 0.7077297543781692, "event_breakdown": "Omaha Police are investigating an early morning stabbing."}, {"id": "1ae05b50-d4ea-40ff-99f9-e4ec179d5ddb", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.sheppnews.com.au/world/cargo-ship-hit-in-suspected-yemen-houthi-attack/", "domain": "sheppnews.com.au", "domain_classification": "Unknown", "message": "The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people \"on board small boats in the vicinity opened fire on the ship during the incident,\" Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations centre has also reported an attack in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the US Maritime Administration.", "location": "ADEN", "classification": "security", "score": 0.8256188106744705, "event_breakdown": "An Israeli-owned ship was hit by a missile off the coast of Yemen on Thursday, according to a private security firm, while the UK maritime organisation also reported an attack on a vessel in the same area."}, {"id": "f8cdbcee-9af7-43dd-9b06-cb9a248c8839", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.yasstribune.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14264", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, West Bank"}, {"id": "ffc068f4-a9ed-4088-bd70-a868bace9d8d", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.juneesoutherncross.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6417", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "The war in Gaza started on October 23, 2018 and has since killed over 36,000 Palestinians."}, {"id": "d68e6b7c-c9f7-43ff-b0aa-a16eb25397b0", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.easternriverinachronicle.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6364", "domain": "easternriverinachronicle.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "New Event: Security forces in the Gaza Strip have killed more than 36,000 Palestinians. The war in the Gaza Strip has killed more than 36,000 Palestinians, while hundreds of others have been killed in Israeli operations in the West Bank.\nNew Event: Israeli forces killed a leader of Palestinian militant group Islamic Jihad in the Gaza Strip on Tuesday, triggering almost immediate revenge rocket salvoes and fears of a severe escalation in week of continued tensions"}, {"id": "a9512357-07bb-433d-854d-5fc31f30dec4", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 04:30", "url": "https://www.goulburnpost.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, Israel, West Bank"}, {"id": "1424d22b-4c47-4db4-a8a0-1664f53433f8", "title": "Over 200 Palestinians killed as Israel rescues 4 Gaza hostages", "date": "2024-06-09 10:45", "url": "https://www.dailysabah.com/world/mid-east/over-200-palestinians-killed-as-israel-rescues-4-gaza-hostages", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Israel killed at least 274 Palestinians during a raid on central Gaza's Nuesirat that saw four hostages rescued on Saturday.\nIn Nuseirat, where the hostages were reportedly being held, Palestinians described coming under intense bombardment and heavy gunfire.\nPosters that read 'Home Now' depicting the portraits of the four rescued Israeli hostages, in Tel Aviv, Israel, June 8, 2024.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza – demands Israel has rejected.", "location": "Based on the text provided, it was not possible to determine a specific location for the main event.", "classification": "security", "score": 0.9027307208011479, "event_breakdown": "Israel's deadly raid on a Nuseirat building in Gaza's center on Saturday killed at least 274 Palestinians, the Israeli military said. It said that the raid was carried out to rescue four hostages who had been taken captive by Palestinian militants and who had been captured near the Gaza Strip."}, {"id": "106c4101-3ebf-4d4c-bb4f-7718f4626b94", "title": "Police arrest four people at downtown Toronto protest", "date": "2024-06-09 02:15", "url": "https://www.cp24.com/news/four-people-arrested-for-mischief-at-downtown-toronto-demonstration-1.6919439", "domain": "cp24.com", "domain_classification": "Unknown", "message": "Toronto police say four people have been charged following a pro-Palestinian demonstration on Saturday.\nAlisa Gayle, 52, of Toronto is facing one count of mischief.\nElif Sirin, 28, of Toronto, is facing one count of assaulting a peace officer and one count of obstructing a peace officer.\nBrandon Sharp, 35, of Niagara, is facing one count of obstructing a peace officer.\nSince Oct. 7, demonstrators have taken to the streets of downtown Toronto almost every weekend with thousands calling for a ceasefire and arms embargo.", "location": "Toronto", "classification": "security", "score": 0.6903558531745504, "event_breakdown": "Toronto police say four people have been charged following a pro-Palestinian demonstration on Saturday.\nAlisa Gayle, 52, of Toronto is facing one count of mischief. Elif Sirin, 28, of Toronto, is facing one count of assaulting a peace officer and one count of obstructing a peace officer. Brandon Sharp, 35, of Niagara, is facing one count of obstructing a peace officer.\nThe charges were laid after a demonstration was held at Nathan Phillips Square. The demonstration was part of a series of pro-Palestinian demonstrations that have been held almost every Saturday in downtown Toronto since Oct. 7."}, {"id": "09878c5b-7ff3-4d4e-9d44-8109f7a1b537", "title": "Jacksonville historian : Hans Tanzler was city most important mayor since consolidation", "date": "2024-06-09 10:00", "url": "https://www.yahoo.com/news/jacksonville-historian-hans-tanzler-citys-090321791.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Herman Buckman (left) looks on as Mayor Hans Tanzler kicks off a campaign in March 1969 to help send Buckman to the 11th World Games for the Deaf in Belgrade, Yugoslavia (now Serbia).\nOne, Hans G. Tanzler, Jr., (1927-2013), the first mayor of consolidated Jacksonville appears to have been largely forgotten.\nHe created the Jacksonville Community Relations Commission (now the Jacksonville Human Rights Commission) to respond to reports of jobs and housing discrimination.\nLater I realized that if all of us learned what Mayor Tanzler learned from his mother, we would live in a happier, more caring place.\nThis article originally appeared on Florida Times-Union: Mayor Hans Tanzler confronted pollution, segregation in Jacksonville", "location": "JACKSONVILLE", "classification": "security", "score": 0.4240112936450463, "event_breakdown": "Mayor Hans Tanzler confronted pollution and segregation in Jacksonville, Florida in the 1960s and 70s."}, {"id": "665575c6-2dbc-4a08-b623-d4af68af40f5", "title": "Two vessels catch fire after missile strikes off Yemen Aden - World", "date": "2024-06-09 06:00", "url": "https://www.brecorder.com/news/40307572/two-vessels-catch-fire-after-missile-strikes-off-yemens-aden", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO: Two ships caught on fire after being hit by projectiles off Yemen’s Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\n“A second missile was sighted but did not hit the ship.", "location": "According to the provided information, the incident occurred 83 nautical miles southeast of Aden. Therefore, the most", "classification": "security", "score": 0.6534078245614737, "event_breakdown": "Middle East. Ships caught on fire after being hit by projectiles off Yemen’s Aden: Two UK maritime agencies reported on Sunday."}, {"id": "85c8ace7-b431-42d2-b293-0ad5fcc94867", "title": "Ukraine says hit Su - 57 fighter jet inside Russia", "date": "2024-06-09 12:30", "url": "https://www.bssnews.net/international/194169", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "KYIV, Ukraine, June 9, 2024 (BSS/AFP) - Ukraine said Sunday it had hit an Su-57 fighter jet parked at an airfield in southern Russia, its first ever attack on Moscow's latest generation stealth aircraft.\nThe flagship Su-57 entered into service with Russia's aerospace forces in December 2020 and was designed to replace ageing Soviet-designed fighter aircraft like the Su-27 and MiG-29.\n\"On 8 June 2024, a Su-57 multi-purpose fighter jet of the aggressor state was struck at the Akhtubinsk airfield in Russia's Astrakhan region, 589 kilometres (366 miles) from the line of contact,\" Ukraine's GUR military intelligence said.\nIt also published before-and-after satellite imagery of what it said showed fire damage and debris around an Su-57 jet parked on an airfield.\nUkraine often targets military and energy facilities on Russian territory in drone attacks, sometimes hundreds of kilometres from the front line.", "location": "AKHTUBINSK", "classification": "security", "score": 0.6524074950885916, "event_breakdown": "Location: Kyiv, Ukraine\nEvent: Ukraine says it has hit Russia's Su-57 fighter jet\nUkraine says, on June 8, 2024, it struck an Su-57 fighter jet parked on an airfield in Russia's Astrakhan region, approximately 589 kilometers from the line of contact."}, {"id": "d6d1b6f0-e122-43fc-b568-497d60ff5cc5", "title": "Aid deliveries to Gaza resume through rebuilt pier", "date": "2024-06-09 01:45", "url": "https://www.al-monitor.com/originals/2024/06/aid-deliveries-gaza-resume-through-rebuilt-pier", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "The Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres, charges the militants deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "location": ")\nGaza", "classification": "security", "score": 0.8569801673199909, "event_breakdown": "Security forces foiled a kidnapping attempt Sunday night, killing one terrorist and wounding another as they attempted to abduct soldiers who were guarding workers near Hamra."}, {"id": "9a159913-3282-42f3-be04-73ee2d0f45d2", "title": "Man hospitalized after being stabbed in the chest in South Nashville", "date": "2024-06-09 03:15", "url": "https://www.wsmv.com/2024/06/08/man-hospitalized-after-being-stabbed-chest-south-nashville/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WSMV) - A man was hospitalized with non-life-threatening injuries after he was stabbed in the chest in South Nashville.\nEarly Saturday morning police responded to a call about a stabbing in the 300 block of Bakertown Road.\nWhen officers arrived at the scene, they found a man stabbed in the chest.\nDuring the argument, the victim, unrelated to the suspect and a friend, intervened in the fight.\nThe suspect allegedly stabbed the victim in the chest.", "location": ".\nSouth Nashville", "classification": "security", "score": 0.9471623893577146, "event_breakdown": "Event 1: Man hospitalized with non-life-threatening injuries after being stabbed in chest in South Nashville\nEarly Saturday morning, police responded to a call about a stabbing in the 300 block of Bakertown Road. Upon arrival, officers found a man stabbed in the chest. The suspect stabbed the victim in the chest during the argument."}, {"id": "921b0224-68c6-4b64-b70b-6e1480c78d68", "title": "Turkish police operation uncovers Daesh financiers", "date": "2024-06-09 15:30", "url": "https://www.dailysabah.com/politics/war-on-terror/turkish-polices-operation-uncoversdaesh-financiers", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Details of an operation against the terrorist group Daesh earlier this week revealed a widespread network of the group’s financiers.\nThe operation focused on the financial structure of the terrorist group and led to authorities freezing activities and assets of several companies and individuals.\nThe operation was the culmination of an investigation into companies funding Daesh in Syria and Iraq.\nIt discovered that the terrorist group utilized cryptocurrency and a financial network in Türkiye.\nIn December last year, Turkish intelligence captured a top Daesh terrorist in charge of the terrorist group’s finances in the Damascus region in an operation in Türkiye’s southern Mersin province.", "location": "Syrian", "classification": "security", "score": 0.8067524428294377, "event_breakdown": "Daesh financial network in Türkiye"}, {"id": "ceeb77a9-bf73-4064-8d71-5927ff5ac0e5", "title": "Rare American Sherman tank on display at World War II Weekend", "date": "2024-06-09 07:00", "url": "https://www.wfmz.com/news/area/berks/rare-american-sherman-tank-on-display-at-world-war-ii-weekend/article_9950c7b0-2604-11ef-a257-1f370ef02c0b.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Reading, PA (19601)TodayClouds with a few scattered showers this morning, then increasing sunshine and a bit breezy in the afternoon..TonightBecoming mostly clear; cool and comfortable.", "location": "Reading, Pennsylvania", "classification": "security", "score": 0.7457021441227298, "event_breakdown": "1. Reading, PA (19601) - Today - Clouds with a few scattered showers this morning, then increasing sunshine and a bit breezy in the afternoon.\n2. Tonight - Becoming mostly clear; cool and comfortable."}, {"id": "ca2721f0-e690-4593-a2b1-2ca1d02111ef", "title": "274 Palestinians killed in hostage rescue raid", "date": "2024-06-09 17:15", "url": "https://www.rte.ie/news/world/2024/0609/1453849-274-palestinians-killed-in-hostage-rescue-raid/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Palestinians remained in shock over yesterday's death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nOf the dead, 64 were children and 57 were women, the Hamas-run Gaza government media office said.\nNuseirat has often been caught up in the current warHamas' armed wing said three Israeli hostages, including one with US citizenship, were killed during the raid, but provided no names.\nA Hamas assertion yesterday that some hostages had died was rejected as \"a blatant lie\" by the Israeli military.\n37,084 Palestinians killed during war - health ministryIsrael's ensuing air and ground war in Gaza has killed at least 37,084 Palestinians, the health ministry in the Hamas-run territory said.", "location": "GAZA", "classification": "security", "score": 0.9293552741569578, "event_breakdown": "Gaza raid kills 36 Palestinians, Gaza health ministry says"}, {"id": "3716d6a1-7eb6-4ef4-af4e-66c07663e6bc", "title": "  Basuto : a lost chapter in Malta war", "date": "2024-06-09 06:00", "url": "https://timesofmalta.com/article/basuto-lost-chapter-malta-war.1093498", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "The Basotho Coys (companies) in Malta were part of the African Auxiliary Pioneer Corps (AAPC).\nThroughout their stay, all Basotho Coys would also form detachments and camp in other locations.\nBasotho played football against the Royal Artillery, Royal Engineers and other regiments and corps, as well as against other Basotho coys.\nPhoto: Unknown photographerDuring their service in Malta, ‘Basutos’ also attended one ENSA (Entertainments National Service Association) party, their diary reporting that the “shows were greatly appreciated”.\nBesides their place in people’s memory as labourers to the British military, there are also several anecdotes floating between fact and legend.", "location": "Malta", "classification": "security", "score": 0.8078049354077776, "event_breakdown": "Unknown Photographer, Maltese soldiers with Basotho mortar team from African Auxiliary Pioneer Corps (AAPC), St Julian, Malta, 31 January 1944, Stan Honda, Courtesy of United States Army, Public Domain\nNone"}, {"id": "6b417b9c-3935-4064-8bf6-4bfcda1ef03d", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:30", "url": "https://www.sconeadvocate.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, Israel, West Bank"}, {"id": "4978ca7d-8f8f-442b-8700-8f1bd1f60ac6", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.maitlandmercury.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, Israel, West Bank"}, {"id": "8b21caa3-f01e-4563-9102-c1e1f52499e6", "title": "Missile strikes cargo ship off Yemen : security firm", "date": "2024-06-09 01:45", "url": "https://thesun.my/world/missile-strikes-cargo-ship-off-yemen-security-firm-MC12549445", "domain": "thesun.my", "domain_classification": "Unknown", "message": "London: An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n“No injuries were reported,“ the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "location": "YEMNI", "classification": "security", "score": 0.7828316454293537, "event_breakdown": "Location: Coast of Yemen\nEvent: An Antigua and Barbuda-flagged cargo ship was hit by a missile off the coast of Yemen\nDescription: Security firm Ambrey said on Saturday that the ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile. The missile was fired by Yemen's Iran-backed Huthi rebels, who have been targeting Israeli-linked shipping since January."}, {"id": "f1f932f3-2037-4db1-a75d-1393ebdae815", "title": "Russia loses 1 , 270 more soldiers , 60 artillery systems and 26 tanks over past 24 hours", "date": "2024-06-09 09:45", "url": "https://www.yahoo.com/news/russia-loses-1-270-more-042020099.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses 1,270 more soldiers, 60 artillery systems and 26 tanks over past 24 hoursRussian forces have lost 1,270 soldiers, 60 artillery systems and 26 tanks over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 9 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:around 518,560 (+1,270) military personnel;7,869 (+26) tanks;15,131 (+26) armoured combat vehicles;13,593 (+60) artillery systems;1,097 (+2) multiple-launch rocket systems;836 (+2) air defence systems;357 (+0) fixed-wing aircraft;326 (+0) helicopters;10,982 (+37) strategic and tactical UAVs;2,277 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,562 (+78) vehicles and tankers;2,253 (+5) special vehicles and other equipment.\nSupport UP or become our patron!", "location": "Kyiv, the capital city of Ukraine", "classification": "security", "score": 0.782655301586615, "event_breakdown": "[\n{\n\"location\": \"Lithuania\",\n\"Event\": \"A senior defense official has confirmed Russia has sent Iskander short-range ballistic missile systems to Kaliningrad, on the border of Lithuania.\"\n},\n{\n\"location\": \"Kyiv Oblast\",\n\"Event\": \"Russian forces have lost 1,270 soldiers, 60 artillery systems and 26 tanks over the past 24 hours.\"\n}\n]"}, {"id": "6fd00dd1-90c9-4f89-a3f5-3d3821365797", "title": "Lightsabers in The Acolyte show how much the Jedi changed in 100 Years", "date": "2024-06-09 17:15", "url": "https://dorksideoftheforce.com/posts/lightsabers-in-the-acolyte-show-how-much-the-jedi-changed-in-100-years-01hym8xxjw7q", "domain": "dorksideoftheforce.com", "domain_classification": "Unknown", "message": "Did you catch this Clone Wars Easter egg in The Acolyte?.\nDid you catch this Clone Wars Easter egg in The Acolyte?", "location": "The Acolyte takes place in the Star Wars fictional universe, but does not take place on a specific planet", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Clone Wars Easter egg in The Acolyte:\nThe Acolyte is an upcoming American television series created for Disney+, expected to premiere in 2023. It is a prequel to Star Wars: The Phantom Menace and will be set about 100 years before the events of that film. The Acolyte will be part of the Star Wars franchise, with elements of the franchise's ancient past in the High Republic being presented in the series.\nIt's not yet clear what the show will be about, but it's confirmed that the show will even hint at Star Wars: Clone Wars from the perspective of children who grew up in that era, according to ew."}, {"id": "5f3133b3-5a11-4b45-adef-5ff5ff75977d", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-09 18:30", "url": "https://nypost.com/2024/06/09/world-news/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines.\n6 Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 370 miles from the front lines.\nAPBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, points to the likely use of Ukrainian-made drones.\nRussia’s Su-57 fleet has been largely absent from the skies over Ukraine, and has instead been used to fire long-range missiles across the border.\nThe move drew a furious response from Moscow, and warnings it could embroil NATO in a war with Russia.", "location": "Poland", "classification": "security", "score": 0.42976071300990365, "event_breakdown": "Ukraine said on Sunday its forces hit a Russian military transport plane with an anti-aircraft missile stationed on an air base in the south of the country less than 600 miles from the front lines. The Russian military confirmed the shoot-down, and said the plane's pilot was killed. State media said \"According to preliminary information, the anti-aircraft missile was fired from a portable anti-aircraft missile system by Russian forces in the area."}, {"id": "85a49a72-6993-4100-8ea6-51e1e1d89ea7", "title": "East New York stabbing : NYPD searches for suspect accused of attacking MTA bus driver in Brooklyn , NYC", "date": "2024-06-09 18:30", "url": "https://abc7ny.com/post/east-new-york-stabbing-nypd-searches-suspect-accused-attack-mta-bus-driver-brooklyn-nyc/14928765/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "NYPD releases image of suspect accused of stabbing MTA bus driver in the neck in BrooklynEAST NEW YORK, Brooklyn (WABC) -- Police released the image of the man accused of stabbing a MTA bus driver while he was on duty in Brooklyn.\nThe incident occurred around 11:30 a.m. on Saturday aboard a B99 bus near Pitkin Avenue and Alabama Avenue.\nNYPDAccording to the NYPD, the suspect got into a verbal dispute with the 60-year-old bus driver before he stabbed him in the neck with an unknown sharp object.\nPolice say the suspect managed to exit the bus and flee westbound on Pitkin Avenue.\nWATCH | MTA bus driver stabbed in neck during dispute in BrooklynAnthony Carlo has the latest from East New York.", "location": ".\nEAST NEW YORK, Brooklyn", "classification": "security", "score": 0.957195539231621, "event_breakdown": "NYPD releases image of suspect accused of stabbing MTA bus driver in the neck in Brooklyn."}, {"id": "0891fefa-cd11-421f-a773-746e94f98c0a", "title": "Palestinian death toll in hostage rescue raid reaches 274 as Israel strikes central Gaza", "date": "2024-06-09 18:30", "url": "https://www.pakistantoday.com.pk/2024/06/09/palestinian-death-toll-in-hostage-rescue-raid-reaches-274-as-israel-strikes-central-gaza/", "domain": "pakistantoday.com.pk", "domain_classification": "Unknown", "message": "Palestinians remained in shock over Saturday’s death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nSixty-four of the dead were children and 57 were women, the Hamas-run Gaza government media office said on Sunday.\nOn Sunday, three Palestinians were killed and several hurt in an Israeli airstrike on a house in Al-Bureij in the central Gaza Strip, while tanks shelled parts of nearby Al-Maghazi and Al-Nuseirat.\nPalestinian medics said an Israeli airstrike on a house in Tel Al-Sultan in western Rafah killed two people.\nIsrael’s ensuing air and ground war in Gaza has killed at least 37,084 Palestinians, the health ministry in the Hamas-run territory said in its Sunday update.", "location": "GAZA CITY", "classification": "security", "score": 0.8031930857180752, "event_breakdown": "Israeli airstrike on a house in Al-Bureij in the central Gaza Strip, while tanks shelled parts of nearby Al-Maghazi and Al-Nuseirat.\nNew Israeli airstrike on house in Al- Bureij in central Gaza Strip."}, {"id": "0ea18f48-0295-4055-89ba-cd9114ba9359", "title": "Bay Area brawl : Stabbing victim out from hospital after fatal fight", "date": "2024-06-09 18:30", "url": "http://www.sfchronicle.com/crime/article/lake-berryessa-brawl-19505667.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "One victim remained hospitalized Sunday as the Napa County Sheriff’s Office investigates a large fight that injured several people Saturday at Lake Berryessa.\nDeputies responded to the 5500 block of Knoxville Road at Oak Shores at 5:30 p.m. Saturday, where paramedics transported two stabbing victims to hospitals by helicopter.\nOne of the two stabbing victims transported via helicopter has been released from the hospital, and the other victim remained hospitalized as of Sunday morning, said sheriff’s spokesperson Henry Wofford.\nAdvertisement Article continues below this adThe identity of the man who was fatally shot has not been released, pending a full autopsy scheduled for Monday, Wofford said.\n“We do not have a list of suspects or suspect at this time,” Wofford said.", "location": "Lake Berryessa is a lake in the Vaca Mountains, located approximately 30 miles", "classification": "security", "score": 0.428837094845603, "event_breakdown": "Other details in the news story include many businesses reopening across California and the FBI reporting an increase in violent and property crime."}, {"id": "81573675-4991-469e-99e2-b9e3818607d5", "title": "Missile Strikes Cargo Ship Near Yemen Aden , Ignites Fire", "date": "2024-06-09 03:45", "url": "https://www.devdiscourse.com/article/law-order/2976420-missile-strikes-cargo-ship-near-yemens-aden-ignites-fire", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "(Adds new incident in paragraph 3) CAIRO, June 9 (Reuters) -British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen's Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\nAmbrey said the ship changed its course to port with increased speed, adding that \"no injuries were reported.\"", "location": "YEMEN/ADEN, Yemen", "classification": "security", "score": 0.7588838146269643, "event_breakdown": "Location: 83 nautical miles southeast of Yemen's Aden\nUKMTO said it received a report of an incident 80 nautical miles southeast of Yemen's Aden, and of a second incident 70 nautical miles southwest of Yemen's Aden."}, {"id": "5d44ee2f-fbdd-4090-b3b7-781d6caf745c", "title": "Cargo ship hit in suspected Yemen Houthi attack", "date": "2024-06-09 03:45", "url": "https://www.juneesoutherncross.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9777032096775063, "event_breakdown": "Gaza, Israel, West Bank"}, {"id": "ca619da3-ff72-49a6-8202-e70e17224b7b", "title": "King Birthday 2024 Military Honours List", "date": "2024-06-09 15:30", "url": "https://www.theadvocate.com.au/story/8656960/kings-birthday-2024-military-honours-list/?cs=9676", "domain": "theadvocate.com.au", "domain_classification": "Unknown", "message": "For meritorious achievement in security governance management and reform in Airborne Early Warning and Control, and Electronic Warfare capabilities for the Australian Defence Force.", "location": "The main location where the event for meritorious achievement in security governance management and reform in Airborne Early Warning", "classification": "security", "score": 0.67557404282125, "event_breakdown": "target event not found"}, {"id": "a4bf7944-4d3c-4c11-88f0-0bde43757da3", "title": "IDF Spokesman Grilled on Palestinian Deaths During Hostage Rescue", "date": "2024-06-09 19:30", "url": "https://www.rollingstone.com/politics/politics-news/idf-spokesman-palestinian-civilian-deaths-hostage-rescue-1235036244/", "domain": "rollingstone.com", "domain_classification": "Unknown", "message": "An Israel Defense Forces (IDF) rescue mission recovered four hostages from Hamas custody on Saturday but killed dozens of Palestinians and injured hundreds.\n“Part of this mission were the air strikes,” Raddatz said.\n“And is that the reason for the air strikes?\n“There can be a rescue mission like what happened yesterday.\nOne Egyptian official with knowledge of the negotiations told CNN that the rescue mission will have a “negative effect.”“[It] won’t be easy,” the Egyptian official said.", "location": ".\nGaza", "classification": "security", "score": 0.7526727617083052, "event_breakdown": "IDF rescue mission rescues four hostages from Hamas custody but kills dozens of Palestinians and injured hundreds, IDF (Israel Defense Forces) responds with air strikes."}, {"id": "de1c34c3-a0c2-4b90-a9e9-09eee9df18a1", "title": "Israel Defense Forces Spokesman Grilled on Palestinian Civilian Deaths During Hostage Rescue", "date": "2024-06-09 18:45", "url": "https://www.yahoo.com/news/israel-defense-forces-spokesman-grilled-164245417.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An Israel Defense Forces (IDF) rescue mission recovered four hostages from Hamas custody on Saturday but killed dozens of Palestinians and injured hundreds.\n“Part of this mission were the air strikes,” Raddatz said.\nDid they come from those air strikes in broad daylight?” Raddatz asked Lerner.\n“There can be a rescue mission like what happened yesterday.\nOne Egyptian official with knowledge of the negotiations told CNN that the rescue mission will have a “negative effect.”“[It] won’t be easy,” the Egyptian official said.", "location": "Gaza", "classification": "security", "score": 0.608406689426316, "event_breakdown": "IDF rescue mission rescues four hostages from Hamas custody but kills dozens of Palestinians and injured hundreds."}, {"id": "b4ac8994-1411-42c0-8aae-2048bbd5ea0e", "title": "Dublin stabbing victim named locally as young father - of - two as garda probe continues", "date": "2024-06-09 18:45", "url": "https://www.irishmirror.ie/news/irish-news/dublin-stabbing-victim-named-locally-32993009", "domain": "irishmirror.ie", "domain_classification": "Unknown", "message": "A man who died following a stabbing incident in Finglas overnight has been named as father-of-two Mark Carroll, who was 34.\nAn investigation is taking place after the fatal assault of Mr Carroll in the Finglas area of north Dublin in the early hours of this morning.\nEmergency services attended a house in the Scribblestown area shortly after 1am, where the man was found with serious injuries.\n\"Shortly after 1 a.m., Gardaí and emergency services attended a residence in the Scribblestown area where a man in his 30s was found with serious injuries.\n\"A senior investigating officer (SIO) has been appointed to lead the inquiry, and an incident room has been established at Finglas Garda Station.", "location": "Finglas, Dublin", "classification": "security", "score": 0.8573199201449676, "event_breakdown": "The man, who was in his 30s, was pronounced dead at the scene, and a senior investigating officer has been appointed to lead the inquiry with an incident room being established in Finglas Garda Station."}, {"id": "c3b4adfa-52de-463c-b358-4d139e532580", "title": "The German board game that changed the face of war", "date": "2024-06-09 06:45", "url": "https://www.yahoo.com/news/german-board-game-changed-face-060000742.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This aborted invasion, like many of their plans, had been workshopped using Kriegsspiel (“war game”), a battle simulator.\nPlanning officers were divided into two teams, controlling painted lead-block troops representing German and enemy forces.\nMost German officers thought it too radical to work, and those who supported it did so largely out of desperation – the Nazis were out of moves.\nA Kriegsspiel (\"war game\") session in progressKriegsspiel had been used by German strategists for nearly a century, but it was far older than that.\nHe used the game to plan a range of astonishing victories that united the first German Empire.", "location": "BERLIN", "classification": "security", "score": 0.6809140666069401, "event_breakdown": "Planning officers were divided into two teams, controlling painted lead-block troops representing German and enemy forces.\nMost German officers thought it too radical to work, and those who supported it did so largely out of desperation - the Nazis were out of moves."}, {"id": "6e484e38-3462-4d10-86ec-1833a4dbe366", "title": "King Birthday 2024 Military Honours List", "date": "2024-06-09 16:15", "url": "https://www.examiner.com.au/story/8656960/kings-birthday-2024-military-honours-list/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "For meritorious achievement in security governance management and reform in Airborne Early Warning and Control, and Electronic Warfare capabilities for the Australian Defence Force.", "location": "ADELAIDE, AUSTRALIA", "classification": "security", "score": 0.67557404282125, "event_breakdown": "Security events with locations reported in English language news sources within the last 7 days include:\nA) Protests in Colombo, Sri Lanka against the government's handling of the economic crisis\nB) The theft of $45 million worth of gold bars from an airport in Sao Paulo, Brazil\nC) An explosion at an oil pipeline in Nigeria caused by thieves trying to steal fuel\nD) The conflict between Israeli military forces and Hamas, resulting in the deaths of several civilians\nE) The kidnapping of 39 students from a college in Kaduna state, Nigeria\nF) The assassination of a prominent general in Somalia by al-Shabaab militants\nG) The violent clash between police and demonstrators in Venezuela over food shortages\nH) The hostage situation at a university in Maroua, Cameroon, resulting in the deaths of several hostages\nI) The bombing of a police station in Yerevan, Armenia by an armed group\nJ) The arrest of several suspects in connection with the shooting at a church in Durban, South Africa."}, {"id": "165f03fc-db51-4125-b87b-4e94432eba36", "title": "Troops from multiple units | IDF releases more information about Operation Arnon", "date": "2024-06-09 17:15", "url": "http://www.israelnationalnews.com/news/391319", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Paratroopers Brigade Combat Team led the rescue and the special forces under fire and brought them to the helicopter boarding point in the heart of the Gaza Strip.\nSoldiers from the Paratroopers Reconnaissance Unit, the Transport Unit (5515), Shayetet 13, the Givati Reconnaissance Unit, and an armored battalion (532) operated with the combat team in the operation.\nThe Kfir Brigade Combat Team operated for several hours in the area.\nThe combat team operated with soldiers from the Paratroopers Brigade and a special force from the Duvdevan Unit.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "GAZA STRIP", "classification": "security", "score": 0.8460434012753903, "event_breakdown": "Relevant events:\nThe Paratroopers Brigade Combat Team led the rescue and the special forces under fire and brought them to the helicopter boarding point in the heart of the Gaza Strip.\nThe Kfir Brigade Combat Team operated for several hours in the area."}, {"id": "75c6cbe4-55ad-4a79-b18e-752dceaf1084", "title": "Israeli minister Benny Gantz resigns from war cabinet in blow to Netanyahu", "date": "2024-06-09 19:30", "url": "https://us.cnn.com/2024/06/09/middleeast/benny-gantz-resignation-post-war-plan-gaza-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Israeli war cabinet member Benny Gantz has resigned from Benjamin Netanyahu’s government, delivering a blow to the prime minister who has been celebrating the rare rescue of hostages held in Gaza.\nIsraeli Minister Benny Gantz addresses the media after announcing his resignation from Israeli Prime Minister Benjamin Netanyahu’s emergency government on June 9, 2024.\nBesides the prime minister, the only other remaining member of the emergency government with decision-making power is Defense Minister Yoav Gallant, also from Likud.\nEyad Baba/AFP/Getty ImagesThe United States has repeatedly called on the prime minister to present a tangible post-war plan for Gaza.\n“The more identical his positions are to those of the prime minister, the more he’ll lose on both sides.", "location": "Gaza", "classification": "security", "score": 0.645870649992317, "event_breakdown": "Israeli warplanes struck Hamas positions in Gaza on Tuesday in response to a rocket attack launched from the coastal enclave late Monday, the first such attack since a cease-fire ended the latest round of fighting in May.\nIsraeli Prime Minister Benjamin Netanyahu on Monday evening, Israel time, launched airstrikes against what Israel said was a gathering of Hamas terrorists in Syria, near the Syrian capital Damascus.\nGantz, along with Netanyahu's Likud Party and the centrist Blue and White Party, had formed the coalition government in April after three bitter and divisive elections.\nGantz announced Monday he had reached an agreement with Netanyahu, but left the government the next day, ostensibly due to political views inside the party not lining up with those of the coalition."}, {"id": "d93e9ed8-4581-4ef8-91ec-5763fcff0754", "title": "South Korea Resumes Loudspeaker Broadcasts After North Trash Balloons", "date": "2024-06-09 18:45", "url": "https://www.ndtv.com/world-news/south-korea-resumes-loudspeaker-broadcasts-after-norths-trash-balloons-5854344", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "(File)South Korea resumed loudspeaker broadcasts directed at North Korea on Sunday, its military said, following through on a warning demanding Pyongyang stop sending balloons carrying trash into the South.\nSouth Korea had warned the North it would take retaliatory measures which could include propaganda broadcasts from huge loudspeakers set up at the border.\nThe broadcasts were made Sunday afternoon and whether more will follow depends on how North Korea responds, South Korea's military said.\nSouth Korea's broadcasts include world news and information about democratic and capitalist society with a mix of popular K-pop music.\nThe sound is believed to travel more than 20 kilometres (12.4 miles) into North Korea.", "location": "The event takes place at the Korean Demilitarized Zone.", "classification": "security", "score": 0.5312092849492632, "event_breakdown": "South Korea resumed loudspeaker broadcasts directed at North Korea on Sunday, its military said, following through on a warning demanding Pyongyang stop sending balloons carrying trash into the South."}, {"id": "e7125901-97e7-411e-a531-0a73b3f728b5", "title": "Helmet - cam footage : Shayetet 13 commandos escort rescued hostages to helicopters", "date": "2024-06-09 19:00", "url": "https://www.israelnationalnews.com/news/391325", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "תיעוד ממצלמות הקסדה של לוחמי שייטת 13 צילום: דובר צה\"לDuring Operation \"Arnon\" to rescue the hostages by the Israel Police ‘Yamam’ (National Counter-Terrorism Unit) and the ISA yesterday (Saturday), IDF soldiers rescued the hostages and the special forces under fire.\nThe Paratrooper Reconnaissance Unit Combat Team led the rescue of the hostages and the Yamam and ISA forces from the vehicles while under fire while continuing to eliminate terrorists.\nThe Shaldag special forces of the IAF and the Yamam directed the airstrikes and activation of fire throughout the operation.\nSoldiers of Unit 669 and the Shaldag Unit protected the life of Israel Police ‘Yamam’ Squad Commander, Chief Inspector Arnon Zamora z”l, from the moment of the encounter until arriving at the hospital, where he died of his wounds.", "location": "NULL", "classification": "security", "score": 0.9628893656156337, "event_breakdown": "Operation \"Arnon\" - Yesterday (Saturday), Israeli security forces, including the Israel Defense Forces (IDF), Israel Security Agency (ISA), and the Israel Police, carried out an operation to rescue hostages taken by terrorists. The operation took place in the Judea and Samaria region, but specific details cannot be provided for security reasons.\n\nA news push on this event is live on the IDF's official Twitter account, @IDF, in the headline \"OPERATION ARNON: IDF special forces lead operation to rescue hostages and eliminate terrorists.\" It took place in Israel's Judea and Samaria Region."}]