[{"id": "305fc1a9-84f6-4187-a958-899121c76bf4", "title": "Pentagon admits killing a shepherd with a Hellfire missile in Syria in botched drone strike after mistaking him for a senior Al Qaeda leader", "date": "2024-05-02 18:15", "url": "https://www.dailymail.co.uk/news/article-13376575/pentagon-drone-strike-syria-al-qaeda-shepherd-death.html", "message": "A botched U.S. drone strike in Syria killed a shepherd last year after he was mistakenly identified as a senior Al Qaeda operative.\nThe Pentagon has admitted a civilian and not a terrorist leader was slain on May 3, 2023 after an internal Central Command (CENTCOM) investigation.\nThe victim has since been 56-year-old father-of-10 Lufti Hasan Masto, who was killed while he was tending to his sheep.\nA MQ-9 predator drone was tracking his movements in fields around his home in the rural town of Qorqanya when a Hellfire missile was fired in his direction.\nCENTCOM 'determined U.S. forces misidentified the intended Al Qaeda target and that a civilian, Mr. Lufti Hasan Masto (Masto), was struck and killed instead'.", "location": "Qorqanya", "classification": "security", "score": 0.9847305783547525, "event_breakdown": "1. A botched U.S. drone strike in Syria mistakenly killed a shepherd last year, who was misidentified as a senior Al Qaeda operative.\n2. The Pentagon admits that a civilian, 56-year-old father-of-10 Lufti Hasan Masto, was killed on May 3, 2023, after an internal CENTCOM investigation.\n3. Mr. Masto was killed while tending to his sheep in the rural town of Qorqanya, Syria, when a Hellfire missile was fired in his direction by an MQ-9 predator drone.\n4. CENTCOM determines that U.S. forces misidentified the intended Al Qaeda target, leading to the death of Mr. Masto."}, {"id": "d9ac62b9-c816-4211-91d7-2835c1dc447f", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated.", "location": "Syria", "classification": "security", "score": 0.9311538199665129, "event_breakdown": "- A U.S. drone strike in Syria killed a 56-year old shepherd, mistaking him for a terrorist leader.\n- The strike occurred near Masto's home, killing him and several of his sheep.\n- United States Central Command acknowledged and regretted the civilian harm caused by the airstrike.\n- CENTCOM stated they take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\n- The report mentioned a commitment to learning from the incident and improving targeting processes to mitigate potential civilian harm."}, {"id": "f6911a52-6f7c-4d27-962e-ed7d9f5f77dc", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say", "date": "2024-05-03 10:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza City, Gaza Strip", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "1. Israeli military's statements regarding an airstrike that killed Shahed and 10 other children have shifted over two weeks, but they have not taken responsibility for the attack.\n2. Analysis of the attack site by a freelance journalist working for CNN in Gaza suggests Israeli military involvement.\n3. Military analyst Cobb-Smith asserts that Israeli munitions were likely used in the attack, citing the sophistication beyond Palestinian militants' capabilities.\n4. CNN requests details from the Israeli military regarding the April 16 airstrike, but the military declines to provide additional evidence."}, {"id": "380b2484-1a96-4d20-b756-61a9d4e66fa8", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.yahoo.com/news/u-central-command-finds-2023-184350267.html", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nFile Photo by Bonnie Cash/UPIMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"\nThe strike investigation, conducted by Army Brigadier General John P. Cogbill, wrapped up Nov. 15, 2023.", "location": "Syria", "classification": "security", "score": 0.8860074744325478, "event_breakdown": "- U.S. airstrike in Syria on May 3, 2023, targeting senior Al Qaeda leader results in the death of civilian Lufti Hasan Masto\n- U.S. Central Command acknowledges civilian harm from the airstrike\n- Investigation led by Army Brigadier General John P. Cogbill concludes on November 15, 2023"}, {"id": "1247a960-584a-4dab-9732-1f41719471c6", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/02/CENTCOM-Syria-strike-civilian-killed/1701714674364/", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nCENTCOM said it is fully engaged in implementing Defense Secretary Lloyd Austin's (pictured) Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes.\nFile Photo by Bonnie Cash/UPI | License PhotoMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"", "location": "Syria", "classification": "security", "score": 0.8318856970406131, "event_breakdown": "- U.S. Central Command reports civilian killed in a May 2023 U.S. strike in Syria instead of an Al Qaeda terrorist leader\n- U.S. Central Command acknowledges civilian harm in May 3, 2023 airstrike in Syria targeting senior Al Qaeda leader"}, {"id": "fa6db1ef-7886-4dc8-af36-bd694e16a4b1", "title": "Ukraine - Russia war latest :  Huge fire breaks out  in port city after missile strike ; Russia  shifting battlefield focus  ", "date": "2024-05-02 00:45", "url": "https://news.sky.com/story/ukraine-russia-war-latest-huge-fire-breaks-out-in-port-city-after-missile-strike-russia-shifting-battlefield-focus-12541713", "message": "Russian activist jailed for setting fire to military conscription officeA Russian activist has been sentenced to 15 years in prison for attempting to set fire to a military conscription office in protest against the war in Ukraine.\nAngel Nikolayev, 39, was convicted on charges of terrorism for placing two bottles of a flammable substance in the windows of a conscription office in the eastern city of Khabarovsk and setting them alight.\nHe was also convicted of damaging Russian flags that were put on the graves of soldiers killed in Ukraine at a local cemetery and removing symbols of Russian military action from a bus stop and several vehicles.\nSince 2022, hundreds of people have faced criminal charges in Russia over protests and remarks condemning the war in Ukraine, and thousands have been fined or briefly jailed.", "location": "Khabarovsk.", "classification": "security", "score": 0.8923864133445534, "event_breakdown": "- Russian activist Angel Nikolayev sentenced to 15 years in prison for attempting to set fire to a military conscription office in Khabarovsk\n- Nikolayev convicted of terrorism for placing flammable substance in windows of the conscription office and setting them alight\n- Nikolayev also convicted of damaging Russian flags at a local cemetery and removing symbols of Russian military action from a bus stop and several vehicles\n- Hundreds of people in Russia faced criminal charges over protests and remarks against the war in Ukraine since 2022"}, {"id": "c19e990b-c204-406c-a4ff-e61ed3c7376b", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "- Two Nigerian military officers to face court martial over drone strike that killed civilians in northwest Kaduna State\n- Drone strike killed at least 85 civilians as they celebrated a Muslim festival\n- Nigerian military acknowledges the accidental strike on the village\n- Military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest\n- United Nations human rights office reports that the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities"}, {"id": "d408cb67-7bc4-4c96-a3ef-ab57e6019096", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6023448210491533, "event_breakdown": "- U.S. airstrike in Syria in May 2023 kills innocent civilian instead of al-Qaida leader\n- U.S. Central Command confirms reports from residents and family members about the civilian casualty\n- Central Command completes investigation into the strike in November but releases findings publicly on Thursday\n- Detailed investigation and review process for strikes with allegations of civilian casualties set up\n- U.S. continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri"}, {"id": "b8a1f45d-9ce1-48a1-a3c3-88445f0efa49", "title": "US drone strike in Syria killed civilian not terrorist leader , Pentagon probe finds", "date": "2024-05-02 20:30", "url": "https://www.stripes.com/theaters/us/2024-05-02/drone-strike-syria-terrorist-civilian-killed-military-13732627.html", "message": "(X)A U.S. military drone strike last year that targeted a top al-Qaida leader in Syria killed a civilian instead, the Pentagon admitted Thursday.\n“We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\nAfter initially expressing confidence that the strike killed its intended target — whose name was never made public — Pentagon officials by mid-May told reporters that they were no longer certain the strike killed a terrorist.\n“The protection of civilians is a strategic priority as well as a moral imperative,” Austin wrote in his 2022 civilian harm mitigation plan.\n“Our efforts to mitigate and respond to civilian harm directly reflect our values and also directly contribute to achieving mission success.”", "location": "Syria", "classification": "security", "score": 0.798536788915954, "event_breakdown": "- U.S. military drone strike in Syria targeting a top al-Qaida leader\n- Pentagon admits civilian killed instead of the intended target\n- Pentagon officials no longer certain the strike killed a terrorist\n- Secretary of Defense Lloyd Austin's 2022 civilian harm mitigation plan"}, {"id": "a6b40dd2-d346-43f9-b97a-ae134d354ae5", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Sultan Ibrahim Khan Road", "classification": "security", "score": 0.982317040954408, "event_breakdown": "- Journalist Mohammad Siddiq Mengal and 2 others killed in remote-controlled blast on Sultan Ibrahim Khan Road, National Highway in Khuzdar\n- Passers-by seriously injured in the blast, brought to hospital for treatment\n- 8 other individuals injured in blast receiving treatment in various hospitals"}, {"id": "10861769-bcb7-4369-be9d-c964069e4c71", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus International Airport", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Israeli airstrike near Damascus injures eight Syrian soldiers\n- Strike causes \"material losses\" according to Syrian state-run broadcaster\n- Israeli warplanes launch missiles from over the Golan Heights at a site near the capital, as reported by Syrian defence ministry\n- Attack targets a base of Hezbollah, southwest of Damascus International Airport, according to Al Hadath TV quoted by Russian state media TASS\n- No official confirmation by Israeli authorities on the reported strike"}, {"id": "908a9257-a602-4284-b95c-3da1e57061e6", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\n- A military training ground hit by multiple explosions typical of an ATACMS strike in footage captured by a drone.\n- Footage of the recent attack showing the training ground as one target.\n- Hundreds of flashes of smoke seen erupting over the clearing where Russian soldiers were gathered, believed to be M74 APAM mini-bombs detonating and causing casualties."}, {"id": "5fca8f78-b2b9-4ddb-940d-e876fbb22063", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 01:45", "url": "https://www.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "1. Israeli airstrike on Al-Shaboura refugee camp in Rafah city, Gaza\n2. Two young children killed and several others injured in the airstrike\n3. Um Rami's account of speaking to her daughter before the attack\n4. Um Rami's loss of her grandchildren in the attack\n5. Um Rami's family being displaced multiple times by the Israeli military\n6. Maram Abu-Shalab's statement about the strike on her sister's home without warning."}, {"id": "8ca0020b-5a0f-434c-9fa7-b19ed8997e53", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 02:00", "url": "https://us.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "- Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city, resulting in the death of two young children and injuries to several others.\n- Um Rami speaking to CNN about her last conversation with her daughter and grandchildren before the airstrike.\n- Um Rami expressing her grief and referring to the children as her \"first joy\".\n- Um Rami mentioning previous displacements by the Israeli military and expressing frustration at the situation.\n- Maram Abu-Shalab from the hospital stating that the Israeli military struck the home without warning."}, {"id": "81e841c8-df20-4ab3-b235-72e5581d30c2", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 05:00", "url": "https://edition.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nUm Rami told CNN she spoke to her daughter on Tuesday after sunset, when she told her she put her kids to bed after they played with the neighbors and had dinner.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nUm Rami told CNN the family has been displaced multiple times by the Israeli military, but that it didn’t matter because “this is all they want, this is their goal,” she said, pointing at her dead grandchildren.\nThe children’s aunt, Maram Abu-Shalab told CNN from the hospital that the Israeli military struck the home her sister and her family were sheltering in without giving a warning.", "location": "Rafah", "classification": "security", "score": 0.41405624518781, "event_breakdown": "1. Israeli airstrike on Al-Shaboura refugee camp in Rafah city, southern Gaza, kills two young children and injures several others, according to the Palestinian Civil Defense and Kuwait Hospital in Rafah.\n2. Um Rami recounts speaking to her daughter after sunset, who mentioned putting her children to bed after playing with neighbors and having dinner.\n3. Um Rami identifies the deceased children as her first and only grandchildren, expressing profound grief.\n4. Um Rami accuses the Israeli military of displacing her family multiple times and alleges that targeting civilians is their objective.\n5. Maram Abu-Shalab, the children's aunt, states from the hospital that the Israeli military struck the sheltering home without warning."}, {"id": "838f1439-1f55-4feb-9a98-f43fdfa44f4e", "title": "1 killed , 3 injured in Israeli strikes on Lebanese villages", "date": "2024-05-01 22:15", "url": "https://www.prokerala.com/news/articles/a1527609.html", "message": "Beirut, May 2 : A Hezbollah fighter was killed and three civilians were injured in Israeli airstrikes on Lebanese villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Wednesday that an Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter inside the house, Xinhua news agency reported.\nAccording to the sources, another airstrike targeted the southeast village of Adaysseh, wounding three civilians.\nThe military sources added that Israeli warplanes carried out on Wednesday a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 445 people on the Lebanese side, according to Lebanese security sources.", "location": "Tayr Harfa", "classification": "security", "score": 0.9841721306046511, "event_breakdown": "- Hezbollah fighter killed and three civilians injured in Israeli airstrikes on Lebanese villages in southern Lebanon\n- Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter\n- Another airstrike targeted the southeast village of Adaysseh, wounding three civilians\n- Israeli warplanes carried out a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon"}, {"id": "3ecaf145-298b-48dd-8e8a-8d6822bb3fd0", "title": "Russo - Ukraine War - 01 May 2024", "date": "2024-05-02 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-01.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nDuring the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7x concentrations of Russian troops.", "location": "Vodolahy", "classification": "security", "score": 0.6041034177583948, "event_breakdown": "- On 24 February 2022, Ukraine was attacked by land, naval and air forces of Russia.\n- Russian forces launched air strikes in areas including Vodolahy, Yamne, Vesele, Kharkiv, and Vovchans'k.\n- Russian forces fired artillery and mortars at over 10 settlements, such as Makiivka, Nevs'ke, Terny, and Yampolivka.\n- Ukrainian Air Force launched air strikes on 1 command post and 7 concentrations of Russian troops on May 1."}, {"id": "86d4639e-9fb8-40ba-8780-a58372d45bcd", "title": "Russia breached global chemical weapons ban in Ukraine war , US says - New Delhi Times - India Only International Newspaper", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russia-breached-global-chemical-weapons-ban-in-ukraine-war-us-says/", "message": "The United States accused Russia on Wednesday of breaching a global chemical weapons ban by deploying the choking agent chloropicrin against Ukrainian troops.\nThe State Department also accused Russia of using riot control agents “as a method of warfare” in Ukraine.\nAdditionally, Russian forces have used grenades loaded with CS and CN gases, according to the Ukrainian military.\nA guided bomb attack killed two civilians, including a 38-year-old woman and her father, Kharkiv regional Governor Oleh Syniehubov said.\nRussia’s defense ministry said Wednesday that it thwarted Ukrainian drone attacks targeting several Russian regions.", "location": "Kharkiv", "classification": "security", "score": 0.5130149429885166, "event_breakdown": "- United States accuses Russia of deploying chloropicrin against Ukrainian troops\n- United States accuses Russia of using riot control agents in Ukraine\n- Russian forces use grenades with CS and CN gases in Ukraine\n- Guided bomb attack kills two civilians in Kharkiv region\n- Russian defense ministry claims to have thwarted Ukrainian drone attacks"}, {"id": "b07ec1ca-5a80-4578-94fe-cfde37cba66e", "title": "Russia - Ukraine war : List of key events , day 798", "date": "2024-05-02 02:15", "url": "https://www.aljazeera.com/news/2024/5/2/russia-ukraine-war-list-of-key-events-day-798", "message": "Russia-Ukraine war: List of key events, day 798As the war enters its 798th day, these are the main developments.", "location": "Ukraine", "classification": "security", "score": 0.5428428659096032, "event_breakdown": "Apologies, but it seems like there is no text provided for me to generate a list of events. If you provide the relevant information, I'll be happy to assist you in creating the list."}, {"id": "01d38c7d-b27c-4ad3-b2cd-2333202c728f", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney, Australia", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "1. Australian prosecutors reveal that a 15-year-old boy charged in a stabbing at a Sydney church plotted an attack against the Jewish community.\n2. During a bail hearing, prosecutors argue that the boy expressed intent to attack Jewish community members, citing statements made in a group chat on April 20.\n3. The boy and others were arrested by the Joint Counter Terrorism Team in connection with the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church in Wakeley, western Sydney."}, {"id": "751a7cf3-b063-45bc-b479-6dac3e230f5b", "title": "Three terrorists killed in Tank operation", "date": "2024-05-02 15:00", "url": "https://tribune.com.pk/story/2464897/three-terrorists-killed-in-tank-operation", "message": "Security forces on Thursday killed three terrorists during a joint intelligence-based operation (IBO) in Khyber-Pakhtunkhwa’s Tank district, the military said in a statement.\nAccording to the Inter-Services Public Relations (ISPR), during the operation, following a fierce exchange of gunfire, security forces successfully neutralised three terrorists, including ringleaders Azmat alias Azmati, Karamat alias Hanzla, and terrorist Rehan.\nThe slain militants remained “actively involved” in several terrorist activities in the area, including the recent abduction of a district and sessions judge of South Waziristan district, the military’s media wing stated.\nIt further asserted that the security forces remain determined to eliminate the menace of terrorism from the country.\nRead more: At least four terrorists killed in Tank IBOHe returned home safely, the Counter-Terrorism Department (CTD) confirmed on Monday.", "location": "Tank district", "classification": "security", "score": 0.9552469463617089, "event_breakdown": "1. Security forces killed three terrorists during a joint intelligence-based operation (IBO) in Khyber-Pakhtunkhwa’s Tank district.\n2. The operation resulted in the neutralization of ringleaders Azmat alias Azmati, Karamat alias Hanzla, and terrorist Rehan after a fierce exchange of gunfire.\n3. The slain militants were actively involved in various terrorist activities in the area, including the recent abduction of a district and sessions judge of South Waziristan district.\n4. The Counter-Terrorism Department (CTD) confirmed the safe return of an individual home on Monday."}, {"id": "21a7498d-41c3-42de-a5e3-61594b38f95f", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240502-voa01.htm", "message": "Russian missile attack injures 14 in OdesaBy VOA News May 02, 2024Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.7993261792230087, "event_breakdown": "1. Russian missile attack injures 14 in Odesa\n2. Ukrainian drones attempted to attack an energy facility in Smolensk\n3. Damage to power lines in the Kursk region due to a downed Ukrainian drone\n4. Russian forces used grenades loaded with CS and CN tear gases according to Ukrainian military"}, {"id": "15f71193-1d97-4941-8385-135f34e1b9b1", "title": "Russia Shows Off NATO Military Equipment Taken From Ukraine", "date": "2024-05-01 21:30", "url": "https://www.shtfplan.com/headline-news/russia-shows-off-nato-military-equipment-taken-from-ukraine", "message": "Russian crowds are getting to see a new exhibition in Moscow of NATO (North Atlantic Treaty Organization) military hardware that was captured by Russian forces in Ukraine.\nThe display shows off a whole lot of “trophies,” ranging from United States-made armored fighting vehicles to state-of-the-art tanks and European armored personnel carriers.\nThe military equipment has come from 12 countries including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\nRussia Has Destroyed 1/3 Of U.S.\nRussia is advancing and making mincemeat of the equipment sent to Kiev by the West.", "location": "Moscow", "classification": "security", "score": 0.557853972490328, "event_breakdown": "1. Exhibition of NATO military hardware captured by Russian forces in Ukraine opens in Moscow, Russia.\n2. The display features a variety of \"trophies,\" including armored fighting vehicles, tanks, and armored personnel carriers from countries such as the United States, United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\n3. Russian advancement in Ukraine leads to the destruction of one-third of U.S. military equipment sent to Kiev by the West."}, {"id": "d7ecbd7a-4a24-49cd-a552-1f4d5edca357", "title": "Surprise : Literal Terrorist Visits Pro - Terrorism  Encampment  at Major University in Chicago", "date": "2024-05-02 15:00", "url": "https://townhall.com/tipsheet/guybenson/2024/05/02/surprise-literal-terrorist-visits-pro-terrorism-encampment-at-major-university-in-chicago-n2638509", "message": "When I call Ayers and Dohrn 'terrorists,' I mean it quite literally.\nMr. Ayers, who is 56, calls it a memoir, somewhat coyly perhaps, since he also says some of it is fiction.\nIn his book Mr. Ayers describes the Weathermen descending into a ''whirlpool of violence.''\nBetween 1970 and 1974 the Weathermen took responsibility for 12 bombings, Mr. Ayers writes...\nAdvertisementbill ayers of the weather underground addresses students at the uchicago popular university for gaza ‼️‼️ pic.twitter.com/V7MSsS4Q8V — kxh (@halfmoonpoem) April 29, 2024A literal, unrepentant, anti-American terrorist bomber addressing a pro-terrorism crowd.", "location": "Chicago", "classification": "security", "score": 0.8025635353799333, "event_breakdown": "1. Bill Ayers, aged 56, refers to his writings as a memoir, with some portions being fictional.\n2. Ayers depicts the Weathermen engaging in significant violence, describing it as a \"whirlpool of violence\" in his book.\n3. The Weathermen, led by Ayers, claim responsibility for 12 bombings between 1970 and 1974.\n4. Bill Ayers, a former member of the Weather Underground, addresses students at the University of Chicago Popular University for Gaza, sparking controversy over his past involvement in terrorism."}, {"id": "6ee1a630-0c82-41d0-ab37-bc18926bbe80", "title": "Odesa Currently Seen As Key Target For Russian Strikes Air Force", "date": "2024-05-01 15:15", "url": "https://menafn.com/1108160426/Odesa-Currently-Seen-As-Key-Target-For-Russian-Strikes-Air-Force", "message": "(MENAFN- UkrinForm) The Russians have now picked the city of Odesa as the key target for their strikes.\nOvernight Wednesday, they attacked densely populated areas with three Iskander-M ballistic missiles.\nThat's according to a spokesperson for Ukraine's Air Force Ilia Yevlash, who spoke on the air of the national telethon, Ukrinform reports.\nThis is another manifestation of the bloodthirsty face of Russian terror.\nLate Tuesday night, Russian ballistic missiles hit Odesa again, killing three.", "location": "ODESA", "classification": "security", "score": 0.6152281997442713, "event_breakdown": "1. Russians target Odesa for strikes, with three Iskander-M ballistic missiles hitting densely populated areas overnight Wednesday.\n2. Ukraine's Air Force spokesperson, Ilia Yevlash, confirms the attacks on Odesa during a national telethon.\n3. Russian ballistic missiles strike Odesa late Tuesday night, resulting in the death of three individuals."}, {"id": "c662bab0-b2e5-46d3-af2e-639f16eb2c5f", "title": "For Decades , Moscow Has Sought to Silence Its Critics Abroad", "date": "2024-05-03 07:30", "url": "https://www.newsmax.com/world/globaltalk/russia-kgb-killings-spies-assassinations/2024/05/03/id/1163339/", "message": "Security expert Andrei Soldatov said the work of the Kremlin's intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat's how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky's ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.\nBritain accused Russia in the attack, which the Kremlin denied being behind, and Western nations expelled Russian spies in response.", "location": "Munich", "classification": "security", "score": 0.799525666224368, "event_breakdown": "- Sidney Reilly caught by Kremlin's intelligence services\n- Ramon Mercader befriends Sidney Reilly\n- Bandera killed by a Soviet agent in Munich\n- Britain accuses Russia in the attack and Western nations expel Russian spies"}, {"id": "0bbdf2c9-9a9c-4fe7-b78a-7e0dd8994aac", "title": "Likely missile attack by Yemen Houthi rebels targets ... ", "date": "2024-05-01 22:00", "url": "https://accesswdun.com/article/2024/4/1240028", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Mokha, Yemen", "classification": "security", "score": 0.7051436875164441, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels targeting a ship in the Red Sea off the coast of Mokha, Yemen\n- Decrease in Houthi attacks due to being targeted by a U.S.-led airstrike campaign in Yemen\n- Decline in shipping through the Red Sea and Gulf of Aden because of the threat\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "a26f5c76-2f07-4d24-b036-b152e655efdf", "title": "Remember the 60s : How Many Campus Protesters Will Go Full Terrorist ? ", "date": "2024-05-01 20:00", "url": "https://hotair.com/headlines/2024/05/01/remember-the-60s-how-many-campus-protesters-will-go-full-terrorist-n3787569", "message": "It is almost certain that Hamas operatives are planning terrorist attacks in the United States as well.\nIt is not a bridge too far to believe that radicals who claim to be in Hamas, love their rockets and call for the death of Israelis and Jews might take the next step and help Hamas operatives engage in terrorism against US targets.\nAdvertisementThey could be recruited to help purchase weapons, identify targets and even plant bombs.\nSomething similar happened in the late 1960s and early 1970s when American supporters of terrorism became terrorists themselves, including students, professors and university graduates.", "location": "United States", "classification": "security", "score": 0.6667168083655569, "event_breakdown": "- Hamas operatives planning terrorist attacks in the United States\n- Radicals possibly assisting Hamas operatives in terrorism against US targets\n- Recruitment of individuals to purchase weapons, identify targets, and plant bombs\n- Historical precedent of American supporters of terrorism becoming terrorists in the late 1960s and early 1970s"}, {"id": "aadb29a3-c0c3-4af3-9980-7146fcdb9d3e", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14 – Winnipeg Free Press", "date": "2024-05-02 10:15", "url": "https://www.winnipegfreepress.com/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14", "message": "KYIV, Ukraine (AP) — The situation on the front line in eastern Ukraine is worsening but local defenders are so far holding firm against a concerted push by Russia’s bigger and better-equipped forces, a senior Ukrainian military official said Thursday.\n(Ukrainian Emergency Service via AP)Russia has pushed Ukraine onto the back foot on the battlefield as Kyiv grapples with shortages of troops and ammunition.\nUkrainian forces are now racing to build more defensive fortifications at places along the around 1,000-kilometer (600-mile) front line.\nUkraine’s difficulties have been deepening for months as the military waited for vital new military aid from the United States.\n‘’I’m not ruling anything out, because we are facing someone who is not ruling anything out,’’ he told the Economist, referring to Russian President Vladimir Putin.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.4373951667307425, "event_breakdown": "1. Worsening situation reported on the front line in eastern Ukraine, as local defenders resist Russia's push, according to a senior Ukrainian military official in Kyiv.\n2. Russia's advancements on the battlefield have put Ukraine on the defensive, amid shortages of troops and ammunition.\n3. Ukrainian forces rush to construct additional defensive fortifications along the approximately 1,000-kilometer front line.\n4. Ukraine's challenges intensify over months due to delayed military aid from the United States.\n5. Ukrainian official does not rule out any possibilities, citing the unpredictable nature of the conflict with Russian President Vladimir Putin."}, {"id": "597f81f0-de3f-4a1a-b668-75de73dc3781", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel - LocalNews8 . com", "date": "2024-05-01 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "Tehran", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "1. Iran displays missiles and drones used in its first-ever attack on Israel, launched from Iranian soil, at the Revolutionary Guard Aerospace Forces exhibit in western Tehran.\n2. The exhibit features dozens of long- and medium-range ballistic missiles, cruise missiles, and drones.\n3. Iran's attack on Israel included the use of drones, ballistic missiles, and cruise missiles.\n4. Belali, a representative, claims that despite efforts by NATO, the United States, and Arab countries to counter Iranian drones and missiles, they have failed.\n5. Israel Defense Forces (IDF) spokesperson Daniel Hagari reports that ballistic missiles reaching Israel caused only light structural damage to an airbase."}, {"id": "29ba2d39-3f92-4a76-8f74-02e19e54c36f", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "Abdirisaq Shino Shares 70TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "Taleex", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashed in Somalia's Sool region.\n- Residents of Taleex district heard a loud explosion and discovered wreckage resembling an Iranian Quds land-attack cruise missile.\n- No group claimed responsibility for the cruise missile launch violating Somali airspace.\n- CENTCOM stated that the actions were taken to protect freedom of navigation and make international waters safer.\n- No casualties have been reported in Somalia from the apparent failed cruise missile strike."}, {"id": "18fa1ad5-8e06-443b-a872-88cad4398405", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus,", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Alleged Israeli airstrike on the outskirts of Damascus injures eight Syrian soldiers\n- Strike targets military position in the Damascus area\n- Israeli warplanes launch missiles from over the Golan Heights in northern Israel\n- Material losses reported as a result of the airstrike\n- Targeted building, located near the Sayyeda Zeinab shrine, used by Syrian security forces\n- Incident follows April 1 strike where top Islamic Republic Revolutionary Guard Corps officers were killed in a strike attributed to Israel"}, {"id": "c54d78d0-e7e1-4f38-bf55-d959201e8cbf", "title": "When Tony Blair Bombed Montenegro", "date": "2024-05-02 19:45", "url": "https://consortiumnews.com/2024/05/02/when-tony-blair-bombed-montenegro/", "message": "It came amid airstrikes on Yugoslav forces in Kosovo, where Bill Clinton and Tony Blair waged a “humanitarian intervention” ostensibly to save ethnic Albanians from Serb leader Slobodan Milosevic.\nApproving Air StrikesThe Atlantic alliance did not specify which of its members had taken part in the air strikes on Montenegro at the time.\nSuch secrecy would become a common feature of future NATO air wars, making it hard for victims to hold individual states responsible.\nBut a formerly classified document reveals that Britain was heavily involved in the April 29, 1999 attack on Montenegro.\na decade on from the Kosovo war.", "location": "Montenegro", "classification": "security", "score": 0.46164487329001025, "event_breakdown": "- Approval of Air Strikes on Montenegro\n- Airstrikes on Yugoslav forces in Kosovo\n- Britain heavily involved in the April 29, 1999 attack on Montenegro"}, {"id": "238131f5-b5c5-4e27-b143-953646099638", "title": "Russian missile attack injures 14 in Odesa - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-02 15:45", "url": "https://www.newdelhitimes.com/russian-missile-attack-injures-14-in-odesa/", "message": "Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.8121557017618638, "event_breakdown": "- Russian missile attack injures 14 people at a postal facility in Odesa, Ukraine\n- Ukrainian officials condemn the attack as a crime against civilians\n- Ukrainian drones attempt to attack an energy facility in Smolensk, Russia\n- Russian forces down a Ukrainian drone in the Kursk region and damage power lines\n- Russian forces use grenades loaded with CS and CN tear gases, reported by the Ukrainian military"}, {"id": "0a90779f-2d14-431c-b210-12cf3372023c", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel", "date": "2024-05-01 18:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "Tehran", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "- Iran launches first ever attack against Israel from Iranian soil\n- Display of missiles and drones at Revolutionary Guard Aerospace Forces exhibit in western Tehran\n- Iran's attack on Israel includes drones, ballistic missiles, and cruise missiles\n- Belali states that NATO, the United States, and Arab countries failed to create barriers for Iran's drones, missiles, and cruise missiles\n- IDF spokesperson confirms ballistic missiles reached Israel and caused light structural damage at airbase"}, {"id": "0b26d07c-7c66-42a5-beb9-a41a02850192", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month.", "location": "Gaza", "classification": "security", "score": 0.7677629001437708, "event_breakdown": "- Gazan journalists express emotional struggle covering war in Gaza\n- Israel launches military assault on Gaza following attacks by Hamas\n- Abu Dagga expresses desire to leave after seven months of war\n- TRT photojournalist displaced from refugee camp covers neighborhood\n- Dahman, 36, shares burden with CNN"}, {"id": "ca6754a5-ae9b-4621-9d3b-e499c797875a", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged.", "location": "Leningrad region", "classification": "security", "score": 0.4280794057909932, "event_breakdown": "- A man was planning to attack a fuel depot in the Leningrad region.\n- Russia's FSB security service reported killing a man recruited by Ukraine to blow up military buildings and energy sites in Russia. The FSB stated that the man had planned to commit a series of terrorist acts in Russia, including attacks against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer center in Saint Petersburg."}, {"id": "fb5e4a16-7b1e-4a0f-96cb-b6dd3f5b0788", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-03 08:45", "url": "https://naharnet.com/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "Odesa", "classification": "security", "score": 0.8647478397809565, "event_breakdown": "1. Ballistic missile strike by Russia hits Odesa, a southern Ukrainian port city, causing injuries to 14 people and igniting a massive blaze.\n2. The attack targets a sorting depot owned by Nova Poshta, Ukraine's largest private delivery company.\n3. Ukraine retaliates with increasingly sophisticated long-range drones, targeting infrastructure in Russia supporting the economy and war effort.\n4. Energy facilities in three Russian regions are reported damaged by Ukrainian drone strikes, according to the governors.\n5. Russian Defense Ministry confirms the downing of Ukrainian drones over the Bryansk, Krasnodar, Rostov, and Belgorod regions."}, {"id": "da68fd13-8059-4677-952a-da364dc7d1e3", "title": "US military admits that air strike killed civilian in Syria last year", "date": "2024-05-02 19:30", "url": "https://us.cnn.com/2024/05/02/politics/us-military-admits-air-strike-killed-civilian-syria/", "message": "“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the summary says.\nStill, the US did not launch an official investigation of the strike until nearly 8 weeks later after the strike that killed him.\nMohammad Mesto sits next to the grave of his brother Lutfi, who was killed on May 3 in a suspected US military strike in northern Syria.\nIn that case, CENTCOM opened a formal 15-6 investigation into the strike within a week of the operation.\nMesto’s family previously told CNN that he had been out grazing his sheep when he was killed.", "location": "Northern Syria", "classification": "security", "score": 0.48503599557855004, "event_breakdown": "- Mohammad Mesto's brother Lutfi was killed on May 3 in a suspected US military strike in northern Syria.\n- CENTCOM opened a formal 15-6 investigation into the strike within a week of the operation.\n- The US did not launch an official investigation of the strike until nearly 8 weeks later after the incident that killed Lutfi."}, {"id": "18eea32b-00b6-4cc5-86f1-c7a12ab0b7f1", "title": "Russia Says Mariupol Hospital Attack  Staged  By Ukraine : World News", "date": "2024-05-02 02:45", "url": "https://www.rashtranews.com/russia-says-mariupol-hospital-attack-staged-by-ukraine-world-news/", "message": "#Russia #Mariupol #Hospital #Attack #Staged #UkraineIgor Konashenkov has stated that the Mariupol hospital was staged by Ukraine.\nMoscow, Russia:The Russian army claimed Thursday that an attack on a children’s hospital in the southeastern Ukrainian port of Mariupol, which killed three including a child and caused global outrage, was a “staged provocation” by Ukraine.\n“The Russian aviation carried out absolutely no missions to hit targets on the ground in the Mariupol area,” Russian defence ministry spokesman Igor Konashenkov said.\n“The airstrike that allegedly took place is a completely staged provocation to maintain anti-Russian hype for a Western audience,” he said.\nThe bombing of the maternity hospital resulted in three deaths, including one child, according to the city’s mayor.", "location": "Mariupol", "classification": "security", "score": 0.6824509143885954, "event_breakdown": "- Igor Konashenkov stated that the Mariupol hospital attack was staged by Ukraine, claiming it was a \"staged provocation\" to maintain anti-Russian hype for a Western audience."}]