[{"id": "848cfcf2-815a-4549-b61d-1d920e907573", "title": "Golden Age of Muslims in the United States has begun - opinion", "date": "2024-06-30 01:15", "url": "https://www.jpost.com/opinion/article-808252", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "But the “Trump ban” can also be seen as a turning point for American Muslims.\nArab Identity, specifically Palestinian identity, has been gaining more visibility, transforming from a purely political concept to a popular and even desired cultural identity.\nA century ago, American Jews were far from the highly integrated and successful minority that they are today.\nThe first is World War Two, when 500,000 American Jews served in the American forces.\nThis was the moment that American Jews took their yarmulke out of their pockets and stood proud for a shared cause.", "location": "NULL", "classification": "antisemitism", "score": 0.511148538218946, "event_breakdown": "{\n\"type\": \"FeatureCollection\",\n\"features\": [\n{\n\"type\": \"Feature\",\n\"properties\": {\n\"title\": \"New York, United States of America: Antisemitic incident in Brooklyn\",\n\"description\": \"A man walking to morning services on Saturday, the 21st of May, reported that a group of individuals approached him yelling antisemitic slurs. The incident occured at about 8:15am on Eastern Parkway, near Underhill Avenue. Hunter College security is offering support within the community and NYPD Hate Crime Task Force is actively investigating the incident.\",\n\"feature\": \"incident_Brooklyn\"\n},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [-73.9809299999999,40.6772160000000]\n}\n}\n]\n}"}, {"id": "bafd32e6-d356-4910-871b-0878e66f84d4", "title": "Jewish woman claims pro - Palestinian activists attacked her in Brussels", "date": "2024-06-30 04:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-808288", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The same day that the anti-Israel protest encampment at universities in Brussels were cleared by police on Tuesday, a Jewish woman alleged that she had been threatened and pelted with objects by student activists.\nA Brussels memorial to non-Jews who worked to rescue Jews from the Nazi genocide campaign was defaced with anti-Israel messages on Tuesday, Jewish organizations said.\nShe was also threatened, told supposedly told “we are going to take off your head and your dogs' too”, and “you are going to pay for the others.\"\nThe ULB encampment had held an \"intifada festival\" on June 23, proclaiming in advertisements \"long live the resistance.\"\nAlleged PFLP leader and Palestinian Alternative Revolutionary Path Movement founder Khaled Barakat gave a lecture to the group in mid-May.", "location": "Brussels", "classification": "antisemitism", "score": 0.5207956571996916, "event_breakdown": "Event 1: A Brussels memorial to non-Jews who worked to rescue Jews from the Nazi genocide campaign was defaced with anti-Israel messages on Tuesday, Jewish organizations said.\nEvent 2: On the same day that the anti-Israel protest encampment at universities in Brussels were cleared by police, a Jewish woman alleged that she had been threatened and pelted with objects by student activists."}, {"id": "a7db8ef4-9fc7-45e7-9382-eb6b02ad8b7b", "title": "War on Gaza : The far - right activists advocating for Palestinians", "date": "2024-06-30 09:30", "url": "https://www.middleeasteye.net/news/who-are-far-right-activists-throwing-their-weight-behind-gaza", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "In the West, most far-right political parties have generally thrown their weight behind Israel in recent years.\nThis has led pro-Palestinian activists to warn about the dangers of the far-right \"exploiting\" the suffering in Gaza for their own ends.\n\"These far-right agitators have in the past spread explicitly antisemitic, homophobic and white supremacist content, but since October have pivoted to almost exclusively posting content about Gaza,\" he said.\n— Jackson Hinkle 🇺🇸 (@jacksonhinklle) December 15, 2022While disputing the label \"far-right\", Hinkle rails against \"woke degeneracy\" and \"woke Nazism\", claiming that capitalism today aims to mandate \"universal homosexuality on the rest of the world\".\nAccording to a report by the Center for Countering Digital Hate published in April, which focuses on the growth of far-right Gaza activists, Hinkle claimed to have made $550 in one month from X’s new revenue-sharing feature.", "location": "United States", "classification": "antisemitism", "score": 0.8484233263785927, "event_breakdown": "Some far-right activists have pivoted to talking about pro-Palestinian causes, often promoting antisemitic or white supremacist content. Far-right agitators have used social media to promote pro-Palestinian content, often with a racist or antisemitic slant."}, {"id": "8505b47d-a64e-4811-944b-b1d4350231d0", "title": "  Los Angeles Is Becoming Unsafe for Its Jewish Residents  Says Israeli Minister", "date": "2024-06-30 21:00", "url": "https://www.algemeiner.com/2024/06/30/los-angeles-is-becoming-unsafe-for-its-jewish-residents-says-israeli-minister/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "In a strongly worded letter sent following a surge in antisemitic activities since October 7, 2023, Shikli expressed deep apprehension about the safety of Jewish residents in Los Angeles.\n“Los Angeles is becoming more and more unsafe for its Jewish residents,” Shikli stated, emphasizing the urgent need for proactive measures to combat the rising tide of antisemitism.\nHe highlighted recent violent demonstrations on campuses that endangered Jewish students, alongside two serious incidents that he believes were mishandled by authorities.\nDespite prior knowledge of the demonstration, law enforcement allegedly failed to take preventive actions to ensure the safety of Jewish residents.\nThe minister concluded his letter by proposing collaboration with local authorities and inviting the Los Angeles Police Department to participate in an international training program aimed at equipping security forces worldwide to combat antisemitism effectively.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.9036540893694873, "event_breakdown": "[{\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"Shikli expresses deep apprehension about the safety of Jewish residents in Los Angeles\"\n}, {\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"recent violent demonstrations on campuses endangered Jewish students\"\n}, {\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"two serious incidents were mishandled by authorities\"\n}, {\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"law enforcement allegedly failed to take preventive action to ensure the safety of Jewish residents in demonstration\"\n}, {\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"minister proposed collaboration with local authorities\"\n}, {\n\"Location\": \"Los Angeles\",\n\"Target Event\": \"minister invites LAPD to participate in international training program\"\n}]"}, {"id": "413423a7-0ef9-4497-bf23-ca8e6b8e3d83", "title": "Diaspora Minister Amichai Chikli calls on politicians to protect CA Jews", "date": "2024-06-30 20:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-808424", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Diaspora Minister Amichai Chikli in a Tuesday letter called on California Governor Gavin Newsom and Los Angeles Mayor Karen Bass to protect the state's Jewish population in the face of violent anti-Israel and antisemitic incidents.\n\"I write to you with deep concern regarding the escalating antisemitism in Los Angeles since October 7, 2023, and the troubling response from law enforcement,\" Chikli said to Newsom and Bass.\n(credit: KYLE GRILLOT/REUTERS)\"We are closely monitoring law enforcement and state authorities' handling of this case,\" said Chikli.\n\"Los Angeles, home to one of the largest Jewish communities in North America, is becoming increasingly unsafe for its Jewish residents,\" said Chikli.\nTo this end, Chikli offered to help arrange partnerships with Israeli law enforcement, and invited the Los Angeles Police Department to participate in a training program in Israel.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.9198096909518522, "event_breakdown": "California, Los Angeles"}, {"id": "9caf70dc-dfde-4d46-98c8-195316e8bac6", "title": "Prime Minister Rishi Sunak visits synagogue in Golders Green to tell crowd  I will always stand with you  ", "date": "2024-06-30 21:15", "url": "https://www.dailymail.co.uk/news/article-13585681/prime-minister-rishi-sunak-visits-synagogue.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Prime Minister Rishi Sunak emphatically threw his support behind Britain's Jewish community saying, 'I will always stand by you', as he also vowed to fight the 'sickness' of rising antisemitism in Britain.\nMr Sunak made the comments during a campaign trail appearance on the final weekend ahead of Thursday's general election, in Golders Green, north London.\nMr Sunak continued: 'We must never forget that there are still hostages being held by Hamas terrorists.\nMr Sunak went on to state he was 'proud' of the role British military played in thwarting Iran's recent missile attack against the state.\nMr Sunak also greeted local Conservative candidate Alex Dean during his north London stop.", "location": "Golders Green, north London", "classification": "antisemitism", "score": 0.5459530433038793, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category antisemitism, and not a past event.\nA new survey conducted by CNN and SSRS, about the state of hate and extremism across the political spectrum.\nNew support for U.K. Jewish students as antisemitic attacks in London rise over past 12 months\nNew survey reveals 89% of British Jews believe Jeremy Corbyn is antisemitic."}]