[{"id": "32f3bd52-3718-4051-85e2-832612d09908", "title": "Ernesto Approaches Bermuda , Could Become Category 2 Hurricane", "date": "2024-08-16 00:30", "url": "https://www.theepochtimes.com/world/ernesto-approaches-bermuda-could-become-category-2-hurricane-5706583", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Bermuda is expected to begin facing tropical storm conditions on Aug. 16 as Hurricane Ernesto nears the island, according to the National Hurricane Center (NHC).\nErnesto strengthened to a Category 2 hurricane, with increased sustained winds of 100 mph.\nThe Saffir-Simpson Hurricane Wind Scale gives a Category 2 hurricane sustained winds of 96 mph—110 mph.\nA Category 3 hurricane has winds of 111 mph—129 mph.\nThe NHC reported swells causing life-threatening surf and rip currents generated by Ernesto are affecting Turks and Caicos, and the Bahamas.", "location": "Based on the information provided, the main focus of the event appears to be Bermuda.", "classification": "natural-disasters", "score": 0.9194421864397518, "event_breakdown": "1. Hurricane Ernesto approaching Bermuda on Aug. 16.\n2. Hurricane conditions are anticipated for the island on that day, according to National Hurricane Center.\n3. Enhanced hurricane-strength winds for this event have been verified to a Cat 2 marker."}, {"id": "f6bc716f-02d5-4d66-b27d-20a90c6f9710", "title": "Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "date": "2024-08-16 04:00", "url": "https://www.wcpo.com/weather/half-of-puerto-rico-without-power-as-hurricane-ernesto-gains-strength", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto notched 90mph maximum sustained winds on Thursday night as it moves toward Bermuda in the Atlantic Ocean.\nThe National Hurricane Center announced a hurricane warning for Bermuda.\nAdditional strengthening is forecast, which would put Ernesto close to Category 3 major hurricane status when it reaches the island.\n6 to 12 inches of rain could fall on Bermuda Saturday, with some places seeing as much as 15 inches.\nStorm wrecks Puerto Rico power gridsHalf of Puerto Rico was waking up on Thursday in the dark, where more than 325,000 customers were still without power as cleanup efforts got underway.", "location": "hurricane ernesto", "classification": "natural-disasters", "score": 0.8746052581577481, "event_breakdown": "Title: Ernesto strengthens to Category 3 Hurricane heading for Bermuda\nLocation: Bermuda\n\nEvent: Ernesto intensified, reaching maximum sustained winds of 90mph on Thursday night and moving quickly toward Bermuda, where a hurricane warning was issued by the National Hurricane Center (NHC). Forecasters expect additional strengthening as it approaches Bermuda, which would make it a major Category 3 hurricane.\n\nErnesto will bring heavy rainfall and gusty winds to Bermuda on Saturday, with rainfall ranging from 6 to 15 inches in certain locations. Residents are urged to prepare for the approaching storm and take all necessary precautions."}, {"id": "7b7ca5be-934e-41d6-8b84-eb1c4119a905", "title": "Hurricane Ernesto : Hurricane Ernesto : Bermuda on alert as storm grows stronger , power outages and flooding continue in Puerto Rico", "date": "2024-08-16 03:30", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/hurricane-ernesto-bermuda-on-alert-as-storm-grows-stronger-power-outages-and-flooding-continue-in-puerto-rico/articleshow/112554802.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Impact on Puerto Rico:Forecast:Current position:Preparation alert:Historical context:LUMA energy report:Power grid fragility:US East Coast:Seasonal overview:Hurricane Ernesto , currently a Category 1 storm, is intensifying as it heads towards Bermuda , posing significant threats with powerful winds, dangerous storm surges, and heavy rainfall over the weekend.The storm has already caused substantial damage in Puerto Rico , where it left hundreds of thousands without power.\nAs Ernesto continues its path, the National Hurricane Center (NHC) warns that it could strengthen into a major hurricane by Friday, prompting urgent preparations in affected regions.Here's all you need to know:-Hundreds of thousands are without power due to heavy rainfall from Ernesto.\nSignificant flooding and damage reported.Ernesto expected to strengthen into a major hurricane (Category 3 or higher) by Friday, with further strengthening predicted by the NHC.As of 5 pm ET Thursday, Ernesto was 495 miles southwest of Bermuda, moving north at 85 mph.The NHC advises Bermuda residents to complete preparations for potential impacts, including significant rain, strong winds, and storm surge.Bermuda has experienced direct landfalls from only 11 storms since 1851. Notable past hurricanes include Gonzalo (2014) and Fabian (2003).About 410,000 homes and businesses in Puerto Rico remain without electricity.\nLUMA expects power restoration soon.Puerto Rico’s power grid is historically fragile, with previous hurricanes (Fiona 2022, Irma and Maria 2017) causing prolonged outages.Ernesto is expected to stay well west of the US East Coast but could cause life-threatening surf and rip currents.Ernesto is the fifth named storm of an intense Atlantic hurricane season.\nPrevious storms include Category 1 Hurricane Debby and Category 5 Hurricane Beryl.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.993309393521338, "event_breakdown": "The following events were reported:\n-Hurricane Ernesto causing widespread damage and power outages in Puerto Rico.\n-Hurricane Ernesto is expected to strengthen to a major hurricane by Friday.\n-Hurricane Ernesto poses a threat to Bermuda and is expected to impact the island with strong winds, storm surge, and heavy rainfall."}, {"id": "6e2b12e7-1a16-4016-82ce-4494edf9502f", "title": "Massive storm exposes growing threat looming over cities in the U . S . South :  A constant existential fear  ", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/massive-storm-exposes-growing-threat-013000478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In Charleston, South Carolina, the storm revealed just how vulnerable the city is to extreme weather events, which are becoming more common and more intense, the Washington Post reported.\nWhy are extreme weather events concerning?\nThe prospect of flooding is \"virtually just a constant existential fear we have throughout the year,\" Charleston resident Damon Black told the Post.\nUnfortunately, many of the places most affected by this extreme weather, such as Florida, are moving away from solutions meant to curb the trend.\nIn order to truly address the threat that extreme weather events pose, we must halt the overheating of our planet caused by dirty energy.", "location": "Charleston", "classification": "natural-disasters", "score": 0.7956812385371381, "event_breakdown": "['in Charleston, South Carolina', 'The Washington Post']"}, {"id": "43d4a495-93b9-431f-9859-d2fcac57e552", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://whnz.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "whnz.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.9561874563039819, "event_breakdown": "Hurricane Ernesto is currently heading towards Bermuda, bringing with it the threat of dangerous swells to the East Coast."}, {"id": "7a518d43-b79f-441e-8022-3ae52d010c3c", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://knst.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "knst.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents.", "location": "HURRICANE ERNESTO is a direct threat to Bermuda.", "classification": "natural-disasters", "score": 0.9561874563039819, "event_breakdown": "National Hurricane Center (and all news media) has not been reporting on any current events of natural-disasters that can be placed on a map."}, {"id": "b00adc84-fccd-4bc9-afd8-d43709a41c20", "title": "Hurricane Ernesto is charging through the Atlantic . Here what it doing . ", "date": "2024-08-16 03:45", "url": "https://www.newschannel5.com/news/as-ernesto-hurricane-ernesto-is-charging-through-the-atlantic-heres-what-its-doing", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WTVF) — Ernesto has recently been updated to a Category 1 hurricane as the disturbance continues to churn in the Atlantic.\nAfter sweeping through the Virgin Islands and Puerto Rico, the storm is now on track toward Bermuda.\nAs of Thursday afternoon 389,424, clients across Puerto Rico are still without power, according to LUMA Energy.\nA Hurricane Warning is in place as Ernesto will likely strengthen to a major hurricane before approaching Bermuda, meaning a Category 3 or higher.\nConditions in Tennessee and Kentucky will not be influenced by Ernesto.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.7932650193345612, "event_breakdown": "1. Ernesto has recently been updated to a Category 1 hurricane as the disturbance continues to churn in the Atlantic.\n2. As of Thursday afternoon 389,424, clients across Puerto Rico are still without power, according to LUMA Energy.\n3. A Hurricane Warning is in place as Ernesto will likely strengthen to a major hurricane before approaching Bermuda.\n\nTherefore, the following information can be extracted from the text:\nLocation: Puerto Rico, Bermuda\nNatural Disaster: Hurricane Ernesto"}, {"id": "58568631-8972-4703-bf58-3b2c5c20eda3", "title": "Ernesto expected to become major hurricane . What St . Augustine forecast ? ", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/ernesto-expected-become-major-hurricane-134727572.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto continued to strengthen overnight and is now expected to become a major hurricane by early Friday morning, according to the latest advisory from the National Hurricane Center.\nAt 8 a.m., the center of Tropical Storm Ernesto was located near latitude 19.8 North, longitude 67.2 West.\nErnesto is expected to become a hurricane later today and could become a major hurricane in a couple of days.\nGraphics explain the deadly weather eventHurricane warning: A hurricane warning means that hurricane conditions are expected somewhere within the warning area.\nTropical storm warning: A tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.", "location": "NA", "classification": "natural-disasters", "score": 0.948849848060405, "event_breakdown": "Tropical Storm Ernesto expected to become major hurricane by early Friday morning, according to the National Hurricane Center"}, {"id": "178585ae-784f-435f-8e56-f2802035484d", "title": "How Hurricane Ernesto Could Impact Your Travels", "date": "2024-08-16 04:15", "url": "https://www.cntraveler.com/story/hurricane-ernesto-travel-advice", "domain": "cntraveler.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, then a tropical storm, knocked out power for half of Puerto Rico on Wednesday and is moving toward Bermuda with increased strength.\nIn Puerto Rico, tropical storm conditions have passed, according to a Thursday travel advisory from Discover Puerto Rico, the island’s Destination Marketing Organization.\nHowever, parts of Vieques, Culebra, and the eastern coast of Puerto Rico are still recovering from heavy rains, flash floods, and tropical winds.\nIn Florida, Fort Lauderdale International Airport (FLL) and Miami International Airport (MIA) saw delay rates of 88.35% and 91.11% respectively, while Palm Beach International Airport (PBI), Southwest Florida International Airport (RSW), and Sarasota Bradenton International Airport (SRQ ) saw 100% of flights delayed.\nNorwegian Cruise LineThree Norwegian Cruise Line itineraries have also been modified as result of Hurricane Ernesto.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.743073564304109, "event_breakdown": "1. Tropical Storm Fred impacts Puerto Rico - Parts of Vieques, Culebra, and eastern Puerto Rico are recovering from heavy rains, flash floods, and tropical winds.\n2. Fort Lauderdale International Airport (FLL) and Miami International Airport (MIA) see significant flight delays as a result of Hurricane Ernesto.\n3. Norwegian Cruise Line modifies three itineraries due to Hurricane Ernesto."}, {"id": "58c03245-1988-45d3-ab65-d09fe3d26edf", "title": "INSIDE LOOK : Live Oak businesses rebounding 10 days after Hurricane Debby", "date": "2024-08-16 02:00", "url": "https://www.wtxl.com/live-oak/inside-look-live-oak-businesses-rebounding-10-days-after-hurricane-debby", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Neighbors in Live Oak are still recovering from flooding that filled the streets during Hurricane Debby.\nBROADCAST TRANSCRIPT:Between Hurricane Debby's heavy rainfall and the overflowing of the Suwannee River, Live Oak suffered from catastrophic flooding.\nThis was the scene of downtown Live Oak the day Hurricane Debby left the town in feet of floodwater.\nRosmery Casado, Manager at Latin Flavor Cafe - \"Este negocio tuvo perdidas, perdidas económicas.\"\nCasado - \"Mas las perdidas que se fueron en las inundaciones, las carnes, los alimentos, los materiales, el toldo — definitivamente es muy terrible.\"", "location": "Live Oak", "classification": "natural-disasters", "score": 0.8478282359746675, "event_breakdown": "Live Oak flooding, Hurricane Debby"}, {"id": "06faee81-b56a-4e37-9345-d9523dc88cb6", "title": "Isolated Downpours and Thunderstorms Through This Evening", "date": "2024-08-16 01:00", "url": "https://www.westernmassnews.com/2024/08/15/scattered-showers-thunderstorms-possible-this-afternoon/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "(WGGB/WSHM) - We saw hazy sunshine across western Mass this morning due to high atmospheric wildfire smoke from Canada.\nAn Air Quality Alert is in effect from midnight tonight through midnight Friday night.\nWildfire smoke will likely be back for much of the day, so hazy sunshine or even a cloudy look is expected.\nThe air quality will be at a level 3-dangerous for sensitive groups, especially Friday afternoon as smoke may work down to surface levels.\nDrier air begins working in Tuesday and a nice stretch of weather is looking likely mid to late week.", "location": "northhampton", "classification": "natural-disasters", "score": 0.48857048638643463, "event_breakdown": "Not relevant."}, {"id": "f772f502-36a5-468b-a509-6f96dac26092", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.goulburnpost.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "1. In Canada, British Columbia has declared a state of emergency as the province battles widespread flooding and landslides following a severe storm.\n2. In Peru, flooding and landslides have killed at least 60 people and forced thousands from their homes.\n3. In Texas, a severe winter storm has left millions of residents without power and water, leading to states of emergency in nine counties.\n4. In Haiti, a major earthquake has killed at least 227 people and injured hundreds more.\n5. In the Philippines, a major earthquake has left more than 100 people dead and hundreds more injured.\n6. In India, a heatwave has killed at least 180 people and sickened thousands more.\n7. In Ecuador, a major earthquake has killed at least 238 people and injured hundreds more."}, {"id": "88c07704-63c2-4f11-a3ed-71297b1ff3a8", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.newcastleherald.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDA.", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "c1183678-bf69-4707-b495-ae9ef0446273", "title": "Japan orders evacuations near Tokyo as Typhoon Ampil approaches", "date": "2024-08-16 04:15", "url": "https://www.aol.com/japan-cancels-flights-suspends-bullet-065258652.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "People in parts of Japan are being told to evacuate, with some homes losing power on Friday as Typhoon Ampil approaches the coast near Tokyo.\nAs of early Friday local time, the storm was recording winds of 185 kilometers per hour (115 miles per hour), according to the latest advisory from the Joint Typhoon Warning Center (JTWC).\nIt could strengthen further in the next 12 hours, with the storm reaching peak intensity as it passes by Japan.\nThe storm’s center is expected to remain slightly offshore as it turns toward the northeast and moves away from Japan, according to the JTWC and Japan’s Meteorological Agency.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo.", "location": "Japan", "classification": "natural-disasters", "score": 0.9004282926789284, "event_breakdown": "[\n\"Cyclone Amphan, an extremely severe cyclonic storm, on May 19 wrecked havoc in West Bengal, Odisha and Bangladesh causing high tidal surges that submerged low lying coastal areas,\" the Ministry wrote in its report.\"\n]"}, {"id": "93578a7a-49de-41f6-93ba-9b63cce206b9", "title": "Hope for costly Ike Dike funding restored with adoption of $56 billion statewide flood plan – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/08/15/496817/hope-for-costly-ike-dike-funding-restored-with-adoption-of-56-billion-statewide-flood-plan/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "File photoThe Texas Water Development Board on Thursday adopted Texas’ first $56 billion statewide flood plan— restoring hope for the long-anticipated Ike Dike and other coastal flood mitigation projects.\n“Texas’ statewide flood planning program is the first of its kind,” Reem Zoun, a Water Development Board director said.\nUnder the project, around $49 billion will be diverted to flood mitigation projects.\nApproximately one in six people in Texas live or work in known flood hazard areas, according to flood plan documents.\nOther mitigation projects outlined in the statewide flood plan include Houston-area floodplain analyses, stormwater detention basins and deep tunnel systems for stormwater management.", "location": "TEXAS", "classification": "natural-disasters", "score": 0.5410432192124125, "event_breakdown": "Hurricane Sam is churning in the Atlantic and is expected to become a major hurricane soon. It poses no threat to land at this time."}, {"id": "bceffbdf-bedd-403f-9477-c262be890dd4", "title": "Small Hildale earthquake serves as reminder to be prepared for  a big one  – St George News", "date": "2024-08-16 00:00", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/15/agl-small-hildale-earthquake-serves-as-reminder-to-be-prepared-for-a-big-one/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Stock photo | Photo by vchal/iStock/Getty Images Plus, St. George NewsST. GEORGE — A 3.3. magnitude earthquake hit Hildale on Thursday afternoon.\nThe rumbling was reported by nine people throughout Southern Utah, including those near Cedar City and Hurricane and across the Arizona border in Colorado City.\nThe 3.3 magnitude earthquake likely rattled household items, she said.\nWhile other small quakes have occurred throughout Southern Utah this summer, Morton said it likely isn’t a pattern.\nCopyright St. George News, SaintGeorgeUtah.com LLC, 2024, all rights reserved.", "location": "Hildale", "classification": "natural-disasters", "score": 0.877698511344161, "event_breakdown": "Ground shaking caused by earthquakes sometimes startles people, but is usually not harmful. Most of the earthquakes in populated parts of Utah are not greater than magnitude 3, and experienced by only a few people, but larger ones occur occasionally and can cause damage. The last known damaging earthquake in Utah occurred on April 14, 1962. It was a magnitude 5.4 quake which caused major injuries when the Post Office collapsed in St George.On April 12, 2020, a magnitude 5.7 earthquake struck Magna, which caused major disruption but no serious injuries. In recent years, many more earthquakes have been felt in Utah."}, {"id": "87571876-e030-49e0-883e-a3b7cfcb5ebd", "title": "Rare sighting :  Doomsday fish  found near Southern California shore", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/rare-sighting-doomsday-fish-found-220136112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (KSWB/KUSI) – In a rare and perhaps ominous sighting, an oarfish was found floating near California’s La Jolla Shores over the weekend.\nSeveral people then worked together to carry the sea creature from the ocean to the bed of a truck using a paddleboard.\nWhile most oarfish measure anywhere from 10 to 30 feet long, Hook confirmed that this one was right at 12 feet long.\nJust a couple days after the oarfish sighting in La Jolla, an earthquake with a magnitude of 4.4 shook Southern California about 2.5 miles south, southeast of Highland Park near Los Angeles.\n“Experts don’t have any evidence to theorize why these fish are washing ashore in Southern California, but learn more from each specimen that is collected,” said Hook.", "location": "La Jolla Shores", "classification": "natural-disasters", "score": 0.6150464164994074, "event_breakdown": "Oarfish found in La Jolla Shores, California"}, {"id": "8a7e67ba-993d-45b2-9003-1574709aee8f", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:30", "url": "https://www.yorkpress.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "['Bermuda', 'Ernesto is expected to pass near or over the island']"}, {"id": "83f6e850-1ecc-4b1b-8925-945d86b7f262", "title": "Light earthquake : M4 . 5 quake has struck near the Fiji Islands", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-5-quake-has-struck-near-the-fiji-islands-38/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported south of the Fiji Islands (0 miles) on Friday.\nThe epicenter was at a depth of 48.225 km (30 miles).\nEvent ids that are associated to the earthquake: us7000n7c2.\nIn the past 24 hours, there have been two, in the last 10 days two, in the past 30 days two and in the last 365 days ten earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: south of the Fiji Islands.", "location": "Fiji Islands", "classification": "natural-disasters", "score": 0.7900118715713899, "event_breakdown": "A light earthquake with magnitude 4.5 (ml/mb) was reported south of the Fiji Islands (0 miles) on Friday. In the past 24 hours, there have been two, in the last 10 days two, in the past 30 days two and in the last 365 days ten earthquakes of magnitude 3.0 or greater that has struck near. This information comes from the USGS Earthquake Notification Service."}, {"id": "935fb6c3-8b4b-4475-b778-596ee718a4cf", "title": "Light earthquake , 4 . 4 mag strikes near Mohr in Iran", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-mohr-in-iran-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 90 km WNW of Mohr, Iran (56 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nDate and time of earthquake in UTC/GMT: 14/08/24 / 2024-08-14 03:48:09 / August 14, 2024 @ 3:48 am.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 90 km WNW of Mohr, Iran.", "location": ")\nAnswer:\nMohr", "classification": "natural-disasters", "score": 0.9652147183173474, "event_breakdown": "A light earthquake magnitude 4.4 (ml/mb) strikes 90 km WNW of Mohr, Iran (56 miles) on Wednesday. The 4.4-magnitude earthquake has occurred at 03:48:09 / 3:48 am (local time epicenter). The earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface. Exact location of event, depth 10 km, 55.9512° East, 28.5142° North. Event ids that are associated to the earthquake: us70006w5v. Id of event: us70006w5v. Exact time and date of event in UTC/GMT: 14/08/24 / 2024-08-14 03:48:09 / August 14, 2024 @ 3:48 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist). This is a decideus event, normally you only see this kind of events twice a year worldwide. Since there are also only 17 reported earthquakes of magnitude 4.0+ world-wide occurring annually, I feel it worth it to create a short report to the earthquake even.\nExact location of event, depth 10 km, 55.9512° East, 28"}, {"id": "da438c73-d381-4210-bf0a-77be844d7e33", "title": "Light earthquake , 4 . 3 mag strikes near Ollagüe in Chile", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-strikes-near-ollague-in-chile/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 28 km WSW of Ollagüe, Chile (17 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 145.4 km (90 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7bt.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 28 km WSW of Ollagüe, Chile.", "location": "Chile", "classification": "natural-disasters", "score": 0.9749922841506401, "event_breakdown": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 28 km WSW of Ollagüe, Chile (17 miles). The epicenter of the earthquake was roughly 145.4 km (90 miles) below the earth’s surface. Ids that are associated to the earthquake: us7000n7bt. Exact location of earthquake, longitude -71.5198 West, latitude -33.3296 South, depth = 145.4 km. Exact time and date of event in UTC/GMT: 23/10/20 / 2020-10-23 21:11:47 / October 23, 2020 @ 9:11 pm. The temblor was reported at 21:11:47 / 9:11 pm (local time epicenter)."}, {"id": "caf1a021-1bb5-4cdd-beae-45812a39d5cb", "title": "Light earthquake , 4 . 4 mag was detected near Palu in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-was-detected-near-palu-in-indonesia-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 209 km NNE of Palu, Indonesia (130 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us7000n7bx.\nId of event: us7000n7bx.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 209 km NNE of Palu, Indonesia.", "location": ")\nPALU, Indonesia", "classification": "natural-disasters", "score": 0.9666688279985242, "event_breakdown": "Earthquake in Indonesia today: a show more info\nA light earthquake magnitude 4.4 (ml/mb) strikes 209 km NNE of Palu, Indonesia (130 miles) on Friday.\nThe temblor was detected in western Indonesia-000 km W of Banda Sea, Indonesia.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEarthquakes 4.0 to 4.9 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days one earthquakes of magnitude 3.0 or greater that has struck near. Each year there are an estimated 13,000 light earthquakes in the world."}, {"id": "325c21c8-ce20-4cb5-9758-831bcf9d260f", "title": "Light earthquake , 4 . 3 mag was detected near Tokār in Sudan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-was-detected-near-tokar-in-sudan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Saturday, 170 km ENE of Tokār, Sudan (106 miles).\nThe 4.3-magnitude earthquake was detected at 00:29:29 / 12:29 am (local time epicenter).\nAll ids that are associated to the event: us6000njmc.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 170 km ENE of Tokār, Sudan.", "location": ".\nThe main focus of the event is the location 170 km ENE of Tokār", "classification": "natural-disasters", "score": 0.9050845126356359, "event_breakdown": "Quake on the border of Sudan and Eritrea."}, {"id": "dc89ca9e-ebfc-45f5-b044-d43113f3cf6d", "title": "Light earthquake , 4 . 3 mag has occurred near Levuka in Fiji", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-has-occurred-near-levuka-in-fiji-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 86 kilometers (53 miles) from Levuka in Fiji.\nThe epicenter of the earthquake was roughly 585.865 km (364 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7aa.\nThe epicenter was 87 km (54 miles) from Levuka (c. 8 400 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 86 km NE of Levuka, Fiji.", "location": "Levuka", "classification": "natural-disasters", "score": 0.8866964580282594, "event_breakdown": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 86 kilometers (53 miles) from Levuka in Fiji. The epicenter of the earthquake was roughly 585.865 km (364 miles) below the earth’s surface. The earthquake occurred at a depth of 585.865 km (364 miles) below the earth’s surface. The ids that are associated to the earthquake: us7000n7aa. The epicenter was 87 km (54 miles) from Levuka (c. 8 400 pop). There are an estimated 13,000 light earthquakes in the world each year. Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been twenty-eight earthquakes of magnitude 3.0 or greater that has occurred nearby."}, {"id": "864e4cd2-f811-4a5e-9533-a00b513387eb", "title": "Light earthquake 4 . 3 mag , central Mid - Atlantic Ridge", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-central-mid-atlantic-ridge-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, central Mid-Atlantic Ridge (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -31.4027 West, latitude 3.047 North, depth = 10 km.\nEvery year there are an estimated 13,000 light earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: central Mid-Atlantic Ridge.", "location": "MID-ATLANTIC RIDGE", "classification": "natural-disasters", "score": 0.9776925333225994, "event_breakdown": "Event category:\nInfo:\nThe USGS now reports this as a 4.5 Magnitude earthquake.\nlight earthquake in central Mid-Atlantic Ridge on Sunday, 9 January 2022, 11:45:23 CET. Unofficial magnitude 4.5 (meter). Read news story\nConnect word1 and word2\nNo connection could be found between \"earthquake\" and \"magnitude\"."}, {"id": "4858c4e6-654e-49f4-8635-79644be0c509", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 04:15", "url": "https://www.npr.org/2024/08/15/g-s1-17259/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "npr.org", "domain_classification": "International", "message": "Ernesto grows into a Category 2 hurricane as it aims for Bermudatoggle caption Alejandro Granadillo/APSAN JUAN, Puerto Rico — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nThe storm was centered about 410 miles (660 kilometers) south-southwest of Bermuda late Thursday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "SAN JUAN, Puerto Rico", "classification": "natural-disasters", "score": 0.9041145331534577, "event_breakdown": "Hurricane Ernesto heading for Bermuda\nHundreds of thousands in Puerto Rico without power or water"}, {"id": "ac4899bd-6940-4030-b860-0e0ee385dde9", "title": "Puente Hill Fault causes recent SoCal earthquakes", "date": "2024-08-16 01:30", "url": "https://www.10news.com/news/local-news/puente-hill-fault-causes-recent-socal-earthquakes", "domain": "10news.com", "domain_classification": "Unknown", "message": "Instead, it was the Puente Hills Fault, an entirely different area that may pose a larger earthquake risk.\nThe Puente Hills Fault stretches 25 miles, from downtown Los Angeles to Pasadena and northern Orange County.\n\"The site is a bad site geologically,\" said Dr. Abbott.\nIt's what falls on you or is thrown at you,\" said Dr. Abbott.\nDr. Abbott says one of the best places to start preparing your home is your bedroom.", "location": "Los Angeles", "classification": "natural-disasters", "score": 0.5379301680522607, "event_breakdown": "Puente Hills Fault, California\n\nIn Southern California, a previously unknown earthquake fault has been discovered. Scientists believe it could be even more dangerous than the more well-known San Andreas Fault. The Puente Hills Fault stretches for 25 miles, traveling through Los Angeles, Pasadena, and northern Orange County."}, {"id": "c29234c7-8f12-4b10-805b-9807725946ff", "title": "Light earthquake 4 . 2 mag , 25 km NW of Velasco Ibarra , Ecuador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-2-mag-25-km-nw-of-velasco-ibarra-ecuador/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 25 kilometers (16 miles) from Velasco Ibarra in Ecuador on Wednesday.\nIds that are associated to the earthquake: us6000nk0c.\nThe earthquake was roughly at a depth of 60.344 km (37 miles).\nEarthquake epicenter was 76 km (47 miles) from Portoviejo (c. 170 300 pop), 41 km (25 miles) from Quevedo (c. 119 400 pop), 26 km (16 miles) from Velasco Ibarra (c. 48 800 pop), 74 km (46 miles) from Ventanas (c. 46 700 pop), 38 km (24 miles) from Chone (c. 44 800 pop), 56 km (35 miles) from Balzar (c. 40 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 25 km NW of Velasco Ibarra, Ecuador.", "location": "Ecuador", "classification": "natural-disasters", "score": 0.7046986335708763, "event_breakdown": "25 km NW of Velasco Ibarra, Ecuador."}, {"id": "3196ab87-e9f4-4b42-abc8-d63cb4413f36", "title": "  Very strong  Typhoon Ampil prompts storm warnings as it nears eastern Japan", "date": "2024-08-16 01:30", "url": "https://www.japantimes.co.jp/news/2024/08/16/japan/typhoon-ampil-severe-storm/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "A Level 4 evacuation order was issued in the city of Mobara, Chiba Prefecture, urging residents in areas with a high risk of landslides and inundation to evacuate.\nLevel 3 advisories, encouraging the elderly and those with disabilities to evacuate, were issued in various cities in Tokyo, Chiba, Kanagawa, Ibaraki and Fukushima prefectures.\nDepartment stores in Chiba Prefecture, such as Sogo and Ito-Yokado, have announced that they will close temporarily due to the typhoon.\nThe storm is forecast to strengthen further on Friday as it moves closer to the coast of Chiba Prefecture on Friday.\nOn the Sobu Rapid and Keiyo lines, trains running directly from Chiba Prefecture have been canceled.", "location": "CHIBA", "classification": "natural-disasters", "score": 0.48397278012815703, "event_breakdown": "Typhoon Haishen\nLevel 4 evacuation order issued in the city of Mobara, Chiba Prefecture\nVarious cities in Tokyo, Chiba, Kanagawa, Ibaraki and Fukushima prefectures are issued Level 3 advisories"}, {"id": "5a878952-da33-4024-896c-693effab484e", "title": "Light earthquake : M4 quake has struck near Yamada in Japan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-quake-has-struck-near-yamada-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has occurred on Sunday, 148 km E of Yamada, Japan (92 miles).\nGlobal time and date of event 28/07/24 / 2024-07-28 21:49:11 / July 28, 2024 @ 9:49 pm UTC/GMT.\nThe epicenter was at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 148 km E of Yamada, Japan.", "location": "Japan", "classification": "natural-disasters", "score": 0.9757015870249361, "event_breakdown": "['There was a light earthquake magnitude 4 (ml/mb) that struck 148 km E of Yamada, Japan on Sunday, 28/07/24 / 2024-07-28 21:49:11 / July 28, 2024 @ 9:49 pm UTC/GMT.', 'The epicenter of the earthquake was located at a depth of 10 km (6 miles).', 'No tsunami warning has been issued.', 'This is a breaking news push - an earthquake that is occurring now and has been reported in the news.', 'Natural disasters include earthquakes, storms, volcanic eruptions, and wildfires.'].\nThere was a light earthquake magnitude 4 (ml/mb) that struck 148 km E of Yamada, Japan on Sunday, 28/07/24 / 2024-07-28 21:49:11 / July 28, 2024 @ 9:49 pm UTC/GMT. The epicenter of the earthquake was located at a depth of 10 km (6 miles). No tsunami warning has been issued. This is a breaking news push - an earthquake that is occurring now and has been reported in the news. Natural disasters include earthquakes, storms, volcanic eruptions, and wildfires."}, {"id": "7175554b-f693-423e-952e-27e0f30769d2", "title": "Why Bermuda is among the most hurricane - resilient areas", "date": "2024-08-16 01:30", "url": "https://www.yahoo.com/news/why-bermuda-among-most-hurricane-224733048.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Since reliable data started to be kept by meteorologists in the 1800s, 90 cyclones have passed within 50 miles or less of Bermuda.\nDuring the early 20th century, Bermuda experienced a string of powerful hurricanes, which resulted in strict building standards.\nWaves hit te rocks in Church Bay, Bermuda, as Hurricane Fiona churned towards the Atlantic island as a powerful Category 4 storm on September 22, 2022.\n- Hurricane Fiona churned toward Bermuda as a powerful Category 4 storm on Wednesday as Puerto Rico struggled to restore power and water after receiving a crushing blow.\nOriginal article source: Why Bermuda is among the most hurricane-resilient areas", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.8982725954492455, "event_breakdown": "Hurricane Fiona churns toward Bermuda as a powerful Category 4 storm."}, {"id": "48cd76a5-c6a3-49b4-b621-c22767954677", "title": "Light earthquake , 4 . 5 mag has occurred near Khorugh in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-khorugh-in-tajikistan-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Friday, 38 kilometers (24 miles) from Khorugh in Tajikistan.\nThe earthquake was roughly at a depth of 108.155 km (67 miles).\nNearby country/countries that might be effected, Afghanistan (c. 29 121 000 pop), Tajikistan (c. 7 487 000 pop).\nIn the past 24 hours, there have been two, in the last 10 days five, in the past 30 days twelve and in the last 365 days fourty-six earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 38 km SSW of Khorugh, Tajikistan.", "location": ")\nTajikistan", "classification": "natural-disasters", "score": 0.7864636960823636, "event_breakdown": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Friday, 38 kilometers (24 miles) from Khorugh in Tajikistan. Global date and time of event UTC/GMT: 22/04/16 / 2016-04-22 14:39:12 / April 22, 2016 @ 2:39 pm. The temblor was picked up at 05:39:12 / 5:39 am (local time epicenter). Exact location, longitude 70.9075° East, latitude 37.1066° North, depth = 108.155 km. A tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist). All ids that are associated to the event: us10004gms. Unique identifier: us10004gms.\nThere are an estimated 13,000 light earthquakes in the world each year. Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been two, in the last 10 days five, in the past 30 days twelve and in the last 365 days fourty-six earthquakes of magnitude 3.0 or greater that has struck near.\nDid you feel the quake?\nDid objects"}, {"id": "d4ee20f4-f775-4b01-b944-7b2a255bc980", "title": "Light earthquake 4 . 3 mag , 5 km W of Cepitá , Colombia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-5-km-w-of-cepita-colombia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Wednesday, 5 kilometers (3 miles) from Cepitá in Colombia.\nEvent ids that are associated to the earthquake: us6000njzx.\nId of event: us6000njzx.\nThe epicenter was 42 km (26 miles) from Bucaramanga (c. 571 800 pop), 34 km (21 miles) from Floridablanca (c. 252 300 pop), 38 km (23 miles) from Girón (c. 108 500 pop), 25 km (16 miles) from Piedecuesta (c. 86 400 pop), 80 km (50 miles) from Pamplona (c. 53 600 pop), 26 km (16 miles) from San Gil (c. 33 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 5 km W of Cepitá, Colombia.", "location": "Cepitá", "classification": "natural-disasters", "score": 0.6617919504440553, "event_breakdown": "Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days four and in the last 365 days eighty-nine earthquakes of magnitude 3.0 or greater that have been detected nearby. There are an estimated 13,000 light earthquakes in the world each year.\nHow would you describe the shaking?\nHow did you react? Was there any damage to buildings? Leave a comment or report about shaking, activity and damage at your home, city and country. Read more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 5 km W of Cepitá, Colombia. This data comes from the USGS Earthquake Notification Service.\nCopyright © The United Nations"}, {"id": "a50617b8-0c76-4cc6-93b2-2e90191cf384", "title": "Light earthquake , 4 . 4 mag strikes near Puerto El Triunfo in El Salvador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-puerto-el-triunfo-in-el-salvador-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 27 kilometers (17 miles) from Puerto El Triunfo in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter was at a depth of 74.681 km (46 miles).\nClose country/countries, El Salvador (c. 6 052 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 27 km SSW of Puerto El Triunfo, El Salvador.", "location": ")\nEl Salvador", "classification": "natural-disasters", "score": 0.8876421747471679, "event_breakdown": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 27 kilometers (17 miles) from Puerto El Triunfo in El Salvador. Exact time and date of event in UTC/GMT: 28/04/22 / 2022-04-28 05:32:03 / April 28, 2022 @ 5:32 am. Exact location of event, longitude -92.1355 West, latitude 13.5152 North, depth = 74.681 km. Unique identifier: us7000cjnd. Ids that are associated to the event: us7000cjnd. The temblor was reported at 05:32:03 / 5:32 am (local time epicenter).\nClose country/countries that might be effected, El Salvador (c. 6 052 000 pop) (That might be effected). Epicenter of the event was 27 km (17 miles) from Puerto El Triunfo (c. 39 500 pop).\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days four and in the last 365 days fifty-one earthquakes of magnitude 3.0 or greater that has struck near. Every year there are an estimated"}, {"id": "5cdc9a57-f365-4b73-ae52-6e3d7c83728d", "title": "Hurricane season : Long Islanders with pets advised to prepare for power outages , evacuations", "date": "2024-08-16 02:30", "url": "https://www.newsday.com/news/weather/hurricane-preparations-pets-dogs-cats-aqiamej1", "domain": "newsday.com", "domain_classification": "Unknown", "message": "As the Atlantic hurricane season nears its peak, officials are warning Long Islanders to be prepared for power outages and possible evacuations — and not to forget their pets.\n\"If we know the history of Long Island and the history of hurricane season, we know it’s coming.\nA Paws of War service dog attends a hurricane emergency preparedness event at the H. Lee Dennison building in Hauppauge on Thursday.\nCredit: Morgan CampbellNassau and Suffolk county officials have warned of needed preparations at the start of the hurricane season in June.\nThe storms so far have avoided Long Island, including Hurricane Ernesto, which has veered north into open waters in the Mid-Atlantic.", "location": ",\nLong Island", "classification": "natural-disasters", "score": 0.8836162188729234, "event_breakdown": "As the Atlantic hurricane season nears its peak, officials are warning Long Islanders to be prepared for power outages and possible evacuations - and not to forget their pets."}, {"id": "c3e2e401-f90c-4dbb-bbd3-fd2943912927", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://komonews.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "komonews.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling toward Bermuda, left hundreds of thousands in Puerto Rico without power or water."}, {"id": "e0c70688-4786-4faf-8000-53f47a48d25f", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wlos.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto, 450 miles south-southwest of Bermuda."}, {"id": "a1c111a0-89ec-4562-bebf-7f5957f0dfe1", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:30", "url": "https://foxbaltimore.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Natural disaster - Hurricane leaves hundreds of thousands in Puerto Rico without power,  barrel toward Bermuda \nType - tropical \nYear - 2022 \nMonth - June \nDay - 2022 \nLocation - Puerto Rico, Bermuda \nDate - July 7, 2022 \nDeaths - 0"}, {"id": "74a95e2b-1761-4799-8158-24746a6b5dd2", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://news3lv.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto - A Category 1 storm is located about 450 miles south-southwest of Bermuda on Thursday afternoon. It is heading for the Bahamas and threatening to bring heavy rain and strong winds to the region. The storm is expected to pass near Bermuda on Saturday, though no major damage is expected to the island."}, {"id": "d25ce6fc-88a6-4d1c-9bc6-c7bac8a482fc", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://khqa.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "khqa.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": ")\nBERMUDA", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling towards Bermuda\nErnesto was a Category 1 hurricane that barreled towards Bermuda on Thursday, August 31, 2017. Bermuda’s National Hurricane Center in Miami moved up its estimated arrival date by as much as a day and residents stocked up on plywood and bottled water. It left hundreds of thousands of people without power or water in Puerto Rico before sweltering heat enveloped the U.S. territory."}, {"id": "81137a44-a646-4de2-b2b2-9b976d30e063", "title": "Hurricane Ernesto nears Bermuda as Puerto Rico outages persist", "date": "2024-08-16 06:45", "url": "https://www.stabroeknews.com/2024/08/16/news/regional/hurricane-ernesto-nears-bermuda-as-puerto-rico-outages-persist/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "Now a Category 1 hurricane, Ernesto is forecast to strengthen into a much more powerful hurricane before it reaches Bermuda late today, a British island territory far out in the Atlantic, the National Hurricane Center (NHC) said.\n“Strengthening is forecast during the next day or so, and Ernesto could be near major hurricane strength by Friday,” the NHC said.\nErnesto became a hurricane on Wednesday after leaving Puerto Rico as a tropical storm, where it battered the island with heavy rainfall.\nFive years earlier, Hurricanes Irma and Maria destroyed the island’s power grid and caused outages in some areas that lasted nearly a year.\nErnesto is the fifth named Atlantic storm of what is expected to be an intense hurricane season.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9381583663305699, "event_breakdown": "Ernesto, a Category 1 hurricane, is forecast to strengthen and become a much more powerful hurricane before it reaches Bermuda later today, according to the National Hurricane Center. Twenty five thousand people are still without power in the Dominican Republic, which is bracing itself for impact. An alert issued by the Dominican Republic's national emergency commission urged those living in low-lying areas to evacuate to higher land out of fear of flooding."}, {"id": "d8396b49-6696-4725-a1a3-5c9fa89c7244", "title": "Nature  needs £3 billion climate support  ", "date": "2024-08-16 09:30", "url": "https://theecologist.org/2024/aug/16/nature-needs-ps3-billion-climate-support", "domain": "theecologist.org", "domain_classification": "Unknown", "message": "Drought is now the biggest threat to important sites for nature across the UK as the climate changes, a report from The Wildlife Trusts has warned.\nThe report examining the dangers posed to nature reserves cared for by the trusts also points to pollution, invasive species and habitat fragmentation as key current risks to wildlife in woods, peatlands, wetlands, coastal areas and grasslands.\nOver the next 30 years, Wildlife Trusts experts believe drought will continue to pose the biggest threat to their reserves, with other climate-driven risks including heatwaves and wildfires also causes for high concern.\nThe Wildlife Trusts warned that flooding, rather than drought, is often at the top of the list of hazards that politicians and governments use to discuss climate impacts.\nDrought planning needs more urgent attention alongside the other key hazards associated with climate change, the report urges.", "location": "UNITED KINGDOM", "classification": "natural-disasters", "score": 0.7771400380400006, "event_breakdown": "Here are the natural-disaster events relevant to your request:\n1. Drought, pollution and invasive species biggest threat to UK nature reserves\n2. Drought now the biggest threat to UK nature reserves as climate changes\n3. Climate-driven risks - drought, heatwaves and wildfires - major concerns in 30-year UK nature reserves assessment"}, {"id": "952df5a0-e9e1-4dde-a309-80061c04e419", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 00:30", "url": "https://www.newcastleherald.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDA.", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "1. Hurricane Dorian - Dorian was a Category 1 hurricane that caused significant damage to the Bahamas in 2019. It caused widespread destruction, damaging homes, businesses, and infrastructure. The hurricane also caused widespread power outages and flooding.\n2. Hurricane Florence - Florence was a Category 1 hurricane that caused significant damage to the Carolinas in 2018. It caused widespread power outages and flooding, and it left many homes and businesses uninhabitable. The hurricane also caused significant damage to coastal ecosystems and fisheries.\n3. Hurricane Harvey - Harvey was a Category 4 hurricane that caused significant damage to Houston, Texas in 2017. It caused widespread flooding and power outages, and prompted the largest evacuation in the city's history. The hurricane also caused significant damage to coastal ecosystems and fisheries.\n4. Hurricane Irma - Irma was a Category 5 hurricane that caused significant damage to the Caribbean and Florida in 2017. It caused widespread power outages and flooding, and prompted the largest evacuation in Florida's history. The hurricane also caused significant damage to coastal ecosystems and fisheries.\n5. Hurricane Maria - Maria was a Category 5 hurricane that caused significant damage to Puerto Rico in 2017. It caused widespread power outages and flooding, and prompted the largest evacuation in Puerto Rico's history. The hurricane also caused significant damage to coastal ecosystems and fisheries.\n6. Hurricane Matthew - Matthew was a Category 5 hurricane that caused significant damage to the Caribbean and Haiti in 2016"}, {"id": "99e4d794-b00f-4239-9197-39b2e9c54555", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 07:45", "url": "https://www.sconeadvocate.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "Natural disasters in the news:\n\n* Floods in Brazil have affected millions of people, causing widespread damage and loss of life.\n* A magnitude 7.1 earthquake struck Mexico City, killing at least 225 people and damaging many buildings.\n* A magnitude 6.5 earthquake struck New Zealand, causing minor damage and no injuries.\n* A magnitude 5.3 earthquake struck Japan, causing minor damage and no injuries."}, {"id": "f92e2eb8-a025-4979-b9b0-29d90b380198", "title": "Japan : Thousands ordered to evacuate as Typhoon Ampil approaches coast near Tokyo", "date": "2024-08-16 08:00", "url": "https://news.webindia123.com/news/Articles/World/20240816/4225658.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Residents in parts of Japan are being ordered to evacuate with some homes losing power on Friday as Typhoon Ampil approaches the coast near Tokyo, CNN reported.\nThe storm is expected to continue intensifying in the next 12 hours, potentially reaching its peak as it passes near Japan.\nThe storm is forecasted to hit the area by late Friday, bringing strong winds and heavy rain.\nFurther, a similar notice was issued in the city of Yokohama, south of Tokyo, with authorities warning that all residents should be prepared to evacuate.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.9607390132679073, "event_breakdown": "Typhoon Ampil approaching Japan near Tokyo, forcing evacuations and power outages."}, {"id": "f187eea0-689c-4bbf-b74c-ef64a819d393", "title": "Ernesto Becomes Category 2 Hurricane as It Heads to Bermuda", "date": "2024-08-16 08:30", "url": "https://www.insurancejournal.com/news/international/2024/08/16/788670.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Ernesto strengthened into a Category 2 hurricane as it plowed northward toward Bermuda, threatening to drench the British territory with heavy rain and unleash flash floods.\nThe storm was 410 miles (660 kilometers) south-southwest of Bermuda according to an advisory from the US National Hurricane Center as of 11 p.m. in New York.\nIts top winds reached 100 miles per hour, making it a Category 2 hurricane on the five-step Saffir-Simpson scale.\nErnesto is expected to become a major Category 3 hurricane by about 2 p.m. Friday as it approaches Bermuda, but may weaken again by the time it reaches the island Saturday morning, according to AccuWeather Inc.\nPhotograph: Police block a flooded road as Tropical Storm Ernesto passes through Fajardo, Puerto Rico.", "location": "The only location that is mentioned in this text is Bermuda.", "classification": "natural-disasters", "score": 0.9748511099322091, "event_breakdown": "Tropical Storm Ernesto threatens Bermuda"}, {"id": "a1c5bde2-52e3-4981-b6db-057e5b489d14", "title": "Hurricane Ernesto strengthens to Category 2 storm as it heads north", "date": "2024-08-16 06:30", "url": "https://www.bristolpost.co.uk/news/uk-world-news/hurricane-ernesto-strengthens-category-2-9487067", "domain": "bristolpost.co.uk", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened into a Category 2 storm on Thursday night as it moved toward Bermuda, after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9415143940891745, "event_breakdown": "Hurricane Ernesto strengthened into a Category 2 storm on Thursday night as it moved toward Bermuda, after leaving hundreds of thousands of people in Puerto Rico without power or water.\nTyphoon Surigae made landfall in the Philippines on Friday, bringing heavy rain and strong winds to the region.\nA volcano erupted on Sunday on the island of St. Vincent in the eastern Caribbean, sending a column of smoke and ash 20,000 feet into the sky. Residents were ordered to evacuate the surrounding area.\nA earthquake of magnitude 8.0 struck off the coast of central Chile on Wednesday, triggering a tsunami that swept across the Pacific. No injuries were reported."}, {"id": "ff02350b-87fd-4ea5-8659-6923172fafdc", "title": "Light earthquake : M4 . 2 quake has struck near Tual in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-2-quake-has-struck-near-tual-in-indonesia-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Wednesday, 91 km SSW of Tual, Indonesia (57 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000njzj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 91 km SSW of Tual, Indonesia.", "location": ")\n91 km SSW of Tual, Indonesia", "classification": "natural-disasters", "score": 0.9732484154282277, "event_breakdown": "The earthquake occured in the Pacific Ocean 91 km south of Manus Island in Papua New Guinea. The earthquake had a magnitude of 4.2 and occurred 10 km underground."}, {"id": "f7d8800a-04de-49d3-a484-bcc86510119b", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:45", "url": "https://www.salisburyjournal.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "Bermuda, Ernesto, hurricane, National Hurricane Centre, Miami, Atlantic Canada"}, {"id": "f4fccbe6-10f2-4f9b-b7c1-b6c000c8a9c5", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.lancashiretelegraph.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "Ernesto nears Bermuda, threatens hurricane conditions"}, {"id": "281fcc86-ee5f-4ffc-967b-88f3b4184891", "title": "Light earthquake , 4 . 3 mag was detected near False Pass in Alaska", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-was-detected-near-false-pass-in-alaska-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 153 km S of False Pass, Alaska (95 miles) on Tuesday.\nThe earthquake occurred at a depth of 20.187 km (13 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n77k.\nIn the past 24 hours, there have been three, in the last 10 days six, in the past 30 days ten and in the last 365 days twenty-three earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 153 km S of False Pass, Alaska.", "location": "Alaska", "classification": "natural-disasters", "score": 0.81146455181729, "event_breakdown": "A light earthquake magnitude 4.3 (ml/mb) strikes 153 km S of False Pass, Alaska (95 miles) on Tuesday. The epicenter is 136 km from Sand Point (lat. 55.8839°, long. -162.5503°, depth = 20.187 km ) according to the Geonames database and various sources. Initially several scale values were issued, now its magnitude is equivalent to mb. The earthquake occurred at a depth of 20.187 km (13 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n77k.\nIn the past 24 hours, there have been three, in the last 10 days six, in the past 30 days ten and in the last 365 days twenty-three earthquakes of magnitude 3.0 or greater that was reported nearby."}, {"id": "b9ef5ddb-155a-4fe2-857c-d9dcacc54b91", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:45", "url": "https://www.thenorthernecho.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "1. A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n2. Ernesto is expected to pass near or east of Atlantic Canada on Monday."}, {"id": "94da0fcc-0c2b-4fee-96d6-d5f418103689", "title": "Light earthquake , 4 . 5 mag has occurred near  Ohonua in Tonga", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-ohonua-in-tonga-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 236 km SSW of ‘Ohonua, Tonga (147 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us7000n77h.\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days six earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 236 km SSW of ‘Ohonua, Tonga.", "location": ")\nTonga", "classification": "natural-disasters", "score": 0.9146869395300673, "event_breakdown": "A light earthquake magnitude 4.5 (ml/mb) strikes 236 km SSW of ‘Ohonua, Tonga (147 miles) on Tuesday. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days six earthquakes of magnitude 3.0 or greater that was reported nearby. The earthquake occurred at a depth of 10 km (6 miles). Event ids that are associated to the earthquake: us7000n77h. Date and time of earthquake in UTC/GMT: 18/08/20 / 2020-08-18 10:20:17 / August 18, 2020 @ 10:20 am. The 4.5-magnitude earthquake was detected at 10:20:17 / 10:20 am (local time epicenter). Exact location of earthquake, -178.2358° West, -22.6453° South, depth 10 km. There are an estimated 13,000 light earthquakes in the world each year. Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and"}, {"id": "1c7ac60b-9043-4079-8abc-4c54e4e61bb1", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.bucksfreepress.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "Bermuda, Ernesto, Hurricane, National Hurricane Center\n1. Hurricane Ernesto is expected to pass near or over the island of Bermuda on Saturday, August 4, 2018. 2. Hurricane warnings are in effect for Bermuda. 3. Hurricane Ernesto is expected to pass near or east of Atlantic Canada on Monday. 4. Ernesto was generating southern winds in Puerto Rico on Thursday, which have a heating effect. 5. Ernesto was generating southern winds in Puerto Rico that have a heightened heating effect, unlike typical cooling wind from the east. 6. Puerto Rico was experiencing power outage problems following the storm's most recent pass."}, {"id": "6e3ad98c-81da-4f97-860d-cf6dcccc2e15", "title": "Light earthquake , 4 . 9 mag was detected near Kawalu in Indonesia", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-9-mag-was-detected-near-kawalu-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 223 km SSW of Kawalu, Indonesia (139 miles) on Friday.\nExact location of earthquake, longitude 107.7116 East, latitude -9.3421 South, depth = 10 km.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 223 km SSW of Kawalu, Indonesia.", "location": ")\nIndonesia", "classification": "natural-disasters", "score": 0.9662644697380145, "event_breakdown": "EarthquakeInformation about the earthquake that happened 223 Km South South West of Kawalu, Indonesia.https://earthquake.usgs.gov/earthquakes/eventpage/us70011h9fhttps://earthquake.usgs.gov/earthquakes/eventpage/us70011h9f\nEvent\n- A light earthquake with magnitude 4.9 (ml/mb) was reported 223 km SSW of Kawalu, Indonesia (139 miles) on Friday, at 21:46 UTC (14:46 local time). The depth of the hypocenter was 10 km (6 miles).\n- The earthquake was not strong enough to generate a tsunami, and no warning was issued. No injuries or damage were reported."}, {"id": "2efebd60-37cf-473c-98d9-7aacabd102c5", "title": "Bermuda on hurricane alert | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-16 09:30", "url": "https://www.arkansasonline.com/news/2024/aug/16/bermuda-on-hurricane-alert/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico -- Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe storm was centered about 410 miles south-southwest of Bermuda late Thursday.\n\"All of the guidance show this system as a large hurricane near Bermuda,\" said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9137477536392652, "event_breakdown": "['Hurricane Ernesto strengthens to Category 2, barrels toward Bermuda', '250,000 people in Puerto Rico without power and water']"}, {"id": "961b4317-d7f8-472a-88e2-e61064371cf9", "title": "Light earthquake , 4 . 5 mag has occurred near Sarangani in Philippines", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-sarangani-in-philippines-10/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Friday, 55 kilometers (34 miles) from Sarangani in Philippines.\nDate and time of earthquake in UTC/GMT: 16/08/24 / 2024-08-16 05:48:28 / August 16, 2024 @ 5:48 am.\nId of earthquake: us7000n7d0.\nThe epicenter was 55 km (34 miles) from Sarangani (c. 7 500 pop), 94 km (58 miles) from Pangyan (c. 5 300 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 55 km SSE of Sarangani, Philippines.", "location": "SARANGANI", "classification": "natural-disasters", "score": 0.892124605571952, "event_breakdown": "An earthquake with a magnitude of 4.5 hit near Sarangani, Philippines on August 16, 2024. The epicenter was located 55 kilometers (34 miles) from Sarangani and 94 kilometers (58 miles) from Pangyan. No injuries or damage were reported."}, {"id": "1285b715-2eb4-4661-96a1-0d852c691215", "title": "Light earthquake , 4 . 9 mag strikes near Maumere in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-9-mag-strikes-near-maumere-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 108 km NE of Maumere, Indonesia (67 miles) on Friday.\nThe epicenter of the earthquake was roughly 219.078 km (136 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n7bp.\nId of event: us7000n7bp.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 108 km NE of Maumere, Indonesia.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.8567723294657205, "event_breakdown": "Natural disasters in Indonesia. Earthquake."}, {"id": "b89170c7-921a-4636-aa19-c14d35d9c9cd", "title": "Light earthquake , 4 . 4 mag strikes near Tingo María in Peru", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-tingo-maria-in-peru/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Tuesday, 39 kilometers (24 miles) from Tingo María in Peru.\nIds that are associated to the earthquake: us6000ngzs.\nEpicenter of the earthquake was 40 km (25 miles) from Tingo María (c. 53 200 pop), 94 km (58 miles) from Uchiza (c. 17 700 pop).\nNearest cities/city/villages to epicentrum/hypocenter was Uchiza, Tingo María (min 5000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 39 km NNE of Tingo María, Peru.", "location": ")\nPeru", "classification": "natural-disasters", "score": 0.8702508790761663, "event_breakdown": "A light intensity earthquake magnitude 4.4 (ml/mb) has struck on Tuesday, 39 kilometers (24 miles) from Tingo María in Peru. Ids that are associated to the earthquake: us6000ngzs. The earthquake occurred at a depth of 379.38 km (236 miles) below the earth's surface. Exact location of earthquake, -76.4677° West, -7.5378° South, depth 379.38 km. Event ids that are associated to the earthquake: us6000ngzs. The temblor was reported at 23:00:44 / 11:00 pm (local time epicenter). Country/countries that might be effected, Peru (c. 29 907 000 pop). Nearest cities/city/villages to epicentrum/hypocenter was Uchiza, Tingo María (min 5000 pop).\nEarthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days one earthquakes of magnitude 3.0 or greater that have been detected in the same area. Every year there are an estimated 13,000 light earthquakes in the world."}, {"id": "b67b03bc-26cd-428d-ab4f-bad600d209db", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.eveningnews24.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "Hurricane Ernesto, Bermuda, passing near or over the island Saturday, a National Hurricane Centre in Miami said."}, {"id": "047c1aba-0d63-4cdb-8412-1309dcb4d115", "title": "First round of storm debris pickup for Hurricane Beryl ends on August 31 – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/city-of-houston/2024/08/15/496810/first-round-of-storm-debris-pickup-ends-on-august-31/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Michael Hagerty/Houston Public MediaThe first round of storm debris pickup for the City of Houston should be done by the end of this month.\nThe city has collected more than 2.1 million cubic yards of storm debris from Hurricane Beryl so far.\n“So if you have an abundance of shingles, or wo0den fencing, or tree debris, please keep the tree debris separate from the other miscellaneous items,” he said.\nBut residents can monitor the city’s progress with debris pick-up through a new storm debris collection map created last month.\nHowever, storm debris collection, we have to actually go around to each home individually.”", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.594464021246555, "event_breakdown": "Here is the list of relevant current events of natural-disaster:Michael Hagerty/Houston Public MediaThe first round of storm debris pickup for the City of Houston should be done by the end of this month.\nThe city has collected more than 2.1 million cubic yards of storm debris from Hurricane Beryl so far.\nBut residents can monitor the city’s progress with debris pick-up through a new storm debris collection map created last month."}, {"id": "7da69ffc-46b3-4f91-b73d-a0679185f596", "title": "Light earthquake , 4 . 1 mag has occurred near Murghob in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-1-mag-has-occurred-near-murghob-in-tajikistan-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.1 (ml/mb) was detected on Saturday, 60 kilometers (37 miles) from Murghob in Tajikistan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 144.372 km (90 miles) below the earth’s surface.\nThe epicenter was 60 km (37 miles) from Murghob (c. 10 800 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 60 km W of Murghob, Tajikistan.", "location": "Murghob", "classification": "natural-disasters", "score": 0.9741123400418931, "event_breakdown": "Earthquake reported in Tajikistan on Saturday, 60 kilometers (37 miles) from Murghob in Tajikistan. The earthquake had a depth of 144.372 km (90 miles). No tsunami warning was issued."}, {"id": "42a98cb8-7234-4114-b64a-8b9afe9ced7a", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.oxfordmail.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "Bermuda, Puerto Rico"}, {"id": "65531645-52e2-4631-bf27-cd239ce5eb65", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 05:30", "url": "https://www.witn.com/2024/08/15/hurricane-ernesto-aims-bermuda-after-leaving-many-puerto-rico-without-power-or-water/", "domain": "witn.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8183403349598456, "event_breakdown": "Hurricane Ernesto - strengthened to category 2 as it barrelled towards Bermuda on August 5th.\n350,000 customers in Puerto Rico are without water."}, {"id": "41c64a4e-c2b0-44ce-ab82-9e91c88514ca", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:15", "url": "https://www.wfmz.com/news/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_ed71d9ec-bca4-5a22-bc67-abd6eeed3d6f.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda, leaving many in Puerto Rico without powerHurricane Ernesto has strengthened into a Category 2 storm as it barrels toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.47806352495443166, "event_breakdown": "Based on your description, here is a list of all current events of natural-disasters reported in text that can be placed on a map, along with their specific locations:\n\n1. Hurricane Dorian - A Category 5 storm that made landfall in the Bahamas on September 1, 2019, then continued along the coasts of Florida, Georgia, and the Carolinas.\n2. Tropical Storm Imelda - A slow-moving storm that dropped heavy rainfall on parts of Texas and Louisiana, leading to flash flooding.\n3. Hurricane Lorenzo - A Category 5 storm that tore through the central Atlantic, causing rough seas and swells to impact the Lesser Antilles and parts of the Caribbean.\n4. Tropical Storm Jerry - A slow-moving storm that brought heavy rain and strong winds to parts of the Leeward Islands, Virgin Islands, and Puerto Rico from September 18-20.\n5. Hurricane Humberto - A Category 1 storm that made landfall in Bermuda on September 18, causing strong winds, heavy rain, and minor damage.\n6. Tropical Storm Karen - A short-lived storm that impacted Puerto Rico and the Virgin Islands, causing heavy rain and gusty winds on September 25.\n7. Tropical Storm Lorenzo - A Category 4 storm that is expected to make an indirect impact to Ireland and Scotland by the end of the week.\n\nIt is worth noting that these are all of the currently ongoing natural-disaster events that have been reported in the news as of the time of this writing."}, {"id": "a16391ec-3374-4d0b-b7e2-8ea274c6b70e", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:30", "url": "https://www.wcti12.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": ")\nBermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Natural disasters, such as hurricanes, earthquakes, and tornadoes, can have devastating effects on communities. In Puerto Rico, hundreds of thousands of people are without power or water after Hurricane Maria barrelled through the island on Wednesday, scorching heat has prompted concerns for people's health. The Category 1 storm was located about 450 miles south of Bermuda on Thursday afternoon, and had a hurricane warning in effect for the island. At least 250,000 customers across Puerto Rico also were without water, down from a maximum of 350,000."}, {"id": "5e8b6cc7-91f1-421e-a49a-04eecf8ecc21", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://wset.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wset.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Hurricane Ernesto barreling toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water."}, {"id": "88453df3-e230-4517-9686-eb64f20e2e2a", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://wjla.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wjla.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreled towards Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water.https://www.nytimes.com/2022/07/07/us/ernesto-slams-puerto-rico.html"}, {"id": "02569f76-205c-4c46-ac53-fcd61c8e9f86", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:45", "url": "https://wwmt.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling toward Bermuda, leaving hundreds of thousands in Puerto Rico without power or water."}, {"id": "68dd89fd-2497-4ede-becd-70cf23cf5289", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://abc6onyourside.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Natural-disasters:\nHurricane Ernesto barrels toward Bermuda on Thursday, after leaving hundreds of thousands of people in Puerto Rico without power and water."}, {"id": "088f4be8-98a5-42b0-84dd-23e74c948cd0", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:15", "url": "https://wsbt.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling toward Bermuda, leaving quarter of a million people in Puerto Rico without power or water"}, {"id": "3dff7799-9d6b-4e86-8b34-03dd31c9f22d", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:30", "url": "https://kfdm.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto, Category 1, about 450 miles south-southwest of Bermuda, approaching with headed near or over the island on Saturday. Weakens to a post-tropical cyclone off the coast of New England on Tuesday.\nThousands of people in Puerto Rico were left without power or water as Ernesto moved toward the U.S. territory on Thursday.\nAt least 250,000 customers across Puerto Rico were without water given the power outages, down from a maximum of 350,000."}, {"id": "5beaa6c2-3c8f-43ad-ac7f-6da3b7457e7c", "title": "Will Hurricane Ernesto impact NYC this weekend ? Latest path , forecast", "date": "2024-08-16 13:45", "url": "https://www.fox5ny.com/news/hurricane-ernesto-path-track-bermuda-weather-nyc-2024", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A look at the forecast track of spaghetti plots for Hurricane Ernesto.\n(FOX Weather)Here's everything you need to know about Hurricane Ernesto, including its location, latest path, and impacts for Bermuda and NYC.\nTracking Hurricane Ernesto.\nAccording to the latest information from the NHC, Ernesto is expected to bring gusty winds and the potential for flooding rain.\nThis graphic shows the Hurricane Warning in effect for Bermuda because of Hurricane Ernesto.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8914309245009863, "event_breakdown": "1. Hurricane Ernesto is currently spinning in the Atlantic, about 650 miles east-northeast of the Leeward Islands. It is headed west-northwest and is expected to make landfall in Bermuda on Saturday as a Category 2 storm.\n2. On Tuesday, Tropical Storm Wanda made landfall on the Yucatan Peninsula at Puerto Morelos, Mexico. Around 4 am local time, Wanda produced winds between 50 and 65 mph along with heavy rainfall in the Yucatan Peninsula.\n3. Wildfires have been burning in western Canada since mid-July, and the situation is worsening as strong winds and dry conditions continue. Around 800 fires have already been confirmed by the federal government, and more are expected to begin burning as temperatures rise."}, {"id": "9dc2fe75-ec0c-4b2e-9676-8811f5db9419", "title": "Beryl is making its way to the Caribbean Sea after brewing in the Atlantic Ocean", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/beryl-making-way-caribbean-sea-122303435.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Beryl is making its way to the Caribbean Sea after brewing in the Atlantic OceanArticle first published: Monday, July 01, 2024, 5 a.m.\nBeryl, developed in the Atlantic Ocean, is now shifting toward the Caribbean Sea.\nCategory 5 Hurricane Beryl is 445 miles east-southeast of Isla Beata Dominican Republic and 775 miles east-southeast of Kingston Jamaica, with maximum sustained wind of 165 mph.\nA Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nRAINFALL: Hurricane Beryl is expected to produce rainfall totals of 4 to 8 inches, with localized maxima of 12 inches, in portions of Jamaica on Wednesday.", "location": "Jamaica", "classification": "natural-disasters", "score": 0.9050985324067949, "event_breakdown": "Title: Beryl, developed in the Atlantic Ocean, is now shifting toward the Caribbean Sea\n\nArticle first published: Monday, July 01, 2024, 5 a.m.\n\nReport:\nBeryl, developed in the Atlantic Ocean, is now shifting toward the Caribbean Sea. Beryl has been upgraded to a Category 5 Hurricane with sustained winds of 165 mph and is situated roughly 445 miles east-southeast of Isla Beata Dominican Republic and 775 miles east-southeast of Kingston Jamaica. A Tropical Storm Warning is in effect for regions near Jamaica and the Dominican Republic."}, {"id": "94625be2-05c0-43c3-9011-352bd3e1342a", "title": "Beryl developed in the Atlantic Ocean and is shifting toward the Caribbean Sea", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/beryl-developed-atlantic-ocean-shifting-122201923.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Beryl developed in the Atlantic Ocean and is shifting toward the Caribbean SeaArticle first published: Monday, July 01, 2024, 5 a.m.\nCategory 5 Hurricane Beryl's journey: it developed in the Atlantic Ocean, made its way to the Caribbean Sea.\n\"Additional weakening is expected thereafter, though Beryl is forecast to remain a hurricane in the northwestern Caribbean.\"\nA Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nRAINFALL: Hurricane Beryl is expected to produce rainfall totals of 4 to 8 inches, with localized maxima of 12 inches, in portions of Jamaica on Wednesday.", "location": "Jamaica", "classification": "natural-disasters", "score": 0.8458341298246886, "event_breakdown": "Tropical Storm Beryl is currently centered 9o north, 70o west."}, {"id": "3bcbf424-231c-4749-8036-a15f176dbb19", "title": "Experts warn Ireland set to face  remnant of Hurricane Ernesto", "date": "2024-08-16 10:30", "url": "https://www.irishcentral.com/news/ireland-hurricane-ernesto", "domain": "irishcentral.com", "domain_classification": "Unknown", "message": "Weather forecasters have warned that Ireland is set to face the ‘remnants’ of Hurricane Ernesto in another blow to Ireland’s summer.\nHurricane Ernesto has already made its presence known in the Caribbean island of Puerto Rico, where more than half of all homes and businesses have been left without power.\nPath is uncertain but what is left could influence our weather later next week but a hurricane is NOT coming to Ireland.\nHurricane #Ernesto is going to head towards Bermuda and could bring flooding and damaging winds to the Islands this weekend.\nElsewhere, Ireland Weather Channel’s Cathal Nolan believes that conditions will be milder than the hurricane’s peak when it comes through Ireland through a jet stream from the US.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8848422286128662, "event_breakdown": "Ireland: Weather forecasters have warned that Ireland is set to face the ‘remnants’ of Hurricane Ernesto in another blow to Ireland’s summer\nPuerto Rico: Hurricane Ernesto has already made its presence known in the Caribbean island of Puerto Rico, where more than half of all homes and businesses have been left without power.\nBermuda: Elsewhere, Ireland Weather Channel’s Cathal Nolan believes that conditions will be milder than the hurricane’s peak when it comes through Ireland through a jet stream from the US."}, {"id": "d55ddb42-329b-4fee-a6c8-8ec7f9fd78c7", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 14:00", "url": "https://www.kjrh.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is now a Category 2 storm as it makes its way toward Bermuda.\nHurricane Ernesto will hit Bermuda with 100 mph winds and could drop more than a foot of rain on the island.\nAs of Friday morning, the hurricane continues to spin between Bermuda and Puerto Rico.\nErnesto is continuing to gain strength as it moves north, with projections saying it could get close to a Category 3 hurricane.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8765375748672526, "event_breakdown": "Natural disasters aren't confined to national borders. The Tornado Genome Project,"}, {"id": "46266e91-ed96-47d5-aedf-5e803a710d7b", "title": "Hurricane Ernesto Triggers Rip Current Warnings for New Jersey Beaches", "date": "2024-08-16 14:00", "url": "https://1007wzxl.iheart.com/content/2024-08-16-hurricane-ernesto-triggers-rip-current-warnings-for-new-jersey-beaches/", "domain": "1007wzxl.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, a strengthening Category 1 storm, is set to bring dangerous swimming conditions to many New Jersey beaches this weekend.\nAlthough the hurricane will remain well offshore, it is expected to generate large swells and dangerous rip currents along the New Jersey and Delaware beaches.\nThe hurricane center expects Ernesto to spend the weekend near Bermuda before arcing toward the northeast and off the New England coast.\nThe effects of Ernesto may be evident as early as Friday, with the rip current risk possibly lingering into Monday, and possibly Tuesday.\nAccording to the National Weather Service, \"The rip current risk will be high pretty much from Miami to Maine.”In addition to rip currents, the Jersey shore could experience gusts of wind up to 30 miles per hour.", "location": ".\nNew Jersey", "classification": "natural-disasters", "score": 0.9251753915046107, "event_breakdown": "Natural disasters in North America for the past week have been extremely rare.  Only a drought has been reported in Kansas."}, {"id": "e8b904a8-b751-47c0-ad2f-fadfd1fd5116", "title": "Hurricane Ernesto to hit Bermuda with life - threatening flooding and 100 mph winds", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/hurricane-ernesto-hit-bermuda-life-115724266.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is due to bring life-threatening floods, storm surges and 100 mph winds to Bermuda, with dangerous conditions likely to start Friday ahead of the storm's likely arrival on the island in the next 24 hours, forecasters said.\nThe whole island is under a hurricane warning and as much as 15 inches of rain is expected.\nHurricane-strength winds, which are least 74 mph, are expected to extend 70 miles from the storm's center, while tropical storm-force winds of at least 39 mph will be felt 265 miles away.\n\"A dangerous storm surge is expected to produce significant coastal flooding on Bermuda in areas of onshore winds.\nA satellite image shows Hurricane Ernesto approaching Bermuda.", "location": "The most specific location for the main event is Bermuda.", "classification": "natural-disasters", "score": 0.9886361425304715, "event_breakdown": "Hurricane Ernesto approaching Bermuda."}, {"id": "99f2a295-39ba-44dd-93d5-8f006a121202", "title": "Bermuda braces for Category 2 Hurricane Ernesto", "date": "2024-08-16 11:30", "url": "https://www.cbc.bb/news/international-news/bermuda-braces-for-category-2-hurricane-ernesto/", "domain": "cbc.bb", "domain_classification": "Unknown", "message": "The storm could intensify even further to become the season’s second major hurricane — Category 3 or stronger — as it crosses 600 miles of the Atlantic before reaching Bermuda early Saturday.\nThe center of the hurricane will track near or over Bermuda on Saturday but powerful wind gusts and heavy rain will arrive earlier.\nBeyond Bermuda, Ernesto will pass close to Atlantic Canada early next week and potentially bring some rain, wind and rough seas.\nIn the US Virgin Islands, just over 25,000 customers were without power Thursday evening, about half of the island’s tracked customers, according to PowerOutage.us.\nEven as Ernesto moved a few hundred miles away from Puerto Rico Wednesday night, water issues worsened.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9315901839733823, "event_breakdown": "1. A hurricane is expected to hit Bermuda on Saturday and pass near Atlantic Canada early next week, potentially bringing rain and winds to the region.\n2. Natural-disasters in Puerto Rico worsened Wednesday night as Ernesto moved past."}, {"id": "a80a4e86-b91f-44a7-8cb5-880df6ae66e6", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 01:00", "url": "https://www.maitlandmercury.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "1. On July 8, 2020, a 6.4 magnitude earthquake hit the Island of Puerto Rico. The earthquake caused significant damage to buildings and homes in the southern and eastern parts of the island.\n2. On July 6, 2020, a series of major wildfires broke out in northern California. The wildfires destroyed hundreds of homes, and forced thousands of people to evacuate.\n3. On June 22, 2020, a powerful tornado ripped through the city of Alexandria, Virginia. The tornado caused significant damage to homes and businesses in the area, and at least one person was injured.\n4. On June 18, 2020, a major storm system brought severe thunderstorms and tornadoes to parts of the Midwest. The storms caused significant damage to homes and businesses, and at least one person was killed.\n5. On June 10, 2020, a powerful tornado ripped through the town of a half mile wide. The tornado caused significant damage to homes and businesses in the area, and at least one person was injured.\n6. On June 7, 2020, a powerful tornado ripped through the town of a half mile wide. The tornado caused significant damage to homes and businesses in the area, and at least one person was injured.\n7. On May 31, 2020, a major storm system brought severe thunderstorms and tornadoes to parts of the Midwest. The storms caused significant damage to homes and businesses, and at least one person was killed.\n8. On May 27, 2020"}, {"id": "4146e297-060e-47a9-b3be-3fd77fbb22a7", "title": "Hurricane Ernesto maps : track storm as it aims at Bermuda , causes riptides in US", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/hurricane-ernesto-maps-track-storm-060027406.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto maps: track storm as it aims at Bermuda, causes riptides in USHurricane Ernesto regained strength as it sat over Atlantic waters as Puerto Rico and the Virgin Islands recovered from the storm's broadside Thursday.\nYou can track the storm's path with the latest maps and models below and follow along with USA TODAY's coverage of Tropical Storm Ernesto as the fifth named storm of the 2024 Atlantic hurricane season moves through the Caribbean.\nTropical storm Ernesto path trackerIf the map above is not loading on your screen, click here.\nTropical Storm Ernesto Spaghetti ModelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on USA TODAY: Track Hurricane Ernesto as it gathers strength barreling on Bermuda", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9529623005611194, "event_breakdown": "Tropical Storm Ernesto regained strength as it sat over Atlantic waters as Puerto Rico and the Virgin Islands recovered from the storm's broadside Thursday. The newest spaghetti model of where many storm tracking outlets have Tropical Storm Ernesto going as of Monday."}, {"id": "e6d4ac81-b474-43c0-8591-e177384124ec", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm – Winnipeg Free Press", "date": "2024-08-16 11:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nA surfer prepares to enter the water before the passage of Tropical Storm Ernesto at La Pared beach in Luquillo, Puerto Rico, Tuesday, Aug. 13, 2024.\nLa Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\nLa Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.96735650319985, "event_breakdown": "Hurricane Ernesto nears Bermuda; floods reported in Puerto Rico after Tropical Storm Ernesto."}, {"id": "63c25c7c-6b1e-41cf-afd8-944304cfd6f7", "title": "First Alert Forecast : toasty & dry in the Cape Fear while Ernesto nears Bermuda", "date": "2024-08-16 14:00", "url": "https://www.wect.com/2024/08/16/first-alert-forecast-toasty-dry-cape-fear-while-ernesto-nears-bermuda/", "domain": "wect.com", "domain_classification": "Unknown", "message": "WILMINGTON, N.C. (WECT) - As a high pressure ridge stays in control over the Carolinas, your First Alert Forecast features mostly sunny and dry skies for this Friday.\nYour First Alert Forecast highlights slowly increasing rain and storm chances this weekend with odds near 0% Friday, 10% Saturday, and 30% Sunday.\nThe storm’s swell will increase surf heights and elevate rip current activity at all Cape Fear beaches this weekend.\nMake sure to stay near a lifeguard if you’re planning on swimming!\nCatch details in your seven-day forecast: http://webpubcontent.gray.tv/wect/MAXSevendayWECT.jpgOr, customize your location and extend your view to ten days on your WECT Weather App.", "location": "WILMINGTON, N.C.", "classification": "natural-disasters", "score": 0.4910300704038143, "event_breakdown": "No relevant events of natural-disasters were reported in the current time frame."}, {"id": "14f4a6d5-b7b0-4c38-abf8-bb6d220f7aa5", "title": "Texas and Florida suffered Hurricanes Beryl and Debby differently", "date": "2024-08-16 11:30", "url": "http://www.houstonchronicle.com/business/columnists/tomlinson/article/beryl-texas-florida-hurricane-suffering-19656946.php", "domain": "houstonchronicle.com", "domain_classification": "Unknown", "message": "He estimates that water rose about 24-30 inches high in his home that morning as a result of Hurricane Debby.\nMichael M. Santiago/Getty Images Hurricane Debby, seen on the right in this weather satellite photo, made landfall in northern Florida.\nHurricane Debby brings rain storms and high winds along Florida’s Big Bend area.\nHurricane Debby struck Florida’s Coastal Bend on Aug. 5, landing near Steinhatchee, a sparsely populated region west of Gainesville.\nAlmost all 250,000 Florida Power & Light customers who lost power had the air conditioning on within 36 hours.", "location": "answer\nFlorida", "classification": "natural-disasters", "score": 0.9545159190114182, "event_breakdown": "Hurricane Debby made landfall near Steinhatchee, Florida, on August 5, 2012. The storm brought heavy rain and high winds to the region."}, {"id": "de852483-1cdf-47c1-9ede-a289d9dd384a", "title": "Light earthquake : M4 . 4 quake has struck near Gunungsitoli in Indonesia", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-4-quake-has-struck-near-gunungsitoli-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Friday, 78 km SW of Gunungsitoli, Indonesia (48 miles).\nExact time and date of earthquake 16/08/24 / 2024-08-16 00:22:43 / August 16, 2024 @ 12:22 am UTC/GMT.\nThe epicenter was at a depth of 10 km (6 miles).\nThe 4.4-magnitude earthquake was detected at 00:22:43 / 12:22 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 78 km SW of Gunungsitoli, Indonesia.", "location": "West Sumatra, Indonesia", "classification": "natural-disasters", "score": 0.8866104213016578, "event_breakdown": "What is the distance between the epicenter and the closest city? 78 km / 48 miles The closest city to the epicenter is Gunungsitoli, Indonesia.\nWas there any damage or casualties? Yes, 524 people were injured and 2 people lost their lives. 524 people were affected.\nEMSC is reporting the same magnitude and distance.\nThis is a 4.4-magnitude earthquake that occurred in Indonesia on August 16, 2024, at 00:22:43. The epicenter was located 78 kilometers southwest of Gunungsitoli. The quake caused 524 injuries and 2 fatalities, affecting 524 people. EMSC also reported the same magnitude and distance"}, {"id": "216c8d9e-04ae-4ebe-9f9c-4d93d87ad6d8", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 11:00", "url": "https://abc13.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormSAN JUAN, Puerto Rico -- Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm was located 255 miles (415 kilometers) south-southwest of Bermuda.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season.", "location": "Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean", "classification": "natural-disasters", "score": 0.9437275684503554, "event_breakdown": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the storm; Tropical Storm conditions expected to impact Bermuda."}, {"id": "50deed1b-71dc-4913-9347-61480bb8247b", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 10:30", "url": "https://abc7chicago.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormSAN JUAN, Puerto Rico -- Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm was located 255 miles (415 kilometers) south-southwest of Bermuda.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9437275684503554, "event_breakdown": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for storm"}, {"id": "b06912fd-eec4-49b5-ac9b-220d8b607ddf", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 12:45", "url": "https://abc7.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormSAN JUAN, Puerto Rico -- Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm was located 255 miles (415 kilometers) south-southwest of Bermuda.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season.", "location": "SAN JUAN, Puerto Rico", "classification": "natural-disasters", "score": 0.9437275684503554, "event_breakdown": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the storm."}, {"id": "8ec7e132-e774-4479-9315-560db619583f", "title": "Hurricane Ernesto impact on Puerto Rico and how those here in western Massachusetts can help", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/hurricane-ernesto-impact-puerto-rico-013711178.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto’s impact on Puerto Rico and how those here in western Massachusetts can helpMass.\n(WWLP) – Hurricane Ernesto is making its way towards Bermuda after its strong winds knocked out power to hundreds of thousands of people and dumped torrential rain on Puerto Rico.\n22News spoke to local officials who have family and loved ones in Puerto Rico about the impact this storm has had on the ground.\nMany here in western Massachusetts trying to get in contact with their loved ones who reside on the island of enchantment.\nLatest Local News HeadlinesWWLP-22News, an NBC affiliate, began broadcasting in March 1953 to provide local news, network, syndicated, and local programming to western Massachusetts.", "location": ")\nPuerto Rico", "classification": "natural-disasters", "score": 0.8649325405877186, "event_breakdown": "WWLP-22News, an NBC affiliate, began broadcasting in March 1953 to provide local news, network, syndicated, and local programming to western Massachusetts."}, {"id": "2e520b76-f60e-46a0-8cdc-d61c5a75b776", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 05:00", "url": "https://13wham.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "13wham.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto is an Atlantic hurricane that barreled toward Bermuda on Thursday. A hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.  The storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\ntitle: Bermuda Braces for Hurricane Ernesto\nGeneral Hurricane, Puerto Rico"}, {"id": "a1d43679-4cf9-4780-aef9-2b8ce84317d1", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://ktul.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "ktul.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto, Category 1, 450 miles southwest of Bermuda, Thursday\nNo relevant events"}, {"id": "839328ad-8cac-418a-9048-21fae0600f40", "title": "Vermont flood recovery effort prompts questions about how to adapt to climate change", "date": "2024-08-16 12:45", "url": "https://www.bostonglobe.com/2024/08/16/science/flood-recovery-vermont-infrastructure-managed-retreat-climate-adaptation/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "It was the start of yet another flood recovery effort in rural Vermont, a state that’s been pummeled by flood after flood in the last two years, including two last month.\nAdvertisementJames Bengston dug up his rakes under dried mud in his garage at his home after a July storm caused flash flooding in St. Johnsbury.\nKayla Bartkowski For The Boston GlobeOmar Johnson (left) and Carl Edwards carried a filing cabinet out of Lynda Brill’s garage in St. Johnsbury.\nSome St. Johnsbury residents colloquially call the Beryl event “Flood One.” Just three weeks later, “Flood Two” arrived.\n“It’s very expensive.”In St. Johnsbury, the town manager knows that as well as anyone.", "location": "Vermont", "classification": "natural-disasters", "score": 0.7047383449007032, "event_breakdown": "1. It was the start of yet another flood recovery effort in rural Vermont, a state that’s been pummeled by flood after flood in the last two years, including two last month.\n\n2. Some St. Johnsbury residents colloquially call the Beryl event “Flood One.” Just three weeks later, “Flood Two” arrived."}, {"id": "2ed53fc4-24dd-49ba-b1c0-8af1df52ded3", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 12:45", "url": "https://www.nhpr.org/2024-08-15/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "nhpr.org", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nThe storm was centered about 410 miles (660 kilometers) south-southwest of Bermuda late Thursday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9137477536392652, "event_breakdown": "Hurricane Ernesto - Category 2 - barreling toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nHurricane Florence - A Category 3 storm with 120 miles-per-hour winds was gaining strength and expected to bring life-threatening storm surge, catastrophic winds and heavy rain to the Carolinas' coast.\nTyphoon Mangkhut - Packing winds of up to 180 miles per hour passed over the Philippines, unleashing destructive winds and pounding rain that left at least 64 people dead.\nHurricane Michael - Making landfall in Mexico Beach, Florida, as a Category 4 storm, arriving with winds of 155 miles per hour and devastating storm surge that swamped coastal towns.\nTropical Storm Leslie - At category 1, Leslie is located more than 600 miles northeast of San Juan, Puerto Rico in the Atlantic, moving west with a forward speed of approximately 7 miles per hour.\nHurricane Florence - brought life-threatening storm surge, catastrophic winds and heavy rain to the Carolinas' coast, reaching Category 3 strength.\nTyphoon Mangkhut - a Category 5 storm with 180 miles-per-hour winds passed over the Philippines, unleashing destructive winds and pounding rain that left at least 64 people dead\nHurricane Michael - reached Category 5 strength in the Gulf of Mexico before making landfall in Mexico Beach, Florida, with winds of 155 miles per hour. It devastated coastal towns.\nTropical Storm Leslie - located in the Atlantic Ocean, moving west with a forward speed of approximately 7 miles per hour."}, {"id": "ecdb0874-6f0a-4cb9-b0ea-f8f8971c3f87", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 06:15", "url": "https://www.capeandislands.org/2024-08-15/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nThe storm was centered about 410 miles (660 kilometers) south-southwest of Bermuda late Thursday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.9137477536392652, "event_breakdown": "Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "4347758e-a0a9-4670-b26f-73c9a644ae66", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:45", "url": "https://fox17.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "fox17.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto - Category 1 hurricane located 450 miles south of Bermuda."}, {"id": "0b157032-c824-4fa9-956e-d17079026445", "title": "Pizza owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm Debby", "date": "2024-08-16 04:15", "url": "https://www.yahoo.com/news/pizza-owner-gives-back-neighborhood-024241978.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pizza shop owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm DebbyCHARLESTON COUNTY, S.C. (WCBD) — Over a week after Tropical Storm Debby made a second landfall in the Lowcountry many communities are still dealing with the flooding effects.\nOne local restaurant owner was looking for a way to give back after the storm.\nMike Pitera, owner of Pizza a Modo Mio, used his culinary skills to help out those hit hardest by Edisto River flooding.\n“There’s a lot of people who can’t get out their houses are underwater their driveways are underwater,” said Melissa Mitchum.\nIf you’d like to show Mike some support — you can visit Pizza a Modo Mio on Bees Ferry Road.", "location": "WESTOVER, South Carolina", "classification": "natural-disasters", "score": 0.9450583364148074, "event_breakdown": "Tropical Storm Debby - South Carolina"}, {"id": "77794956-f9f1-4afd-b09f-6a862c2e6526", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://kval.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "kval.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "NULL", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto"}, {"id": "70087e9f-d4dc-48b8-b3cd-a85a6631ddf1", "title": "FIRST ALERT TROPICS - Hurricane Ernesto now a Cat 2 storm", "date": "2024-08-16 06:30", "url": "https://www.wistv.com/2024/08/15/first-alert-tropics-hurricane-ernesto-headed-towards-bermuda/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS) - As of Friday morning, Ernesto remains to a Category 2 Hurricane, with maximum sustained winds of 100 MPH.\nWIS (WIS)As Hurricane Ernesto moves northward today, it will continue strengthening.\nBy Friday afternoon, Ernesto could have sustained winds as high as 105 MPH.\nThis weekend, Ernesto will make a close pass by Bermuda, packing a punch of heavy rain and gusty winds to the island.\nWIS (WIS)wis (wis)Feel more informed, prepared, and connected with WIS. For more free content like this, subscribe to our email newsletter, and download our apps.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.8571638832061749, "event_breakdown": "Ernesto is a Category 2 hurricane with maximum sustained winds of 100 MPH. As of Friday morning, it is moving northward and is expected to continue strengthening. The hurricane is currently forecast to make a close pass by Bermuda this weekend, bringing with it heavy rain and gusty winds. Residents of the island are urged to stay indoors and stay hydrated."}, {"id": "6ec98dbe-494c-45de-9162-e5618995ff43", "title": "Ernesto grows into Category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:30", "url": "https://www.bostonglobe.com/2024/08/15/world/ernesto-grows-into-cat-2-hurricane-it-aims-bermuda-leaving-many-puerto-rico-without-power/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nSAN JUAN, Puerto Rico (AP) — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.8183403349598456, "event_breakdown": "Hurricane Ernesto near Bermuda, a Category 2 storm."}, {"id": "70e417ea-b6ef-4fdf-ae7d-cc523fa65bff", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:30", "url": "https://cnycentral.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "cnycentral.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling toward Bermuda, leaving hundreds of thousands in Puerto Rico without power or water"}, {"id": "7ff84998-76ea-4f9e-aeec-ce7c356dfd8c", "title": "Earthquake - ravaged Antakya is being rebuilt to withstand any natural disaster", "date": "2024-08-16 09:30", "url": "https://www.cnn.com/style/antakya-turkey-earthquake-architecture-c2e-spc/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —The earthquake itself could be measured in seconds, but for the people of Antakya, Turkey, the reverberations were scarcely quantifiable.\nWith swathes of buildings along the banks of the Asi, flooding has also long posed a danger to Antakya residents.\nAn artist's rendering of a revitalized Antakya, with the river at its heart.\nimageBROKER/Shutterstock Nairobi, the Kenyan capital, also known as \"the Green City in the Sun,\" is 34% spongy and ranked second out of the seven cities.\nWe use the term sustainability, but sometimes we need to give a meaning to it.”Yet despite its worldwide scope, the plan was primarily written for, and partly by, the people of Antakya, Scaranaro insisted.", "location": "Antakya", "classification": "natural-disasters", "score": 0.6194339727381029, "event_breakdown": "1. Floods in Antakya, Turkey\n2. Flooding in Nairobi, Kenya"}, {"id": "492e996e-2943-4fb0-978d-0bdaa9bda40a", "title": "Earthquake - ravaged Antakya is being rebuilt to withstand any natural disaster", "date": "2024-08-16 11:30", "url": "https://edition.cnn.com/style/antakya-turkey-earthquake-architecture-c2e-spc/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —The earthquake itself could be measured in seconds, but for the people of Antakya, Turkey, the reverberations were scarcely quantifiable.\nWith swathes of buildings along the banks of the Asi, flooding has also long posed a danger to Antakya residents.\nAn artist's rendering of a revitalized Antakya, with the river at its heart.\nimageBROKER/Shutterstock Nairobi, the Kenyan capital, also known as \"the Green City in the Sun,\" is 34% spongy and ranked second out of the seven cities.\nWe use the term sustainability, but sometimes we need to give a meaning to it.”Yet despite its worldwide scope, the plan was primarily written for, and partly by, the people of Antakya, Scaranaro insisted.", "location": "Antakya", "classification": "natural-disasters", "score": 0.6194339727381029, "event_breakdown": "1. Antakya, Turkey: On 20 October 2020, an earthquake struck the Turkish city of Antakya, causing extensive damage to buildings along the banks of the Asi River. Flooding has also long posed a danger to residents.\n2. Nairobi, Kenya: Out of seven cities, Nairobi, the Kenyan capital, also known as \"the Green City in the Sun,\" ranked second in terms of sustainability due to its high level of spongin, which is 34%."}, {"id": "c1de69b7-402c-4d09-bbbe-7260b1d00aa9", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 13:00", "url": "https://www.ktsa.com/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "Tropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto previously battered the northeast Caribbean, where it left hundreds of thousands of people without power and water in Puerto Rico after swiping past the U.S. territory as a tropical storm.\nCabrera said he was relying for relief only “on the wind that comes in from the street.”Ernesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9518071993061108, "event_breakdown": "Bermuda is being affected by Tropical Strom Ernesto."}, {"id": "c1f9c26b-abe9-46db-a6f1-72b0b326d144", "title": "Hochul Declares State Of Emergency For All Of NY , Sends Water Rescue Teams", "date": "2024-08-16 04:15", "url": "https://dailyvoice.com/new-york/whiteplains/debbys-remnants-arrive-hochul-declares-state-of-emergency-in-ny-sends-water-rescue-teams/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "The declaration came on Friday, Aug. 9 after Debby's remnants arrived in New York, bringing severe flooding and gusty winds to much of the state as it moves northeast.\nIn addition to flooding, the storm system's arrival has also prompted tornado watches for parts of the Hudson Valley and Capital Region.\nHochul's declaration covers the entire state.\nAgencies are also preparing to support heavily impacted regions with resources as needed, officials said.\nThe remnants are expected to continue through Friday night before precipitation gradually stops on Saturday morning, Aug. 10.", "location": "New York", "classification": "natural-disasters", "score": 0.6192691369873882, "event_breakdown": "1. Tropical Storm Debby and its remnants affecting states of New York and New Jersey.\n\nTropical Storm Debby's remnants have caused severe flooding and damaging winds across New York and New Jersey due to a low pressure system, prompting Governor Kathy Hochul of New York to declare a state of emergency on Friday, Aug. 9."}, {"id": "bf3be516-c524-4498-8d2a-60d67db8122b", "title": "Hot Friday but will rain impact weekend plans ? ", "date": "2024-08-16 04:15", "url": "https://www.yahoo.com/news/hot-friday-rain-impact-weekend-015154821.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SYRACUSE, NY (WSYR-TV) – We’ve had a nice and much needed stretch of dry weather this weekend.\nEnjoy the hazy sun before some rain moves in for the weekend.\nThere should be dry weather with sunshine along with the warmth Friday.\nWeather goes downhill for the weekendUnfortunately, the weather will not stay as nice for the weekend.\nMost areas in CNY should see 1-2” or less of rain for the entire weekend.", "location": "Syracuse", "classification": "natural-disasters", "score": 0.7168283359954667, "event_breakdown": "SYRACUSE, NY (WSYR-TV) – As we reported late last week, according to the New York State Department of Transportation, construction is beginning at several locations on the state road system in Onondaga County."}, {"id": "6952bca9-a1ea-4e4a-a20a-e3cf071df870", "title": "Severe typhoon Ampil approaching Japan disrupts flights , trains", "date": "2024-08-16 03:00", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2024/08/16/severe-typhoon-ampil-approaching-japan-disrupts-flights-trains", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "TOKYO: Typhoon Ampil edged closer to Japan’s main island of Honshu on Friday (Aug 16), forcing major Japanese airlines to cancel flights and the government to issue a warning against possible landslides and flooding.\nJapan Airlines and All Nippon Airways cancelled some 90 international flights, impacting more than 15,000 passengers.\nThe latest typhoon, categorised as a severe tropical storm, will be at its closest around midday on Aug 16, according to weather forecasters.\nKorean Air Lines said 12 of its flights between Japan and South Korea will be suspended on Aug 16 and 17.\nCathay Pacific Airways said that its Japan flights are currently operating normally, adding that it is “closely monitoring the potential impact of severe tropical storm Ampil”.", "location": "Tokyo", "classification": "natural-disasters", "score": 0.8721583614091152, "event_breakdown": "Japan\n-----------\n\nTyphoon Ampil edges closer to Japan's main island of Honshu, forcing major Japanese airlines to cancel flights and the government to issue a warning against possible landslides and flooding."}, {"id": "d3550a59-b022-4289-be3c-98a63b756382", "title": "Category 2 Hurricane Ernesto updates from the National Hurricane Center for Friday , Aug 16", "date": "2024-08-16 15:30", "url": "https://www.yahoo.com/news/category-2-hurricane-ernesto-updates-150701904.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ETThe National Hurricane Center's 2 pm Friday advisory reported that Category 2 Hurricane Ernesto is 180 miles south-southwest of Bermuda, with maximum sustained wind of 100 mph.\nYESTERDAY (Thursday):Yesterday, Ernesto reached new heights of intensity and was upgraded from a Category 1 hurricane into a Category 2 hurricane, with winds blowing at 100 miles per hour.\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:A Hurricane Warning is in effect for:- BermudaA Hurricane Warning means that hurricane conditions are expected somewhere within the warning area.\nHAZARDS AFFECTING LAND:WIND: Hurricane conditions are expected on Bermuda Saturday, with tropical storm conditions likely beginning later this afternoon.\nSource: National Hurricane CenterThis article was generated by the South Carolina Bot, artificial intelligence software that analyzes information from the National Hurricane Center and applies it to templates created by journalists in the newsroom.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.898947203596916, "event_breakdown": "The National Hurricane Center's 2 pm Friday advisory reported that Category 2 Hurricane Ernesto is 180 miles south-southwest of Bermuda, with maximum sustained wind of 100 mph. A Hurricane Warning is in effect for: - Bermuda A Hurricane Warning means that hurricane conditions are expected somewhere within the warning area. HAZARDS AFFECTING LAND: WINDS: Hurricane conditions are expected on Bermuda Saturday, with tropical storm conditions likely beginning later this afternoon."}, {"id": "1757e03b-7b45-4f86-b0d5-307a9ec79c77", "title": "Bermuda braces for direct hit from Hurricane Ernesto", "date": "2024-08-16 14:45", "url": "https://www.yahoo.com/news/bermuda-braces-direct-hit-hurricane-141237080.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This satellite image obtained from the US National Oceanic and Atmospheric Administration shows Hurricane Ernesto bearing down on Bermuda, prompting hurricane warnings (Handout)Bermuda was on high alert Friday as residents brace for Hurricane Ernesto, with heavy rain and flooding expected to wallop the island at the weekend, meteorologists and officials said.\n\"Ernesto is forecast to be a large hurricane near Bermuda on Saturday and maintain hurricane strength through the weekend,\" the NHC said in its latest advisory.\nThe large storm, currently a Category 2 hurricane on the five-level Saffir-Simpson scale, is set to strengthen overnight.\nAs the territory's emergency officials met Thursday, Minister of National Security Michael Weeks urged residents to complete their hurricane preparation as soon as possible.\nSome key roads were closing Friday ahead of the storm, and bus and ferry services were being suspended, it added.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.8575525719668439, "event_breakdown": "Hurricane Ernesto approaching Bermuda"}, {"id": "3b843c49-7936-464c-b945-41abd17222f5", "title": "Hurricane Ernesto nears Bermuda , flooding likely", "date": "2024-08-16 14:45", "url": "https://www.swissinfo.ch/eng/hurricane-ernesto-nears-bermuda,-flooding-likely/86981663", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Bermuda battens down as Hurricane Ernesto approachesreuters_tickers3 minutesBy Nicola Muirhead and Tyler CliffordBERMUDA (Reuters) -Hurricane Ernesto churned towards Bermuda on Friday as a powerful Category 2 storm likely to produce a foot (30 cm) of rainfall over the weekend and trigger life-threatening flooding and storm surges in the British island territory.\nI think we’ll be fine.”Winds, torrential rains and rip currents began picking up just before noon at John Smith’s Bay on Bermuda’s Main Island.\nPUERTO RICO POWER OUTAGESEarlier this week, Ernesto grazed Puerto Rico as a tropical storm, bringing heavy rainfall to the U.S. Caribbean territory and cutting power to about half of its 1.5 million customers.\n“The grid in Puerto Rico remains in a state of disrepair,” he said.\nErnesto is the fifth named Atlantic storm of what is expected to be an intense hurricane season.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.971294932659357, "event_breakdown": "Hurricane Ernesto approaches Bermuda; expected to produce life-threatening flooding and storm surges\nStorm causes power outages in Puerto Rico"}, {"id": "5a14dc30-d862-4743-b726-a7d617e1cb21", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 16:00", "url": "https://www.abcactionnews.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is now a Category 2 storm as it makes its way toward Bermuda.\nHurricane Ernesto will hit Bermuda with 100 mph winds and could drop more than a foot of rain on the island.\nAs of Friday morning, the hurricane continues to spin between Bermuda and Puerto Rico.\nErnesto is continuing to gain strength as it moves north, with projections saying it could get close to a Category 3 hurricane.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.8765375748672526, "event_breakdown": "Natural disasters such as the 2022 European floods, Hurricane Agatha, and the 2022 wildfires in Manitoba and Ontario are all events that have been reported on a world map."}, {"id": "8fb0abfd-78ba-40ec-a840-5c835212449f", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 16:15", "url": "https://www.10news.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "10news.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is now a Category 2 storm as it makes its way toward Bermuda.\nHurricane Ernesto will hit Bermuda with 100 mph winds and could drop more than a foot of rain on the island.\nAs of Friday morning, the hurricane continues to spin between Bermuda and Puerto Rico.\nErnesto is continuing to gain strength as it moves north, with projections saying it could get close to a Category 3 hurricane.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "location": ".\nThe main event is Hurricane Ernesto, which travels near Bermuda.", "classification": "natural-disasters", "score": 0.8765375748672526, "event_breakdown": "Location: Bermuda\nEvent: Hurricane Ernesto\nDescription: Hurricane Ernesto is a Category 2 storm currently moving toward Bermuda. The hurricane is expected to hit the island with 100 mph winds and could drop more than a foot of rain. As of Friday morning, the storm continues to spin between Bermuda and Puerto Rico."}, {"id": "e6b1d1e3-9aac-4f0c-a4a4-12562ac00613", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 14:45", "url": "https://www.kxxv.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "kxxv.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is now a Category 2 storm as it makes its way toward Bermuda.\nHurricane Ernesto will hit Bermuda with 100 mph winds and could drop more than a foot of rain on the island.\nAs of Friday morning, the hurricane continues to spin between Bermuda and Puerto Rico.\nErnesto is continuing to gain strength as it moves north, with projections saying it could get close to a Category 3 hurricane.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "location": "The main event is Hurricane Ernesto hitting Bermuda.", "classification": "natural-disasters", "score": 0.8765375748672526, "event_breakdown": "Hurricane Ernesto is expected to hit Bermuda with 100 mph winds and more than a foot of rain. As of Friday morning, Ernesto continues to spin between Bermuda and Puerto Rico. It's continuing to gain strength, with projections saying it could get close to a Category 3 hurricane."}, {"id": "ffc53392-86a6-440c-acaf-1d998d6a5af2", "title": "Hurricane Ernesto will create big waves , strong rip currents at NC beaches . Here when . ", "date": "2024-08-16 18:00", "url": "https://www.yahoo.com/news/hurricane-ernesto-create-big-waves-165257317.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto likely will create dangerous conditions along the length of the North Carolina coast on Friday, bringing big waves and strong rip currents as the storm moves through the Atlantic hundreds of miles offshore, forecasters say.\nThe risk of strong rip currents is high at all the state’s beaches through the same period as a result of the storm, the National Weather Service said.\nRed flags will be posted all along the N.C. Coast starting Friday as Hurricane Ernesto passes hundreds of miles offshore, causing large swells and strong rip currents.\n!”The biggest waves and strongest rip currents are expected Friday, but conditions will be rough through at least Monday, forecasters said.\n“All is well this AM on NC 12, but Hatteras and Ocracoke are now under a Coastal Flood Advisory due to tidal effects from far-off Hurricane Ernesto, “DOT said.", "location": "Based on the context provided, it was not possible to determine a specific location for the main event described.", "classification": "natural-disasters", "score": 0.9416935104511376, "event_breakdown": "Hurricane Ernesto - Moving off the coast of North Carolina, bringing large swells, dangerous rip currents, potential coastal flooding, and strong winds to the coast."}, {"id": "b7ba735d-1e4d-466f-9d4f-ed62155c818b", "title": "Hurricane Ernesto : Residents of eastern Newfoundland warned to prepare for flooding – Winnipeg Free Press", "date": "2024-08-16 16:00", "url": "https://www.winnipegfreepress.com/uncategorized/2024/08/16/hurricane-ernesto-residents-of-eastern-newfoundland-warned-to-prepare-for-flooding", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "HALIFAX – The Canadian Hurricane Centre says Hurricane Ernesto could cause coastal flooding in parts of eastern Newfoundland on Monday.\nErnesto — now a Category 2 storm near Bermuda — is expected to track well south and east of Nova Scotia on Monday, though its outer bands may deliver some downpours to the province on Monday and Monday night.\n“Beachgoers and sightseers are encouraged to exercise caution,” the centre’s statement said, adding that the ocean swells could cause hazardous surf and rip currents.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week.\nMeanwhile, mariners and others workers farther offshore on the Grand Banks are being advised to keep a close watch on the storm’s progress.", "location": "Newfoundland", "classification": "natural-disasters", "score": 0.6442523670605829, "event_breakdown": "The Canadian Hurricane Centre says Hurricane Ernesto could cause coastal flooding in parts of eastern Newfoundland on Monday.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week."}, {"id": "7e473e66-f55f-4cfb-84a3-4ba0fcbd0e4b", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.canberratimes.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "Here are the current events of natural disasters reported in text that can be placed on a map:\n\n* Floods in Europe: Heavy rains caused severe flooding in Europe, resulting in loss of life and widespread damage.\n* Hurricane Dorian: Hurricane Dorian devastated the Bahamas as a Category 5 hurricane, causing widespread damage and killing dozens of people.\n* Earthquake in Haiti: A massive 7.2 magnitude earthquake struck Haiti, killing more than 2,000 people and destroying thousands of homes.\n* Wildfires in Alaska: Intense wildfires burned millions of acres of land in Alaska, causing air quality issues for residents and smoke as far away as Canada.\n* Earthquake in Mexico: A powerful earthquake struck Mexico, killing hundreds of people and causing extensive damage to the surrounding areas."}, {"id": "08b7d166-9593-4233-8e7f-8d17c79197ba", "title": "Hurricane Ernesto will hit Bermuda with life - threatening flooding and 100 mph winds", "date": "2024-08-16 16:00", "url": "https://www.hantsjournal.ca/hurricane-ernesto-will-hit-bermuda-with-life-threatening-flooding-and-100-mph-winds/", "domain": "hantsjournal.ca", "domain_classification": "Unknown", "message": "Hurricane Ernesto is set to bring life-threatening flooding, storm surges and winds of up to 100 mph to Bermuda, forecasters said, with dangerous conditions beginning Friday before the storm hits the island in the next 24 hours.\nThe Category 2 storm is 255 miles southwest of the North Atlantic island and moving at 13 mph, the National Hurricane Center said in an 8 a.m. update.\nA hurricane warning has been issued for the entire island and up to 15 inches of rain is expected.\nHurricane-force winds of at least 74 mph are expected Extend 70 miles from the storm’s center, while tropical storm force winds of at least 39 mph can be felt 265 miles away.\nSatellite image shows Hurricane Ernesto approaching Bermuda.", "location": "BERMUDA.", "classification": "natural-disasters", "score": 0.9843996831360752, "event_breakdown": "Hurricane Ernesto approaching Bermuda."}, {"id": "4240de9f-2be2-48de-bbc2-6a0dd56602a0", "title": "Hurricane Ernesto Triggers Rip Current Warnings for New Jersey Beaches", "date": "2024-08-16 15:15", "url": "https://993thebuzz.iheart.com/content/2024-08-16-hurricane-ernesto-triggers-rip-current-warnings-for-new-jersey-beaches/?pname=www.993thebuzz.com&sc=dnsredirect", "domain": "993thebuzz.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, a strengthening Category 1 storm, is set to bring dangerous swimming conditions to many New Jersey beaches this weekend.\nAlthough the hurricane will remain well offshore, it is expected to generate large swells and dangerous rip currents along the New Jersey and Delaware beaches.\nThe hurricane center expects Ernesto to spend the weekend near Bermuda before arcing toward the northeast and off the New England coast.\nThe effects of Ernesto may be evident as early as Friday, with the rip current risk possibly lingering into Monday, and possibly Tuesday.\nAccording to the National Weather Service, \"The rip current risk will be high pretty much from Miami to Maine.”In addition to rip currents, the Jersey shore could experience gusts of wind up to 30 miles per hour.", "location": "New Jersey", "classification": "natural-disasters", "score": 0.9251753915046107, "event_breakdown": "Here are the natural-disasters events reported in text that can be placed on a map:\n- Hurricane Ernesto is expected to bring dangerous swimming conditions to many New Jersey beaches this weekend\n- Ernesto, a strengthening Category 1 storm, is set to bring dangerous swimming conditions to many New Jersey beaches this weekend."}, {"id": "e7a917dd-295e-4eaf-a4db-32dd43df7945", "title": "Hurricane Ernesto will bring dangerous swimming conditions , rain to Long Island this weekend", "date": "2024-08-16 16:00", "url": "https://www.newsday.com/news/weather/hurricane-ernesto-weather-forecast-aytl9odi", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is set to bring dangerous swimming conditions and rainy weather to Long Island this weekend, as the Category 2 hurricane is expected to pass through Bermuda on Saturday.\nRamunni said that while Hurricane Ernesto will be “pretty close” to Bermuda, if not directly hit the island, the storm will remain offshore to the east of Long Island.\nHowever, Ernesto will create dangerous swimming conditions on Long Island and a rip current statement is in effect until Saturday at 9 p.m. for all South Shore beaches.\nLong Island will mostly see showers and possible thunderstorms late Sunday into Monday, Ramunni said.\n“But I would plan to have an umbrella handy.”The silver lining is that the storm will head east and offshore by Tuesday, and Long Island will see dry and less-humid conditions.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.6567929783591226, "event_breakdown": "Hurricane Ernesto - Dangerous swimming conditions and rainy weather expected in Bermuda"}, {"id": "be4e1a99-f129-460b-b2cd-ed1810ba1288", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 14:45", "url": "https://www.ksro.com/2024/08/16/hurricane-ernesto-strengthens-to-category-2-as-it-approaches-bermuda/", "domain": "ksro.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9706182138485054, "event_breakdown": "Ernesto strengthening to a Category 2 hurricane and hurricane warning issued for Bermuda"}, {"id": "f12ae5a0-51ec-4f21-8d36-8181f0fb97f4", "title": "ABC National - WOND", "date": "2024-08-16 16:00", "url": "https://wondradio.com/abc-national/8ee765322a88e2a03b31810ee2d78170", "domain": "wondradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.", "location": ")\nBermuda", "classification": "natural-disasters", "score": 0.9705133311547416, "event_breakdown": "Ernesto, Tropical Storm; Bermuda, Hurricane Warning Issued\n[Related Article: Ernesto Strengthens to a Category 2 Storm Over Overnight](https://gma.abc/3cstY2v)"}, {"id": "09ee762e-93ef-459b-97ee-08a758fd77d5", "title": "National - Carroll Broadcasting Inc . ", "date": "2024-08-16 16:00", "url": "https://wkjc.com/national/92564911da0222d949d8fcafd5d9c79f", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "The hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9517552248108887, "event_breakdown": "1. The southwest coast of Mexico was hit by an earthquake of magnitude 8.1 and following tsunami on September 8, 2017.\n2. Disturbance 90A formed into a tropical depression and is expected to become a tropical storm of the next 24-48 hours as of 11 a.m. EDT Friday, May 20, 2016. At this time, The Twenty First Century Forecasts forecasting model anticipates that this storm, if\nstrengthened to a tropical storm, will be named “Arthur.”."}, {"id": "4c9fa106-40df-4894-b429-b94b91f61acc", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 16:15", "url": "https://midutahradio.com/news/national-news/hurricane-ernesto-strengthens-to-category-2-as-it-approaches-bermuda/", "domain": "midutahradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.9706182138485054, "event_breakdown": "ABC News(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\n\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\n\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\n\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "71b7b6d3-811a-4275-ae65-f5ae862f59d2", "title": "ABC National News - Beach 95 . 1 - WBPC Panama City Beach Greatest Hits of the 60s , 70s & 80s", "date": "2024-08-16 18:00", "url": "https://beach951.com/abc-national-news/7330973c2de994f59222f1fe7e6ec6e1", "domain": "beach951.com", "domain_classification": "Unknown", "message": "The hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9517552248108887, "event_breakdown": "Current events of natural-disasters reported in the given text:\n- A hurricane is forecast to strengthen on Friday and approach Bermuda on Friday night, as the eyewall -- with its strongest winds -- passes over Bermuda early on Saturday.\n- After Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "8f3354bb-8dfa-4715-a348-2337bb45b60c", "title": "Taiwan hit by a 6 . 1 - magnitude earthquake : CENC", "date": "2024-08-16 14:45", "url": "https://tribune.com.pk/story/2488549/taiwan-hit-by-a-61-magnitude-earthquake-cenc", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A 6.1-magnitude earthquake jolted the waters off Hualien County in China's Taiwan at 7:35 a.m. Friday (Beijing Time), according to the China Earthquake Networks Center (CENC).\nThe quake struck at a depth of 16 km, said a report issued by the CENC.\nPreviously, warning was issued after southwestern Japan was jolted on Thursday by a strong 7.1 magnitude earthquake, forcing Prime Minister Fumio Kishida to cancel his trip to Central Asia on Friday.\nIt is the “first such advisory for areas around the Nankai Trough” -- stretching from southwestern to central Japan -- issued by Japan Meteorological Agency, Tokyo-based Kyodo News reported.\nSeveral injuries and damage to buildings were reported in Miyazaki and two neighboring provinces after the earthquake hit the region on Thursday.", "location": "Answer:\nTAIWAN", "classification": "natural-disasters", "score": 0.7752410102507361, "event_breakdown": "Japan was struck by a strong earthquake in waters off Hualien County in China's Taiwan. The quake had a magnitude of 6.1 on the Richter scale, reports the China Earthquake Networks Center."}, {"id": "73810d26-3446-4487-9bc7-ffe8768a3187", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 15:15", "url": "https://www.wcax.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "wcax.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.", "location": "SAN JUAN, Puerto Rico.", "classification": "natural-disasters", "score": 0.9552146764942118, "event_breakdown": "Here are the relevant current events of natural-disasters reported in text that can be placed on a map:\nStorm Eloise - It killed at least 12 people. Photo courtesy of the National Institute for Disaster Risk Management.\nThe deaths from storm Eloise in Mozambique  near the border with Zimbabwe. - Comoros and Madagascar\nAffected Countries:\nMozambique, Zimbabwe, Comoros, and Madagascar"}, {"id": "e7740586-2cd0-4534-881a-679d41bfd14a", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 14:45", "url": "https://www.clickondetroit.com/news/world/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(NOAA via AP)SAN JUAN – Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9668438234287386, "event_breakdown": "Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices. The Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph). Tropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center. \"Hurricane Ernesto seriously threatens our community,\" said Jonathan Simmons, the director of the Bermuda Weather Service."}, {"id": "cf249d38-8c6d-4118-b469-011372bdd15f", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 14:45", "url": "https://www.clickorlando.com/news/world/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(NOAA via AP)SAN JUAN – Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.", "location": "SAN JUAN.", "classification": "natural-disasters", "score": 0.9668438234287386, "event_breakdown": "Currently, there is an Atlantic Hurricane named Ernesto and 2 earthquakes; a 6.2 in Mid-Atlantic Ridge and a 6.8 in Pakistan on September 24."}, {"id": "32c66856-4763-4cef-a63f-9dd5d04589b1", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.queanbeyanage.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDAA", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nIn September 2014, the islands experienced the strongest storm in more than 10 years, Hurricane Gonzalo , which caused significant damage to buildings and left many without power.\nIn September 2003, Hurricane Fabian struck the island, killing four people and causing extensive damage. It was the first storm to cause deaths on the islands since 1926."}, {"id": "14537a6b-b29d-4671-9b61-97af3ba368e7", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 15:30", "url": "https://www.wbng.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "wbng.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9552146764942118, "event_breakdown": "Three reports of natural-disasters are found in text:\n- Hurricane Ernesto approaching Bermuda\n- Hurricane Henri is devesating southwest Nova Scotia\n- Major heatwave causing dry thunderstorms in the northern Rockies, US"}, {"id": "f7b98cf1-24da-477f-bfe9-16fe31c12368", "title": "When Hurricane Season Occurs In Galveston , Texas ( And How Serious The Risk Is ) ", "date": "2024-08-16 16:15", "url": "https://www.islands.com/1640467/hurricane-season-galveston-texas-how-serious-risk/", "domain": "islands.com", "domain_classification": "Unknown", "message": "There's a good reason that colorful cottage you booked for a getaway to Galveston Island, home to one of the country's best beaches for a family vacation, sits high up on stilts.\nAs a barrier island, Galveston is positioned to take the brunt of storm surge during a hurricane — up to 16 feet of surge in the event of a Category 4 storm like the one in 1900 that went down in history as the Great Galveston Hurricane, still considered the worst weather disaster in US history.\nAdvertisementPeak hurricane season on the Texas Gulf Coast occurs in August and September — the 1900 storm struck in September, as did 2008's Hurricane Ike — but the official season is much longer, from June 1 through November 30.\nThat's why the local tourist industry was surprised but not unprepared on July 8, 2024, when Category 1 Hurricane Beryl roared into town so early in the season.\nWhile there is good reason to be prudent when planning your trip to the Gulf Coast (trip insurance?", "location": "Galveston Island", "classification": "natural-disasters", "score": 0.9804331958801071, "event_breakdown": "Hurricane Beryl - 2018\nHurricane Beryl was a short-lived Category 1 hurricane that formed off the coast of North Carolina in late July 2018. It was the first hurricane of the season in the Atlantic and made landfall near Jacksonville, Florida. The storm caused only minor damage, but served as a reminder of the upcoming peak hurricane season."}, {"id": "77fb34a0-5bda-4fd3-9a4e-e5b4acadd8ed", "title": "P . E . I . officials preparing for hurricane season in a post - Fiona world", "date": "2024-08-16 01:15", "url": "https://www.cbc.ca/news/canada/prince-edward-island/pei-fiona-hurricane-season-preparedness-1.7295914", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "As officials in Prince Edward Island prepare for hurricane season, they are urging Islanders to get ready for future Fiona-level storms — whenever they may hit.\nSince storm season began, the utility company has been circulating hurricane preparedness information in bill inserts and on its website.\nOn the municipal level, the Charlottetown Fire Department says it has been working with organizations in the community as it prepares for the height of the Atlantic hurricane season, which officially ends on Nov. 30.\nCharlottetown Fire Chief Tim Mamye said Islanders should prepare a 72-hour emergency kit for hurricane season.\n(Wayne Thibodeau/CBC)To prepare for hurricane season, Mamye recommended Islanders familiarize themselves with the municipal, provincial and federal advice on getting ready for an emergency.", "location": "Charlottetown", "classification": "natural-disasters", "score": 0.9211077681379434, "event_breakdown": "Atlantic hurricane season officially began on June 1st, and all three levels of government are urging Islanders to be ready for this year's storms. Utility companies are circulating preparedness information in bill inserts and on their websites, while the Charlottetown Fire Department is partnering with community organizations to prepare. Islanders should prepare a 72-hour emergency kit for hurricane season and familiarize themselves with the municipal, provincial, and federal advice on getting ready for an emergency."}, {"id": "2af6363c-c35e-4d26-9567-c4315f1a7bc0", "title": "Ernesto grows into Category 2 hurricane as it aims for Bermuda - New Delhi Times - India Only International Newspaper", "date": "2024-08-16 15:15", "url": "https://www.newdelhitimes.com/ernesto-grows-into-category-2-hurricane-as-it-aims-for-bermuda/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nMore than 290,000 of 1.4 million customers remained in the dark Thursday evening, more than a day after Ernesto swiped past Puerto Rico late Tuesday as a tropical storm before strengthening into a hurricane.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.9014724835075038, "event_breakdown": "Hurricane Ernesto - strengthening to a Category 2 storm Thursday night as it barreled toward Bermuda; left hundreds of thousands of people in Puerto Rico without power and water.\nPower and water outages on Puerto Rico - at least 290,000 of 1.4 million customers remained in the dark Thursday night.\nAustralia flooding - severe storms and heavy rain across NSW and Sydney triggered evacuations and left multiple rescue operations underway."}, {"id": "7b9a0ee2-e189-41eb-a8f9-84228e4959f8", "title": "Hurricane Ernesto Aims for Bermuda After Leaving Many in Puerto Rico Without Power or Water", "date": "2024-08-16 02:15", "url": "https://www.theepochtimes.com/world/hurricane-ernesto-aims-for-bermuda-after-leaving-many-in-puerto-rico-without-power-or-water-5706458", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico—Hurricane Ernesto barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico.", "classification": "natural-disasters", "score": 0.7043373746091739, "event_breakdown": "Ernesto, Hurrican affect Puerto Rico, Bermuda; 250,000 customers without water; 400 power line failures; Hurricane Sandy - 2012 - New York City and surrounding area"}, {"id": "aa030ac2-b73c-4249-8afe-319e4e144dba", "title": "Thursday PM Forecast : tropical moisture keeps scattered storms for another afternoon", "date": "2024-08-16 01:15", "url": "https://www.wbrz.com/news/thursday-pm-forecast-tropical-moisture-keeps-scattered-storms-for-another-afternoon", "domain": "wbrz.com", "domain_classification": "Unknown", "message": "Thursday PM Forecast: tropical moisture keeps scattered storms for another afternoonTropical moisture has pushed into the region causing an uptick in the number of showers and thunderstorms.\nOn Monday, a weak front will push through the Metro Area causing a minor dip in humidity and low temperatures as well.\nWe will also be able to get low temperatures back to average in the low 70s.\nYour weather updates can be found on News 2, wbrz.com, and the WBRZ WX App on your Apple or Android device.\nFollow WBRZ Weather on Facebook and Twitter for even more weather updates while you are on the go.", "location": "BATON ROUGE, LOUISIANA", "classification": "natural-disasters", "score": 0.5169117555328766, "event_breakdown": "Hurricane Sam is currently causing dangerous surf and rip current conditions along the East Coast of the United States, and is expected to bring heavy rain and strong winds to Bermuda by the end of the week.\n\nTropical Storm Odette is currently bringing heavy rain and strong winds to Bermuda, and is expected to bring heavy rain and strong winds to the East Coast of the United States by the end of the week.\n\nTropical Storm Peter is currently bringing heavy rain and strong winds to Bermuda, and is expected to bring heavy rain and strong winds to the East Coast of the United States by the end of the week.\n\nTropical Storm Wanda is currently bringing heavy rain and strong winds to Bermuda, and is expected to bring heavy rain and strong winds to the East Coast of the United States by the end of the week."}, {"id": "7ba98c84-208b-403d-958b-9d3d4dc2d1f7", "title": "Vermont flooding : Examining what behind all the heavy rain", "date": "2024-08-16 14:45", "url": "https://www.bostonglobe.com/2024/08/16/metro/vermont-flooding-rain-climate-change/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But what’s driving such extreme and sudden flooding in Vermont from a meteorological perspective?\nThe rain doesn’t let upThe average annual precipitation across Vermont has been increasing at alarming rates, with the northern regions of New England accelerating faster than the south.\n“Vermont watersheds are particularly small and steep and that makes them more prone to flooding,” Winter said.\nAdvertisementSurface storm systems have a tendency to produce the strongest storms closest to wherever the jet stream is positioned overhead.\nRecently, the jet stream has been positioned by nearby Vermont, making the area more susceptible to frequent and intense storms.", "location": ".\nVermont", "classification": "natural-disasters", "score": 0.9480404980787904, "event_breakdown": "Vermont flooding\nRecent flooding in Vermont has been hit by a series of intense storms which have battered the state for days. Cold fronts from the storm system brought high winds and heavy rain, extending into Friday.  The winds uprooted trees, closed roads and bridges, damaged homes, and knocked out power to tens of thousands of people.  The storms are being driven by a change in atmospheric patterns favored by the placement of the jet stream."}, {"id": "7e79d45a-4739-410f-a650-b04d75f601cf", "title": "Category 2 Hurricane Ernesto updates from the National Hurricane Center for Friday , Aug 16", "date": "2024-08-16 16:15", "url": "https://www.yahoo.com/news/category-2-hurricane-ernesto-updates-150701195.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ETThe National Hurricane Center's 2 pm Friday advisory reported that Category 2 Hurricane Ernesto is 180 miles south-southwest of Bermuda, with maximum sustained wind of 100 mph.\nYESTERDAY (Thursday):Yesterday, Ernesto reached new heights of intensity and was upgraded from a Category 1 hurricane into a Category 2 hurricane, with winds blowing at 100 miles per hour.\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:A Hurricane Warning is in effect for:- BermudaA Hurricane Warning means that hurricane conditions are expected somewhere within the warning area.\nHAZARDS AFFECTING LAND:WIND: Hurricane conditions are expected on Bermuda Saturday, with tropical storm conditions likely beginning later this afternoon.\nSource: National Hurricane CenterThis article was generated by the South Carolina Bot, artificial intelligence software that analyzes information from the National Hurricane Center and applies it to templates created by journalists in the newsroom.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.898947203596916, "event_breakdown": "Hurricane Ernesto is currently 180 miles south of Bermuda and is expected to impact the area with hurricane conditions."}, {"id": "25f48942-0d9c-4e34-9efb-43654eebf8d4", "title": "Ernesto offers surprising insights into a hurricane wind field", "date": "2024-08-16 22:00", "url": "https://www.bostonglobe.com/2024/08/16/metro/hurricane-ernesto-wind-field-atlantic/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "As Ernesto continued churning through the Atlantic on Friday approaching Bermuda, the British territory was bracing for harsh, hurricane-force winds and flooding rains.\nAlso, as the storms move into the northern latitudes, the wind field can expand as the storm starts to undergo a transition from a tropical one to an extra tropical one.\nAdvertisementBut when hurricanes are at their most intense and over the warm waters of the Atlantic, Pacific or Indian oceans, the wind field is quite tight, perhaps surprisingly so.\nNASANotice the map below with the predicted wind field through Wednesday of next week.\nThe odds of any significant wind reaching our latitude are small, but you can infer how a track of Ernesto further west, highly unlikely, would place part of Cape Cod into the path of tropical storm winds.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9027427652136233, "event_breakdown": "Ernesto\nCurrently churning through the Atlantic, approaching Bermuda. The British territory is bracing for harsh winds and flooding rains."}, {"id": "86414a4e-3889-4abe-a58a-363092085ff7", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 19:45", "url": "https://www.brookingsradio.com/syndicated-article/?id=1579611", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.9686329598896332, "event_breakdown": "Hurricane warning issued for Bermuda as Ernesto approaches\nNortheast to get high waves from Ernesto"}, {"id": "636d258e-8d6c-410b-a431-adaee6bef33d", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 06:45", "url": "https://www.singletonargus.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.5999895187303287, "event_breakdown": "1. On January 30, 2022, a 6.6-magnitude earthquake struck Haiti, affecting Port-de-Paix among other cities in the northwestern part of Haiti, and killing at least 304 people.\n2. On May 9, 2022, an 8.3-magnitude earthquake struck Indonesia, affecting Lombok among other areas and leading to a tsunami warning.\n3. On June 2, 2022, a 6.1-magnitude earthquake struck Japan, affecting Okinawa among other areas and leading to a tsunami warning.\n4. On June 8, 2022, Tropical Storm Colin made landfall in Florida, becoming the first named storm of the 2022 Atlantic hurricane season.\n5. On June 9, 2022, Tropical Storm Bonnie made landfall in South Carolina, briefly causing tornadoes in Alabama and flash flooding in North Carolina.\n6. On June 20, 2022, Tropical Storm Celia made landfall in Mexico as a weak Category 1 hurricane, causing minimal damage.\n7. On June 26, 2022, Tropical Storm Dolly made landfall in Mexico as a weak Category 1 hurricane, causing minimal damage.\n8. On June 27, 2022, Tropical Storm Ema made landfall in Mexico, causing flooding and landslides.\n9. On July 5, 2022, Tropical Storm"}, {"id": "1e759db8-32bd-48ac-b0d7-a39d7c72802c", "title": "Hurricane Ernesto barrels toward Bermuda as British territory preps for storm", "date": "2024-08-16 22:15", "url": "https://jamaica-gleaner.com/article/caribbean/20240816/hurricane-ernesto-barrels-toward-bermuda-british-territory-preps-storm", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometres) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season.", "location": "BERMUDA.", "classification": "natural-disasters", "score": 0.9544921979265834, "event_breakdown": "1. Hurricane Ernesto is reported to be 180 miles southwest of Bermuda on Aug 2, with sustained winds of 100 miles per hour.\n2. A tornado in Colorado killed one person and injured several others in Jun 15.\n3. Taiwan was hit by another 6.0-magnitude earthquake on Jun 21. Many people are homeless, 2 people have been reported dead and 88 missing after an earthquake in Taiwan"}, {"id": "8eaea206-695a-4b51-af36-0192ca1cf04d", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 21:30", "url": "https://www.fox8live.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "The Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.966544098747158, "event_breakdown": "Ernesto, the fifth named storm and the third hurricane of this year's Atlantic hurricane season, was located 125 miles (205 kilometers) south-southwest of Bermuda, according to the National Hurricane Center. Officials said they would suspend public transportation and close the airport by Friday night in preparation for the storm, which caused flooding and strong winds."}, {"id": "edace48e-0435-4ad5-b72a-c016ee8b7c04", "title": "Warmer temperatures , scattered storms return this weekend", "date": "2024-08-16 22:15", "url": "https://wach.com/weather/skywach-weather-blog/warmer-temperatures-scattered-storms-return-this-weekend", "domain": "wach.com", "domain_classification": "Unknown", "message": "The weekend will feature warmer temperatures and higher humidity than we have been accustomed to these past few days.\nThe humid weather will combine with a passing cold front to spark storms throughout the weekend.\nLower humidity and sunny skies will return to the Midlands Monday and should stick around most of next week.\nThe storm is forecast to fall back to a Category 1 as it passes nearby Bermuda early Saturday.\nWhile the system remains well east of the U.S., high surf and a high risk for rip currents will persist up and down the east coast throughout the weekend.", "location": "Based on the context provided, I was not able to identify a specific location for the event.", "classification": "natural-disasters", "score": 0.7657124372080656, "event_breakdown": "Natural hazards:\n- A cold front is forecast to spark storms throughout the weekend.\n- The storm is forecast to pass close by Bermuda early on Saturday. \n- High surf is hitting the Northeast Coast this weekend, and it will last through much of next week."}, {"id": "d2c59a4e-2542-4107-8e80-21de80514f8b", "title": "Hundreds of thousands without power in Puerto Rico as Hurricane Ernesto aims for Bermuda", "date": "2024-08-16 02:00", "url": "https://www.lemonde.fr/en/international/article/2024/08/16/hundreds-of-thousands-without-power-in-puerto-rico-as-hurricane-ernesto-aims-for-bermuda_6716432_4.html", "domain": "lemonde.fr", "domain_classification": "Local - Europe", "message": "A power line pole leans against a house in the aftermath of Tropical Storm Ernesto in Fajardo, Puerto Rico August 14, 2024.\nRICARDO ARDUENGO / REUTERSHurricane Ernesto barreled toward Bermuda on Thursday, August 15, after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the US territory, raising concerns about people's health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n\"All of the guidance show this system as a large hurricane near Bermuda,\" said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8491967219084398, "event_breakdown": "Tropical Storm Ernesto - Category 1 hurricane, heading toward Bermuda and possibly becoming a Category 2\nPower outage in Puerto Rico following Tropical Storm Ernesto"}, {"id": "ae263786-83a9-475f-bd75-56bf006b997e", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://fox11online.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": ".\nPuerto Rico", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto barreling toward Bermuda, leaving hundreds of thousands without power or water in Puerto Rico"}, {"id": "e47ad3fc-0351-4d9b-a923-cfb932df7e73", "title": "FEMA Opens Debby Recovery Center In Manatee County", "date": "2024-08-16 23:15", "url": "https://mykiss951.iheart.com/content/2024-08-16-fema-opens-debby-recovery-center-in-manatee-county/", "domain": "mykiss951.iheart.com", "domain_classification": "Unknown", "message": "LAKEWOOD RANCH --FEMA is opening a disaster recovery center in Manatee County to help survivors of flooding from Hurricane Debby.\nThe center is open Saturday afternoon from 1-7 pm and daily from 9 am to 7 pm starting Sunday.\nIt's at the Lakewood Ranch Library, where FEMA specialists will offer support with filling out applications and updating status, while volunteers will offer other recovery services.\nDebby made landfall in North Florida but it brought record amounts of rainfall to Manatee and Sarasota counties, with damage estimated at around $100 million.\nPhoto: Getty Images", "location": "Lakewood Ranch", "classification": "natural-disasters", "score": 0.7149836897412051, "event_breakdown": "FEMA opened a disaster recovery center in Manatee County to help survivors of flooding from Hurricane Debby. The center is open on Saturday from 1-7 pm and daily from 9 am to 7 pm starting Sunday. It's at the Lakewood Ranch Library. FEMA specialists are supporting survivors with filling out applications and updating their status, while volunteers are offering other recovery services. Bill of India,\nlists current events of natural-disasters that are reported in text and are specific and have a specific location.\n\n1. FEMA opened a disaster recovery center in Manatee County to help survivors of flooding from Hurricane Debby.\n2. The disaster recovery is open Saturday afternoon from 1-7 pm and daily from 9 am to 7 pm starting Sunday.\n3. It's at the Lakewood Ranch Library.\n4. FEMA specialists are supporting survivors with filling out applications and updating their status, while volunteers are offering other recovery services.\n\nDebby made landfall in North Florida but it brought record amounts of rainfall to Manatee and Sarasota counties, with damage estimated at around $100 million."}, {"id": "cd95b0ea-0e4f-4c59-9603-4e97d13f0c81", "title": "MA air quality : Smoky skies over Boston through Saturday – NECN", "date": "2024-08-16 21:00", "url": "https://www.necn.com/weather/stories-weather/wildfire-smoke-forecast-massachusetts/3311559/", "domain": "necn.com", "domain_classification": "Unknown", "message": "Wildfire smoke continues to sit in the sky above New England.\nThey will continue to be muted, with an orange tint to the sun, through at least Saturday.\nWith the smoke getting so thick, our air quality is \"unhealthy\" Friday and Saturday.\nMeteorologist Chase Cain explains how that’s allowing wildfires to burn more land much earlier in wildfire season.\nOther than the hazy sun, we stay mainly dry, with highs in the 80s inland, 70s at the coast due to an east breeze.", "location": "New England", "classification": "natural-disasters", "score": 0.5669101030476945, "event_breakdown": "Here is a list of reported current events of natural-disasters that can be placed on a map:\nNorth American Wildfires\nOn August 14, 2020, North American wildfires continued to rage, leading to widespread air quality issues across the United States and Canada, as well as hazy skies in New England."}, {"id": "ca3caf2c-7d16-47c6-b70f-da24d469e064", "title": "Hurricane scorecard so far this season", "date": "2024-08-16 21:15", "url": "https://www.news4jax.com/weather/2024/08/16/hurricane-scorecard-so-far-this-season/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Hurricane marks the third and only hurricane not to hit the United States thus far this season.\nJACKSONVILLE, Fla. – The Atlantic hurricane season is expected to heat up just as we move from August to September.\nThe peak season begins around Sept. 10, when hurricane development conditions become even more favorable.\nRunning scorecard through August 16, 2024 for Atlantic hurricane basin.\nSo far, Hurricanes Beryl and Debby have hit the United States, while a third hurricane may impact Bermuda.", "location": "Florida, Jacksonville", "classification": "natural-disasters", "score": 0.8382888024838865, "event_breakdown": "JACKSONVILLE, Fla. (FEMA) – The federal disaster declaration for the California wildfires has been approved.\nIt states that the president will quick"}, {"id": "9f862aa7-194f-426c-8bca-36f475e6a2fa", "title": "Forsyth Farmer Market hosts fundraiser for vendors impacted by Debby", "date": "2024-08-16 15:30", "url": "https://www.yahoo.com/news/forsyth-farmers-market-hosts-fundraiser-131737159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAVANNAH, Ga. (WSAV) – The Forsyth Farmers’ Market is stepping up to help some of their vendors who were impacted by Tropical Storm Debby.\nTheir “Roots in Recovery” fundraiser aims to help repair damages, replace lost crops and ensure vendors can continue their vital work.\n“These are the same farmers who have tirelessly brought nutritious produce to our community, rain or shine, season after season,” the fundraising page reads.\n“Now, they need our help to recover and rebuild.”WSAV News 3, iHeart Media and Parker’s Kitchen raise money for victims of Tropical Storm DebbyTo contribute to the fundraiser, visit here.\nThe market is held each Saturday from 9 a.m. to 1 p.m. in Savannah’s Forsyth Park.", "location": "Forsyth Park", "classification": "natural-disasters", "score": 0.5979213116232384, "event_breakdown": "Tropical Storm Fred - In current time frame, Tropical Storm Fred is affecting the Florida panhandle and causing flooding in surrounding areas. \nTropical Storm Henri - In current time frame, Tropical Storm Henri is heading south along the East Coast and bringing heavy rain and strong winds to the region."}, {"id": "844d0403-5884-4733-9f0e-440224496733", "title": "Hurricane Debby exposes vulnerabilities for neighbors in Perry", "date": "2024-08-16 16:15", "url": "https://www.wtxl.com/northwest-tallahassee/hurricane-debby-exposes-vulnerabilities-for-neighbors-in-perry-as-they-recover-from-2-hurricanes-in-11-months", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Hurricane Debby exposes additional vulnerabilities for neighbors in Taylor County who say they cannot afford basic necessities and building repairs.\nBROADCAST TRANSCRIPT:More people struggling to afford groceries and make ends meet since Hurricane Debby.\nDamage from Hurricane Idalia and then Debby has caused major water damage.\nMonique Ellsworth, CEO of Second Harvest of the Big Bend, said over 20% of their post Debby distribution has gone to Taylor County.\nHowever, Ellsworth said there is also an air of relief in Taylor County that damage was minimal.", "location": "Taylor County, Florida", "classification": "natural-disasters", "score": 0.6894308273501676, "event_breakdown": "Hurricane Idalia and Debby (location: Taylor County)"}, {"id": "b73fc252-a604-4efd-a5e7-e4c0a15062d1", "title": "Nonprofit launches program aimed to help owners find lost pets after a storm hits", "date": "2024-08-16 22:45", "url": "https://www.local10.com/news/local/2024/08/16/nonprofit-launches-program-aimed-to-help-owners-find-lost-pets-after-a-storm-hits/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Many pet owners choose not to evacuate before a storm because they don’t know what shelters or hotels accept animals.\nThen, tens of thousands of pets go missing during the destruction of tropical storms and hurricanes.\n“We see so many situations where people are separated from their pets,” said Kimberly Bentley with the Global Empowerment Mission.\nFlew the Coop and Fido Alert have joined forces to build a database of pets and their owners well before an emergency is upon us.\nRegistered pet owners will also receive text alerts on their phone about impending storm details and safety tips along with information about which local shelters and hotels across Florida are pet friendly.", "location": ")\nFlorida", "classification": "natural-disasters", "score": 0.7577509742497228, "event_breakdown": "Natural Disaster: Hurricanes\nRegions affected: United States, specifically Florida\nYear: 2018 - Currently ongoing"}, {"id": "5d898acc-e61c-4e62-a6b8-010252138beb", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://news4sanantonio.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000.", "location": "Bermuda", "classification": "natural-disasters", "score": 0.8302003472472468, "event_breakdown": "Ernesto"}, {"id": "3cbc49ce-c1a3-4d7e-8f94-601373fd1c92", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 23:30", "url": "https://www.whittierdailynews.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "whittierdailynews.com", "domain_classification": "Unknown", "message": "Tropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nLa Plata river overflows onto a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alejandro Granadillo)La Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alejandro Granadillo)La Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alberto Bartolomei)A man fishes after Tropical Storm Ernesto passed through Rio Grande, Puerto Rico, Wednesday, Aug. 14, 2024.", "location": "Puerto Rico", "classification": "natural-disasters", "score": 0.8923232475078768, "event_breakdown": "Tropical storm conditions in the Caribbean - Tropical Storm Ernesto"}, {"id": "313bb418-9126-41b4-86f8-746f710fc11e", "title": "East Coast beaches to experience high rip current risk from Hurricane Ernesto : reports", "date": "2024-08-16 04:00", "url": "https://www.pennlive.com/weather/2024/08/east-coast-beaches-to-experience-high-rip-current-risk-from-hurricane-ernesto-reports.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "“Beachgoers should be aware of a significant risk of life-threatening surf and rip currents, and stay out of the water if advised by lifeguards.”What is a rip current?\nIf you are caught in a rip current, do not fight it.\nNew Jersey, Long Island and New England should see dangerous rip current conditions by Saturday, which will persist into early next week, the Washington Post said.\n“Several beautiful beach days are coming up, but don’t be deceived!” The Weather Service office in Morehead City, North Carolina, told the Washington Post.\nHurricane Ernesto is not expected to make landfall in the United States but might reach parts of Canada, the Washington Post Said.", "location": "New Jersey", "classification": "natural-disasters", "score": 0.4616717425039135, "event_breakdown": "Rip Currents possibly affecting New York, New Jersey, Long Island and New England: Beachgoers should be aware of a significant risk of life-threatening surf and rip currents and stay out of the water if advised by lifeguards; Reported by The Washington Post.\nHurricane Ernesto possibly affecting Canada; Reported by The Washington Post."}, {"id": "ba49dbe0-9ce5-4b0c-ac5b-faa8a6e3e2ec", "title": "Typhoon Ampil nears Tokyo , trains suspended", "date": "2024-08-16 04:30", "url": "https://www.marketscreener.com/news/latest/Typhoon-Ampil-nears-Tokyo-trains-suspended-47667752/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: :: Heavy rain pours on Tokyo and bullet trains halt as Typhoon Ampil approaches:: August 16, 2024:: Tokyo, JapanThe typhoon that is categorised as a very strong storm by the Japan Meteorological Agency (JMA) is moving 110 kilometres (68 miles) northeast of Hachijojima Island in the Pacific Ocean moving north at 20 kilometres per hour.\nCentral Japan Railway cancelled all 'Shinkansen' bullet train services between Tokyo and Japan's industrial heartland of Nagoya on Friday.\nHeavy rain and strong wind is expected throughout the day in Chiba Prefecture and areas in Northeastern Japan.\nJMA officials have advised local residents to stay home and be cautious for high tides, flooding and swollen rivers.", "location": "TOKYO", "classification": "natural-disasters", "score": 0.941918337600363, "event_breakdown": "Typhoon Ampil approaching Japan and affects Tokyo and bullet trains."}, {"id": "e6598e29-5ec9-49ae-b79e-a51840792306", "title": "Weekend showers and storms likely", "date": "2024-08-16 01:00", "url": "https://www.walb.com/2024/08/16/weekend-showers-storms-likely/", "domain": "walb.com", "domain_classification": "Unknown", "message": "Thursday afternoon a few passing showers slid across areas along the GA/FL line otherwise rain-free.\nEnjoy the nice change before it slides out heading into the weekend.\nFor the weekend hot mid-upper 90s as a weak front drops into the region.\nMoisture increases with showers and storms likely and higher humidity.\nMornings pretty nice with lows upper 60s around 70° while highs top mid-upper 90s with tons of sunshine.", "location": "GA/FL line", "classification": "natural-disasters", "score": 0.5401254666676385, "event_breakdown": "There are several current events of natural-disasters reported in text that can be placed on a map. Here are some of them:\n\n1. On Thursday afternoon a few passing showers slid across areas along the GA/FL line otherwise rain-free.\n2. Enjoy the nice change before it slides out heading into the weekend.\n3. For the weekend hot mid-upper 90s as a weak front drops into the region.\n4. Moisture increases with showers and storms likely and higher humidity.\n5. Mornings pretty nice with lows upper 60s around 70 while they highs top mid-upper 90s with tons of sunshine.\n\nPlease note that all of these events are related to weather and they can all be plotted on a map."}, {"id": "14f11278-620c-47ae-be1c-90ac22f67c04", "title": "Everyday Heroes : Those who rescued residents amid Tropical Storm Debby flooding", "date": "2024-08-16 23:30", "url": "https://www.yahoo.com/news/everyday-heroes-those-rescued-residents-204151151.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DORCHESTER COUNTY, S.C. (WCBD) – It has been just over a week since Tropical Storm Debby drenched the Lowcountry.\n“It’s a house I waited 35 years for, and now I won’t have it no more,” said Dorothy Beach, whose property in Dorchester County was flooded after the storm moved through.\nBeach, her husband Ralph, and their pets were rescued on Saturday from their home in the Twin Lakes community along the Ashley River.\n“Since 2015 we made sure got certain vehicles, we got a water rescue team.\nSummerville Fire and Rescue works closely with Dorchester County and North Charleston.", "location": "Based on the text, the specific location for the main event is 'Twin Lakes community along the Ashley River in", "classification": "natural-disasters", "score": 0.6826195710913692, "event_breakdown": "Tropical Storm Debby caused flooding and damage in the Lowcountry of South Carolina on Sunday, August 27, 2018. Summerville fire rescue began its water rescue operations and helped people escape before their homes were hit by the flood. 80 people were evacuated from Summerville’s 8000 block in the Twin Lakes Community. 2 people were brought to safety with assistance of the water search team. The Summerville Fire and Rescue were working towards damage assessment in the flooded areas."}, {"id": "be0ca680-97dc-4c5c-89dd-dcb56264f7a0", "title": "Sunny and smoky skies in CT before rain this weekend , NWS says", "date": "2024-08-16 14:00", "url": "http://www.nhregister.com/weather/article/ct-weather-friday-weekend-forecast-air-quality-19660152.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Connecticut weather: A man rides a bicycle though Seaside Park on a sunny summer afternoon in Bridgeport, Conn. Aug. 15, 2024.\nSo far this week, Connecticut air quality has been \"moderate,\" meaning most people should find the air acceptable, with the exception of those who are especially sensitive to air pollution.\nAir quality sensors throughout the state recorded yellow, or moderate, air quality again on Friday, and the state Department of Energy and Environmental Protection also was predicting moderate air quality for the day.\nThe weather system could bring locally heavy rainfall and \"nuisance flooding,\" the weather service said.\nThe weather system could bring \"locally heavy downpours that could lead to nuisance flooding at times,\" the weather service said.", "location": "Connecticut", "classification": "natural-disasters", "score": 0.5580757268484402, "event_breakdown": "1. Hurricane Dorian is currently a category 4 hurricane and is moving towards the east coast of the United States, with landfall predicted for late Monday.\n2. Hurricane Florence is currently a category 3 hurricane and is moving towards the east coast of the United States, with landfall predicted for late Wednesday.\n3. The 2019 North Indian Ocean cyclone season is ongoing, with two named tropical cyclones having developed so far this year. The first one was named Fani, and the second one was named Vayu, which is currently moving towards the Gujarat coast of India and is expected to make landfall on the morning of June 13."}, {"id": "bea85d41-28a2-48ce-b04f-7fea8143fe18", "title": "Bangkok Post - Severe typhoon approaching Japan disrupts flights , trains", "date": "2024-08-16 04:45", "url": "https://www.bangkokpost.com/world/2848288/severe-typhoon-approaching-japan-disrupts-flights-trains", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Severe typhoon approaching Japan disrupts flights, trainsWaves crash amid Typhoon Ampil, in Hachijo, Tokyo Prefecture, Japan on Friday, in this screen grab obtained from a social media video.\nJapan Airlines Co and All Nippon Airways Co cancelled some 90 international flights, impacting more than 15,000 passengers.\nThe latest typhoon, categorised as a severe tropical storm, will be at its closest around midday Friday, according to weather forecasters.\n“I am stuck.”Lingering effects from the tropical storm are seen lasting through Saturday.\nKorean Air Lines Co said 12 of its flights between Japan and South Korea will be suspended on Friday and Saturday.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.4645099825972967, "event_breakdown": "Japan - Typhoon Ampil (2019)"}, {"id": "9f197c7e-74d5-4d44-8eb1-8a7c13170a45", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.gazetteandherald.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "gazetteandherald.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "['A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island on Saturday.', 'National Hurricane Center in Miami.']"}, {"id": "affea1ce-66df-45f3-8001-6b82776d09ce", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.harwichandmanningtreestandard.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "harwichandmanningtreestandard.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane.", "location": "Bermuda.", "classification": "natural-disasters", "score": 0.9308516131776221, "event_breakdown": "[\n\"On Saturday, the National Hurricane Center issued a warning for Bermuda as Ernesto is expected to pass near or over the island. The storm is currently expected to pass east of Atlantic Canada on Monday.\"\n]"}]