[{"id": "79d1b882-5ef4-4091-a55c-af66329cbf99", "title": "World War III : The Civilized World Vs . Klal Yisrael | The Jewish Press - JewishPress . com | Richard Kronenfeld | 19 Tammuz 5784 – Wednesday , July 24 , 2024", "date": "2024-07-25 09:00", "url": "https://www.jewishpress.com/sections/features/world-war-iii-the-civilized-world-vs-klal-yisrael/2024/07/24/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Jewish PressThe media allege that President Biden’s aid to Ukraine as it battles Russia is risking World War III.\nAs I see it, however, World War III has already begun, pitting the entire civilized world, including the United States, against Israel and the Jewish people.\nThe first part of my statement about World War III, naming the entire civilized world, should be self-evident from the actions of the United Nations, the putative global parliament.\nRegarding the second element of my description of a new world war, “including the United States,” we are no longer the America whose U.N.\nIsrael is feeding enemy civilians, which is unprecedented in war; Hamas is stealing an estimated 80% of the supplies.", "location": ".\nBased on the context provided, I could not determine a specific location for the main event.", "classification": "antisemitism", "score": 0.5652033232888349, "event_breakdown": "1. 3/20/22 Antisemitic messaging on Golan Heights town notice board.\n2. 3/1/22 Three attacks on Jewish targets in San Jose, Costa Rica.\n3. 2/25/22 Antisemitic graffiti on new courts in San Jose, Costa Rica.\n4. 2/17/22 Antisemitic graffiti on Holocaust memorial in San José.\n5. 2/17/22 Antisemitic posters in San José.\n6. 1/2/22 Ames makes antisemitic display a surprise hit on social media."}, {"id": "97347ca9-b8f3-460c-a50d-53b8e66cdb2c", "title": "Israel and Hamas closer than ever to ceasefire deal , White House says", "date": "2024-07-25 23:15", "url": "https://www.aol.co.uk/news/netanyahu-biden-meet-discuss-ceasefire-155952916.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "White House officials said Israel and Hamas were “closer now than we’ve been before” to reaching a ceasefire deal as Benjamin Netanyahu met Joe Biden on Thursday to discuss an end to the nine-month conflict in Gaza.\nA senior administration official said that a framework for the deal had been agreed upon but that “serious implementation issues … still had to be resolved.\n“It’s a kind of like, ‘How do we close these final gaps?’”At a press conference while the two leaders were meeting, the White House national security spokesperson, John Kirby, said gaps in the ceasefire deal could be overcome.\n“I condemn any individuals associating with the brutal terrorist organisation Hamas, which has vowed to annihilate the state of Israel and kill Jews.\nAbout 40 Democratic lawmakers – including the former House speaker Nancy Pelosi – boycotted the speech, and only half of congressional Democrats attended.", "location": "Gaza", "classification": "antisemitism", "score": 0.47840491059383683, "event_breakdown": "1. A firebomb thrown at a synagogue in Wuppertal, Germany was condemned by lawmakers.\n2. Jewish cemeteries were also a target for bomb squads in several cities in eastern France.\n3. A synagogue in Amsterdam was attacked, sparking a protest over the Passover holiday."}]