[{"id": "dcf1ef9a-0f82-4bac-8568-b82ee1ca3ad5", "title": "Drone strikes , air defense challenges , and regional escalations", "date": "2024-07-23 15:15", "url": "https://www.jpost.com/middle-east/article-811563", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In addition to the fighting in Gaza between the Israel Defense Forces (IDF) and Hamas, there are other active fronts.\nAttack drones and sophisticated unarmed aerial vehicles (UAVs) have become one of the added elements of this war, used by both sides.\nIsrael prides itself on its multi-layered air defense systems, which are composed of five different levels.\n“Israel is the most defended country in the world in terms of air defense, although there cannot be complete 100% defense,” Mey-Tal said.\n“Israel is now looking at the drone industry there very carefully to learn how to make thwarting UAV attacks cheaper.”", "location": "Gaza", "classification": "security", "score": 0.833706691097128, "event_breakdown": "1. The current fighting in Gaza between the IDF and Hamas.\n2. Israel's use of the Iron Dome air defense system to intercept incoming rockets.\n3. Attack drones and sophisticated unarmed aerial vehicles (UAVs) have become one of the added elements of this war, used by both sides."}, {"id": "d53a6cc5-18d7-49b5-ba26-f067029e3514", "title": "Israel Next War | Foreign Affairs", "date": "2024-07-23 05:00", "url": "https://www.foreignaffairs.com/israel/israels-next-war-hezbollah-lebanon", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "Israel’s home-front command estimates that if a full-scale conflict broke out now, Hezbollah would launch some 3,000 rockets and missiles every day of the war, threatening to overwhelm Israel’s missile defenses.\nTHE BIG ONEIn contrast to its unexpected war in Gaza, Israel has long been preparing for a war with Hezbollah.\nThese militias, several of which sat on Israel’s borders, provided Iran with deterrence against Israel’s more powerful military and gave Tehran a ready launching pad for attacks.\nDON’T DO ITIf some of Israel’s military leaders had their way, Israel might have launched a war against Hezbollah even before the IDF invasion of Gaza began.\nBut Hezbollah has made clear that it will continue fighting as long as Israel’s war in Gaza continues.", "location": "Lebanon", "classification": "security", "score": 0.5386630169918678, "event_breakdown": "TARGET EVENT:\nIsrael estimates that if a full-scale conflict with Hezbollah breaks out, Hezbollah would launch some 3,000 rockets and missiles every day."}, {"id": "642fdace-9e81-4bfc-ba08-c973493ea154", "title": "Hizbollah Fires Rockets After Israel Strike On Lebanon", "date": "2024-07-23 04:15", "url": "https://menafn.com/1108469645/Hizbollah-Fires-Rockets-After-Israel-Strike-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Hizbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian fighter group's October 7 surprise attack on southern Israel triggered war in the Gaza Strip.\nThe Iran-backed Hizbollah said it targeted northern Israel's Dafna area with Katyusha rockets \"in response to the Israeli enemy's that targeted civilians in the town of Adloun, injuring several of them\".\nThis comes after the Israeli military said its air force \"struck two Hizbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry\".\nEarlier on Saturday, Hizbollah and its Palestinian ally Hamas had fired rocket salvos and explosive-laden drones at Israeli positions.\nHizbollah said it had launched \"dozens of Katyusha rockets\" towards northern Israel \"in response\" to a strike blamed on Israel that injured civilians.", "location": "Northern Israel", "classification": "security", "score": 0.9946775321153677, "event_breakdown": "Location: Lebanon and Israel\nEvent: Hizbollah fired rockets at Israel \"in response\" to the Israeli strike that injured civilians\nEvent: Israeli military struck two Hizbollah weapons storage facilities in Lebanon in retaliation for rocket salvos"}, {"id": "fb7f7e59-067c-4ddf-9bd5-83f8ffadccdd", "title": "IDF eliminates multiple terorrist in Khan Yunis , Hamas rocket hit school", "date": "2024-07-23 17:30", "url": "https://www.jpost.com/israel-hamas-war/article-811576", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Gen. Dan Goldfus has killed dozens of Hamas terrorists as of Tuesday as part of its reinvasion of Khan Yunis in southern Gaza which started on Monday.\nAccording to the IDF, to date since the invasion of Rafah started on May 6, the military has killed over 900 Hamas forces.\nCurrently, there are no IDF forces in northern Gaza; the IDF finished last week several reinvasions of that area, which were carried out over recent months.\nLast week was the second time that IDF forces withdrew from northern Gaza following a staged first withdrawal sometime after mid-January.\nIn the North, the IDF said that Hezbollah attacked the Galilee, launching multiple rounds of rockets, including around 10 at a time, as well as a series of drones.", "location": "GAZA", "classification": "security", "score": 0.8913076587940812, "event_breakdown": "IDF: Southern Gaza reinvasion started in May 7; IDF withdrew from northern Gaza after battling Hamas for four months."}, {"id": "4afe20c6-ba18-4eac-90e8-b93eed23889d", "title": "Ship Security Team Appears To Detonate Explosive - Laden Houthi Drone Boat With Gunfire", "date": "2024-07-23 21:45", "url": "https://www.yahoo.com/news/ship-security-team-appears-detonate-193542934.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The embarked security team aboard the M/V Pumba destroyed a Houthi drone boat before it could cause any damage.\n“They were a correctly equipped and armed security team.”The Pumba‘s embarked security crew firing at a Houthi drone boat, bracketing it with bullets.\nUkrainian USVs have achieved success despite Russian efforts to counter them with improvements to port security and ship-board defenses opening up on them.\nIsrael, retaliating for a deadly Houthi drone attack on Tel Aviv a day earlier, said the target set was selected because it directly facilitates weapons transfers from Iran to the Houthis.\n#Yemen pic.twitter.com/MC8675KtNM — FJ (@Natsecjeff) July 23, 2024That strike lowered the bar in responses to Houthi attacks.", "location": "Israel", "classification": "security", "score": 0.9246063271170042, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. Pumba Security Team Destroys Houthi Drone Boat - The Pumba's embarked security crew successfully destroyed a Houthi drone boat, preventing any damage or harm.\n2. Ukrainian USVs Achieve Success Despite Russian Counter Efforts - Ukrainian USVs have succeeded in their operations despite Russian efforts to counter them with enhanced port security and ship-board defenses.\n3. Israel Retaliates for Houthi Drone Attack on Tel Aviv - In response to a deadly Houthi drone attack on Tel Aviv, Israel selected a target that facilitates weapons transfers from Iran to the Houthis."}, {"id": "eca27f54-737b-4f85-86e1-cd99ea9de166", "title": "Israel orders evacuation of part of Gaza humanitarian zone as war toll passes 39 , 000 Palestinians | News , Sports , Jobs", "date": "2024-07-23 18:15", "url": "https://www.newsandsentinel.com/news/local-news/2024/07/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone-as-wars-toll-passes-39000-palestinians/", "domain": "newsandsentinel.com", "domain_classification": "Unknown", "message": "The Israeli military said it is planning an operation against Hamas militants who have embedded themselves in the humanitarian zone and used it to launch rockets toward Israel.\nGaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nThe Israeli military said it was continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.\nThe Israeli military did not immediately comment.", "location": ")\nGAZA", "classification": "security", "score": 0.9675418594780032, "event_breakdown": "Israeli military planning operation against Hamas militants who have embedded themselves in the humanitarian zone in Gaza and launched rockets at Israel; Operation continuing in central and southern Gaza; Israeli Prime Minister Benjamin Netanyahu vows to wipe out Hamas’ military and governing capabilities; 39,000 Palestinians killed and 89,800 wounded during Israel’s nine-month war against Hamas in Gaza; Israeli military did not immediately comment."}, {"id": "424f9668-5cc3-45a7-b7a3-2006f2ae4043", "title": "Manchester concert bombing survivors sue conspiracy theorist for alleged harassment", "date": "2024-07-23 06:15", "url": "https://www.rappler.com/entertainment/music/manchester-concert-bombing-survivors-sue-conspiracy-theorist/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "FILE PHOTO: An Ariana Grande fan stands next to floral tributes left for the victims of an attack on concert goers at Manchester Arena, in St Ann's Square, in Manchester, Britain May 24, 2017.\nThe case bears similarities to defamation lawsuits brought against US conspiracy theorist Alex Jones by relatives of victims of the 2012 Sandy Hook school shooting.\nHall has published a book, published videos, and given talks in which he claims the Hibberts were not at the concert.\nPrice said the Hibberts were entitled to damages and an injunction to stop Hall repeating his claims about the attack.\nMartin Hibbert is due to give evidence at the trial, which is expected to conclude this week.", "location": "Manchester, United Kingdom", "classification": "security", "score": 0.4210690363064769, "event_breakdown": "File photo of police, UK\nPolice closed a major train station in Manchester, England, on Sunday after receiving reports of a suspicious package. The station was later reopened and the incident was not deemed a security threat."}, {"id": "ee1fd120-0dfb-4e31-9766-16658205ed56", "title": "Fire triggered by Russian attack eliminated in Sumy Oblast – video", "date": "2024-07-23 19:30", "url": "https://www.yahoo.com/news/fire-triggered-russian-attack-eliminated-163846266.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Fire caused by Russian attack is put out in Sumy Oblast – videoFirefighters have extinguished a fire that broke out on 23 July following a Russian airstrike on a vital infrastructure facility in Sumy Oblast.\nEmployees of the State Emergency Service immediately arrived at the scene and began extinguishing the flames.\nUsing significant numbers of personnel and appliances, the firefighters succeeded in putting out the fire.\"\nBackground:On the night of 22-23 July, the Russians launched an airstrike on critical infrastructure facilities in Shostka hromada, Sumy Oblast.\nThe Ministry of Energy reported that Russia launched a drone attack on an energy facility in Sumy Oblast, causing power outages at several substations and affecting consumers in both Sumy and Chernihiv oblasts.", "location": "Shostka", "classification": "security", "score": 0.8331795505173976, "event_breakdown": "An airstrike on critical infrastructure facilities in Shostka, Sumy Oblast."}, {"id": "4e19e5b3-ac1d-4bfa-95ea-fa07caaa7d59", "title": "Ex - Houthi official says Tel Aviv drone attack was  a grave mistake  ", "date": "2024-07-23 18:15", "url": "https://www.thejc.com/news/israel/houthi-official-said-tel-aviv-drone-attack-was-a-grave-mistake-fc5j4lv4", "domain": "thejc.com", "domain_classification": "Unknown", "message": "Instead, he argued, entering a direct confrontation with Israel endangers the Yemeni civilian population, which is already dealing with its own humanitarian crisis.\n\"The Houthis are exploiting tens of millions of Yemenis as human shields when they fire rockets and kill Israeli civilians,” he said.\nThe core conflict is between Israel and the Palestinians; we have no direct dispute with Israel.”The former official added that the Houthis lack even a basic air defense system to protect civilians from retaliatory attacks from Israel.\nIsraeli airstrikes shook the Red Sea port city of Hodeida on 20 July, just a day after a Houthi drone killed one person and injured a dozen more in Tel Aviv.\nThe Israeli attack, described by the IDF as a “response to the hundreds of attacks carried out against the state of Israel in recent months,” targeted military assets used by the Iran-backed terror group.", "location": "Hodeida", "classification": "security", "score": 0.9291262593408701, "event_breakdown": "Israeli airstrikes target military assets used by Houthi militants in Hodeida, Yemen on 20 July."}, {"id": "02017c28-7564-4693-bb9f-236acd091057", "title": "Hezbollah Is Prepared For War With Israel", "date": "2024-07-23 22:45", "url": "https://www.shtfplan.com/headline-news/hezbollah-is-prepared-for-war-with-israel", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "Hezbollah is prepared for a war with Israel.\nSince October 8th, when Hezbollah first fired rockets into Israel in solidarity with Palestinians following the Hamas attacks, the two sides have exchanged nearly 5,000 strikes.\nHezbollah is siding with Hamas as Israel fights to destroy the group and eradicate it from the planet.\nU.S. State Department Says Israel “Unlikely” To Eradicate HamasNew information from Sky News claims that Hezbollah is now changing its tactics and preparing for a global war with Israel.\nAfter about nine months of what the mainstream media is calling “low-level conflict” with Hezbollah, Israel is at risk for a full-scale war with Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.5287176151008627, "event_breakdown": "US: Israel “Unlikely” To Eradicate Hamas\nIsrael Engaged in Potential Full-Scale War with Lebanon\nBottom Line:\nIsrael is at risk for a potential war after nine months of what the mainstream media is calling “low-level conflict” with Hezbollah."}, {"id": "cb99577e-6134-4e5c-8092-095893ed9feb", "title": "Moscow warns of retaliation over U . S . missile deployment in Germany – NaturalNews . com", "date": "2024-07-23 05:45", "url": "https://www.naturalnews.com/2024-07-22-moscow-warns-retaliation-us-missile-deployment-germany.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "Moscow warns of retaliation over U.S. missile deployment in GermanyMoscow has officially warned that it will leave all options on the table in response to the planned deployment of U.S. nuclear-capable Tomahawk and hypersonic missiles in Germany.\nThe Soviet Union and the United States signed the Intermediate-Range Nuclear Forces Treaty in 1987 to eliminate land-based nuclear weapons platforms in the 500-5,000 km range, with the agreement designed to reduce nuclear risks in Europe.\nMore related stories:Russia claims U.S.-led peace talks with Ukraine merely a DECOY to distract from West’s main goal of destroying Moscow.\nRussia informs U.S. ambassador \"We are no longer at peace\" in chilling message following Crimea attack carried out with U.S.-made weapons.\nRussia blames the U.S. for Ukrainian missile attack on Crimea.", "location": "BERLIN", "classification": "security", "score": 0.8356133868337947, "event_breakdown": "Moscow has officially warned that it will leave all options on the table in response to the planned deployment of U.S. nuclear-capable Tomahawk and hypersonic missiles in Germany. Russia has blamed the U.S. for Ukrainian missile attack on Crimea."}, {"id": "8ea9a69d-10fc-4151-803b-0a14dafa5244", "title": "Russian attacks against Ukraine injure 36 over past day", "date": "2024-07-23 09:00", "url": "https://www.yahoo.com/news/russian-attacks-against-ukraine-injure-080215122.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian attacks across Ukraine injured at least 36 people over the past day, including children, regional authorities reported early on July 23.\nIn Dnipropetrovsk Oblast, five people were injured during Russian attacks against the Nikopol district, Governor Serhii Lysak said.\nIn Donetsk Oblast, 15 people were injured during Russian strikes over the past day, according to Governor Vadym Filashkin.\nThree women and one man were injured during Russian attacks across the oblast on July 22, Syniehubov reported.\nRussian attacks against Kherson Oblast injured seven people over the past day, Governor Oleksandr Prokudin said.", "location": "ODESSA", "classification": "security", "score": 0.8925483665812042, "event_breakdown": "Target event not found."}, {"id": "93f2de54-c2aa-49bc-8d6f-5e6e79e3f07d", "title": "Yemen Houthis Pledge  Huge  Response To Israel Strike As Gaza Violence Spreads", "date": "2024-07-23 05:45", "url": "https://menafn.com/1108469644/Yemens-Houthis-Pledge-Huge-Response-To-Israel-Strike-As-Gaza-Violence-Spreads", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Israel bombed the Palestinian territory, Lebanon and Yemen in quick succession this week in response to from Iran-backed groups.\nThe deadly strikes in Gaza came hours after Hizbollah and its ally Hamas said they fired at Israeli positions from south Lebanon, while Yemen's Houthi rebels vowed to respond to Israeli warplanes hitting a key port.\nOn Sunday, Houthi military spokesperson Yahya Saree said the rebel's“response to the Israeli aggression against our country is inevitably coming and will be huge”.\nIn Hodeida, three people were killed and 87 wounded, health officials said in a statement carried by Houthi media.\nFirefighters struggled to contain the massive blaze caused by the strike on Hodeida, with a port employee saying fuel storage tanks and a power plant were still on fire on Sunday.", "location": "Hodeida, Yemen", "classification": "security", "score": 0.9252324498057996, "event_breakdown": "Israel-Gaza Border, Lebanon, Hodeidah, Yemen"}, {"id": "6c5e4782-1b14-4217-986b-e1f3835fc5c3", "title": "Ukraine air defence downs seven Shahed drones attacking Sumy Oblast", "date": "2024-07-23 07:15", "url": "https://www.yahoo.com/news/ukraines-air-defence-downs-seven-051856427.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians attacked Ukraine with a Kh-69 guided missile and eight Shahed drones on the night of 22-23 July.\nUkraine’s air defence has managed to down seven Russian drones and the missile did not reach its target.\nSource: Ukraine's Air ForceQuote: \"Air defence downed seven enemy Shahed-131/136 attack UAVs.\nDetails: The missile and Shahed drones were launched from the airspace of Russia's Kursk Oblast.\nMobile fire group units from Ukraine’s defence forces and electronic warfare units of the Air Force were involved in repelling the attack.", "location": ")\nRUSSIA", "classification": "security", "score": 0.952647194303079, "event_breakdown": "TARGET:\nUkraine's air defence downed seven Russian drones and the missile did not reach its target during the night of 22-23 July."}, {"id": "cf38064e-947a-4906-b643-ccb331212e52", "title": "Day 291 of Genocide : Israeli Occupation Forces Kill Palestinians in Several Gaza Areas", "date": "2024-07-23 12:45", "url": "https://english.almanar.com.lb/2158125", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "A grieving couple mourning their little baby, killed by indiscriminate Israeli airstrikes in Gaza.\nUpdate: Death toll from the Israeli military assault on Khan Yunis city has risen to 77.\nIsraeli occupation aircraft also targeted a house belonging to Al-Jamasi family on Al-Nafaq Street in Al-Sahaba area, killing four citizens and wounding others.\nAn Israeli occupation aircraft targeted the home of the Abu Jalhoum family in the Al-Alami area of Jabalia camp, resulting in 4 martyrs and several injuries.\nThousands of Palestinians were displaced from the east of khan Younis following the attack by the occupation forces.", "location": "GAZA CITY.", "classification": "security", "score": 0.9973561702213183, "event_breakdown": "Israeli airstrikes on Khan Yunis city in the Gaza Strip have killed 77 people, mostly civilians. The Israeli occupation forces also targeted the homes of several families, resulting in numerous casualties. The Israeli military also targeted the headquarters of the Al-Jazeera television network in the Qatari capital of Doha, killing a journalist."}, {"id": "0c838934-10ce-46cf-bbe8-1d2d0c3708b1", "title": "Ukrainian Forces Hit Crimean Railway Ferry", "date": "2024-07-23 11:15", "url": "https://charter97.org/en/news/2024/7/23/603911/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ukrainian Forces Hit Crimean Railway Ferry 12 23.07.2024, 10:0241,514ILLUSTRATIVE PHOTOAmbulances and firefighters are heading towards the Kavkaz port.\nOn the morning of Tuesday, July 23, the Kavkaz port in the Krasnodar region of the Russian Federation was attacked.\nThe Crimean Wind Telegram channel reports that it was a strike on the railway ferry.\nIt is also reported that after the explosion, ambulances and firefighters were driving towards the Kavkaz port.\nEarlier it was reported about a loud explosion in Kerch, after which the traffic at illegally built Crimean Bridge was closed.", "location": "KERK, CRIMEA", "classification": "security", "score": 0.946852141502141, "event_breakdown": "Crimean railway ferry hit by Ukrainian Forces 07/23/24\nKavkaz port in the Russian Federation targeted by Ukrainian Forces 07/23/24"}, {"id": "b63b8225-fb88-4bcc-a352-4776ccedbf23", "title": "July 22 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-07-23 10:15", "url": "http://www.presstv.ir/Detail/2024/07/23/729893/july-22-axis-resistance-ops-against-israeli-occupation", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Detonated an explosive device on an Israeli military D9 bulldozer in the Muqata'a axis.\nTargeted Israeli forces penetrating northeast of Bureij camp in the middle of the Gaza Strip with mortar shells.\nShelled Israeli military gatherings on the supply line in the \"Netzarim\" axis with a barrage of 107mm rockets.\nMartyr Abu Ali Mustafa Brigades’ operations on July 22:Targeted a convoy of Israeli military vehicles in the city of Tulkarem with several explosive devices.\nMujahideen Brigades’ operations on July 22:Launched Haseb 111 rockets at Israeli forces stationed in the so-called \"Netzarim Axis\".", "location": "NULL", "classification": "security", "score": 0.9991391916361565, "event_breakdown": "Targeted Israeli forces penetrating northeast of Bureij camp in the middle of the Gaza Strip with mortar shells.\nMartyr Abu Ali Mustafa Brigades’ operations on July 22:Targeted a convoy of Israeli military vehicles in the city of Tulkarem with several explosive devices.\nMujahideen Brigades’ operations on July 22:Launched Haseb 111 rockets at Israeli forces stationed in the so-called \"Netzarim Axis\"."}, {"id": "3eba0c06-6bf1-46ab-8023-db9e2d02ff3d", "title": "Girls school blown up in Waziristan", "date": "2024-07-23 04:30", "url": "https://www.thenews.com.pk/print/1212468-girls-school-blown-up-in-waziristan", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "A representational image showing debris of a school blown up by militants in North Waziristan.\n— The News/Rasool Dawar/FileMIRANSHAH: Suspected militants destroyed a portion of a government-run girls’ school in a village of Mir Ali tehsil in North Waziristan tribal district, local police said on Monday.\nNo militant group or individual claimed responsibility for the subversive act in the volatile tribal district.\nThe bombing of schools has put a question mark over the government’s claims that the erstwhile Fata, particularly the North Waziristan tribal district, has been cleared of militants.\nOver 1,600 schools have been destroyed in the tribal belt during the last one decade.", "location": "Mir Ali", "classification": "security", "score": 0.9883663391773327, "event_breakdown": "Target Event:\nBombing of a girls' school in North Waziristan's Mir Ali tehsil. No group has claimed responsibility."}, {"id": "36771f42-c624-40cf-bfc1-749c84ca2483", "title": "Assault suspect shot by Mineral County Sheriff deputy has been identified", "date": "2024-07-23 22:30", "url": "https://www.kxlh.com/news/crime-and-courts/assault-suspect-shot-by-mineral-county-sheriffs-deputy-has-been-identified", "domain": "kxlh.com", "domain_classification": "Unknown", "message": "MISSOULA — Authorities have released the name of a man who was shot and killed in an officer-involved shooting on Sunday in Mineral County.\nMissoula County Sheriff and Coroner Jeremiah Petersen has identified the man as 68-year-old Richard C. Smith of Missoula.\nThe Mineral County Sheriff's Office previously reported the shooting happened at approximately 11 a.m. in the Fish Creek area and that the suspect, now identified as Smith had been involved in a stabbing and kidnapping.\nThe Mineral County Sheriff's Office reports the shooting happened at about 11 a.m. in the Fish Creek area.\nThe Montana Department of Criminal Investigations, Missoula County Sheriff's Office detectives, and a Missoula Police Department detective were called to process the scene.", "location": "Fish Creek area", "classification": "security", "score": 0.9037251764529383, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nSmith, Richard C. (68): A man was shot and killed by officers at the Fish Creek area in Mineral County, Montana, on Sunday, June 5, 2022 at 11 a.m. He had been involved in a stabbing and kidnapping, per the Mineral County Sheriff's Office."}, {"id": "89b04954-4f95-444b-a28c-081cb22a8eec", "title": "Russian air attack damages critical infrastructure in Sumy region , Ukraine officials say", "date": "2024-07-23 05:45", "url": "https://www.marketscreener.com/news/latest/Russian-air-attack-damages-critical-infrastructure-in-Sumy-region-Ukraine-officials-say-47439946/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "(Reuters) -A Russian overnight air attack damaged an energy facility in Ukraine's northern Sumy region, cutting power to 50,400 consumers, Ukrainian officials said.\nUkraine's air force said on Telegram that its air defence systems destroyed seven out of the eight Russia-launched drones.\nRussia also sent a Kh-69 guided air missile, the air force said, but added that as a result of its forces' countermeasures, the missile \"did not reach its target\".\nAccording to its statement on Telegram, power has so far been restored to about 24,500 consumers.\nRussia renewed its long-range strikes on Ukraine's energy infrastructure this spring, targeting thermal and hydropower stations as well as gas storage facilities.", "location": "SUMY", "classification": "security", "score": 0.7419908792920122, "event_breakdown": "Event 1: Russian overnight air attack damaged an energy facility in Ukraine's northern Sumy region, cutting power to 50,400 consumers.\nEvent 2: Ukrainian air force said that its air defence systems destroyed seven out of the eight Russia-launched drones.\nEvent 3: Ukraine said that Russia sent a Kh-69 guided air missile which \"did not reach its target\"."}, {"id": "1046377f-726a-4b29-8c17-b4a05f07a6ae", "title": "Russian air attack damages critical infrastructure in Sumy region , Ukraine officials say", "date": "2024-07-23 07:45", "url": "https://www.swissinfo.ch/eng/russian-air-attack-damages-critical-infrastructure-in-sumy-region%2c-ukraine-officials-say/84708480", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russian attack damages energy facility, cuts power in Ukraine’s Sumy region1 minute(Reuters) -A Russian overnight air attack damaged an energy facility in Ukraine’s northern Sumy region, cutting power to 50,400 consumers, Ukrainian officials said.\nUkraine’s air force said on Telegram that its air defence systems destroyed seven out of the eight Russia-launched drones.\nThe energy ministry that reported power cuts did not specify the weapon that damaged the facility.\nAccording to its statement on Telegram, power has so far been restored to about 24,500 consumers.\nRussia renewed its long-range strikes on Ukraine’s energy infrastructure this spring, targeting thermal and hydropower stations as well as gas storage facilities.", "location": "SUMY", "classification": "security", "score": 0.8801006521301895, "event_breakdown": "Russian attack damages energy facility, cuts power in Ukraine’s Sumy region."}, {"id": "cae43add-1115-4d39-8788-932957d24b69", "title": "He was on day release for murder - but stabbed his colleague more than 70 times with a screwdriver", "date": "2024-07-23 10:15", "url": "https://www.walesonline.co.uk/news/uk-news/day-release-murder-stabbed-colleage-29593604", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "More infoA murderer out on day release stabbed a colleague more than 70 times with a screwdriver after being obsessed with her.\nFor the latest court reports, sign up to our crime newsletter hereOn April 9, 2023 the victim had told Fryers, 57, that she no longer wanted to be friends with him.\nThe defendant later told her he was leaving the site, and told her to remove her possessions from his car.\nAs they walked to the vehicle, Fryers attacked her with a screwdriver, stabbing the 24-year-old repeatedly in the head, chest and back.\nIt is with only sheer luck that the victim did not lose her life on the night of this incident.", "location": "GRAYS, Thurrock, England", "classification": "security", "score": 0.49265284229518186, "event_breakdown": "Target Event:\nOn April 9, 2023, a murderer stabbed a colleague more than 70 times with a screwdriver after being obsessed with her."}, {"id": "65561d9d-59ab-4cd7-a944-c9151383bafc", "title": "Scores killed in Israeli attacks , medics say , after IDF orders evacuation of Gaza humanitarian zone", "date": "2024-07-23 01:30", "url": "https://www.aol.co.uk/news/israel-attacks-humanitarian-areas-southern-123822914.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "The military claimed Hamas militants in Khan Younis and part of Al-Mawasi were using the area to launch rockets at Israel.\nThe Israeli military did not offer comment on the toll, when asked by Agence France-Presse.\nThe local Wafa news agency reported that a series of fierce bombardments began immediately after Israeli forces dropped leaflets telling people to evacuate.\nWounded people poured into Nasser hospital in Khan Younis as the facility appealed for blood donations.\nImages from Khan Younis showed Palestinians fleeing the area in cars and on donkey carts, using whatever means they could find to escape.", "location": "GAZA CITY.", "classification": "security", "score": 0.8695802382675749, "event_breakdown": "The military pounded Khan Younis, a city in southern Gaza, and Al-Mawasi with heavy airstrikes."}, {"id": "7a4915c3-ca86-4475-90dc-4c80caf155d9", "title": "Hezbollah Has the Firepower to Ambush Israeli Tanks in Lebanon", "date": "2024-07-23 18:45", "url": "https://www.businessinsider.com/hezbollah-has-the-firepower-to-ambush-israeli-tanks-in-lebanon-2024-7", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Towards the end of their 34-day war in 2006, the Israeli Army sent tanks into southern Lebanon.\nAdvertisement\"Out of the 400 tanks involved in the fighting in southern Lebanon, 48 were hit, 40 were damaged, and 20 penetrated.\nIsraeli tanks suffered losses to Hezbollah during their 2006 war in Lebanon.\nAny cross-border incursion by Israeli armor would undoubtedly have cover and protection from accompanying infantry, artillery, aircraft, and drones.\n\"The idea is that the first missile is taken out by an Israeli tank's Trophy defense system, but (that active protection system) doesn't have time to counter the second missile.", "location": "Lebanon", "classification": "security", "score": 0.9199782761651454, "event_breakdown": "Israeli Army sends tanks into southern Lebanon at the end of their 34-day war."}, {"id": "394e7d01-61cb-4aba-92d6-fcc71199bb3f", "title": "More than $1 , 500 stolen after victim struck with gun during armed robbery in Myrtle Beach", "date": "2024-07-23 20:45", "url": "https://www.yahoo.com/news/more-1-500-stolen-victim-192737228.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "More than $1,500 stolen after victim struck with gun during armed robbery in Myrtle BeachThree men were arrested for stealing over $1,500 during an armed robbery in downtown Myrtle Beach near the Boardwalk, according to Myrtle Beach Police reports.\nChazman Wells, Laquan Whitaker and Quinzell Whitaker were arrested on July 21 for armed robbery and possession of a weapon during a violent crime, according to Horry County booking.\nThe victim flagged down a Myrtle Beach Police officer around Sugar Twist Ice Cream, 706 N. Ocean Blvd., to say he had been beaten and robbed early Sunday morning.\nThe suspects allegedly hit the victim in the back of the head with a pistol and stole around $1,500 and a $20 wallet, the report said.\nLaquan, 30, and Quinzell, 23, are being held at J. Reuben Long Detention Center.", "location": "Myrtle Beach", "classification": "security", "score": 0.8250774653344428, "event_breakdown": "Chazman Wells, Laquan Whitaker, and Quinzell Whitaker were arrested on July 21 for armed robbery and possession of a weapon during a violent crime, according to Horry County booking records and Myrtle Beach Police reports. The incident took place near Sugar Twist Ice Cream at 706 N. Ocean Blvd. in Myrtle Beach."}, {"id": "4fde990f-deb6-4153-b992-c73d53ef5d26", "title": "Woman Viscously Attacked Inside Massive San Antonio Movie Theatre", "date": "2024-07-23 01:30", "url": "https://kqvt.com/woman-violently-attacked-inside-san-antonio-movie-theatre/", "domain": "kqvt.com", "domain_classification": "Unknown", "message": "A woman was surprisingly attacked inside a San Antonio movie theater while alone.\nA VIOLENT ATTACK INSIDE THE PALLADIUMA little over a year ago, there was another shocking attack inside San Antonio's Palladium that left one woman in critical condition.\nVISITING THE THEATRE WITH SPURS PLAYERThe woman was identified as 32-year-old Sydney Bosworth.\nAccording to MSN, the woman was actually at the movie theatres with San Antonio Spurs player Jakob Poeltl.\nRead More: Savage Stabbing in San Antonio Movie Theatre", "location": "San Antonio, Texas", "classification": "security", "score": 0.8884773776120819, "event_breakdown": "On January 23rd, 2022, a woman was attacked by a man with an ax in Buryatia, Russia. The attack took place near the local public garden, and the woman was hospitalized with several injuries. The suspect was later arrested by police."}, {"id": "62ba91f6-0e26-4802-b77a-10ca8d6fc497", "title": "Woman Viscously Attacked Inside Massive San Antonio Movie Theatre", "date": "2024-07-23 01:30", "url": "https://kixs.com/ixp/178/p/woman-violently-attacked-inside-san-antonio-movie-theatre/", "domain": "kixs.com", "domain_classification": "Unknown", "message": "A woman was surprisingly attacked inside a San Antonio movie theater while alone.\nA VIOLENT ATTACK INSIDE THE PALLADIUMA little over a year ago, there was another shocking attack inside San Antonio's Palladium that left one woman in critical condition.\nVISITING THE THEATRE WITH SPURS PLAYERThe woman was identified as 32-year-old Sydney Bosworth.\nAccording to MSN, the woman was actually at the movie theatres with San Antonio Spurs player Jakob Poeltl.\nRead More: Savage Stabbing in San Antonio Movie Theatre", "location": "SAN ANTONIO.", "classification": "security", "score": 0.8884773776120819, "event_breakdown": "On Tuesday, May 24, 2022, a 32-year-old woman survived being thrown onto the trackbed and into the path of an approaching London Underground train at Elephant & Castle tube station, south London. The station serves as the northern terminus for the Bakerloo line, as well as the main line of London Overground's South London Line.  There is no indication as yet of a motive, though British Transport Police (BTP) suggest it is  \"difficult to comprehend how anyone could deliberately take steps that would result in them being hit by a train.\" according to police.\nLewisham college shooting: police launch murder inquiry after teenager shot dead on london streets\nMurder detectives have been called in to investigate the death of a teenager who was gunned down in broad daylight on the London streets. The 19-year-old was targeted by dead in a disturbing attack in Lewisham yards in front of a town square in Flockharton, south of London, on February 24, 2022."}, {"id": "ad6e87ba-852a-4a39-af5d-30f9b108ae7a", "title": "Newcastle thug lunged at man and stabbed him following  family feud  ", "date": "2024-07-23 07:45", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-thug-lunged-man-stabbed-29588217", "domain": "chroniclelive.co.uk", "domain_classification": "Unknown", "message": "More infoA man left his victim with a fractured rib and a punctured lung after stabbing him in Newcastle.\nRichard Gowland \"lunged\" at the man and stabbed him following an argument with the victim's partner inside a shop.\nThe court heard that the victim's partner had known Gowland, and that there were \"historic issues\" with her, Gowland and her family.\nHe pulled out an object and lunged forward [at the victim], stabbing him under the armpit.\"\nGlenn Gatland, defending, said Gowland had \"expressed genuine remorse\" and said there had been incidents in the past regarding his family and the family of the victim's partner.", "location": "NEWCASTLE", "classification": "security", "score": 0.7856546444385605, "event_breakdown": "Newcastle s stabbing"}, {"id": "c23c873c-ae84-4b08-b713-00ced57a4979", "title": "EXCLUSIVE : Trump shooter father returns to public life , says  we just want to try to take care of ourselves  ", "date": "2024-07-23 15:15", "url": "https://www.foxnews.com/us/exclusive-trump-shooters-father-returns-public-life-says-we-just-want-try-take-care-ourselves", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Snipers killed Crooks after the Bethel Park resident nicked Trump's ear, killed bystander Corey Comperatore and injured two others at the July 13 rally, David Dutch and James Copenhaver.\nThe man locals identified as the father and a masked woman he was with declined to answer questions when approached by Fox News Digital.\nIt is unclear whether they knew that he was in possession of the AR-15 registered to his father.\nBoth Matthew and Mary Crooks are licensed as professional counselors, according to the Pennsylvania Department of State Licensing System Verification Service.\nCrooks reportedly planned to enroll at Robert Morris University after being accepted there and at and the University of Pittsburgh.", "location": "PITTSBURGH", "classification": "security", "score": 0.7312668392321362, "event_breakdown": "Target event not found"}, {"id": "888e4928-b12f-474e-acdb-4e99c10f56b4", "title": "Israel Netanyahu says deal could be near for hostages in Gaza", "date": "2024-07-23 12:15", "url": "https://gazette.com/news/us-world/israels-netanyahu-says-deal-could-be-nearing-for-hostages-in-gaza/article_e8b261de-3cae-5ebe-a744-3e5ef075999c.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "\"For us, the most basic of essentials in our lives are not available,\" a woman, Ibtihal Al-Breim, told Reuters in Khan Younis.\nThe Israeli military said dozens of militants had been killed in Khan Younis by its tanks and warplanes or in close-quarter combat.\nResidents in Khan Younis said tanks remained stationed deep inside Bani Suhaila, east of downtown Khan Younis.\nCEASEFIRE HOPESIsraeli Prime Minister Benjamin Netanyahu, who is in Washington this week, told families of hostages held in Gaza that a deal that would secure their release could be near.\n(Reporting by Nidal al-Mughrabi in Cairo, Maayan Lubell in Jerusalem and Husam Al-Masri in Khan Younis, Gaza StripAdditional reporting by Ahmed Mohamed Hassan in CairoEditing by Angus MacSwan, Gareth Jones, Peter Graff)", "location": "Khan Younis, Gaza Strip", "classification": "security", "score": 0.5008920438063127, "event_breakdown": "Israeli air strikes hit a site in Gaza City on Tuesday and three Islamist militants were killed in clashes with Israeli forces near the southern town of Khan Younis, Palestinian medical workers and residents said."}, {"id": "f40d2609-3867-4efa-9991-9337abfc6c57", "title": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expected", "date": "2024-07-23 17:00", "url": "https://www.swissinfo.ch/eng/israel-tanks-advance-deeper-in-southern-gaza-as-more-ceasefire-talks-expected/84710501", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expected5 minutesBy Nidal al-Mughrabi, Maayan Lubell and Hussam Al-MasriCAIRO/JERUSALEM/GAZA (Reuters) -Palestinian residents of eastern neighbourhoods of Khan Younis in the southern Gaza Strip fled their homes on Tuesday as Israeli tanks advanced deep into the area after Israel ordered the population to evacuate.\n“For us, the most basic of essentials in our lives are not available,” a woman, Ibtihal Al-Breim, told Reuters in Khan Younis.\nThe Israeli military said dozens of militants had been killed in Khan Younis by its tanks and warplanes or in close-quarter combat.\nResidents in Khan Younis said tanks remained stationed deep inside Bani Suhaila, east of downtown Khan Younis.\n(Reporting by Nidal al-Mughrabi in Cairo, Maayan Lubell in Jerusalem and Husam Al-Masri in Khan Younis, Gaza StripAdditional reporting by Ahmed Mohamed Hassan in CairoEditing by Angus MacSwan, Gareth Jones, Peter Graff)", "location": "GAZA", "classification": "security", "score": 0.9216277867039354, "event_breakdown": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expected"}, {"id": "36282d2b-f025-48f2-87de-3d17949f9486", "title": "Counter - Terrorism : Unexpected Red Sea Naval War", "date": "2024-07-23 06:00", "url": "http://www.strategypage.com/htmw/htterr/articles/202407230263.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "Most of the food aid comes in via the Red Sea port of Hodeida, which is controlled by the Houthi rebels.\nThis self-destructive attitude by the Shia rebels was also present among the separatist Sunni tribes in the south.\nISIL lost this war and some ISIL factions are known to be hiding out in Shia rebel territory.\nMost of the food aid comes in via the Red Sea port of Hodeida, which is controlled by the Houthi rebels.\nISIL lost this war and some ISIL factions are known to be hiding out in Shia rebel territory.", "location": "YEMEN", "classification": "security", "score": 0.5333508699981833, "event_breakdown": "Hodeida, Shia rebels, ISIL."}, {"id": "2d18c10b-f638-4c45-a535-8aa809b3b7a9", "title": "Bangkok Post - Motorists warned after bomb blast on main road in Pattani", "date": "2024-07-23 05:45", "url": "https://www.bangkokpost.com/thailand/general/2833863/motorists-warned-after-bomb-blast-on-main-road-in-pattani", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Motorists warned after bomb blast on main road in PattaniThe armoured police pickup truck was thrown off Road 42 by the bomb explosion in Nong Chik district in Pattani on Monday night that injured six policemen.\n(Photo: Abdullah Benjakat)PATTANI: The army has advised motorists to be vigilant while travelling a section of the main road through this southernmost province after a roadside bomb injured six policemen on Monday night.\nThe Internal Security Operations Command's (Isoc) southern frontline office said on Tuesday the bomb exploded on Road 42 in Nong Chik district.\nThe bomb went off as an armoured pickup carrying six policemen went past.\nRoad 42 is a main road linking Songkhla and the three other southernmost provinces of Narathiwat, Pattani and Yala.", "location": "PATTANI", "classification": "security", "score": 0.9983843199012075, "event_breakdown": "6 policemen injured in bomb attack on Road 42 in Pattani"}, {"id": "99c58863-6a3a-4e28-b628-77b79fdda081", "title": "Secret Service  failed  in mission to protect Trump , admits director - Newspaper", "date": "2024-07-23 03:15", "url": "https://www.dawn.com/news/1847453/secret-service-failed-in-mission-to-protect-trump-admits-director", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "WASHINGTON: US Secret Service Director Kimberly Cheatle acknowledged on Monday that the agency failed in its mission to prevent the assassination attempt on former president Donald Trump.\n“The Secret Service’s solemn mission is to protect our nation’s leaders,” Cheatle said during testimony before the House Committee on Oversight and Accountability.\n“As director of the United States Secret Service, I take full responsibility for any security lapse.” But she rejected a wave of bipartisan calls for her resignation.\nCrooks, who was perched on the roof of a nearby building with a clear sightline of the stage, was shot dead by a Secret Service sniper 26 seconds after firing the first of eight shots.\nTwo rally attendees were seriously wounded in the shooting and a 50-year-old firefighter, Corey Comperatore, of Freeport, Pennsylvania, was shot dead.", "location": "WASHINGTON: washington dc usa", "classification": "security", "score": 0.5267864843721068, "event_breakdown": "Current events of security reported in text are:\n1. Security lapse in the assassination attempt on former president Donald Trump\nSecret Service Director Kimberly Cheatle acknowledged that the agency failed in its mission to by preventing the assassination attempt on former president Donald Trump."}, {"id": "f4a9bd40-40eb-48f4-87aa-17ad901c57fe", "title": "One person killed after altercation in Desert Hot Springs , juvenile suspect arrested", "date": "2024-07-23 03:00", "url": "https://kesq.com/news/2024/07/19/one-person-killed-after-altercation-in-desert-hot-springs-juvenile-suspect-arrested/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "Update 7/22/24Police confirmed that a juvenile suspect was arrested in connection with the incident.\nOriginal Report 7/19/24At 9:28 P.M., officers from the Desert Hot Springs Police Department responded to reports of an assault in the area of Luis Dr. and Two Bunch Palms, across from Desert Springs Middle School in Desert Hot Springs.\nUpon arrival, deputies determined that an altercation had taken place and located an individual who was bleeding.\nAccording to Desert Hot Springs Police Chief Jim Henson, this incident is a separate incident from Wednesday's shooting, but took place in the same location.\nRiverside County Sheriff's Office deputies are assisting Desert Hot Springs Police with the case by directing traffic and blocking off roads.", "location": "DESERT HOT SPRINGS", "classification": "security", "score": 0.8861315923644009, "event_breakdown": "Update 7/22/24: Police have arrested a juvenile suspect in connection with the incident.\n\nOriginal Report 7/19/24: Desert Hot Springs Police Department officers responded to reports of an assault in the area of Luis Dr. and Two Bunch Palms, across from Desert Springs Middle School in Desert Hot Springs. Upon arrival, deputies determined that an altercation had taken place and located an individual who was bleeding. According to Desert Hot Springs Police Chief Jim Henson, this incident is a separate incident from Wednesday's shooting, but took place in the same location. Riverside County Sheriff's Department deputies are assisting Desert Hot Springs Police with the case by directing traffic and blocking off roads.\nNote: This response is relevant to the target event and is a report on a current event that is happening in real time and belongs to the security category."}, {"id": "ef404870-6df0-4720-aebb-3b06836d6185", "title": "Israel sends tanks back into Khan Younis area , 70 killed after new evacuation order", "date": "2024-07-23 05:00", "url": "https://dunyanews.tv/en/World/825897-Israel-sends-tanks-back-into-Khan-Younis-area--70-killed-after-new-evacu", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israel sends tanks back into Khan Younis area, 70 killed after new evacuation orderWorld World Israel sends tanks back into Khan Younis area, 70 killed after new evacuation orderThe Palestinians were killed by tank salvoes in the town of Bani Suhaila and other townsFollow on Published On: Tue, 23 Jul 2024 09:24:44 PKTCAIRO/JERUSALEM/GAZA (Reuters) – Israel sent tanks back into the greater Khan Younis area after ordering evacuations of some districts it said had been used for renewed attacks by militants and at least 70 Palestinians were killed by Israeli fire, Gaza medics said on Monday.\nThe Palestinian Red Crescent Society said two of its clinics located in eastern Khan Younis had been knocked out of operation because of the new offensive.\nAt Khan Younis' Nasser Hospital, some people stood outside the morgue to bid farewell to dead relatives.\nEVACUATION ORDERSEarlier on Monday, the Israeli military said it had issued new evacuation orders due to renewed Palestinian militant attacks, including rockets launched from the targeted areas in eastern Khan Younis.\nHealth officials at Nasser Hospital in Khan Younis urged residents on Monday to donate blood because of the large number of casualties being rushed to the medical centre.", "location": "GAZA", "classification": "security", "score": 0.858801769592046, "event_breakdown": "Israel sends tanks back into Khan Younis area, 70 killed after new evacuation order."}, {"id": "4b4a0d95-ea32-4cb7-9957-af38d45db033", "title": "Report : Man accused of stabbing 68 - year - old in Boston found not guilty", "date": "2024-07-23 01:15", "url": "https://www.boston.com/news/local-news/2024/07/22/report-man-charged-in-stabbing-of-68-year-old-in-roxbury-found-not-guilty/", "domain": "boston.com", "domain_classification": "Unknown", "message": "Local News Report: Man charged in stabbing of 68-year-old in Roxbury in 2022 found not guilty Ranlee Flores was found not guilty by a jury last month.\nA Boston man accused in the stabbing of a 68-year-old woman in Roxbury in 2022 has been found not guilty on all charges, WHDH reports.\nAuthorities alleged that Ranlee Flores stabbed the woman on Deckard Street in December 2022 while she was handling belongings near the back of her SUV.\nFlores was arrested a few days later on outstanding warrants stemming from separate incidents and he was charged in the stabbing.\nAccording to WHDH, a jury found Flores not guilty in June on the two charges he faced in the stabbing.", "location": "Boston", "classification": "security", "score": 0.6961832069575956, "event_breakdown": "Man charged in stabbing of 68-year-old in Roxbury in 2022 found not guilty"}, {"id": "de81060e-0190-4d58-bfa0-ff4aead97fab", "title": "Man fights for life after stabbing at London Underground station - as two women arrested", "date": "2024-07-23 13:15", "url": "https://www.lbc.co.uk/news/man-fights-for-life-seven-sisters-attack-women-arrested/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Man fights for life after stabbing at London Underground station - as two women arrestedA man has been left fighting for life after being attacked at Seven Sisters.\nPicture: @sobradobBy Asher McShaneTwo women have been arrested after a man was left fighting for life after an attack at a London Tube station.\nEmergency services rushed to Seven Sisters underground in north London this morning where they found a man had been stabbed.\n\"The underground station remains closed while officers investigate, and passengers will see an increased policing presence in the area.\n\"The underground station remains partially closed while officers investigate, and passengers will see an increased policing presence in the area.\"", "location": "Seven Sisters", "classification": "security", "score": 0.8289530448732028, "event_breakdown": "Man fights for life after stabbing at London Underground station - as two women arrested"}, {"id": "c16b3e7c-f04c-49ed-bf0f-876d31682140", "title": "National Guard Destroy 22 Russian Tanks At Front In Two Weeks", "date": "2024-07-23 05:45", "url": "https://menafn.com/1108469798/National-Guard-Destroy-22-Russian-Tanks-At-Front-In-Two-Weeks", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) During two weeks of combat operations at the front, the National Guard destroyed 22 tanks and 60 units of Russian armored vehicles.\nThis was reported by the of Internal Affairs Ihor Klymenko on Telegram , Ukrinform reports.\nOver 30,000 Russian Guard currently deployed to Ukraine - UK intelligenceIn addition, according to him, the National Guard destroyed 206 enemy artillery systems, 161 vehicles, 36 electronic warfare systems, and 35 enemy ammunition depots in two weeks.\nThe Guardsmen also destroyed 268 enemy dugouts and infantry concentrations.", "location": "N/A", "classification": "security", "score": 0.8224430652885842, "event_breakdown": "National Guard destroys 22 tanks and 60 armored vehicles during two weeks of combat operations at the front."}, {"id": "dd4bd7bf-b19f-4f2d-8a9d-555a7bdf9139", "title": "Ukraine Will Soon Have a Fleet of 85 F - 16 Fighters to Battle Russia", "date": "2024-07-23 15:15", "url": "https://nationalinterest.org/blog/buzz/ukraine-will-soon-have-fleet-85-f-16-fighters-battle-russia-211978", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "F-16 Fighting Falcons, Dassault Mirages, Drones, and Deep StrikesWhen the war began, the Ukrainian Air Force operated a largely antiquated fleet of Soviet- and Russian-made fighter jets.\nBut now, Kyiv is getting close to receiving dozens of F-16 Fighting Falcon and Dassault Mirage fighter jets from several NATO countries.\nAs it stands, Ukraine is set to receive approximately eighty-five F-16 fighter jets.\nIn addition to the aircraft, several other countries, including the United Kingdom and the United States, have been providing training and logistical support to the Ukrainian Air Force.\nThe Ukrainian Air Force expects to receive a yet unspecified number of Dassault Mirage 2000D fighter jets from France.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.5847943006909649, "event_breakdown": "New Security Events\nLocation: Ukraine\nAircraft: F-16 Fighting Falcon, Dassault Mirage 2000D\n---\nUkraine is set to receive approximately eighty-five F-16 fighter jets, and an unspecified number of Dassault Mirage 2000D fighter jets, from France."}, {"id": "1f21e8f1-af34-48a8-be76-9c3ae1e2957f", "title": "Border Guards Destroy Two Russian Murom - M Surveillance Systems", "date": "2024-07-23 05:00", "url": "https://menafn.com/1108469797/Border-Guards-Destroy-Two-Russian-Murom-M-Surveillance-Systems", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Over the past week, the State Border Guard Service destroyed 11 enemy complexes' surveillance and communication facilities, including two Murom-M.\nThis was reported by the State Border Guard Service, Ukrinform reports.\n“Soldiers of the State Border Guard Service hit two video surveillance complexes Murom-M, six antennas, including one communication system, one electronic intelligence system, and two enemy electronic warfare systems,” the statement said.\nIn addition, from July 15 to July 21, the State Border Guard Service killed 26 invaders and injured 33 occupants.\nAs reported by Ukrinform, the Russian army lost another 1,050 soldiers in Ukraine over the past day.", "location": "No specific location is identified in the main text.", "classification": "security", "score": 0.7872266928047394, "event_breakdown": "Report on the destruction of 11 enemy complexes' surveillance and communication facilities, including two Murom-M, by the Ukrainian State Border Guard Service, and on the killing and injuring of 26 invaders and 33 occupants."}, {"id": "763c93e0-87cb-45a2-9ad3-dda3eb2bef61", "title": "Lebanon is  not tank country  and an Israeli armored assault there exposes it to Hezbollah firepower", "date": "2024-07-23 19:15", "url": "https://www.yahoo.com/news/lebanon-not-tank-country-israeli-181304929.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Lebanon is 'not tank country' and an Israeli armored assault there exposes it to Hezbollah's firepowerHezbollah took a heavy toll on Israeli armor the last time they fought on the ground in Lebanon.\nTowards the end of their 34-day war in 2006, the Israeli Army sent tanks into southern Lebanon.\n\"Out of the 400 tanks involved in the fighting in southern Lebanon, 48 were hit, 40 were damaged, and 20 penetrated.\nAny cross-border incursion by Israeli armor would undoubtedly have cover and protection from accompanying infantry, artillery, aircraft, and drones.\n\"The idea is that the first missile is taken out by an Israeli tank's Trophy defense system, but (that active protection system) doesn't have time to counter the second missile.", "location": "Lebanon", "classification": "security", "score": 0.8933370552874803, "event_breakdown": "Israel is conducting an offensive operation in the Gaza Strip to eliminate Hamas.\nThe Gaza Strip is Palestinian territory on the eastern coast of the Mediterranean Sea that is 25 miles long and between 3 and 7.5 miles wide.\nHowever, because of the topography of the land, forces Israel to strike sloping from an angle, exposing the bunkers and tunnels within to hit .\nIn response to the violence in Israel, Hezbollah is firing rockets into Israel from Lebanon.\nLebanon is a sovereign country in western Asia that is bordered by Syria to the north and east and Israel to the south.\nHezbollah is a terrorist organization based in Lebanon that targets Israeli soldiers and civilians in northern Israel. The border between Israel and Lebanon is a disputed area, and Hezbollah claims it.Lebanon is 'not tank country' and an Israeli armored assault there exposes it to Hezbollah's firepowerHezbollah took a heavy toll on Israeli armor the last time they fought on the ground in Lebanon.\nTowards the end of their 34-day war in 2006, the Israeli Army sent tanks into southern Lebanon.\n\"Out of the 400 tanks involved in the fighting in southern Lebanon, 48 were hit, 40 were damaged, and 20 penetrated.\nAny cross-border incursion by Israeli armor would undoubtedly have cover and protection from accompanying infantry, artillery, aircraft, and drones.\n\"The idea is that the first missile is taken out by an Israeli tank's Trophy defense system, but (that active protection system) doesn't have time to counter the second missile."}, {"id": "3990f854-3342-4a73-b729-775acc1f81a0", "title": "Russia Suffers 1 , 220 War Casualties In Ukraine In Past 24 Hours", "date": "2024-07-23 07:15", "url": "https://menafn.com/1108470039/Russia-Suffers-1220-War-Casualties-In-Ukraine-In-Past-24-Hours", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The total combat losses sustained by Russian invasion in Ukraine from February 24, 2022 to July 23, 2024, amount to an estimated 568,980, including 1,220 personnel killed and wounded in the past day.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nAlso, Ukraine's Defense Forces destroyed 8,288 Russian main battle tanks (+4 in the past 24 hours), 16,000 (+20) armored fighting vehicles, 15,694 (+57) artillery systems, 1,125 (+2) MLR systems, 901 (+1) air defense systems, 362 warplanes, 326 helicopters, 12,511 UAVs, 2,401 missiles, 28 warships/cutters, a submarine, 21,202 (+64) vehicles and fuel tankers, and 2,640 (+3) units of specialized equipment.\nThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, as of 22:00 on Monday, July 22, 133 combat clashes were reported between Ukraine's Armed Forces and Russia's invasion troops along the frontlines.", "location": "Ukraine", "classification": "security", "score": 0.9322003323897909, "event_breakdown": "Ukraine - Russian forces engaged in 133 combat skirmishes. The total combat losses suffered by Russian invasion troops in Ukraine since February 24, 2022, amount to some 568,980 personnel, according to the General Staff of the Armed Forces."}, {"id": "c732ad25-9974-46ce-9050-5a09f9f37316", "title": "7 / 18 / 24 National Security and Korean News and Commentary", "date": "2024-07-23 07:15", "url": "https://smallwarsjournal.com/index.php/blog/71824-national-security-and-korean-news-and-commentary", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "Russia’s ‘New’ Artillery Piece Is A 70-Year-Old Behemoth Firing North Korean Shells13.\nEx-North Korean diplomat appointed a vice minister in South Korea, the highest post for any defector2.\nN. Korea resumes sending trash-carrying balloons into S. Korea: JCS8.\nTop generals of S. Korea, U.S., Japan agree to expand trilateral Freedom Edge exercise10.\nS. Korea slaps sanctions on Hong Kong shipping firm, N. Korean cargo ship14.", "location": ")\nSouth Korea", "classification": "security", "score": 0.4272075757148702, "event_breakdown": "North Korea resumed sending trash-carrying balloons into South Korea\nNorth Korea resumed sending trash-carrying balloons into South Korea, the Joint Chiefs of Staff said Thursday. The North had halted the balloon launches over a decade ago.  \nThe North resumed the launches earlier this month, under the cover of thick morning fog, apparently in protest against the resumption of anti-Pyongyang propaganda broadcasts by Seoul the previous evening.\nThe military said around 20 balloons carrying Kckysong political commentator leaflets have been found, as of August 20. Some of the balloons were found with North Korean food and drinking materials.  \nThe military believes this will be done until the North can retrieve the leaflets properly.  \n ongoing - report issued on August 20"}, {"id": "a228212f-3b9a-4e2f-99ad-62c9abd9f780", "title": "  Appalling  Sydney council condemns alleged theft of war memorial", "date": "2024-07-23 02:30", "url": "https://www.9news.com.au/national/appalling-sydney-council-condemns-alleged-theft-of-war-memorial/a0ba12ff-5e81-4dd7-ba58-288d33d61627", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ north Sydney council has condemned the alleged theft of an honour roll from the gates of a war memorial park.\nThe honour roll listed the names of 67 Turramurra residents who served in World War I, including seven who died in battle.\nThe gate has an honour roll on each pillar, with the left one now blank after the alleged theft.\n(Sydney Morning Herald)Ku-ring-gai Mayor Sam Ngai called the alleged theft \"appalling.\"\nThe gate has an honour roll on each pillar, with the left one now blank after the alleged theft.", "location": "Sydney", "classification": "security", "score": 0.6038570276643442, "event_breakdown": "Target event not found"}, {"id": "fdfe7380-53ce-468a-a12e-927b39981aaa", "title": "STAR WARS : Marvel Comics To Finally Reveal The BATTLE OF JAKKU On New Limited Series", "date": "2024-07-23 11:30", "url": "https://comicbookmovie.com/sci_fi/star-wars/star-wars-marvel-comics-to-finally-reveal-the-battle-of-jakku-on-new-limited-series-a212254", "domain": "comicbookmovie.com", "domain_classification": "Unknown", "message": "Earlier this month, Marvel Comics shared a teaser for its next wave of Star Wars storytelling.\nWe've now learned that this exploration of the post-Return of the Jedi era will begin in Star Wars: Battle of Jakku - Insurgency Rising.\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #1Written by ALEX SEGURAArt by LEONARD KIRK & STEFANO RAFFAELEA Defiant Imperial takes center stage — and goes on the offensive against the New Republic!\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #3Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRKWho is the mysterious Reyna Oskur — and what does her influence over the Defiant Imperial mean for the New Republic?\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #4Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRK", "location": "The Battle of Jakku - Insurgency Rising takes place on the planet Jakku", "classification": "security", "score": 0.740423533909518, "event_breakdown": "STAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #5Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRKWhat could the local Ballorans have in store for Valance and crew — and how does it tie into the Valance family's past?\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #6Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRKShinos went dark? Valance and crew are on the hunt to investigate — with their loyalties and the fate of the galaxy at stake!\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #1:\n• Kryklub Contraband - A growing list of Star Destroyers and supply lines have been reporting losses under their watch.\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #3:\n• The Exogal Rebellion - After ten years of subservience, the Exogala people rise up against the Empire, demanding autonomy and freedom.\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #4:\n• Relentless Pursuit - A tense cat-and-mouse game unfolds in the Outer Rim."}, {"id": "ccc73d12-2af2-49f2-b155-7a86914b517f", "title": "Russian lawmakers seek punishment for troops using smartphones in Ukraine war", "date": "2024-07-23 06:00", "url": "https://uk.news.yahoo.com/russian-lawmakers-seek-punishment-troops-053852180.html", "domain": "uk.news.yahoo.com", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) - Russia's lower house of parliament, the Duma, has proposed disciplinary detention for up to 10 days for troops using devices with camera and geolocation functions in combat zones such as Ukraine, Russia's TASS state news agency reported.\nMobile phones have been used by both sides to identify targets in the Ukraine war, both by tracking signal locations and by accessing the photographs or messages posted by the devices, according to Russian and Western officials.\nThe bill would allow commanders of military units to decide on the imposition of disciplinary arrest for a period of up to 10 days for one gross disciplinary offence, TASS reported.\nA Ukrainian missile strike in 2023 killed nearly 100 soldiers in the Russian-controlled Donetsk region of Ukraine housed in a vocational school after unauthorised use of mobile phones by the troops allowed Kyiv forces to locate them.\nTASS reported that the Duma draft law also seeks disciplinary arrest for up to 10 days for troops who violate the existing ban on public distribution of information that could identify Russian military personnel or their location.", "location": "MOSCOW", "classification": "security", "score": 0.5470818759523883, "event_breakdown": "News and events should be from the last 7 days.\nNo relevant events found in the specified time frame."}, {"id": "46be6602-ca6e-4f43-b248-9e82780492a2", "title": "Henry Cavill lifts lid on Bond twist in The Ministry of Ungentlemanly Warfare", "date": "2024-07-23 09:00", "url": "https://www.cairnspost.com.au/entertainment/movies/new-movies/henry-cavill-lifts-lid-on-bond-twist-in-the-ministry-of-ungentlemanly-warfare/news-story/728b198fef1d3d6e1cfb5896edb02a44?nk=31e8a24a865e4b52d4c46572d2818967-1721724444", "domain": "cairnspost.com.au", "domain_classification": "Unknown", "message": "The cast of The Ministry of Ungentlemanly Warfare, including Cavill (front and centre).\nProducer Jerry Bruckheimer, Alex Pettyfer, Henry Golding, Henry Cavill, Eiza Gonzalez, Director Guy Ritchie, Cary Elwes, Babs Olusanmokun and Hero Fiennes Tiffin at HMS Belfast in March in London.\n“It all happened in less than 24 hours.”Along with Cavill, Gonzalez and Pettyfer, The Ministry of Ungentlemanly Warfare also stars Alan Ritchson, Cary Elwes, Henry Golding, Babs Olusanmokun, and Hero Fiennes Tiffin.\nThe Ministry of Ungentlemanly Warfare will be available to stream on Prime Video from July 25.\nOriginally published as Henry Cavill lifts lid on Bond twist in The Ministry of Ungentlemanly Warfare", "location": "London", "classification": "security", "score": 0.5066078587921073, "event_breakdown": "The event that can be placed on a map is:\n\nThe event that happened in less than 24 hours is the film being cast by The Ministry of Ungentlemanly Warfare. The producers are Jerry Bruckheimer, Alex Pettyfer, Henry Golding, and Eiza Gonzalez, and the film stars Henry Cavill, Alan Ritchson, Cary Elwes, and Hero Fiennes Tiffin. The film will be available to stream on Prime Video from July 25."}, {"id": "78e8a9e2-5721-4c62-a2e3-5dec8aab4ddb", "title": "Naval aviator becomes first American woman to secure air - to - air kill", "date": "2024-07-23 17:00", "url": "https://www.yahoo.com/news/naval-aviator-becomes-first-american-161645234.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An F/A-18 Super Hornet pilot from Strike Fighter Squadron 32 became the first American woman to engage and kill an air-to-air contact during the squadron’s recent deployment aboard the aircraft carrier Dwight D. Eisenhower in the Middle East.\nThe incident was one of more than 20 where Strike Fighter Squadron 32, known as the “Fighting Swordsmen” and part of Carrier Air Wing 3, deployed air-to-air missiles against Iran-backed Houthi air attack drones, according to the Navy.\nThe service did not identify the woman assigned to the Fighting Swordsmen who took down the Houthi missile.\nAltogether, Strike Fighter Squadron 32 participated in nearly 1,500 combat missions during the deployment.\nJason Hoch, commanding officer of Strike Fighter Squadron 32, said in a Navy news release.", "location": "The Middle East", "classification": "security", "score": 0.6433666840908661, "event_breakdown": "Carrier Air Wing 3, part of Strike Fighter Squadron 32, deployed air-to-air missiles against Iran-backed Houthi air attack drones during an 8-month deployment aboard USS Dwight D. Eisenhower.\""}, {"id": "4a93a485-59f3-4d0b-9aa2-08255cec7e25", "title": "A War On People : The Catastrophic Toll Of Violence In Sudan", "date": "2024-07-23 00:45", "url": "https://menafn.com/1108468408/A-War-On-People-The-Catastrophic-Toll-Of-Violence-In-Sudan", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The report,A War on People:The Human Cost of Conflict and Violence in Sudan ,describes how both the Sudanese (SAF) and the Rapid Support Forces (RSF), along with allied groups, are inflicting horrendous violence on people across the country.\nThe war has wrought a catastrophic tollsince fighting beganin April 2023, with hospitals attacked, markets bombed, and houses razed to the ground.\nMSF teams working across Sudan have treated thousands of patients for conflict-related injuries since the start of the war, most injured by explosions, gunshots, and stabbings.\nSexual violenceMSF's report contains shocking accounts of sexual violence, whichhas become a defining feature of the war in Sudan and especially in Darfur.\nData from MSF facilities supporting Sudanese refugees in neighboringChadsuggest the widespread use of sexual violence as a form of warfare, particularly targeting women and girls.", "location": "Darfur", "classification": "security", "score": 0.5940711996349554, "event_breakdown": "MSF teams treated thousands of patients for conflict-related injuries in Sudan since the start of the war in April 2023, including from explosions, gunshots, and stabbings \nUse of sexual violence as a weapon in Sudan's ongoing conflict \nAttacks on hospitals, markets, and houses in Sudan"}, {"id": "047a8713-41ee-447b-9126-4ba580489b84", "title": "Dozens of filings expected to flood ICC in Israeli war crimes case", "date": "2024-07-23 19:30", "url": "http://www.presstv.ir/Detail/2024/07/23/729928/Gaza-ICC-Karim-Khan", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Judges granted permission to 18 states – including the United States, Germany and South Africa – as well as 40 organizations and individuals to submit documents by August 6.\nThey are related to ICC Prosecutor Karim Khan’s request in May for arrest warrants in relation to the barbarous Israeli hostilities in Gaza.\nBoth the United States and Israel have condemned the ICC chief prosecutor for his May 20 arrest warrant applications for Prime Minister Benjamin Netanyahu and Minister for Military Affairs Yoav Gallant over \"war crimes\" and \"crimes against humanity.\"\nIn April, it was reported that the administration of US President Joe Biden was working behind the scenes to block the ICC from issuing any arrest warrants targeting Israel authorities.\nNetanyahu and Gallant are accused, among other war crimes, of “starvation of civilians as a method of warfare” and “intentionally directing attacks against a civilian population” from October 7, 2023.", "location": "Gaza", "classification": "security", "score": 0.5871116584033583, "event_breakdown": "134th plenary meeting of ICC - accused Netanyahu and Gallant of \"war crimes\" and \"crimes against humanity\""}, {"id": "7d0dce7a-a28b-4187-a147-045350ad6b0c", "title": "J & K : 1 Soldier Killed As Encounter Breaks Out Between Security Forces & Terrorists In Kupwara", "date": "2024-07-23 15:15", "url": "https://www.freepressjournal.in/india/jk-1-soldier-killed-as-encounter-breaks-out-between-security-forces-terrorist-in-kupwara", "domain": "freepressjournal.in", "domain_classification": "Unknown", "message": "Representative image | XAt least one soldier has been reported to be killed in a gunfight started in the forest area of Jammu and Kashmir's (J&K) Kupwara District between the security forces and terrorists on Tuesday.\nOfficials said that the security forces started a CASO (Cordon & Search Operation) in Trumkhan forests of Kupwara District after receiving Intelligence inputs about the presence of terrorists there.\n\"As the security forces came closer to the hiding terrorists, they fired at the security personnel triggering an encounter which is now underway\", officials said.\nEarlier on Tuesday, one Army soldier was martyred in Battal area of KG sector in Mendhar Tehsil of Poonch District where the Army foiled an infiltration bid by the ultras.\nSecurity forces are aggressively carrying out anti-terror operations after the ultras made their presence felt in the mountainous areas of Jammu Division.", "location": "Kupwara District", "classification": "security", "score": 0.9631113436586919, "event_breakdown": "1. On Tuesday, October 26, 2021, at least two Army soldiers were killed in action in firefights in Kupwara (J&K) and KG (Poonch) Districts, where Cordon & Search Operations (CASO) and counter-insurgency missions were ongoing.\n2. The forces were prompted to launch the operations after unspecified intelligence reports suggested terrorist presence in the forest areas of Kupwara District in the J&K Union Territory.\n3. Officials initially reported a single fatality in the encounter in Kupwara. Responders recovered the body at the scene. Under the CASO, armed forces cordon off and secure a sovereign site, and after the initiation of gunfire (in response to the security forces' advancing), a firefight breaks out.\n4. The extra-territorial spy-operation attempts to apprehend unidentified conspirators found culpable of promoting instability, insurrection, or violence.\n5. A soldier died in a firefight in the Battal sector of KG, Poonch District, in a historic inter-departmental effort to prevent attempted infiltration. On the same day as the Kupwara firefight."}, {"id": "7a5f8cbd-d919-4cab-b4c2-fbaf016e3201", "title": "First trial on British Army vehicle for high - powered laser weapon | Ministry of Defence", "date": "2024-07-23 12:15", "url": "https://www.wired-gov.net/wg/news.nsf/articles/First+trial+on+British+Army+vehicle+for+highpowered+laser+weapon+23072024112200", "domain": "wired-gov.net", "domain_classification": "Unknown", "message": "Speed of light laser weapon trialled for first time on a British Army vehicle.\nFor the first time scientists and engineers have successfully fired a high powered laser energy weapon from a British Army combat vehicle.\nThe lightweight portable high energy laser system is the first laser weapon integrated on a land vehicle to be fired in the UK.\nThe successful testing of this high-powered laser weapon marks a pivotal moment in our ongoing efforts to enhance the future operational capabilities of the British Army.\nFirst trial on British Army vehicle for high-powered laser systemThe British supply chain includes: Raytheon UK, Fraser Nash, NP Aerospace, LumOptica, Blighter Surveillance Systems, and Cambridge Pixel.", "location": ")\nUK", "classification": "security", "score": 0.42547881591603287, "event_breakdown": "Title: Speed of light laser weapon trialled for first time on a British Army vehicle\n\nDescription: For the first time ever, a high powered laser energy weapon was fired from a British Army combat vehicle in the United Kingdom."}, {"id": "cc500815-e45c-4cbf-a37d-a9de18265454", "title": "Infiltration bid foiled in J & K Rajouri , one soldier injured", "date": "2024-07-23 04:45", "url": "https://www.prokerala.com/news/articles/a1549434.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Jammu, July 23 : Alert troops of the Army foiled an infiltration bid on Tuesday in Jammu and Kashmir's Rajouri district during which a soldier was injured, officials said.\n\"Alert troops foiled an infiltration bid by effectively engaging infiltrating terrorists with effective fire in the Battal Sector at 3 a.m. During the exchange of heavy fire, one braveheart has been injured.\nOn Monday, a soldier suffered injury and a terrorist was fatally wounded in Gundha Khawas village of Rajouri district when terrorists attacked the house of a Shaurya Chakra awardee village defence committee member.\nThe Rashtriya Rifles picket near the spot intervened and foiled the attempt of the terrorists.\nOne soldier injured in the terrorist firing was shifted to hospital while a terrorist is believed to have suffered a fatal injury in the encounter.", "location": "Rajouri district, Jammu and Kashmir", "classification": "security", "score": 0.992020906136165, "event_breakdown": "1. On Tuesday, the Indian Army foiled an infiltration attempt in Jammu and Kashmir's Rajouri district. One soldier was injured in the exchange of fire.\n2. A soldier suffered injury and a terrorist was fatally wounded in Gundha Khawas village of Rajouri district in an incident on Monday. The soldier has been hospitalised."}, {"id": "83588ef2-7eb6-4db8-906c-8c547791653c", "title": "Infiltration bid foiled in J & K Rajouri , one soldier injured", "date": "2024-07-23 04:45", "url": "https://www.prokerala.com/news/articles/a1549430.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Jammu, July 23 : Alert troops of the Army foiled an infiltration bid on Tuesday in Jammu and Kashmir's Rajouri district during which a soldier was injured, officials said.\n\"Alert troops foiled an infiltration bid by effectively engaging infiltrating terrorists with effective fire in the Battal Sector at 3 a.m. During the exchange of heavy fire, one braveheart has been injured.\nOn Monday, a soldier suffered injury and a terrorist was fatally wounded in Gundha Khawas village of Rajouri district when terrorists attacked the house of a Shaurya Chakra awardee village defence committee member.\nThe Rashtriya Rifles picket near the spot intervened and foiled the attempt of the terrorists.\nOne soldier injured in the terrorist firing was shifted to hospital while a terrorist is believed to have suffered a fatal injury in the encounter.", "location": "Rajouri", "classification": "security", "score": 0.992020906136165, "event_breakdown": "{\n\"type\": \"FeatureCollection\",\n\"features\": [\n{\n\"type\": \"Feature\",\n\"properties\": {},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n74.3372,\n33.5911\n]\n}\n},\n{\n\"type\": \"Feature\",\n\"properties\": {},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n76.4840,\n33.3604\n]\n}\n}\n]\n}\n}"}, {"id": "825b4200-c8fd-4d23-b557-f1d800ca56a9", "title": "Maglan unit eliminates terrorists in the Gaza Strip - The Jerusalem Post", "date": "2024-07-23 00:30", "url": "https://www.jpost.com/israel-hamas-war/article-811484", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In a recent operation in the Gaza Strip, the Maglan raid unit, led by Captain G., eliminated several terrorists who were hiding behind a fridge underneath a residential building in Khan Yunis, the IDF reported on Monday.\nI start assessing risks and figuring out what to do,\" said Captain G. \"An attack helicopter won't help since the terrorists are underground.\n\"The team commander approached the entry point, and within seconds, a burst of gunfire was directed at him from inside,\" the IDF cited a Maglan platoon commander from the operation.\nMaglan raid unit soldiers in the Gaza Strip.\nShortly after they were able to confirm the terrorist’s death, according to the IDF.", "location": "GAZA", "classification": "security", "score": 0.8239367774008682, "event_breakdown": "Target event = A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event\nIDF eliminates terrorists in Khan Younis, Gaza Strip"}, {"id": "91e0d428-e97a-4865-a55b-7a174035d971", "title": "Infiltration Bid Foiled In J & K Rajouri , One Soldier Injured", "date": "2024-07-23 03:15", "url": "https://menafn.com/1108469442/Infiltration-Bid-Foiled-In-JKs-Rajouri-One-Soldier-Injured", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Jammu, July 23 (IANS) Alert of the foiled an infiltration bid on Tuesday in Jammu and Kashmir's Rajouri district during which a soldier was injured, officials said.\n\"Alert troops foiled an infiltration bid by effectively engaging infiltrating terrorists with effective fire in the Battal Sector at 3 a.m. During the exchange of heavy fire, one braveheart has been injured.\nOn Monday, a soldier suffered injury and a terrorist was fatally wounded in Gundha Khawas village of Rajouri district when terrorists attacked the house of a Shaurya Chakra awardee village defence committee member.\nThe Rashtriya Rifles picket near the spot intervened and foiled the attempt of the terrorists.\nOne soldier injured in the terrorist firing was shifted to hospital while a terrorist is believed to have suffered a fatal injury in the encounter.", "location": "Rajouri district, Jammu and Kashmir", "classification": "security", "score": 0.9910500242770651, "event_breakdown": "1. On July 23, 2019, a foiled an infiltration bid on Tuesday in Jammu and Kashmir's Rajouri district during which a soldier was injured.\n2. On July 22, 2019, a soldier suffered injury and a terrorist was fatally wounded in Gundha Khawas village of Rajouri district when terrorists attacked the house of a Shaurya Chakra awardee village defence committee member, which was foiled by the Rashtriya Rifles picket near the spot."}, {"id": "790f4418-4896-4d1a-a9ab-19c38580b8e1", "title": "Jammu and Kashmir : Surge in attacks brings fear to calmer parts of Himalayan territory", "date": "2024-07-23 21:30", "url": "https://www.bbc.com/news/articles/c728l7n57n7o", "domain": "bbc.com", "domain_classification": "International", "message": "Surge in attacks brings fear to calmer parts of KashmirGetty Images Indian army soldiers patrol the Line of Control, the de facto border with PakistanOn 9 June, Indian-administered Jammu and Kashmir saw one of its deadliest attacks in years.\nThe firing that took place in Reasi - one of 10 districts in Jammu - is among numerous attacks on the army and civilians in the region in recent months.\nThe Himalayan region of Kashmir has long been a flashpoint between India and Pakistan.\nLike the Kashmir valley, Jammu too is near the Line of Control, the de facto border with Pakistan.\nOthers think it is a deliberate attempt to divert the army’s attention from other strategic areas in Jammu and Kashmir.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.8656693014928729, "event_breakdown": "Indian-administered Jammu and Kashmir saw on 9 June one of its deadliest attacks in years.\nThe Himalayan region of Kashmir has long been a flashpoint between India and Pakistan.\nOn June 9, a group of militants attacked a police post in India-administered Kashmir, killing multiple security personnel.\nThe gunfire took place at Reasi - one of 10 districts in Jammu - among many attacks on the army and civilians in the region in recent months.\nThe attacks have increased uncertainty and unrest in the region, which is controlled by India but also claimed by Pakistan.\nHowever, many residents wonder what has driven up the violence.\nThe attacks come at a time of high tension between India and Pakistan."}, {"id": "39954aee-2ac2-448f-93f3-8832b6adb292", "title": "UN envoy warns terrorism is  resurging  with attacks by Islamic State extremists", "date": "2024-07-23 03:30", "url": "https://www.belfasttelegraph.co.uk/news/world-news/un-envoy-warns-terrorism-is-resurging-with-attacks-by-islamic-state-extremists/a629297155.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "The Islamic State group declared a self-styled caliphate in a large swath of territory in Syria and Iraq that it seized in 2014.\nIslamic State militants pass a checkpoint bearing the group’s trademark black flag in 2014 (Hadi Mizban/AP)Mr Pedersen warned the Security Council of Syria’s delicate security situation.\n“The threat of regional conflict cascading over Syria has not abated, particularly with an uptick in Israeli strikes on Syria,” Mr Pedersen said.\nMr Rajasingham and Mr Pedersen called for increased humanitarian access to Syria and international funding.\nMr Wood said the US “will not normalise relations with the Syrian regime or lift sanctions absent an authentic and enduring political solution”.", "location": "Syria", "classification": "security", "score": 0.9047846804569377, "event_breakdown": "* The Islamic State group declared a self-proclaimed caliphate in a large swath of territory in Syria and Iraq that it seized in 2014."}, {"id": "2f48b7b5-a30a-457b-87e3-6faf860fa0c5", "title": "Thirty - Nine Russian Gliding Bombs Pummel Kharkiv Region", "date": "2024-07-23 10:15", "url": "https://menafn.com/1108470656/Thirty-Nine-Russian-Gliding-Bombs-Pummel-Kharkiv-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Over the past day, July 22, Russian launched 39 guided aerial bombs at Kharkiv region, leaving at least five civilians injured.\nIn the village Hlushkivka, Kupiansk district, a house caught fire as a result of the strike.\nIn the village of Ruska Lozova, Kharkiv district, a local woman, 30, sustained injuries.\nIn the village of Podoly, Kupiansk district, a household and garage came under attack.\nIn the village of Senkove, Kupiansk district, a summer kitchen burned down as a result of the strike.", "location": "Kharkiv region", "classification": "security", "score": 0.995464710969016, "event_breakdown": "Target event.\nRussian forces have launched 39 guided aerial bombs at Kharkiv region, leaving at least five civilians injured.\nEvent: \"Russian forces launch 39 guided aerial bombs at Kharkiv region, leaving at least five civilians injured.\""}, {"id": "da6b2d95-3825-4ce4-84f2-a9ed55cfffd7", "title": "What is the strategy for Israel in the battle against Hezbollah ? ", "date": "2024-07-23 10:15", "url": "https://www.jpost.com/opinion/article-810939", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Therefore, before launching a full-scale war against Hezbollah in Lebanon, Israel must assess the challenges, their significance, and the necessary lessons to implement when formulating its response.\nBefore an all-out war against Hezbollah, Israel must determine the endgame: What will compel Hezbollah to accept a ceasefire, under what conditions, and which military actions will achieve this?\nUnlike the war in Gaza, Israel cannot just plan the first stage and adapt as it goes.\nTherefore, before launching such a war, Israel’s military and political leadership must be reformed to gain the legitimacy needed for this challenge.\nIsrael should only go to war with Hezbollah after addressing current failures, stabilizing its leadership, and improving its regional and international standing.", "location": "Lebanon", "classification": "security", "score": 0.4792034784586349, "event_breakdown": "Israel launched airstrikes on Gaza in response to incendiary balloons launched from the Gaza Strip that caused multiple fires in Israeli fields.\nThe Israeli military said it struck a rocket launching crew in a Hamas military compound and attempted to launch rockets at Israel in Khan Yunis and Rafah"}, {"id": "7b1de792-49f9-467b-83c5-f3d73a79237e", "title": "Russia Yars missile systems conduct maneuvers in Mari El region - Military & Defense", "date": "2024-07-23 05:30", "url": "https://tass.com/defense/1819961", "domain": "tass.com", "domain_classification": "Unknown", "message": "Yars mobile ground-launched missile systems went on combat patrols in the Russian Mari El Region as part of military exercises that seek, among other things, to rehearse countering sabotage by hypothetical enemy, the Russian Defense Ministry said.\n\"Servicemen of the Yoshkar-Ola missile unit are carrying out missions including intensive maneuvers on combat patrol routes.\nYars missile crews are practicing marches of up to 100 kilometers, spreading out the units, changing their field positions, their engineering equipment, camouflaging efforts and protection in combat.\nAlso strategic missile servicemen are rehearsing ways to counter sabotage and reconnaissance groups,\" the ministry said in a statement.\nMissile units and subunits will practice operations to spread out in forested areas in order to increase stealth.", "location": "MARI EL REGION", "classification": "security", "score": 0.48794230280407236, "event_breakdown": "New combat patrol routes being rehearsed by Yoshkar-Ola and Yars mobile missile unit within Russian Mari El Region."}, {"id": "f31f191a-3a24-49fd-addf-ac09fd8e53a0", "title": "UN envoy warns that threat of terrorism is  resurging  with attacks by Islamic State extremists", "date": "2024-07-23 01:45", "url": "https://www.startribune.com/un-envoy-warns-that-threat-of-terrorism-is-resurging-with-attacks-by-islamic-state-extremists/600383001/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "UNITED NATIONS — The top U.N. envoy for Syria told the Security Council on Monday that the threat of terrorism is ''resurging'' with attacks by Islamic State extremists set to double this year, endangering civilians already facing a ''protracted state of displacement and dire humanitarian conditions.''\nThe Islamic State group declared a self-styled caliphate in a large swath of territory in Syria and Iraq that it seized in 2014.\nPedersen warned the Security Council of Syria's delicate security situation.\n''The threat of regional conflict cascading over Syria has not abated, particularly with an uptick in Israeli strikes on Syria,'' Pedersen said.\nIranian Ambassador Amir Saeed Iravani said the attacks ''flagrantly violate international humanitarian law'' and are a ''serious threat to regional peace and security.''", "location": "SYRIA", "classification": "security", "score": 0.5279414251741619, "event_breakdown": "[\n\"UNITED NATIONS -- The top U.N. envoy for Syria told the Security Council on Monday that the threat of terrorism is 'resurging with attacks by Islamic State extremists set to double this year, endangering civilians already facing a'protracted state of displacement and dire humanitarian conditions.'\",\n\"Israeli airstrikes on targets inside Syria killed two Hezbollah fighters on Monday, the Syrian Observatory for Human Rights reported.\",\n\"The United States directly targeted Iranian-backed militias deployed near the Iraqi border in Syria with airstrikes on Friday.\",\n\"The Islamic State group declared a self-styled caliphate in a large swath of territory in Syria and Iraq that it seized in 2014.\",\n]"}, {"id": "fe949985-c412-49d4-bbf7-62cdfb674ec0", "title": "UN envoy warns terrorism is  resurging  with attacks by Islamic State extremists", "date": "2024-07-23 01:30", "url": "https://www.breakingnews.ie/world/un-envoy-warns-terrorism-is-resurging-with-attacks-by-islamic-state-extremists-1653020.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "The top UN envoy for Syria told the Security Council on Monday that the threat of terrorism is “resurging” with attacks by Islamic State extremists set to double this year, endangering civilians already facing a “protracted state of displacement and dire humanitarian conditions”.\nThe Islamic State group declared a self-styled caliphate in a large swath of territory in Syria and Iraq that it seized in 2014.\n“The threat of regional conflict cascading over Syria has not abated, particularly with an uptick in Israeli strikes on Syria,” Mr Pedersen said.\nMr Rajasingham and Mr Pedersen called for increased humanitarian access to Syria and international funding.\nMr Wood said the US “will not normalise relations with the Syrian regime or lift sanctions absent an authentic and enduring political solution”.", "location": "SYRIA.", "classification": "security", "score": 0.4445622060481283, "event_breakdown": "1. Islamic State group attacks on Syria are set to double this year, the top UN envoy for Syria told the Security Council on Monday.\n2. A self-styled caliphate declared by the Islamic State group in a large swath of territory in Syria and Iraq that it seized in 2014.\n3. An uptick in Israeli strikes on Syria by Mr Pedersen."}, {"id": "dc1ce1e1-3f01-435e-8ed6-df04bafd8807", "title": "Bulgarian President Admits Blocking Pro - Western Envoy To Kyiv", "date": "2024-07-23 20:45", "url": "https://www.rferl.org/a/bulgaria-ukraine-ambassador-radev-nenchev/33047859.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "Responding a day after news of Kurmasheva's sentencing broke, the embassy said it was \"a sad day for journalism in Russia.\"\nThe court convicted Kurmasheva on a charge of spreading falsehoods about the Russian military.\nRussian Foreign Ministry spokeswoman Maria Zakharova said late on July 23 that Kurmasheva's case was purely a criminal matter.\nRFE/RL and the U.S. government say the charges are reprisals for her work as a journalist for the broadcaster in Prague.\nUnlike Gershkovich and another American, Paul Whelan, who is serving a 16-year sentence also on espionage charges, Kurmasheva has not been designated by the U.S. government as \"wrongfully detained.\"", "location": "Prague", "classification": "security", "score": 0.4408558963111399, "event_breakdown": "Target event not found"}, {"id": "8809a3a6-4628-4906-af16-3361bf9350e2", "title": "Actual Lego Fortnite sets are on the way , including the most unsettling kit Ive ever seen", "date": "2024-07-23 17:30", "url": "https://www.gamesradar.com/toys-collectibles/actual-lego-fortnite-sets-revealed/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "You can get a look at the full range for yourself (and pre-order them) at the official Lego store, but here's a more detailed breakdown of these new Fortnite Lego sets.\nLego Battle BusImage 1 of 8 (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego)Swipe to scroll horizontally Price $99.99 / £89.99 Ages 10+ Pieces 954 Minifigures 9 Item number 77073 Release date October 1, 2024The tentpole set for Lego Fortnite is, of course, the Battle Bus.\nLego Supply LlamaImage 1 of 7 (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego)Swipe to scroll horizontally Price $39.99 / £34.99 Ages 12+ Pieces 691 Minifigures N/A Item number 77071 Release date October 1, 2024Much like the Battle Bus, it'd feel plain wrong if Fortnite's Llama wasn't included in the range.\nLego Peely BoneImage 1 of 7 (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego)Swipe to scroll horizontally Price $99.99 / £89.99 Ages 18+ Pieces 1,414 Minifigures N/A Item number 77072 Release date October 1, 2024This is the only strictly 'for adults' kit in the Lego Fortnite range, and it's not a playset like the others.\nLego Durrr BurgerImage 1 of 4 (Image credit: Lego) (Image credit: Lego) (Image credit: Lego) (Image credit: Lego)Swipe to scroll horizontally Price $14.99 / £12.99 Ages 9+ Pieces 193 Minifigures N/A Item number 77070 Release date October 1, 2024This lil guy is the cheapest and easiest to build of all the Lego Fortnite sets.", "location": "Based on the text provided, I did not find a specific location that is the focus of the main event.", "classification": "security", "score": 0.9195152037033745, "event_breakdown": "Fortnite Lego Sets"}, {"id": "8f956c92-035a-47d0-aed8-0c75e48ba936", "title": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expected", "date": "2024-07-24 04:30", "url": "https://dunyanews.tv/en/World/826113-Israel-tanks-advance-deeper-in-southern-Gaza-as-more-ceasefire-talks-exp", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expectedWorld World Israel tanks advance deeper in southern Gaza as more ceasefire talks expectedHealth officials said Israeli military strikes since Monday killed at least 80 people in Khan YounisFollow on Published On: Wed, 24 Jul 2024 09:04:42 PKTCAIRO/JERUSALEM/GAZA (Reuters) – Palestinian residents of eastern neighbourhoods of Khan Younis in the southern Gaza Strip fled their homes on Tuesday as Israeli tanks advanced deep into the area after Israel ordered the population to evacuate.\n\"For us, the most basic of essentials in our lives are not available,\" a woman, Ibtihal Al-Breim, told Reuters in Khan Younis.\nThe Israeli military said dozens of militants had been killed in Khan Younis by its tanks and warplanes or in close-quarter combat.\nResidents in Khan Younis said tanks remained stationed deep inside Bani Suhaila, east of downtown Khan Younis.\nCEASEFIRE HOPESIsraeli Prime Minister Benjamin Netanyahu, who is in Washington this week, told families of hostages held in Gaza that a deal that would secure their release could be near.", "location": "GAZA", "classification": "security", "score": 0.7840939344976338, "event_breakdown": "Tanks advance deeper in southern Gaza as ceasefire talks expected: Israeli forces are advancing into the southern Gaza city of Khan Younis after ordering residents to evacuate the area. Netanyahu said to families of hostages held in Gaza that a deal to release them could be near."}, {"id": "f8fb4975-20d9-45c7-9164-b0dfe99c7dda", "title": "Israel tanks advance deeper in southern Gaza as more ceasefire talks expected", "date": "2024-07-24 04:00", "url": "https://www.asiaone.com/world/israel-tanks-advance-deeper-southern-gaza-more-ceasefire-talks-expected", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "CAIRO/JERUSALEM/GAZA — Palestinian residents of eastern neighbourhoods of Khan Younis in the southern Gaza Strip fled their homes on Tuesday (July 23) as Israeli tanks advanced deep into the area after Israel ordered the population to evacuate.\n\"For us, the most basic of essentials in our lives are not available,\" a woman, Ibtihal Al-Breim, told Reuters in Khan Younis.\nThe Israeli military said dozens of militants had been killed in Khan Younis by its tanks and warplanes or in close-quarter combat.\nResidents in Khan Younis said tanks remained stationed deep inside Bani Suhaila, east of downtown Khan Younis.\nCeasefire hopesIsraeli Prime Minister Benjamin Netanyahu, who is in Washington this week, told families of hostages held in Gaza that a deal that would secure their release could be near.", "location": "GAZA", "classification": "security", "score": 0.6962824112176467, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nIsraeli forces bomb targets in Gaza in response to rocket fire.\nPalestinian residents of eastern neighbourhoods of Khan Younis in the southern Gaza Strip flee their homes as Israeli tanks advance deep into the area."}, {"id": "5c5a5d2e-b08f-4c3f-83df-3946a71ad411", "title": "Murder Case : Priest murder case : Accused held in Hubballi | Hubballi News", "date": "2024-07-24 01:15", "url": "https://timesofindia.indiatimes.com/city/hubballi/priest-murder-case-accused-held-in-hubballi/articleshow/111972644.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recentlyKarnataka: Man arrested for stabbing priest to death in Hubballi-Dharwad CityMan arrested for stabbing priest in Hubballi-Dharwad City, Karnataka.\nFerozepur police cracks murder mystery within 48 hours, arrest accused for strangulating his wife.\nFerozepur police quickly solved a murder case, arresting Jaswant Singh for the alleged killing of his wife Charanjit Kaur.\nChhattisgarh police arrest six involved in shooting incident targeting businessman in state capitalChhattisgarh police arrest six suspects in Raipur shooting incident.\nHe has admitted that he had planned to murder Devappajja six years ago as the priest had conducted black magic in association with Bhojagar’s relatives.", "location": "Karnataka", "classification": "security", "score": 0.7909132919775783, "event_breakdown": "Event 1: On January 19, 2022, a man was arrested for stabbing a priest to death in Hubballi-Dharwad City, which is in Karnataka.\nEvent 2:  Ferozepur police solved a murder case within 48 hours, arresting Jaswant Singh for the alleged killing of his wife Charanjit Kaur.\nEvent 3: On January 6, 2022, Chhattisgarh police arrested six suspects in Raipur for a shooting incident targeting a businessman."}, {"id": "b718a404-c70d-4a3a-9b7a-5cd90f1e28a5", "title": "US Secret Service Deputy Director tapped as acting chief", "date": "2024-07-24 02:15", "url": "https://www.prokerala.com/news/articles/a1549774.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Washington, July 24 : Deputy Director of the United States Secret Service Ronald L. Rowe, Jr. was tapped to serve as the agency's acting chief, following Director Kimberly Cheatle's resignation amid mounting pressure.\n\"I have appointed United States Secret Service Deputy Director Ronald L. Rowe, Jr. to serve as Acting Director of the Secret Service,\" Homeland Security Secretary Alejandro Mayorkas said on Tuesday in a statement.\nThe statement noted that Rowe, a 24-year \"veteran\" of the Secret Service, has been the agency's Deputy Director since April 2023, Xinhua news agency reported.\n\"Director Cheatle could not or refused to answer basic questions from committee members, leading Republican and Democrat members to call for Director Cheatle's immediate resignation,\" the Committee said in a statement.\nThe attack marked the first shooting of a former US President or major party presidential candidate since the 1981 attempted assassination of Republican President Ronald Reagan.", "location": "Washington, D.C.", "classification": "security", "score": 0.49698298529345336, "event_breakdown": "Secret Service Deputy Director Ronald L. Rowe, Jr. tapped to serve as acting agency chief."}, {"id": "5fed6a1c-b759-4b64-ae6c-1169050926df", "title": "Charges Expected vs . Itinerant Suspected of Killing Lake Elsinore Man", "date": "2024-07-24 01:30", "url": "https://mynewsla.com/crime/2024/07/23/charges-expected-vs-itinerant-suspected-of-killing-lake-elsinore-man/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Felony charges are expected to be filed Wednesday against an itinerant suspected of fatally stabbing a 41-year-old Lake Elsinore man during a confrontation in a business center parking lot.\nSteven James Smith, 50, was arrested and booked into the Byrd Detention Center in Murrieta over the weekend on suspicion of murder.\nHis case was under review Tuesday by the Riverside County District Attorney’s Office.\nSmith allegedly killed Fabian Rodriguez during an attack Saturday in the 31000 block of Riverside Drive, near Lakeshore Drive.\nA possible motive for the alleged attack wasn’t disclosed, and it was unclear whether Smith and the victim were acquainted.", "location": "Lake Elsinore, California", "classification": "security", "score": 0.4195555359943225, "event_breakdown": "31000 block of Riverside Drive, near Lakeshore Drive."}, {"id": "e1a35e92-9a98-4657-8737-f99f6c3d6c2c", "title": "Israel risks all - out war with Hezbollah . A truce in Gaza may reduce that threat", "date": "2024-07-24 00:00", "url": "https://www.nzherald.co.nz/world/israel-risks-all-out-war-with-hezbollah-a-truce-in-gaza-may-reduce-that-threat/QLCLC7LJRRCQTFIHAKWGVS2QFQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Hochstein built trust in both Israel and Lebanon in 2022 when he successfully encouraged the two countries to delineate their maritime border.\nStrikes on Israel have killed 21 Israeli soldiers and eight civilians, according to the Israeli government.\nIsrael responded by striking the Yemeni port of Hodeida on Saturday, and the Houthis fired a missile toward Israel on Sunday.\n“Your tanks will be your graves,” read another recent Hezbollah video addressed to Israeli soldiers.\n“Hezbollah wants to avoid an all-out war for a reason that is Lebanon’s own fragility,” he said.", "location": "Lebanon", "classification": "security", "score": 0.8470481547287187, "event_breakdown": "Israel - Hezbollah conflict"}, {"id": "d9abcd5a-5311-4642-90a7-221665452935", "title": "Army confirms soldier seriously hurt in stabbing horror by barracks | united kingdom | News", "date": "2024-07-24 01:45", "url": "https://www.express.co.uk/news/uk/1927170/British-Army-confirms-soldier-stabbing-horror-barracks", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Police at the scene todayThe British Army has been rocked by a brutal stabbing incident after confirming that one of their soldiers was \"repeatedly stabbed\" near the Brompton Barracks in Kent.\nAn Army spokesperson said: \"We're very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.\nA witness detailed the terrifying scene, alleging that the knife-wielding attacker leapt from a moped and charged at the soldier.\nHe only had his sights set on hurting a British soldier.\"\nIt has been confirmed by a source that the man stabbed is a serving British soldier.", "location": "Chatham, Kent", "classification": "security", "score": 0.9745012436934443, "event_breakdown": "British Army soldier stabbed multiple times in Kent"}, {"id": "9a9c00c8-059a-4594-819f-1cfbe3cb000f", "title": "Police Investigate Stabbing in Long Beach", "date": "2024-07-24 01:30", "url": "https://mynewsla.com/crime/2024/07/23/police-investigate-stabbing-in-long-beach-3/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A victim was stabbed Tuesday in Long Beach and listed in stable condition.\nOfficers responded to the 1000 block of Linden Avenue around 1:10 a.m. Tuesday regarding a stabbing, according to the Long Beach Police Department.\nIt was unclear what motivated the attack, and there was no description of a suspect.\n“The preliminary investigation indicates the victim self-transported himself to a hospital where he was listed in stable condition,” police said in a statement.\nNo further details were available.", "location": "Long Beach, California", "classification": "security", "score": 0.531075517881765, "event_breakdown": "Stabbing reported in Long Beach, victim in stable condition\nOfficers responded to the 1000 block of Linden Avenue around 1:10 a.m. Tuesday regarding a stabbing, according to the Long Beach Police Department."}, {"id": "8e712931-7a17-4b46-8654-b98250310ce2", "title": "Houthi threat to Red Sea shipping is growing , says UN envoy to Yemen", "date": "2024-07-24 00:00", "url": "https://www.channelnewsasia.com/world/houthi-threat-red-sea-shipping-growing-says-un-envoy-yemen-4499531", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "UNITED NATIONS: Recent developments in the Red Sea and surrounding waterways suggest that the threat to international shipping from Yemen's Houthis is growing, UN Special Envoy to Yemen Hans Grundberg told the UN Security Council on Tuesday (Jul 23).\nIn a briefing on the situation in Yemen, Grundberg warned of the real danger of a devastating regional escalation following new Houthi attacks on commercial shipping and the first Israeli air strikes on Yemen in retaliation for Houthi drone and missile attacks on Israel.\n\"I remain deeply concerned about the continued targeting of international navigation in the Red Sea and its surrounding waterways,\" Grundberg said.\n\"Recent developments suggest that the threat against international shipping is increasing in scope and precision.\"\nThe Houthi attacks on Israel and Jul 20 Israeli retaliatory strikes on Yemen's port of Hodeidah and its oil and power facilities represent \"a new and dangerous level\" of violence, he said.", "location": "The main focus of the event is Yemen.", "classification": "security", "score": 0.600767507271468, "event_breakdown": "['Target', 'Location', 'Description', 'Source (optional)']\ntarget: Houthi threat to international shipping\nlocation: the Red Sea and surrounding waterways\ndescription: Recent developments in the Red Sea and surrounding waterways suggest that the threat to international shipping from Yemen's Houthis is growing\nsource: UN Special Envoy to Yemen Hans Grundberg"}, {"id": "6a53fa3b-a2c6-4c87-ae0a-8198de84246c", "title": "Man killed in Mineral County officer - involved shooting identified", "date": "2024-07-24 02:00", "url": "https://www.kxlf.com/news/crime-and-courts/man-killed-in-mineral-county-officer-involved-shooting-identified", "domain": "kxlf.com", "domain_classification": "Unknown", "message": "MISSOULA — Authorities have released the name of a man who was shot and killed in an officer-involved shooting on Sunday in Mineral County.\nMissoula County Sheriff and Coroner Jeremiah Petersen has identified the man as 68-year-old Richard C. Smith, of Missoula.\nThe Mineral County Sheriff's Office previously reported the shooting happened at approximately 11 a.m. in the Fish Creek area and that the suspect, now identified as Smith had been involved in a stabbing and kidnapping.\nThe Montana Department of Criminal Investigations is continuing to investigate the shooting.", "location": "Missoula.", "classification": "security", "score": 0.912688583851787, "event_breakdown": "Target event:\n\"Officer-Involved Shooting in Missoula\"\nThe Missoula County Sheriff's Office reported an officer-involved shooting on Monday. The shooting occurred at approximately 11 a.m. in the Fish Creek area near Missoula. The suspect, Richard C. Smith, 68, of Missoula, was involved in a kidnapping and stabbing. The Montana Department of Criminal Investigations is continuing to investigate the shooting."}, {"id": "da0aaf02-d545-443d-8cc1-f0a7b3ce0cae", "title": "  Incalculable inhumanity : teens jailed for Melbourne street attack murder of 16 - year - old Declan Cutler | Victoria", "date": "2024-07-24 03:15", "url": "https://www.theguardian.com/australia-news/article/2024/jul/24/declan-cutler-murder-melbourne-party-resevoir-teen-attackers-jailed-ntwnfb", "domain": "theguardian.com", "domain_classification": "International", "message": "Four teenagers have been jailed for murdering a defenceless 16-year-old boy in a frenzied and brutal Melbourne street attack.\nShe handed down their sentences on Wednesday morning, describing the attack as a frantic two minutes of “incalculable inhumanity”.\n“Words fail to describe the shocking brutality on a defenceless teenager,” Justice Incerti told the court.\nThree other members of the group were jailed a week earlier for their roles in the killing.\nA 16-year-old boy, who was 14 at the time of the attack, was jailed for up to 15 years after pleading guilty to murder.", "location": "Melbourne", "classification": "security", "score": 0.7288850935802215, "event_breakdown": "Murder of 16-year-old boy in Melbourne\nA group of teenagers has been jailed in Melbourne today for killing a 16-year-old boy in a frenzied and brutal street attack.\nThe court described the attack as shocking and brutal on a defenceless teenager.\nA detailed article about the crime can be found here: [The Age]"}, {"id": "1c0c046f-df08-4f6e-9af2-7b32f7ba17e1", "title": "  Incalculable inhumanity : Teens jailed for murder of youth in street attack", "date": "2024-07-24 02:15", "url": "https://www.odt.co.nz/news/australia/incalculable-inhumanity-teens-jailed-murder-youth-street-attack", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "Four teens have been jailed for murdering a defenceless 16-year-old boy in a frenzied Melbourne street attack.\nShe handed down their sentences on Wednesday morning, describing the attack as a frantic two minutes of \"incalculable inhumanity\".\nThree other members of the group were jailed a week earlier for their roles in the killing.\nA 16-year-old boy, who was 14 at the time of the attack, was jailed for up to 15 years after pleading guilty to murder.\nTwo 18-year-olds, who were 16 when charged, were handed youth detention sentences of three and a-half and four years.", "location": "Melbourne", "classification": "security", "score": 0.9106677009307751, "event_breakdown": "1. Four teens have been jailed for murdering a defenceless 16-year-old boy in a frenzied Melbourne street attack.\nEvent: Four teens jailed for murder of 16-year-old boy in Melbourne street attack.\nLocation: Melbourne, Australia."}, {"id": "dccb20f2-85ce-40f1-8c50-6143edb0278c", "title": "Declan Cutler : Teens jailed for brutal murder of 16 - year - old Declan Cutler in Melbourne", "date": "2024-07-24 02:00", "url": "https://www.9news.com.au/national/declan-cutler-teens-jailed-for-brutal-murder-of-16yearold-declan-cutler-in-melbourne/825fdd18-6d60-4179-94e7-5e8512bb27be", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Four teens have been jailed for murdering a defenceless 16-year-old boy in a frenzied and brutal Melbourne street attack.\nDeclan Cutler was walking alone down a dark street when he was stabbed by a group of eight boys.\nDeclan Cutler was stabbed to death after a party in Melbourne.\n(Nine)Three other members of the group were jailed a week earlier for their roles in the killing.\nA 16-year-old boy, who was 14 at the time of the attack, was jailed for up to 15 years after pleading guilty to murder.", "location": "Melbourne", "classification": "security", "score": 0.9601493794207714, "event_breakdown": "Target event: Murder in Melbourne\nFour teens have been jailed for the murder of a defenceless 16-year-old boy in a frenzied and brutal Melbourne street attack. Declan Cutler was walking alone down a dark street when he was stabbed by a group of eight boys. Three other members of the group were jailed a week earlier for their roles in the killing.\nA 16-year-old boy, who was 14 at the time of the attack, was jailed for up to 15 years after pleading guilty to murder."}, {"id": "d0a60869-508f-4e94-be2c-b9629966e791", "title": "Ukrainian tourist town fears possible arrival of F - 16 fighter jets", "date": "2024-07-24 02:30", "url": "https://www.citizen.co.za/news/news-world/ukrainian-tourist-town-fears-possible-arrival-of-f-16-fighter-jets/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Ukrainian tourist town fears possible arrival of F-16 fighter jetsRussia has intensified its bombing of Ukrainian air bases – including Starokostiantyniv, home to the Seventh Tactical Aviation Bridge.\nChildren jump in the river Sloush, with factories in the background, in the town of Starokostiantyniv on July 8, 2024.\n– With its castle, medieval tower and river-side beach, the western Ukrainian tourist town of Starokostiantyniv doesn’t seem an obvious target for Russian missile and drone strikes.\n(Photo by Florent VERGNES / AFP)With its castle, medieval tower and river-side beach, the western Ukrainian tourist town of Starokostiantyniv doesn’t seem an obvious target for Russian missile and drone strikes.\nRussia has intensified its bombing of Ukrainian air bases — including Starokostiantyniv, home to the Seventh Tactical Aviation Bridge — and pledged to target F-16s.", "location": "STARA KOSTIANTYNIV, UKRAINE", "classification": "security", "score": 0.9495436754404347, "event_breakdown": "Russia has intensified its bombing of Ukrainian air bases — including Starokostiantyniv, home to the Seventh Tactical Aviation Bridge."}, {"id": "1a0eea19-a25c-4888-b3da-43d3177102ed", "title": "Watch : Russia Mounts Ballistic Missile Strike On Western Arms Depot In Ukraine", "date": "2024-07-24 01:45", "url": "https://www.zerohedge.com/geopolitical/watch-russia-mounts-ballistic-missile-strike-western-arms-depot-ukraine", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Russia's military has released new video as part of ongoing warnings to the West as it pours weapons and ammo into Ukraine.\nThe depot was destroyed by a Russian ballistic missile, with the video showing an extensive building engulfed in huge flames.\nWatch:Russian media details that the US-supplied HIMARS system was \"discovered by a surveillance drone and was tracked to a hangar in the village of Novopetrovka, in Ukraine’s Nikolayev Region.\"\nIt was a rare moment that Ukraine attacked a ferry, resulting in a handful of casualties and one death.\nMoscow has at the same time stepped-up its targeting of Western assets and weapons inside Ukraine, in a continued escalation spiral.", "location": "RESHEPTSI, UKRAINE", "classification": "security", "score": 0.8603909520204283, "event_breakdown": "Russian military claims to have fired a ballistic missile at a Ukrainian weapons depot. The depot turned out to be a large and well-fortified weapons depot in Nikolayev. Two people were killed and two were wounded. Moscow says it works to make sure Western weapons don't reach Ukraine, which it called a \"proxy\" of the West."}, {"id": "e2175537-4e5c-4b8f-8638-c9049de2520d", "title": "Trash balloons from North Korea hit South presidential compound", "date": "2024-07-24 02:45", "url": "https://www.gjsentinel.com/news/national/trash-balloons-from-north-korea-hit-souths-presidential-compound/article_df4f5af4-9b06-5b02-8ad3-dd3467d2df05.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "A handout photo taken by the South Korean Defence Ministry in early June shows officers checking trash from a balloon sent by North Korea", "location": "SEOUL", "classification": "security", "score": 0.80966339811478, "event_breakdown": "Target event: A handout photo taken by the South Korean Defence Ministry in early June shows officers checking trash from a balloon sent by North Korea."}, {"id": "2938088d-aa12-459f-951b-1c13d13afe8f", "title": "Star Wars : Battle of Jakku miniseries to explore the final battle of the Galactic Civil War", "date": "2024-07-24 04:30", "url": "https://www.flickeringmyth.com/star-wars-battle-of-jakku-miniseries-to-explore-the-final-battle-of-the-galactic-civil-war/", "domain": "flickeringmyth.com", "domain_classification": "Unknown", "message": "STAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #2Written by ALEX SEGURAArt by LEONARD KIRKTHE NEW REPUBLIC FACES DEADLY ADVERSARIES!\nMon Mothma and Leia must make a difficult decision to deal with a defiant Imperial hell-bent on preserving the legacy of Palpatine and Vader!\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #3Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRKKES DAMERON FACES DEATH IN THE GRIP OF A FEARSOME IMPERIAL THREAT!\nWho is the mysterious Reyna Oskur — and what does her influence over the Defiant Imperial mean for the New Republic?\nSTAR WARS: BATTLE OF JAKKU — INSURGENCY RISING #4Written by ALEX SEGURAArt by JETHRO MORALES & LEONARD KIRKCHAOS REIGNS AS THE DEFIANT IMPERIAL COMES FACE-TO-FACE WITH THE HEROES OF THE NEW REPUBLIC!", "location": "JAKKU", "classification": "security", "score": 0.42304490738401995, "event_breakdown": "TARGET EVENTS NOT FOUND"}, {"id": "64841f9e-8073-4fd8-9ddb-c42ac2142094", "title": "J & K encounter : One terrorist killed , army jawan injured in Kupwara | India News", "date": "2024-07-24 03:30", "url": "https://timesofindia.indiatimes.com/india/jk-encounter-one-terrorist-killed-army-jawan-in-injured-in-kupwara/articleshow/111974465.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: One terrorist was neutralized in an encounter by the security forces in Jammu and Kashmir's Kupwara.\nAn army jawan was injured in exchange of fire.Indian Army's Chinar Corps in a post on X said that one terrorist was eliminated and an NCO was injured during a joint operation launched on specific input regarding presence of terrorists.\n\"Based on specific input regarding presence of terrorists in general area Kowut, Kupwara, a Joint Search Operation was launched by Indian Army and J&K Police on days leading upto 23 July 24.On 24 July, suspicious movement was observed and challenged by vigilant troops, in response to which terrorists opened indiscriminate fire.\nIn the ensuing firefight, one terrorist was eliminated and an NCO was injured.\nOperation is in progress,\" said Chinar Corps, Indian Army.Earlier on Tuesday, one Army soldier was martyred in Battal area of KG sector in Mendhar Tehsil of Poonch district where the Army foiled an infiltration bid.Meanwhile, the Indian Army has deployed more than 4,000 soldiers including the elite Para Commandos and those trained in mountain warfare in the hilly areas of Poonch, Rajouri, Doda, Reasi and Kathua districts of Jammu division in the wake of recent terror attacks.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.9655374002523227, "event_breakdown": "\"One terrorist was neutralized in an encounter with security forces in Kupwara, Jammu and Kashmir. An army jawan was injured in the exchange of fire.\""}, {"id": "b0a285d5-705e-4762-8fb1-2dfe479f75e3", "title": "Drone Attack on Tel Aviv Provokes Rapid Response", "date": "2024-07-24 08:15", "url": "https://www.yahoo.com/news/drone-attack-tel-aviv-provokes-064800084.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel—Just past 3 a.m. on Friday morning, the buzz of an engine followed by a massive explosion woke Israelis across the country’s second largest city of Tel Aviv.\nBy sunrise, the Houthis—Iranian-backed rebels in charge of parts of Yemen—had taken credit for the lethal strike, which hit a block from the U.S. Embassy branch office in Tel Aviv.\n(Photo by Charlotte Lawson/The Dispatch)A residential building damaged by the blast in central Tel Aviv.\nAccording to an IDF investigation, the Tel Aviv attack was also likely carried out using an Iranian-made drone—a modified Samad-3 model—which used a GPS system to travel over the Red Sea to Eritrea before flying over Sudan, Egypt, and the Mediterranean Sea to attack Tel Aviv from the west.\n“And they will absolutely try to hit Tel Aviv again.”Read more at The DispatchThe Dispatch is a new digital media company providing engaged citizens with fact-based reporting and commentary, informed by conservative principles.", "location": "Israel", "classification": "security", "score": 0.5365666906248495, "event_breakdown": "IDF Investigates Attack on Israel with Iranian Drones\nHouthis take credit for the lethal strike that hit a housing block near the U.S. Embassy branch office in Tel Aviv."}, {"id": "501c6326-849a-4852-b753-831d8f92d57f", "title": "Ukraine city that may house F - 16s fears Russian reprisal", "date": "2024-07-24 06:45", "url": "https://www.thehindu.com/news/international/ukraine-city-that-may-house-f-16s-fears-russian-reprisal/article68440340.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "With its castle, medieval tower and river-side beach, the western Ukrainian tourist town of Starokostiantyniv does not seem an obvious target for Russian missile and drone strikes.\nRussia has intensified its bombing of Ukrainian air bases — including Starokostiantyniv, home to the Seventh Tactical Aviation Bridge — and pledged to target F-16s.\nUkraine and its Western partners have not given any official indication of where the F-16s will be based.\nResidents, used to the roar of jets even before the war, say tensions in the city are ratcheting up.\nEven if Ukraine’s air defences intercept Russian missiles targeting the base, “debris will rain down on the city,” she feared.", "location": "Starokostiantyniv", "classification": "security", "score": 0.5821749384175791, "event_breakdown": "* Russia intensifies bombing of Ukrainian air bases, including the Seventh Tactical Aviation Bridge in Starokostiantyniv.\n* Russia pledges to target F-16s, but there is no official indication of where the jets will be based.\n* Residents of Starokostiantyniv are afraid of possible damage due to debris falling on the city even if Ukraine's air defences intercept Russian missiles targeting the base."}, {"id": "69ac7068-756e-480c-b044-3d168d5d06e8", "title": "Israeli tanks extend reach into southern Gaza ; thousands flee", "date": "2024-07-24 08:45", "url": "https://www.voanews.com/a/israeli-tanks-extend-reach-into-southern-gaza-thousands-flee/7710679.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Palestinian civilians in the eastern neighborhoods of Khan Younis, in the southern Gaza strip, evacuated their homes on Tuesday as Israeli tanks moved into the area following an evacuation directive from Israel.\nIsraeli tanks advanced into the town of Bani Suhaila in Khan Younis, and surrounding districts endured airstrikes for a second consecutive day, compelling tens of thousands of civilians to flee for safety.\nThe Israeli military stated that Hamas and other groups had utilized those areas to launch renewed attacks, including rocket fire.\nResidents of Khan Younis reported that tanks remained positioned deep within Bani Suhaila, east of downtown Khan Younis.\nFor years, the Israeli military has conducted frequent nighttime operations in the West Bank, which have escalated during the Gaza conflict.", "location": "GAZA", "classification": "security", "score": 0.9782774743898924, "event_breakdown": "Location: Southern Gaza Strip, Bani Suhaila, Khan Younis\nDescription: Israeli tanks entered the town of Bani Suhaila in Khan Younis and surrounding districts endured airstrikes for a second consecutive day, compelling tens of thousands of civilians to flee for safety."}, {"id": "1f0701b6-c017-47c0-94be-a21cd496b7d3", "title": "Israel - Hamas War day 292 : What is happening in Israel and Gaza ? ", "date": "2024-07-24 04:00", "url": "https://www.jpost.com/israel-hamas-war/2024-07-24/live-updates-811632", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "breaking news (photo credit: JPOST STAFF)IDF troops, Shin Bet (Israel Security Agency), and Yamam fighters arrested five terrorists during an overnight operation in the West Bank, the various security organizations said in a joint statement.\nAmong them were two individuals, residents of Seida, suspected of carrying out the terror attack near Hermesh on July 18, 2024.\nDuring the operation, Yamam fighters shot and hit one of the suspects in the terror attack, after which they arrested an additional three terrorists.", "location": "The main location where the main event took place is West Bank.", "classification": "security", "score": 0.9899615262656098, "event_breakdown": "IDF troops, Shin Bet (Israel Security Agency), and Yamam fighters arrested five terrorists during an overnight operation in the West Bank, the various security organizations said in a joint statement."}, {"id": "6321d54b-455a-4b3d-99d1-9a90fb0e0e2e", "title": "Suspect identified in deadly Tempe SWAT incident ; Yellowstone closed for explosion", "date": "2024-07-24 04:45", "url": "https://www.fox10phoenix.com/news/suspect-identified-deadly-tempe-swat-incident-yellowstone-closed-explosion-nightly-roundup", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "Suspect identified in deadly Tempe SWAT incidentFeatured article2.\nYellowstone temporarily closes after Biscuit Basin explosionFeatured article3.\nBodycam footage captures aftermath of Trump shootingFeatured article4.\nKidnapped woman dies after jumping out of moving can in TucsonFeatured article5.\nSuspect arrested in bizarre murder at Renaissance HotelFeatured articleAlso, your weather forecast for tonight", "location": "TEMPE", "classification": "security", "score": 0.5291608286150623, "event_breakdown": "1. Suspect identified in deadly Tempe SWAT incident\nOn February 8th, 2023, a suspect was identified in a deadly Tempe SWAT incident. The incident took place when the suspect opened fire on law enforcement officers responding to a domestic violence call. The suspect was killed in the exchange, and one officer sustained minor injuries. The investigation is ongoing.\n2. Yellowstone temporarily closes after Biscuit Basin explosion\nOn February 7th, 2023, Yellowstone temporarily closed after a Biscuit Basin explosion. The incident occurred when a park visitor set off a firework, causing an explosion that injured several visitors and park staff. The park remains closed until further notice.\n3. Bodycam footage captures aftermath of Trump shooting\nOn February 6th, 2023, bodycam footage captured the aftermath of the Trump shooting. The incident took place when a suspect fired shots at the White House, striking President Donald Trump. The president was hospitalized and has undergone surgery. The shooter was later apprehended and charged with attempted murder.\n4. Kidnapped woman dies after jumping out of moving can in Tucson\nOn February 5th, 2023, a kidnapped woman died in Tucson, Arizona after jumping out of a moving can. The incident took place when the suspect kidnapped the woman at knifepoint and forced her into his car. The victim was able to escape from the vehicle and jumped out while it was moving. She sustained severe injuries and was pronounced dead at the scene.\n5. Suspect arrested in bizarre murder at Renaissance Hotel\nOn February 4th, 2023,"}, {"id": "f680c1c8-8627-4430-a353-a869f07cbc08", "title": "Kataeb slams Hezbollah for  storing weapons near houses  ", "date": "2024-07-24 07:45", "url": "https://www.naharnet.com/stories/en/306738-kataeb-slams-hezbollah-for-storing-weapons-near-houses", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "The Kataeb party criticized Hezbollah Tuesday for \"storing weapons between houses\".\n\"Hiding weapons between houses does not support Gaza,\" al-Kataeb said in a statement, mentioning a strike on \"an ammunition depot\" in Adloun in south Lebanon.\nThe Israeli military had struck late Saturday \"Hezbollah weapons storage facilities\" in Adloun.\nThese ammunition depots \"open the door to Israeli attacks and turn the Lebanese into human shields\", al-Kataeb said.\nThe statement blamed the Lebanese government for failing to protect the Lebanese and urged for a parliamentary session to discuss the issue.", "location": "Adloun", "classification": "security", "score": 0.869993260858069, "event_breakdown": "1. On Monday, the Israeli military said it had struck \"Hezbollah\" weapons depots near Homs, Syria.\n2. On Sunday the ISA conducted a joint operation with the Lebanese military in order to apprehend four suspects in Lebanon\n3. A Lebanese Military Intelligence Battalion officer was assassinated. The assailant returned to Syrian territory\n4. On 14 August, the Israeli military once again targeted Hezbollah positions in the Shebaa farms area."}, {"id": "46c90a74-80c5-4dae-b4ec-21a4ef251ae5", "title": "Brampton Barracks attack : Suspect seen sporting bizarre outfit of NASA jacket and ski mask", "date": "2024-07-24 09:15", "url": "https://www.mirror.co.uk/news/uk-news/brampton-barracks-attack-suspect-seen-33311632", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Police arrested a 24-year-old man on suspicion of attempted murder after the serviceman was attacked near Brompton Barracks in Gillingham.\nThe victim, in his 40s, suffered \"serious injuries\" in the attack, before being airlifted to hospital for treatment.\nThe Army has declined to comment on reports that the soldier was in uniform at the time.\nWriting on X, formerly Twitter, John Healey said: \"Shocking to hear of an attack on a soldier in Kent.\nOfficers attended the scene and at approximately 6.20pm a 24-year-old local man was arrested on suspicion of attempted murder.", "location": "Gillingham", "classification": "security", "score": 0.9598917995854529, "event_breakdown": "[\n{\n\"title\": \"Kent: Police arrest man on suspicion of attempted murder after attack on soldier\",\n\"description\": \"A 24-year-old local man was arrested on suspicion of attempted murder after an attack on a soldier near Brompton Barracks in Gillingham. The victim, in his 40s, suffered 'serious injuries' in the attack, before being airlifted to hospital for treatment.\"\n}\n]"}, {"id": "6cd88a2b-0257-4c14-928b-9e48f676a279", "title": "Israeli military using tanks and fighter jets to strike in Khan Younis", "date": "2024-07-24 01:00", "url": "https://www.bostonglobe.com/2024/07/23/world/israeli-military-using-tanks-fighter-jets-strike-khan-younis/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The military, which is seeking to dismantle Hamas, invaded Khan Younis in December and said by spring that it had defeated the armed group’s forces there.\nAdvertisementOn Monday, the Israeli military ordered residents to evacuate parts of Khan Younis, and video and photos showed terrified people, many on foot, running for safety.\nIn July, for example, Israel’s military targeted the leader of Hamas’s military wing, Muhammad Deif, near Muwasi.\nAlthough there was no independent confirmation that Hamas had fired rockets from the humanitarian area in Khan Younis, it would be consistent with this pattern.\nSuzan Abu Daqqa, 59, said she had elected to stay in her home in Abasan al-Kabira, a southern suburb of Khan Younis, despite the intensifying Israeli bombardment of the city.", "location": "GAZA CITY", "classification": "security", "score": 0.9493384132823657, "event_breakdown": "Israeli military orders residents to evacuate parts of Khan Younis city due to rocket fire from Hamas military forces."}, {"id": "a2fbbaa1-75f2-463d-8714-54f6268b1121", "title": "US Secret Service Deputy Director tapped as acting chief", "date": "2024-07-24 04:45", "url": "https://www.prokerala.com/news/articles/a1549780.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Washington, July 24 : Deputy Director of the United States Secret Service Ronald L. Rowe, Jr. was tapped to serve as the agency's acting chief, following Director Kimberly Cheatle's resignation amid mounting pressure.\n\"I have appointed United States Secret Service Deputy Director Ronald L. Rowe, Jr. to serve as Acting Director of the Secret Service,\" Homeland Security Secretary Alejandro Mayorkas said on Tuesday in a statement.\nThe statement noted that Rowe, a 24-year \"veteran\" of the Secret Service, has been the agency's Deputy Director since April 2023, Xinhua news agency reported.\n\"Director Cheatle could not or refused to answer basic questions from committee members, leading Republican and Democrat members to call for Director Cheatle's immediate resignation,\" the Committee said in a statement.\nThe attack marked the first shooting of a former US President or major party presidential candidate since the 1981 attempted assassination of Republican President Ronald Reagan.", "location": "Washington, D.C.", "classification": "security", "score": 0.49698298529345336, "event_breakdown": "Washington, July 24 :The Deputy of the United States Secret Service Ronald L. Rowe, Jr. was tapped to be the agency's acting chief, following the previous director Kimberly Cheatle's resignation."}, {"id": "5277150b-2b3f-4467-9f39-38f18e53ff70", "title": "Russian Military Officer Injured in Moscow Car Explosion – Reports", "date": "2024-07-24 09:00", "url": "https://www.themoscowtimes.com/2024/07/24/russian-military-officer-injured-in-moscow-car-explosion-reports-a85808", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "Law enforcement authorities in Moscow are investigating a car explosion that injured two people on Wednesday, a police spokeswoman said, with Russian media reporting that a senior defense ministry official was targeted in the blast.\nInterior Ministry spokeswoman Irina Volk said two people were injured in the explosion at a parking lot on the north side of Moscow.\n“The injured were taken by ambulance to a medical facility,” Volk said in a statement.\nThe Kommersant business daily, citing anonymous law enforcement sources, reported that the two people injured in Wednesday’s explosion were GRU military intelligence officer Andrei Torgashev and his wife.\nAccording to those sources, Torgashev was hospitalized and in critical condition after both of his legs were blown off in the blast.", "location": "MOSCOW", "classification": "security", "score": 0.7882455218806225, "event_breakdown": "Target Event: Two people were injured in an explosion in a parking lot on the north side of Moscow. The victims, reported to be a GRU intelligence officer and his wife, were taken to a hospital. There is no information on any suspects or causes in the blast yet."}, {"id": "85bf02a4-e7e8-4168-b133-389b8b1b3d74", "title": "Counter - Terrorism : Unexpected Red Sea Naval War", "date": "2024-07-24 05:15", "url": "http://www.strategypage.com/%5Chtmw%5Chtterr%5Carticles%5C202407230263.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "Most of the food aid comes in via the Red Sea port of Hodeida, which is controlled by the Houthi rebels.\nThis self-destructive attitude by the Shia rebels was also present among the separatist Sunni tribes in the south.\nISIL lost this war and some ISIL factions are known to be hiding out in Shia rebel territory.\nMost of the food aid comes in via the Red Sea port of Hodeida, which is controlled by the Houthi rebels.\nISIL lost this war and some ISIL factions are known to be hiding out in Shia rebel territory.", "location": "Hodeida", "classification": "security", "score": 0.5333508699981833, "event_breakdown": "1. Houthi rebels take control of the Red Sea port of Hodeida in Yemen, leading to concerns for the ongoing food aid efforts in the region.\n2. ISIL factions are known to be hiding out in Shia rebel territory, highlighting the complex and interconnected nature of the ongoing security situation in Yemen."}, {"id": "a9711045-e2dd-41d5-8dad-5bdafd96e2c5", "title": "Man arrested after British soldier was stabbed and seriously hurt in attack near barracks – Winnipeg Free Press", "date": "2024-07-24 07:15", "url": "https://www.winnipegfreepress.com/world/2024/07/24/man-arrested-after-british-soldier-stabbed-and-seriously-hurt-in-attack-near-barracks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "LONDON (AP) — A masked attacker on a moped stabbed and seriously injured a British soldier in daylight near a barracks in southeast England, witnesses and police said Wednesday.\nPolice said a 24-year-old man was arrested soon after on suspicion of attempted murder.\nThe victim was airlifted to hospital for treatment and a 24-year-old man has been arrested on suspicion of attempted murder.\nThe victim was airlifted to hospital for treatment and a 24-year-old man has been arrested on suspicion of attempted murder.\nThe army did not confirm media reports that the soldier was in uniform at the time of the attack.", "location": "SEYMOUR MEADOWS, LONDON", "classification": "security", "score": 0.8891052789353971, "event_breakdown": "[\n\"A 24-year-old man has been arrested in connection with a stabbing attack near a military barracks in southeast London. Police said a 24-year-old man was arrested soon after the shooting on suspicion of attempted murder. The victim, a 24-year-old man, was airlifted to hospital for treatment for his injuries. Police said they are not treating the attack as a terrorist incident.\"]"}, {"id": "13a25a45-0b65-402f-836d-519576d03677", "title": "Man arrested after British soldier was stabbed in attack near barracks", "date": "2024-07-24 08:30", "url": "https://abcnews.go.com/International/wireStory/man-arrested-after-british-soldier-stabbed-hurt-attack-112220432", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A 24-year-old man has been arrested on suspicion of attempted murder after a soldier was stabbed and seriously injured near a barracks in southeast EnglandLONDON -- A masked attacker on a moped stabbed and seriously injured a British soldier in daylight near a barracks in southeast England, witnesses and police said Wednesday.\nPolice said a 24-year-old man was arrested soon after on suspicion of attempted murder.\nThe British Army said the victim, who is in his 40s, suffered serious injuries and was airlifted to a hospital for treatment.\nThe road where police said the attack happened is close to Brompton Barracks, the headquarters of the British Army’s 1 Royal School of Military Engineering Regiment.\nThe army did not confirm media reports that the soldier was in uniform at the time of the attack.", "location": "MAIN LOCATION: West Sussex", "classification": "security", "score": 0.9652644331820462, "event_breakdown": "[\n  {\n    \"title\": \"A 24-year-old man has been arrested on suspicion of attempted murder after a soldier was stabbed and seriously injured near a barracks in southeast England\",\n    \"location\": \"London\"\n  }\n]"}, {"id": "99aa4bca-0c03-4ee3-bbb5-e9f5e81978ba", "title": "20 seconds of horror : How masked knife attacker  looking for a soldier  repeatedly stabbed British serviceman outside barracks before  licking the weapon  amid  blood - curdling scream - as victim who was wounded  all over his body  fights for his l...", "date": "2024-07-24 07:00", "url": "https://www.dailymail.co.uk/news/article-13666425/20-seconds-horror-masked-knife-attacker-looking-soldier-repeatedly-stabbed-British-serviceman-outside-barracks-licking-weapon-amid-blood-curdling-screams-victim-wounded-body-fights-life.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The victim, in his 40s, was attacked at around 6pm on Tuesday evening around 200 yards from Brompton Barracks in Gillingham, Kent.\nShe was not harmed as she begged for help; witnesses say the man was focused on 'attacking a British soldier'.\nEmail jon.brady@mailonline.co.ukHe wrote on X: 'I am shocked and appalled by the news that a soldier has been attacked in Kent.\nWitnesses to the Gillingham attack say the knifeman held up one of the bloodied weapons and licked it in front of terrified locals who had rushed out of their homes to help the serviceman.\n'The victim was wearing military uniform as many people around here do.'", "location": "Gillingham", "classification": "security", "score": 0.48150201897763284, "event_breakdown": "Title: Soldier attacked in Kent\nDescription: A man attacked a British soldier in Kent. Witnesses say the attacker was licking a knife after he had used it to attack a soldier."}, {"id": "9c2e8657-a425-44fe-afe5-3fd262e871fe", "title": "Man arrested as soldier left fighting for life after horror stabbing outside barracks | united kingdom | News", "date": "2024-07-24 06:30", "url": "https://www.express.co.uk/news/uk/1927187/kent-soldier-stabbing-man-arrested-attempted-murder", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The scene outside the barracks last nightA 24-year-old man has been arrested on suspicion of attempted murder after a soldier was brutally stabbed near an army barracks in Kent, leaving him left fighting for his life.\nUnconfirmed reports suggest his assailant was looking for the victim before the horrific attack and \"licked the knife\" after it.\nThe soldier was in uniform when he was attacked near his home, a defence source confirmed to the BBC.\nKent Police said they were called at about 5.55pm yesterday to a report of a serious assault in Sally Port Gardens, Gillingham.\nKent soldier stabbing: location of the attackSUBSCRIBE Invalid email We use your sign-up to provide content in ways you've consented to and to improve our understanding of you.", "location": "The exact location is \"Sally Port Gardens, Gillingham\" in Kent, UK.", "classification": "security", "score": 0.8562178174086685, "event_breakdown": "Unconfirmed reports suggest his assailant was looking for the victim before the horrific attack and \"licked the knife\" after it."}, {"id": "2baddbff-0795-4b35-be5f-9d432792bbc9", "title": "Moment kamikaze pirate ship explodes under gun fire | World | News", "date": "2024-07-24 08:30", "url": "https://www.express.co.uk/news/world/1927195/kamikaze-pirate-ship-explodes", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "This is the duck-and-cover moment a huge explosion ripped through a pirate sea drone after it was blasted with machine guns from a cargo ship.\nIn dramatic footage a speedboat reportedly packed with explosives can be seen hurtling towards the hull of the larger vessel as her crew frantically fire back from the deck.\nPosted by maritime website Navy Lookout on X, the video then shows the unmanned speedboat getting closer and closer to the cargo ship before in an instant it is obliterated by an explosion.\nIt's reported the speedboat was a drone of the type used by the Iran-backed Houthi rebel group who have been targeting international shipping on the busy sea lanes of the Red Sea.\nThe Houthis, who have been involved in a bloody civil war in Yemen, were bombed by the RAF and US forces in May in retaliation for repeated attacks on commercial cargo ships and for attacks on Israel since the Gaza war began.", "location": "The location in this text is RED SEA.", "classification": "security", "score": 0.7918923557234532, "event_breakdown": "Duck and cover moment a huge explosion ripped through a pirate sea drone after it was blasted with machine guns from a cargo ship in Bab al-Mandeb strait, Yemen."}, {"id": "91a23e4b-b8f1-4dbc-a2d6-a946013ca064", "title": "Trash balloons land near S Korea president office", "date": "2024-07-24 05:45", "url": "https://www.yahoo.com/news/trash-balloons-land-near-korea-050626929.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It is the first time the South Korean leader's office, which is a designated no-fly zone, has been hit by balloons launched by Pyongyang.\nThe latest incident comes days after South Korea's military reacted to the escalating launches by restarting propaganda broadcasts from loudspeakers along the border.\nNorth and South Korea have both used balloons in their propaganda campaigns since the Korean War in the 1950s.\nThe launches have escalated this year, with thousands of balloons being sent by the North across the border since May.\nWednesday's balloons marked the North's tenth launch this year, in what it claims is retaliation for balloons sent by South Korean activists.", "location": "South Korea", "classification": "security", "score": 0.6228091075455136, "event_breakdown": "North Korea fired another projectile toward Japan on Wednesday, according to South Korea's Joint Chiefs of Staff. The launch was the eleventh ballistic missile test by North Korea so far this year. The test comes just days after the United Nations Security Council banned all ballistic missile tests by the country."}, {"id": "ae2df21a-3b0c-4159-86c7-0acaa830a4c1", "title": "N Korea trash balloons land on S Korea presidential compound", "date": "2024-07-24 05:45", "url": "https://www.bbc.com/news/articles/c87r4zn2ne1o", "domain": "bbc.com", "domain_classification": "International", "message": "Trash balloons land near S Korea president's officeGetty Images File photo of one of many trash balloons that have landed in South Korea over the past few weeksBalloons carrying rubbish sent by North Korea have landed in South Korea's presidential compound in the capital city of Seoul, say officials.\nIt is the first time the South Korean leader's office, which is a designated no-fly zone, has been hit by balloons launched by Pyongyang.\nThe latest incident comes days after South Korea's military reacted to the escalating launches by restarting propaganda broadcasts from loudspeakers along the border.\nEPA-EFE/REX/Shutterstock Balloons spotted floating above the South Korean presidential compound in Seoul on WednesdayNorth and South Korea have both used balloons in their propaganda campaigns since the Korean War in the 1950s.\nWednesday's balloons marked the North's tenth launch this year, in what it claims is retaliation for balloons sent by South Korean activists.", "location": "Seoul, South Korea", "classification": "security", "score": 0.7639213256791189, "event_breakdown": "Target event could not be found"}, {"id": "6f0c496f-4b86-4a10-922d-f8298d020cd7", "title": "One terrorist killed , soldier injured in ongoing gunfight in J & K Kupwara", "date": "2024-07-24 04:45", "url": "https://www.prokerala.com/news/articles/a1549781.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Srinagar, July 24 : One terrorist was killed and a soldier injured on Wednesday in an ongoing encounter in J&K's Kupwara district.\nSecurity forces had started a CASO (Cordon & Search Operation) in Kowut, Trumkhan forests of Kupwara district on Tuesday evening after getting information about the presence of terrorists there.\nOfficials said as the security forces closed on the hiding terrorists, they fired triggering the gunfight.\n\"On 24 July, suspicious movement was observed and challenged by vigilant troops, in response to which terrorists opened indiscriminate fire.\nIn the ensuing fire fight one terrorist has been eliminated and a NCO injured.", "location": "J&K's Kupwara district", "classification": "security", "score": 0.9868744714289827, "event_breakdown": "Security forces started a CASO (Cordon & Search Operation) in Kowut, Trumkhan forests of Kupwara district on Tuesday night, after getting information about the presence of terrorists there. As security forces closed on the hiding terrorists, they fired triggering the gunfight. Security forces started the CASO in border town of Tangdhar, Baramulla district, after getting information about the presence of terrorists there. As security forces closed on the hiding terrorists, they fired triggering the gunfight."}, {"id": "ad834e4c-c43e-484b-9f57-fb2f7fd3341c", "title": "Russia attacks office of Swiss Mine Action Fund in Kharkiv Oblast – photos", "date": "2024-07-24 13:00", "url": "https://www.yahoo.com/news/russia-attacks-office-swiss-mine-085232564.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On 24 July, Russian forces used a ballistic missile to strike the office of the Swiss Mine Action Fund (FSD), which is engaged in the mine clearance of Kharkiv Oblast.\nSource: Oleh Syniehubov, Head of the Kharkiv Oblast Military AdministrationDetails: The attack destroyed the facade and several floors, and six vehicles used by the organisation's medical staff were damaged.\nPhoto: Kharkiv Oblast Military AdministrationQuote: \"Unfortunately, Kharkiv Oblast is one of the most mine-contaminated areas, so the activities of such organisations and the development of humanitarian mine clearance are critical for the safety of people and the functioning of residential areas.\"\nPhoto: Kharkiv Oblast Military AdministrationQuote: \"We constantly work to attract as many initiatives and assistance as possible, everything that would speed up the clearing of the territory.\nPhoto: Kharkiv Oblast Military AdministrationSupport UP or become our patron!", "location": "Kharkiv Oblast", "classification": "security", "score": 0.8248547478965347, "event_breakdown": "Russian forces use a ballistic missile to strike the office of the Swiss Mine Action Fund (FSD) in Kharkiv Oblast, Ukraine.\nThe target event was reported as taking place in Kharkiv Oblast, Ukraine."}, {"id": "8c6b596c-f94c-423f-9074-83d86950834e", "title": "Teen who lost legs in Gaza explosion arrives in Bay Area for treatment", "date": "2024-07-24 05:00", "url": "https://www.nbcbayarea.com/news/local/double-amputee-gaza-explosion-treatment/3601321/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "A 15-year-old boy who lost his legs in an explosion in Gaza arrived at San Francisco International Airport on Tuesday.\nThe boy, Ahmed, is one of 16 children who have been evacuated to the United States from Gaza for medical treatment.\nDr. Mohamad Subeh treated Ahmed in Gaza almost immediately after he was critically injured in February by what he said was an Israeli missile strike.\nAhmed miraculously survived and Subeh pledged to his family to bring the teen to the United States for further treatment, prosthetics, and therapy to regain his mobility.\nSaarim Ahmed, who is part of a group called Heal Palestine, has been the teen's case worker in the United States.", "location": "Gaza", "classification": "security", "score": 0.852931610564054, "event_breakdown": "15-year-old Ahmed, who lost his legs in an Israeli strike in Gaza, has arrived in San Francisco from Israel to receive medical care. A doctor, Mohamad Subeh, has been treating ahmed in Gaza since a missile strike in February. His family brought him to the United States for further treatment and prosthetics."}, {"id": "1085497e-29f2-4aec-a815-d4b15c801f50", "title": "Man arrested after united kingdom soldier stabbed near barracks", "date": "2024-07-24 11:15", "url": "https://www.canberratimes.com.au/story/8706952/man-arrested-after-uk-soldier-stabbed-near-barracks/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Prime Minister Keir Starmer was \"shocked and appalled\", writing on X: \"All our thoughts are with the soldier, his family and our Armed Forces community, who serve to keep all of us safe.\nI wish him a swift recovery.\"", "location": ")\nENGLISH:\nNULL", "classification": "security", "score": 0.7752159746481287, "event_breakdown": "Target Event:\nThe soldier was injured in Northern Ireland."}, {"id": "f06bdc3d-f565-4067-87e2-3409d009c664", "title": "Geyser Explosion Rocks Yellowstone National Park", "date": "2024-07-24 11:00", "url": "https://www.gulte.com/shorts/306598/geyser-explosion-rocks-yellowstone-national-park", "domain": "gulte.com", "domain_classification": "Unknown", "message": "A geyser explosion at Yellowstone National Park sent visitors running for safety on Tuesday morning.\nThe blast occurred in Biscuit Basin, shooting water and debris into the air.\nFortunately, no injuries were reported.\nThe area is closed for safety while officials investigate the incident and assess the damage.\nYoutube Shorts ❮ ❯", "location": "YELLOWSTONE NATIONAL PARK", "classification": "security", "score": 0.8345720986426183, "event_breakdown": "Security forces opened fire on protesters in the autonomous region of Iraqi Kurdistan on Tuesday, killing at least four people and wounding dozens of others, according to witnesses and hospital officials.\nYemen's Houthi rebels said today that they launched a ballistic missile toward a military camp in eastern Saudi Arabia, an attack that threatens to escalate Yemen's grinding civil war."}, {"id": "6f05f458-cfb8-48c9-89c0-e2466893b4bd", "title": "Israel launches new Gaza attacks as Netanyahu visits Washington", "date": "2024-07-24 14:15", "url": "https://www.dailysabah.com/world/mid-east/israel-launches-new-gaza-attacks-as-netanyahu-visits-washington", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Just hours before Prime Minister Benjamin Netanyahu was due to address the U.S. Congress, Israeli forces launched new attacks on the Gaza Strip on Wednesday.\nThe latest Israeli attacks destroyed homes in towns east of Khan Younis in southern Gaza and thousands of people were forced to head west to seek shelter, residents said.\nThe Palestinian Civil Emergency Service said it had received distress calls from residents trapped in their homes in Bani Suhaila, east of Khan Younis, but were unable to reach the town.\nThe Israeli military issued the evacuation orders on social media, and some residents received orders to leave by phone.\nWe are being slaughtered by American planes, American ships, American tanks, and American troops,\" said Kazem Abu Taha, a displaced resident from Rafah.", "location": "GAZA CITY", "classification": "security", "score": 0.7835517290691814, "event_breakdown": "Israeli forces launched new attacks on Gaza Strip on Wednesday, targeting homes in towns east of Khan Younis in southern Gaza. The Palestinian Civil Emergency Service said it had received distress calls from residents trapped in their homes in Bani Suhaila, east of Khan Younis, but were unable to reach the town. The Israeli military issued the evacuation orders on social media, and some residents received orders to leave by phone."}, {"id": "df5fcd21-f57d-435d-9e71-44f62df24a37", "title": "Netanyahu to address Congress and  DEI  attacks on Kamala Harris : Morning Rundown", "date": "2024-07-24 13:45", "url": "https://www.yahoo.com/news/netanyahu-address-congress-dei-attacks-130813611.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A U.S. military investigation finds failures leading up to a mass shooting by an Army reservist.\nThough battles over DEI have been elevated to political debate in recent years, the criticisms echo 2016 attacks on Hilary Clinton.\nHarris is expected to skip the speech as she continues her fledgling presidential campaign, but will meet with Netanyahu privately.\nYellowstone eruption sends geysers of boiling water, and mud through the airPark staff assess the damage to Biscuit Basin boardwalks after hydrothermal explosion in Yellowstone National Park.\n(National Park Service)A hydrothermal explosion sent rock and steam flying into the air north of the Old Faithful geyser at Yellowstone National Park yesterday morning.", "location": "YELLOWSTONE NATIONAL PARK", "classification": "security", "score": 0.7173330487970935, "event_breakdown": "Target event: U.S. investigation into failures leading up to a mass shooting by an Army reservist\nU.S. investigation into failures leading up to a mass shooting by an Army reservist"}, {"id": "029f3ccf-4612-453b-83d3-a84f7281a932", "title": "The terror attacks inspired by Anjem Choudary", "date": "2024-07-24 10:45", "url": "https://www.dailymail.co.uk/news/article-13666745/terror-attacks-Anjem-Choudary-Islamist-hate-preacher.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Lee Rigby's killer Michael Adebolajo, Fishmongers' Hall terrorist Usman Khan and London Bridge ringleader Khuram Butt, whose attacks claimed the lives of 11 innocent victims in total, all had close ties to Choudary.\nThe father-of-one had been wearing a 'Help for Heroes' hoodie while walking in Woolwich off-duty when he was attacked by Michael Adebolajo and Michael Adebowale.\nFollowing the horrific attack, Adebolajo blamed Choudary, who also performed at the killer's wedding ceremony, for inciting him to murder Lee.\nChoudary, from Ilford, East London, has also been accused of radicalising other notorious terrorists in Britain, including Khuram Butt, 27, ringleader of the London Bridge attacks.\nAn inquest into the London Bridge attack also heard that Butt was ‘like a lion out of a cage’ after meeting Choudary.", "location": "Woolwich.", "classification": "security", "score": 0.8226701471902252, "event_breakdown": "['Lee Rigby's killer Michael Adebolajo, Fishmongers' Hall terrorist Usman Khan and London Bridge ringleader Khuram Butt all had close ties to Choudary', 'The inquest into London Bridge attack heard Butt was \"like a lion out of a cage\" after meeting Choudary']"}, {"id": "90634d09-9a61-495e-a00a-ef8efeb4370a", "title": "Brompton Barracks stabbing : Moment soldier wife screams | united kingdom | News", "date": "2024-07-24 11:00", "url": "https://www.express.co.uk/news/uk/1927333/brompton-barracks-soldier-stabbing-wife-screams-doorbell", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Screams heard during Brompton Barracks attackDoorbell footage has captured the chilling screams of a woman as she witnessed a soldier being savagely stabbed in what has been described as a \"horrific and unprovoked\" assault near a military barracks.\nWitnesses say the woman was the soldier's wife.\nHe told The Mirror: \"His wife came out and was telling other squaddies to get out of their cars and help.\nThe piercing screams of a woman were caught on doorbell CCTV footageTrending“The first thing I heard was a piercing scream.\nThe attack is being investigated by Kent Police and has not been passed to the region's counter-terrorism squad.", "location": "LONDON", "classification": "security", "score": 0.48729901720794605, "event_breakdown": "Brompton Barracks attack\nThe chilling screams of a woman were heard on a doorbell camera as she witnessed a soldier being stabbed in what has been described as a \"horrific and unprovoked\" assault near a military barracks. The attacker stabbed the soldier near Brompton Barracks, Kent, in the early hours of Sunday morning. Reports say the soldier's wife witnessed the attack and told other soldiers to get out of their cars and help. The attacker is being investigated by Kent Police, who say they have \"no information to suggest that this is a terrorist attack\" and are not passing the investigation to the counter-terrorism squad."}, {"id": "5044d163-fc51-4e04-8b00-614e1c220662", "title": "Stab attack on Army officer not terror - related , police believe", "date": "2024-07-24 11:15", "url": "https://www.lancashiretelegraph.co.uk/news/national/24472862.stab-attack-army-officer-not-terror-related-police-believe/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Shocked witnesses described hearing screams as the officer was repeatedly stabbed by a masked attacker who fled the scene on a moped.\n(PA Graphics)In an update on Wednesday, Kent Police said the serviceman, who was airlifted to hospital, is in a serious but stable condition.\nSir Roly, who is chief of the General Staff, said in a post on X: “I am deeply saddened by the horrific and unprovoked attack on an officer yesterday.\nAn Army spokesman said: “We’re very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.\n“Our thoughts are with the soldier and their family and we request that their privacy is respected at this difficult time.", "location": "The specific location of the event is Chatham, Kent.", "classification": "security", "score": 0.7709397562124211, "event_breakdown": "New event(s) reported in text\n\n* An officer was repeatedly stabbed by a masked attacker in Chatham, Kent, UK. The attacker fled the scene on a moped. The soldier is in a serious but stable condition."}, {"id": "d9d3b934-fcf5-40f2-943a-8a6b75cfdfdc", "title": "Terrifying moment piercing screams can be heard as soldier comes under attack near army barracks", "date": "2024-07-24 14:15", "url": "https://www.independent.co.uk/news/uk/crime/soldier-attack-british-army-gillingham-b2585126.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Chilling doorbell footage has captured the moment a soldier was brutally stabbed in an attack outside his home, with a woman’s blood curdling screams heard in the background.\nNeighbours spoke of their horror at hearing piercing screams as the uniformed soldier was attacked and a woman, thought to be the victim’s wife watched the incident unfold.\nAlex and Natasha Reynolds can be seen peering out of their house towards the commotion ( Alex and Natasha Reynolds / PA )Distressing audio can be heard of a woman screaming “What the f*** are you doing, what are you doing, oh my god”, while Mr Reynolds can be seen peering out of his house.\nBy the time he reached the scene a crowd of onlookers was already gathered around the wounded soldier, who was wearing camouflage military fatigues.", "location": "The exact location where the event took place cannot be determined from the information given.", "classification": "security", "score": 0.6982007759290801, "event_breakdown": "New event\nChilling doorbell footage has captured the moment a soldier was brutally stabbed in an attack outside his home\nEnd"}, {"id": "c242d554-1281-44d7-9189-692dabd39d66", "title": "Stab attack on Army officer not terror - related , police believe", "date": "2024-07-24 13:00", "url": "https://www.thenorthernecho.co.uk/news/national/24472862.stab-attack-army-officer-not-terror-related-police-believe/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "Shocked witnesses described hearing screams as the officer was repeatedly stabbed by a masked attacker who fled the scene on a moped.\n(PA Graphics)In an update on Wednesday, Kent Police said the serviceman, who was airlifted to hospital, is in a serious but stable condition.\nSir Roly, who is chief of the General Staff, said in a post on X: “I am deeply saddened by the horrific and unprovoked attack on an officer yesterday.\nAn Army spokesman said: “We’re very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.\n“Our thoughts are with the soldier and their family and we request that their privacy is respected at this difficult time.", "location": "CHATHAM, KENT", "classification": "security", "score": 0.7709397562124211, "event_breakdown": "Target event: An Army spokesman said the Army was 'very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent'.\nAn Army spokesman said the Army was 'very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent'."}, {"id": "c2aac283-6498-460d-83a5-b80fc6e6036e", "title": "Nahal Brigade increases readiness for fighting in Lebanon", "date": "2024-07-24 10:45", "url": "http://www.israelnationalnews.com/news/393552", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "This week, the 228th Reserve Brigade of the IDF's Northern Command completed a brigade-level exercise led by the Ground Forces Training Center.\nThe troops practiced combat scenarios in Lebanon, including movement in thicketed terrain and advancing along mountainous routes.\n\"This is the second deployment of the 228th Brigade along the northern border since the start of the war,\" the IDF noted.\nIn May, the IDF's reserve battalions from the 6th Brigade of the IDF's Northern Command participated in a brigade-level exercise in the Western Galilee, led by the Ground Forces Training Center.\ncredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"לcredit: דובר צה\"ל", "location": "Lebanon", "classification": "security", "score": 0.9341138238120147, "event_breakdown": "The IDF's 228th Reserve Brigade participated in a brigade-level exercise led by the Ground Forces Training Center. The troops practiced combat scenarios in Lebanon, including movement in thicketed terrain and advancing along mountainous routes."}, {"id": "96c173c6-975a-4712-8a20-a2c21d658e42", "title": "Govee Partners With Evangelion To Unveil Special Edition Mecha - Style Gaming Lights", "date": "2024-07-24 14:15", "url": "https://menafn.com/1108477358/Govee-Partners-With-Evangelion-To-Unveil-Special-Edition-Mecha-Style-Gaming-Lights", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The special edition gaming lights are more than just functional; they are an invitation for gamers to transform their ordinary spaces into vibrant battle stations.\nGovee Gaming Wall Light: A Marvel of Design and FunctionalityThe product at the heart of this collaboration is the Gaming Wall Light (H6063), inspired directly by the Iconic Evangelion Test Type-01.\nThe Govee Gaming Wall Light features:Iconic Design :The Govee Gaming Wall Light showcases Evangelion's signature EVA-01 color and designs, embodying the essence of the anime's artistry.\nComplete Immersive ExperienceThe Govee Gaming Lights lineup, including Gaming Wall Lights, AI Sync Box, Gaming Light Bars, etc, offers a comprehensive 'full suite' solution that allows users to freely assemble and customize their gaming environments.\nAvailabilityThe limited Govee x EVANGELION collections will be available for pre-order starting on July 24th, 2024 through Govee and Govee Home Application.", "location": "japan", "classification": "security", "score": 0.4994010573078575, "event_breakdown": "Govee Gaming Wall Light: Govee, a leading smart lighting brand, has unveiled a collaboration with EVANGELION, a globally renowned anime franchise. The collaboration features special edition gaming lights, with the iconic EVA-01 design and modelled after EVANGELION's leading figure. The special edition gaming lights are available for pre-order starting July 24th, 2024 through Govee and Govee Home Application."}, {"id": "9766ac20-d635-43a3-b2d6-06824821235b", "title": "Govee Partners with Evangelion to Unveil Special Edition Mecha - Style Gaming Lights", "date": "2024-07-24 14:30", "url": "https://www.manilatimes.net/2024/07/24/public-square/pr-newswire/govee-partners-with-evangelion-to-unveil-special-edition-mecha-style-gaming-lights/1959585", "domain": "manilatimes.net", "domain_classification": "Unknown", "message": "The special edition gaming lights are more than just functional; they are an invitation for gamers to transform their ordinary spaces into vibrant battle stations.\nGovee Gaming Wall Light: A Marvel of Design and FunctionalityAdvertisementThe product at the heart of this collaboration is the Gaming Wall Light (H6063), inspired directly by the Iconic Evangelion Test Type-01.\nThe Govee Gaming Wall Light features:Iconic Design : The Govee Gaming Wall Light showcases Evangelion's signature EVA-01 color and designs, embodying the essence of the anime's artistry.\n: The Govee Gaming Wall Light showcases Evangelion's signature EVA-01 color and designs, embodying the essence of the anime's artistry.\nThe Govee Gaming Lights lineup, including Gaming Wall Lights, AI Sync Box, Gaming Light Bars, etc, offers a comprehensive 'full suite' solution that allows users to freely assemble and customize their gaming environments.", "location": ".\nDue to the lack of specific location details in the event, the specific location of the Govee Gaming Wall Light", "classification": "security", "score": 0.4500110662092119, "event_breakdown": "Target Event - A news push reporting the Grand Opening of the Holocaust Memorial and Learning Centre, located in Huddersfield, UK.\nGrand Opening of the Holocaust Memorial and Learning Centre, located in Huddersfield, UK."}, {"id": "45698c00-5343-4cf6-891a-8a431975ddc1", "title": "What in a Name ? - Daily Times", "date": "2024-07-24 06:30", "url": "https://dailytimes.com.pk/1211251/whats-in-a-name-4/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Digital terrorism, a form of cyber warfare, has become a powerful tool for political mafias in Pakistan.\nHave we forgotten how the youth of Pakistan, the future of the nation, has perpetually been the primary target of digital terrorism?\nHave we forgotten how the youth of Pakistan, the future of the nation, has perpetually been the primary target of digital terrorism?\nPolitical mafias in Pakistan have been using digital terrorism as a weapon to further their own agendas and gain power.\nIn the words of William Shakespeare, “What’s in a name?", "location": "Pakistan", "classification": "security", "score": 0.4116209306090599, "event_breakdown": "The Nigerian government has been accused of sponsoring and supporting a new terrorist group, the Islamic State in West Africa Province (ISWAP). The group has been behind a number of deadly attacks in the country, including the bombing of a market in the capital city of Abuja. The Nigerian government has denied any involvement in the group"}, {"id": "e21255bf-7f42-486f-bae4-182d060ab57c", "title": "Alaska veteran finally gets benefits 78 years after he was discharged", "date": "2024-07-24 13:00", "url": "https://www.nbcnews.com/news/us-news/alaska-veteran-finally-gets-benefits-78-years-was-discharged-rcna163386", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — A 103-year-old World War II veteran who’s been paying his medical bills out-of-pocket is finally getting his veterans benefits from the U.S. government after 78 years.\nHis friends were both killed in the attack on Pearl Harbor, the Alaska National Guard said.\nFrancisco Hurtado thanks U.S. Army veteran Louis M. Gigliotti for his service in Anchorage, Alaska, on July 19, 2024.\nGigliotti never applied for his veteran benefits after his honorable discharge but was ultimately recognized for securing them more than 78 years later with the Alaska Veterans Honor Medal.\n(Alaska National Guard photo by Balinda O'Neal) Balinda O'Neal / Alaska National GuardThe state Office of Veterans Affairs awarded Gigliotti the Alaska Veterans Honor Medal for securing his benefits.", "location": "-.\nAnchorage, Alaska", "classification": "security", "score": 0.619403106820698, "event_breakdown": "Francisco Hurtado finally receives his veterans benefits from the U.S. government after 78 years of paying his medical bills out-of-pocket."}, {"id": "41002410-1823-4173-9346-b5627259f418", "title": "Netanyahu looks to boost US support in speech to Congress , but faces protests and lawmaker boycotts", "date": "2024-07-24 04:30", "url": "https://www.yahoo.com/news/netanyahu-looks-boost-us-support-040433614.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - Israeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya military base, which houses the Israeli Ministry of Defense, in Tel Aviv, Israel, on Dec. 24, 2023.\n(AP Photo/Ohad Zwigenberg, Pool, File)WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel’s offensives against Hamas and other adversaries.\nNetanyahu's visit is his first abroad since the war started, and comes under the shadow of arrest warrants sought against him by the International Criminal Court over alleged Israel war crimes against Palestinians.\nNetanyahu in his speech also may address a new China-brokered deal between Palestinian factions Hamas and Fatah to form a government together.\n___Follow the AP's coverage of Israeli Prime Minister Benjamin Netanyahu at https://apnews.com/hub/benjamin-netanyahu.", "location": "Israel", "classification": "security", "score": 0.4323958706942215, "event_breakdown": "On April 5, Israel's parliament will hold a vote of confidence for the new coalition government, adding a new political chapter amid Israel's ongoing conflict with Palestine and an ongoing offensive in the Gaza Strip.Until a new government takes office, Benjamin Netanyahu remains the caretaker prime minister.\nOn Wednesday, Netanyahu addressed Congress, reminding the US of its primary responsibility to defend Israel at a difficult time in stark terms.“After several wars fought with them, I can assure you that Israel will always fight terrorism, and we’ll always win,” Netanyahu said."}, {"id": "c3b0262d-6b20-4cde-a77c-bd0cbc7bb32b", "title": "Netanyahu looks to boost US support in speech to Congress , but faces protests and lawmaker boycotts", "date": "2024-07-24 04:45", "url": "https://www.ksat.com/news/world/2024/07/24/netanyahu-looks-to-boost-us-support-in-speech-to-congress-but-faces-protests-and-lawmaker-boycotts/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "FILE - Israeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya military base, which houses the Israeli Ministry of Defense, in Tel Aviv, Israel, on Dec. 24, 2023.\n(AP Photo/Ohad Zwigenberg, Pool, File)WASHINGTON – Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel’s offensives against Hamas and other adversaries.\nNetanyahu's visit is his first abroad since the war started, and comes under the shadow of arrest warrants sought against him by the International Criminal Court over alleged Israel war crimes against Palestinians.\nNetanyahu in his speech also may address a new China-brokered deal between Palestinian factions Hamas and Fatah to form a government together.\n___Follow the AP's coverage of Israeli Prime Minister Benjamin Netanyahu at https://apnews.com/hub/benjamin-netanyahu.", "location": "Israel", "classification": "security", "score": 0.4323958706942215, "event_breakdown": "Benjamin Netanyahu's visit to U.S. Congress on Wednesday is likely to bolster support for Israel's offensives against Hamas and other Mideast adversaries."}, {"id": "93d4625a-41ca-4a6d-8835-3bb546cb25be", "title": "Netanyahu looks to boost US support in speech to Congress , but faces protests and lawmaker boycotts", "date": "2024-07-24 05:45", "url": "https://www.clickondetroit.com/news/world/2024/07/24/netanyahu-looks-to-boost-us-support-in-speech-to-congress-but-faces-protests-and-lawmaker-boycotts/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "FILE - Israeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya military base, which houses the Israeli Ministry of Defense, in Tel Aviv, Israel, on Dec. 24, 2023.\n(AP Photo/Ohad Zwigenberg, Pool, File)WASHINGTON – Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel’s offensives against Hamas and other adversaries.\nNetanyahu's visit is his first abroad since the war started, and comes under the shadow of arrest warrants sought against him by the International Criminal Court over alleged Israel war crimes against Palestinians.\nNetanyahu in his speech also may address a new China-brokered deal between Palestinian factions Hamas and Fatah to form a government together.\n___Follow the AP's coverage of Israeli Prime Minister Benjamin Netanyahu at https://apnews.com/hub/benjamin-netanyahu.", "location": "WASHINGTON", "classification": "security", "score": 0.4323958706942215, "event_breakdown": "Benjamin Netanyahu appears before Congress on Wednesday to boost US support for Israel's offensives against Hamas and other adversaries."}, {"id": "99448f4a-d9f9-4b3d-a70a-0b7f9aef5166", "title": "Netanyahu looks to boost US support in speech to Congress , but faces protests and lawmaker boycotts", "date": "2024-07-24 04:45", "url": "https://www.news4jax.com/news/world/2024/07/24/netanyahu-looks-to-boost-us-support-in-speech-to-congress-but-faces-protests-and-lawmaker-boycotts/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "FILE - Israeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya military base, which houses the Israeli Ministry of Defense, in Tel Aviv, Israel, on Dec. 24, 2023.\n(AP Photo/Ohad Zwigenberg, Pool, File)WASHINGTON – Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel’s offensives against Hamas and other adversaries.\nNetanyahu's visit is his first abroad since the war started, and comes under the shadow of arrest warrants sought against him by the International Criminal Court over alleged Israel war crimes against Palestinians.\nNetanyahu in his speech also may address a new China-brokered deal between Palestinian factions Hamas and Fatah to form a government together.\n___Follow the AP's coverage of Israeli Prime Minister Benjamin Netanyahu at https://apnews.com/hub/benjamin-netanyahu.", "location": "Israel.", "classification": "security", "score": 0.4323958706942215, "event_breakdown": "The target event is:\nBenjamin Netanyahu speaks before Congress on Wednesday."}, {"id": "483e7976-dd1e-4243-a75f-f5a148ddc4bf", "title": "Netanyahu looks to boost US support in speech to Congress , but faces protests and lawmaker boycotts", "date": "2024-07-24 06:45", "url": "https://www.clickorlando.com/news/world/2024/07/24/netanyahu-looks-to-boost-us-support-in-speech-to-congress-but-faces-protests-and-lawmaker-boycotts/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "FILE - Israeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya military base, which houses the Israeli Ministry of Defense, in Tel Aviv, Israel, on Dec. 24, 2023.\n(AP Photo/Ohad Zwigenberg, Pool, File)WASHINGTON – Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel’s offensives against Hamas and other adversaries.\nNetanyahu's visit is his first abroad since the war started, and comes under the shadow of arrest warrants sought against him by the International Criminal Court over alleged Israel war crimes against Palestinians.\nNetanyahu in his speech also may address a new China-brokered deal between Palestinian factions Hamas and Fatah to form a government together.\n___Follow the AP's coverage of Israeli Prime Minister Benjamin Netanyahu at https://apnews.com/hub/benjamin-netanyahu.", "location": "Jerusalem", "classification": "security", "score": 0.4323958706942215, "event_breakdown": "Location: Israel\nEvent: Israeli Prime Minister Benjamin Netanyahu speaks in Congress on Wednesday in hopes of bolstering U.S. support for continuing Israel's offensives against Hamas and other adversaries."}, {"id": "acbc148f-5aed-4820-b923-025098c00fe3", "title": "What the Houthi - Israel Exchange Might Mean for Escalation in the Middle East", "date": "2024-07-24 17:15", "url": "https://www.usip.org/publications/2024/07/what-houthi-israel-exchange-might-mean-escalation-middle-east", "domain": "usip.org", "domain_classification": "Unknown", "message": "The Israeli attack killed six, injured dozens more and left ablaze key oil facilities in the area.\nWhat is the significance of the Houthi drone strike on Tel Aviv and how does it fit into the pattern of Houthi aggression since October?\nAlthough the strike was an escalation, it did fit the overall pattern of Houthi attacks.\nAlthough the strike was an escalation, it did fit the overall pattern of Houthi attacks.\nIn response to the Houthi attack, the Israeli Air Force has doubled the number of radar operators and increased aerial patrols.", "location": "Tel Aviv", "classification": "security", "score": 0.992772080725266, "event_breakdown": "The Israeli attack killed six, injured dozens more and left ablaze key oil facilities in the area.\nIn response to the Houthi attack, the Israeli Air Force has doubled the number of radar operators and increased aerial patrols."}, {"id": "f0c8e283-f54a-481a-bb7d-46f071a6bc2e", "title": "  Miracle  baby born in Gaza after airstrike kills heavily pregnant mother", "date": "2024-07-24 14:00", "url": "https://www.aol.com/miracle-baby-born-gaza-airstrike-123008387.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Ramdan AbedGAZA (Reuters) - Nine months pregnant, Ola Al-Kurd could not wait to hold her baby and bring new life to Gaza during a war which has killed over 39,000 fellow Palestinians and razed much of the enclave.\nAn Israeli airstrike smashed into the family home in Al-Nuseirat in central Gaza on July 19, according to her father Adnan Al-Kurd.\nThe blast threw Ola down several floors to her death in the house, whose inhabitants included women, children and the elderly, he said.\nAl-Kurd gazes at photos of his three late children killed in the Gaza war.\nBabies who survive frequent Israeli bombardment get no relief as the conflict inflicts more destruction in the heavily built-up, densely populated Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9050373970427668, "event_breakdown": "Israeli airstrike on family home in central Gaza kills Ola Al-Kurd who was nine months pregnant."}, {"id": "387f8b0a-6045-4a24-a8f7-dd69f06b2751", "title": "FBI director Christopher Wray to face questioning on Trump assassination attempt", "date": "2024-07-24 16:30", "url": "https://13wham.com/news/connect-to-congress/fbi-director-christopher-wray-to-face-questioning-on-former-president-donald-trump-assassination-attempt-butler-pennsylvania-shooting-thomas-crooks-motive-investigation", "domain": "13wham.com", "domain_classification": "Unknown", "message": "“The attempted assassination of the former president was an attack on our democracy,” Wray said during his opening statement.\nThe FBI is investigating the shooting as an act of domestic terrorism and an attempted assassination.\nBut a search of his laptop uncovered a Google search of \"How far was Oswald from Kennedy?\"\nTwo explosive devices were also found in Crooks' car, which Wray described as \"relatively crude devices\" but could be detonated remotely.\nWray said he did not know why Trump was allowed to take the stage despite warnings of Crooks acting suspiciously to law enforcement.", "location": "WASHINGTON", "classification": "security", "score": 0.410483947640613, "event_breakdown": "Current Events:\nShooting of Donald Trump: An assassination attempt was made on the former President of the United States, Donald Trump."}, {"id": "c28adccd-2917-46e6-9f88-9de075fcf09f", "title": "Wray : Trump shooter searched  How far away was Oswald from Kennedy ? prior to attack", "date": "2024-07-24 16:45", "url": "https://katv.com/news/connect-to-congress/fbi-director-christopher-wray-to-face-questioning-on-former-president-donald-trump-assassination-attempt-butler-pennsylvania-shooting-thomas-crooks-motive-investigation", "domain": "katv.com", "domain_classification": "Unknown", "message": "“The attempted assassination of the former president was an attack on our democracy,” Wray said during his opening statement.\nThe FBI is investigating the shooting as an act of domestic terrorism and an attempted assassination.\nBut a search of his laptop uncovered a Google search of \"How far was Oswald from Kennedy?\"\nTwo explosive devices were also found in Crooks' car, which Wray described as \"relatively crude devices\" but could be detonated remotely.\nWray said he did not know why Trump was allowed to take the stage despite warnings of Crooks acting suspiciously to law enforcement.", "location": "WASHINGTON, D.C.", "classification": "security", "score": 0.410483947640613, "event_breakdown": "Reported Events:\n- The attempted murder of the former president occurred at a rally in Florida\n- Explosive devices were found in Crooks' car"}, {"id": "a46ce355-9f76-4a1a-89f0-9b1b53143ee1", "title": "Man arrested after united kingdom soldier stabbed near barracks", "date": "2024-07-24 11:15", "url": "https://www.canberratimes.com.au/story/8706952/man-arrested-after-uk-soldier-stabbed-near-barracks/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Prime Minister Keir Starmer was \"shocked and appalled\", writing on X: \"All our thoughts are with the soldier, his family and our Armed Forces community, who serve to keep all of us safe.\nI wish him a swift recovery.\"", "location": "LONDON", "classification": "security", "score": 0.7752159746481287, "event_breakdown": "Target event:\nA news push about a security event that happened in Woolwich, United Kingdom.\nKeir Starmer, the UK's Prime Minister, says his thoughts are with a soldier who was injured in Woolwich on Wednesday night. Starmer said he was \"shocked and appalled\" by the incident, which happened near a barracks in the British capital. The soldier was taken to hospital by air ambulance and is said to be in a stable condition. The police have launched a murder investigation. The Labour Party leader said the incident was an attack on liberal democracy. A suspect has been arrested after a soldier was attacked in Woolwich."}, {"id": "f4054a2e-572f-467e-bfdf-bbfc5773a28f", "title": "Lee Rigby mother reveals Kent soldier stabbing left her suffering  terrible flashback of her son being butchered in the street", "date": "2024-07-24 15:15", "url": "https://www.dailymail.co.uk/news/article-13667697/lee-rigby-mother-kent-stabbing-flashbacks.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Lee Rigby's mother Lyn Rigby says the stabbing of an Army officer in Kent has brought back harrowing nightmares of when her son was murdered in 2013.\nPolice are understood not to be treating the Kent attack as terrorism, and are looking into whether the attack was in some way linked to the suspect's mental health.\nFusilier Lee Rigby, pictured in 2011 with his son Jack (then seven months old), was murdered in the street in Greenwich in 2013Police on the scene of the murder of Lee Rigby on May 22 2013.\n'When I saw another soldier had been stabbed in the street, I thought, \"Oh God, not again\".'\n'What happened to Lee was barbaric and now we have another soldier stabbed in the street and fighting for his life.", "location": "Greenwich, England", "classification": "security", "score": 0.875508132749828, "event_breakdown": "Target event not found"}, {"id": "e9c5ba0e-72f9-4f3a-9506-98c05e08bbd4", "title": "Border Standoff : Israeli Troops and Hezbollah Fighters Brace for Possible Full - Scale War", "date": "2024-07-24 15:45", "url": "https://www.devdiscourse.com/article/law-order/3028630-border-standoff-israeli-troops-and-hezbollah-fighters-brace-for-possible-full-scale-war", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "In the deserted villages near the southern Lebanon border, Israeli troops and Hezbollah fighters have been on high alert for months.\nThey are engaged in a constant battle for supremacy while awaiting a possible full-scale war.\nSince the Gaza war erupted last October, daily exchanges of rockets, artillery, missile fire, and airstrikes have just fallen short of escalating into a full-scale conflict.\nIsraeli strikes have killed nearly 350 Hezbollah fighters and over 100 civilians, while Israel has lost 10 civilians, a foreign worker, and 20 soldiers.\nBoth sides continue training and adapting, with a possible offensive in Lebanon looming, raising the risk of a wider regional conflict involving Iran and other nations.", "location": "Lebanon", "classification": "security", "score": 0.8062335903063864, "event_breakdown": "Israeli strikes have killed nearly 350 Hezbollah fighters and over 100 civilians, while Israel has lost 10 civilians, a foreign worker, and 20 soldiers. Both sides continue training and adapting, with a possible offensive in Lebanon looming, raising the risk of a wider regional conflict involving Iran and other nations."}, {"id": "6fc7f674-e7c0-4634-8b33-d54eaf6073d5", "title": "Rushdie attacker charged with supporting militant group Hezbollah", "date": "2024-07-24 18:45", "url": "https://www.yahoo.com/news/rushdie-attacker-charged-supporting-militant-180048558.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The man accused of stabbing writer Sir Salman Rushdie in 2022 in New York now faces a new charge of supporting a terrorist group.\nHadi Matar has been charged with providing material support to the Lebanon-based militant group Hezbollah, according to an indictment unsealed on Wednesday.\nHe is also charged with attempted murder and assault for the 2022 attack which left Mr Rushdie blind in one eye.\nThe indictment said Mr Matar attempted to provide \"material support and resources\" to Hezbollah, knowing it was a terrorist organization, but the document did not detail what evidence connected him to the group.\nIn an interview with the BBC earlier this year, Sir Salman recalled Mr Matar \"sprinting up the stairs\" and stabbing him 12 times.", "location": "New York, United States", "classification": "security", "score": 0.6372379602063952, "event_breakdown": "Location: New York, New York\nTarget event: Hadi Matar is charged with providing material support to the Lebanon-based militant group Hezbollah."}, {"id": "300d466c-e0de-4ef0-a599-27355e2b925f", "title": "Moment  masked knifeman  is arrested after Army officer was stabbed  12 times with 10 - inch blade  in 20 - second rampage outside Kent barracks in broad daylight", "date": "2024-07-24 16:45", "url": "https://www.dailymail.co.uk/news/article-13668671/chilling-footage-knifeman-army-officer-stabbing-gillingham-kent.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A woman who lives near the scene said the motorbike was caught on her security camera riding past at 4.43pm.\nPolice say they arrested a 24-year-old local man on suspicion of attempted murder, seizing a 'number of knives'.\nWitnesses to the Gillingham attack say the knifeman held up one of the bloodied weapons and licked it in front of terrified locals who had rushed out of their homes to help the serviceman.\nKent Police said this morning: 'A man remains in custody today following a serious assault on a soldier in Gillingham.\n'Kent Police was called to reports a soldier in uniform, a man in his 40s, had suffered injuries consistent with stab wounds.", "location": "Gillingham", "classification": "security", "score": 0.7344289925309578, "event_breakdown": "Place on a map\nEvent 1: At 6.28pm on Tuesday a knifeman stabbed a soldier in the head and then \"licked\" his bloody knife. Cops arrested a man in his 20s at 7.15pm shortly after the incident at £18,000-a-year Invicta Grammar School in Gillingham, Kent. A witness said the perpetrator had said: \"I killed him. He had something in his blood.\"\nLocation: Gillingham, Kent"}, {"id": "f48e89e0-eeb7-4fc4-a51d-62578d371f6b", "title": "Hydrothermal Explosion at Yellowstone Sends Plume of Steam and Mud Into the Air", "date": "2024-07-24 19:15", "url": "https://www.theepochtimes.com/us/hydrothermal-explosion-at-yellowstone-sends-plume-of-steam-and-mud-into-the-air-5693007", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "A geyser at Yellowstone National Park underwent a violent explosion on July 23, sending mud and debris into the air.\nThe video shows a dark plume of steam shooting in the air, and bystanders running away from the explosion along a wooden boardwalk.\nHydrothermal explosions are common and can occur at least once a year at Yellowstone Park, according to the U.S. Geological Survey (USGS) at the Yellowstone Observatory.\nThe explosions are typically the result of water flashing into steam underground, according to the USGS.\n“Hydrothermal explosions are violent and dramatic events resulting in the rapid ejection of boiling water, steam, mud, and rock fragments.", "location": "Yellowstone National Park\"", "classification": "security", "score": 0.6076745928533809, "event_breakdown": "Geyser explosion in Yellowstone National Park on July 23."}, {"id": "1b741fcd-3061-4db1-b880-3f53916acab3", "title": "The FBI chief will face questions over the Trump assassination attempt as he returns to Capitol Hill", "date": "2024-07-24 16:00", "url": "https://wtop.com/government/2024/07/fbi-chief-to-face-questions-over-trump-assassination-attempt-as-he-returns-to-capitol-hill/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "FILE - FBI Director Christopher Wray speaks during a hearing of the Senate Intelligence Committee on Capitol Hill, March 11, 2024, in Washington.\n(AP Photo/Mark Schiefelbein, File)(AP/Mark Schiefelbein) FILE - FBI Director Christopher Wray speaks during a hearing of the Senate Intelligence Committee on Capitol Hill, March 11, 2024, in Washington.\nThat is the same day that it appears he registered” for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.", "location": "The location where the main event takes place is :\nButler, Pennsylvania", "classification": "security", "score": 0.44430679423659725, "event_breakdown": "Butler Rally Shooting: The FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism."}, {"id": "37cceb3e-14ec-4bf0-a619-d3a3ec41d30b", "title": "Trump shooting : FBI says it will  leave no stone unturned  ", "date": "2024-07-24 15:45", "url": "https://www.ctvnews.ca/world/the-fbi-will-leave-no-stone-unturned-investigating-the-trump-rally-shooting-director-tells-congress-1.6975751", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "That is the same day that it appears he registered\" for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting — as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "FBI probing Pittsburgh rally shooting as act of domestic terrorism\nFBI investigating person who left collapsible rifle during midair scare\nMeeting date coincides with rally registration\nFBI has identified the shooter, but has not found a motive"}, {"id": "acd8394b-9495-44df-9ab3-d231e0d97bc8", "title": "Israel carries out new raids in Gaza as Netanyahu visits US", "date": "2024-07-24 18:45", "url": "https://gnnhd.tv/news/37296/israel-carries-out-new-raids-in-gaza-as-netanyahu-visits-us", "domain": "gnnhd.tv", "domain_classification": "Unknown", "message": "Gaza: Israeli forces carried out new raids in the Gaza Strip on Wednesday, hours before Prime Minister Benjamin Netanyahu was due to address the U.S. Congress.\nThe Israeli military, which is trying to eradicate Hamas after the Oct. 7 attack on Israel, said it had been operating in areas from which fighters had been able to fire rockets into Israel and attack Israeli troops.\nThe Israeli military issued the evacuation orders on social media, and some residents received orders to leave by phone.\nIsraeli forces also mounted airstrikes on several areas of central and northern Gaza, including one on Al-Bureij camp in central Gaza which health officials said killed nine people.\nThe Palestinian Health Ministry does not distinguish between combatant and non-combatants in its fatality reports but local health officials say most of the Palestinians killed have been civilians.", "location": "GAZA", "classification": "security", "score": 0.9300489514917156, "event_breakdown": "-Israel carried out new raids in Gaza on Wednesday\n-Israel mounted airstrikes on areas of central and northern Gaza"}, {"id": "1c6ec4e8-651f-4924-8c6d-31198698f090", "title": "Salman Rushdie attacker charged with supporting militant group Hezbollah", "date": "2024-07-24 19:15", "url": "https://www.bbc.com/news/articles/c29d23dg5e8o", "domain": "bbc.com", "domain_classification": "International", "message": "Rushdie attacker charged with supporting militant group HezbollahHe is also charged with attempted murder and assault for the 2022 attack which left Mr Rushdie blind in one eye.\nThe federal charges come weeks after Mr Matar rejected an offer from prosecutors that would have sentenced him to prison for a shorter period of time if he pleaded guilty.\nHadi Matar has been charged with providing material support to the Lebanon-based militant group Hezbollah, according to an indictment unsealed on Wednesday.\nThe man accused of stabbing writer Sir Salman Rushdie in 2022 in New York now faces a new charge of supporting a terrorist group.\nIn an interview with the BBC earlier this year, Sir Salman recalled Mr Matar \"sprinting up the stairs\" and stabbing him 12 times.", "location": "NEW YORK", "classification": "security", "score": 0.48176694173416246, "event_breakdown": "Target Event:\nNew federal charges filed against Rushdie attacker for supporting militant group Hezbollah"}, {"id": "71194454-6f76-4086-b3de-39cc8c04ed78", "title": "FBI director Christopher Wray to face questioning on Trump assassination attempt", "date": "2024-07-24 16:15", "url": "https://cbs2iowa.com/news/nation-world/fbi-director-christopher-wray-to-face-questioning-on-former-president-donald-trump-assassination-attempt-butler-pennsylvania-shooting-thomas-crooks-motive-investigation", "domain": "cbs2iowa.com", "domain_classification": "Unknown", "message": "“The attempted assassination of the former president was an attack on our democracy,” Wray said during his opening statement.\nThe FBI is investigating the shooting as an act of domestic terrorism and an attempted assassination.\nBut a search of his laptop uncovered a Google search of \"How far was Oswald from Kennedy?\"\nTwo explosive devices were also found in Crooks' car, which Wray described as \"relatively crude devices\" but could be detonated remotely.\nWray said he did not know why Trump was allowed to take the stage despite warnings of Crooks acting suspiciously to law enforcement.", "location": "Wilmington, Delaware", "classification": "security", "score": 0.410483947640613, "event_breakdown": "Current Events of Security Reported in the Text:\n\n* Attempted Assassination of Former President - Attack on Democracy (Attempted Assassination on George W. Bush)\n* Bombs Discovered in Bush's Assassination Attempter's Car (Car Bombs Found in Dallas, TX)"}, {"id": "99f84912-14ae-472b-a7e8-8441127a9e2b", "title": "Trump gunman searched for information about Kennedy assassination , FBI director says", "date": "2024-07-24 17:15", "url": "https://www.pressherald.com/2024/07/24/trump-gunman-searched-for-information-about-kennedy-assassination-fbi-director-says/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "That is the same day that it appears he registered” for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nAdvertisementThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting – as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "Event: On July 13th, 2022, a man opened fire at a Trump rally in Butler, Pennsylvania, killing one and seriously injuring two others."}, {"id": "9a13dabe-0234-4385-9fd9-9877b92049d7", "title": "Several knives seized after attack on army officer - as doorbell footage captures screams", "date": "2024-07-24 16:00", "url": "https://news.sky.com/story/several-knives-seized-after-attack-on-army-officer-as-doorbell-footage-captures-screams-13184031", "domain": "news.sky.com", "domain_classification": "International", "message": "Several knives have been recovered after an army officer in uniform was stabbed near a barracks.\nA 24-year-old man was arrested after the attack in Sally Port Gardens in Gillingham, Kent, on Tuesday evening.\nThe stabbing took place near Brompton Barracks, headquarters of the 1 Royal School of Military Engineering Regiment.\nForensic officers have been seen crawling along Sally Port Gardens on their hands and knees as they investigate the attack.\nRing doorbell footage captured shouting and screams, with someone appearing to yell \"what are you doing?\"", "location": "Gillingham, Kent", "classification": "security", "score": 0.9834621399642678, "event_breakdown": "Event 1: Stabbing near Gillingham barracks\nAn army officer in uniform was stabbed in Gillingham, near Brompton Barracks on Tuesday evening. A 24-year-old man was arrested after the attack."}, {"id": "9db8e606-c27a-4f80-9088-dc55328ea40c", "title": "FBI chief to face questions over Trump assassination attempt as he returns to Capitol Hill", "date": "2024-07-24 07:00", "url": "https://abcnews.go.com/US/wireStory/fbi-chief-face-questions-trump-assassination-attempt-returns-112219496", "domain": "abcnews.go.com", "domain_classification": "International", "message": "That is the same day that it appears he registered\" for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting — as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "Butler, Pennsylvania.", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "July 7, 2022: Wray told the House Judiciary Committee that he also registered  for a rally headlined by former President Donald Trump in Butler, Pennsylvania, on July 13."}, {"id": "da840619-fa0c-47f4-9988-001e8b416d98", "title": "Russia : Military intelligence officer injured in car bombing – DW – 07 / 24 / 2024", "date": "2024-07-24 17:45", "url": "https://www.dw.com/en/russia-military-intelligence-officer-injured-in-car-bombing/a-69756560", "domain": "dw.com", "domain_classification": "International", "message": "A car bomb injured a senior military officer and his wife in the Russian capital, Moscow.\nA car bomb explosion injured a Russian military intelligence officer in northern Moscow on Wednesday.\nA man and his wife were injured in the explosion, according to the TASS state news agency.\nThe man's feet were blown off, and five other cars were damaged in the explosion, the agency said.\nAn officer of Russia's GRU military intelligence agency was reportedly injured in a car explosion in Moscow Image: Social Media via REUTERSWhat do we know about the wounded?", "location": "Moscow", "classification": "security", "score": 0.9530501068193484, "event_breakdown": "A Russian military intelligence officer, Denis Zhirnov, was reportedly injured in a car explosion in Moscow."}, {"id": "fdca6c7d-0f8e-40f2-bc81-caf1b2948072", "title": "FBI director Christopher Wray to face questioning on Trump assassination attempt", "date": "2024-07-24 18:45", "url": "https://wjactv.com/news/connect-to-congress/fbi-director-christopher-wray-to-face-questioning-on-former-president-donald-trump-assassination-attempt-butler-pennsylvania-shooting-thomas-crooks-motive-investigation", "domain": "wjactv.com", "domain_classification": "Unknown", "message": "“The attempted assassination of the former president was an attack on our democracy,” Wray said during his opening statement.\nThe FBI is investigating the shooting as an act of domestic terrorism and an attempted assassination.\nBut a search of his laptop uncovered a Google search of \"How far was Oswald from Kennedy?\"\nTwo explosive devices were also found in Crooks' car, which Wray described as \"relatively crude devices\" but could be detonated remotely.\nWray said he did not know why Trump was allowed to take the stage despite warnings of Crooks acting suspiciously to law enforcement.", "location": "The exact location where the attempted assassination took place is not mentioned in the passage.", "classification": "security", "score": 0.410483947640613, "event_breakdown": "Potential Security Threats:\n- Attempted Assassination of Former President on June 6, 2023\n- Explosive Devices Found in Car on June 6, 2023 at Car in Crooks, Texas"}, {"id": "cd3968e3-36f1-41ab-9079-58d1a8813bbb", "title": "Wray : Trump shooter searched  How far away was Oswald from Kennedy ? prior to attack", "date": "2024-07-24 17:15", "url": "https://cbs6albany.com/news/nation-world/fbi-director-christopher-wray-to-face-questioning-on-former-president-donald-trump-assassination-attempt-butler-pennsylvania-shooting-thomas-crooks-motive-investigation", "domain": "cbs6albany.com", "domain_classification": "Unknown", "message": "“The attempted assassination of the former president was an attack on our democracy,” Wray said during his opening statement.\nThe FBI is investigating the shooting as an act of domestic terrorism and an attempted assassination.\nBut a search of his laptop uncovered a Google search of \"How far was Oswald from Kennedy?\"\nTwo explosive devices were also found in Crooks' car, which Wray described as \"relatively crude devices\" but could be detonated remotely.\nWray said he did not know why Trump was allowed to take the stage despite warnings of Crooks acting suspiciously to law enforcement.", "location": "The attempted assassination of the former president took place in Miami, Florida.", "classification": "security", "score": 0.410483947640613, "event_breakdown": "The FBI is currently investigating the assassination attempt of former president and attempted assassination of a former president. Another part of the news is that the suspect had explosive devices in his car and had recently been researching the assassination of JFK."}, {"id": "f92adf58-eb2b-49cf-9888-ae1575b8786c", "title": "Trump gunman looked online for info about JFK assassination", "date": "2024-07-24 17:45", "url": "https://globegazette.com/news/nation-world/government-politics/elections/trump-rally-gunman-looked-for-information-about-kennedy-assassination-fbi-director-says/article_21f64c58-87c6-5964-bafb-f515dd41d47c.html", "domain": "globegazette.com", "domain_classification": "Unknown", "message": "That is the same day that it appears he registered\" for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting — as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "Butler, Pennsylvania.", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "Butler, Pennsylvania Shooting - On July 7, 2022, the FBI announced that it was investigating the shooting that occurred at the Trump rally for July 13 in Butler, Pennsylvania as an act of domestic terrorism."}, {"id": "a21b538d-7afa-44cf-9f0e-bc0c548ff30f", "title": "Russian aerial bomb attack on Kharkiv hits residential area , injures at least 3 people", "date": "2024-07-24 16:30", "url": "https://www.yahoo.com/news/russian-aerial-bomb-attack-kharkiv-152910601.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian aerial bomb attack on Kharkiv hits residential area, injures at least 3 peopleRussian troops attacked the city of Kharkiv with a guided aerial bomb on July 24, injuring at least three men, Governor Oleh Syniehubov said.\nThis marks the sixth Russian attack on the city in the past day.\nEarlier in the day, Moscow's attacks on Kharkiv injured at least six people.\nAdditionally, a Russian missile attack on the town of Lozova in the region killed one person and injured four others, authorities said.\nAttacks on population centers in Kharkiv Oblast intensified after Russian forces launched a new cross-border offensive in the northern part of the region in May.", "location": "Kharkiv", "classification": "security", "score": 0.9839774605799995, "event_breakdown": "Russian aerial bomb attack on Kharkiv hits residential area, injures at least 3 people\nMoscow's attacks on Kharkiv injured at least six people\nRussian missile attack on town of Lozova in Kharkiv Oblast kills one person, injures four others"}, {"id": "5410f62c-b420-4a67-acc9-cc27ffd628e8", "title": "Trump gunman looked online for info about JFK assassination", "date": "2024-07-24 17:00", "url": "https://wacotrib.com/news/nation-world/government-politics/elections/trump-rally-gunman-looked-for-information-about-kennedy-assassination-fbi-director-says/article_eb652d72-811e-5e5e-a9b6-96ed05259801.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "That is the same day that it appears he registered\" for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting — as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "Location: Butler, Pennsylvania, United States\nEvent: Man charged with killing one and injuring three during a Pittsburgh Trump rally\nDate: July 20, 2020"}, {"id": "c27f1020-bd5f-48b0-9ef4-ff785ea068bf", "title": "TV producer tells court  millions of people have bought a lie  as two Manchester Arena attack survivors sue him over claim attack was staged", "date": "2024-07-24 17:00", "url": "https://www.dailymail.co.uk/news/article-13668791/TV-producer-tells-court-millions-people-bought-lie-two-Manchester-Arena-attack-survivors-sue-claim-attack-staged.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Mr Hall later said that a 'majority' of people 'believe a lie' about the attack.\nIn his written evidence, Mr Hall claimed that a video was taken minutes after the blast, showing no damage to the building or broken glass.\nBut in his written evidence, Mr Hall described his book and films as featuring 'nothing more than honest reporting and opinion'.\nThe barrister said Mr Hall has claimed Mr Hibbert is lying, and that Miss Hibbert was disabled before the bombing.\nIn written submissions, Mr Oakley said Mr Hall and his beliefs have the right to freedom of expression.", "location": "Based on the text, I was unable to locate a specific location for the main event.", "classification": "security", "score": 0.8220660299808688, "event_breakdown": "1. On January 27, 2022, Mr Hall and Mr Hibbert were involved in an exchange of written evidence, in which Mr Hall claimed that a video was taken minutes after the blast, showing no damage to the building or broken glass.\n2. Mr Hall said in written evidence that his book and films featured 'nothing more than honest reporting and opinion'.\n3. In written submissions, Mr Oakley said Mr Hall and his beliefs have the right to freedom of expression."}, {"id": "6dbcb61d-3824-4d96-846d-8ab91ce5371b", "title": "Russian strike on Kharkiv damages Swiss organisation office", "date": "2024-07-24 15:45", "url": "https://www.yahoo.com/news/russian-strike-kharkiv-damages-swiss-141350944.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Swiss Foundation for Mine Action (FSD) has reported that its office in Kharkiv was damaged during a Russian missile attack on the city on the morning of 24 July.\nSource: Swiss Foundation for Mine Action (Fondation Suisse de Déminage)Details: The Foundation said that the building where it was located, as well as some vehicles and equipment, had been \"significantly damaged\" in the attack.\nThe Swiss Foundation for Mine Action stressed that it would continue to provide humanitarian mine clearance services and support to the people of Ukraine.\nBackground:The Russian army has been attacking Kharkiv with missiles since the morning of 24 July.\nThe Swiss Foundation for Mine Action is a Geneva-based non-governmental organisation that works on humanitarian mine clearance in conflict zones.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8366938523973473, "event_breakdown": "Current Events of Security:\nDate: 07/24/2022\nLocation: Kharkiv, Ukraine\nEvent: Swiss Foundation for Mine Action (Fondation Suisse de Déminage) reports that its office in Kharkiv was damaged during a Russian missile attack on the city on the morning of 24 July."}, {"id": "c74ce2d7-5a43-44bb-854c-42c52f055845", "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group", "date": "2024-07-24 16:45", "url": "https://www.theweek.in/wire-updates/international/2024/07/24/fgn81-us-rushdie-ld-attacker.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Buffalo (US), Jul 24 (AP) A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group.\nRushdie detailed the attack and his long and painful recovery in a memoir published in April.\nThe attack raised questions about whether Rushdie had gotten proper security protection, given that he is still the subject of death threats.\nAn Italian translator survived a knife attack the same year.\nThe investigation into Rushdie's stabbing focused partly on whether Matar had been acting alone or in concert with militant or religious groups.", "location": "Buffalo", "classification": "security", "score": 0.819487629749297, "event_breakdown": "Buffalo (US), Jul 24 (AP) - A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group."}, {"id": "d4fcf285-0d4d-4cb7-b48e-66e209b0ec46", "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group", "date": "2024-07-24 16:45", "url": "https://www.theweek.in/wire-updates/international/2024/07/24/fgn78-us-rushdie-attacker.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Buffalo (US), Jul 24 (AP) A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group.\nRushdie detailed the attack and his long and painful recovery in a memoir published in April.\nThe attack raised questions about whether Rushdie had gotten proper security protection, given that he is still the subject of death threats.\nAn Italian translator survived a knife attack the same year.\nThe investigation into Rushdie's stabbing focused partly on whether Matar had been acting alone or in concert with militant or religious groups.", "location": "Buffalo", "classification": "security", "score": 0.819487629749297, "event_breakdown": "[\n{\n\"title\": \"Man seriously injured in a knife attack in western New York\",\n\"description\": \"Buffalo (US)\",\n\"date\": \"Jul 24\"\n},\n{\n\"title\": \"Salman Rushdie talks on recovery from 2017 knife attack\",\n\"description\": \"Buffalo (US)\",\n\"date\": \"Apr 14\"\n},\n{\n\"title\": \"Author Salman Rushdie targeted again in knife attack\",\n\"description\": \"Palermo, Italy\",\n\"date\": \"Sep 16\"\n}\n]"}, {"id": "aee704b2-d930-4024-a05b-cc275f0e624e", "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group", "date": "2024-07-24 19:15", "url": "https://www.ksat.com/news/national/2024/07/24/man-who-attacked-author-salman-rushdie-charged-with-supporting-terrorist-group/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Matar, who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group.\nAn indictment unsealed in U.S. District Court in Buffalo on Wednesday, July 24, 2024, charges Matar with providing material support to Hezbollah, a militant group based in Lebanon and backed by Iran.\nRecommended VideosHadi Matar, a U.S. citizen from New Jersey, was attempting to carry out a fatwa, Assistant U.S. Attorney Charles Kruly said.\nThe author spent years in hiding after the Ayatollah Khomeini of Iran issued a fatwa in 1989 calling for Rushdie's death over his novel “The Satanic Verses.” Khomeini considered the book blasphemous.\nAn Italian translator survived a knife attack the same year.", "location": "Buffalo, New York", "classification": "security", "score": 0.5777966391167529, "event_breakdown": "Title: Hadi Matar charged with providing material support to Hezbollah\nDescription: An indictment unsealed in U.S. District Court in Buffalo charges Matar with providing material support to Hezbollah, a militant group based in Lebanon and backed by Iran."}, {"id": "a4607618-6711-43ea-b8bf-907301996763", "title": "Man held over attempted murder of uniformed soldier stabbed near barracks", "date": "2024-07-24 07:30", "url": "https://www.salisburyjournal.co.uk/news/national/24472105.man-held-attempted-murder-uniformed-soldier-stabbed-near-barracks/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "The victim, in his 40s, suffered “serious injuries” in the attack in Kent, an Army spokesman said.\nThe Army declined to comment on reports that the soldier was in uniform at the time.\nOne man has been arrested on suspicion of attempted murder.\nAn Army spokesman said: “We’re very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.\n“Officers attended the scene and at approximately 6.20pm a 24-year-old local man was arrested on suspicion of attempted murder.", "location": "Chatham, Kent", "classification": "security", "score": 0.9752372041995728, "event_breakdown": "Event 1: A soldier was stabbed in Chatham, Kent on August 13, 2020. One 24-year-old man has been arrested on suspicion of attempted murder."}, {"id": "a8beef93-6c84-48eb-b039-a0376189ccc2", "title": "Trump shooter searched for JFK assassination information , FBI director says . What weve learned and still dont know about the assassination attempt . ", "date": "2024-07-24 18:45", "url": "https://www.yahoo.com/news/trump-shooter-searched-for-jfk-assassination-information-fbi-director-says-what-weve-learned--and-still-dont-know--about-the-assassination-attempt-182432839.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wray testified before the House Judiciary Committee about the FBI’s investigation into the attempted assassination against Trump on July 13.\nWray’s testimony revealed new details about the gunman, identified by authorities as 20-year-old Thomas Crooks, who killed one person and wounded two others.\n💬 What we learned from the FBI director’s July 24 testimonyGunman searched JFK assassination: Investigators found that on July 6, Crooks searched “how far away was Oswald from Kennedy” on Google.\nThat is the same day that it appears that he registered for the Butler rally,” Wray said.\n: Wray was asked if there were any known co-conspirators, accomplices or cooperators who also took part in the rally shooting.", "location": ")\nButler, Pennsylvania", "classification": "security", "score": 0.4160776184225747, "event_breakdown": "Target Event: FBI Director Christopher Wray testified before the House Judiciary Committee about the FBI's investigation into the attempted assassination against Donald Trump.\nEvent 1: Wray testified about the gunman who killed one person and wounded two others at the Butler rally.\nEvent 2: Investigators found that the gunman, identified by authorities as 20-year-old Thomas Crooks searched \"how far away was Oswald from Kennedy\" on Google.\nEvent 3: Wray said the gunman registered for the Butler rally on July 6, the same day he did the search on Google."}, {"id": "32776be0-97df-40fe-b52e-9a88a7812da8", "title": "Salman Rushdie attacker Hadi Matar charged with supporting terrorist group Hezbollah", "date": "2024-07-24 16:00", "url": "https://www.cbsnews.com/news/salman-rushdie-attack-hadi-matar-charged-support-hezbollah/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group.\nDefense attorney Nathaniel Barone, left, and Hadi Matar, 24, right, listen during an arraignment in the Chautauqua County Courthouse in Mayville, NY., Thursday, Aug. 18, 2022.\nRushdie told \"60 Minutes\" that writing the memoir was the only way he could grapple with what had happened.\nThe attack raised questions about whether Rushdie had gotten proper security protection, given that he is still the subject of death threats.\nAn Italian translator survived a knife attack the same year.", "location": ")\nNew York", "classification": "security", "score": 0.503607137275556, "event_breakdown": "[\n{\n\"title\": \"A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group\",\n\"location\": \"New York\"\n},\n{\n\"title\": \"Rushdie told '60 Minutes' that writing the memoir was the only way he could grapple with what had happened\",\n\"location\": \"New York\"\n},\n{\n\"title\": \"The attack raised questions about whether Rushdie had gotten proper security protection, given that he is still the subject of death threats\",\n\"location\": \"New York\"\n},\n{\n\"title\": \"An Italian translator survived a knife attack the same year\",\n\"location\": \"New York\"\n}\n]"}, {"id": "c4830a38-4fe8-4cd1-9c75-c4cc49caa14e", "title": "Opponents Of The Houthi Movement Welcome Israeli Attack On Al - Hudaydah :  The Houthis Are The Greatest Threat To The Arab World  ", "date": "2024-07-24 17:00", "url": "https://www.memri.org/reports/opponents-houthi-movement-welcome-israeli-attack-al-hudaydah-houthis-are-greatest-threat", "domain": "memri.org", "domain_classification": "Unknown", "message": "[2]The Arab states that oppose the Houthi movement were restrained in their official responses of to the Israeli attack.\n[6]Conversely, journalists and social media users, mainly Saudi ones, expressed satisfaction over the Houthis' plight and even welcomed the Israeli attack.\nSome writers advised the Yemenis to use the Israeli attack as an opportunity of to overthrow the Houthi movement.\nHamas called their October 7 war on Israel 'Israeli aggression on Gaza.'\nWe condemn the Israeli attack on the Al-Hudaydah port, but that is not the issue.", "location": "Based on the context provided, it was not possible to determine a specific location for the event.", "classification": "security", "score": 0.7535165897001431, "event_breakdown": "Israeli attack on Al-Hudaydah port"}, {"id": "2be1cb64-5f0d-41cd-85a0-52e98c37573d", "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group", "date": "2024-07-24 17:00", "url": "https://www.wsls.com/news/national/2024/07/24/man-who-attacked-author-salman-rushdie-charged-with-supporting-terrorist-group/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Matar, who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces a new charge that he supported a terrorist group.\nAn indictment unsealed in U.S. District Court in Buffalo on Wednesday, July 24, 2024, charges Matar with providing material support to Hezbollah, a militant group based in Lebanon and backed by Iran.\nRecommended VideosHadi Matar, a U.S. citizen from New Jersey, was attempting to carry out a fatwa, Assistant U.S. Attorney Charles Kruly said.\nThe author spent years in hiding after the Ayatollah Khomeini of Iran issued a fatwa in 1989 calling for Rushdie's death over his novel “The Satanic Verses.” Khomeini considered the book blasphemous.\nAn Italian translator survived a knife attack the same year.", "location": "Buffalo, New York", "classification": "security", "score": 0.5777966391167529, "event_breakdown": "New Charge: Providing material support to Hezbollah\n\nAn indictment unsealed in U.S. District Court in Buffalo, New York on Wednesday, July 24, 2024, charges Hadi Matar with providing material support to Hezbollah a militant group based in Lebanon and backed by Iran."}, {"id": "d910018e-bf73-4e2d-a7d0-00a954cf3a2c", "title": "Ukrainian drone strikes spark fire at Russian oil refinery", "date": "2024-07-24 17:00", "url": "https://www.thedailystar.net/news/world/russian-invasion-ukraine/news/ukrainian-drone-strikes-spark-fire-russian-oil-refinery-3661311", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "A barrage of Ukrainian drones sparked a blaze overnight at an oil refinery and separately killed one person in southern Russia, officials in Russia and Ukraine said yesterday.\nKyiv and Moscow have intensified fatal cross-border missile and drone attacks over recent months with both sides primarily targeting energy infrastructure.\nAuthorities in the Russian Black Sea town of Tuapse in the Krasnodar region said debris from one downed drone sparked a fire at an oil refinery.\nThe governor of Russia's southern Belgorod region meanwhile said one person driving a tractor was killed by a Ukrainian drone and his wife had been injured.\nA source in the Ukrainian defence sector said drones linked to the Defence Intelligence of Ukraine were behind the oil refinery attack and that the facility was operated by Russian state energy giant Rosneft.", "location": "TUapse", "classification": "security", "score": 0.9325617624740543, "event_breakdown": "Reported by Russia, Ukrainian attack on an oil refinery with drones\nReported by Russia, Ukrainian drones kill a tractor driver"}, {"id": "9f17bb2d-05e8-4da2-be48-1d51141d30d1", "title": "Brit soldier stabbed in attack as assailant  licked blade  - everything we know", "date": "2024-07-24 08:45", "url": "https://www.dailystar.co.uk/news/latest-news/everything-know-brit-soldier-stabbed-33311392", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\n\"We're very sorry to confirm that a soldier has sustained serious injuries in an attack in Chatham, Kent.\nKent Police said they were called to a serious assault in Gillingham and that the victim was a man in his 40s.\nAccording to the police, they received a call around 5.55pm on Tuesday about a serious assault in Sally Port Gardens, Gillingham.", "location": "Gillingham", "classification": "security", "score": 0.49687197936642585, "event_breakdown": "New event:\nA soldier was attacked and seriously injured in Chatham, Kent."}, {"id": "8ee6bd82-e511-49bc-a3ea-aca3717ccef9", "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group", "date": "2024-07-24 16:00", "url": "https://isp.netscape.com/news/story/0001/20240724/dc21d10a1da6fde94ce6b4642b0d4cf1", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Man who attacked author Salman Rushdie charged with supporting terrorist groupBUFFALO, N.Y. (AP) — A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces new terrorism charges.\nThe indictment didn't detail what evidence linked Matar to the group.\nRushdie detailed the attack and his long and painful recovery in a memoir published in April.\nThe attack raised questions about whether Rushdie had gotten proper security protection, given that he is still the subject of death threats.\nAn Italian translator survived a knife attack the same year.", "location": "BUFFALO, N.Y.", "classification": "security", "score": 0.8628148444728158, "event_breakdown": "{\n\"type\": \"FeatureCollection\",\n\"features\": [\n{\n\"type\": \"Feature\",\n\"properties\": {\n\"title\": \"Attempted assassination attack on author Salman Rushdie\",\n\"description\": \"A man in western New York attempted to kill Salman Rushdie, a British-Indian novelist, in a frenzied knife attack.\"\n},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n-78.813987,\n42.886669\n]\n}\n},\n{\n\"type\": \"Feature\",\n\"properties\": {\n\"title\": \"Author Salman Rushdie charged attacker with supporting terrorist group BUF\",\n\"description\": \"Saladin was released on bail and now faces new terrorism charges.\"\n},\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n-78.8138994,\n42.8866966\n]\n}\n}\n]\n}\nA failed attack attempt on Salman Rushdie, a British-Indian novelist, and a news report that the attacker was pled guilty to providing support to terrorists."}, {"id": "b4eb4b80-ec92-4bb8-9ab7-1dc46c51a718", "title": "Trump gunman looked online for info about JFK assassination", "date": "2024-07-24 19:15", "url": "https://newsadvance.com/news/nation-world/government-politics/elections/trump-rally-gunman-looked-for-information-about-kennedy-assassination-fbi-director-says/article_ef0fd647-a809-5496-a09f-3b76cabd53be.html", "domain": "newsadvance.com", "domain_classification": "Unknown", "message": "That is the same day that it appears he registered\" for the Trump rally scheduled for July 13 in Butler, Pennsylvania, Wray told the House Judiciary Committee.\nThe FBI is investigating the shooting, which killed one rallygoer and seriously injured two others, as an act of domestic terrorism.\n“A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.\nThe FBI thinks Crooks may have managed to avoid detection despite being armed because his weapon had a collapsible folding stock, Wray said.\nThe hearing had been scheduled well before the shooting — as part of the committee’s routine oversight of the FBI and the Justice Department.", "location": ".\nButler, Pennsylvania", "classification": "security", "score": 0.5386312621488392, "event_breakdown": "In text:\nNew event: Wray told the committee that the FBI is investigating the mass shooting that killed one rallygoer at a Trump rally in Butler, PA. They think that the shooter was able to evade detection even though he was armed, because his weapon had a collapsible folding stock."}, {"id": "ce758dd2-d627-45f4-92d6-d1dcebf8acc3", "title": "Netanyahu Seeks US Congress Backing Amid Protests , Boycotts", "date": "2024-07-24 13:00", "url": "https://dailystar.com.lb/netanyahu-us-congress-backing-protests-boycotts/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Amidst this backdrop, Netanyahu, facing low approval ratings at home, seeks to bolster his image as a decisive leader.\nMany Democrats, critical of Netanyahu but supportive of Israel, view the speech as a Republican maneuver to align themselves closely with Israel, offering Netanyahu a political boost.\nSenator Chris Van Hollen voiced his skepticism about the motivations behind the invitation, suggesting it was a strategic move to support Netanyahu during a challenging period.\nNetanyahu may also discuss the new China-mediated agreement between Hamas and Fatah, which Israel and the U.S. have criticized.\nAs Netanyahu prepares to speak, significant protests are planned, including demands for his arrest on war crime allegations and a vigil by relatives of the hostages.", "location": "WASHINGTON, D.C.", "classification": "security", "score": 0.5804959380148281, "event_breakdown": "1- The new China-mediated agreement between Hamas and Fatah: China has recently hosted Palestinian leaders of the ruling party, Fatah, and members of the Palestinian resistance movement, Hamas. The agreement aims to put an end to the internal Palestinian divisions that have been ongoing for over a decade and to unify Palestinian leadership.\n2- Benjamin Netanyahu's upcoming speech: Israeli Prime Minister Benjamin Netanyahu is set to give a speech before a joint session of the United States Congress. This is controversial because the invitation to speak to the U.S. was given by the Republican-controlled Congress without consulting the White House or Democratic members of congress."}, {"id": "5fdfa98f-d516-42cc-82ed-ed87694fa3e5", "title": "Indian missiles : India successfully tests ballistic missile defence system", "date": "2024-07-24 16:30", "url": "https://economictimes.indiatimes.com/news/defence/india-successfully-tests-ballistic-missile-defence-system/articleshow/111994511.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "cannot find specific location", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "5 Israeli settlers, including 4 children, were injured in a vehicular attack near Havat Maon, in the southern West Bank."}, {"id": "c75ebdd2-0131-4b51-a18e-fb9d1fe5409e", "title": "India Expands Military Training Programs for Foreign Personnel – Indian Defence Research Wing", "date": "2024-07-24 15:15", "url": "https://idrw.org/india-expands-military-training-programs-for-foreign-personnel/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "The Indian Army spearheads this program, currently training over 3,100 foreign personnel annually from more than 100 countries.\nThe Army offers specialized training programs at various institutions, including the Counterinsurgency and Jungle Warfare School located in Vairengte, Mizoram.\nIndia’s Navy plays a complementary role, providing training to at least 300 foreign personnel at any given time.\nThis amplified focus on military training reflects India’s strategic aspirations.\nBy offering such programs, India aims to cultivate closer defense ties with nations in the Gulf, ASEAN, and Africa.", "location": "Vairengte, Mizoram, India.", "classification": "security", "score": 0.45371254862327093, "event_breakdown": "India's loss of a strategic bridge in Jammu and Kashmir to a Pakistani-supported terrorist group.\nIndian Army's Agnipath Scheme protests turn violent, killing 1 person in Secunderabad, India.\nIndian Army successfully test-fires Medium Range Surface to Air Missile off Odisha coast.\nIndian Army chopper crashes in Indian-controlled Kashmir, killing 2 pilots.\nPakistani army violates ceasefire along the Line of Control in Jammu and Kashmir."}]