[{"id": "a878b4ca-220d-49b6-94af-7e8a02c8d9e2", "title": "Holocaust survivor :  You have to be hopeful  ", "date": "2024-06-13 10:15", "url": "https://cdapress.com/news/2024/jun/13/holocaust-survivor-you-have-to-be-hopeful/", "domain": "cdapress.com", "domain_classification": "Unknown", "message": "As a young woman growing up in Holland, she survived the Holocaust and went up against the Nazis in the 1940s during World War II.\nThe luncheon was held at the Best Western Plus Coeur d'Alene Inn on what would have been the 95th birthday of Anne Frank.\nAnne Frank died at the age of 15.\nNoble and Zellman, members of Temple Beth Shalom, are the founders of the annual remembrance of the Holocaust at Temple Beth Shalom.\nShe described Anne Frank as happy and smart.", "location": "Coeur d'Alene, Idaho", "classification": "antisemitism", "score": 0.41907055839092333, "event_breakdown": "1. In Coeur d'Alene, Idaho, (USA) a memory of the Holocaust was held in joignt celebration of what would have been Anne Frank's 95th birthday\n2. The annual memory ot the Holocaust at Temple Beth Shalom in Coeur d'Alene, Idaho which was started by Noble and Zellman"}, {"id": "c0067680-a656-4a49-bccf-6efc0ab23701", "title": "9 Asian American Jews speak", "date": "2024-06-13 17:45", "url": "https://forward.com/opinion/466221/asian-american-jews-atlanta-hate-crimes-speak/", "domain": "forward.com", "domain_classification": "Unknown", "message": "In partnership with Rabbi Mira Rivera of Romemu in New York, N.Y., we’ve asked nine Asian American Jewish leaders to share their experiences in this painful time, as well as thoughts on how American Jews can and should offer support to the Asian American community.\nThe Jewish community must stand tall and proud in solidarity with Asian American communities everywhere, and with meaningful recognition of those in our own community who are both Asian and Jewish.\nThe identities, voices and work of Asian Jews must be elevated to more than just a footnote.\nThere are incredible stories out there shared by Asian American Jews, such as through LUNAR: The Jewish-Asian Film Project.\nTo share your own experiences as an Asian American Jew, contact interim opinion editor Talya Zax at [email protected] or opinion intern Zachariah Sippy at [email protected].", "location": "New York, New York", "classification": "antisemitism", "score": 0.8295771549164198, "event_breakdown": "Antisemitism is on the rise around the country, with reports coming in from coast to coast.\n\n- California: On April 30, four Jews were shot outside a synagogue in Poway near San Diego, authorities said.\n- Minnesota: In Minneapolis, Chasidic Jews are attacked again as protests continue over George Floyd's death."}, {"id": "12b80af4-a4e6-43ae-8859-702d64d0f9a1", "title": "Billboard campaign targets Central Bucks , Philadelphia teachers , accusing them of antisemitism", "date": "2024-06-13 20:30", "url": "https://www.inquirer.com/education/central-bucks-philadelphia-teachers-antisemitism-accuracy-in-media-campaign-20240613.html", "domain": "inquirer.com", "domain_classification": "Unknown", "message": "Central Bucks West High School was the site this week of an activist group’s mobile billboard targeting a Spanish teacher accused of antisemitism.\nThe trucks deployed in Philadelphia and Doylestown this week listed web domain names with each teacher’s name; on Wednesday, they routed to the same website, which noted that the U.S. Department of Education is investigating allegations of antisemitism in both the Philadelphia and Central Bucks districts.\nShapiro that reads: “Antisemitism is embedded into Philly and Bucks County schools.\nIn a message to the community Wednesday, Scanlon said Central Bucks did “not condone hate speech of any kind,” referring to a previous statement condemning antisemitism and Islamophobia.\nAbdelwahab’s social media presence has been a source of controversy for months in the district; he runs a business, AragApparel, that sells keffiyah-inspired durags and posts frequently on an associated social media account in opposition to Israel.", "location": "Doylestown, Pennsylvania", "classification": "antisemitism", "score": 0.9115829083782362, "event_breakdown": "[{\n\"type\": \"Feature\",\n\"properties\": {\n\"target\": \"Central Bucks West High School\",\n\"title\": \"Mobile Billboard Targets Spanish Teacher Accused of Antisemitism\"\n\"description\": \"Antisemitism detected in Central Bucks West High School in Doylestown, PA\"\n\"geometry\": {\n\"type\": \"Point\",\n\"coordinates\": [\n40.38222,\n-75.13611\n]\n}\n}\n}]"}]