[{"id": "3f4ea870-06ae-44b2-b97b-69f9247d3b14", "title": "Why most American Jews will and should vote for Kamala Harris", "date": "2024-08-14 10:45", "url": "https://www.jwire.com.au/why-most-american-jews-will-and-should-vote-for-kamala-harris/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Two separate issues are front and centre for American Jews in the run-up to Election Day on November 5.\nI support Kamala Harris enthusiastically in large part because there are, in fact, two Americas.\nand George W. Bush, And yes, it is the America of Kamala Harris.\nWhich brings us to why American Jews roughly 75 percent of American Jews did not want anything to do with Trump the last two go rounds and are almost certain to remain true to form this year.\nYet another reason: Almost as many American Jews support continued aid to Ukraine (77 percent) as support aid to Israel (80 percent).", "location": "California", "classification": "antisemitism", "score": 0.5356249960792572, "event_breakdown": "These are the current events of antisemitism reported in text that can be placed on a map:\nEVENT 1 (ATTACK): Man arrested on suspicion of shooting antisemitic pamphlets into a West Los Angeles synagogue, Los Angeles, California, United States.\nEVENT 2 (PROTEST): Hundreds of people gather outside London's Israeli embassy to protest antisemitism by the Labour Party, London, United Kingdom."}, {"id": "97dda6bc-e033-496d-afbe-a4261958e708", "title": "", "date": "2024-08-14 16:00", "url": "http://www.israelnationalnews.com/news/394628", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "President Isaac Herzog announced on Wednesday the launch of a pivotal global survey to shape dialogue and leadership development within the Jewish world — the first step as part of his Voice of the People initiative.\nThe survey will help in the creation of a new worldwide Jewish advisory council set to address the most pressing challenges facing Jewish communities in Israel and the Diaspora.\nThe survey we are launching today will shape the council, and therefore shape the discussions impacting the future of the Jewish people.\nI encourage everyone to participate and contribute to help build our collective future,” President Isaac Herzog said.\nThese groups will be supported by senior \"mentors\" from the Jewish world who will assist them in realizing their vision.", "location": "Israel", "classification": "antisemitism", "score": 0.6314065128579243, "event_breakdown": "Antisemitic car vandalizations and property destruction were reported in various parts of the Portland metropolitan area in Oregon on Tuesday. In a Twitter post, Chabad announced that anti-Semitic graffiti was discovered on the wall of a Chabad center in Sandy Springs, Georgia. Local police were notified of the incident."}, {"id": "47dcee96-378e-4a94-a10c-d736fbfdbe8b", "title": "", "date": "2024-08-14 17:00", "url": "https://www.israelnationalnews.com/news/394628", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "President Isaac Herzog announced on Wednesday the launch of a pivotal global survey to shape dialogue and leadership development within the Jewish world — the first step as part of his Voice of the People initiative.\nThe survey will help in the creation of a new worldwide Jewish advisory council set to address the most pressing challenges facing Jewish communities in Israel and the Diaspora.\nThe survey we are launching today will shape the council, and therefore shape the discussions impacting the future of the Jewish people.\nI encourage everyone to participate and contribute to help build our collective future,” President Isaac Herzog said.\nThese groups will be supported by senior \"mentors\" from the Jewish world who will assist them in realizing their vision.", "location": ")\nThe primary location where the Voice of the People global survey is being conducted to shape dialogue and leadership development within the", "classification": "antisemitism", "score": 0.6314065128579243, "event_breakdown": "1. On Thursday evening, Ernst Zundel, the Holocaust denier, will be buried with no notice and minimal fanfare. According to the Ernst Zundel Defense Committee, \"since the events in Paris last weekend, the security authorities [have] called for extremely high doses of caution,\" referring to concerns about a repeat of the Islamist assault on Charlie Hebdo's Paris offices. The funeral will proceed but \"without reports or flyers,\" the committee added."}]