[{"id": "8c60f6d6-7d6c-4bb7-b87e-c9069c12e633", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\"", "classification": "security", "score": 0.7192959383857653, "location": "My knowledge cut-off date is January 2022. Hamas is designated as a terrorist organization by numerous countries, including the United States, the European Union, and Israel.", "event_breakdown": "- Iranian Defense Minister Mohammad Reza Ashtiani attributes recent terrorist attacks in Iran and Russia to support from Western countries, especially the United States\n- Recent terrorist attacks in Iran and Russia believed to be the work of ISIS\n- ISIS orchestrated an explosion in Kerman, Iran in January, resulting in close to 100 deaths\n- Shooting incident outside Moscow, Russia, at the Crocus City Hall concert venue\n- An anonymous Israeli official hints at Israeli involvement in eliminating individuals behind attacks on Israeli and American assets"}, {"id": "6115b9e0-035f-4577-819d-1f0d1a3508b2", "title": "Nato chief chides members as Ukraine allies say slow arms deliveries have helped Russia", "date": "2024-04-29 22:15", "url": "https://www.scmp.com/news/world/europe/article/3260842/nato-chief-chides-members-ukraines-allies-say-slow-arms-deliveries-have-helped-russia", "message": "Outgunned, Ukraine’s troops have struggled to fend off Russian advances on the battlefield.\n“Serious delays in support have meant serious consequences on the battlefield” for Ukraine, Nato Secretary General Jens Stoltenberg told a news conference in Kyiv with Ukrainian President Volodymyr Zelensky.\nDrawn-out Ukrainian efforts to mobilise more troops, and the belated building of battlefield fortifications, are other factors undermining Ukraine’s war effort, military analysts say.\nThe Russian military is in a better position at the moment.\n“Russian forces remain unlikely to achieve a deeper operationally significant penetration in the area in the near term,” the Institute for the Study of War said in an assessment Sunday.", "classification": "world", "score": 0.47362994420940024, "location": "Kyiv", "event_breakdown": "- Ukraine's troops struggle against Russian advances on the battlefield\n- Nato Secretary General Jens Stoltenberg comments on serious delays in support for Ukraine during a news conference in Kyiv\n- Ukrainian efforts to mobilize more troops and construct battlefield fortifications are drawn-out\n- The Russian military holds a better position currently according to military analysts \n- The Institute for the Study of War states that Russian forces are unlikely to achieve a significant penetration in the area in the near term"}, {"id": "0eee68b4-e3d8-433d-928c-5e92ba62797e", "title": "Iran Claims Coalition of Ten Countries Helped Israel Block Missile Barrage", "date": "2024-04-29 23:00", "url": "https://www.breitbart.com/national-security/2024/04/29/iran-claims-coalition-of-ten-countries-helped-israel-block-missile-barrage/", "message": "According to the Israel Defense Forces (IDF), “99 percent” of all objects fired at Israel were intercepted, including all drones and cruise missiles.\nSharif reportedly accused ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n“Operation True Promise was not a military exercise but the scene of a real operation,” Sharif said, using the official Iranian term for the inept bombing.\nWhile those partnerships are well-known, several reports indicated that multiple Muslim countries within the Middle East also intercepted Iranian missiles.\nPressTV did not specify what information Sharif was using to accuse ten unnamed countries of supporting Israel.", "classification": "world", "score": 0.4050141902791532, "location": "null", "event_breakdown": "- IDF reports \"99 percent\" interception rate of objects fired at Israel, including drones and cruise missiles.\n- Sharif accuses ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n- Sharif refers to Operation True Promise as a real operation, not a military exercise, using the official Iranian term for the bombing.\n- Reports suggest multiple Muslim countries in the Middle East also intercepted Iranian missiles, although partnerships are well-known.\n- PressTV does not specify the information Sharif used to accuse ten unnamed countries of supporting Israel."}, {"id": "7192ef30-4fd6-4e42-94c5-44ca6263eac8", "title": "Iran Claims Coalition of Ten Countries Helped Israel Block Missile Barrage", "date": "2024-04-30 02:30", "url": "https://www.breitbart.com/middle-east/2024/04/29/iran-claims-coalition-of-ten-countries-helped-israel-block-missile-barrage/", "message": "According to the Israel Defense Forces (IDF), “99 percent” of all objects fired at Israel were intercepted, including all drones and cruise missiles.\nSharif reportedly accused ten countries of supporting Israel to make the false case that all 11 countries together were unable to stop the missiles.\n“Operation True Promise was not a military exercise but the scene of a real operation,” Sharif said, using the official Iranian term for the inept bombing.\nWhile those partnerships are well-known, several reports indicated that multiple Muslim countries within the Middle East also intercepted Iranian missiles.\nPressTV did not specify what information Sharif was using to accuse ten unnamed countries of supporting Israel.", "classification": "world", "score": 0.4050141902791532, "location": "null", "event_breakdown": "- Israel Defense Forces (IDF) report \"99 percent\" interception rate of objects fired at Israel, including drones and cruise missiles.\n- Sharif accuses ten countries of supporting Israel, suggesting collective inability to stop missiles.\n- Operation True Promise termed as a real operation by Sharif, referencing Iranian bombing.\n- Reports indicate multiple Muslim countries in Middle East intercepted Iranian missiles.\n- PressTV does not specify evidence used by Sharif to accuse unnamed countries of supporting Israel."}, {"id": "6d9a45fa-cbc5-40ec-a42e-c33aaef68c57", "title": "India is drawing lessons from Ukraine to counter China military might", "date": "2024-04-30 06:15", "url": "https://www.businessinsider.in/international/news/india-is-drawing-lessons-from-ukraine-to-counter-chinas-military-might/articleshow/109704444.cms", "message": "India is trying to modernize its military of 1.5 million people with lessons from Ukraine.\nAdvertisementAs India boosts defense spending amid tensions with China and Pakistan, it is closely studying the Ukraine conflict for clues to the future of warfare and how to thwart its neighbors.\nSome lessons that Indian experts have already drawn: India needs lots of artillery, drones and cyberwarfare capabilities.\nDrones have become the stars and workhorses of the air war, with both sides deploying — and losing — drones in the hundreds of thousands.\nThere are lessons here for Indian airpower, according to Arjun Subramaniam, a retired Indian Air Force air vice marshal who helped write the ORF report.", "classification": "world", "score": 0.408565658720388, "location": "The primary location where the main event is taking place is India.", "event_breakdown": "- India is trying to modernize its military of 1.5 million people with lessons from Ukraine.\n- India boosts defense spending amid tensions with China and Pakistan.\n- India is closely studying the Ukraine conflict for clues to the future of warfare and how to thwart its neighbors.\n- Indian experts have drawn lessons that India needs lots of artillery, drones, and cyberwarfare capabilities.\n- Drones have become the stars and workhorses of the air war in Ukraine.\n- Both sides in the Ukraine conflict have deployed and lost drones in the hundreds of thousands.\n- There are lessons for Indian airpower from the Ukraine conflict, according to Arjun Subramaniam, a retired Indian Air Force air vice marshal."}, {"id": "7fff4b15-0839-4622-9514-5dc6ac6779e3", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "classification": "security", "score": 0.97580677296476, "location": "Gaza", "event_breakdown": "- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in the area of northern Gaza.\n- Troops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\n- Two terrorists were identified advancing toward the troops in central Gaza, and fighter jets struck the structure, eliminating one terrorist.\n- Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam areas in southern Lebanon."}, {"id": "3d7c2168-61a1-4633-a5d6-f8f763b29a7f", "title": "Richard D . Fisher On Taiwan : Surviving The Next Four Years", "date": "2024-04-28 17:15", "url": "https://www.taipeitimes.com/News/editorials/archives/2024/04/29/2003817089", "message": "Richard D. Fisher On Taiwan: Surviving The Next Four YearsFor the incoming Administration of President-elect William Lai (賴清德), successfully deterring a Chinese Communist Party (CCP) attack or invasion of democratic Taiwan over his four-year term would be a clear victory.\nBut it could also be a curse, because during those four years the CCP’s People’s Liberation Army (PLA) will grow far stronger.\nAs such, increased vigilance in Washington and Taipei will be needed to ensure that already multiplying CCP threat trends don’t overwhelm Taiwan, the United States, and their democratic allies.\nFirst it is necessary to acknowledge that short of actual shooting, the CCP is at war with the United States, Taiwan, and most other democracies.\nRichard D. Fisher, Jr. is a senior fellow with the International Assessment and Strategy Center.", "classification": "security", "score": 0.7622794416083416, "location": "Taipei", "event_breakdown": "- Richard D. Fisher discussing the potential challenges faced by the incoming Administration of President-elect William Lai in deterring a Chinese Communist Party (CCP) attack on Taiwan\n- Warning about the growth of the People’s Liberation Army (PLA) over the next four years\n- Increased vigilance needed in Washington and Taipei to counter multiplying CCP threat trends\n- Acknowledgment of the ongoing conflict between the CCP and the United States, Taiwan, and other democracies"}, {"id": "983330db-6c8c-42a3-96cc-79dff5a3f413", "title": "Israel Strikes Hamas Rocket Launchers , Tunnel Shafts , Hezbollah Infrastructure | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 22 Nisan 5784 – Tuesday , April 30 , 2024", "date": "2024-04-30 09:00", "url": "https://www.jewishpress.com/news/israel/idf/israel-strikes-hamas-rocket-launchers-tunnel-shafts-hezbollah-infrastructure/2024/04/30/", "message": "Photo Credit: IDFIsraeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post and Hamas terror infrastructure in northern and central Gaza, the Israel Defense Forces said on Tuesday morning.\nShortly afterward, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "classification": "security", "score": 0.9504604448983363, "location": "Gaza", "event_breakdown": "Reminder: My knowledge cut-off date is January 2022."}, {"id": "084e9c6b-34bc-4800-882d-c018590b109d", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "classification": "security", "score": 0.8442121844316522, "location": "Mogadishu", "event_breakdown": "- Six employees of Hormuud Telecom killed in roadside blast on the outskirts of Mogadishu, Somalia\n- Government describes the attack as deliberate targeting against commercial companies in Somalia\n- Previous explosions have targeted Hormuud Telecom branches and vehicles in Mogadishu and beyond\n- Hormuud Telecom expresses deepest condolences to the families and friends of the victims\n- Families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones"}, {"id": "fb73408c-4b6a-4398-9718-d75adab0c505", "title": "Abducted Senior Judge Released In Northwestern Pakistan", "date": "2024-04-29 09:30", "url": "https://www.rferl.org/a/pakistan-kidnapped-judge-released-marwat-taliban/32924821.html", "message": "The Georgian Dream staged a large counterdemonstration outside the parliament building in support of the bill on April 29, ferrying in people from all over the country.\nWATCH: Thousands of Georgians demonstrated in rival pro- and anti-government rallies as parliament resumed discussions of the so-called \"foreign agents\" bill.\nAnother former prime minister, Irakli Gharibashvili, currently the chairman of Georgian Dream, and other party leaders say the legislation is intended to increase transparency in the country’s political environment.\nIn a statement announcing the fresh protest, some 20 NGOs accused Ivanishvili and Georgian Dream that \"by adopting the Russian law, they are planning repression against the people...election-rigging, censorship, and a Soviet-style totalitarian regime.\"\nGeorgian Dream introduced the legislation last year but was forced to withdraw it following mass protests.", "classification": "world", "score": 0.42793258538894885, "location": "Tbilisi", "event_breakdown": "- Thousands of Georgians demonstrated in rival pro- and anti-government rallies outside the parliament building as discussions on the \"foreign agents\" bill resumed\n- Georgian Dream staged a large counterdemonstration outside the parliament building in support of the bill on April 29, ferrying in people from all over the country\n- Former prime minister, Irakli Gharibashvili, and other Georgian Dream party leaders stated that the legislation aims to increase transparency in the country's political environment\n- 20 NGOs accused Ivanishvili and Georgian Dream of planning repression, election-rigging, censorship, and a Soviet-style regime by adopting the Russian law\n- Georgian Dream initially introduced the legislation last year but had to withdraw it following mass protests"}, {"id": "486488af-907c-4c56-a8ce-d41ddd82b66d", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.", "classification": "security", "score": 0.9703773357165791, "location": "Rafah, Gaza", "event_breakdown": "- Israeli airstrike kills 22 people, including at least one infant and a toddler, in Rafah, Gaza.\n- Mahmoud Abu Taha holds up the body of a baby boy, alleging they are being targeted.\n- Another member of the Abu Taha family reports 10 relatives killed in the airstrike.\n- Some of the victims were previously displaced from Khan Younis and killed in a prior Israeli airstrike."}, {"id": "fce27e9c-5041-468a-ac31-0d7cfe55242d", "title": "Israel - Hamas : Biden speaks with Netanyahu as Mideast tensions in U . S . mount", "date": "2024-04-29 05:30", "url": "https://www.cnbc.com/2024/04/29/israel-hamas-biden-speaks-with-netanyahu-as-mideast-tensions-in-us-mount.html", "message": "President Joe Biden (L) listens to Israel's Prime Minister Benjamin Netanyahu as he joins a meeting of the Israeli war cabinet in Tel Aviv.\nPresident Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nBiden said in early April that he thinks Netanyahu is making a \"mistake\" with his handling of the war, adding, \"I don't agree with his approach.\"", "classification": "world", "score": 0.7781721920524816, "location": "Tel Aviv", "event_breakdown": "- President Joe Biden joins meeting of Israeli war cabinet in Tel Aviv.\n- President Joe Biden holds phone call with Israel's Prime Minister Benjamin Netanyahu regarding growing U.S. college campus protests and possible imminent invasion of Rafah.\n- Netanyahu shows no signs of backing away from potential ground offensive in Rafah despite U.S. opposition.\n- Biden and Netanyahu's first phone call since April 4, following Israeli airstrike that killed seven World Central Kitchen humanitarian workers.\n- Biden criticizes Netanyahu's handling of the war, stating disagreement with his approach."}, {"id": "39500f24-1462-4bf3-96f9-7cb861dc82e8", "title": "Biden speaks with Netanyahu as tensions over the Israel - Hamas war mount in the US", "date": "2024-04-29 00:45", "url": "https://www.nbcnews.com/politics/white-house/biden-speaks-netanyahu-tensions-israel-hamas-war-mount-us-rcna149724", "message": "WASHINGTON — President Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nDuring the earlier April call, Biden \"emphasized that the strikes on humanitarian workers and the overall humanitarian situation are unacceptable,\" according to the White House readout.\nBiden said in early April that he thinks Netanyahu is making a “mistake” with his handling of the war, adding, “I don’t agree with his approach.”", "classification": "world", "score": 0.7284224933462972, "location": "Rafah", "event_breakdown": "- President Joe Biden held a phone call with Israel's Prime Minister Benjamin Netanyahu\n- Netanyahu shows no signs of backing away from a potential ground offensive in Rafah\n- U.S. publicly opposes a ground offensive in Rafah\n- Biden and Netanyahu's first phone call since April 4\n- Israeli airstrike killed seven World Central Kitchen humanitarian workers on April 4\n- Biden emphasized that strikes on humanitarian workers and the overall humanitarian situation are unacceptable during the April 4 call\n- Biden stated in early April that he thinks Netanyahu is making a \"mistake\" with his handling of the war and does not agree with his approach"}, {"id": "e08d10c5-e2ab-4992-9a5f-74dd71c95c1f", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "classification": "security", "score": 0.5682246559007897, "location": "The primary location where the main event is taking place is Odesa, Ukraine.", "event_breakdown": "- Russian missile attack on an educational institution in Odesa, Ukraine\n- Attack resulted in at least five people killed and 32 injured\n- Occurred in a popular seafront park\n- Building targeted was the private law academy\n- Odesa Mayor Hennadii Trukhanov witnessed the attack\n- Odesa has been frequently targeted by Russian missile and drone attacks, particularly port infrastructure"}, {"id": "2aa8790c-058d-4de8-a18e-436b16ee563f", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.7658700668130015, "location": "The primary location where the main event is taking place is the Red Sea region.", "event_breakdown": "1. Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea on April 30.\n2. Italian frigate shoots down a Houthi drone near Bab el-Mandeb Strait on April 30.\n3. US military intercepts five drones over the Red Sea on early Sunday morning."}, {"id": "782bf8fb-d47b-49a9-b175-69f4d9f8002f", "title": "Likely missile attack by Yemen Houthi rebels targets a ship in the Red Sea", "date": "2024-04-29 15:00", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-container-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.835843361067382, "location": "Red Sea", "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea.\n- Italian frigate Virgino Fasan shoots down Houthi drone near the Bab el-Mandeb Strait.\n- Frigate Fasan and protected merchant vessel continue southward route as planned to exit the Red Sea.\n- Shipping through Red Sea and Gulf of Aden declines due to threat.\n- U.S. military shoots down five drones over Red Sea, according to Central Command."}, {"id": "10753ff9-d520-4e6d-96e8-df6a9e1aee06", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.835843361067382, "location": "The primary location where the main event is taking place is the Red Sea region, specifically referring to incidents near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.", "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down a Houthi drone near Bab el-Mandeb Strait\n- US military shoots down five drones over the Red Sea"}, {"id": "fa18ec68-e9e5-4d3c-b6f1-db0832c54ca8", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group.", "classification": "security", "score": 0.9285085399476978, "location": "Mokha, Yemen.", "event_breakdown": "1. Houthi rebels in Yemen attacked two US destroyers and two vessels in the Red Sea with drone strikes off the coast of Mokha, Yemen.\n2. The attack caused damage to one ship, but its crew was reported safe and heading to its next port of call.\n3. The United Kingdom Maritime Trade Operations center issued a warning for vessels to exercise caution in the area following the attack.\n4. The Houthis did not immediately acknowledge the attack, leading to suspicion falling on the group."}, {"id": "b6da21a8-cfc1-4ffc-ba22-e6f8447c5800", "title": "  First Told Pakistan About Balakot Airstrike : Modi on New India  Fight from Front  Policy", "date": "2024-04-30 03:45", "url": "https://www.news18.com/elections/first-told-pakistan-about-balakot-airstrike-pm-modi-on-new-indias-fight-from-front-policy-8871364.html", "message": "Prime Minister Narendra Modi has revealed the untold story of how he ensured Pakistan was the first to officially hear about the 2019 Balakot airstrike.\n“I instructed our forces to notify media about the airstrike, albeit after I had informed Pakistani authorities over phone that we have carried out an airstrike, killed these many people and caused this much destruction,” the prime minister said on Monday.\nPM Modi further stated that when he had dialled the neighbouring country, “they wouldn’t take calls”.\nEarlier this year, while delivering a keynote address at the Network18 Rising Bharat Summit 2024, PM Narendra Modi had recalled that when he was at the conclave five years ago, a significant event took place soon after.\nWhether terrorist masterminds or countries seeking peace and development, everyone has experienced the phenomenon of Rising Bharat, the PM said at the summit.", "classification": "world", "score": 0.6633412706290523, "location": "The primary location where the main event is taking place is India.", "event_breakdown": "- Prime Minister Narendra Modi reveals strategy behind 2019 Balakot airstrike, ensuring Pakistan is first to hear.\n- Modi instructs forces to notify media about airstrike after informing Pakistani authorities.\n- Modi recalls significant event at Network18 Rising Bharat Summit 2024, suggesting past connection to current remarks.\n- PM Modi highlights Rising Bharat phenomenon, impacting terrorist masterminds and countries seeking peace and development."}, {"id": "6fa53285-3480-48d7-9473-07d975b7cbf6", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\nIn a Google-translated update on Telegram, Russia's defense ministry said that air defense systems had, in the past 24 hours, \"shot down ... six ATACMS operational-tactical missiles made in the USA.\"\nIt's uncertain how many ATACMS missiles Ukraine was given.\nIt's widely believed that Russian forces are aiming to recapture the city of Kharkiv in their forthcoming summer offensive.\nRussia's defense ministry announced the capture of the village of Novobakhmutivka, just north of Semenivka, on Sunday.", "classification": "security", "score": 0.8972072940238094, "location": "Kharkiv", "event_breakdown": "- A day of mourning declared in Odesa, Ukraine, after Russian missile strike kills five and injures 32.\n- Russia's defense ministry claims to have shot down six ATACMS missiles made in the USA in the past 24 hours.\n- Uncertainty surrounds the number of ATACMS missiles Ukraine was given.\n- Russian forces believed to be targeting the recapture of Kharkiv in upcoming summer offensive.\n- Russia's defense ministry announces capture of village of Novobakhmutivka, north of Semenivka."}, {"id": "9bfa4a23-d17e-436e-a05d-a5ac23e7fd37", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.7239134975687745, "location": "The primary location where the main event is taking place is the Red Sea region, particularly near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.", "event_breakdown": "- A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea\n- The UKMTO reported that the ship was damaged but its crew was safe and heading to its next port of call\n- The Italian frigate Virgino Fasan shot down a Houthi drone near the Bab el-Mandeb Strait\n- Shipping through the Red Sea and Gulf of Aden has declined due to the threat\n- The US military shot down five drones over the Red Sea"}, {"id": "cde7d0fc-b3bc-4f84-9427-960c0041695e", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 18:45", "url": "https://www.smdailyjournal.com/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_38dfa75b-1712-5b26-813d-63a038fce6d6.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.", "classification": "technology", "score": 0.3070651584242637, "location": "null", "event_breakdown": "1. Premium Subscription offer announced\n2. Access to the Daily Journal's e-Edition with various features\n3. Ability to download digital replica of the Daily Journal for offline reading\n4. Option to clip & download articles or images from the e-edition\n5. Unlimited access to award-winning online content\n6. Commenting access on all stories as a valued member of the DJ community\n7. Introduction of online-only digital crossword puzzle"}, {"id": "2fe9a1b6-7ec5-470d-a001-091e3bccaa1a", "title": "Hezbollah says it fired drones and guided missiles at northern Israel", "date": "2024-04-28 17:30", "url": "https://www.thehindu.com/news/international/hezbollah-says-it-fired-drones-and-guided-missiles-at-northern-israel/article68118107.ece", "message": "April 28, 2024 10:30 pm | Updated 10:30 pm IST - BeirutLebanon’s Iran-backed Hezbollah movement said on Saturday it had targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe Israeli Army said its Iron Dome air-defence system “successfully intercepted a suspicious aerial target that crossed from Lebanon into the area of Manara in northern Israel”.\nThe Army also “struck the sources of fire” of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nOvernight Saturday to Sunday Hezbollah said it had launched dozens of rockets at the Israeli military base at Meron, northern Israel.\nHezbollah has intensified its targeting of military sites in Israel since tensions soared between Israel and Iran over the bombing of Tehran’s Damascus consulate on April 1, widely blamed on Israel.", "classification": "security", "score": 0.9386108545849813, "location": "null", "event_breakdown": "- Hezbollah targets northern Israel with drones and guided missiles following Israeli strikes that killed three people, including two Hezbollah members.\n- Israeli Army's Iron Dome intercepts suspicious aerial target from Lebanon into Manara area in northern Israel.\n- Israeli Army strikes sources of fire of several anti-tank missiles launched from Lebanon into Manara border area.\n- Hezbollah launches dozens of rockets at Israeli military base in Meron, northern Israel, overnight Saturday to Sunday.\n- Hezbollah intensifies targeting of Israeli military sites amid tensions between Israel and Iran over bombing of Tehran's Damascus consulate on April 1."}, {"id": "eecb64a3-7a7f-4dc6-8706-9b69366bf4c8", "title": "Ukraine - Russia war live : Five killed in Russian strike on Ukraine  Harry Potter castle  ", "date": "2024-04-30 08:30", "url": "https://www.telegraph.co.uk/world-news/2024/04/30/ukraine-russia-war-latest-news-strike-odesa-missile/", "message": "Long-range US missiles secretly shipped to Ukraine have been shot down over Crimea, Russia has claimed.\nThe Russian-backed head of occupied Crimea claimed that its air defences intercepted long-range Army Tactical Missile Systems (ATACMS) over the peninsula overnight.\nHe said that they had been shot down over the occupied Crimean cities of Dzhankoi and Simferopol.\nLocal Crimean Telegram accounts also reported the news and said that the Crimean bridge had been closed as a result.\nThe United States in recent weeks secretly shipped long-range missiles to Ukraine, which has so far used them twice, a US official said last week, including on targets in occupied Crimea.", "classification": "security", "score": 0.7524888768487838, "location": "The primary location where the main event is taking place is Crimea.", "event_breakdown": "- Long-range US missiles secretly shipped to Ukraine\n- Russian-backed head of occupied Crimea claims downing of US missiles over Crimea\n- ATACMS intercepted over Dzhankoi and Simferopol\n- Closure of Crimean bridge reported \n- US official confirms shipment of long-range missiles to Ukraine, used twice on targets in occupied Crimea"}, {"id": "83dcb048-19a2-49aa-8ed3-acc76a7d102c", "title": "UN and global peace - Daily Times", "date": "2024-04-30 05:45", "url": "https://dailytimes.com.pk/1190598/un-and-global-peace/", "message": "Liberal institutionalists opine that the UN has succeeded in maintaining global peace and security as it has averted major global conflicts since 1945.\nTo maintain global peace and security, multilateral disarmament and arms limitation have remained the primary objective of the global organization.\nWith the development of nuclear weapons, global peace and security came under serious threat because of the danger of nuclear war.\nSimilarly, peacekeeping missions appear to be another contribution of the UN in establishing global peace and security.\nIt is a unique global partnership in a combined effort to maintain international peace and security in conflict zones as several countries are unable to transition from conflict to peace without the support of the World Organization.", "classification": "security", "score": 0.6131394497519692, "location": "null", "event_breakdown": "- Liberal institutionalists assert UN success in maintaining global peace and security since 1945.\n- Multilateral disarmament and arms limitation remain primary objectives for global peace and security.\n- Development of nuclear weapons poses serious threat to global peace and security.\n- UN's peacekeeping missions contribute to establishment of global peace and security.\n- UN represents a unique global partnership in efforts to maintain international peace and security, particularly in conflict zones."}, {"id": "25d375c9-4d28-4085-be29-5496b0405538", "title": "A three - dimensional view of the Israel - Iran crisis", "date": "2024-04-28 20:00", "url": "https://www.thehindu.com/opinion/lead/a-three-dimensional-view-of-the-israel-iran-crisis/article68118479.ece", "message": "“Iran, Iran, Iran,” responded the Prime Minister.\nMr. Netanyahu, Israel’s longest-serving Prime Minister, has never minced words about Iran.\nAnd Israel’s response to the Iran attack was rather “feeble”, as Mr. Netanyahu’s National Security Minister Itamar Ben Gvir himself called it.\nAnd then, Mr. Biden told Mr. Netanyahu that the U.S. would not participate in any Israeli retaliation against Iran.\nBut when Mr. Biden told him that the U.S. would not join Israel’s retaliation, it limited Mr. Netanyahu’s options.", "classification": "world", "score": 0.732233426792577, "location": "The primary location where the main event is taking place is Israel, particularly in relation to discussions and potential actions regarding Iran.", "event_breakdown": "- Israeli Prime Minister responds with \"Iran, Iran, Iran.\"\n- Netanyahu, Israel's longest-serving Prime Minister, expresses firm stance on Iran.\n- Israel's response to Iran attack described as \"feeble\" by National Security Minister Itamar Ben Gvir.\n- Biden informs Netanyahu that U.S. will not participate in any Israeli retaliation against Iran.\n- Biden's statement limits Netanyahu's options for retaliation."}, {"id": "26c6fc52-7bef-4bd8-9eb9-232d358115aa", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.8278750793165643, "location": "Red Sea", "event_breakdown": "- A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea\n- Italian frigate Virgino Fasan shot down a Houthi drone near the Bab el-Mandeb Strait\n- U.S. military shot down five drones over the Red Sea on Sunday"}, {"id": "47c2cf40-25fa-4fb5-bb1b-7449514b3cdf", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\nIn a Google-translated update on Telegram, Russia's defense ministry said that air defense systems had, in the past 24 hours, \"shot down ... six ATACMS operational-tactical missiles made in the USA.\"\nIt's uncertain how many ATACMS missiles Ukraine was given.\nIt's widely believed that Russian forces are aiming to recapture the city of Kharkiv in their forthcoming summer offensive.\nRussia's defense ministry announced the capture of the village of Novobakhmutivka, just north of Semenivka, on Sunday.", "classification": "security", "score": 0.8972072940238094, "location": "Odesa", "event_breakdown": "- Russian missile strike kills five and injures 32 in Odesa, Ukraine\n- Russian defense ministry claims to have shot down six ATACMS missiles made in the USA\n- Uncertainty regarding the number of ATACMS missiles given to Ukraine\n- Belief that Russian forces are targeting the recapture of Kharkiv\n- Russian defense ministry announces capture of the village of Novobakhmutivka, north of Semenivka"}, {"id": "87f3a860-12d6-459c-9270-9861e2beb076", "title": "  My whole family has perished : 20 dead after Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 17:00", "url": "https://abc17news.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "classification": "security", "score": 0.9378727058354757, "location": "The primary location where the main event is taking place is Rafah, Gaza.", "event_breakdown": "- Twenty-two people killed in Israeli airstrike over Rafah, Gaza\n- Mahmoud Abu Taha shows baby's body, accuses Israeli targeting\n- Ten relatives of Abu Taha killed in airstrike\n- Some relatives originally displaced from Khan Younis, killed in previous airstrike\n- Remaining relatives who fled Khan Younis killed in Rafah"}, {"id": "163e17fb-6ed2-4582-a4bf-73c26f7e28f4", "title": "Who is Lebanon Jamaa Islamiya , latest to parade weapons against Israel ? ", "date": "2024-04-29 15:30", "url": "https://www.al-monitor.com/originals/2024/04/who-lebanons-jamaa-islamiya-latest-parade-weapons-against-israel", "message": "Members of al-Jamaa al-Islamiya held a funeral procession Sunday in the town of Bebnine for two of the group's fighters.\nDozens of masked and armed men were seen walking the town's streets, brandishing their weapons and firing in the air.\nAl-Jamaa al-Islamiya is a Sunni Islamist political group founded in 1964 as the Lebanese branch of the Muslim Brotherhood.\nIbrahim Mneime, another independent lawmaker, said al-Jamaa al-Islamiya bears responsibility for the “military demonstration” and the fall of the wounded in Akkar.\nThe Israeli military told Agence France Presse that 20 rockets were launched toward Israel from Lebanon and that most of the projectiles were intercepted.", "classification": "security", "score": 0.9900179886077366, "location": "Bebnine", "event_breakdown": "- Members of al-Jamaa al-Islamiya held a funeral procession in Bebnine\n- Dozens of masked and armed men walked the town's streets firing in the air\n- Al-Jamaa al-Islamiya is a Sunni Islamist political group founded in 1964\n- Ibrahim Mneime holds al-Jamaa al-Islamiya responsible for the \"military demonstration\" in Akkar\n- The Israeli military reported 20 rockets launched from Lebanon towards Israel, with most intercepted"}, {"id": "dbf42985-dae4-4af9-8581-5c94942a5e13", "title": "Iran Teases New Drone Visually Similar to Russia Lancet", "date": "2024-04-29 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240428-sputnik01.htm", "message": "Iran Teases New Drone Visually Similar to Russia's LancetSputnik News20240428Ilya TsukanovKicking off its foray into drone design and manufacturing in the 1980s during the Iran-Iraq War, Iran has gone on to create more than 50 different kinds of unmanned aerial vehicles, from reconnaissance and strike drones to loitering munitions.\nIran's Islamic Revolutionary Guard Corps has teased a new drone design apparently taking cues from Russia's distinct X-winged Lancet series of loitering munitions.\nRussia's Lancet DronesThe Russian loitering munitions going under the name \"Lancet\" actually constitute an entire lineup of kamikaze drones, all of them featuring a distinctive single or dual X-wing design.\nIn February, Ukraine announced that it would begin the production of its own Lancet-style drone, signaling a begrudging recognition of the Russian UAV design's potential.\nIran's DronesIran's drone manufacturers have created over 50 different drone designs, from short-range tactical UAVs and loitering munitions to rocket and propeller-powered long-range reconnaissance, attack and electronic warfare drones.", "classification": "security", "score": 0.4585963558592637, "location": "null", "event_breakdown": "The text does not contain information about the designation of a terrorist organization."}, {"id": "bbbc9d4c-59ee-4ba1-b425-1ec4a1ad7259", "title": "Joining Forces Against Terrorism : Japan New Law Commits More ThanWords to U . S . Effort", "date": "2024-04-29 23:00", "url": "https://www.heritage.org/homeland-security/report/joining-forces-against-terrorism-japans-new-law-commits-more-thanwords-us", "message": "By moving beyond the country's prior policy of non-involvement, the law will allow Japan's self-defense forces (SDF) to support the efforts of the U.S. forces in Afghanistan.\nFor Japan, this new approach means the Diet must amend the laws governing the self-defense forces and the Maritime Safety Agency.\nTherefore, the Administration should support Japan through active diplomacy around the Asia-Pacific region and through its own \"proactive\" public diplomacy program.\nFinally, when Japan's self-defense forces do deploy, they should be fully integrated into the defense architecture in regions where the war on terrorism is being waged.\nBy passing the anti-terrorism law, permitting Japan's self-defense forces to deploy to the Persian Gulf, the Diet has greatly aided Prime Minister Koizumi's effort to develop a new consensus in Japan on collective self-defense.", "classification": "world", "score": 0.5070942321363041, "location": "The primary location where the main event is taking place is the Persian Gulf.", "event_breakdown": "- Japan's new law permits self-defense forces (SDF) to support U.S. forces in Afghanistan, moving beyond previous non-involvement policy.\n- Diet to amend laws governing SDF and Maritime Safety Agency to accommodate new approach.\n- Administration urged to support Japan through active diplomacy in Asia-Pacific region and proactive public diplomacy program.\n- Self-defense forces to be fully integrated into defense architecture in regions of terrorism.\n- Passage of anti-terrorism law allows SDF deployment to Persian Gulf, aiding Prime Minister Koizumi's effort to develop new consensus on collective self-defense in Japan."}, {"id": "2f40db7e-8ce5-4690-8587-50992b338a63", "title": "Austria Urges Global Action on  Killer Robot as AI Weapon Concerns Rise", "date": "2024-04-29 21:15", "url": "https://www.techtimes.com/articles/304094/20240429/austria-urges-global-action-killer-robots-ai-weapon-concerns-rise.htm", "message": "Austria has recently raised the alarm on the urgent need for global action to regulate artificial intelligence (AI) in weapons systems amid growing concerns over the development of so-called 'killer robots,\" Reuters reports.\nAt the meeting, Austria discussed the ethical and legal challenges posed by the advancement of AI technology in warfare.\n(Photo: GENYA SAVILOV/AFP via Getty Images)Austria Calls for Urgent Action on AI Weapons ControlDuring the conference, Austrian Foreign Minister Alexander Schallenberg stressed the necessity of agreeing on international rules and norms to ensure human control over AI weapons.\nConcerns over the accuracy and reliability of AI systems have been raised, with examples ranging from misrecognizing objects to causing fatal accidents in civilian contexts.\nMeanwhile, Ukraine's efforts to develop AI drones with image recognition targeting systems further highlight the global trend toward AI-driven warfare.", "classification": "security", "score": 0.3692843643546828, "location": "Austria", "event_breakdown": "- Austria raises alarm on need for global action to regulate AI in weapons systems, discusses at conference.\n- Austrian Foreign Minister Alexander Schallenberg emphasizes necessity of international rules for AI weapons to ensure human control.\n- Concerns raised about accuracy and reliability of AI systems, with issues like misrecognition and fatal accidents.\n- Ukraine develops AI drones with image recognition targeting systems, reflecting global trend towards AI-driven warfare."}, {"id": "c5637bd8-0283-4945-b6da-c003e7a37fe3", "title": "Suspected missile attack by Yemen Houthi rebels damages ship in the Red Sea : authorities", "date": "2024-04-29 19:45", "url": "https://www.theglobeandmail.com/world/article-suspected-missile-attack-by-yemens-houthi-rebels-damages-ship-in-the/", "message": "Open this photo in gallery: Yemen's capital Sana'a is seen on a map.The Associated PressA suspected missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virginio Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led air strike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.8002506466234298, "location": "Red Sea", "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damages ship in the Red Sea\n- Italian frigate Virginio Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- Houthi attacks decline due to U.S.-led air strike campaign in Yemen\n- Decline in shipping through Red Sea and Gulf of Aden due to threat\n- U.S. military shoots down five drones over the Red Sea"}, {"id": "a47309d0-2f2b-4591-917c-5c59f01c1e54", "title": "World Central Kitchen resumes operations in Gaza after seven aid workers killed", "date": "2024-04-28 23:00", "url": "https://www.independent.co.uk/news/world/middle-east/world-central-kitchen-resume-gaza-b2536172.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}World Central Kitchen, the humanitarian group that saw seven of its aid workers killed in an Israeli airstrike earlier this month, said they resumed operations in Gaza on Sunday.\nNow, weeks later, WCK is resuming its work to help get as much food into Gaza, including northern Gaza, as possible.\nIsrael’s offensive in Gaza, sparked by Hamas’ October 7 attack in which 1,200 people were killed and 250 were taken hostage, has caused widespread devastation with more than 33,000 people killed.\nAmong those deaths are journalists and other humanitarian workers.", "classification": "security", "score": 0.6776549847507206, "location": "Gaza", "event_breakdown": "Reminder: My knowledge is up to date only until January 2022. Hamas, an Islamist militant group, is designated as a terrorist organization by several countries and organizations, including the United States, Israel, the European Union, and others."}, {"id": "c2ec626b-af23-4535-9fc5-4c6a8c0f7251", "title": "Hamas alleges rocket barrage from Lebanon into northern Israel", "date": "2024-04-29 16:00", "url": "https://dailystar.com.lb/hamas-rocket-barrage-lebanon-northern-israel/", "message": "On Monday, the Ezzedine al-Qassam Brigades, the military wing of Hamas, launched a series of rockets from southern Lebanon targeting a northern Israeli military command center.\nIn response, the Israeli military reported intercepting most of the approximately 20 rockets launched from Lebanon and conducted strikes on the launch sites.\nFollowing the rocket barrage, an Israeli drone struck the town of Aita al-Shaab in southern Lebanon.\nEarlier in the year, a U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut, a Hezbollah stronghold.\nIn March, another Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre, while a Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley.", "classification": "security", "score": 0.9972401002907432, "location": "null", "event_breakdown": "Reminder: My knowledge is up to date only until January 2022. Hamas is designated as a terrorist organization by several countries and organizations, including the United States, Israel, the European Union, Canada, and others."}, {"id": "cf2dfdda-8633-46f4-9bd6-968e44e338de", "title": "April 27 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-04-29 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/04/mil-240428-presstv12.htm", "message": "April 27: 'Axis of Resistance' operations against Israeli occupationIran Press TVSunday, 28 April 2024 7:49 AMBy Press TV Website StaffAmid Israel's genocidal war on Gaza, which has killed more than 34,400 Palestinians so far, including more than 16,000 children, resistance groups in Palestine and across the region continue their operations against the Tel Aviv regime and its Western backers.\nThe major operations carried out by the Palestinian and regional resistance groups on Saturday, April 27, are as follows:Al-Aqsa Martyrs Brigades' operations on April 27:(Gaza Strip)Targeted Israeli forces who stormed the Gaza City on the axis of Al-Salam roundabout with a heavy barrage of bullets.\nMujahideen Brigades' operations on April 27:(Gaza Strip)Bombed the settlement of \"Sderot\" with a barrage of rockets.\nWestern sector:At around 08:30 local time, Israeli soldiers, west of the Shomera settlement, were targeted with missiles.\nIslamic Resistance in Iraq's operations on April 27:(Iraq)Carried out a drone strike against a vital military target in the occupied city of Haifa.", "classification": "security", "score": 0.9674616021341211, "location": "Tel Aviv", "event_breakdown": "- Al-Aqsa Martyrs Brigades target Israeli forces in Gaza City near Al-Salam roundabout with heavy gunfire.\n- Mujahideen Brigades bomb \"Sderot\" settlement with rockets in Gaza Strip.\n- Israeli soldiers west of Shomera settlement targeted with missiles in western sector.\n- Islamic Resistance in Iraq conducts drone strike against vital military target in occupied city of Haifa, Iraq."}, {"id": "77c170fb-38e3-4fac-be4e-035b1853cca2", "title": "Hamas claims rocket barrage from Lebanon into north Israel", "date": "2024-04-29 10:15", "url": "https://www.firstpost.com/world/hamas-claims-rocket-barrage-from-lebanon-into-north-israel-13764997.html", "message": "AdvertisementAccording to a Telegram announcement from the Ezzedine al-Qassam Brigades, Hamas forces “have fired a concentrated rocket barrage from south Lebanon towards” an Israeli military position.\nAs a “response to the massacres of the Zionist enemy (Israel)” in Gaza and the occupied West Bank, the armed wing explained the attack.\nThe latest rocket barrage came as Hamas negotiators were expected to arrive in Egypt on Monday, where they were due to respond to Israel’s latest proposal for a long-sought truce in Gaza and hostage release.\nOn April 21, the Qassam Brigades claimed a rocket barrage into northern Israel.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold.", "classification": "security", "score": 0.9906225967131973, "location": "null", "event_breakdown": "1. Ezzedine al-Qassam Brigades fires rocket barrage from south Lebanon towards an Israeli military position.\n2. Hamas explains the attack as a response to the massacres of the Zionist enemy in Gaza and the occupied West Bank.\n3. Hamas negotiators expected to arrive in Egypt to respond to Israel's truce proposal for Gaza and hostage release.\n4. Qassam Brigades claim rocket barrage into northern Israel on April 21.\n5. Strike in January by Israel kills Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah's south Beirut stronghold."}, {"id": "34e1d19d-c18b-4ab5-a0b7-bf788395838c", "title": "Yemen Houthi rebels claim downing US Reaper drone , release footage showing wreckage of aircraft", "date": "2024-04-28 23:00", "url": "https://wtop.com/world/2024/04/yemens-houthi-rebels-claim-downing-us-reaper-drone-release-footage-showing-wreckage-of-aircraft/", "message": "JERUSALEM (AP) — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing…JERUSALEM (AP) — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nU.S. Air Force Lt. Col. Bryon J. McGarry, a Defense Department spokesperson, acknowledged to The Associated Press on Saturday that “a U.S. Air Force MQ-9 drone crashed in Yemen.” He said an investigation was underway, without elaborating.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe Houthis have launched more than 50 attacks on shipping, seized one vessel and sank another since November, according to the U.S. Maritime Administration.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.", "classification": "security", "score": 0.7576938689950921, "location": "null", "event_breakdown": "1. Yemen’s Houthi rebels claimed shooting down a U.S. military MQ-9 Reaper drone.\n2. The U.S. Air Force confirmed that a MQ-9 drone crashed in Yemen.\n3. The drone was shot down over the Houthis' stronghold in Saada province.\n4. The Houthis have launched more than 50 attacks on shipping, seized one vessel, and sank another since November.\n5. Houthi attacks decreased recently due to a U.S.-led airstrike campaign targeting the rebels in Yemen."}, {"id": "f24fd3ad-88be-4aa8-9e19-ce43f5352684", "title": "Houthi rebels claim downing US drone , release footage of wreckage", "date": "2024-04-28 16:15", "url": "https://www.militarytimes.com/news/your-military/2024/04/28/houthi-rebels-claim-downing-us-drone-release-footage-of-wreckage/", "message": "JERUSALEM — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week.", "classification": "security", "score": 0.9381281334156724, "location": "My knowledge cut-off date is January 2022. The main event is taking place in Yemen, particularly in the country's Saada province, where the Houthi rebels claimed to have shot down a U.S. military MQ-9 Reaper drone.", "event_breakdown": "- Yemen's Houthi rebels claimed to have shot down a U.S. MQ-9 Reaper drone in Saada province\n- Starting of the war after an attack by Hamas-led militants in Israel, resulting in casualties and hostages taken\n- Houthi attacks decreasing due to U.S.-led airstrikes in Yemen\n- Renewed attacks by Houthi rebels in the past week"}, {"id": "a74be425-3982-46e1-b8f8-732bf08bf6de", "title": "Handing Iran a Victory", "date": "2024-04-30 06:15", "url": "https://pjmedia.com/james-robbins/2024/04/29/handing-iran-a-victory-n4928600", "message": "Iran launched around 300 weapons from locations in Iran, Syria, and Yemen, including over 110 medium-range ballistic missiles, more than 30 land-attack cruise missiles, and over 150 uncrewed aerial vehicles.\nThe numbers tell us this was a concerted attack, a major effort by Iran to inflict pain on Israel.\nOnly a few of the incoming Iranian weapons got through, and they did little material damage.\n“I found few people out there who really believe Khe Sanh could be held if the North Vietnamese were determined to take it,” he reported .\nImagine if those 300 Iranian weapons had gotten through.", "classification": "security", "score": 0.7080351421276613, "location": "null", "event_breakdown": "- Iran launched around 300 weapons from locations in Iran, Syria, and Yemen, including over 110 medium-range ballistic missiles, more than 30 land-attack cruise missiles, and over 150 uncrewed aerial vehicles.\n- The numbers indicate a major effort by Iran to inflict pain on Israel.\n- Only a few of the incoming Iranian weapons got through, and they did little material damage.\n- There were concerns about the ability to hold Khe Sanh if the North Vietnamese were determined to take it."}, {"id": "2cf2378a-26e2-4c75-bdc0-d6d440c87555", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "classification": "security", "score": 0.4886476184634531, "location": "Odesa", "event_breakdown": "- Russian missile attack on an educational institution in Odesa\n- Attack resulted in at least five deaths and 32 injuries\n- The academy's president, Serhiy Kivalov, was among the injured\n- Odesa Mayor Hennadii Trukhanov's response to the attack\n- Odesa as a frequent target of Russian missile and drone attacks"}, {"id": "1579558d-ee68-426f-b3ea-da2334664b0a", "title": "Houthi rebels claim downing US drone , release footage of wreckage", "date": "2024-04-28 15:45", "url": "https://www.navytimes.com/news/your-military/2024/04/28/houthi-rebels-claim-downing-us-drone-release-footage-of-wreckage/", "message": "JERUSALEM — Yemen’s Houthi rebels on Saturday claimed shooting down another of the U.S. military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week.", "classification": "security", "score": 0.9381281334156724, "location": "The primary location where the main event is taking place is Saada province.", "event_breakdown": "My knowledge cut-off date is January 2022. As of that time, the Houthi rebels in Yemen were not designated as a terrorist organization by the United States."}, {"id": "cc1f179b-6c45-436b-b5ad-2a57454c051c", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.", "classification": "security", "score": 0.3770460163888146, "location": "Gaza", "event_breakdown": "- Hamas officials leave Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza\n- Hamas delegation to return to Cairo with a written response to the cease-fire proposal\n- Blinken urges Hamas to accept the new cease-fire proposal before visiting Israel"}, {"id": "bf12d0ae-deab-44ec-9e17-42dbc6cae395", "title": "Anti - Taliban resistance leader says a terrorist attack on U . S . soil is a  matter of when not if  in chilling warning to the Biden administration about the surge in extremism in Afghanistan since the withdrawal", "date": "2024-04-29 15:00", "url": "https://www.dailymail.co.uk/news/article-13347195/Anti-Taliban-resistance-leader-says-terrorist-attack-U-S-soil-matter-not-chilling-warning-Biden-administration-surge-extremism-Afghanistan-withdrawal.html", "message": "The leader of the anti-Taliban resistance in Afghanistan has issued a chilling warning that a new terrorist attack on America is a matter of 'when not if'.\nMany years ago, while he was still in Panjshir, Massoud started working on his memoir.\nThe resistance is almost solely fighting alone now Western forces have turned their backs on a country ravaged by war.\nBut their opponents are well-equipped and still have access to the billions of dollars in weapons left behind when foreign forces left two years ago.\nFormer head of U.S. Central Command General Kenneth F. McKenzie Jr has warned the threat from the Islamic State has grown since American forces left, and the desire to attack the U.S. is getting stronger.", "classification": "security", "score": 0.5040026673784063, "location": "The primary location where the main event is taking place is Afghanistan.", "event_breakdown": "- Leader of anti-Taliban resistance in Afghanistan warns of new terrorist attack on America.\n- Massoud, leader of resistance, began working on memoir while in Panjshir years ago.\n- Resistance fights alone as Western forces withdraw from war-torn country.\n- Opponents remain well-equipped with access to billions in weapons left behind by foreign forces two years ago.\n- Former head of U.S. Central Command warns of growing threat from Islamic State and desire to attack U.S. since American forces left."}, {"id": "7b1e285d-44c5-4cd6-b70f-be05c3700434", "title": "Somalia - Six Hormuud Telecom Staff Killed in Tragic Mogadishu Blast", "date": "2024-04-29 13:15", "url": "https://allafrica.com/stories/202404290199.html", "message": "Mogadishu, Somalia — On the afternoon of April 28, 2024, a devastating explosion rocked the outskirts of Mogadishu, Somalia, claiming the lives of six employees of Hormuud Telecom, the country's largest telecommunications company.\nHormuud Telecom confirmed the deaths of their staff members in a statement expressing deep condolences to the families, friends, and colleagues of the victims.\nThe explosion is part of a disturbing pattern of violence against commercial companies in Somalia, with Hormuud Telecom being a frequent target.\nHormuud Telecom has vowed to continue its operations despite the challenges, emphasizing its commitment to providing essential telecommunications services to the Somali people.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "classification": "security", "score": 0.7127219943003037, "location": "Mogadishu", "event_breakdown": "- Explosion rocks outskirts of Mogadishu, Somalia, claiming the lives of six employees of Hormuud Telecom\n- Hormuud Telecom confirms deaths of their staff members in a statement\n- Violence against commercial companies in Somalia, with Hormuud Telecom being a frequent target\n- Hormuud Telecom vows to continue operations despite challenges\n- Investigation into the attack continues as families and community mourn the loss of colleagues"}, {"id": "038abff4-bdac-4b42-ba15-d027c7c8ff73", "title": "Israeli military hit 270 Gaza terror targets since start of Passover Holiday", "date": "2024-04-28 16:15", "url": "https://www.devdiscourse.com/article/international/2920628-israeli-military-hit-270-gaza-terror-targets-since-start-of-passover-holiday", "message": "Tel Aviv [Israel], April 28 (ANI/TPS): The Israel Defence Forces (IDF) said that over the first six day of the Passover holiday its forces attacked about 270 terrorist targets throughout the Gaza Strip, of which more than 20 were terror infrastructures that were aimed at the territory of Israel.\nIn the attacks rocket launch sites were destroyed.\nIn addition, the IDF attacked a launch site located in the designated humanitarian area in the southern Gaza Strip, using Israel Air Force aircraft.\nThe launch site was loaded and attacked before it could launch rockets at Israeli territory.\nThe IDF said that this was \"further evidence of Hamas's cynical use of civilian spaces for terrorist purposes.\"", "classification": "security", "score": 0.9357907321083463, "location": "Gaza Strip", "event_breakdown": "- Israel Defence Forces (IDF) attacked about 270 terrorist targets throughout Gaza Strip\n- More than 20 terror infrastructures aimed at Israel destroyed\n- Rocket launch sites destroyed in attacks\n- IDF attacked launch site in southern Gaza Strip located in humanitarian area\n- Launch site attacked before launching rockets at Israel territory\n- IDF stated this as evidence of Hamas's cynical use of civilian spaces for terrorist purposes"}, {"id": "a3bf45df-5084-4136-8130-5f82e79963e7", "title": "Drone attacks are  big menace  for US as military warned to  be ready  for new stealthy warfare", "date": "2024-04-28 16:30", "url": "https://www.mirror.co.uk/news/us-news/drone-attack-big-menace-warning-32689371", "message": "In January, a one-way attack drone deployed by Iranian-backed militants claimed the lives of three US soldiers in Jordan.\nThis is a new phase of warfare, and we have to get ready, and we are,\" added Reed.\nThe Pentagon is poised to receive more than $500 million through a supplemental request to Congress to combat the drone threat.\nIt's also coming from Iran, who unleashed a volley of drones and missiles towards Israel last week.\nA US Patriot missile unit stationed in Iraq intercepted a ballistic missile targeting Israel, while two squadrons of fighter jets neutralised dozens of drones.", "classification": "security", "score": 0.5564978531684733, "location": "Jordan", "event_breakdown": "- In January, a one-way attack drone deployed by Iranian-backed militants claimed the lives of three US soldiers in Jordan.\n- The Pentagon is poised to receive more than $500 million through a supplemental request to Congress to combat the drone threat.\n- Iran unleashed a volley of drones and missiles towards Israel last week.\n- A US Patriot missile unit stationed in Iraq intercepted a ballistic missile targeting Israel.\n- Two squadrons of fighter jets neutralised dozens of drones."}, {"id": "a31e6a34-e8d1-46c8-9810-67091de21a54", "title": "Yemen drone attack kills women and children", "date": "2024-04-29 04:15", "url": "https://www.bssnews.net/news/186035", "message": "DUBAI, April 28, 2024 (BSS/AFP) - A drone attack in Yemen killed fivecivilians on Saturday, according to both the Huthi rebels and governmentsources who accused each other of being behind the strike.\n\"Three women and two children were killed when they went to fetch water froma well,\" said the rebel-controlled health ministry, pointing the finger ofblame at forces loyal to the government.\nThe attack was in Taez province, in a government-held area near the frontlines.\nThe Iran-backed Huthis seized control of Yemen's capital Sanaa in 2014,prompting a Saudi-led military intervention the following year.\nWhile hostilities in Yemen have remained low since the expiry of a six-monthtruce brokered in April 2022, sporadic fighting flares in the ArabianPeninsula country.", "classification": "security", "score": 0.7497308998479179, "location": "Taez province", "event_breakdown": "- Drone attack in Yemen kills five civilians in Taez province near frontlines.\n- Huthi rebels and government sources accuse each other of being behind the strike.\n- Rebel-controlled health ministry blames forces loyal to the government.\n- Hostilities in Yemen have remained low since expiry of six-month truce brokered in April 2022, but sporadic fighting continues."}, {"id": "6864c8d4-c068-471b-95dc-bd44b16f34e6", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 00:00", "url": "https://www.ivpressonline.com/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_536125b6-f511-5ff2-bcad-429ceee29163.html", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more.", "classification": "security", "score": 0.3402162484076067, "location": "Imperial Valley", "event_breakdown": "- A weekly review of the best and most popular stories published in the Imperial Valley Press\n- Featured upcoming events in the Imperial Valley\n- Announcement of new movies showing at local theaters\n- Weekly roundup of the most notable photos from the past week"}, {"id": "f6f5ace9-834f-4a93-a867-23ec5d506c4e", "title": "Gunman kills 6 in attack on Afghan mosque : govt spokesman - World", "date": "2024-04-30 09:30", "url": "https://www.dawn.com/news/1830574/gunman-kills-6-in-attack-on-afghan-mosque-govt-spokesman", "message": "A gunman stormed a mosque in western Afghanistan and killed six people, a government spokesman said on Tuesday, with local residents claiming the Shia community had been targeted.\nInterior ministry spokesman Abdul Mateen Qani said that “an unknown armed person shot at civilian worshippers in a mosque” in Herat province’s Guzara district on Monday at around 9pm (4:30pm GMT).\n“Six civilians were martyred and one civilian was injured,” he wrote on social media platform X early Tuesday morning.\nIS threatWhile no group has claimed the attack, the regional chapter of the militant Islamic State (IS) group is the largest security threat in Afghanistan and has frequently targeted Shia communities.\nTaliban officials blamed IS for the attack, which happened in a Shia neighbourhood of the capital Kabul.", "classification": "security", "score": 0.9464726389469671, "location": "Guzara district, Herat province.", "event_breakdown": "- A gunman stormed a mosque in Guzara district, Herat province, Afghanistan, killing six people and injuring one.\n- Interior ministry spokesman Abdul Mateen Qani confirmed the attack on civilian worshippers in the mosque.\n- The attack occurred at around 9pm local time on Monday.\n- The Shia community was claimed to be targeted by the gunman according to local residents.\n- The regional chapter of the militant Islamic State (IS) group is a significant security threat in Afghanistan.\n- The Taliban officials blamed IS for the attack in a Shia neighborhood in Kabul."}, {"id": "11030b7e-2f32-4cd5-8719-a8558632aca2", "title": "Likely attack by Yemen Houthi rebels targets a vessel in the Red Sea", "date": "2024-04-29 10:30", "url": "https://abcnews.go.com/International/wireStory/attack-yemens-houthi-rebels-targets-vessel-red-sea-109739373", "message": "Authorities said a missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea in the latest assault in their campaign against shipping in the crucial maritime routeJERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe military separately shot down a drone on a flight path toward the USS Philippine Sea and USS Laboon, the military said Tuesday.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.7886798807173901, "location": "Red Sea", "event_breakdown": "- Yemen's Houthi rebels launch missile attack damaging ship in Red Sea, latest assault on maritime route.\n- U.S. military shoots down drone headed towards USS Philippine Sea and USS Laboon in separate incident.\n- Italian frigate Virgino Fasan intercepts Houthi drone near Bab el-Mandeb Strait between Red Sea and Gulf of Aden.\n- Threat of attacks leads to decline in shipping through Red Sea and Gulf of Aden.\n- U.S. military intercepts five drones over Red Sea early Sunday morning."}, {"id": "d2ef4112-822f-4215-931d-e209e3380ac3", "title": "Likely missile attack by Yemen Houthi rebels targets a container ship in the Red Sea", "date": "2024-04-29 11:30", "url": "https://apnews.com/article/yemen-houthi-red-sea-ship-attacks-israel-hamas-gaza-cf858f30b4ba19731f6dc7719e9fa892", "message": "JERUSALEM (AP) — A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "classification": "security", "score": 0.800092280577137, "location": "Red Sea", "event_breakdown": "- Yemen’s Houthi rebels launch missile attack in the Red Sea, damaging a ship.\n- UKMTO reports ship was damaged but crew was safe and heading to next port.\n- Italian Defense Ministry reports its frigate Virgino Fasan shot down a Houthi drone near the Bab el-Mandeb Strait.\n- U.S. military shoots down five drones over the Red Sea on Sunday morning."}, {"id": "6b855377-21c3-413a-9fef-546e0f048abc", "title": "Likely Missile Attack by Yemen Houthi Rebels Targets a Container Ship in the Red Sea", "date": "2024-04-29 15:00", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthi-red-sea-ship-attacks-israel-hamas-gaza/2024/04/29/id/1162739/", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a container ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe private security firm Ambrey said a salvo of three missiles targeted a Malta-flagged container ship traveling from Djibouti onward to Jeddah, Saudi Arabia.\n“The vessel was targeted due to its listed operator’s ongoing trade with Israel,” Ambrey said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.", "classification": "security", "score": 0.8795034820386657, "location": "My knowledge cut-off date is January 2022. As of that time, the Houthi rebels were designated as a terrorist organization by some countries, including Saudi Arabia and the United States.", "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels targets container ship in Red Sea.\n- Private security firm Ambrey reports three missiles targeted Malta-flagged container ship traveling from Djibouti to Jeddah, Saudi Arabia.\n- Ambrey states vessel targeted due to operator's trade with Israel.\n- Houthi attacks decrease as rebels targeted by U.S.-led airstrike campaign in Yemen.\n- Shipping through Red Sea and Gulf of Aden declines due to threat."}, {"id": "67c6c35c-4911-4f80-bab6-569e618601bb", "title": "Likely Houthi Missile Attack Targets Red Sea Container Ship", "date": "2024-04-29 15:00", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthi-red-sea/2024/04/29/id/1162748/", "message": "A suspected missile attack by Yemen's Houthi rebels targeted a container ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said, without offering any other immediate details.\nThe private security firm Ambrey said a salvo of three missiles targeted a Malta-flagged container ship traveling from Djibouti onward to Jeddah, Saudi Arabia.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.", "classification": "security", "score": 0.9134344905705365, "location": "Mokha, Yemen", "event_breakdown": "- A suspected missile attack by Yemen's Houthi rebels targeted a container ship in the Red Sea off the coast of Mokha, Yemen\n- The attack targeted a Malta-flagged container ship traveling from Djibouti to Jeddah, Saudi Arabia\n- The attack involved a salvo of three missiles\n- Houthi attacks on international shipping in the Red Sea and Gulf of Aden have led to a decline in shipping due to security threats"}]