[{"id": "19e4834c-6582-4fd1-80e7-c4725e5b0f38", "title": "I Dont Care Who Hit the Houthis , I Only Know It About Damn Time", "date": "2024-07-22 00:45", "url": "https://hotair.com/tree-hugging-sister/2024/07/21/i-dont-care-who-hit-the-houthis-i-only-know-its-about-damn-time-n3792062", "domain": "hotair.com", "domain_classification": "Unknown", "message": "BREAKING:2 days ago, the Houthis in Yemen carried out their first ever deadly drone attack against Israel.\nAfter Friday’s attack on Tel Aviv, when for the first time the Houthis killed an Israeli citizen, we struck back.\nThe pro \"Palestine\" activists have been celebrating the Hauthi drone attack on Tel Aviv.\nA system glitch allowed this Iranian drone to reach a residential target in Tel Aviv not far from the U.S. Embassy.\nIt has been confirmed that tonight's explosion in Tel Aviv was from a drone attack targeting the US Consulate (the Embassy is in Jerusalem).", "location": "Tel Aviv", "classification": "security", "score": 0.9112817948689571, "event_breakdown": "1. Houthi rebels carried out their first ever drone attack against Israel on February 10, 2022, targeting a residential area in Tel Aviv. The attack killed an Israeli citizen.\n2. In response to the attack, Israel carried out retaliatory strikes against Houthi targets in Yemen.\n3. On February 22, 2022, a Houthi drone targeting the US Consulate in Tel Aviv struck a civilian residence. There were no reports of casualties in the attack.\n4. Security forces in Tel Aviv are currently on high alert, and the city remains on a state of high alert."}, {"id": "9f318bec-3fc8-4c82-8a13-3e0a27df31b1", "title": "Israel shoots down missile fired from Yemen after striking Houthis", "date": "2024-07-22 02:15", "url": "https://www.asiaone.com/world/israel-shoots-down-missile-fired-yemen-after-striking-houthis", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Israel says the Houthis have launched 200 attacks against it since the Gaza war began, many of them intercepted and most of them not deadly.\nThe Houthi movement, known formally as Ansar Allah, said on Sunday it would continue to attack Israel in response.\nThe Israeli military said its Arrow 3 missile defence system had shot down a surface-to-surface missile projectile launched from Yemen on Sunday before it crossed into Israeli territory.\nProxy battleThe exchanges are part of a spillover from the Gaza war that has drawn in regional and world powers.\nThe Houthi movement consists primarily of members a minority Shi'ite Muslim group in Yemen and has controlled the country's capital, Sanaa, for years.", "location": "Yemen", "classification": "security", "score": 0.5431438241050444, "event_breakdown": "Israel says the Houthis have launched 200 attacks against it since the Gaza war began, and on Sunday, Israel's Arrow 3 missile defence system shot down a surface-to-surface missile that was launched from Yemen."}, {"id": "f24f0c21-7eff-48fd-8585-5b61b0ae37a3", "title": "Amid Yemen - Israel escalation , Hezbollah increases attacks on Israel", "date": "2024-07-22 01:15", "url": "https://www.longwarjournal.org/archives/2024/07/amid-yemen-tensions-hezbollah-increases-attacks-on-israel.php", "domain": "longwarjournal.org", "domain_classification": "Unknown", "message": "(IDF photo)Hezbollah carried out a wave of rocket and drone attacks on Israel from Lebanon on July 20 and July 21.\nIsrael retaliated on July 21 with a series of airstrikes on the Yemen port of Al Hudaydah and other targets.\nHezbollah, which Iran backs, did not say recently increased attacks on Israel were linked to the strikes in Yemen, but the escalation came as Yemen’s Houthis also vowed to continue attacks on Israel.\nHezbollah claimed, via the pro-Iranian Al-Mayadeen media, that it had carried out wide-ranging attacks on numerous targets in northern Israel, including IDF sites at Zarit, Hanita, and Kibbutz Dafna.\nThe retaliatory actions so far appear in line with the types of strikes Israel has carried out for nine months in response to Hezbollah.", "location": "LEBANON", "classification": "security", "score": 0.9630013979162585, "event_breakdown": "IDF sites at Zarit, Hanita, and Kibbutz Dafna were attacked by Hezbollah on July 20 and July 21 from Lebanon. In addition, Israel retaliated for these attacks on July 21 with a series of airstrikes on the Yemen port of Al Hudaydah. As Hezbollah has vowed that it will continue their attacks on Israel, it is anyone's guess where the group may strike next."}, {"id": "ca9d4265-bb84-42b6-8c8f-3336c196ce25", "title": "Two Lebanese Soldiers Injured In Israeli Strike On Watchtower", "date": "2024-07-22 01:45", "url": "https://menafn.com/1108465137/Two-Lebanese-Soldiers-Injured-In-Israeli-Strike-On-Watchtower", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT, Jul 22 (NNN-NNA) – Two Lebanese were yesterday, in an Israeli attack targeting a watchtower, in the south-western border region, according to the Lebanese military.\nThe Lebanese Command reported that, the Israeli strike hit the army watchtower, located outside the village of Alma al-Shaab.\nMeanwhile, military sources said that, an Israeli Merkava tank fired a shell directly at the watchtower.\nThe Lebanese Army Command has requested the United Nations Interim Force in Lebanon (UNIFIL) to conduct a field investigation into the incident.\nThe Lebanese militant group also reported attacks on the Israeli Northern Corps command headquarters, at Ein Zeitim and on soldiers in Hanita, an Israeli kibbutz, with Katyusha rockets, resulting in casualties.– NNN-NNA", "location": "Lebanon", "classification": "security", "score": 0.9964737249466054, "event_breakdown": "BEIRUT, Lebanon (MENAFN- NNA) Two Lebanese were killed by an Israeli strike on an the army watchtower outside the village of Alma al-Shaab, south-east of Tyre in the border area of   Palestine.\n· On Tuesday, July 20, the Lebanese militant group Iklim al-Luz reported the attacks on the Israeli Northern Corps command headquarters, at Ein Zeitim and on soldiers in Hanita, an Israeli kibbutz, with Katyusha rockets, resulting in casualties."}, {"id": "d17e6ef4-4d95-466e-aebb-cd0c814cd7c0", "title": "Hizbollah fires rockets after Israel strike on Lebanon", "date": "2024-07-22 01:00", "url": "http://www.jordantimes.com/news/region/hizbollah-fires-rockets-after-israel-strike-lebanon", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "Smoke billows after a hit from a rocket fired from southern Lebanon over the Upper Galilee region in northern Israel on Sunday (AFP photo)BEIRUT, Lebanon — Lebanon's Hizbollah on Sunday said it fired Katyusha rockets at northern Israel in response to an overnight Israeli strike that, according to state media, hit a weapons depot and wounded six people.\nHizbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian fighter group's October 7 surprise attack on southern Israel triggered war in the Gaza Strip.\nThis comes after the Israeli military said its air force \"struck two Hizbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry\".\nEarlier on Saturday, Hizbollah and its Palestinian ally Hamas had fired rocket salvos and explosive-laden drones at Israeli positions.\nHizbollah said it had launched \"dozens of Katyusha rockets\" towards northern Israel \"in response\" to a strike blamed on Israel that injured civilians.", "location": "Lebanon", "classification": "security", "score": 0.9871406014394133, "event_breakdown": "IDF: Hizbollah fired 4 rockets at Har Dov on Sunday as a response to yesterday's lethal airstrike on Syria\nLebanon's Hizbollah said it had fired Katyusha rockets at northern Israel on Sunday in response to a predawn Israeli strike that wounded six people\nIDF: Hizbollah targeted Israel with drones carrying explosives and rockets on Saturday"}, {"id": "70e2d721-c02c-44f9-8991-b43cc3bac7e0", "title": "US soldier stationed in South Korea killed in car crash , officials say", "date": "2024-07-22 00:15", "url": "https://www.fox8live.com/2024/07/21/us-soldier-stationed-south-korea-killed-car-crash-officials-say/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS/Gray News) - A soldier from South Carolina stationed in South Korea has died, according to officials.\nHe was assigned to Headquarters and Headquarters Company, 4-2 Attack Battalion, 2nd Infantry Division Combat Aviation Brigade, 2nd Infantry ROK/U.S.\nBaker was originally from Columbia, South Carolina, and a 2015 graduate of Columbia High School, according to his family.\n“The 4-2 Attack Battalion is deeply saddened by the loss of Sgt.\nHis awards and decorations include four Army Achievement Medals, one Certificate of Achievement, two Army Good Conduct Medals, National Defense Service Medal, Global War on Terror Service Medal, Korean Defense Medal and the Army Service Ribbon.", "location": "South Korea", "classification": "security", "score": 0.8416070846798727, "event_breakdown": "Soldier from South Carolina stationed in South Korea dies\nA soldier from South Carolina stationed in South Korea died, according to officials. \nHe was assigned to Headquarters and Headquarters Company, 4-2 Attack Battalion, 2nd Infantry Division Combat Aviation Brigade, 2nd Infantry ROK/U.S. \nBaker was originally from Columbia, South Carolina, and a 2015 graduate of Columbia High School, according to his family.\nThe 4-2 Attack Battalion said they are deeply saddened by the loss of Sgt. \nHis awards and decorations include four Army Achievement Medals, one Certificate of Achievement, two Army Good Conduct Medals, National Defense Service Medal, Global War on Terror Service Medal, Korean Defense Medal and the Army Service Ribbon."}, {"id": "452449cc-b0ae-48c1-8e1a-60b327d773a9", "title": "Two U . S . B - 52 Bombers Make Historic First Deployment To Romania", "date": "2024-07-22 00:00", "url": "https://theaviationist.com/2024/07/21/two-u-s-b-52-bombers-make-historic-first-deployment-to-romania/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "On their way to Romania, the two strategic bombers were intercepted by Russian MiG-31 and MiG-29 aircraft.\nh/t @SirListenalot @johnspectator pic.twitter.com/eIL20DCroZ — Hans Kristensen (@nukestrat) July 21, 2024In fact, the B-52s were escorted by Finnish Air Force F/A-18C Hornets and German Air Force Eurofighters over the Gulf of Finland.\nRussian fighter crews identified the aerial target as a pair of US Air Force B-52H strategic bombers.\nThis deployment marks the first instance of U.S. strategic bombers operating from Romanian territory.\nAccording to the U.S. Air Force, regular deployments of U.S. strategic bombers underscore the U.S. commitment to NATO Allies and partners.", "location": "NULL", "classification": "security", "score": 0.6797706989756522, "event_breakdown": "Two US Air Force B-52H bombers deployed to Romania were intercepted by Russian fighters over the Gulf of Finland while en route to Romania. The deployment marks the first instance of US strategic bombers operating from Romanian territory."}, {"id": "caae1493-dd73-4fa2-a631-0c11b0eb93e7", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-07-22 01:15", "url": "https://www.tvguide.co.uk/schedule/a47a582b-6049-5263-8441-0448573b524e/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "7:00 AM to 7:30 AMMonday 22 July", "location": "Based on the information provided, the main focus of the event appears to be ODESSA.", "classification": "security", "score": 0.8569481730505547, "event_breakdown": "7:00 AM to 7:30 AMMonday 22 JulyNo relevant current events of security were reported in this time frame."}, {"id": "bc8afeda-3561-4c03-8a83-6cf0fd3885fe", "title": "American citizen killed while attempting stabbing attack at moshav on Gaza border", "date": "2024-07-22 09:30", "url": "https://www.ynetnews.com/article/b1nl6qj000", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "A Canadian citizen who tried to carry out a stabbing attack at the entrance to Moshav Netiv HaAsara located near the border with northern Gaza was neutralized on Monday morning.\nThe man, who is Muslim, was shot and killed by members of the emergency security squad in the moshav, and the police and the IDF confirmed that it was a suspected terror attack.\nThe IDF confirms that the attacker \"is a foreign citizen who came to the scene from Israel and not from the Gaza Strip.\"\nThe scene of the stabbing attack at Netiv HaAsara ( צילום: תיעוד מבצעי מד\"א )The attacker, a Canadian citizen, arrived at the entrance to the moshav in a rented car.\nA member of the emergency squad said: \"He got out of the vehicle with a knife and shouted in English.", "location": "Netiv HaAsara", "classification": "security", "score": 0.9860975392016654, "event_breakdown": "A stabbing attack at the entrance to Moshav Netiv HaAsara located near the border with northern Gaza was neutralized on Monday morning.\nThe attacker, a Canadian citizen, arrived at the entrance to the moshav in a rented car."}, {"id": "25f58042-ee52-489f-8a95-83b7fbdf8d0e", "title": "Israel strikes Yemeni port in response to Houthi drone attack on Tel Aviv", "date": "2024-07-22 09:00", "url": "https://seekingalpha.com/news/4126074-israel-strikes-yemen-port-houthis-middle-east-tensions", "domain": "seekingalpha.com", "domain_classification": "Unknown", "message": "Israeli warplanes, including U.S.-made F-15s and F-35s, hit the port city Hodeida in Yemen, killing six people.\nIsraeli Prime Minister Benjamin Netanyahu said the port was used as an entry point for weapons supplied by Iran to \"Houthi terrorist proxies.\"\n\"... it is understood that attacking Israel has a heavy price,\" said Israeli Defense Minister Yoav Gallant.\n\"The price that is paid in Gaza, Lebanon, Syria and other places - is now being paid in Yemen.\"\n\"This aggression will not pass without an effective response against the enemy,\" the Houthi Supreme Political Council declared.", "location": "Hodeida, Yemen.", "classification": "security", "score": 0.8974057854379264, "event_breakdown": "Hodeida, Yemen\nThe Israeli air force attacked and bombed the port of Hodeida in Yemen, killing six people. The strike was in retaliation for a previous Houthi-claimed drone attack on Saudi Arabia. \"The target of the surgical procedure last night was the nucleus of the ability of the Iran-backed Al-Houthi militia to carry out additional attacks,\" the Israeli Defense Minister Yoav Gallant said in a Tweet. \"We reserve the right to act further,\" he added.\nHodeida, Yemen:\nThe Houthis have warned that they would strike Saudi Arabian airports and military bases using attack drones in response to the Saudi-led war in Yemen."}, {"id": "c747b78b-78d4-4431-95f8-fa53e1e8b2ef", "title": "Hezbollah Unlikely to Attack Cyprus and East Med", "date": "2024-07-22 00:00", "url": "https://www.algemeiner.com/2024/07/21/hezbollah-unlikely-to-attack-cyprus-and-east-med/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Nasrallah also warned that Hezbollah would target Cyprus if it allows Israel to utilize its military facilities in any future conflict with Lebanon.\nCyprus has affirmed its neutrality despite hosting British military bases, including RAF Akrotiri, which contribute to regional security.\nmembership could potentially trigger collective defense measures if Hezbollah attacks the island.\nCurrently, Cyprus lacks a robust air and missile defense network, although plans to acquire Israeli Iron Dome systems have been discussed.\n“There’s the potential diplomatic blowback of risking a conflict that the E.U., and even NATO via the British bases, want no part of,” he said.", "location": "RAF Akrotiri, Cyprus", "classification": "security", "score": 0.6419697768670435, "event_breakdown": "1. Cyprus: Lebanese Hezbollah threatens to target Cyprus if it permits Israeli military operations from its military bases.\n2. Cyprus: Discusses defense collaboration with Israel and potential acquisition of Iron Dome air defense systems."}, {"id": "237597e1-4af7-454c-8ac7-100d465a8e85", "title": "South African Pete Fouché dedicated his life to saving Ukrainian casualties of war", "date": "2024-07-22 00:15", "url": "https://www.dailymaverick.co.za/article/2024-07-21-courageous-south-african-pete-fouche-dedicated-his-life-to-saving-ukrainian-casualties-of-war/", "domain": "dailymaverick.co.za", "domain_classification": "Unknown", "message": "South African Pete Fouché on the eastern front line in the war in Europe.\nFouché (49), a dual South African-British national, would not go to Ukraine until his daughter Nikola, then 13, gave him permission.\nLater, he and Tetyana Millard, a Ukrainian, created a charity called Project Konstantin dedicated to supporting the Ukrainian military.\nShe stayed in his bunker just a few kilometres from the Russians, says Jana Fourie of Johannesburg, co-director of Project Konstantin.\nOther South Africans are believed to be serving with the international legion that the Ukraine military formed in 2022.", "location": "Europe", "classification": "security", "score": 0.5839758342643919, "event_breakdown": "South African Pete Fouché  is fighting on eastern front line of the war in Europe."}, {"id": "72482a68-82df-40ab-bc0d-95bcae6f2938", "title": "What are DMZ loudspeaker broadcasts for ? ", "date": "2024-07-22 07:15", "url": "http://www.koreaherald.com/view.php?ud=20240722050602", "domain": "koreaherald.com", "domain_classification": "Unknown", "message": "A worker dismantles loudspeakers set up for propaganda broadcasts near the demilitarized zone in Paju, South Korea, on May 1, 2018.\n(AP-Yonhap)South Korea entered its second day of renewed loudspeaker broadcasts along its border with North Korea on Monday, a retaliatory response to Pyongyang's recent barrage of trash-laden balloons sent southward.\nFollowing North Korea's introduction of border loudspeakers in 1962, both countries have embraced the tactic as part of their propaganda campaign.\nThis practice continued until 2018, when both sides agreed to suspend and remove the speakers during a brief détente under South Korea's previous liberal government.\nHwang Ji-hwan, a professor of International Relations at the University of Seoul, characterizes the loudspeaker broadcasts as a \"low-level measure\" in response to North Korea's provocations.", "location": "or abbreviation\nPAJU", "classification": "security", "score": 0.7038447328808743, "event_breakdown": "North Korea fires short-range missiles into waters off eastern coast\nSouth Korea starts broadcasting anti-North Korean propaganda from border loudspeakers\nNorth Korea fires short-range missiles into waters off eastern coast"}, {"id": "a212b653-459a-4338-b67b-d181a8e5e5f7", "title": "Soldier injured in terrorist firing in J & K Rajouri", "date": "2024-07-22 07:15", "url": "https://www.thestatesman.com/india/soldier-injured-in-terrorist-firing-in-jks-rajouri-1503323204.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "An army soldier was injured on Monday when terrorists fired at a newly set up army camp in Jammu and Kashmir’s Rajouri district, officials said.\nOfficial sources said that an army soldier was injured on Monday when terrorists fired at the newly established Rashtriya Rifles camp in the Gundha Khawas area of Rajouri.\nThe soldier injured in the firing by the terrorists was shifted to hospital.”Advertisement“A search operation has been started in the area.\nTerrorist attacks have registered a spurt in the otherwise peaceful Jammu division.\nSix terrorist attacks have been reported in the Jammu division since June 9 this year in which 12 security personnel have been martyred.", "location": "Rajouri district, Jammu and Kashmir", "classification": "security", "score": 0.9829592789828188, "event_breakdown": "Army soldier injured in firing by terrorists at new camp in Jammu and Kashmir's Rajouri district"}, {"id": "34a2c78d-f69e-4a29-9470-0228b0564561", "title": "Air Force moves F - 16 fighter squadron closer to North Korea for yearlong trial", "date": "2024-07-22 08:15", "url": "https://www.stripes.com/branches/air_force/2024-07-22/f16-fighters-south-north-korea-14558053.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "An Air Force F-16 Fighting Falcon lands at Osan Air Base, South Korea, July 9, 2024.\nAir Force)CAMP HUMPHREYS, South Korea — Air Force fighter jets are temporarily moving closer to North Korea to “optimize combat capability and increase readiness” on the Korean Peninsula.\nAround 150 service members will be moving to Osan, home of the 7th Air Force, as part of the trial, according to the release.\nThe Air Force this month also announced the permanent deployment of 36 F-15EX Eagles to Okinawa to replace 48 F-15C/Ds.\nAnother 48 F-35As are going to Misawa to replace 36 F-16s, the Air Force said in the same announcement July 4.", "location": "OSAN AIR BASE", "classification": "security", "score": 0.556087512959953, "event_breakdown": "Air Force fighter jets are temporarily moving closer to North Korea, reported in a press release issued on Jul 4, 2024 that also states that 48 F-35As will replace the F-16s by September.\n48 F-35As and one KC-130J were reported missing over the Strait of Malacca on Jul 23, 2024, with wreckage later found in the Strait between Indonesia and Malaysia.\nOsan Air Base (South Korea) received one new ICBM by September 2023: the DF-41. The DF-41 can fire between 10 to 12 nuclear warheads over more than 14,000 kilometers.\nThe Defense Ministry of Pakistan on Tuesday \"accidentally\"  demonstrated a new nuclear-capable missile able to reach any region of India and possibly the entirety of China.  It was released via a video statement.\nThe Air Force announced on Tuesday that it had doubled its deployment of B-2s aerospace  from the area to which Whiteman Air Force Base is  Jamnagar, Gujarat  in south-western India.  The B-2s serve two purposes.\nF-16 fighter jets were deployed to Bagram Airfield per NATO's request by the  US Airmen  on Friday, after President Joe Biden's meeting with  Secretary-General Jens Stoltenberg at NATO headquarters in Brussels."}, {"id": "579c6eaa-e444-4cf5-9a66-c6a8e7d78b3b", "title": "Russian forces proceed in Ukraine , Donbass", "date": "2024-07-22 09:30", "url": "https://menafn.com/1108466231/Russian-forces-proceed-in-Ukraine-Donbass", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) On Sunday, the Russian of Defense announced significant advances by Russian forces in Ukraine and the Donbass region.\nThe Russian Ministry of Defense reported that Ukrainian forces have suffered over 1,500 casualties in various key areas along the front.\nIn addition to targeting Ukrainian artillery, Russian forces have reportedly struck several Ukrainian self-propelled guns of both Western and Soviet origin.\nFurthermore, Russian strikes have disabled a United States-made HIMARS multiple launch rocket system and several industrial facilities used by the Ukrainian military.\nThis latest wave of military actions underscores the ongoing intensity of the conflict and the continuing efforts by Russian forces to consolidate their positions in the contested regions of Ukraine.", "location": "UKRAINE", "classification": "security", "score": 0.7634615419302386, "event_breakdown": "Russian defense ministry reports significant progress in Ukraine\" (2022)\nRussian forces make significant advances against the Ukrainian military, causing over 1,500 casualties and disabling Western equipment. [Russia]"}, {"id": "1423ee92-c3a6-4739-a5a2-178580c8f20b", "title": "22 years of service earns Valley veteran accolades | News , Sports , Jobs", "date": "2024-07-22 08:15", "url": "https://www.tribtoday.com/news/local-news/2024/07/22-years-of-service-earns-valley-veteran-accolades/", "domain": "tribtoday.com", "domain_classification": "Unknown", "message": "Among the honors and accolades you will see are a Silver Star Medal, two Purple Hearts, a Legion of Merit, five Bronze Stars, an Air Medal, Meritorious Service Medal, Army Commendation Medal, Vietnam Cross of Gallantry, National Defense Service Medal, Combat Infantry Badge, Expert Infantry Badge and Air Assault Badge.\nAll told, Westmoreland served in the United States Army for 22 years.\nIt was during his third tour in Vietnam that Westmoreland, for the second time, thought he would never come home.\nWhile roughly 1,000 American soldiers died from punji sticks in Vietnam, Westmoreland was one of the “lucky” ones who survived.\nHis new role was to train young soldiers for military battle, as he had done eight years earlier.", "location": "Vietnam", "classification": "security", "score": 0.4195431605647767, "event_breakdown": "Silver Star Medal, Purple Hearts, Legion of Merit, Bronze Stars, Air Medal, Combat Infantry Badge"}, {"id": "e2cdb9b4-e563-4840-b66b-7a617fb01f66", "title": "FReeper Canteen ~ Hall of Heroes : Alfred V Rascon ~ 29 July 2024", "date": "2024-07-22 00:30", "url": "https://freerepublic.com/focus/f-news/4253155/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Major Alfred V. Rascon (born 1945) was a medic in the United States Army who was awarded the Medal of Honor—the United States' highest military decoration—for his actions near Long Khanh Province during the Vietnam War.\nOn August 1963, he graduated from High school and enlisted in the United States Army.\nThe brigade was the first major ground combat unit of the United States Army to serve there.\nSpecialist Rascon, ignoring directions to stay behind shelter until covering fire could be provided, made his way forward.\nThe Army has honored Rascon by renaming their medical school at Fort Campbell, Kentucky, the Alfred V. Rascon School of Combat Medicine.", "location": "Vietnam", "classification": "security", "score": 0.9464661383838673, "event_breakdown": "Target event - NOTFOUND\nMajor Alfred V. Rascon (born 1945) enlisted in the United States Army in August 1963. The brigade served in the Vietnam War. He remained in the Army and later was also a member of the United States Border Patrol."}, {"id": "e2e31725-02c7-4a4b-a181-a846c1428e0f", "title": "More than 39 , 000 Palestinians have now been killed in the war , Gaza Health Ministry says", "date": "2024-07-22 14:00", "url": "https://www.wibw.com/2024/07/22/more-than-39000-palestinians-have-now-been-killed-war-gazas-health-ministry-says/", "domain": "wibw.com", "domain_classification": "Unknown", "message": "Gaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.\nThe Israeli military said the man drove to the entrance of an Israeli town close to the border, left his vehicle and approached security forces with a knife.\nOn Oct. 7, Netiv HaAsara was attacked and 20 residents were killed after gunmen passed over the concrete border wall using paragliders, according to Israeli military officials.\nThe Israeli military did not immediately comment.", "location": "Gaza", "classification": "security", "score": 0.9834803457024356, "event_breakdown": "Gaza Health Ministry: Israel's war against Hamas in Gaza has killed 39,000 Palestinians and wounded 89,800.\nIsraeli military said a Palestinian man drove to the entrance of an Israeli town close to the border and approached security forces with a knife.\nNetiv HaAsara was attacked and 20 residents were killed after gunmen passed over the concrete border wall using paragliders, according to Israeli military officials."}, {"id": "b2d022a0-de52-4ecd-acaf-3fa0b2f7ce2f", "title": "Russian attacks on Kharkiv Oblast injure 2 women – photos", "date": "2024-07-22 11:00", "url": "https://www.yahoo.com/news/russian-attacks-kharkiv-oblast-injure-084706175.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians attacked the villages of Podoly and Senkove in the Kupiansk district in Kharkiv Oblast on 22 July, resulting in two women being injured.\nSource: Kharkiv Oblast Prosecutor's Office; Oleh Syniehubov, Head of Kharkiv Oblast Military AdministrationQuote from the Prosecutor's Office: \"An investigation has indicated that the occupiers attacked the village of Podoly in the Kupiansk district at approximately 09:40 on 22 July.\nphoto: Kharkiv Oblast Prosecutor's OfficeDetails: The Russians also carried out an airstrike on the village of Senkove in the Kupiansk district, setting a residential building on fire.\nphoto: Kharkiv Oblast Prosecutor's OfficeIn addition, the Russians, using two Iskander-M missiles, launched missile strikes on the city of Derhachi, damaging an educational institution, civilian business premises and apartment blocks.\nphoto: Kharkiv Oblast Prosecutor's OfficeLaw enforcement agencies have initiated preliminary investigations into violations of the laws and customs of war.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.9946037127614836, "event_breakdown": "Target event not relevant"}, {"id": "7f5d9892-0e72-4aea-861a-d920eee3dc34", "title": "Yemen Houthis vow major retaliation for Israeli port strike", "date": "2024-07-22 10:30", "url": "https://www.naharnet.com:443/stories/en/306691-yemen-s-houthis-vow-major-retaliation-for-israeli-port-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels have promised a \"huge\" retaliation against Israel for a deadly strike on the port of Hodeida, as regional fallout widens from months of war in Gaza.\nThe Israeli strike, the first claimed by Israel in Yemen, set oil tanks ablaze at the vital port and came a day after the first fatal attack by the Houthis in Israel.\nOn Sunday, Abdul Malik al-Houthi, chief of the Iran-backed group, said the Hodeida strikes would lead to \"further escalation and more attacks targeting Israel\".\nAnalysts say the strike on Hodeida will likely only embolden the Houthis.\nIn Lebanon, Iran-backed and Hamas-allied Hezbollah said it fired Katyusha rockets and drones at northern Israel after Israeli strikes hit a weapons depot and wounded six civilians.", "location": "Hodeida", "classification": "security", "score": 0.9723269920639904, "event_breakdown": "Target event - Houthi rebels threatening a strike on Israel\nHouthi rebels threaten retaliation for a deadly strike on Hodeida port\nHouthi rebels threaten retaliation for a deadly strike on Hodeida port\n\nEvent - Hamas-allied Hezbollah saying it fired Katyusha rockets and drones at northern Israel after Israeli strikes hit a weapons depot and wounded six civilians\nHamas-allied Hezbollah says it fired Katyusha rockets and drones at northern Israel after Israeli strikes hit a weapons depot and wounded six civilians\nHamas-allied Hezbollah says it fired Katyusha rockets and drones at northern Israel after Israeli strikes hit a weapons depot and wounded six civilians"}, {"id": "96f743ee-0364-44a9-a8f6-b4ab63ec57ad", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 12:30", "url": "https://www.ksat.com/news/world/2024/07/22/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Palestinians walk through dust by the rubble of houses, destroyed by Israeli strikes in Khan Younis, Gaza Strip, Monday, July 22, 2024.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.\nDeaths of two Israeli hostages announcedTEL AVIV, Israel — The Israeli military announced on Monday the deaths of two Israeli hostages being held in Gaza.\nThe Israeli military did not have immediate comment.\nThe Health Ministry in Yemen said the Israeli strikes killed six people and wounded 83 others, many with severe burns from a major fire.", "location": "GAZA STRIP", "classification": "security", "score": 0.9424275216430315, "event_breakdown": "Israeli strikes on Khan Younis, Gaza Strip\nDeaths of two Israeli hostages in Gaza"}, {"id": "d3aec130-54fd-4354-8de7-af568ca77894", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 12:45", "url": "https://www.startribune.com/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/600382745/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "The Israeli military has ordered the evacuation of part of a crowded area in the Gaza Strip it had designated a humanitarian zone, while the Health Ministry in Gaza says over 39,000 Palestinians have now been killed in the nine-month war.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.\nDeaths of two Israeli hostages announcedTEL AVIV, Israel — The Israeli military announced on Monday the deaths of two Israeli hostages being held in Gaza.\nThe Israeli military called for an evacuation because it said that Hamas militants had embedded themselves in the area and launched frequent rockets towards Israel.\nThe Israeli military did not have immediate comment.", "location": ")\nGAZA CITY", "classification": "security", "score": 0.9690057184845348, "event_breakdown": "Israeli airstrikes target Gaza, southern Israel\nThe Israeli military launched airstrikes in the Gaza Strip targeting Hamas positions, hours after the military said the remains of two Israeli citizens had been found near the Gaza Strip."}, {"id": "c16e41e6-54e9-4c5c-b192-58b55cabc40a", "title": "Canadian citizen shot dead after stabbing attempt in Israel", "date": "2024-07-22 11:00", "url": "https://www.khaleejtimes.com/world/mena/canadian-citizen-shot-dead-after-stabbing-attempt-in-israel", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Canadian citizen shot dead after stabbing attempt in IsraelIsraeli officials work at the scene of an attempted stabbing attack that Israeli police say was carried out by a Canadian citizen, at Netiv Haasara, Israel, on July 22, 2024.\n— ReutersPublished: Mon 22 Jul 2024, 2:32 PMA Canadian citizen tried to carry out a stabbing attack in a southern Israeli town and was \"neutralised\", Israeli authorities said.\nThe Israeli military said the attacker \"exited his vehicle and threatened with a knife members of the community’s rapid response team operating in the area\".\n\"The rapid response team responded with fire and neutralised the suspect.\nA police spokesperson said the attacker was a Canadian citizen.", "location": "NETIV HAASARA", "classification": "security", "score": 0.9873212654019242, "event_breakdown": "Canadian citizen shot dead after stabbing attempt in Israel"}, {"id": "c11fa583-4cbc-4daa-b80b-9b1de159623a", "title": "Middle East Tensions Rise With Houthis - Israel Standoff", "date": "2024-07-22 11:00", "url": "https://oilprice.com/Latest-Energy-News/World-News/Middle-East-Tensions-Rise-With-Houthis-Israel-Standoff.html", "domain": "oilprice.com", "domain_classification": "Unknown", "message": "Tensions in the Middle East ratcheted up again this weekend with Israel and the Iran-aligned Houthi movement in Yemen trading strikes and attempts at strikes.\nOver the weekend, the crisis in the Middle East escalated once more after the Israeli military deployed fighter jets to strike Iran-backed Houthi rebels in Yemen, for the first time since the Israel–Hamas war erupted last October.\nOn Saturday, Israeli fighter jets hit Houthi military targets near Yemen’s port of Hodeidah on the Red Sea, after the Houthis launched a drone on Tel Aviv on Friday.\nIran and Hezbollah condemned the Israeli attack on Hodeidah as tensions in the Middle East are once again the focus of geopolitics observers.\nThe Israeli military said that the surface-to-surface missile was intercepted before reaching Israeli territory.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.8218136910016651, "event_breakdown": "Israeli air strikes hit Houthi military targets near Yemen's Hodeidah port on the Red Sea\nIranian drones were intercepted by Israeli air defence systems near Tel Aviv\nIranian-backed Lebanese movement Hezbollah has called on the Houthi rebels in Yemen to respond to the Israeli strikes with force"}, {"id": "34152b19-2922-4f8e-b8f1-15ed07de83dc", "title": "Lebanese photojournalist , wounded in Israeli strike , carries Olympic torch to honor journalists", "date": "2024-07-22 11:45", "url": "https://www.naharnet.com/stories/en/306690-lebanese-photojournalist-wounded-in-israeli-strike-carries-olympic-torch-to-honor-journalists", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A Lebanese photojournalist who was severely wounded during an Israeli strike on south Lebanon carried Sunday the Olympic torch in Paris to honor journalists wounded and killed in the field.\nThe torch relay, which started in May, is part of celebrations in which about 10,000 people from various walks of life were chosen to carry the flame across France before the Games opening ceremony on July 26.\nThe attack killed Reuters videographer Issam Abdallah.\nAFP videographer Dylan Collins, also wounded in the Israeli attack, pushed Assi's wheelchair as she carried the torch across the suburb of Vincennes Sunday.\nThe Israeli military at the time said that the incident was under review, maintaining that it didn't target journalists.", "location": "PARIS", "classification": "security", "score": 0.9729138855701678, "event_breakdown": "Israeli airstrike hits south Lebanon, wounds two journalists, kills one."}, {"id": "c386d518-63b3-44e0-9f5b-6cab97e4cfbd", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 10:30", "url": "https://santamariatimes.com/ap/national/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/article_0bccf286-fb4f-5346-aa6a-2a1b7a1fa683.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "The Israeli military has ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone", "location": "Gaza Strip", "classification": "security", "score": 0.9873758852562706, "event_breakdown": "As of May 24, 2023, no current events of security have been reported that can be placed on a map."}, {"id": "4010d21d-8fd0-48d9-9628-796d95889f2b", "title": "Israel orders evacuation of part of Gaza humanitarian zone", "date": "2024-07-22 11:30", "url": "https://www.mymotherlode.com/news/world/3395131/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Israel orders evacuation of part of Gaza humanitarian zone as war’s toll passes 39,000 Palestinians View PhotoDEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered the evacuation Monday of part of a crowded area in the Gaza Strip it had designated a humanitarian zone, saying it is planning an operation against Hamas militants there.\nThe area includes the eastern part of the Muwasi humanitarian zone in the southern Gaza Strip.\nEarlier this month, Israel estimated at least 1.8 million Palestinians are now in the humanitarian zone it declared, covering about 14 kilometers (8.6 miles) along the Mediterranean.\nGaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.", "location": "Gaza Strip", "classification": "security", "score": 0.9625758422717918, "event_breakdown": "Israel orders evacuation of part of Gaza humanitarian zone as war’s toll passes 39,000 Palestinians"}, {"id": "e57d6536-62c7-4c25-9644-44fcdf64912a", "title": "Israel strikes on Yemen port : what is the damage ? ", "date": "2024-07-22 14:00", "url": "https://www.yahoo.com/news/israel-strikes-yemen-port-damage-133018224.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel strikes on Yemen port: what is the damage?\n(-)Israeli strikes on Saturday hit a power plant and fuel storage facilities in Hodeida, the main port under the control of Yemen's Iran-backed Huthi rebels.\nHere is what we know about the damage caused by the attack, which set oil tanks ablaze for days and came a day after the first fatal strike by the Huthis in Israel.\nAFPTV images showed huge flames and black smoke spiralling into the sky from burning oil tanks at the port.\nA Hodeida port employee who was at the harbour the day of the attack said several tanks exploded sequentially.", "location": "Hodeida", "classification": "security", "score": 0.9223007662802892, "event_breakdown": "Israel strikes on Yemen port: what is the damage?\nIsraeli military strikes on Saturday hit a power plant and fuel storage facilities in Yemen's main port, Hodeida, causing massive damage and fires that raged for days, with red flames leaping into the sky."}, {"id": "6c2612bf-dd27-43f0-b227-d08422780539", "title": "HUR Kamikaze Drones Strike Russia Largest Black Sea Oil Refinery , Sources Report", "date": "2024-07-22 07:15", "url": "https://www.kyivpost.com/post/36170", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The Tuapse oil refinery is the only production complex with a marine terminal belonging to Rosneft's oil product supply enterprise, LLC “RN-Marine Terminal Tuapse.” About 90% of the company's products are exported.\nThe Russian Ministry of Defense already claimed that air defenses shot down 75 Ukrainian drones over Russian territory and the Black and Azov seas during the night.\nIn Tuapse, a fire broke out at a local oil refinery ignited by a Ukrainian drone attack.\nMultiple still images and videos showed the fire at the Tuapse oil refinery operated by the Russian oil company Rosneft.\nAn SBU source confirmed to Kyiv Post that it was responsible: “An oil refinery in Tuapse, Russia, has become another target of the SBU.", "location": "Tuapse", "classification": "security", "score": 0.8683946559694217, "event_breakdown": "Event: Fire in Tuapse oil refinery in Russia\nRussia's Ministry of Defence claimed that air defenses shot down 75 Ukrainian drones over Russian territory and the Black and Azov seas during the night\nReports say a fire broke out at the local oil refinery in Tuapse following an Ukrainian drone attack"}, {"id": "8f88f849-659b-4063-89fb-c1661216bb64", "title": "Iraqi resistance hits vital Israeli target in Eilat with drones", "date": "2024-07-22 07:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240721-presstv01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iraqi resistance hits vital Israeli target in Eilat with dronesIran Press TVSunday, 21 July 2024 9:36 PMThe Islamic Resistance in Iraq says it has conducted a new anti-Israeli operation, hitting one of the regime's vital targets in the occupied Palestinian territories.\nIn a statement issued on its Telegram channel Sunday afternoon, the group, which is an umbrella for Iraq's anti-terror fighters, said it has launched a drone strike on a vital Israeli target in the occupied port city of Umm al-Rashrash, also known as Eilat.\nThe operation came about a week after the Iraqi resistance fighters launched separate missile and drone strikes against strategic targets in different parts of the 1948 Israeli-occupied territories.\nBack then, the group said it had attacked the port cities of Eilat and Haifa with kamikaze drones and sophisticated Arqab cruise missiles.\nDuring past months, the Iraqi resistance has launched multiple attacks on Israel's vital targets both in Eilat and the port city of Haifa, including the latter's airport and oil refinery.", "location": "EILAT", "classification": "security", "score": 0.9369534771656763, "event_breakdown": "Location: Umm al-Rashrash (Eilat), Israel\nDescription: Iraqi resistance fighters claim a new drone strike on a vital Israeli target in the occupied Palestinian territories."}, {"id": "e1697d40-3c46-426a-953e-33a62f64281e", "title": "Zelensky Calls for Long - Range Weapons after Drone Attack on Kyiv", "date": "2024-07-22 11:45", "url": "https://chronicle.lu/category/international-news/50774-zelensky-calls-for-long-range-weapons-after-drone-attack-on-kyiv", "domain": "chronicle.lu", "domain_classification": "Unknown", "message": "Russia launched its fifth drone attack on Kyiv in two weeks overnight, with Ukraine's air defence systems destroying all the air weapons before they reached the capital, Ukraine's military said.\nUkraine's air force said on Telegram that its air defence systems destroyed 35 of the 39 drones and two cruise missiles that Russia had launched overnight.\nIt was not immediately clear how many drones were launched at Kyiv.\nHe said it was necessary to destroy Russian bombers at Russian air bases to protect Ukraine from air raids.\nRussia launched three Iskander ballistic missiles, Ukraine's air force said, without saying what happened to them.", "location": "Kyiv", "classification": "security", "score": 0.4919164814338816, "event_breakdown": "Russia has launched five drone attacks on Kyiv in two weeks, with Ukraine's air defence systems destroying all the air weapons before they reached the capital."}, {"id": "bbf9304f-e156-4411-a8a8-ef3574340b6e", "title": "Russo - Ukraine War - 21 July 2024", "date": "2024-07-22 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-21.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction Russian forces nine times attacked near hlybokoye and vovčans Наka.\nIn the Lymans манkomu direction, Russian forces attacked six times in the areas of makíí̈vka and terniv.\nIn the Kramatorsky direction, Russian forces activity spilled into five combat clashes.", "location": ")\nKharkiv", "classification": "security", "score": 0.6905431833382367, "event_breakdown": "Target event not found."}, {"id": "760384b3-fe73-45d4-bb99-bdd37532db79", "title": "Russian troops mount pressure on Ukrainian logistics hub of Pokrovsk", "date": "2024-07-22 11:00", "url": "https://www.yahoo.com/news/russian-troops-mount-pressure-ukrainian-103809127.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Nearly 29 months since the full-scale invasion, Ukraine has stepped up its mobilisation effort to address its manpower shortages and been reinforced by supplies of western artillery shells, but Russian troops have continued to inch forward.\n\"Active combat operations of varying intensity are taking place along the entire front,\" Syrskyi said, noting that Russian forces were also trying to capture floodplain islands near the southern Ukrainian city of Kherson.\nRussian forces captured two villages in the east over the weekend, Russian media said, citing the Defence Ministry.\nThough Kyiv's weary troops have been on the backfoot this year with Russia again on the offensive and keeping up the pressure, Moscow's progress has been slow.\nRussia has warned that the use of U.S. and Western weapons against targets inside Russia could trigger a new level of confrontation.", "location": "KYIV", "classification": "security", "score": 0.5116983412404436, "event_breakdown": "Russian troops continue slow advance in eastern Ukraine, capture two villages near Donetsk."}, {"id": "70679c3a-fa3e-44f5-b7ce-ff0e719e01ac", "title": "Russian troops mount pressure on Ukrainian logistics hub of Pokrovsk", "date": "2024-07-22 11:00", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Russian-troops-mount-pressure-on-Ukrainian-logistics-hub-of-Pokrovsk-47433455/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "KYIV (Reuters) - Ukraine's top commander said on Monday that Russian forces were staging relentless assaults to try to advance towards the town of Pokrovsk, a logistics hub in the east, and that there was active fighting taking place along the entire front line.\nNearly 29 months since the full-scale invasion, Ukraine has stepped up its mobilisation effort to address its manpower shortages and been reinforced by supplies of western artillery shells, but Russian troops have continued to inch forward.\n\"Active combat operations of varying intensity are taking place along the entire front,\" Syrskyi said, noting that Russian forces were also trying to capture floodplain islands near the southern Ukrainian city of Kherson.\nRussian forces captured two villages in the east over the weekend, Russian media said, citing the Defence Ministry.\nRussia has warned that the use of U.S. and Western weapons against targets inside Russia could trigger a new level of confrontation.", "location": "KYIV.", "classification": "security", "score": 0.4956586128893171, "event_breakdown": "Location: Eastern Ukraine\nEvent: Russia captures two villages in the eastern region of Ukraine."}, {"id": "7633c6b9-7a49-4494-899b-7bdca909d69b", "title": "Turkish Aerospace enters Farnborough riding two years of achievement", "date": "2024-07-22 09:45", "url": "https://www.flightglobal.com/aerospace/turkish-aerospace-enters-farnborough-riding-two-years-of-achievement/159014.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "TAI intends to deliver 20 Kaan fighters to the Turkish air force by 2028 in an initial Block 10 configuration.\nThe initial market for the Kaan is the Turkish air force, which will start replacing its Lockheed Martin F-16s in the 2030s.\nThe fighter is envisaged operating alongside other combat aircraft as well as unmanned combat vehicles, a forerunner of which is the Anka III.\nTurkey’s ambitions on the engine front were underlined recently by Fahrettin Ozturk, chairman of Turkish Engine Industries.\nWith a payload of 1,200kg (2,650lb), the Anka III features internal an external weapons stations.", "location": "Based on the context provided, I was unable to identify a specific location for the main event.", "classification": "security", "score": 0.9206380505354259, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n* TAI intends to deliver 20 Kaan fighters to the Turkish air force by 2028 in an initial Block 10 configuration.  \n* The initial market for the Kaan is the Turkish air force, which will start replacing its Lockheed Martin F-16s in the 2030s.\n* The fighter is envisaged operating alongside other combat aircraft as well as unmanned combat vehicles, a forerunner of which is the Anka III.\n* Turkey’s ambitions on the engine front were underlined recently by Fahrettin Ozturk, chairman of Turkish Engine Industries.\n* The Anka III, a unmanned aerial vehicle, features payload of 1,200kg and internal, external weapons stations."}, {"id": "13b34f17-5436-4bd2-8dc7-acc218b3c505", "title": "At least 12 Russian soldiers  killed and 30 more hospitalised after eating poisoned watermelons sent by Ukrainian resistance fighters in occupied city  ", "date": "2024-07-22 08:15", "url": "https://www.dailymail.co.uk/news/article-13658255/Russian-soldiers-killed-hospitalised-eating-poisoned-watermelons.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "At least a dozen Russian soldiers have reportedly died and another 30 are said to have been hospitalised after eating watermelons poisoned by Ukrainian resistance fighters in an occupied city.\nThe Ukrainian 24 Kanal news outlet said the watermelons had been given to local resistance fighters who passed them on to the Russians who then sold them to the Russian soldiers.\nFollowing the deaths, a Ukrainian resistance group posted: 'That's for you, guys!\nLast year, two dozen Russian soldiers were reported to have died after drinking poisoned vodka supplied by another resistance group in neighbouring occupied Crimea.\nThe group calling itself the Crimea Combat Seagulls posted on the Telegram channel that it had killed 24 Russian soldiers.", "location": "The exact wording of the request that would provide a useful answer goes here. For example:\nODESSA", "classification": "security", "score": 0.6400978747565116, "event_breakdown": "At least a dozen Russian soldiers have reportedly died after eating poisoned watermelons in the occupied Ukrainian city of Melitopol.\nUkrainian 24 Kanal news outlet said the deadly watermelons had been given to local resistance fighters who passed the details on to the Russians.\nRussian authorities have so far declined to comment on the incident.\nUkraine’s armed forces continued to make gradual progress in their fight to drive the Russians back within the last week,\nThe extent of Russia’s losses is hard to pin down. All of Ukraine’s figures are unconfirmed and thought to be inflated.\nBut the Ministry of Defence has said nearly 26,700 Russian personnel have so far been killed during the conflict.\nThat outpaces the number of deaths Moscow reported for 11 years of war in Afghanistan.\nThe UK’s daily death toll on Wednesday fell to 48, bringing the grim total to 20,703."}, {"id": "a3a0a3c3-8d8b-4558-9043-7bac5ce98f7c", "title": "Forum mourns death of Gaza hostage Yagev Buchshtab - The Jerusalem Post", "date": "2024-07-22 11:45", "url": "https://www.jpost.com/israel-hamas-war/article-811366", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF announced Monday the death of 35-year-old Yagev Buchshtab in Hamas captivity.\nBuchshtab was taken from Nirim, a Kibbutz in the Gaza border communities, along with his wife Rimon Kirsht Buchshtab.\n'A devoted husband and best friend'Buchshtab was a \"devoted husband, dog-lover, and best friend,\" the Hostage Families Forum said.\nYagev and Rimon built their home on the Kibbutz \"with love, filling it with flowers, plants, and music.\nShe also touched on the death of hostages who had been held with her brother, saying, \"It is all of our tragedy.", "location": "Nirim, a Kibbutz in the Gaza border communities", "classification": "security", "score": 0.5102315364632303, "event_breakdown": "Target Event:\nIDF Soldier Dies in Hamas Captivity"}, {"id": "e40893fb-3603-4fd7-af27-158b31212171", "title": "Carson City Nevada News - Carson Now | Your one stop for Carson City news", "date": "2024-07-22 00:45", "url": "https://www.carsonnow.org/?page=8&search_theme_form=taylor%20fassett&op=search&form_build_id=form-kiwl8w6yqp7a7g9k3iicecdqujolayfev15v4489y_s&form_id=search_theme_form", "domain": "carsonnow.org", "domain_classification": "Unknown", "message": "Every year throughout our region, pets are found dead in cars due to heat exhaustion, including those with windows cracked.\nWith outside temperatures often in the 90s and above, internal car temperatures can reach anywhere from 114 degrees after 10 minutes, to 140 degrees after an hour.\nCracking a window often does nothing at all as rolling down the windows has been shown to have little effect on the temperature inside a car, according to the Humane Society of the U.S.", "location": "ODESSA", "classification": "security", "score": 0.8949121336044727, "event_breakdown": "Event 1: Every year throughout our region, pets are found dead in cars due to heat exhaustion, including those with windows cracked.\nEvent 2: With outside temperatures often in the 90s and above, internal car temperatures can reach anywhere from 114 degrees after 10 minutes, to 140 degrees after an hour.\nEvent 3: Cracking a window often does nothing at all as rolling down the windows has been shown to have little effect on the temperature inside a car, according to the Humane Society of the U.S."}, {"id": "da773054-0149-46cd-86ce-8498350bc1ae", "title": "Top Vatican cardinal tells Ukrainians to  never lose faith  ", "date": "2024-07-22 08:00", "url": "https://cruxnow.com/church-in-europe/2024/07/top-vatican-cardinal-tells-ukrainians-to-never-lose-faith", "domain": "cruxnow.com", "domain_classification": "Unknown", "message": "For the past two years, since Russia’s Feb. 24, 2022, invasion of Ukraine, pilgrims have especially been praying for peace.\nThe sanctuary received the status of a national shrine after approval from the bishops’ conference on Oct. 27, 2011.\nParolin was accompanied to the July 21 Mass by Archbishop Visvaldas Kulbokas, the Vatican’s nuncio to Ukraine.\nImprisoned and in chains, Tyszkiewicz promised to do a good work for God and for the Virgin Mary if he was freed.\nOn Saturday, a day prior to Mass, Parolin made a visit to Odessa, one of the heaviest-hit cities in Ukraine, where he prayed for victims and for a just and lasting peace.", "location": "KYIV", "classification": "security", "score": 0.4512098652256189, "event_breakdown": "1. Vatican officials prayed in St. John Paul II's parish for victims and prayers for in Lodz, a city that has not been spared the horrors of the conflict. They prayed for people of all ages, nations, and social classes, as well as for men, women, and children.\n2. For the past two years, since Russia’s Feb. 24, 2022, invasion of Ukraine, pilgrims have been especially praying for peace.\n3. Archbishop Visvaldas Kulbokas, the Vatican’s nuncio to Ukraine, was accompanied by Archbishop Visvaldas Kulbokas to the July 21 Mass.\n4. Parolin made a visit to Odessa, one of the heaviest-hit cities in Ukraine, a day prior to his Mass, to pray for victims and for a lasting peace."}, {"id": "a2ce2133-0499-49e8-87fc-9fcd45a23bca", "title": "Israel orders evacuation of Gaza humanitarian zone as war toll passes 39 , 000 Palestinians", "date": "2024-07-22 18:45", "url": "https://www.centralmaine.com/2024/07/22/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone-as-wars-toll-passes-39000-palestinians/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "AdvertisementGaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nThe Israeli military said it was continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.\nThe Israeli military said the man drove to the entrance of an Israeli town close to the border, left his vehicle and approached security forces with a knife.\nThe Israeli military did not immediately comment.", "location": "GAZA", "classification": "security", "score": 0.9863219058189209, "event_breakdown": "Gaza's Health Ministry said the toll from Israel's nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nThe Israeli military did not immediately comment."}, {"id": "45d58123-8ca5-4b3d-be64-d0995123c55c", "title": "Israel orders evacuation of part of Gaza humanitarian zone as war toll passes 39 , 000 Palestinians", "date": "2024-07-22 14:45", "url": "http://lasvegassun.com/news/2024/jul/22/israel-orders-evacuation-of-part-of-gaza-humanitar/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Israel orders evacuation of part of Gaza humanitarian zone as war’s toll passes 39,000 PalestiniansDEIR AL-BALAH, Gaza Strip — The Israeli military ordered the evacuation Monday of part of a crowded area in the Gaza Strip it had designated a humanitarian zone, saying it is planning an operation against Hamas militants there.\nThe area includes the eastern part of the Muwasi humanitarian zone in the southern Gaza Strip.\nEarlier this month, Israel estimated at least 1.8 million Palestinians are now in the humanitarian zone it declared, covering about 14 kilometers (8.6 miles) along the Mediterranean.\nGaza's Health Ministry said the toll from Israel's nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.", "location": "GAZA", "classification": "security", "score": 0.9639990289041069, "event_breakdown": "Israel orders evacuation of part of Gaza humanitarian zone as war's toll passes 39,000 Palestinians"}, {"id": "e775a39c-1859-429b-a64d-fa67204760db", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 11:30", "url": "https://www.clickorlando.com/news/world/2024/07/22/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The area includes the eastern part of the Muwasi humanitarian zone in southern Gaza.\nThe Israeli military ordered the evacuation earlier Monday of part of the eastern area that had been designated a humanitarian zone, saying it was planning an operation against Hamas militants there.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.\nDeaths of two Israeli hostages announcedTEL AVIV, Israel — The Israeli military announced on Monday the deaths of two Israeli hostages being held in Gaza.\nThe Israeli military did not have immediate comment.", "location": "GAZA", "classification": "security", "score": 0.9442711428418978, "event_breakdown": "Event 1: Israel strikes Gaza after rockets launched\nEvent 2: Israeli military orders evacuation of part of eastern humanitarian zone in Gaza\nEvent 3: Israeli hostages in Gaza found dead"}, {"id": "6e330584-5311-4e4f-978c-9138ae0dc7a5", "title": "Israel orders evacuation of part of Gaza humanitarian zone", "date": "2024-07-22 15:15", "url": "https://www.pennlive.com/nation-world/2024/07/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military on Monday ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone.\nThe area includes the eastern part of the Muwasi humanitarian zone, which is located in the southern Gaza Strip.\nThe Israeli military said on Monday that it is continuing to operate in central and southern Gaza.\nThe United Nations also accused Israel of targeting a U.N. humanitarian convoy in central Gaza.\nIsrael has experienced a wave of stabbing attacks across the country during the nine-month war in Gaza.", "location": "GAZA STRIP", "classification": "security", "score": 0.9705941368263493, "event_breakdown": "Event 1: The Israeli military on Monday ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone.\nEvent 2: The United Nations also accused Israel of targeting a U.N. humanitarian convoy in central Gaza."}, {"id": "367d30d3-e73a-4522-91c7-e96651e1bca9", "title": "Canadian is shot and killed by IDF after trying to stab Israelis as he screamed  youre murdering people in Gaza  in town that was attacked during Oct 7 terrorist attack by Hamas", "date": "2024-07-22 16:45", "url": "https://www.dailymail.co.uk/news/article-13659571/Canadian-shot-killed-IDF-stab-Israelis-Gaza-town-Oct-7-terrorist-attack-Hamas.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "IDF has increased security in Netiv HaAsara after Hamas gunmen passed over the concrete border wall using paragliders and killed 20 residents during its October 7 attack.\nNo injuries to the security forces were reported,' the IDF added.\nAdam allegedly drove to the entrance of Netiv HaAsara, a town near the Gaza border, approached security forces and threatened them with a knife.\nThe Israeli military on Monday ordered the evacuation of part of a crowded area in the Gaza Strip that it had designated a humanitarian zone.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.", "location": "Netiv HaAsara", "classification": "security", "score": 0.9849284405860992, "event_breakdown": "IDF has increased security in Netiv HaAsara after Hamas gunmen passed over the concrete border wall using paragliders and killed 20 residents during its October 7 attack.\nNo injuries to the security forces were reported,' the IDF added.\nAdam allegedly drove to the entrance of Netiv HaAsara, a town near the Gaza border, approached security forces and threatened them with a knife.\nThe Israeli military on Monday ordered the evacuation of part of a crowded area in the Gaza Strip that it had designated a humanitarian zone.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military."}, {"id": "27dc8049-e43b-4762-835e-d88bb3da8057", "title": "Russian shelling injures 5 in Nikopol , Dnipropetrovsk Oblast", "date": "2024-07-22 15:00", "url": "https://www.yahoo.com/news/russian-shelling-injures-5-nikopol-135333615.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At least five people were injured after Russian forces shelled the city of Nikopol, Dnipropetrovsk Oblast, Governor Serhii Lysak reported on July 22.\nNikopol, just across from Russian-occupied Enerhodar and the Zaporizhzhia Nuclear Power Plant, is a regular target of Russian attacks.\nFive people, including a ten-year-old boy, were injured in a Russian attack on the city on July 7.\nOn July 2, four people were killed, including two elderly women, and 10 others were injured in another Russian strike on Nikopol.\nRead also: Death toll from Russian missile attack on Mykolaiv rises to 4We’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "NIKOPOL", "classification": "security", "score": 0.9380490212818455, "event_breakdown": "At least five people were injured after Russian forces shelled the city of Nikopol, Dnipropetrovsk Oblast, Governor Serhii Lysak reported on July 22. Nikopol, just across from Russian-occupied Enerhodar and the Zaporizhzhia Nuclear Power Plant, is a regular target of Russian attacks. Five people, including a ten-year-old boy, were injured in a Russian attack on the city on July 7. On July 2, four people were killed, including two elderly women, and 10 others were injured in another Russian strike on Nikopol. At least five people were injured after Russian forces shelled the city of Nikopol, Dnipropetrovsk Oblast, Governor Serhii Lysak reported on July 22. Nikopol, just across from Russian-occupied Enerhodar and the Zaporizhzhia Nuclear Power Plant, is a regular target of Russian attacks. Five people, including a ten-year-old boy, were injured in a Russian attack on the city on July 7. On July 2, four people were killed, including two elderly women, and 10 others were injured in another Russian strike on Nikopol. At least five people were injured after Russian forces shelled the city of Nikopol, Dnipropetrovsk Oblast, Governor Serhii Lysak reported on July 22. Nikopol, just across from Russian-occupied Enerhodar and the Zaporizhzhia Nuclear Power Plant, is a regular target of Russian"}, {"id": "c1b9c26b-6997-4313-a0eb-77c787dd0987", "title": "Conspiracy theorist  perfectly entitled  to believe Manchester Arena attack was  elaborate hoax , lawyer says", "date": "2024-07-22 14:45", "url": "https://news.sky.com/story/conspiracy-theorist-perfectly-entitled-to-believe-manchester-arena-attack-was-elaborate-hoax-lawyer-says-13183192", "domain": "news.sky.com", "domain_classification": "International", "message": "A conspiracy theorist being sued by two survivors of the Manchester Arena bombing is \"perfectly entitled\" to believe the deadly attack was an \"elaborate hoax\", his lawyer has told a court.\nMr Hibbert was paralysed from the waist down, while his daughter suffered a severe brain injury in the attack, which killed 22 people.\nHe saw others lying dead or injured around him,\" Mr Price said.\n\"Mr Hall says her parents are invoking their daughter's catastrophic disability as part of a huge fraud on the general public,\" he added.\nMr Price said the Hibberts were entitled to damages and an injunction to stop Mr Hall repeating his claims about the attack.", "location": "The Manchester Arena bombing.", "classification": "security", "score": 0.5131571845284398, "event_breakdown": "Target Event: ISIS Claims Responsibility for Attack on Sikh Temple in Kabul\nISIS claimed responsibility Saturday for an attack on a Sikh temple in the Afghan capital that killed 25 Sikhs, another blow to the tiny religious minority which has already suffered years of deadly violence. The attack is the latest assault on Afghanistan's beleaguered minorities, who fear growing violence\nIn the aftermath of the suicide bombing that killed 25 Sikhs on March 25, the complex was attacked again. This time, gunmen killed 25 more Hindus, Sikhs, and Jains when it reopened on April 4. The 70 victims of the complex attack are the most recent casualties of the rise of Hindu Nationalism in India."}, {"id": "b5fbe494-8bbe-43a9-b28f-3852c59254e1", "title": "Israel orders evacuation of part of Gaza humanitarian zone as war toll passes 39 , 000 Palestinians", "date": "2024-07-22 15:45", "url": "https://www.nsnews.com/world-news/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone-as-wars-toll-passes-39000-palestinians-9249860", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "The Israeli military said it is planning an operation against Hamas militants who have embedded themselves in the humanitarian zone and used it to launch rockets toward Israel.\nGaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nThe Israeli military said it was continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.\nThe Israeli military did not immediately comment.", "location": "Gaza", "classification": "security", "score": 0.9675418594780032, "event_breakdown": "Israel planning new military operation in Gaza\n\nIsraeli military officials said they are planning a new operation in the Gaza Strip to wipe out Hamas' military and governing capabilities. Prime Minister Netanyahu vowed to secure the return of the remaining hostages. The Israeli military did not immediately comment."}, {"id": "bb360f92-9fa4-4926-b669-2aa4e0cfa378", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 11:00", "url": "https://www.yumasun.com/news/national_news/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/article_3fe32979-3f60-5950-911e-753b6d50a11d.html", "domain": "yumasun.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Israeli military orders evacuation of part of humanitarian zone in GazaThe Israeli military has ordered the evacuation of part of a crowded area in the southern Gaza Strip it had designated a humanitarian zone", "location": "GAZA", "classification": "security", "score": 0.9773180099968056, "event_breakdown": "Israel-Hamas war latest: Israeli military orders evacuation of part of humanitarian zone in Gaza\nIsraeli military orders evacuation of part of crowded area in the southern Gaza Strip it had designated a humanitarian zone"}, {"id": "05e84f2f-e62c-4c77-a0d4-fea2bd5b00ac", "title": "Gaza Health Ministry says more than 39 , 000 Palestinians have now been killed in the war", "date": "2024-07-22 13:15", "url": "https://www.fitzhugh.ca/world-news/gazas-health-ministry-says-more-than-39000-palestinians-have-now-been-killed-in-the-war-9249858", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "The Israeli military said it is planning an operation against Hamas militants who have embedded themselves in the humanitarian zone and used it to launch rockets toward Israel.\nGaza’s Health Ministry said the toll from Israel’s nine-month war against Hamas in Gaza has surpassed 39,000 Palestinians killed and 89,800 wounded.\nThe Israeli military said it was continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.\nThe Israeli military did not immediately comment.", "location": "The Gaza Strip, near Israel", "classification": "security", "score": 0.9675418594780032, "event_breakdown": "Target Event:\nIsraeli military says will continue operations in Gaza\nOngoing events of security place on a map:\nOngoing security event: Israeli military says will continue operations in Gaza\n[Map coordinates for Gaza Strip]"}, {"id": "bfbc9b77-2456-4dc7-ad49-2d680e4720e9", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 11:45", "url": "https://www.recorderonline.com/news/national_news/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza/article_f8ceef81-fb3f-52ae-81d1-1f5c36f977bc.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "The Israeli military has ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone", "location": "Gaza Strip", "classification": "security", "score": 0.9873758852562706, "event_breakdown": "New START treaty\nIsraeli air strikes on Gaza\nRussian invasion of Ukraine"}, {"id": "889c7e96-d5f2-42ff-94d5-924ca016f4a5", "title": "Israeli forces foil Hamas kidnapping plot near Jericho", "date": "2024-07-22 15:00", "url": "https://www.ynetnews.com/article/r1wmy1nd0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Pit designed to hide potential hostages discovered by Israeli forces ( Video: Shin Bet )Israeli security forces on Monday thwarted a kidnapping plot by a Hamas terror cell from the Aqabat Jaber refugee camp near Jericho in the West Bank.\nPalestinian security forces detained another cell member.\nThey also intended to carry out shooting and bombing attacks against Israeli forces.\n\"The cell members planned to carry out a significant attack,\" according to the Shin Bet statement.\nThe students were affiliated with the Hamas cell at the institution, known as Kutla Islamiya.", "location": "Jericho, West Bank", "classification": "security", "score": 0.9800969967635832, "event_breakdown": "-Pit designed to hide potential hostages discovered by Israeli forces in Aqabat Jaber refugee camp near Jericho in the West Bank\n-Hamas terror cell members planned to carry out a significant attack"}, {"id": "532da534-9bcd-47a6-87c4-2551a5a4940d", "title": "Watch live : Secret Service Director Kimberly Cheatle testifying about Trump shooting", "date": "2024-07-22 17:30", "url": "https://www.fox4news.com/news/watch-live-secret-service-kimberly-cheatle-testify-trump-shooting-july-22-2024", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "United Sates Secret Service Director Kimberly Cheatle testifies before the House Oversight and Accountability Committee during a hearing in the Rayburn House Office Building on July 22, 2024 in Washington, DC.\nWhen asked who bears the most responsibility, she said ultimately it is the Secret Service that protects the former president.\nCheatle acknowledged that Secret Service were told about a suspicious person \"somewhere between two and five times\" before the shooting.\nFILE - United States Secret Service Director Kimberly Cheatle looks on during a press conference at the Secret Service's Chicago Field Office on June 4, 2024, in Chicago, Illinois, ahead of the 2024 Democratic and Republican National Conventions.\nHow to watch Secret Service Director Kimberly Cheatle's testimonyThe hearing before the House Committee on Oversight and Accountability is scheduled to begin at 10 a.m.", "location": "Washington, DC", "classification": "security", "score": 0.5167121557618056, "event_breakdown": "United States Secret Service Director Kimberly Cheatle will testify before the House Committee on Oversight and Accountability on July 22, 2024, regarding the Secret Service's role in protecting the former president. The hearing will begin at 10 a.m. and Cheatle will be asked about the suspicious person encountered before the shooting."}, {"id": "4b0ac186-6e50-4c87-9dae-83eda949471d", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza", "date": "2024-07-22 09:30", "url": "https://www.yahoo.com/news/israel-hamas-war-latest-israeli-090519812.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The area includes the eastern part of the Muwasi humanitarian zone in southern Gaza.\nThe Israeli military ordered the evacuation earlier Monday of part of the eastern area that had been designated a humanitarian zone, saying it was planning an operation against Hamas militants there.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.\nDeaths of two Israeli hostages announcedTEL AVIV, Israel — The Israeli military announced on Monday the deaths of two Israeli hostages being held in Gaza.\nThe Israeli military did not have immediate comment.", "location": "GAZA", "classification": "security", "score": 0.9442711428418978, "event_breakdown": "Israeli military strikes targets in Gaza\nDeaths of two Israeli hostages announced"}, {"id": "d07303f9-dcae-4b88-b9b8-a514c9c380fb", "title": "Israel extends closure of Al Jazeera bureau for 45 additional days in third such decision", "date": "2024-07-22 15:00", "url": "https://dohanews.co/israel-extends-closure-of-al-jazeera-bureau-for-45-additional-days-in-third-such-decision/", "domain": "dohanews.co", "domain_classification": "Unknown", "message": "The Israeli government has extended the closure of Al Jazeera’s bureau in Jerusalem and banned its broadcast in Israel for 45 additional days for the third time since the initial decision was implemented in May.\nThe law, which specifically targets Al Jazeera, enables the Israeli government to shut down foreign media networks for 45 days and renew the ban for an additional period of 45 days.\nAl Jazeera had condemned the Israeli decision and described it as “a criminal act” that violates the access to information.\nThe world first witnessed this on October 25, 2023, when Israel killed four members of prominent Al Jazeera journalist and Gaza bureau chief Wael Dahdouh’s family.\nIn May 2022, Israel killed prominent Al Jazeera journalist Shireen Abu Akleh as she was covering an Israeli raid in Jenin.", "location": "JERUSALEM", "classification": "security", "score": 0.90023554696229, "event_breakdown": "The Israeli government has shut down Al Jazeera’s bureau in Jerusalem and banned its broadcast in Israel for 45 additional days on November 14, 2023. The law specifically targets Al Jazeera, enabling the Israeli government to shut down foreign media networks for 45 days and renew the ban for an additional period of 45 days. Al Jazeera had condemned the Israeli decision and described it as “a criminal act” that violates the access to information. The world first witnessed this on October 25, 2023, when Israel killed four members of prominent Al Jazeera journalist and Gaza bureau chief Wael Dahdouh’s family. In May 2022, Israel killed prominent Al Jazeera journalist Shireen Abu Akleh as she was covering an Israeli raid in Jenin."}, {"id": "efede939-6420-4854-bdbd-dc219526a453", "title": "Watch live : Secret Service Director Kimberly Cheatle testifying about Trump shooting", "date": "2024-07-22 19:30", "url": "https://www.foxla.com/news/watch-live-secret-service-kimberly-cheatle-testify-trump-shooting-july-22-2024", "domain": "foxla.com", "domain_classification": "Unknown", "message": "United Sates Secret Service Director Kimberly Cheatle testifies before the House Oversight and Accountability Committee during a hearing in the Rayburn House Office Building on July 22, 2024 in Washington, DC.\nWhen asked who bears the most responsibility, she said ultimately it is the Secret Service that protects the former president.\nCheatle acknowledged that Secret Service were told about a suspicious person \"somewhere between two and five times\" before the shooting.\nFILE - United States Secret Service Director Kimberly Cheatle looks on during a press conference at the Secret Service's Chicago Field Office on June 4, 2024, in Chicago, Illinois, ahead of the 2024 Democratic and Republican National Conventions.\nHow to watch Secret Service Director Kimberly Cheatle's testimonyThe hearing before the House Committee on Oversight and Accountability is scheduled to begin at 10 a.m.", "location": "Washington, D.C.", "classification": "security", "score": 0.5167121557618056, "event_breakdown": "Secret Service Director Kimberly Cheatle will testify before the House Committee on Oversight and Accountability on July 22, 2024, regarding the shooting of a former president's son."}, {"id": "c5147074-1eca-43fb-bb61-5fd5d2aa0207", "title": "Fire extinguished at Russia Tuapse oil refinery after Ukraine drone strike", "date": "2024-07-22 17:45", "url": "https://www.offshore-technology.com/news/fire-extinguished-at-russias-tuapse-oil-refinery-after-ukraine-drone-strike/", "domain": "offshore-technology.com", "domain_classification": "Unknown", "message": "A fire caused by a Ukrainian drone strike on Russia’s Black Sea Tuapse oil refinery has been put out, local officials said on Monday.\nLocal media reports said that Russia’s local air defence systems had destroyed 75 drones launched by Ukraine over the weekend.\nIn March, Offshore Technology reported that the country plans to defend its oil and gas facilities with missile systems.\nSince the beginning of this year, Ukraine has been attacking Russian oil refineries to stop the country’s army from advancing and to weaken its military.\nIn late June, Offshore Technology reported that Russia’s oil and gas revenues for that month were set to increase by more than 50% year-on-year, reaching $9.4bn (Rbs821.74bn), according to official figures.", "location": "TUapse oil refinery", "classification": "security", "score": 0.4167841648588388, "event_breakdown": "Title: Fire At Black Sea Refinery Extinguished After Drone Strike\nDescription: A fire broke out at the Tuapse oil refinery in the Black Sea after a drone strike by Ukraine on Monday, this according to Russian officials who said the fire was extinguished. A Ukrainian official shared footage of a drone strike on the same refinery in March, the content of which includes a  caption that translates to \"Burns well\"."}, {"id": "a85b25d8-3212-46e5-911f-08e9962cf5f3", "title": "Netanyahu heads for Washington as Israel orders new Gaza evacuations", "date": "2024-07-22 10:30", "url": "https://www.al-monitor.com/originals/2024/07/netanyahu-heads-washington-israel-orders-new-gaza-evacuations", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "The latest incident comes nine days after the health ministry said 92 people were killed in a strike on Al-Mawasi, when Israel said it was targeting Hamas's commander.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 44 the Israeli military says are dead.\nIsrael's retaliatory military campaign in Gaza has killed more than 39,000 people, also mostly civilians, according to data from the health ministry in Hamas-run Gaza.\nYussef Abu Taimah from Al-Qarara in Khan Yunis said his family went to the humanitarian zone but found no space.\nThe visit comes with the Gaza war again fuelling regional violence.", "location": "GAZA", "classification": "security", "score": 0.7972053169312937, "event_breakdown": "Israeli retaliatory campaign in Gaza\nHostage situation in Gaza\nCategory: security"}, {"id": "52d9c83a-ff53-4457-a22e-87beb3cb0325", "title": "2 Lebanese soldiers injured in Israeli strike on watchtower - Xinhua", "date": "2024-07-22 00:30", "url": "https://english.news.cn/20240722/699f55d221a347ebbd88853fc59e1d3b/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 21 (Xinhua) -- Two Lebanese soldiers were injured on Sunday in an Israeli attack targeting a watchtower in the southwestern border region, according to the Lebanese military.\nThe Lebanese Army Command reported that the Israeli strike hit the army watchtower located outside the village of Alma al-Shaab.\nMeanwhile, military sources told Xinhua anonymously that an Israeli Merkava tank fired a shell directly at the watchtower.\nThe Lebanese Army Command has requested the United Nations Interim Force in Lebanon (UNIFIL) to conduct a field investigation into the incident.\nThe Lebanese militant group also reported attacks on the Israeli Northern Corps command headquarters at Ein Zeitim base and on soldiers in Hanita, an Israeli kibbutz, with Katyusha rockets, resulting in casualties.", "location": "BEIRUT", "classification": "security", "score": 0.9964333795289035, "event_breakdown": "Security event 1: Two Lebanese soldiers were injured on Sunday in an Israeli attack targeting a watchtower in the southwestern border region of Alma Al-Shaab.\nSecurity event 2: The Lebanese militant group Saraya claimed responsibility for an attack on the Israeli Northern Corps headquarters at Ein Zeitim base and on Israeli soldiers in the Hanita kibbutz with Katyusha rockets. The attacks resulted in casualties."}, {"id": "3034d9a9-2689-4924-ac52-7644ecb9bfc5", "title": "Watch live : Secret Service Director Kimberly Cheatle testifying about Trump shooting", "date": "2024-07-22 15:15", "url": "https://www.fox2detroit.com/news/watch-live-secret-service-kimberly-cheatle-testify-trump-shooting-july-22-2024", "domain": "fox2detroit.com", "domain_classification": "Unknown", "message": "United Sates Secret Service Director Kimberly Cheatle testifies before the House Oversight and Accountability Committee during a hearing in the Rayburn House Office Building on July 22, 2024 in Washington, DC.\nWhen asked who bears the most responsibility, she said ultimately it is the Secret Service that protects the former president.\nCheatle acknowledged that Secret Service were told about a suspicious person \"somewhere between two and five times\" before the shooting.\nFILE - United States Secret Service Director Kimberly Cheatle looks on during a press conference at the Secret Service's Chicago Field Office on June 4, 2024, in Chicago, Illinois, ahead of the 2024 Democratic and Republican National Conventions.\nHow to watch Secret Service Director Kimberly Cheatle's testimonyThe hearing before the House Committee on Oversight and Accountability is scheduled to begin at 10 a.m.", "location": "Washington, DC", "classification": "security", "score": 0.5167121557618056, "event_breakdown": "Secret Service Director Kimberly Cheatle will testify before the House Committee on Oversight and Accountability on July 22, 2024, at 10 a.m."}, {"id": "f801a583-f09b-4c48-8847-9beb0e1cb63a", "title": "Yemeni drone strike on Tel Aviv to change equations in the region : Defense expert", "date": "2024-07-22 14:45", "url": "http://www.presstv.ir/Detail/2024/07/22/729842/yemen-drone-strike-telaviv-change-equations-region-defense-expert", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "By Alireza KamandiThe recent drone attack on Tel Aviv was the result of careful planning and execution by the Yemeni military, says a defense analyst, noting it will change equations in the region.\nYemeni armed forces carried out an unprecedented drone operation against Israel on Friday, hitting an area near a US consular facility in Tel Aviv.\nThe unmanned aerial vehicle bypassed the regime’s interceptor structure exposing the failure of its much-hyped air defense systems.\n“The reason for the attack is simple: British aircraft from Cyprus are involved in attacks on Yemen so the retaliatory attack is justified.”He hastened to add that the Yemeni drone operation would change the equations in the region.\n“Drone operations from Lebanon and Yemen are another variable in the equation and these variables are a very serious one.", "location": "Tel Aviv", "classification": "security", "score": 0.9188468246684816, "event_breakdown": "Drone attack on Tel Aviv carried out by Yemeni military exposes Israel’s air defense system failure."}, {"id": "17ed51a4-f096-4936-8a24-11c73c5052ae", "title": "Israel - Hamas war latest : Israeli military orders evacuation of part of humanitarian zone in Gaza – Winnipeg Free Press", "date": "2024-07-22 09:30", "url": "https://www.winnipegfreepress.com/world/2024/07/22/israel-hamas-war-latest-israeli-military-orders-evacuation-of-part-of-humanitarian-zone-in-gaza", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "FILE - A Palestinian man displaced by the Israeli bombardment of the Gaza Strip, walks at a makeshift tent camp in Khan Younis, southern Gaza Strip, July 4, 2024.\nThe strikes took place as hundreds of people were evacuating following a new order from the Israeli military.\nDeaths of two Israeli hostages announcedTEL AVIV, Israel — The Israeli military announced on Monday the deaths of two Israeli hostages being held in Gaza.\nFILE - Hassan Nofal, right, who was displaced by the Israeli bombardment of the Gaza Strip, prepares lunch with his family at a makeshift tent camp in Khan Younis, southern Gaza Strip, July 4, 2024.\nThe Israeli military ordered Monday, July 22, the evacuation of part of the area of the Gaza Strip, which they had designated a humanitarian zone.", "location": "Gaza", "classification": "security", "score": 0.970584140074571, "event_breakdown": "Deaths of two Israeli hostages announced in Israel, Monday, July 22, 2024\nThe Israeli military announced the deaths of two Israeli hostages, which were being held in Gaza. The announcement came hours after the Israeli military ordered the evacuation of part of the area of the Gaza Strip, which they had designated a humanitarian zone. Hundreds of people were evacuating the area when the new order came, according to the news release. The names of those holding the Israeli hostages were not immediately released.\n\nFILE - Hassan Nofal, who was displaced by the Israeli bombardment of the Gaza Strip, cooks bread at a makeshift tent camp in Khan Younis, southern Gaza Strip, July 4, 2024.\n\nThe Israeli military's new order forced about 600 Palestinians to abandon their homes, according to Jamila Al-Shanti, a spokeswoman for the United Nations agency for Palestinian refugees, UNRWA. Many of those who were displaced had been seeking shelter in the area since Israel's war on Hamas earlier this month.\n\n- Gaza, Gaza Strip"}, {"id": "cc4e9606-bfeb-4d47-aa47-d58fce697f8a", "title": "Terror attack occurs near Netiv Haasara - Israel News", "date": "2024-07-22 11:45", "url": "https://www.jpost.com/breaking-news/article-811362", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A man wielding a knife attempted to stab people at the entrance of Kibbutz Netiv HaAsara in the Gaza border area on Monday.\nHe was shot by the kibbutz’s security forces, IDF and police said.\nIsraeli security forces at the scene of an attempted stabbing attack at the entrance to Netiv HaAsara, near the Gaza Strip, July 22, 2024 (credit: FLASH90)MDA paramedics Noa Abitbul and Yossi Smadga recounted what they saw upon arrival.\n“We were told that a terrorist had arrived at the location, attempted to stab, and was thwarted by security forces.\nAccording to the military, the individual arrived in the area from within Israel – as opposed to having crossed over from Gaza.", "location": "Netiv HaAsara", "classification": "security", "score": 0.9938759912478655, "event_breakdown": "Israeli security forces shot a Palestinian man as he tried to carry out a stabbing attack at the entrance of Kibbutz Netiv HaAsara in the Gaza border area on Monday."}, {"id": "409e0ec7-0d46-45b5-a83d-255811d76e3c", "title": "Yemen Houthis vow major retaliation for Israeli port strike", "date": "2024-07-22 09:30", "url": "https://article.wn.com/view/2024/07/22/Yemens_Houthis_vow_major_retaliation_for_Israeli_port_strike_2/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Yemen's Houthi rebels have promised a \"huge\" retaliation against Israel for a deadly strike on the port of Hodeida, as regional fallout widens from months of war in Gaza.\nThe Israeli strike, the first claimed by Israel in Yemen, set oil tanks ablaze at the vital port and came a day after the first fatal attack by the... read full story\"aggravates the current tension in the region and halts the ongoing efforts to end the war in Gaza\"", "location": "Hodeida, Yemen", "classification": "security", "score": 0.896785299572322, "event_breakdown": "Yemen's Houthi rebels have promised a \"huge\" retaliation against Israel for a deadly strike on the port of Hodeida."}, {"id": "66e921cf-da42-43cd-ad4d-9be1611d41ac", "title": "Israel orders evacuation of part of Gaza humanitarian zone", "date": "2024-07-22 11:30", "url": "https://www.theweek.in/wire-updates/international/2024/07/22/fgn41-israel-2ndld-gaza.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Deir al-Balah, Jul 22 (AP) The Israeli military on Monday ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone.\nThe area includes the eastern part of the Muwasi humanitarian zone, which is located in the southern Gaza Strip.\nIsrael has experienced a wave of stabbing attacks across the country during the nine-month war in Gaza.\nThe Israeli military said on Monday that it is continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas' military and governing capabilities and secure the return of the remaining hostages.", "location": "GAZA STRIP", "classification": "security", "score": 0.963031691079991, "event_breakdown": "Location: Gaza Strip\nTarget Event: Israel continues its operation in central and southern Gaza\nAdditional Text:\nThe Israeli military on Monday ordered the evacuation of part of an area in the Gaza Strip\nthat it has designated a humanitarian zone."}, {"id": "f80b2ae1-7bb9-4cee-acf0-3d5ee967d3ce", "title": "1 person dies in Mineral County officer - involved shooting", "date": "2024-07-22 16:45", "url": "https://www.kxlf.com/news/crime-and-courts/1-person-dies-in-mineral-county-officer-involved-shooting", "domain": "kxlf.com", "domain_classification": "Unknown", "message": "FISH CREEK — One person died in an officer-involved shooting on Sunday morning in Mineral County.\nThe Mineral County Sheriff's Office reports the shooting happened at approximately 11 a.m. in the Fish Creek area.\nThe Montana Department of Criminal Investigations (DCI), Missoula County Sheriff's Office detectives, and a Missoula Police Department detective were called to process the scene.\nDCI will submit reports to the Mineral County Attorney's Office once the investigation is complete.\nMineral County Sheriff Ryan Funke tells MTN that two officers are paid administrative leave pending an evaluation.", "location": "FISH CREEK", "classification": "security", "score": 0.8133491947648909, "event_breakdown": "Security Event 1: On Sunday, May 22, 2022, one person died in an officer-involved shooting in Fish Creek, Montana, in the Fish Creek area. The shooting happened around 11 a.m., and the Montana Department of Criminal Investigations (DCI) was then summoned to process the scene."}, {"id": "3a764fa2-6fcb-49e0-b47f-175a01818f3a", "title": "Ukrainian Civilians Wounded in Russian Drone and Shelling Attacks as Russia Claims gains in the East", "date": "2024-07-22 08:00", "url": "https://www.newsmax.com/world/globaltalk/russia-ukraine-war-drones/2024/07/21/id/1173406/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine (AP) — Russian strikes wounded at least five people in Ukraine on Sunday, local officials said, as the two countries exchanged drone, missile and shelling attacks.\nThree people were wounded by Russian drone strikes in southern Ukraine’s partly occupied Kherson region, local officials said Sunday morning.\nIn addition, Russia launched three ballistic missiles and two guided air missiles, which did not reach their targets, he said.\nRussian air defense systems overnight destroyed eight drones over the country’s Belgorod region and over the Black Sea, the Russian Ministry of Defense said.\nNine people were wounded over the previous day in shelling in the town of Shebekino in Russia’s Belgorod region, bordering Ukraine, Gov.", "location": "Ukraine", "classification": "security", "score": 0.7208589959506352, "event_breakdown": "KYIV, Ukraine (AP) — Russian strikes wounded at least five people in Ukraine on Sunday, local officials said, as the two countries exchanged drone, missile and shelling attacks.\nThree people were wounded by Russian drone strikes in southern Ukraine’s partly occupied Kherson region, local officials said Sunday morning. In addition, Russia launched three ballistic missiles and two guided air missiles, which did not reach their targets, he said.\nNine people were wounded over the previous day in shelling in the town of Shebekino in Russia’s Belgorod region, bordering Ukraine, Gov. Vyacheslav Gladkov said Sunday."}, {"id": "5c26666e-5f6a-4d00-b936-4873ea061874", "title": "Pakistani police officer killed in Peshawar attack amid rising violence", "date": "2024-07-22 08:30", "url": "https://www.khaama.com/pakistani-police-officer-killed-in-peshawar-attack-amid-rising-violence/", "domain": "khaama.com", "domain_classification": "Unknown", "message": "Pakistani media report that a police officer was killed in Peshawar following an attack by armed individuals.\nAccording to Pakistani media, the attack occurred on Sunday, July 21, at the “Armored” checkpoint in central Peshawar.\nPakistani officials have confirmed that the victim was named Saeedullah and was targeted by a sniper.\nPreviously, following an increase in attacks and insecurity in various regions of Pakistan, including Khyber Pakhtunkhwa, Balochistan, and Peshawar, two soldiers were killed in a roadside mine explosion in North Waziristan.\nAccording to reports, four protesters were killed, and 21 others were injured when the protests turned violent.", "location": "Peshawar", "classification": "security", "score": 0.9684654428459885, "event_breakdown": "[\n  {\n    \"title\": \"Attack on checkpoint in Peshawar, Pakistan\",\n    \"description\": \"An attack on a checkpoint in Peshawar, Pakistan, has left one police officer dead and three others wounded, officials say.\",\n    \"location\": \"Peshawar, Pakistan\",\n    \"date\": \"2022-07-24T08:30:00Z\"\n  }\n]"}, {"id": "5ed5c82d-77a7-471e-b97a-cfeb5b17e72c", "title": "Yemen Houthi - held port of Hodeida still ablaze 2 days after Israeli strike", "date": "2024-07-22 14:45", "url": "https://www.cbsnews.com/news/yemen-houthis-port-hodeida-fire-burns-after-israel-strike/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Heavy flames and black smoke spiraled into the sky for a third consecutive day following the strike on Saturday, said an AFP correspondent in Hodeida.\nRescuers arrive at the scene of giant fire at an oil storage facility in Yemen's Houthi-held port city of Hodeida, following Israeli strikes, July 20, 2024.\nAFP/GettyHigh-resolution satellite images taken by Maxar Technologies showed flames consuming a heavily damaged fuel storage area at the Hodeida harbor.\nAn analysis of satellite imagery by the Dutch peace organization PAX showed at least 33 destroyed oil storage tankers, said Wim Zwijnenburg, a project leader with the group.\nMaxar closeup satellite imagery of the Yemeni port city of Hodeida shows smoke rising from oil storage tanks after Israeli airstrikes, July 20, 2024.", "location": "Hodeida", "classification": "security", "score": 0.8644486657721682, "event_breakdown": "Giant fire at oil storage facility in Yemen's Houthi-held port city of Hodeida following Israeli strikes on July 20, 2024"}, {"id": "678d0a12-8521-44ff-a20d-04dc51a59738", "title": "Israel orders evacuation of part of Gaza humanitarian zone", "date": "2024-07-22 11:00", "url": "https://www.nbcchicago.com/news/national-international/israel-orders-evacuation-of-part-of-gaza-humanitarian-zone/3496832/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Israeli military on Monday ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone.\nThe area includes the eastern part of the Muwasi humanitarian zone, which is located in the southern Gaza Strip.\nIsrael has experienced a wave of stabbing attacks across the country during the nine-month war in Gaza.\nThe Israeli military said on Monday that it is continuing to operate in central and southern Gaza.\nNetanyahu has vowed to wipe out Hamas’ military and governing capabilities and secure the return of the remaining hostages.", "location": "GAZA STRIP", "classification": "security", "score": 0.963031691079991, "event_breakdown": "1. On September 20th, 2021, the Israeli military ordered the evacuation of part of an area in the Gaza Strip it has designated a humanitarian zone.\n2. The eastern part of the Muwasi humanitarian zone, which is located in the southern Gaza Strip, is included in the evacuation.\n3. The recent wave of stabbing attacks during the nine months long war in Gaza is what compelled the Israeli military to take action.\n4. The military operation is ongoing in central and southern Gaza, according to the Israeli military.\n5. The target event is the current Israeli military operation in the Gaza Strip that is taking place in response to the recent wave of stabbing attacks. 6. The event is located in the Muwasi humanitarian zone in the Gaza Strip."}, {"id": "0fb62349-14d2-4b57-ab31-c721e94cbce2", "title": "Houthi harbour still ablaze days after Israel strikes on Yemen", "date": "2024-07-22 11:45", "url": "https://www.al-monitor.com/originals/2024/07/houthi-harbour-still-ablaze-days-after-israel-strikes-yemen", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 22, 2024 — Hodeida (Yemen) (AFP)Firefighting teams on Monday struggled to contain a massive blaze at Yemen's rebel-held Hodeida port, days after a deadly Israeli strike damaged oil storage facilities and endangered aid ships in the harbour.\nFirefighters appeared to have made little progress, with the blaze seemingly expanding in some parts of the port, the correspondent said, amid fears it could reach food storage facilities.\nHigh-resolution satellite images taken by Maxar Technologies showed flames consuming a heavily damaged fuel storage area at the Hodeida harbour.\n- 'Vital lifeline' -Yemeni port authorities said Hodeida \"is operating at its full capacity\", the rebels' Saba news agency reported.\nThe International Rescue Committee charity called the port \"a vital lifeline for delivering humanitarian aid to Yemen.\"", "location": "Hodeida", "classification": "security", "score": 0.5313710053251413, "event_breakdown": "Location: Hodeida (Yemen)\nFirefighting teams on Monday struggled to contain a massive blaze at Yemen's rebel-held Hodeida port, days after a deadly Israeli strike damaged oil storage facilities and endangered aid ships in the harbour."}, {"id": "6d13a70c-6d29-47e7-b150-7780bac9fe3c", "title": "At least five killed in shooting at Croatia nursing home", "date": "2024-07-22 10:30", "url": "https://www.rte.ie/news/world/2024/0722/1461151-croatia-shooting/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "At least six people have been killed in a gun attack at a nursing home in Croatia.\nFIve residents and one employee were dead after the gunman entered the private nursing home in eastern Croatia's Daruvar and went on a killing spree, according to police.\nState broadcaster HRT said an unidentified gunman entered a nursing home in Daruvar - some 130km east of Zagreb - and began shooting.\nPolice said they were informed of the incident at 10.10am local time (9.10am Irish time), and confirmed the suspect had entered the nursing home and used a firearm.\nCroatian newspaper Jutarnji list described the alleged shooter as a \"retired military police officer\" who killed his mother along with other residents and staff.", "location": "Daruvar", "classification": "security", "score": 0.9661039758951073, "event_breakdown": "Map showing the location of the event in eastern Croatia's Daruvar."}, {"id": "67f9bf54-aae6-42b7-9999-35a066dc11b4", "title": "20 - year - old arrested for stabbing in Sydney", "date": "2024-07-22 10:30", "url": "https://www.prokerala.com/news/articles/a1549224.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Sydney, July 22 : Australian police confirmed on Monday that a 20-year-old male suspect has been charged with a stabbing incident over the weekend.\nUpon arrival, officers located a 45-year-old man suffering from stab wounds in his shoulder and back.\nFollowing the incident, a crime scene was established with an investigation also launched into all circumstances of the stabbing.\nHe was refused bail to appear at Fairfield Local Court today,\" said the New South Wales Police Force (NSW).\nSunday's incident was the third alleged stabbing that occurred in Sydney during the recent weekend.", "location": "Fairfield, Australia", "classification": "security", "score": 0.6782430333880978, "event_breakdown": "Sydney stabbing\nPolice have confirmed a 20-year-old male has been charged with a stabbing incident that occurred in Sydney, Australia on July 22.\nUpon arrival, officers located a 45-year-old man who was stabbed in his shoulder and back.\nA crime scene was set up and an investigation was launched into the circumstances of the stabbing."}, {"id": "defd11fd-9e3e-40f7-97d8-2dd15164d4c5", "title": "Woman charged in connection with stabbing", "date": "2024-07-22 01:45", "url": "https://www.wsaz.com/2024/07/22/woman-charged-connection-with-stabbing/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "CHARLESTON, W.Va.- One person was arrested in connection with a stabbing that happened in Charleston on Saturday.\nTitshina Carter is charged with malicious wounding in connection with that incident.\nCharleston Police said officers responded to the 1500 block of Dorchester Road for a reported stabbing around 10:30 p.m.Investigators said two people were arguing when things escalated.\nOfficers said the victim and suspect knew one another.\nThe victim was taken to the hospital for treatment.", "location": "Charleston", "classification": "security", "score": 0.8240623321210693, "event_breakdown": "CHARLESTON, S.C.- One person was arrested in connection with a stabbing that happened in Charleston on Saturday.\nCharleston Police said officers responded to the 1500 block of Dorchester Road for a reported stabbing around 10:30 p.m.\nInvestigators said two people were arguing when things escalated.\nOfficers said the victim and suspect knew one another.\nThe victim was taken to the hospital for treatment."}, {"id": "80f03451-32b9-4017-8cac-3ab262cc79e2", "title": "Saudi Arabia denies connection with Israel Yemen attacks", "date": "2024-07-22 07:15", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240721-irna14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Saudi Arabia denies connection with Israel's Yemen attacksIRNA - Islamic Republic News AgencyJul 21, 2024Tehran, IRNA -- Saudi Arabia has denied any connection with the Israeli regime's airstrikes on the Yemeni port city of Hudaydah that left at teat three people dead and 87 others injured.\nSaudi Arabia had no connection or participation in the bombing of Hudaydah, Brigadier General Turki al-Maliki, spokesman of the Saudi Ministry of Defense was quoted by Al Jazeera as saying on Sunday morning.\nThe spokesman further said that his country would never allow the violation of its airspace by any one, with reference to whether Zionist warplanes attacked Yemen by breaching Saudi airspace.\nChannel 14 of the Zionist regime had previously reported that the Tel Aviv had informed the United States and Saudi Arabia before carrying out the attacks on Yemen.\nAccording to Israeli media 20 F-35 warplanes carrying hundreds of tons of explosives targeted the Hudaydah port that caused massive fire and destruction.", "location": "Hudaydah", "classification": "security", "score": 0.8873103820746897, "event_breakdown": "Saudi Arabia denies connection with Israel's Yemen attacks\nTehran, IRNA -- Saudi Arabia has denied any connection with the Israeli regime's airstrikes on the Yemeni port city of Hudaydah that left at teat three people dead and 87 others injured.\nSaudi Arabia had no connection or participation in the bombing of Hudaydah, Brigadier General Turki al-Maliki, spokesman of the Saudi Ministry of Defense was quoted by Al Jazeera as saying on Sunday morning.\nThe spokesman further said that his country would never allow the violation of its airspace by any one, with reference to whether Zionist warplanes attacked Yemen by breaching Saudi airspace.\nChannel 14 of the Zionist regime had previously reported that the Tel Aviv had informed the United States and Saudi Arabia before carrying out the attacks on Yemen.\nAccording to Israeli media 20 F-35 warplanes carrying hundreds of tons of explosives targeted the Hudaydah port that caused massive fire and destruction."}, {"id": "c8a2893f-9ef1-40b6-aff8-6cfdc885d740", "title": "30 - year - old man arrested for fatally stabbing mother in Kochi Prefecture", "date": "2024-07-22 10:30", "url": "https://japantoday.com/category/crime/30-year-old-man-arrested-for-fatally-stabbing-mother-in-kochi-prefecture", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "Police in Sukumo, Kochi Prefecture, said Sunday they have arrested a 30-year-old unemployed man on suspicion of fatally stabbing his 62-year-old mother at their home.\nAccording to police, Kyosuke Nakayama is accused of stabbing his mother Miwa with a knife at around 6:35 p.m. on Saturday, Kyodo News reported.\nNakayama told a neighbor what he had done and the neighbor called 119.\nPolice found Nakayama on a road near his house and arrested him on the spot.\nA blood-stained knife and a iron bar were reportedly found in the house near the victim's body.", "location": "Sukumo, Kochi Prefecture", "classification": "security", "score": 0.5408707596060214, "event_breakdown": "Saitama - A 33-year-old man was arrested in Sakura City, Saitama Prefect, for allegedly driving around neighborhoods and stealing cash and other property from parked cars.\nFukuoka - A man was arrested in Fukuoka City for stealing a bicycle. Police said the 41-year-old man admitted he stole the bicycle because he wanted to buy a new one.\nKanazawa - Police in Kanazawa City, Ishikawa Prefecture, have arrested a 50-year-old man after finding resin in his bag that they suspect was stolen from a construction site.\nFukuo - Police in Fukuo City, Fukuoka Prefecture, arrested a 43-year-old man who threatened a woman by wielding a knife. The suspect is accused of following and threatening a woman with a knife.\nKanazawa - A 26-year-old woman was arrested for stealing a wallet from a visitor to the National Museum of Modern Art, Tokyo."}, {"id": "babf4952-4534-4126-a8d3-65c9faf5d72c", "title": "Civilians killed and wounded as Russia claims gains in the east", "date": "2024-07-22 07:15", "url": "https://jamaica-gleaner.com/article/world-news/20240722/civilians-killed-and-wounded-russia-claims-gains-east", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "At least two people were killed in Ukrainian strikes on the partly Russian-occupied Donetsk region, Russian state media said, while Ukrainian officials said Russian strikes wounded at least five people.\nAlong the front line in the east, Russia said it had taken control of two villages, one in the Kharkiv region and one in the Luhansk region.\nThree people were wounded by Russian drone strikes in southern Ukraine’s partly occupied Kherson region, local officials said on Sunday morning.\nRussian air defence systems overnight destroyed eight drones over the country’s Belgorod region and over the Black Sea, the Russian Ministry of Defence said.\nRussian air defence also shot down two long-range ballistic ATACMS missiles in the sky over the Kherson region heading for Russia-annexed Crimea, Russia-installed Kherson Governor Vladimir Saldo said.", "location": "Donetsk region", "classification": "security", "score": 0.5440925602197787, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n- In Donetsk region of Ukraine, Ukrainian strikes killed at least two people.\n- Russian strikes in Donetsk region wounded at least five people, according to Ukrainian officials.\n- Russia has reportedly taken control of two villages in the Kharkiv and Luhansk regions.\n- Russian drone strikes injured three people in southern Ukraine's Kherson region.\n- Russian air defence systems destroyed eight drones over Belgorod region and over the Black Sea.\n- Russian air defence shot down two long-range ballistic ATACMS missiles over the Kherson region."}, {"id": "d199f011-5451-4e78-882e-9a78547534db", "title": "Ukrainian Drone Strike Ignites Fire at Russian Oil Refinery", "date": "2024-07-22 11:00", "url": "https://www.devdiscourse.com/article/headlines/3025315-ukrainian-drone-strike-ignites-fire-at-russian-oil-refinery", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A fire caused by a Ukrainian drone strike on Russia's Black Sea Tuapse oil refinery has been put out, officials said on Monday.\nThe refinery, owned by oil major Rosneft, was damaged in the drone attack overnight, officials from the Krasnodar region said earlier.\n(With inputs from agencies.)", "location": "TUapse", "classification": "security", "score": 0.6867773866842338, "event_breakdown": "Ukraine's armed forces have said that they targeted the Tuapse oil refinery with drones, causing a fire. The fire has now been put out. The refinery is owned by Russia's Rosneft."}, {"id": "cf6e16c6-02d5-426d-8907-cea929910fb9", "title": "Luigi Mansion 2 HD Remains in 1st Place on the French Charts", "date": "2024-07-22 17:45", "url": "https://www.vgchartz.com/article/461818/luigis-mansion-2-hd-remains-in-1st-place-on-the-french-charts/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Luigi's Mansion 2 HD Remains in 1st Place on the French Charts - Sales/ 407 Viewsby, posted 4 hours agoLuigi's Mansion 2 HD (NS) has remained in first place on the French charts for week 28, 2024, according to SELL.\nMario Kart 8 Deluxe (NS) remained in second place and Super Mario Bros. Wonder (NS) remained in third place.\nAnimal Crossing: New Horizons (NS) re-entered the top five in fourth place and Princess Peach: Showtime!\nPC Microsoft Flight Simulator - Premium Deluxe Edition EA Sports FC 24 Minecraft Java & Bedrock Plants Vs. Zombies: Garden Warfare 2 Football Manager 2024A life-long and avid gamer, William D'Angelo was first introduced to VGChartz in 2007.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "NS - Nintendo Surintendant", "classification": "security", "score": 0.5131567250818859, "event_breakdown": "Luigi's Mansion 2 HD Remains in 1st Place on the French Charts\nMario Kart 8 Deluxe Remains in 2nd Place on the French Charts\nSuper Mario Bros. Wonder Remains in 3rd Place on the French Charts\nAnimal Crossing: New Horizons Re-Enters the French Charts in 4th Place\nPrincess Peach: Showtime! Continues its Successful Run with a 5th Place Finish\n\nRelevant Event:\nLuigi's Mansion 2 HD Remains in 1st Place on the French Charts"}, {"id": "3a81c123-1b28-450b-b9b3-5ef43b0bd11f", "title": "READER LETTER | World ill - prepared to ward off massive cyber attack", "date": "2024-07-22 15:45", "url": "https://www.sowetanlive.co.za/opinion/letters/2024-07-22-reader-letter-world-ill-prepared-to-ward-off-massive-cyber-attack/", "domain": "sowetanlive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device.", "location": "Based on the provided text, I could not determine a specific location for the main event.", "classification": "security", "score": 0.9467275457272956, "event_breakdown": "Target Geographical Area: Global\nGlobal\nUS: California, San Francisco\nIsrael: Jerusalem\nGlobal: Internet Hacking\nUS: California, San Diego\nGlobal: South China Sea Conflict\nUS: Washington\nUS: Seattle\nGlobal: ISIS Insurgency\nUS: Kansas\nUS: Nebraska\nUS: Iowa\nGlobal: South China Sea Conflict\nUS: California"}, {"id": "0af5eb15-0308-479a-bad2-290793f61a95", "title": "Terrorist killed in on going operation in J & K Rajouri – Indian Defence Research Wing", "date": "2024-07-22 16:45", "url": "https://idrw.org/terrorist-killed-in-on-going-operation-in-jks-rajouri/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Terrorist killed in on going operation in J&K’s Rajouri| BySOURCE: IANSAn unidentified terrorist was killed and a soldierinjured on Monday in an anti-terror operation in Jammu and Kashmir’s Rajouri district.\nParshotam Kumar was recently awarded Shaurya Chakra by the President for helping to kill a terrorist in the Kalakote area of Rajouri district.\nSoldiers drawn from the elite Para Commandos and those trained in mountain warfare have been deployed in these districts to eradicate terrorism.\nTerrorist attacks have registered a spurt in the otherwise peaceful Jammu division.\nSix terrorist attacks have been reported in the Jammu division since June 9 this yearin which 12 security personnel have been martyred.", "location": "Jammu and Kashmir", "classification": "security", "score": 0.9554273181273055, "event_breakdown": "Terrorist killed in on going operation in J&K’s Rajouri"}, {"id": "198c19c7-8ef4-4477-8251-18bc1ebfc1b3", "title": "Israel orders evacuation , dozens of Gazans killed", "date": "2024-07-22 17:30", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israel-orders-evacuation-dozens-of-Gazans-killed-47436986/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: Israeli shelling and airstrikes killed dozens of Palestinians near Khan Younis, Gaza medics said on Monday (July 22), as many fled the damaged city.\nThat's after Israel issued new evacuation orders to some neighborhoods in southern Gaza in what it said were renewed attacks in those areas.\nMedics said the Palestinians were killed by tank salvoes in some towns just east of Khan Younis, with the area also bombarded by air.\nOutside of Khan Younis' Nasser hospital, prayers were held for victims of the strikes.\nAn Israeli military statement said the new evacuation orders were given due to renewed Palestinian militant attacks - including rockets launched from the targeted areas in eastern Khan Younis.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9464777350631718, "event_breakdown": "Israeli shelling and airstrikes killed dozens of Palestinians near Khan Younis, Gaza medics said on Monday (July 22), as many fled the damaged city. Medics said the Palestinians were killed by tank salvoes in some towns just east of Khan Younis, with the area also bombarded by air."}, {"id": "3a64aa95-b0ca-4c0e-9c7b-ce1771e0d7e5", "title": "Israel issues evacuation orders in southern Gaza , kills 16 Palestinians - World", "date": "2024-07-22 08:15", "url": "https://www.brecorder.com/news/40313763/israel-issues-evacuation-orders-in-southern-gaza-kills-16-palestinians", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO/OCCUPIED JERUSALEM: Israeli strikes killed at least 16 Palestinians in eastern areas of Khan Younis, Gaza health officials said on Monday, shortly after Israel issued new orders to evacuate some neighbourhoods after what it said was renewed attacks from those zones.\nGaza officials say 90 Palestinians killed as Israel targets Hamas military chiefPalestinian health officials said at least 16 Palestinians were killed in Israeli tank shelling in Bani Suhaila town east of Khan Younis.\nThe evacuation orders did not include health institutions, Palestinians said.\nThe Palestinians, the United Nations, and international relief agencies have said that there is no safe place left in Gaza.\nEarlier in July, dozens of Palestinians were killed in separate Israeli attacks in the Al-Mawasi humanitarian-designated areas.", "location": "GAZA", "classification": "security", "score": 0.929445686044357, "event_breakdown": "Israeli strikes killed at least 16 Palestinians in eastern areas of Khan Younis, Gaza"}, {"id": "7238ca1c-9a4c-4c58-a6f5-7f89e8649595", "title": "Israel - Hamas War day 290 : What is happening in Israel and Gaza ? ", "date": "2024-07-22 07:45", "url": "https://www.jpost.com/israel-hamas-war/2024-07-22/live-updates-811337", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "(photo credit: MOHAMMED SALEM/REUTERS)The Hamas-run Gaza Health Ministry stated on Monday that the death toll in Gaza has reached 39,006 since the war started on October 7 of last year.\nA further 89,818 have thus far been wounded in the conflict, the Gazan ministry added.\nThe number has not been independently verified, and the ministry does not differentiate between civilians and combatants in its toll.\nThe Hamas-run ministry has also been repeatedly criticized for distorting casualty figures.\nIn May, departing from Hamas’s reported figures, the UN halved the number of women and children it had previously reported had been killed thus far in the war.", "location": "GAZA CITY", "classification": "security", "score": 0.6540236140041668, "event_breakdown": "New Israeli airstrikes hit Gaza. These are the first airstrikes by Israel since the war started on October 7 of last year. Ashraf al-Qidra, spokesman for the Gaza Health Ministry, stated that Israeli airstrikes on Gaza City on Wednesday night wounded two people."}, {"id": "4d560859-be81-4765-ac9b-b1664f515789", "title": "South Korea Boosts Border Propaganda Broadcasts After North Korea Flies More Trash Balloons", "date": "2024-07-22 11:00", "url": "https://www.military.com/daily-news/2024/07/22/south-korea-boosts-border-propaganda-broadcasts-after-north-korea-flies-more-trash-balloons.html", "domain": "military.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korea said Sunday it was bolstering its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea, after the North launched more trash-carrying balloons toward South Korea.\nSouth Korea’s Joint Chiefs of Staff said the North Korean balloons were flying Sunday morning north of Seoul, the South Korean capital, after crossing the border.\n“The North Korean military’s tension-escalating acts can result in causing critical consequences for it,” the South Korean Joint Chiefs of Staff said in a statement.\n“The responsibility for this situation is entirely on North Korea’s government.”Details of the expansion of South Korea's loudspeaker operations were not immediately available.\nNorth Korea has floated more than 2,000 balloons to drop waste paper, scraps of cloth, cigarette butts, waste batteries and even manure on South Korea, though they have so far caused no major damage in South Korea.", "location": "SEOUL", "classification": "security", "score": 0.7216088289445848, "event_breakdown": "target event : reports a conflict on enemy balloons flooding south korea\nNorth Korea’s military sent more balloons carrying trash toward South Korea on Sunday. The South Korean Joint Chiefs of Staff have said they are bolstering anti-Pyongyang broadcasts in response."}, {"id": "8f87b1f9-a224-4ec5-adce-29b0731274f0", "title": "Israel issues evacuation orders in southern Gaza , kills 16 Palestinians", "date": "2024-07-22 11:00", "url": "https://www.rappler.com/world/middle-east/israel-issues-evacuation-orders-southern-gaza-palestinian-deaths/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "People carry Palestinian children wounded in an Israeli strike, amid Israel-Hamas conflict, at Nasser hospital, in Khan Younis in the southern Gaza Strip July 22, 2024.\nPalestinian health officials said at least 16 Palestinians were killed in Israeli tank shelling in Bani Suhaila town east of Khan Younis.\nThe military statement said the new orders were due to renewed Palestinian attacks, including rockets launched from the targeted areas in eastern Khan Younis.\nEarlier in July, dozens of Palestinians were killed in separate Israeli attacks in the Al-Mawasi humanitarian-designated areas.\nPalestinian officials called those allegations false and used to justify the attacks.", "location": "GAZA CITY.", "classification": "security", "score": 0.9843811011799152, "event_breakdown": "Israeli airstrike in Rafah, southern Gaza Strip\nPalestinian health officials said at least 16 Palestinians were killed in Israeli tank shelling in Bani Suhaila town east of Khan Younis.\nThe military statement said the new orders were due to renewed Palestinian attacks, including rockets launched from the targeted areas in eastern Khan Younis.\nEarlier in July, dozens of Palestinians were killed in separate Israeli attacks in the Al-Mawasi humanitarian-designated areas.\nPalestinian officials called those allegations false and used to justify the attacks."}, {"id": "06705cf7-0b35-4df3-8330-7a403670e9e0", "title": "Russian Brigade Manages To Lose 200 % Of Its Personnel", "date": "2024-07-22 15:15", "url": "https://charter97.org/en/news/2024/7/22/603817/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Russian Brigade Manages To Lose 200% Of Its Personnel 3 22.07.2024, 13:437,144The command is concealing the losses.\nThe commander of one of the motorized rifle platoons of the Russian Armed Forces said that the losses in his brigade are twice as high as its total strength.\n“The staff strength of the Russian brigade is up to 6 thousand people.\nThe Russian army maintains its combat capability only by constantly replenishing its personnel.\nAnd judging by the video, the Russian officer had some bad premonitions,” Butusov noted.", "location": "remains to be seen", "classification": "security", "score": 0.8468700602250552, "event_breakdown": "The Russian invasion in Ukraine continues with reports of high losses on the Russian side. The situation on the ground and in the air is not easy, even if one can not say for sure the side of the Ukrainian army, which may show higher losses. The Russian side seems to have raised twice as many soldiers as needed to maintain the combat capability of the Russian army. Russia's inability to organize and properly supply its army may contribute significantly to the high losses suffered by Russians in Ukraine. The situation is compounded by the fact that the Russians constantly bring new, untrained soldiers to the front and will not raise a professional army for a long time to come. The situation is extremely frustrating, even if it seems that Ukraine may have enough supplies to prevent further advances by the Russian army in the northeast. At the same time, there is despair in the western part of the country, where Russian air raids continue."}, {"id": "c0508089-fb96-4ce2-8c68-cd3d373dbfe1", "title": "Villager , Soldier Injured As Terrorists Strike In J & K Rajouri", "date": "2024-07-22 07:30", "url": "https://www.dailyexcelsior.com/vdg-members-relative-soldier-injured-as-terrorists-strike-in-rajouri-operation-on/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "JAMMU, July 22: The terrorists on Monday attacked the house of a Village Defence Guard (VDG) member, which was foiled by the Army troops in Gundah Village of tehsil Budhal in Rajouri district of Jammu and Kashmir, officials said.\nFollow the Daily Excelsior channel on WhatsAppIn exchange of firing around 3.10 am, a relative of a VDG member and Shaurya Chakra awardee Parshotam Kumar and an Army soldier were injured, an official said.\n“The terrorists had intentionally attacked the house of the VDG member,” sources said, adding that the Army successfully thwarted it.\n“The area is cordoned off and 3 to 4 terrorists are believed to be trapped in the ensuing combat operation,” officials said.\nThe Army is launching “Operation All Out” with additional deployment of 3,000 troops and 500 para commandos to flush out foreign terrorists active in the hilly district of the Jammu region.", "location": "Gundah Village in Rajouri district Jammu and Kashmir", "classification": "security", "score": 0.9826244038826424, "event_breakdown": "Event 1: Terrorists attacked the jg Mobile Crusher\nEvent 2: Army thwarted a terror attempt in Jammu"}]