[{"id": "add99eb6-2b9c-4d7b-a7d0-366df65a99aa", "title": "Tropical Storm Hone : Hawaii faces flooding and road closures as three Cyclones stir in Pacific", "date": "2024-08-27 03:30", "url": "https://timesofindia.indiatimes.com/world/us/hawaii-faces-flooding-and-road-closures-as-three-cyclones-stir-in-pacific/articleshow/112821416.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tropical storm Hone brings heavy rain to HawaiiImpact on Big IslandPrecautions against future fires amid Tropical Storm HoneHurricane Gilma and Tropical Storm Hector gain strengthThree tropical cyclones were active in the Pacific Ocean on Monday, bringing varied effects to different regions.\nTropical Storm Hone caused significant rainfall and flash floods in Hawaii , while Hurricane Gilma and Tropical Storm Hector were gaining strength and moving eastward.The impacts of these storms led to road closures and power outages to potential future flooding concerns.Tropical Storm Hone, pronounced \"hoe-NEH,\" caused road closures, downed power lines, and damaged trees in parts of the Big Island , according to William Ahue, a forecaster at the Central Pacific Hurricane Center in Honolulu.\n\"No major damage that we know of yet,\" news agency AP quoted Big Island mayor Mitch Roth as saying.\nAdditionally, four schools on the Big Island were closed because of power outages and flooded roads.\n\"We were experiencing tropical storm winds and heavy pounding rain through the night.\"", "location": "The Big Island", "classification": "natural-disasters", "score": 0.9809023011305336, "event_breakdown": "Tropical Storm Hone hits Hawaii, causes flooding, road closures, power outages.\nHurricane Gilma and Tropical Storm Hector gain strength, head towards Hawaii.\nThree tropical cyclones active in Pacific Ocean, one hits Hawaii."}, {"id": "4664aa99-29f2-4154-a13f-d433fd3c537c", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 08:30", "url": "https://www.butlereagle.com/20240827/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific-ocean/", "domain": "butlereagle.com", "domain_classification": "Unknown", "message": "HONOLULU — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone which brought heavy rain to Hawaii, Hurricane Gilma which was gaining strength and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nIn the eastern Pacific Ocean, Hurricane Gilma intensified Monday into a strong Category 2 hurricane with maximum sustained winds at 110 mph.\nFarther to the east, Tropical Storm Hector also gained strength Monday.", "location": "The main event is Tropical Storm Hone which caused heavy rain in Hawaii.", "classification": "natural-disasters", "score": 0.9775298322663414, "event_breakdown": "Tropical Storm Gilma, Hurricane Hector, Tropical Storm Hone, Hawaii and Baja California."}, {"id": "6e77a4b5-e131-4228-bf90-280dad9d66f6", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 05:30", "url": "https://www.mymotherlode.com/news/national/3413934/hone-swirls-past-hawaiis-main-islands-after-dumping-enough-rain-to-ease-wildfire-fears.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific OceanTropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean View PhotoHONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector, which was churning westward, far off the coast of southern tip of Baja California.\nBy midday Monday, Hone was 280 miles (450 kilometers) west-southwest of Honolulu with maximum sustained winds of 65 mph (110 kph).\nIn the eastern Pacific Ocean, Hurricane Gilma intensified Monday into a strong Category 2 hurricane with maximum sustained winds at 110 mph (175 kph).\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday.", "location": "Hawaii", "classification": "natural-disasters", "score": 0.9745593556066586, "event_breakdown": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean, includes descriptions of Tropical Storm Hone, Hurricane Gilma, and Tropical Storm Hector."}, {"id": "1366b72f-9619-4d65-9070-394206e4e1b2", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean", "date": "2024-08-27 01:00", "url": "https://wacotrib.com/ap/national/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific/article_523a390c-d295-52ee-b6ec-61bb86c89914.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "HONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone which brought heavy rain to Hawaii, Hurricane Gilma which was gaining strength and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday.", "location": ")\nThe main event is centered around HILO, HAWAII", "classification": "natural-disasters", "score": 0.9673246680874714, "event_breakdown": "Tropical Storm Hector: Farther to the east, Tropical Storm Hector also gained strength Monday."}, {"id": "c7624288-e576-4673-a4be-0cf37dd08e49", "title": "Back - to - Back Hurricanes : Hawaii Could Face Gilma Less Than a Week After Hone", "date": "2024-08-27 01:15", "url": "https://www.theepochtimes.com/us/back-to-back-hurricanes-hawaii-could-face-gilma-less-than-a-week-after-hone-5713050", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone began its pass of the islands as a Category 1 Hurricane on Aug. 25, diminishing to a tropical storm in the process.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center's forecasted track for Hurricane Gilma on its way toward Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024.\nNational Hurricane Center/National Weather ServiceThe Hawaiian Islands could face back-to-back storms as the National Hurricane Center (NHC) forecasts Hurricane Gilma to arrive within striking distance by Labor Day Weekend—less than one week after Hurricane Hone.\nThere are currently three named storms in the Pacific, with Tropical Storm Hector following behind Gilma.", "location": "-\nHawaii", "classification": "natural-disasters", "score": 0.9156284068840767, "event_breakdown": "Tropical Storm Hone:\n\nThe National Hurricane Center's forecasted track for Hurricane Gilma is on its way towards Hawaii as of 5 p.m. Eastern time on Aug. 26, 2024. The U.S. Coast Guard has spearheaded evacuation operations to help residents prepare for the storm, and the Hawaii Emergency Management Agency warns against non-essential travel and are encouraging residents to stock up on food and obtain water, in addition to the usual preparations involving securing homes. According to data from the National Hurricane Center, this transition is set to happen on Friday evening.\n\nHurricane Hector:\n\nDespite conflicts between Hawaii Emergency Management Agency and the white house, American Samoans are bracing for Hurricane Hector, which is on track to impact the territory on Wednesday around 2:15 p.m. It could also pass by Hawaii's main islands, reports Hawaii Emergency Management Agency. Panetta, along with the prime minster of Australia, Julia Gillard, are currently in Hawaii as part of President Obama's first state visit to Hawaii as president. The winds will be at over 85 mph and there have been flash flood warnings issued all over the island in the tropical depression's estimated path.\n\nHurricane Gilma:\n\nHonolulu announced Tuesday that \"non-essential travel should avoid the island archipelago until Gilma's path is confirmed\".\n\nHurricane Hector:\n\nAmerican Samoa's National Weather Service announced that a hurricane stands as a threat on Wednesday, and that preparations should begin as soon as possible."}, {"id": "b593eb33-d1c9-47f6-80b7-97f6398fe26a", "title": "Earthquake of 5 . 9 magnitude strikes Darwin", "date": "2024-08-27 05:15", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/earthquake-of-5-9-magnitude-strikes-darwin-in-australia/articleshow/112823593.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "A strong earthquake measuring 5.9 on the Richter scale occurred in the Banda Sea , off the coast of Darwin , Australia , on Tuesday.\nThe seismic event was detected at a depth of 62 km.According to the Bureau of Meteorology, \"there was no threat of a tsunami to Australia\" following the earthquake.\nGeoscience Australia received nearly 300 reports from individuals who felt the tremors.The significant seismic activity in the Banda Sea came shortly after a smaller, magnitude 3.0 earthquake struck the Gippsland region of Victoria on Monday evening at 7:54pm.The epicenter of this quake was located at Sandy Point, in close proximity to Wilsons Promontory, approximately 190km south-east of Melbourne.", "location": "The main event takes place in the Banda Sea.", "classification": "natural-disasters", "score": 0.8809859708980549, "event_breakdown": "Current natural-disaster events reported on in text:\nEarthquake in the Banda Sea, off the coast of Darwin, Australia on Tuesday."}, {"id": "3649ff0f-05b1-4392-94fc-07b95b41e074", "title": "Magnitude 5 . 9 earthquake recorded off coast of Darwin", "date": "2024-08-27 03:30", "url": "https://www.dailymail.co.uk/news/article-13782683/Magnitude-5-9-earthquake-recorded-coast-Darwin-Northern-Territory.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "An earthquake with a magnitude of 5.9 has been recorded off the coast of Darwin.\nThe earthquake was recorded in the Banda Sea at a depth of 62km at about midday on Tuesday.\nAlmost 300 people lodged reports on Geoscience Australia after feeling the quake, while some office workers in Darwin reported their buildings shaking.\nMeanwhile, residents in NSW's Upper Hunter region and beyond were rattled by a magnitude 5.0 earthquake just after 12pm on Friday.\nIt came just hours after a magnitude 3.2 earthquake shook the nearby town of Muswellbrook at 1.10am with another magnitude 2.5 quake felt at 2.30am.", "location": "Darwin, Northern Territory", "classification": "natural-disasters", "score": 0.8856780627315902, "event_breakdown": "5.9 Magnitude Earthquake Recorded off Coast of Darwin\nA 5.9 magnitude earthquake was recorded off the coast of Darwin. The earthquake was recorded in the Banda Sea at a depth of 62km at about midday on Tuesday. Almost 300 people lodged reports on Geoscience Australia after feeling the quake, while some office workers in Darwin reported their buildings shaking."}, {"id": "abfc3efe-bbb8-4a3d-8c49-ab5ab7e6aebe", "title": "No more  wildfires of note  burning in B . C . ", "date": "2024-08-27 02:00", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-of-note-1.7305489", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "There are no longer any \"wildfires of note\" burning in British Columbia, with the B.C.\nThe Corya Creek wildfire, about 170 kilometres northeast of Terrace, B.C., was the last fire to be tagged with the label, which was lifted on Monday.\nFire information officer Emilie Peacock cautions the changing status doesn't mean the wildfire season is over.\nMore than 10,000 square kilometres of land has been burned in B.C.\nLast year's record wildfire season saw more than 28,000 square kilometres of land burned and forced the evacuations of communities in regions including the Okanagan and Shuswap.", "location": "British Columbia, Canada", "classification": "natural-disasters", "score": 0.776164128919634, "event_breakdown": "B.C.\nAs of Sunday, there are no wildfires of note burning inB.C."}, {"id": "9cab3705-2f57-4068-aaf6-085fc0512b46", "title": "Megathrust Earthquake : BMKG Urges Ministry to Ensure Disaster Preparedness of Tourist Destinations", "date": "2024-08-27 05:00", "url": "https://en.tempo.co/read/1908909/megathrust-earthquake-bmkg-urges-ministry-to-ensure-disaster-preparedness-of-tourist-destinations", "domain": "en.tempo.co", "domain_classification": "Unknown", "message": "TEMPO.CO, Jakarta - The Meteorology, Climatology, and Geophysics Agency (BMKG) urged the Ministry of Tourist and Creative Economy to ensure beaches have earthquake and tsunami mitigation standards to respond to megathrust earthquake potential.\nAccording to the BMKG Head of the Indian and Pacific Oceans Tsunami Mitigation Department, Suci Anugrah, many hotels and tourist destinations are neglecting the basic standards of earthquake and tsunami mitigation.\nSuci said a megathrust earthquake is inevitable as it’s been analyzed through scientific studies.\nTherefore, a structural mitigation plan is necessary since the precise timing of a megathrust earthquake cannot be predicted.\n\"Every tourism manager and related parties can refer to ISO emergency management in drafting evacuation and disaster mitigation standards,\" said Suci.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.9133008167215672, "event_breakdown": "The following natural-disaster events were reported in the current time frame:\n\n1. Earthquake: A 4.7-magnitude earthquake hit Cipatujah, Bogor, West Java, on Friday at 8.22 a.m. West Indonesia Standard Time (WIB), according to BMKG. The quake's epicenter was located at a depth of 10 kilometers (km) in Sukabumi regency.\n2. Tsunami: Indonesia's Meteorology, Climatology, and Geophysics Agency (BMKG) urged the Ministry of Tourism and Creative Economy to ensure beaches have tsunami mitigation standards to respond to Indonesia's megathrust earthquake potential."}, {"id": "6407d281-4de0-4ca6-9dc0-ffbed8e2efe4", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:00", "url": "https://www.yahoo.com/news/wild-week-us-weather-includes-040726833.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Here's a look at some of the weather events:Midwest sizzles under heat waveMillions of people in the Midwest have been enduring dangerous heat and humidity.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Midwest", "classification": "natural-disasters", "score": 0.9903458427549365, "event_breakdown": "Midwest heatwave, Tropical Storm Hone affecting Hawaii, Flash flood in Grand Canyon National Park, Search for Missing Woman in Grand Canyon National Park."}, {"id": "10197987-6669-4316-a6b1-247f3e6ac6c0", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:45", "url": "https://www.ksat.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Charlie Neibergall)FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "Here are the events that can be placed on a map:\n* Heat wave affecting parts of United States\n* Tropical storm dumping heavy rain on Hawaii\n* Flash flood hitting Grand Canyon National Park"}, {"id": "09be7c9c-c4ee-4406-93d2-83a825410eb1", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 07:45", "url": "https://www.click2houston.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "(AP Photo/Charlie Neibergall)FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "Heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical Storm Hone, which brought heavy rain to Hawaii\nTropical storm dumps heavy rain on Hawaii\nThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlasn flood hit Grand Canyon National Park\nThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck."}, {"id": "6b04844b-fad9-4ef7-944c-b5c7c76d4576", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 04:45", "url": "https://www.clickorlando.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(AP Photo/Charlie Neibergall)FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "| Event                                  | Date                                    | Location                                                                                                                                                                                                         |\n|-----------------------------------------|--------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Heat wave in the Midwest               | July 2006                              | Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.                                                                 |\n| ----------------------------------------------------------------------"}, {"id": "1ed7fcaa-98c5-47e7-88b9-018b1f383802", "title": "Forecasters monitoring disturbance in Atlantic after weeks of relative calm", "date": "2024-08-27 01:15", "url": "https://www.tampabay.com/hurricane/2024/08/26/forecasters-monitoring-disturbance-atlantic-after-weeks-relative-calm/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "After weeks of relative calm in the tropics, forecasters are monitoring a disturbance in the central Atlantic that could slowly develop over the next week.\nForecasters gave the disturbance a 0% chance of developing over the next 48 hours and a 20% chance of doing so over the next week.\nThe next named storm in the 2024 Atlantic hurricane season will be Francine.\n• • •Tampa Bay Times hurricane coverage 20245 things to know about the 2024 hurricane season, according to forecasters.\nForecasters predict ‘extremely active’ 2024 hurricane season.", "location": "Atlantic", "classification": "natural-disasters", "score": 0.6442021072214704, "event_breakdown": "Tropical Storm Sonia \n\nSonia is a tropical cyclone in the Pacific that was active on October 17, 2024. The storm was located approximately 1,200 miles due east of Hilo, Hawaii, and had maximum sustained winds of 65 miles per hour. Sonia is expected to move west-northwestward over the next few days and continue to strengthen. \n\nHurricane Tomas \n\nTomas, classified as a category 2 hurricane on the Saffir-Simpson Hurricane Scale, was located in the Atlantic and was active on October 29, 2024. The storm was located approximately 400 miles east-northeast of the northern Leeward Islands and was moving west-northwestward at 8 miles per hour. The storm had maximum sustained winds of 110 miles per hour. Tomas is expected to move across the northeastern Caribbean Sea over the next few days and may bring heavy rainfall and strong winds to the region."}, {"id": "bc230250-9f75-4699-b2c9-8281a34e9e6d", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:00", "url": "https://www.wsls.com/news/national/2024/08/27/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "(AP Photo/Charlie Neibergall)FALCON HEIGHTS, Minn. – It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "MINNESOTA", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "1. Heat wave hits United States Midwest\n2. Tropical storm dumps heavy rain on Hawaii\n3. Flash flood hits Grand Canyon National Park"}, {"id": "9fc7af4e-7ff6-49ba-adb2-b50223353556", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": "SYDNEY, AUSTRALIA", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "Natural disasters may not be as widely discussed as current wars or humanicidio, but as the world enters a new year with the COVID-19 situation under control, thank Global Warming for returning with many natural disasters hitting the Global Map. Australia is suffering from torrential rain and deadly floods hitting major parts of New South Wales and Queensland. Twenty-five people have been killed so far, and thousands have fled their homes.\n\nNot only that, but: A 7.2-magnitude earthquake in the Caribbean, caused major damage in Haiti and the Dominican Republic, killing 1,400 people, and devastating both towns. The great Indian Ocean earthquake triggered a series of devastating tsunamis on December 26, the 248th day of the year?"}, {"id": "f6e07a3e-3548-4be6-a2d3-fcf02bad5f5c", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.canberratimes.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": "AULDURA\nA small town in the Wheatbelt region of Western Australia. It is located 45", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "Here is a list of current natural disasters that have been mentioned in the text:\nCanada: Floods in B.C.\nAustralia: Wildfires\nUSA: Tornadoes, Hurricanes"}, {"id": "29ce0cdb-8386-488a-a7b6-6003ee607d82", "title": "  Pretty scary : Tropical Storm Hone lashes parts of Hawaii Island as a Cat 1 hurricane", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/26/pretty-scary-tropical-storm-hone-lashes-parts-hawaii-island-cat-1-hurricane/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "(HONOLULU) - Tens of thousands of Hawaii Electric customers were without power across the state as Tropical Storm Hone moved through the islands over the weekend.\nIt upgraded to a Category 1 Hurricane late Saturday as it brushed the southern point of Hawaii Island on Sunday.\nAs of late Sunday evening, Hone was downgraded back to tropical storm as it pulled away from the islands.\nAt 11:30 a.m. Sunday, roughly 18,000 HECO costumers were without power across the state, the majority of them on Hawaii Island.\nHawaii Island residents can report damages from Hurricane Hone here or call (808) 935-0031.", "location": "HONOLULU", "classification": "natural-disasters", "score": 0.8637153999345754, "event_breakdown": "Hurricane Hone hit Hawaii on July 25. It downgraded to a tropical storm then moved to the northeast of the islands. About 18,000 HECO customers were without power Sunday across the state."}, {"id": "a13f85bd-50ad-476e-a61a-d1087db8ff24", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/bc-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.", "location": "Vancouver, British Columbia", "classification": "natural-disasters", "score": 0.7792702331937011, "event_breakdown": "BC, including Metro Vancouver, is expected to see showers and possibly some thunder Monday afternoon and evening, but conditions will be dry with \"elevated wildfire risk\" in the northern part of the province.\nWhile no specific areas or regions are called out for the latest assessment map, the wildfire service noted that southwest B.C. continues to have an elevated fire risk due to \"hot, dry, and windy conditions.\"\nOngoing fire-fighting efforts are focused on nearly a dozen wildfires of note, including 10 that are considered highly visible or potentially threatening, and one that is just being monitored.\n- A large wildfire southeast of Kamloops continues to grow and has prompted new evacuation orders over the weekend.\nDespite the overall decrease in the number of wildfires in B.C., there are still a handful of evacuation orders and alerts impacting communities around the province."}, {"id": "3d191df2-f149-4264-a600-2735df79bc04", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:00", "url": "https://www.kob.com/news/us-and-world-news/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "kob.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "FALCON HEIGHTS, Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "Tropical Storm Hone hit Hawaii, causing heavy rain.\nHawaii was hit by Tropical Storm Hone, which caused heavy rain.\nHurricane Gilma is gaining strength.\nHurricane Gilma is gaining strength, but is not currently affecting the Hawaiian Islands.\nTropical Storm Hector is churning westward, far off the coast of southern tip of Baja California.\nTropical Storm Hector is currently offshore and is not affecting the Hawaiian Islands."}, {"id": "fd164d45-c46c-4d94-a698-110233d51d92", "title": "Impacts of the drought across the Shenandoah Valley", "date": "2024-08-27 04:15", "url": "https://www.whsv.com/2024/08/27/impacts-drought-across-shenandoah-valley/", "domain": "whsv.com", "domain_classification": "Unknown", "message": "For a second year in a row, the Shenandoah Valley is facing the worst of it.\nFour out of the top five Ag producing counties in the state, are in the Shenandoah valley.\nAn idea of how impactful the drought really is:For the Shenandoah Valley, 4 out of the top 5 Ag producing Counties are in the SV.\nSoybeans instead of corn”Along the Shenandoah River is the Burnshire Dam in Shenandoah county.\nThe Virginia Department of Forestry says drought stress impacts the trees, but more so it’s going to be from disease or invasive insects.", "location": "Shenandoah Valley", "classification": "natural-disasters", "score": 0.6029909306255913, "event_breakdown": "Here are the relevant current events of natural-disasters:\n- Shenandoah Valley going through the worst drought in a century\n- The Mississippi River is facing historic low water levels\n- The western United States is struggling with a severe drought and heat wave\n- The eastern United States is being hit with a large and dangerous heat wave\n- The west coast of the United States is experiencing a major heat wave and drought"}, {"id": "5d87d68c-7cf9-4dde-b827-ea8438b72591", "title": "Moderate earthquake , 5 . 9 mag has occurred near Kepulauan Babar , Indonesia", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/moderate-earthquake-5-9-mag-has-occurred-near-kepulauan-babar-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake magnitude 5.9 (ml/mb) has struck on Tuesday, Kepulauan Babar, Indonesia (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmzd.\nId of event: us6000nmzd.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Kepulauan Babar, Indonesia.", "location": ")\nKepulauan Babar, Indonesia", "classification": "natural-disasters", "score": 0.9705808649756302, "event_breakdown": "In the last year there have been no earthquakes that have occurred in the specified criteria, also no tsunami warnings."}, {"id": "9d865023-7dfb-43cb-bc3f-29e8a96b9c23", "title": "Light earthquake , 4 . 3 mag has occurred near Pagan region , Northern Mariana Islands", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-3-mag-has-occurred-near-pagan-region-northern-mariana-islands/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes Pagan region, Northern Mariana Islands (0 miles) on Friday.\nDate and time of earthquake in UTC/GMT: 02/08/24 / 2024-08-02 22:50:54 / August 2, 2024 @ 10:50 pm.\nId of earthquake: us7000n8m1.\nThe earthquake occurred at a depth of 193.843 km (120 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Pagan region, Northern Mariana Islands.", "location": ")\nPagan region, Northern Mariana Islands.", "classification": "natural-disasters", "score": 0.8907025314954784, "event_breakdown": "In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days six earthquakes of magnitude 3.0 or greater that has struck near. There are an estimated 13,000 light earthquakes in the world each year. Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage.\nDid you feel it?\nHow did you react? Did any furniture slide, topple over, or become displaced? Leave a comment or report about activity, shaking and damage at your home, city and country. This information comes from the USGS Earthquake Notification Service. Read more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Pagan region, Northern Mariana Islands."}, {"id": "7c127ea9-2cdd-4d00-bf48-027fd5393a45", "title": "Light earthquake , 4 . 2 mag has occurred near Uchiza in Peru", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-2-mag-has-occurred-near-uchiza-in-peru/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 18 kilometers (11 miles) from Uchiza in Peru on Tuesday.\nId of earthquake: us6000nmz7.\nEpicenter of the earthquake was 31 km (19 miles) from Tocache (c. 29 000 pop), 19 km (12 miles) from Uchiza (c. 17 700 pop).\nNearest cities/city/towns to hypocenter/epicentrum was Tocache, Uchiza (min 5000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 18 km ENE of Uchiza, Peru.", "location": "Uchiza", "classification": "natural-disasters", "score": 0.8140758786172458, "event_breakdown": "Earthquake of magnitude 4.1 - 8km E of Playa Prieta, Mexico\nA light earthquake magnitude 4.2 (ml/mb) strikes 18 kilometers (11 miles) from Uchiza in Peru on Tuesday.\nId of earthquake: us6000nmz7.\nEpicenter of the earthquake was 31 km (19 miles) from Tocache (c. 29 000 pop), 19 km (12 miles) from Uchiza (c. 17 700 pop).\nNearest cities/city/towns to hypocenter/epicentrum was Tocache, Uchiza (min 5000 pop)."}, {"id": "b7aebd46-69e0-4e6c-819c-3865d8d12421", "title": "Light earthquake , 4 . 5 mag strikes near Pondaguitan in Philippines", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-strikes-near-pondaguitan-in-philippines-20/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Monday, 121 km SE of Pondaguitan, Philippines (75 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000nmyj.\nId of event: us6000nmyj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 121 km SE of Pondaguitan, Philippines.", "location": "Philippines", "classification": "natural-disasters", "score": 0.9731795612105139, "event_breakdown": "Earthquake felt in:\nSurigao Del Sur (PHI)."}, {"id": "9148b270-6c39-4b44-a1fe-b2ee38dd2fbd", "title": "Light earthquake , 4 . 1 mag strikes near Acajutla in El Salvador", "date": "2024-08-27 08:00", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-1-mag-strikes-near-acajutla-in-el-salvador/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) has struck on Monday, 32 kilometers (20 miles) from Acajutla in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 59.631 km (37 miles) below the earth’s surface.\nClose country/countries that might be effected, El Salvador (c. 6 052 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 32 km SE of Acajutla, El Salvador.", "location": ")\nAcajutla", "classification": "natural-disasters", "score": 0.9757095262741022, "event_breakdown": "A light earthquake magnitude 4.1 (ml/mb) has struck on Monday, 32 kilometers (20 miles) from Acajutla in El Salvador. Close country/countries that might be effected, El Salvador (c."}, {"id": "4c8cb25b-5b9c-4480-a756-1cc46b07bac7", "title": "Disaster unemployment assistance available to Vermonters who lost work during July 9 - 10 flooding​", "date": "2024-08-27 03:30", "url": "https://www.necn.com/news/local/disaster-unemployment-assistance-available-to-vermonters-who-lost-work-during-july-9-10-flooding/3318228/", "domain": "necn.com", "domain_classification": "Unknown", "message": "The U.S. Department of Labor has approved federal disaster unemployment assistance for Vermonters who lost work because of the flooding from the remnants of Hurricane Beryl on July 9 and 10, the state Labor Department said Monday.\nLast week, President Joe Biden approved a major disaster declaration for parts of the state that were hit by the flooding, including individual assistance disaster, which covers unemployment assistance, for residents in Addison, Caledonia, Chittenden, Essex, Lamoille, Orleans and Washington counties, the state said.\nHeavy rains washed out roads in Vermont in the latest round of flooding to hit the state.\n“Vermonters across the State have found their lives, homes, and businesses impacted again by this recent disaster,” Labor Commissioner Michael Harrington said in a statement.\nThe Labor Department will determine if the individual is eligible for regular unemployment or should apply for the federal benefit.", "location": "Vermont", "classification": "natural-disasters", "score": 0.7223483568440262, "event_breakdown": "Tropical Storm Agatha killed at least 9 people and left 20 missing in Guatemala.  Agatha caused severe flooding and landslides.  A state of emergency was declared.  Agatha formed on May 24 and dissipated on May 30.\nTropical Storm Cindy killed at least five people in the states of Louisiana and Alabama.  It caused severe flooding across the two states and was classified as a low-end flood event.  At least 22 deaths were blamed on Cindy, and the storm caused power outages that affected over 100,000 people."}, {"id": "569c8564-a0da-4594-9b85-a6abfe0126fb", "title": "Clean - up efforts begin on Hawaii island as Hurricane Hone passes through", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/clean-efforts-begin-hawaii-island-012519326.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HILO, Hawaii (KHON2) — Hawaii island is cleaning up from Hurricane Hone.\nWhile no severe damages were reported, major roads remain closed and some have been without power since Saturday night.\nKauai County: No major impacts from Hone, monitoring looming storms in Eastern PacificFrom Kohala to Kau, Hone dumped over a foot of rain on parts of Hawaii island and some roads were damaged.\nSome volcano residents had power back on by 9 p.m. on Sunday night.\nThe county is hosting two hazard mitigation meetings over the next two days where residents can provide comments and feedback.", "location": "Hawaii island", "classification": "natural-disasters", "score": 0.8174804345921906, "event_breakdown": "Hawaii island is cleaning up from Hurricane Hone, which dumped over a foot of rain on parts of the island. No severe damages were reported, but major roads remain closed and some residents have been without power since Saturday night. The county is hosting two hazard mitigation meetings where residents can provide comments and feedback."}, {"id": "65fc4718-3e7d-4a89-bcd5-b786adc00b4a", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.vernonmorningstar.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "vernonmorningstar.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C.", "location": "BC, Canada", "classification": "natural-disasters", "score": 0.8432459928125497, "event_breakdown": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning."}, {"id": "ab648fc3-31f8-4759-a1ab-f618006cd1ba", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 00:00", "url": "https://www.cloverdalereporter.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "cloverdalereporter.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C.", "location": ".\nBritish Columbia, Canada", "classification": "natural-disasters", "score": 0.8432459928125497, "event_breakdown": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning."}, {"id": "abc96dd5-45f0-414b-af73-597a0d521655", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 01:00", "url": "https://www.clearwatertimes.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "clearwatertimes.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C.", "location": "British Columbia, Canada.", "classification": "natural-disasters", "score": 0.8432459928125497, "event_breakdown": "BC Wildfires, Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nPeacock said the wildfire situation in BC \"still in the core of our wildfire season,\" but firefighters are making the most of reduced fire behaviour and good weather."}, {"id": "a1ea2b51-3a52-40cf-a795-157b9c3bac5c", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.sookenewsmirror.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "sookenewsmirror.com", "domain_classification": "Unknown", "message": "Peacock says the change doesn’t mean the wildfire season is over, and more than 700 firefighters and 100 aircraft are still out fighting fires.\nThe BC Wildfire Service shows that the number of active blazes in the province has fallen to about 295, continuing a downward trend from Friday when there were about 340 fires burning.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nThe wildfire service says more than 10,000 square kilometres of land has been burned in B.C.", "location": "BC (British Columbia), Canada", "classification": "natural-disasters", "score": 0.8432459928125497, "event_breakdown": "BC Wildfires"}, {"id": "3d762ff2-50af-468c-ac70-323bd503d99c", "title": "B . C . lifts last  wildfire of note  designation , as number of blazes drops below 300 - Medicine Hat NewsMedicine Hat News", "date": "2024-08-27 01:30", "url": "https://medicinehatnews.com/news/national-news/2024/08/26/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "lifts last ‘wildfire of note’ designation, as number of blazes drops below 300By The Canadian Press on August 26, 2024.\nWildfire Service, *MANDATORY CREDIT* A view of the Cory Creek wildfire is seen near Witset, B.C., in an Aug. 19, 2024, handout photo.\nWildfire Service, *MANDATORY CREDIT*Share this story:VANCOUVER – There are no longer any “wildfires of note” burning in British Columbia, with the BC Wildfire Service saying favourable weather has allowed crews to make good progress in the province’s battle against hundreds of blazes.\nis “still in the core of our wildfire season,” but firefighters are making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.", "location": "CANADA", "classification": "natural-disasters", "score": 0.7447207398842576, "event_breakdown": "1. Wildfires in British Columbia are no longer considered notable as of August 2024 due to favorable weather conditions and successful firefighting efforts.\n2. In August 2024, the BC Wildfire Service reports there are no fires of note burning in the province.\n3. Firefighters are taking advantage of reduced fire behavior and good weather during the heart of wildfire season in BC."}, {"id": "44d909d3-7d76-487d-b37b-d6de43ca866b", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 06:00", "url": "https://keyt.com/news/2024/08/26/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "Tropical Storm Hurricane\nHawaii\nTropical Storm Hone\nHawaii\nHeat Wave\nMinnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin, Oklahoma"}, {"id": "03e4f17f-dcba-4130-aab3-1c4fab35fb4f", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:30", "url": "https://www.mymotherlode.com/news/national/3414273/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Wild week of US weather includes heat wave, tropical storm, landslide, flash flood and snow View PhotoFALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nDeadly Alaska landslide crashes into homesA landslide that cut a path down a steep, thickly forested hillside crashed into several homes in Ketchikan, Alaska, in the latest such disaster to strike the mountainous region.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "US", "classification": "natural-disasters", "score": 0.9940309412647934, "event_breakdown": "1. A tropical storm, named Nicholas, made landfall in Texas, bringing heavy rain and strong winds. \n2. A series of wildfires are burning across the western United States, causing evacuations and poor air quality. \n3. A landslide killed one person and damaged several homes in Ketchikan, Alaska. \n4. The Grand Canyon National Park had an incident where a flash flood caused the death of a hiker."}, {"id": "3b2250f1-1945-4a16-b77d-e35309708909", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:45", "url": "https://www.bordermail.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=9929", "domain": "bordermail.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": "CANADA", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "List of current events of natural-disasters with locations:\n- A 7.2-magnitude earthquake struck Haiti on August 14, 2021, killing at least 1,900 people and leaving more than 9,900 injured.\n- A 7.2-magnitude earthquake struck Japan's Fukushima Prefecture on February 26, 2021, killing at least 18 people and leaving more than 300 injured.\n- A 6.2-magnitude earthquake struck Mexico's Chiapas State on June 23, 2021, killing at least 6 people and leaving more than 16 injured.\n- A 6.2-magnitude earthquake struck Argentina's Neuquen Province on September 17, 2021, killing at least 3 people and leaving 14 injured.\n- A 6.2-magnitude earthquake struck the Kermadec Islands on February 20, 2021, killing at least one person and leaving 40 injured.\n- A 6.1-magnitude earthquake struck Greece's İzmir Province on October 30, 2020, killing at least 114 people and leaving 1600 injured."}, {"id": "9205fd19-196b-4fd4-a562-3046d6752cd2", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 06:00", "url": "https://www.newcastleherald.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": ")\nAUBURN, IND", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "Natural disasters reported in the news in the current time frame and that have a specific location include:\n- The 2021 Pacific Northwest heat wave\n- The 2022 Southeast Tornado Outbreak\n- The 2022 European floods"}, {"id": "63a31c59-6b48-4d56-81b8-7bf43478f845", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 05:00", "url": "https://www.dailyadvertiser.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/?cs=9622", "domain": "dailyadvertiser.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": "AUBURN, Maine", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "Natural disasters happening now are the volcanic eruption in St. Vincent, the drought in Madagascar, and a tsunami in Tonga."}, {"id": "4e1711a4-4a0b-4652-8e50-e2add8c3bfc0", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:15", "url": "https://www.stalbertgazette.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436655", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "VANCOUVER — There are no longer any \"wildfires of note\" burning in British Columbia, with the BC Wildfire Service saying favourable weather had allowed crews to make good progress in the province's battle against hundreds of blazes.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.", "location": "VANCOUVER", "classification": "natural-disasters", "score": 0.6259048916935787, "event_breakdown": "BC Wildfire Service says BC wildfire situation much improved as number of blazes pushed down"}, {"id": "62d0834e-42c7-4ccf-9f63-98e114cf9da5", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 00:00", "url": "https://www.richmond-news.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.", "location": "B.C.", "classification": "natural-disasters", "score": 0.7792702331937011, "event_breakdown": "BC Wildfire Dashboard of Monday reported about 290 active fires, with many slowly burning. KAMLOOPS UPDATE Evacuation alerts have been reduced to a handful because of progress but fire information officer Emelie Peacock stressed \"the change does not mean the fire season is over\" but news of current activity is needed."}, {"id": "7d7161b5-f37c-4c40-b662-2fd5c6c70614", "title": "B . C . lifts last  wildfire of note  designation as number of blazes drops below 300", "date": "2024-08-27 01:15", "url": "https://www.nsnews.com/national-news/bc-lifts-last-wildfire-of-note-designation-as-number-of-blazes-drops-below-300-9436662", "domain": "nsnews.com", "domain_classification": "Unknown", "message": "But fire information officer Emelie Peacock said the change doesn't mean the wildfire season is over and there are still a handful of evacuation orders and alerts impacting communities around the province.\nThe BC Wildfire Service dashboard on Monday afternoon showed the number of active blazes in the province had fallen to about 290, continuing a downward trend from Friday when there were about 340 fires burning.\nThe wildfire service update said B.C.\nwas \"still in the core of our wildfire season,\" but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.", "location": "CANADA", "classification": "natural-disasters", "score": 0.7792702331937011, "event_breakdown": "BC wildfires activity"}, {"id": "0150bb3b-5ebd-4382-ba60-4dd336d2d7a2", "title": "Red Cross : Weather continuing to take a toll on U . S . blood supplies | News , Sports , Jobs", "date": "2024-08-27 06:45", "url": "https://www.newsandsentinel.com/news/community-news/2024/08/red-cross-weather-continuing-to-take-a-toll-on-u-s-blood-supplies/", "domain": "newsandsentinel.com", "domain_classification": "Unknown", "message": "PARKERSBURG — Severe weather has further strained the blood supply, the American Red Cross said.\nThe Red Cross continues to experience a national blood emergency as remnants of Hurricane Debby and other severe weather across the country have further complicated efforts to rebuild the nation’s blood supply, the agency said.\nAnnually, severe weather such as blizzards, tornadoes, flooding and hurricanes impacts about 90,000 blood donations made to the Red Cross.\nTo make an appointment, download the Red Cross Blood Donor App, visit RedCrossBlood.org or call 1-800-RED CROSS (1-800-733-2767).\nThose who give Sept. 1-15 will receive a Red Cross raglan T-shirt, while supplies last.", "location": "PARKERSBURG", "classification": "natural-disasters", "score": 0.5540450998315191, "event_breakdown": "Severe weather across the country has further strained the blood supply, as remnants of Hurricane Debby continue to complicate efforts to rebuild the nation's blood supply, the American Red Cross said. Annually, severe weather such as blizzards, tornadoes, flooding, and hurricanes impacts about 90,000 blood donations made to the Red Cross. To make an appointment, download the Red Cross Blood Donor App, visit RedCrossBlood.org, or call 1-800-RED CROSS (1-800-733-2767)."}, {"id": "7a922e09-6fbf-4234-b1cc-843f3ff24804", "title": "Storms drop significant amount of hail along South Coast - Boston News , Weather , Sports", "date": "2024-08-27 01:15", "url": "https://whdh.com/news/storms-drop-significant-amount-of-hail-along-south-coast/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(WHDH) - Pop-up thunderstorms that hit parts of southern New England dropped a significant amount of hail on several South Coast communities Monday.\nVideos and photos documented hail falling across the South Coast and Cape Cod.\nThe National Weather Service documented additional flooding in Dennis.\nThe National Weather Service issued several severe thunderstorm warnings and flash flood warnings Monday.\nA larger severe thunderstorm watch was scheduled to remain in effect across much of southern New England until 7 p.m.Stay with 7NEWS on-air and online for the latest updates on severe weather.", "location": "SOUTH COAST", "classification": "natural-disasters", "score": 0.8792948918985477, "event_breakdown": "1. Flash flooding hits different communities in southern New England earlier today.\n2. Flooding in Dennis.\n3. Hail falls in different parts of the state.\n4. The National Weather Service issues several severe thunderstorm warnings."}, {"id": "5d409a7c-1862-4fe8-b9a7-d0ad7c29dca6", "title": "The 2024 hurricane season is not dead : Ryan Phillips – NBC 6 South Florida", "date": "2024-08-27 04:15", "url": "https://www.nbcmiami.com/weather/hurricane-season/the-2024-hurricane-season-is-not-dead-some-reminders-ryan-phillips/3401747/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The 2005 hurricane season was an extreme example of epic atmospheric performance orchestrated, in tandem, with epic fatigue for all who endured it.\nIt was 15 years later that a hurricane season combined the right ingredients to produce more storms (30) with more Gulf Coast landfalls than 2005.\nThe Hurricane season is on.\nBut as it stands, I’m left with a few sturdy reminders to share as we enter the heart of the season.\nA late-August lull has produced doubt about what the second part of hurricane season may look like.", "location": "Gulf of Mexico", "classification": "natural-disasters", "score": 0.7779516590043271, "event_breakdown": "Late August is an excellent time for surplus training, maintenance, and recovery for all skill sets for a particular function or organization for an intense disaster, typically from a hurricane in South Florida.\nHurricane season's second half's upcoming intensity is unsure after the first appearance scare in late August"}, {"id": "6e74dcc6-74db-4a11-a43b-49fb84ede299", "title": "Tropical Storm Hone moves past Hawaii as two other cyclones stay active in the Pacific Ocean | News , Sports , Jobs", "date": "2024-08-27 13:00", "url": "https://www.mauinews.com/news/local-news/2024/08/tropical-storm-hone-moves-past-hawaii-as-two-other-cyclones-stay-active-in-the-pacific-ocean/", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "By JENNIFER SINCO KELLEHER and JULIE WALKER Associated PressHONOLULU (AP) — Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector, which was churning westward, far off the coast of southern tip of Baja California.\n“No major damage that we know of yet,” Big Island Mayor Mitch Roth said.\nFour Big Island schools were closed because of power outages and flooded roads from Hone.\nGilma was located about 1,160 miles (1,865 kilometers) east of Hilo, Hawaii, and moving west at 8 mph (13 mph).\nFarther to the east, Tropical Storm Hector also gained strength Monday.", "location": "Hawaii", "classification": "natural-disasters", "score": 0.9673246680874714, "event_breakdown": "Tropical Storm Hector and Hurricane Gilma are swirling over the Pacific Ocean on Monday. Tropical Storm Hone is bringing heavy rain to Hawaii."}, {"id": "b2325d93-f740-43a9-acd4-c72bb1440d4c", "title": "Hurricane - season fire , power risks garner more attention", "date": "2024-08-27 05:15", "url": "https://www.yahoo.com/news/hurricane-season-fire-power-risks-032153598.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HONOLULU (KHON2) — Top emergency management officials said with this hurricane season, extra attention is on even more threats than before.\nClean-up efforts begin on Hawaii island as Hurricane Hone passes throughLong after Hurricane Hone had passed Hawaii island, and shelters meant to protect from wind, rain and flooding had closed, Hawaii County announced the re-opening of two shelters in parks for one specific reason: power.\nKHON2 asked James Barros, administrator of the Hawaii Emergency Management Agency, about the elevated attention to power outages.\nDOH plans change to ocean water testing during brown water advisories“We do, and we would be looking at our federal partners for assistance during an extended power shutdown,” Barros said.\nSo I’m more worried towards the end of hurricane season than I am at the beginning.”Copyright 2024 Nexstar Media, Inc. All rights reserved.", "location": ".\nHonolulu, Hawaii", "classification": "natural-disasters", "score": 0.8858937171560571, "event_breakdown": "Hurricane Hector, Hurricane John, Hurricane Kristy\nHawaii Emergency Management Agency"}, {"id": "1ed7dd2d-d844-41d4-b4ab-7cf18be54fcc", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 13:00", "url": "https://www.voanews.com/a/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/7758568.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Grand Canyon National Park", "classification": "natural-disasters", "score": 0.992597647343419, "event_breakdown": "Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico."}, {"id": "c53ecb4c-7de9-4e9a-ba58-e079a55da7e7", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 12:15", "url": "https://www.newsday.com/news/nation/us-extreme-weather-glance-l41056", "domain": "newsday.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "FALCON HEIGHTS, Minn.", "classification": "natural-disasters", "score": 0.992597647343419, "event_breakdown": "1. Hurricane Hector: churning westward, far off the southern tip of the Baja California peninsula of Mexico.\n2. Tropical Storm Hone: brought heavy rain to Hawaii.\n3. Flash flood at Grand Canyon National Park: An Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday."}, {"id": "33f4d50e-ec41-4534-9fb9-831434d8a3f3", "title": "Wild weather week includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 13:00", "url": "https://www.yahoo.com/news/wild-weather-week-includes-heat-101206997.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "FALCON HEIGHTS, Minnesota", "classification": "natural-disasters", "score": 0.9939850851256775, "event_breakdown": "1. Heat waves hit large swath of U.S.\nA heat wave spread from Minnesota to Oklahoma, prompting heat warnings or advisories.\n2. Tropical Storm Hone hits Hawaii\nTropical Storm Hone brought heavy rain to Hawaii.\n3. Flash flood hits Grand Canyon National Park\nA flash flood hit Grand Canyon National Park on Sunday. The body of a visitor who disappeared in the storm was recovered.\n4. A tropical depression strikes Mauritius\nA tropical depression struck Mauritius last week, killing several people and causing widespread damage."}, {"id": "09fbd4f4-1622-443d-8c93-ec1c41a355ef", "title": "Americans Grapple With a Wild Week of Weather", "date": "2024-08-27 14:30", "url": "https://time.com/7015078/extreme-weather-us/", "domain": "time.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nHere's a look at some of the weather events:Midwest sizzles under heat waveMillions of people in the Midwest have been enduring dangerous heat and humidity.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "Based on the information provided, the most specific location where the main event took place appears to be \"Grand Canyon National Park.\"", "classification": "natural-disasters", "score": 0.9106467771049123, "event_breakdown": "Midwest heat wave, flash flood at Grand Canyon National Park"}, {"id": "5c73da3f-b546-4803-80de-c11240d4adad", "title": "Storm tracker : National Hurricane Center tracking new disturbance in central Atlantic", "date": "2024-08-27 12:45", "url": "https://www.yahoo.com/news/storm-tracker-national-hurricane-center-121948259.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The National Hurricane Center is tracking a new disturbance in the central Atlantic Ocean, the agency said in its latest advisory.\nThe National Hurricane Center is tracking a new disturbance in the central Atlantic Ocean, the agency said in its latest advisory Tuesday.\nThe storm was moving west at about 8 miles per hour on Monday evening as maximum sustained winds declined to about 100 mph, according to the National Hurricane Center.\nBefore its forecasted gradual weakening, the center said Gilma will likely \"remain a hurricane as it approaches the central Pacific basin.\"\nThis article originally appeared on USA TODAY: National Hurricane Center tracking new disturbance in central Atlantic", "location": "ATLANTIC OCEAN", "classification": "natural-disasters", "score": 0.8092231584349348, "event_breakdown": "National Hurricane Center tracks new disturbance in central Atlantic"}, {"id": "8d5e2ba2-d750-4a87-92d7-f6eef579f85b", "title": "Wild Week of US Weather Includes Heat Wave , Tropical Storm , Landslide , Flash Flood , and Snow", "date": "2024-08-27 13:30", "url": "https://www.theepochtimes.com/us/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow-5713604", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Judah Boyle, of Des Moines, Iowa, splashes water as he runs on the beach at Gray's Lake Park, in Des Moines, Iowa on Aug. 26, 2024.\nJudah Boyle, of Des Moines, Iowa, splashes water as he runs on the beach at Gray's Lake Park, in Des Moines, Iowa on Aug. 26, 2024.\nCharlie Neibergall/AP PhotoFALCON HEIGHTS, Minn.—It’s been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin, and Oklahoma.\nGarrett Lockrem/Mount Bachelor Ski Resort via APTropical Storm Dumps Heavy Rain on Hawaii Three tropical cyclones swirled over the Pacific Ocean on Monday, including Tropical Storm Hone, which brought heavy rain to Hawaii, Hurricane Gilma, which was gaining strength, and Tropical Storm Hector which was churning westward, far off the coast of southern tip of Baja California.", "location": "Des Moines, Iowa", "classification": "natural-disasters", "score": 0.9890382686025099, "event_breakdown": "Tropical Storm Hone brought heavy rain to Hawaii. Hurricane Gilma was gaining strength and Tropical Storm Hector was churning westward, far off the coast of southern tip of Baja California."}, {"id": "98730bca-d0c8-4576-abf9-d5bac8ca27ed", "title": "National Hurricane Center tracking new disturbance in Atlantic . Is quiet period over ? ", "date": "2024-08-27 11:00", "url": "https://www.yahoo.com/news/national-hurricane-center-tracking-disturbance-101618365.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "National Hurricane Center tracking new disturbance in Atlantic.\nThe National Hurricane Center is tracking a new disturbance in the central Atlantic, according to the latest advisory.\nThe Pacific continues to be busy — with the National Hurricane Center currently tracking two tropical storms and one hurricane.\nThe National Hurricane Center was monitoring a tropical disturbance and two tropical waves in the Atlantic basin, according to the 8 a.m. advisory.\nNational Hurricane Center map: What are forecasters watching now?", "location": "The Caribbean", "classification": "natural-disasters", "score": 0.7737440773964784, "event_breakdown": "National Hurricane Center is tracking a new disturbance in the central Atlantic. Other than that, the Pacific is busy. Two tropical storms and a hurricane are being monitored in the National Hurricane Center. In addition, tropical waves are also being watched in the Central Atlantic. Reports elsewhere in the world include the probability of a cyclone in southwestern Bangladesh."}, {"id": "8054856a-ac45-4c93-8b42-852a45b88e7e", "title": "Tsunami Risk Looms Over Yogyakarta Coast After Quake from Megathrust Zone", "date": "2024-08-27 09:45", "url": "https://en.tempo.co/read/1909069/tsunami-risk-looms-over-yogyakarta-coast-after-quake-from-megathrust-zone", "domain": "en.tempo.co", "domain_classification": "Unknown", "message": "TEMPO.CO, Bandung - The 5.8-magnitude earthquake, later updated to 5.5-magnitude, that shook Yogyakarta and other areas on the southern coast of Java on Monday night, August 26, 2024, was caused by the activity of the subduction zone or megathrust zone.\nThe quake’s epicenter, which occurred at 19:57 western Indonesian time (WIB), was closer to Yogyakarta Province compared to other areas.\n“According to data from the Geological Agency, residential areas affected by the tremors are primarily located in the Disaster Prone Area (KRB) for medium to high earthquakes,” he said.\nTsunami Threat of Over 3 MetersHadi explained that the quake did not cause a tsunami despite its origin in the megathrust zone.\nAHMAD FIKRI (CONTRIBUTOR)Editor’s Choice: BMKG: Tonight's Earthquake in Yogyakarta from Megathrust ZoneClick here to get the latest news updates from Tempo on Google News", "location": "Yogyakarta", "classification": "natural-disasters", "score": 0.9587736990311705, "event_breakdown": "The Yogyakarta earthquake from the current time frame can be seen in the map at Yogyakarta, Indonesia."}, {"id": "6439e757-d72a-47ab-be67-fb8f1657132f", "title": "Light earthquake 4 . 5 mag , 60 km S of Kangding , China", "date": "2024-08-27 03:30", "url": "https://www.earthquakenewstoday.com/2024/08/26/light-earthquake-4-5-mag-60-km-s-of-kangding-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Tuesday, 60 kilometers (37 miles) from Kangding in China.\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000nmvn.\nEpicenter of the earthquake was 66 km (41 miles) from Kangding (c. 100 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 60 km S of Kangding, China.", "location": "Kangding", "classification": "natural-disasters", "score": 0.8009226370938911, "event_breakdown": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Tuesday, 60 kilometers (37 miles) from Kangding in China. The earthquake occurred at a depth of 10 km (6 miles). Epicenter of the earthquake was 66 km (41 miles) from Kangding (c. 100 000 pop). Id of earthquake: us6000nmvn."}, {"id": "02397b25-dc4a-47c3-bd31-071e4e77020d", "title": "Rain , cooler weather end campfire ban on Vancouver Island - Victoria Times Colonist", "date": "2024-08-27 04:15", "url": "https://www.timescolonist.com/local-news/rain-and-cooler-weather-bring-end-to-campfire-ban-on-vancouver-island-9437434", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Fire danger ratings across most of Vancouver Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said recent rains and cooler temperatures will allow it to lift the campfire ban on Vancouver Island as of noon on Wednesday.\nFire danger ratings across most of the Island are listed as very low, with some areas on the South Island listed as low.\nWildfire Service said in a statement.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap.", "location": "Vancouver Island", "classification": "natural-disasters", "score": 0.8412464150746182, "event_breakdown": "Fire danger ratings across most of Vancouver Island are listed as very low, with some areas on the South Island listed as low. A campfire ban has been lifted across the island and residents will be allowed to build campfires as of noon on Wednesday. Until recently, a series of rain storms helped reduce the fire danger for the island. During last year's record wildfire season, over 28,000 square kilometres of the island was burned, forcing survivors to evacuate, according to the Wildfire Service."}, {"id": "4ad14dc2-e0ec-4e29-b04e-3642adb24281", "title": "Light earthquake : M4 . 2 quake has struck near Brisas Barra de Suchiate in Mexico", "date": "2024-08-27 12:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-m4-2-quake-has-struck-near-brisas-barra-de-suchiate-in-mexico/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 24 kilometers (15 miles) from Brisas Barra de Suchiate in Mexico on Monday.\nThe earthquake occurred at a depth of 60.637 km (38 miles) below the earth’s surface.\nClose country/countries that might be effected, Guatemala (c. 13 550 000 pop), Mexico (c. 112 469 000 pop).\nNearest city/cities or towns, with min 5000 pop, to epicentrum/hypocenter was Cuyotenango, San Pedro Sacatepéquez, San Andrés Villa Seca.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 24 km WSW of Brisas Barra de Suchiate, Mexico.", "location": ".\nMexico is the location I found.", "classification": "natural-disasters", "score": 0.818135659985721, "event_breakdown": "A news push that reports an event that is happening in the current time frame and belongs to to the category natural-disasters, and not a past event."}, {"id": "35f41078-14c2-465a-abbf-80e423443b8a", "title": "Light earthquake , 4 . 3 mag has occurred near Champerico in Guatemala", "date": "2024-08-27 12:30", "url": "https://www.earthquakenewstoday.com/2024/08/27/light-earthquake-4-3-mag-has-occurred-near-champerico-in-guatemala-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 14 kilometers (9 miles) from Champerico in Guatemala on Tuesday.\nDate and time of earthquake in UTC/GMT: 27/08/24 / 2024-08-27 05:38:48 / August 27, 2024 @ 5:38 am.\nId of earthquake: us6000nn0t.\nCountry/countries that might be effected, Guatemala (c. 13 550 000 pop), Mexico (c. 112 469 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 14 km NW of Champerico, Guatemala.", "location": "answer\nChamperico, Guatemala", "classification": "natural-disasters", "score": 0.8634177392260576, "event_breakdown": "Earthquakes 4.0 to 5.0 are often felt, but only causes minor damage. There are an estimated 13,000 light earthquakes in the world each year. In the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days four earthquakes of magnitude 3.0 or greater that has struck near.\nDid you feel the quake?\nDid objects rattle, topple over, or fall off shelves? Leave a comment or report about activity, shaking and damage at your home, country and city. This information comes from the USGS Earthquake Notification Service. Read more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 14 km NW of Champerico, Guatemala.\nCopyright © 2022 earthquakenewstoday.com All rights reserved."}, {"id": "17cb48f7-aaf9-4c21-81ec-2d960cf9e41b", "title": "UK Hurricane warning : Expert says  big beast  to hit Britain | Weather | News", "date": "2024-08-27 13:30", "url": "https://www.express.co.uk/news/weather/1940940/uk-hurricane-warning-storm-lilian-met-office", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The dissipation of dry sandy air off the Sahara could have implications for the UK, said Jim DaleThere are rising expectations of a “huge up-step” in the hurricane season next month, with a meteorologist warning a “big beast” could lash the UK within days.\nJim Dale, of British Weather Services, was speaking days after Storm Lilian barrelled over Britain, downing trees and causing significant travel disruption.\nAnd he suggested more is in the pipeline once autumn arrives, telling Express.co.uk: \"There’s rising expectations of a huge up-step in the hurricane season as we head into September and October.\n“Six to eight big beasts are not out of the question, with some akin to the first two eventually heading our way.\nWe've had heavy rain in the north of the UK through this morning ?", "location": "UK", "classification": "natural-disasters", "score": 0.8086678380609487, "event_breakdown": "Heavy rain in the north of the UK."}, {"id": "e67b49f5-0133-4380-a36c-7fb6a88607e5", "title": "TROPICS : A new area of possible development in the Atlantic", "date": "2024-08-27 14:30", "url": "https://www.wptv.com/weather/tropical-weather/a-new-area-of-possible-development-in-the-atlantic", "domain": "wptv.com", "domain_classification": "Unknown", "message": "WEST PALM BEACH, Fla. — The National Hurricane Center on Tuesday is watching a new area of unsettled weather in the central Atlantic for possible development.\nA tropical wave will approach the Lesser Antilles as we get closer to the weekend or early next week.\nThis wave may become a tropical depression or storm.\nWPTVTRACKING THE TROPICS: Hurricane Center | Hurricane GuideFor now, it has a 20% chance of development.\nWe have plenty of time to track it,\" WPTV First Alert Weather meteorologist Jennifer Correa said.", "location": "Based on the text, the most specific location where the main event takes place is 'the Lesser Antilles'.", "classification": "natural-disasters", "score": 0.8805337878846091, "event_breakdown": "Hurricane Larry, Tropical Storm Mindy\nNational Hurricane Center is watching a new troubled weather area in central Atlantic that may become tropical depression or storm by weekend or early next week\nWeather monitoring of unnamed storm system"}, {"id": "eb92a65a-6b04-422b-818f-2f0cc855fca8", "title": "Wilton in  recovery  after  100 - year flood  damages roads , fields", "date": "2024-08-27 11:15", "url": "http://www.thehour.com/news/article/wilton-rain-flood-recovery-mode-19723951.php", "domain": "thehour.com", "domain_classification": "Unknown", "message": "The floodwaters carried debris throughout the town, depositing large amounts of dirt on the high school’s track at Tom Fujitani Field, flooding town fields, and washing out ponds, officials said.\nOne of the more lasting impacts of the storm and flooding is the closure of Scribner Hill Road, Blanchfield said.\nThe road is closed between Blue Ridge Road and “just before” Rockhouse Road, Blanchfield said.\nThe town’s emergency response team, comprising police, fire, and the first selectwoman, have been meeting daily to assess damage and further plan, Blanchfield said.\nRegardless, the town’s teams will likely conduct door-to-door damage assessments in the Newtown Turnpike and Arrowhead areas of Wilton, he said.", "location": "'\nTom Fujitani Field", "classification": "natural-disasters", "score": 0.4218965341374289, "event_breakdown": "['Wilton, CT, Heavy flooding hit the town on June 30, damaging several roads, including Scribner Hill Road, and forcing officials to close it indefinitely.']"}, {"id": "3b888e96-1ec0-4b70-a56c-f227a14f3fbb", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.mapleridgenews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "mapleridgenews.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap.", "location": "BC, Canada", "classification": "natural-disasters", "score": 0.9436323057090777, "event_breakdown": "B.C. wildfire crews continue to make progress against the blaze that started late last month, burning through 4.5 square kilometers of forest."}, {"id": "b81ffe50-19dc-42d6-aa8c-5c222aa32986", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.westerlynews.ca/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "westerlynews.ca", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap.", "location": "B.C.", "classification": "natural-disasters", "score": 0.9436323057090777, "event_breakdown": "BC, Canada - The wildfire service update said BC was “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nBC, Canada - In last year’s record wildfire season, more than 28,000 square kilometers of land was burned, forcing the evacuation of communities in regions such as the Okanagan and the Shuswap."}, {"id": "e8b525fe-4283-4df5-b9c1-4bcc4e01cdc1", "title": "As B . C . last  wildfire of note  vacates the danger zone , battle not over yet", "date": "2024-08-27 02:00", "url": "https://www.kelownacapnews.com/news/as-bcs-last-wildfire-of-note-vacates-the-danger-zone-battle-not-over-yet-7504570", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions.\nThe wildfire service update said B.C.\nwas “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather.\nThe wildfire service said earlier that while much of the southern part of B.C.\nIn last year’s record wildfire season, more than 28,000 square kilometres of land was burned, forcing the evacuations of communities in regions such as the Okanagan and the Shuswap.", "location": "BRITISH COLUMBIA", "classification": "natural-disasters", "score": 0.9436323057090777, "event_breakdown": "Peacock said southern parts of the province saw heavy rain recently, but parts of the north continue to experience drought conditions. The wildfire service update said B.C. was “still in the core of our wildfire season,” but firefighters were making the most of reduced fire behaviour and good weather."}, {"id": "aa359dc6-7ffa-4389-9588-8a5affa691ec", "title": "Severe storm threat in forecast for Chicago area this week – NBC Chicago", "date": "2024-08-27 02:30", "url": "https://www.nbcchicago.com/news/local/severe-storm-threat-could-bring-heavy-rain-damaging-winds-to-chicago-area/3532611/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area is going to see near-record heat and oppressive humidity on Tuesday, but the threat of severe weather also exists, with gusty winds and heavy rain possible.\nAccording to the Storm Prediction Center, the Chicago area is at a “slight” risk of severe weather Tuesday, with wind gusts up to 60 miles per hour and heavy rains possible.\nThose readings could threaten records in Chicago, but more importantly could cause heat indices of 110-to-115 degrees across the area.\nThe threat of rain will continue into Wednesday, with isolated showers and thunderstorms possible throughout the day.\nStay tuned to the NBC Chicago app and the NBC 5 Storm Team for all the latest weather news and information.", "location": "CHICAGO", "classification": "natural-disasters", "score": 0.9539857717775204, "event_breakdown": "1.Severe weather to hit the Chicago area.\n2.Severe weather and high winds expected Tuesday in Chicago. \n3.Extreme heat to descend on Chicago again today with severe storms possible. Alternatively, \n4.Severe heat and risk of severe weather Tuesday in Chicago."}, {"id": "1e64ad58-91dc-4925-9e57-6de3ed0bb5e0", "title": "Wild week of US weather includes heat wave , tropical storm , landslide , flash flood and snow", "date": "2024-08-27 05:30", "url": "https://www.2news.com/news/national/wild-week-of-us-weather-includes-heat-wave-tropical-storm-landslide-flash-flood-and-snow/article_ecadb655-5c80-5d03-a565-105ba77d5096.html", "domain": "2news.com", "domain_classification": "Unknown", "message": "FALCON HEIGHTS, Minn. (AP) — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.\nThe National Weather Service issued heat warnings or advisories across Minnesota, Iowa, South Dakota, Illinois, Kansas, Missouri, Nebraska, Wisconsin and Oklahoma.\nTropical storm dumps heavy rain on HawaiiThree tropical cyclones swirled over the Pacific Ocean on Tuesday, including Tropical Storm Hone, which brought heavy rain to Hawaii; Hurricane Gilma, which was weakening; and Tropical Storm Hector, which was churning westward, far off the southern tip of the Baja California peninsula of Mexico.\nFlash flood hits Grand Canyon National ParkThe body of an Arizona woman who disappeared in Grand Canyon National Park after a flash flood was recovered Sunday, park rangers said.\nNickerson was hiking along Havasu Creek about a half-mile (800 meters) from where it meets up with the Colorado River when the flash flood struck.", "location": "FALCON HEIGHTS, Minnesota", "classification": "natural-disasters", "score": 0.992597647343419, "event_breakdown": "Tropical Storm Rosa dumps rain on Mexico\nHeat wave bakes central, eastern U.S.\nFlash flood hits Grand Canyon National Park\nThree tropical cyclones swirl in Pacific"}, {"id": "87d9a1df-4c10-48e8-82fd-36a46e2d195b", "title": "National Hurricane Center Monitoring Tropical Wave in Atlantic", "date": "2024-08-27 14:15", "url": "https://999ktdy.com/national-hurricane-center-monitoring-tropical-wave-in-atlantic/", "domain": "999ktdy.com", "domain_classification": "Unknown", "message": "The Gulf Coast is bracing for the peak of hurricane season and now the National Hurricane Center is monitoring an area of disturbed weather.\nWe will continue to monitor this tropical wave and provide more updates here and on this station's mobile app in the days ahead.\nMeteorologists predict that the Atlantic will become more active in the weeks ahead as this hurricane season was predicted to be one of the most active in modern history.\nSo far, the season has been tame, but again, we are approaching the peak of hurricane season as we enter the month of September.\nHurricane season officially ends on November 30th.", "location": "The Gulf Coast of the United States.", "classification": "natural-disasters", "score": 0.8607513989616417, "event_breakdown": "The Gulf Coast is bracing for the peak of hurricane season. There is no specific event to map for this time frame."}, {"id": "4e275353-de0b-4732-88a8-2ae644f5241f", "title": "NZ Peters downplays human - made climate change at PIF", "date": "2024-08-27 04:30", "url": "https://www.westernadvocate.com.au/story/8743897/nzs-peters-downplays-human-made-climate-change-at-pif/", "domain": "westernadvocate.com.au", "domain_classification": "Unknown", "message": "\"If we're going to help anyone with all the other tsunamis coming their way, such as the health tsunami, food supply tsunami, employment and economic tsunami ... we need to have a sound economy ourselves,\" he said.", "location": "Georgia", "classification": "natural-disasters", "score": 0.48236800634358445, "event_breakdown": "Natural disaster: A  6.2 magnitude earthquake struck off the coast of Alaska on Wednesday, according to the US Geological Survey. The quake was centered about 55 miles west of Sand Point, Alaska, and around 480 miles northeast of Anchorage. The earthquake was reportedly felt across the Alaska Peninsula and into parts of southwest Alaska. There were no immediate reports of damage or injury."}, {"id": "c96c133d-a421-4736-a9e8-b79e6b081da6", "title": "Thailand Braces For More Rain After Floods , Landslide Killed 22", "date": "2024-08-27 13:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219846/Thailand-Braces-For-More-Rain-After-Floods,-Landslide-Killed-22", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(PHOTO / AFP)Thailand is bracing for more tropical rainstorms after 22 people died in flash floods and landslides over the past week.\nThe flooding has affected more than 33,000 households in 13 provinces since Aug. 16, killing nine people, the Department of Disaster Prevention and Mitigation said in a statement Tuesday.\nWhile floods have receded from their peak, about 10,000 households in four provinces remain affected.\nA tropical depression is expected to strengthen through Wednesday, bringing more rain to northern, northeastern and southern provinces, the disaster mitigation agency said.\nThe government hasn’t provided information on the cost of damage to farm output nor to infrastructure from this month’s calamity.", "location": "Thailand", "classification": "natural-disasters", "score": 0.9282412584879035, "event_breakdown": "Thailand floods\n\nThailand is bracing for more tropical rainstorms after 22 people died in flash floods and landslides over the past week."}, {"id": "880630da-dd85-4461-92ea-0a49251dac93", "title": "TROPICS : A new area of possible development in the Atlantic", "date": "2024-08-27 14:00", "url": "https://www.wflx.com/2024/08/27/new-area-possible-development-atlantic/", "domain": "wflx.com", "domain_classification": "Unknown", "message": "The National Hurricane Center on Tuesday is watching a new area of unsettled weather in the central Atlantic for possible development.\nA tropical wave will approach the Lesser Antilles as we get closer to the weekend or early next week.\nThis wave may become a tropical depression or storm.\n46419671-WPTV_Tropical Outlook-Auto.pngTRACKING THE TROPICS: Hurricane Center | Hurricane GuideFor now, it has a 20% chance of development.\nWe have plenty of time to track it,\" WPTV First Alert Weather meteorologist Jennifer Correa said.", "location": "Lesser Antilles.", "classification": "natural-disasters", "score": 0.8684666789625451, "event_breakdown": "The National Hurricane Center on Tuesday is watching a new area of unsettled weather in the central Atlantic for possible development.\nA tropical wave will approach the Lesser Antilles as we get closer to the weekend or early next week.\nThis wave may become a tropical depression or storm.\n46419671-WPTV_Tropical Outlook-Auto.png\nTRACKING THE TROPICS: Hurricane Center | Hurricane Guide\n\nFor now, it has a 20% chance of development.\nWe have plenty of time to track it,\" WPTV First Alert Weather meteorologist Jennifer Correa said."}, {"id": "e135031c-39fd-48df-9c48-92746ef485fe", "title": "Crabs , stingrays & fish dying in Little Sarasota Bay after Hurricane Debby", "date": "2024-08-27 03:30", "url": "https://www.yahoo.com/news/crabs-stingrays-fish-dying-little-003336036.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SARASOTA, Fla. (WFLA) — Hurricane Debby dropped massive amounts of rain on Sarasota County, inundating some neighborhoods with feet of water.\nSarasota Bay Estuary Program Director Dr. David Tomasko said samples collected in Lower Sarasota Bay show run-off from the storm is impacting water quality in the area weeks later.\nNHC monitoring potential tropical disturbance in AtlanticLast week, sampling conducting in Little Sarasota Bay found low to virtually no oxygen on the sea floor.\nTomasko said restoring the historic tidal connection would help flush pollutants out of Sarasota Bay after storms like Debby.\nWhat we have seen in Little Sarasota Bay is the same thing we saw after Hurricane Ian and our water quality in Little Sarasota Bay is the worst part, even though it doesn’t get the greatest amount of runoff in the area.”The estuary program will be back out later this week to collect additional samples in lower Sarasota Bay.", "location": "Sarasota County, Florida", "classification": "natural-disasters", "score": 0.8222092793519453, "event_breakdown": "1. Hurricane Debby dropped massive amounts of rain on Sarasota County, inundating some neighborhoods with feet of water.\n2. Sarasota Bay Estuary Program Director Dr. David Tomasko said samples collected in Lower Sarasota Bay show run-off from the storm is impacting water quality in the area weeks later.\n3. Last week, sampling conducting in Little Sarasota Bay found low to virtually no oxygen on the sea floor.\n4. Tomasko said restoring the historic tidal connection would help flush pollutants out of Sarasota Bay after storms like Debby."}, {"id": "c60c21b3-1387-47f3-87c3-de811e608908", "title": "How the Havasupai Tribe warns of flooding during monsoon season", "date": "2024-08-27 02:30", "url": "https://www.azfamily.com/2024/08/27/how-havasupai-tribe-warns-flooding-during-monsoon-season/", "domain": "azfamily.com", "domain_classification": "Unknown", "message": "“We had multiple thunderstorms across the area, multiple warnings issued both Wednesday and again on Thursday,” said National Weather Service Flagstaff Meteorologist-In-Charge Brian Klimowski.\nGiven its location and limited access to cell service, the Havasupai Tribe says it does not have a warning system in place.\nAnd that’s really what we rely on most heavily when something like this occurs,” said Havasupai Tribe Spokesperson Abbie Fink.\nLast week’s monsoon was not the first time this area dealt with flooding.\nKlimowski says it’s important to have an escape plan before hiking in a canyon or an area prone to flooding.", "location": "The main event takes place in Supai, Arizona.", "classification": "natural-disasters", "score": 0.5914842208299248, "event_breakdown": "Havasupai tribal leaders are calling for better notifications to residents about potential flash flooding."}, {"id": "c6d6b7ed-2f2d-4304-a4dd-f2d6f415a299", "title": "Suffolk County eyes FEMA funds to repair trail of storm damage", "date": "2024-08-27 03:00", "url": "https://www.newsday.com/long-island/suffolk/fema-suffolk-county-storm-emergency-declaration-otf0boh8", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Suffolk County officials said the dam would have to be replaced, joining a list of homes, roads and other facilities damaged by the record rainfall.\n“What we're facing is an ecological, an environmental, and an economic disaster,” Suffolk County Executive Edward P. Romaine told Newsday on Monday.\nWhat to know Suffolk County officials are eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nare eyeing federal emergency funds to repair or replace infrastructure damaged during last week's storms.\nSign up for the Suffolk news this week newsletter The biggest news, politics and crime stories in Suffolk County, in your inbox every Friday at noon.", "location": "Long Island, New York", "classification": "natural-disasters", "score": 0.5284924634028616, "event_breakdown": "The following current events of natural-disasters reported in text that can be placed on a map are:\nSuffolk County officials are looking to repair or replace infrastructure damaged by last week's storms."}]