[{"id": "2014fe88-659f-481a-914b-d9e0556d6917", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\"", "location": "Moscow, Russia", "classification": "security", "score": 0.7431922073966853, "event_breakdown": "- Iranian Defense Minister Mohammad Reza Ashtiani accuses Western countries, especially the United States, of supporting terrorist groups\n- Recent terrorist attacks in Iran and Russia are mentioned\n- Russia and Iran have been targeted by ISIS attacks\n- Explosion in Kerman, Iran, orchestrated by ISIS in January, resulted in close to 100 casualties\n- Smoke rises above the burning Crocus City Hall concert venue following a reported shooting incident outside Moscow, Russia\n- Anonymous Israeli official claims responsibility for eliminating individuals behind attacks on Israeli and American assets"}, {"id": "8d94cb9d-700b-496e-be6d-368e66a0ed55", "title": "Nato chief chides members as Ukraine allies say slow arms deliveries have helped Russia", "date": "2024-04-29 22:15", "url": "https://www.scmp.com/news/world/europe/article/3260842/nato-chief-chides-members-ukraines-allies-say-slow-arms-deliveries-have-helped-russia", "message": "Outgunned, Ukraine’s troops have struggled to fend off Russian advances on the battlefield.\n“Serious delays in support have meant serious consequences on the battlefield” for Ukraine, Nato Secretary General Jens Stoltenberg told a news conference in Kyiv with Ukrainian President Volodymyr Zelensky.\nDrawn-out Ukrainian efforts to mobilise more troops, and the belated building of battlefield fortifications, are other factors undermining Ukraine’s war effort, military analysts say.\nThe Russian military is in a better position at the moment.\n“Russian forces remain unlikely to achieve a deeper operationally significant penetration in the area in the near term,” the Institute for the Study of War said in an assessment Sunday.", "location": "Kyiv", "classification": "world", "score": 0.5866176253955832, "event_breakdown": "- Ukrainian troops struggling to fend off Russian advances on the battlefield\n- Nato Secretary General Jens Stoltenberg highlighting serious delays in support for Ukraine\n- Ukrainian efforts to mobilize more troops and build battlefield fortifications facing challenges\n- Russian military in a better position currently\n- Assessment by the Institute for the Study of War stating Russian forces are unlikely to achieve significant penetration in the near term"}, {"id": "6a4bb49d-8ebc-42f2-858d-6adcc4a8183b", "title": "India is drawing lessons from Ukraine to counter China military might", "date": "2024-04-30 06:15", "url": "https://www.businessinsider.in/international/news/india-is-drawing-lessons-from-ukraine-to-counter-chinas-military-might/articleshow/109704444.cms", "message": "India is trying to modernize its military of 1.5 million people with lessons from Ukraine.\nAdvertisementAs India boosts defense spending amid tensions with China and Pakistan, it is closely studying the Ukraine conflict for clues to the future of warfare and how to thwart its neighbors.\nSome lessons that Indian experts have already drawn: India needs lots of artillery, drones and cyberwarfare capabilities.\nDrones have become the stars and workhorses of the air war, with both sides deploying — and losing — drones in the hundreds of thousands.\nThere are lessons here for Indian airpower, according to Arjun Subramaniam, a retired Indian Air Force air vice marshal who helped write the ORF report.", "location": "Ukraine", "classification": "world", "score": 0.3684869323340363, "event_breakdown": "- India studies Ukraine conflict for modernizing its military, drawing lessons for future warfare.\n- Indian experts emphasize need for artillery, drones, and cyberwarfare capabilities based on lessons from Ukraine conflict.\n- Drones play significant role in air war, with both sides deploying and losing hundreds of thousands of drones.\n- Retired Indian Air Force air vice marshal highlights lessons for Indian airpower from Ukraine conflict."}, {"id": "c520ab0c-ea91-4487-b7a0-e6cbc594d9a9", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "northern Gaza", "classification": "security", "score": 0.9755571757962365, "event_breakdown": "- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in northern Gaza.\n- Troops identified terrorists at the launch location and eliminated them.\n- Two terrorists were identified advancing towards troops in central Gaza.\n- Fighter jets struck the structure, eliminating one terrorist.\n- Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam in southern Lebanon."}, {"id": "78ff99ad-be20-4de7-aa9f-533be61aa547", "title": "Ukraine updates : Russia strikes Odesa for 2nd time this week – DW – 05 / 01 / 2024", "date": "2024-05-01 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-2nd-time-this-week/a-68967110", "message": "Russia has pummeled the vital port city of Odesa, stepping up aerial attacks that have also damaged civilian infrastructure there, according to Ukrainian officials.\nAt least three people were killed and three more injured in a Russian missile strike on the Ukrainian city of Odesa in the early hours of Wednesday morning, local authorities said.\nAs a consequence of the attack, three people were killed and three more wounded,\" wrote Gennadiy Trukhanov, the mayor of the southwestern port city, on Telegram.\nThe attack comes just two days after Russian missiles struck an educational institution in the city, killing five people.\nAccording to Shmyhal, Ukraine had previously earmarked 43.3 billion hryvnia for the purchase of drones this year.", "location": "Odesa", "classification": "security", "score": 0.8820837055918667, "event_breakdown": "1. Russian aerial attacks on Odesa, Ukraine, damaging civilian infrastructure\n2. Russian missile strike in Odesa resulting in three deaths and three injuries\n3. Previous Russian missile strike killing five people at an educational institution in Odesa"}, {"id": "82c41514-cc22-4a71-94ac-b8381b288c50", "title": "Israel Strikes Hamas Rocket Launchers , Tunnel Shafts , Hezbollah Infrastructure | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 22 Nisan 5784 – Tuesday , April 30 , 2024", "date": "2024-04-30 09:00", "url": "https://www.jewishpress.com/news/israel/idf/israel-strikes-hamas-rocket-launchers-tunnel-shafts-hezbollah-infrastructure/2024/04/30/", "message": "Photo Credit: IDFIsraeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post and Hamas terror infrastructure in northern and central Gaza, the Israel Defense Forces said on Tuesday morning.\nShortly afterward, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "Gaza", "classification": "security", "score": 0.9506154745941572, "event_breakdown": "1. Israeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and Hamas terror infrastructure in northern and central Gaza.\n2. Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in northern Gaza from where the launch was identified.\n3. Troops identified numerous terrorists at the launch location and fighter jets eliminated them.\n4. Fighter jets struck a structure, eliminating the terrorist.\n5. Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam areas in southern Lebanon."}, {"id": "a3a2fd11-387b-41d3-b7c6-93d3646b42e1", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "location": "Mogadishu, Somalia", "classification": "security", "score": 0.5268761109185044, "event_breakdown": "- Mogadishu, Somalia: Six employees of Hormuud Telecom killed in a roadside blast\n- Government describes attack as deliberate targeting against commercial companies\n- Previous explosions targeted company branches and vehicles\n- Hormuud Telecom expresses condolences to families and friends of victims\n- Investigation ongoing, families and community mourn the loss of colleagues"}, {"id": "5349f71d-d9ec-49a6-a4d3-9da3dffb8c09", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9537699385755353, "event_breakdown": "- Israeli airstrike kills 22 people, including at least one infant and a toddler, in Rafah, Gaza overnight into Monday. \n- Mahmoud Abu Taha displays the body of a baby boy, stating \"this is who they are targeting\" in a video. \n- Another member of the Abu Taha family reports that 10 relatives were killed in the airstrike."}, {"id": "879c8d8d-aa84-409e-9614-effe0edd2a19", "title": "Sydney church stabbing : Teen alleged terrorism texts , claims he wanted to  kill non believers  ", "date": "2024-04-30 10:30", "url": "https://www.nzherald.co.nz/world/sydney-church-stabbing-teens-alleged-terrorism-texts-claims-he-wanted-to-kill-non-believers/OUECF7DEZNDHHKQVO2BCBQEPDU/", "message": "A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences following the Sydney church stabbing allegedly sent text messages declaring he was “going to kill non-believers” before the attack was carried out by an alleged associate.\nHis alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.", "location": "The main location where the main event takes place is Sydney, Australia.", "classification": "security", "score": 0.4260738952908896, "event_breakdown": "- A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\n- His alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants."}, {"id": "6fa95e50-c990-42e8-a972-bbbbf1cb3d77", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA, Ukraine", "classification": "security", "score": 0.47245463261582726, "event_breakdown": "- Russian missile attack targets educational institution in Odesa's seafront park, killing five and injuring 32.\n- Roof of private law academy in Odesa destroyed in strike.\n- Odesa Mayor Hennadii Trukhanov expresses shock in Telegram video following the attack.\n- Odesa continues to face frequent Russian missile and drone attacks, with port infrastructure being a particular target."}, {"id": "393a8536-ddac-4b41-a6a2-e1b843fd21d8", "title": "Wakeley church stabbing : Teens allegedly discussed bombs , guns in group chats", "date": "2024-04-30 07:30", "url": "https://www.brisbanetimes.com.au/national/nsw/we-re-gonna-kill-teens-allegedly-discussed-bombs-guns-in-groups-chats-20240430-p5fnrv.html", "message": "A group of teenagers discussed carrying out a terrorism attack and a desire to kill before they were arrested in anti-terrorism raids last Wednesday, a court has heard.\nThe conversations took place in group chats after the alleged stabbing of Bishop Mar Mari Emmanuel during a live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15.\nThe father of a teenager accused of stabbing a priest in a Wakeley church leaves Parramatta Children’s Court.\nCredit: Janie BarrettNine days later, anti-terrorism police raided a dozen south-west suburbs and have arrested six young people, including a 16-year-old boy, who was charged with conspiring to prepare or plan for a terrorist act.\nThat 16-year-old has been in custody since his arrest a week ago and was refused bail at Parramatta Local Court on Tuesday by Magistrate Janet Wahlquist.", "location": "Parramatta, New South Wales", "classification": "world", "score": 0.4096534934535242, "event_breakdown": "- Group of teenagers discussing carrying out a terrorism attack and expressing desire to kill\n- Alleged stabbing of Bishop Mar Mari Emmanuel during live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15\n- Father of teenager accused of stabbing a priest leaving Parramatta Children's Court\n- Anti-terrorism police raiding a dozen south-west suburbs and arresting six young people, including a 16-year-old charged with conspiring to prepare or plan for a terrorist act\n- 16-year-old suspect being in custody since arrest a week ago and denied bail at Parramatta Local Court by Magistrate Janet Wahlquist"}, {"id": "63acf6ae-2e09-4c07-8afa-ceea6cf68423", "title": "Missile attack by Yemen Houthi rebels damages a ship in Red Sea", "date": "2024-05-01 06:15", "url": "https://www.sunstar.com.ph/network/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-red-sea", "message": "JERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, April 29, 2024, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Bab el-Mandeb Strait", "classification": "security", "score": 0.5488933144612118, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea on Monday, April 29, 2024\n- Italian frigate Virgino Fasan shoots down a Houthi drone near the Bab el-Mandeb Strait on Monday\n- US military shoots down five drones in the Red Sea on early Sunday morning"}, {"id": "ede69a55-9fd3-458e-8b95-cd40d6be9838", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5068969617636545, "event_breakdown": "1. Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea on Monday\n2. Italian frigate shoots down Houthi drone near Bab el-Mandeb Strait on Monday\n3. Decline in shipping through the Red Sea and Gulf of Aden due to security threat\n4. US military shoots down five drones over the Red Sea on Sunday"}, {"id": "9cf5a169-7c1e-47cb-b946-97aebd5d8cbf", "title": "World News : Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 12:45", "url": "http://www.gdnonline.com/Details/1311004", "message": "ODESA, Ukraine - A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy's president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA", "classification": "world", "score": 0.451879256815849, "event_breakdown": "1. Russian missile attack on an educational institution in Odesa, Ukraine.\n2. The attack killed at least five people and injured 32.\n3. The incident took place in a popular seafront park in Odesa.\n4. The targeted building was a private law academy with its roof destroyed.\n5. Odesa Mayor Hennadii Trukhanov expressed shock over the attack.\n6. The academy's president, Serhiy Kivalov, was among the injured.\n7. Odesa has been a frequent target of Russian missile and drone attacks, particularly on port infrastructure."}, {"id": "30b91bce-b00d-468e-af4e-9bcec9abf019", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5457119768814919, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- U.S. military shoots down five drones over the Red Sea"}, {"id": "58b77efe-e72b-4d1b-8fad-17d888e6b9cf", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group.", "location": "Mokha, Yemen", "classification": "security", "score": 0.8422909504198774, "event_breakdown": "- Houthi rebels in Yemen attacked two US destroyers and two vessels in the Red Sea with drone strikes off the coast of Mokha, Yemen.\n- The attack caused damage to one of the ships, but the crew was reported safe and heading to its next port of call.\n- The United Kingdom Maritime Trade Operations center issued a warning for vessels to exercise caution in the area.\n- The Houthis did not immediately acknowledge the attack, leading to suspicion that they were responsible."}, {"id": "d49d842e-ae20-4a35-a0ca-563b604ac06a", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "ODESA", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- A Russian missile strike in the Ukrainian port city of Odesa killed five people and injured 32 others.\n- Russia claimed to have shot down six U.S.-supplied long-range missiles (ATACMS).\n- Uncertainty about the number of ATACMS missiles provided to Ukraine.\n- Submunitions from the undetonated ATACMS missiles scattered in the area, posing a danger to civilians.\n- The U.S.-provided Army Tactical Missile System (ATACMS) was used to strike targets in Russian-occupied territory."}, {"id": "1bd57e11-4ec2-4d3a-8ee0-80ba83b80394", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.46026327135311396, "event_breakdown": "- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea\n- The UKMTO reported that the ship was damaged but its crew was safe\n- The Italian frigate Virgino Fasan shot down a Houthi drone near the Bab el-Mandeb Strait\n- Shipping through the Red Sea and Gulf of Aden has declined due to the threat\n- The US military shot down five drones over the Red Sea"}, {"id": "2204ed36-7fc5-4f34-a766-83d5ce0adfe2", "title": "Three killed as Russia attacks Odesa with ballistic missiles for the second day in a row", "date": "2024-05-01 09:30", "url": "https://www.yahoo.com/news/three-killed-russia-attacks-odesa-081400948.html", "message": "Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30, Odesa Governor Oleh Kiper said.\n\"Three people died in Odesa,” said Presidential Office head, Andriy Yermak, on the morning of May 1.\n“Ballistic missiles hit a large, peaceful city at night.\nResidential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET.\n\"Russia is launching ballistic missiles against us for the second day in a row.”He urged civilians to pay attention to air raid alarms and stay in shelters.", "location": "Odesa", "classification": "security", "score": 0.9820033226101117, "event_breakdown": "- Russian strike targets residential buildings in Odesa, killing three and injuring three others.\n- Odesa Governor Oleh Kiper confirms casualties from Russian ballistic missile attack.\n- Odesa Mayor Hennadyi Trukhanov reports damage to residential buildings, with shattered windows and doors.\n- Odesa Mayor warns of second consecutive day of Russian ballistic missile attacks and urges civilians to seek shelter."}, {"id": "fa2fef49-662d-42e5-b9f4-0c1a79f09c55", "title": "Russian missile kills three in Ukrainian port of Odesa", "date": "2024-05-01 00:45", "url": "https://www.devdiscourse.com/article/law-order/2923457-russian-missile-kills-three-in-ukrainian-port-of-odesa", "message": "A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa early on Wednesday, regional Governor Oleh Kiper said.\nHe said the strike was carried out by a ballistic missile, but provided no further details.\nKiper and Odesa Mayor Hennadii Trukhanov had reported a series of loud explosions.\nOn Monday, a Russian missile struck an educational institution in the city, killing five people.\nOdesa has been a frequent target of Russian forces in the more than two-year-old war, with many attacks aimed at the city's port facilities.", "location": "Odesa, Ukraine.", "classification": "security", "score": 0.9427670113474113, "event_breakdown": "- Russian missile attack in Odesa kills three and injures three.\n- Regional Governor Oleh Kiper confirms strike by ballistic missile.\n- Prior reports of loud explosions by Kiper and Odesa Mayor Hennadii Trukhanov.\n- Earlier attack on Monday targeted educational institution, resulting in five deaths.\n- Russian missile attack in Odesa kills three and injures three\n- Odesa Governor and Mayor report series of loud explosions in the city\n- Russian missile strikes educational institution in Odesa, killing five people"}, {"id": "db234987-aef5-4ec0-9632-b3b82d5d8cff", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5358856195628724, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damages a ship in the Red Sea on Monday.\n- Italian frigate Virgino Fasan shoots down a Houthi drone near the Bab el-Mandeb Strait on Monday morning.\n- U.S. military shoots down five drones over the Red Sea on Sunday morning.\n- Shipping through the Red Sea and Gulf of Aden has declined due to threats."}, {"id": "aff5b1c2-0911-44db-8a63-70e46cfbe34b", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.nola.com/ap/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_428d0b4e-4be8-5026-992d-ae8f7ea21c23.html", "message": "Likely missile attack by Yemen's Houthi rebels damages a ship in the Red SeaA suspected missile attack by Yemen’s Houthi rebels targeted a ship in the Red Sea, the latest assault in their campaign against international shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.9414326694106652, "event_breakdown": "- Likely missile attack by Yemen's Houthi rebels damages a ship in the Red Sea"}, {"id": "bf667703-d9dd-4eeb-b5d7-00d2661753f4", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "ODESA", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- Ukrainian port city of Odesa declares a day of mourning after a Russian missile strike kills five people and injures 32 others.\n- Russia claims to have shot down six U.S.-supplied long-range ATACMS missiles.\n- Uncertainty regarding the number of ATACMS missiles Ukraine possesses.\n- Warning issued for civilians to avoid approaching or touching undetonated submunitions scattered after the ATACMS missiles were shot down.\n- The U.S.-provided Army Tactical Missile System (ATACMS) has been used to strike targets in Russian-occupied territory."}, {"id": "c5e7cde5-ddb1-4569-bdb6-dd2d087d5316", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-30 14:30", "url": "https://www.egyptindependent.com/my-whole-family-has-perished-22-killed-in-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza CNN —Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAbed Rahim Khatib/Anadolu/Getty ImagesAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8828711026621543, "event_breakdown": "- Israeli airstrike kills 22 people, including an infant and toddler, in Rafah, Gaza\n- Mahmoud Abu Taha holds up baby boy's body in response to targeting\n- 10 relatives of the Abu Taha family killed in the airstrike\n- Some relatives originally displaced from Khan Younis and killed in previous Israeli airstrike\n- Remaining relatives who fled Khan Younis for safety killed in Rafah"}, {"id": "913979b0-0db9-4d8b-a32b-51b5e9cd0674", "title": "Ukraine war briefing : Russia making gains from slow western aid , says Nato chief", "date": "2024-04-30 01:15", "url": "https://www.theguardian.com/world/2024/apr/30/ukraine-war-briefing-russia-making-gains-from-slow-western-aid-says-nato-chief", "message": "Ukrainian navy spokesperson Dmytro Pletenchuk said the strike was conducted by an Iskander-M ballistic missile with a cluster warhead.\nA Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday, according to local officials.\nUkraine’s allies have accused North Korea of transferring weapons to Russia for use against Ukraine in violation of an arms embargo.\nThe US has accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\nRussia in March vetoed the renewal of sanctions monitoring against North Korea’s nuclear and ballistic missile programmes.", "location": "Kharkiv", "classification": "security", "score": 0.667125687365189, "event_breakdown": "- Russian strike in Kharkiv kills at least two and injures six, according to local officials.\n- Ukrainian navy spokesperson attributes the strike to an Iskander-M ballistic missile with a cluster warhead.\n- Ukraine's allies accuse North Korea of transferring weapons to Russia for use against Ukraine, violating an arms embargo.\n- US accuses Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\n- Russia vetoes renewal of sanctions monitoring against North Korea's nuclear and ballistic missile programs in March."}, {"id": "e5bbe9a5-afa4-46b3-b127-6457381ad4d4", "title": "  My whole family has perished : 20 dead after Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 17:00", "url": "https://abc17news.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8657975260247653, "event_breakdown": "- Israeli airstrike targets Rafah, Gaza, killing 22 people, including an infant and a toddler.\n- Mahmoud Abu Taha holds up body of baby boy, denouncing Israeli targeting of civilians.\n- Member of Abu Taha family reports 10 relatives killed in the airstrike, some previously displaced from Khan Younis due to Israeli airstrikes.\n1. Israeli airstrike kills 22 people, including an infant and a toddler, in Rafah, Gaza.\n2. Mahmoud Abu Taha displays the body of a baby boy, denouncing the airstrike's victims.\n3. Ten relatives of the Abu Taha family are among those killed in the airstrike.\n4. Some victims had been previously displaced from Khan Younis due to an earlier Israeli airstrike.\n5. The remaining family members who sought refuge in Rafah after fleeing Khan Younis were also killed in the latest airstrike."}, {"id": "9ef3347e-1eaf-45f6-a48b-9b4060dd8650", "title": "Accused teen linked to Sydney bishop stabbing applies for release from custody", "date": "2024-05-01 12:45", "url": "https://abcnews.go.com/International/wireStory/accused-teen-linked-sydney-bishops-stabbing-applies-release-109819306", "message": "A 15-year-old boy who claims to be a friend of the teen accused of stabbing a Sydney bishop recently has applied to be released from custody on bailAccused teen linked to Sydney bishop's stabbing applies for release from custodyBy The Associated PressSYDNEY -- A 15-year-old boy who claimed to be a friend of a teen accused of stabbing a Sydney bishop applied Wednesday to be released from custody on bail on a charge of planning a terrorist attack.\nThe 15-year-old is one of six teens, ages 14 to 17, who were charged in a Sydney court last week with a range of offenses including conspiring to engage in or planning a terrorist act.\nDib tendered a bundle of documents including an affidavit from the boy’s mother, school report cards and a psychological report.\n“A young person with behavioral issues facing a terrorism accusation is not exceptional, it is rather the norm,” Rodger said.\nThe boy had been part of an encrypted chat group titled “Plans” where he talked about targeting Jewish people, Rodger said.", "location": "Sydney", "classification": "security", "score": 0.5226544674682438, "event_breakdown": "- A 15-year-old boy who claims to be a friend of the accused teen in the Sydney bishop's stabbing case applies for release from custody on a charge of planning a terrorist attack.\n- The 15-year-old is one of six teenagers charged in a Sydney court with various offenses, including conspiring to engage in or planning a terrorist act.\n- The boy submits documents such as an affidavit from his mother, school report cards, and a psychological report in support of his bail application.\n- It is mentioned that a young person with behavioral issues facing terrorism accusations is not uncommon.\n- The boy was reportedly part of an encrypted chat group named \"Plans\" where he discussed targeting Jewish people."}, {"id": "4509a497-7893-430a-89bd-0b73f0420dac", "title": "Russian Strike On Odesa Hits  Harry Potter Castle , 5 Killed", "date": "2024-04-30 14:15", "url": "https://www.rferl.org/a/ukraine-russia-harry-potter-castle/32927804.html", "message": "The department's e-mailed response to a request for comment added, \"Our position on Mr. Vulin and Mr. Popovic is well known.\nsanctions.\"\nVucevic also named Milica Djurdjevic Stamenkovski, president of the right-wing Zavetnici party, to head the Ministry of Family Care.\nHe said Vucic's regime has always relied less on a specific ideology and more on maintaining power, \"so the authoritarian mindset behind it, rather than its nationalist ideological heritage, has been and remains more important.\"\nThe policy of imposing sanctions on officials close to the Kremlin remains \"entirely disconnected from the general policy of the U.S. administration towards Belgrade.\"", "location": "Belgrade", "classification": "world", "score": 0.3310657662487573, "event_breakdown": "- The department's email response to a request for comment mentioning Mr. Vulin and Mr. Popovic\n- Vucevic appointing Milica Djurdjevic Stamenkovski as the head of the Ministry of Family Care\n- Vucevic's regime relying less on a specific ideology and more on maintaining power, emphasizing an authoritarian mindset\n- The policy of imposing sanctions on officials close to the Kremlin being disconnected from the general U.S. administration policy towards Belgrade"}, {"id": "34f63290-ab26-4ac9-a7ea-61ae2333cb08", "title": "Austria Urges Global Action on  Killer Robot as AI Weapon Concerns Rise", "date": "2024-04-29 21:15", "url": "https://www.techtimes.com/articles/304094/20240429/austria-urges-global-action-killer-robots-ai-weapon-concerns-rise.htm", "message": "Austria has recently raised the alarm on the urgent need for global action to regulate artificial intelligence (AI) in weapons systems amid growing concerns over the development of so-called 'killer robots,\" Reuters reports.\nAt the meeting, Austria discussed the ethical and legal challenges posed by the advancement of AI technology in warfare.\n(Photo: GENYA SAVILOV/AFP via Getty Images)Austria Calls for Urgent Action on AI Weapons ControlDuring the conference, Austrian Foreign Minister Alexander Schallenberg stressed the necessity of agreeing on international rules and norms to ensure human control over AI weapons.\nConcerns over the accuracy and reliability of AI systems have been raised, with examples ranging from misrecognizing objects to causing fatal accidents in civilian contexts.\nMeanwhile, Ukraine's efforts to develop AI drones with image recognition targeting systems further highlight the global trend toward AI-driven warfare.", "location": "Austria", "classification": "world", "score": 0.2713854145835573, "event_breakdown": "- Austria calls for global action to regulate AI in weapons systems\n- Austria discusses ethical and legal challenges of AI technology in warfare\n- Austrian Foreign Minister emphasizes the need for international rules to ensure human control over AI weapons\n- Concerns raised over accuracy and reliability of AI systems in various contexts\n- Ukraine's development of AI drones with image recognition targeting systems reflects global trend towards AI-driven warfare"}, {"id": "8d8a0f56-c938-4881-bd6a-ca9e1d8680a3", "title": "Middle East Totters on the Edge of a Cliff as two Arch enemies Confront Each Other", "date": "2024-04-30 22:00", "url": "https://thenorthlines.com/middle-east-totters-on-the-edge-of-a-cliff-as-two-arch-enemies-confront-each-other/", "message": "Syria movesto the centre stageof conflict betweenIsrael and IranBy James M DorseyMultiple overt and covert wars have pushed the Middle East to the edge of a cliff.\nIncreased tension between Iran and Israel complicates efforts to pull the Middle East back from the abyss.\nWith the two archenemies walking a fine line between waging covert or overt war, escalation between Israel and Iran has the greatest potential to push the Middle East off the cliff.\nThe US and Israeli denials followed a series of tit-for-tat attacks that threatened to suck Israel, Iran, and potentially the United States into an all-out Middle East war.\nThe Gaza war moved Syria centrestage in the covert Israeli-Iranian confrontation.", "location": "Syria", "classification": "security", "score": 0.6322685986811983, "event_breakdown": "- Increased tension between Iran and Israel\n- Covert and overt wars in the Middle East\n- Denials from the US and Israel\n- Tit-for-tat attacks between Israel and Iran\n- Gaza war involving Syria"}, {"id": "eeaaabc1-7abc-4b48-921b-e5da11654b89", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-04-30 21:30", "url": "https://www.yahoo.com/news/five-killed-russian-missile-attack-195300897.html", "message": "At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "Odesa", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack kills at least five and injures over 30 in Odesa, according to Ukrainian authorities.\n- Ukrainian authorities attribute the attack to Russia's use of an Iskander ballistic missile and cluster munitions.\n- Investigation suggests Russian military intentionally used cluster munitions to cause significant casualties.\n- Use, transfer, and production of cluster munitions prohibited by the Convention on Cluster Munitions.\n- Russian officials claim air defenses in Crimea intercepted major missile and drone attack by Ukraine."}, {"id": "d89bb8d6-afd3-433f-99ca-fda88889caf7", "title": "Ukraine  Harry Potter castle  goes up in flames as Russian missile attack kills 5", "date": "2024-04-30 22:30", "url": "https://www.cnn.com/2024/04/30/europe/ukraine-harry-potter-castle-missile-attack-intl-latam/", "message": "CNN —At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "1. Russian missile attack on Odesa kills five and injures over 30\n2. Ukrainian authorities suspect use of Iskander ballistic missile and cluster munitions by Russia\n3. Investigation suggests Russian military intentionally used cluster munitions to cause casualties\n4. Convention on Cluster Munitions prohibits use, transfer, and production of cluster munitions\n5. Russian officials claim interception of major missile and drone attack by Ukraine"}, {"id": "1745b217-fe10-494d-9232-e361f1220019", "title": "Suspected missile attack by Yemen Houthi rebels damages ship in the Red Sea : authorities", "date": "2024-04-29 19:45", "url": "https://www.theglobeandmail.com/world/article-suspected-missile-attack-by-yemens-houthi-rebels-damages-ship-in-the/", "message": "Open this photo in gallery: Yemen's capital Sana'a is seen on a map.The Associated PressA suspected missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virginio Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led air strike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Sana'a", "classification": "security", "score": 0.5616577975065878, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damaging a ship in the Red Sea\n- Italian frigate Virginio Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait\n- Decrease in Houthi attacks due to U.S.-led air strike campaign in Yemen\n- Decline in shipping through the Red Sea and Gulf of Aden because of the threat\n- U.S. military shooting down five drones over the Red Sea"}, {"id": "16104447-6c6c-41b0-a3ee-5889cc96aef0", "title": "Hamas alleges rocket barrage from Lebanon into northern Israel", "date": "2024-04-29 16:00", "url": "https://dailystar.com.lb/hamas-rocket-barrage-lebanon-northern-israel/", "message": "On Monday, the Ezzedine al-Qassam Brigades, the military wing of Hamas, launched a series of rockets from southern Lebanon targeting a northern Israeli military command center.\nIn response, the Israeli military reported intercepting most of the approximately 20 rockets launched from Lebanon and conducted strikes on the launch sites.\nFollowing the rocket barrage, an Israeli drone struck the town of Aita al-Shaab in southern Lebanon.\nEarlier in the year, a U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut, a Hezbollah stronghold.\nIn March, another Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre, while a Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley.", "location": "Aita al-Shaab in southern Lebanon", "classification": "security", "score": 0.997549179367563, "event_breakdown": "- Ezzedine al-Qassam Brigades launched rockets from southern Lebanon targeting Israeli military command center\n- Israeli military intercepted rockets and conducted strikes on launch sites in Lebanon\n- Israeli drone struck town of Aita al-Shaab in southern Lebanon\n- U.S.-reported Israeli strike in January killed Saleh al-Arouri and militants in south Beirut\n- Israeli strike in March killed Hamas operative near Rashidiyeh Palestinian refugee camp in Tyre\n- Hamas official narrowly escaped drone strike near Souairi in Bekaa Valley"}, {"id": "67063f34-1cdd-44ba-994b-8baf6a915861", "title": "Trump tells Nato  youre on your own  if they dont increase spending", "date": "2024-04-30 15:15", "url": "https://www.yahoo.com/news/trump-tells-nato-own-don-144345366.html", "message": "Donald Trump has warned Nato members they will be on their “own” unless they increase their defence spending if he wins a second term.\nEarlier this year, he went further in suggesting Russia could “do whatever the hell they want” to Nato allies who did not spend enough on collective defence.\nWhen it comes to the Middle East, Mr Trump said he would defend Israel if the country was attacked by Iran.\nThe Estonian foreign minister said it will take up the matter with its NATO and European Union partners.\nMr Demchenko said that since the start of the war border guards have uncovered about 450 criminal groups that have attempted to smuggle people across the border.", "location": "Estonia", "classification": "world", "score": 0.8128222253419405, "event_breakdown": "- Donald Trump warns NATO members about defense spending\n- Trump suggests Russia can act freely towards NATO allies with insufficient defense spending\n- Trump vows to defend Israel against attacks from Iran\n- Estonian foreign minister raises the issue with NATO and EU partners\n- Border guards uncover 450 criminal groups smuggling people during the war"}, {"id": "d001a76b-6b8e-4d6e-8f9d-a1af401bb623", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA", "classification": "security", "score": 0.3885877145857738, "event_breakdown": "- Russian missile attack on an educational institution in a seafront park in Odesa kills at least five and injures 32.\n- Footage shows significant damage to the roof of a private law academy in Odesa after the strike.\n- President of the academy, Serhiy Kivalov, a former member of parliament, reported injured."}, {"id": "89959db2-e093-4784-87cb-6f695f10afca", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney, Australia", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "- 15-year-old boy charged in a stabbing at a church in Sydney plotted an attack against the Jewish community\n- Prosecutors revealed the boy's intention to attack Jewish community members during a hearing about his bail release\n- Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church in Wakeley, western Sydney"}, {"id": "0bb875f4-0b2b-4f11-8ced-d1f285afe2c7", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames - LocalNews8 . com", "date": "2024-04-30 23:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "By Radina Gigova and Olga Voitovych, CNN(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "Odesa", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack kills at least five and injures over 30 in Odesa, according to Ukrainian authorities.\n- Ukrainian authorities believe Russia used Iskander ballistic missile and cluster munitions in the attack.\n- Investigation suggests Russian military intentionally used cluster munitions to cause significant casualties.\n- Convention on Cluster Munitions prohibits use, transfer, and production of cluster munitions internationally.\n- Russian officials claim air defenses in Crimea intercepted major missile and drone attack by Ukraine."}, {"id": "d2e20399-4b4c-4599-9701-878408053d66", "title": "Portuguese - Flagged Ship Hit Far in Arabian Sea , Raising Concerns Over Houthi Capabilities", "date": "2024-04-30 20:15", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthis-israel-hamas-war-ship-attack/2024/04/30/id/1162978/", "message": "A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "The main location where the main event takes place is in the far reaches of the Arabian Sea.", "classification": "security", "score": 0.838042406233834, "event_breakdown": "- A Portuguese-flagged container ship, MSC Orion, came under attack by a drone in the far reaches of the Arabian Sea\n- Yemen's Houthi rebels claimed responsibility for assaulting the MSC Orion\n- The MSC Orion is associated with London-based Zodiac Maritime, part of Israeli billionaire Eyal Ofer’s Zodiac Group\n- The Joint Maritime Information Center indicated that the MSC Orion was likely targeted due to its perceived Israeli affiliation\n- Rebels released footage of a drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier"}, {"id": "cdf3ce00-ed75-4ed6-b89b-f13dc2ecdfd0", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-05-01 01:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "Odesa", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack on the Black Sea port city of Odesa, Ukraine, resulting in at least five people killed and over 30 injured\n- Ukraine authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack\n- Investigation indicates Russian military used cluster munitions with the intention of causing significant casualties\n- The Convention on Cluster Munitions prohibits the use, transfer, and production of cluster munitions internationally\n- Russian officials claim successful interception of a major missile and drone attack by Ukraine in Crimea"}, {"id": "e8f7f90a-c1bc-4e83-87ee-b48e503a36c4", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.", "location": "Cairo, Egypt", "classification": "security", "score": 0.3917279483742275, "event_breakdown": "- Hamas delegation leaves Cairo after cease-fire talks\n- Blinken presses Hamas to accept new cease-fire proposal"}, {"id": "da3b99a3-720a-4f90-b2d6-39c76283a680", "title": "Sydney teenager charged after counter - terrorism raids texted  were going to kill , court hears | Australia news", "date": "2024-04-30 10:15", "url": "https://www.theguardian.com/australia-news/2024/apr/30/sydney-teenager-charged-after-counter-terrorism-raids-texted-were-going-to-kill-court-hears-ntwnfb", "message": "A 16-year-old Sydney boy charged with terrorism offences has been denied bail over fears for community safety after a court heard he messaged another young person “we’re going to kill”.\nSix teenagers were charged after counter-terrorism raids in Sydney last week, with two of them appearing in the children’s court at Parramatta on Tuesday.\n“We were planning big stuff bro, it’s conspiracy for a terrorist attack I think,” the court heard he wrote in a text message.\nThe court heard the 16-year-old’s parents, who were present for the hearing, wrote an affidavit describing an “excellent son” who was a good student.\nThe material allegedly included a video of an assault with the Islamic State symbol watermarked over the video.", "location": "Parramatta", "classification": "entertainment", "score": 0.41021048371286883, "event_breakdown": "- A 16-year-old Sydney boy charged with terrorism offences denied bail\n- Six teenagers charged after counter-terrorism raids in Sydney\n- Two teenagers appeared in children's court at Parramatta\n- Court heard message from 16-year-old indicating planning for a terrorist attack \n- 16-year-old's parents wrote an affidavit describing him as an \"excellent son\" \n- Material allegedly included a video of an assault with the Islamic State symbol watermarked"}, {"id": "d9b882e6-ca0f-43de-bed4-8e006cc42d02", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.thesunchronicle.com/news/nation_world/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_21ecb329-1284-53b0-9574-d499c18dc8a3.html", "message": "Authorities said a missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea in the latest assault in their campaign against shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.7998231551022632, "event_breakdown": "- Missile attack by Yemen's Houthi rebels on a ship in the Red Sea"}]