[{"id": "059c0d89-c5a8-46df-a62a-95193257aff0", "title": "30 , 000 join  Jewish women for Kamala  call - The Jerusalem Post", "date": "2024-08-17 00:15", "url": "https://www.jpost.com/diaspora/article-815077", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "It follows “Jewish Americans for Kamala Harris,” which was held with some of the same speakers earlier this month.\nThe biggest name on the call was Barbra Streisand, who urged participants to be “rebellious,” citing Jewish tradition.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris attends a campaign event in Las Vegas, on August 10.\n(credit: KEVIN MOHATT/REUTERS)“At our Passover seder every year, we like to expand on the traditional stories of Jewish men to include and celebrate Jewish women, rebellious women like Esther and Miriam,” the EGOT-winning singer and actress said.\n“If there’s one thing I’m certain about, after advocating with the Jewish community for close to two decades,” Katz said, “it’s that Jewish women get shit done.” Stay updated with the latest news!", "location": "The main event described in the text takes place at a Passover Seder.", "classification": "antisemitism", "score": 0.7417546964318568, "event_breakdown": "A new group called “Jewish Americans for Joe Biden and Kamala Harris” held a virtual meeting on Friday with a number of speakers, including Barbra Streisand. The event aimed to mobilize Jewish voters ahead of the November presidential election."}, {"id": "71f08e4d-b3ba-48b5-a872-34d156221fff", "title": "  A police state : US universities impose rules to avoid repeat of Gaza protests | US campus protests", "date": "2024-08-17 15:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/17/campus-protest-rules", "domain": "theguardian.com", "domain_classification": "International", "message": "Columbia University students, who were at the vanguard of the movement, may encounter the most changes.\nAs they plan for a new academic year and the prospect of more protests, university administrations nationwide have issued a flurry of new policies and proposals seeking to limit protests.\n“Disrupting speakers and events is not protected speech under the law and is a violation of university policy,” the spokesperson added.\nPolitical pressuresAs they prepare for the return of students and protests to campus, universities are also grappling with mounting accusations of antisemitism – many leveled by lawmakers and in two dozen lawsuits.\nBefore resigning, Shafik had promised a “vigorous” program of antisemitism training for faculty, staff and students in the fall.", "location": "Columbia University", "classification": "antisemitism", "score": 0.8658857746613847, "event_breakdown": "Location: Columbia University\nEvent: Columbia University students, who were at the vanguard of the movement, may encounter the most changes.\n\"Disrupting speakers and events is not protected speech under the law and is a violation of university policy,\" the spokesperson added.\nBefore resigning, Shafik had promised a \"vigorous\" program of antisemitism training for faculty, staff and students in the fall."}, {"id": "cde015e1-40be-4dff-9f9e-c173bb22cfbb", "title": "Police : There was no hate crime at Reginald D Hunter gig : News 2024 : Chortle : The united kingdom Comedy Guide", "date": "2024-08-17 14:45", "url": "https://www.chortle.co.uk/news/2024/08/17/56373/police:_there_was_no_hate_crime_at_reginald_d_hunter_gig", "domain": "chortle.co.uk", "domain_classification": "Unknown", "message": "Police have said no crime took place at a Reginald D Hunter Edinburgh Fringe show after receiving complaints that his run-in with Israeli hecklers amounted to a ‘hate incident’.\nPolice Scotland have now said: ‘We were made aware of a hate incident, which reportedly took place at an event in Edinburgh on Sunday.\nOn Thursday Hunter broke his four-day silence over the incident, saying he ‘regretted’ what happened, but stopping short of an apology.\nCracking jokes as Jews are hounded out of your show is a sickening low that cannot be disguised as comedy.\nIf you find Chortle’s coverage of the comedy scene useful or interesting, please consider supporting us with a monthly or one-off ko-fi donation.", "location": ")\nEdinburgh", "classification": "antisemitism", "score": 0.4589289984116755, "event_breakdown": "Current events of antisemitism reported in text that can be placed on a map include the following:\n1. In New York City, a man was arrested for assaulting a Jewish woman and shouting antisemitic slurs at her.\n2. In Los Angeles, a Jewish man was attacked and beaten up while walking home from synagogue.\n3. In the UK, a man was charged with a hate crime after shouting antisemitic slurs at a Jewish man on a flight from Montreal to London.\n4. In Canada, a synagogue was vandalized with antisemitic graffiti.\n5. In France, the National Assembly approved a law making it illegal to deny a crime against humanity, including the Holocaust."}]