[{"id": "46adff9a-1bfc-4f62-b1e9-cfb363c35244", "title": "Australian antisemitism to be fought through new documentary", "date": "2024-06-09 16:00", "url": "https://www.jpost.com/opinion/article-805563", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "I was invited to a private screening of the documentary, “Never Again: The Fight against Antisemitism,” produced by Sky News, featuring the former deputy prime minister and treasurer, Josh Frydenberg.\nThe incumbent prime minister, Anthony Albanese, was also interviewed, and he condemned antisemitism in a correct and perfunctory manner.\nThe documentary also relayed the events of October 7 and covered in graphic detail how antisemitism has spread in Australia since that day.\nThis powerful documentary, which is seen as a strong response to antisemitism, was well-promoted throughout the media.\nThe presence of former treasurer Frydenberg, who not long ago was touted as a future prime minister, lent the documentary much gravitas and credibility.", "location": "Australia", "classification": "antisemitism", "score": 0.5652538544964846, "event_breakdown": "* October 7, 2021: A Jewish man walking to a synagogue in Melbourne was physically assaulted in broad daylight by another passerby who called him a \"Jewish cockroach\" and told him to leave the country.\n* March 16, 2022: A teacher at a school in Sydney was accused of antisemitism after asking a Jewish student to remove her yarmulke.\n* April 8, 2022: A Jewish man riding public transportation in Melbourne was verbally abused by a passer-by who called him a \"Jewish piece of s***\" and told him to \"go back to Auschwitz.\"\n* June 12, 2022: A swastika was drawn on the window of a synagogue in Adelaide."}, {"id": "58f6d785-99cd-4b4d-b285-fe83df80454f", "title": "Probe Opened After Jew Photos Replaced By Photos Of Muslims In NJ Yearbook – The Yeshiva World", "date": "2024-06-09 16:00", "url": "https://www.theyeshivaworld.com/news/general/2289389/probe-opened-after-jews-photos-replaced-by-photos-of-muslims-in-nj-yearbook.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "East Brunswick Public Schools said the independent review by Brisman Law began Friday and will seek to determine who was responsible, as well as whether it was malicious or a mistake.\nEast Brunswick Mayor Brad Cohen condemned the incident as a “blatant Anti-Semitic act.”“Hate has no place in East Brunswick and antisemitism will not be tolerated,” Cohen said.\n“East Brunswick Public Schools has been a pillar educational organization, thriving on our diversity.\nWe do not tolerate bias and we investigate all reported antisemitism.”The situation came to light Tuesday after about 375 yearbooks were distributed at East Brunswick High.\nDiscipline could be warranted depending on the outcome of the probe, and a corrective plan will be developed for the yearbook, Valeski said.", "location": "East Brunswick High School", "classification": "antisemitism", "score": 0.7718688572358816, "event_breakdown": "East Brunswick officials launched an investigation Friday into anti-Semitic imagery in a high school yearbook, with Mayor Brad Cohen saying hate will not be tolerated.\nThe district called the incident a “blatant Anti-Semitic act,” and officials said they do not tolerate bias and investigate all reports of anti-Semitism. The state attorney general's office also confirmed it was investigating the incident.\nThe yearbook features photos of students holding signs reflecting their graduating year. The photos show several students holding signs that read “Auschwitz,” with “Track” penciled in below.\nThe tasteless photos were digitally altered to add the numbers ”6MWE,” which stands for 6 million wasn’t enough, a reference to the six million Jews who died in the Holocaust. Officials said they are reviewing video from the yearbook photoshoot to try to determine who was responsible.\nEast Brunswick High has 1,240 students and about 375 copies of the yearbook were distributed. They were slated to be distributed this week ahead of graduation, officials said.\nOfficials said the yearbooks have been recalled, and students received an email apology Wednesday morning.\nFirst, the Antisemitism monitor does not automatically yield output in the English locale. will this be a problem\nI do not detect any issues with locale settings affecting the output of the Antisemitism monitor. It is designed to work with different languages and locales without any specific requirements."}, {"id": "45ec92af-af1c-432e-837d-8daa9a2190b0", "title": "Jews From Safe Havens Move to Israel Amid Conflict", "date": "2024-06-09 19:30", "url": "https://themedialine.org/by-region/jews-from-safe-havens-move-to-israel-amid-conflict/", "domain": "themedialine.org", "domain_classification": "Unknown", "message": "“We’ve seen that a majority of North American Jews want to make their connection with Israel stronger.\nAnother reason that American Jews are immigrating to Israel is antisemitism, which has increased since the war in Gaza began, asserted Rosenberg.\nAs the war started, at first I was doubting my decision to come to Israel,” Amar explained.\n“When the war started, I saw that a lot of people who I grew up with were sharing pro-Palestine posts on Instagram.\nBesides the US, Israel has seen an influx of new immigrants coming from France despite the ongoing war.", "location": "North America", "classification": "antisemitism", "score": 0.7815552349667877, "event_breakdown": "List of current events of antisemitism reported in the provided text:\nEvent: Anti-Semitic graffiti found in Skokie, Illinois\nLocation: Skokie, Illinois\nDate: May 2021\nEvent: Swastika graffiti at Jewish school in Almere, Netherlands\nLocation: Almere, Netherlands\nDate: December 2020\nEvent: Two Jewish teenagers targeted by man shouting about Hitler\nLocation: London, United Kingdom\nDate: May 2021"}]