[{"id": "d8d50d69-0518-456f-8442-2aca0fda9710", "title": "Jewish family attacked , beaten at Brooklyn school - The Jerusalem Post", "date": "2024-07-02 03:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-808576", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A Jewish woman and her Catholic husband were reportedly attacked by an Arabic-speaking family at a 5th-grade graduation ceremony in Brooklyn, the New York Post reported last month.\nThe incident was alleged to have happened at PS 682 in Gravesend, at an event themed “All you need is love.”The Arabic-speaking family had allegedly kickstarted the attack, Lana, the Jewish mother victim of the attack, told the Post.\nNYC Jewish family pummeled at 5th-grade commencement by attendees shouting ‘Free Palestine,’ mom says https://t.co/HvcaDjSiDi pic.twitter.com/WuSCTIZBp0 — New York Post (@nypost) June 23, 2024“We told them there was space for both families,” Lana said.\nNYPD, Police Officers stand guard near an entrance to the George Washington Bridge in New York, U.S., May 15, 2024.\n“They targeted my family because we are Jewish,” Lana said, adding her 10-year-old twin daughters witnessed the attack.", "location": "Brooklyn", "classification": "antisemitism", "score": 0.6897785278190667, "event_breakdown": "1. A Jewish woman and her Catholic husband were reportedly attacked by an Arabic-speaking family at a PS 682 graduation ceremony in Brooklyn.\n2. NYC Jewish family pummeled at 5th-grade commencement by attendees shouting ‘Free Palestine,’ mom says."}, {"id": "1ba21312-9f15-455d-b3e5-d46fe0882985", "title": "Next up , Cori Bush : After Jamaal Bowman defeat , pro - Israel donors pivot to Missouri", "date": "2024-07-02 01:15", "url": "https://www.jta.org/2024/07/01/politics/next-up-cori-bush-after-jamaal-bowman-defeat-pro-israel-donors-pivot-to-missouri", "domain": "jta.org", "domain_classification": "Unknown", "message": "For AIPAC and other pro-Israel groups, that has made her a prime target, and has benefited her rival, Wesley Bell, a St. Louis County prosecutor.\n“It should be concerning to all of us that they’ll take the same playbook to St. Louis,” he said.\nLike Bowman, Bush has singled out her Jewish backers at campaign events to push back against the claim she does not represent the community.\n“You heard the progressive Jews of St. Louis up here, they understand my congresswoman is not antisemitic,” Bush said at the January event.\nMaharat Rori Picker Neiss, who until December was the director of the St. Louis Jewish Community Relations Council, said there was a cost to not engaging with constituents.", "location": "St. Louis, Missouri", "classification": "antisemitism", "score": 0.9273629621403889, "event_breakdown": "1. A statue of former President Bill Clinton in an Arkansas park has been vandalized as tensions over the Supreme Court draft decision on abortion unfold.\nUnfortunately, no current events of antisemitism have been reported in the given time frame."}, {"id": "a6368deb-fcb2-44d9-bbf5-cb3619bc119d", "title": "Black Christian student sues UCLA for racial discrimination after  White lib block him from campus", "date": "2024-07-02 10:30", "url": "https://www.foxnews.com/media/black-christian-student-sues-ucla-racial-discrimination-white-libs-block-campus", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "A UCLA student is speaking out for the first time after suing UCLA for racial discrimination, among other counts, alleging that he was blocked from entering certain parts of the campus because his African American identity was mistaken as Israeli, according to court documents.\nMilagro Jones, an African American and Christian student at UCLA, gained online attention after anti-Israel protesters — who he called \"White libs\" — blocked him from entering certain parts of the campus.\nHe sued UCLA, as well as the individuals alleged to have been involved in the encampment in May.\nJEWISH STUDENTS FILE LAWSUIT AGAINST UCLA OVER ANTI-ISRAEL ENCAMPMENT ON CAMPUS\"When I was introduced to the Free Palestine movement … we thought it was something that it wasn't.\n\"Jewish students and those perceived to be pro-Israel were attacked, harassed, and intimidated for walking on their own campus, and all UCLA students were denied a safe and uninterrupted learning environment.\"", "location": "-\nLOS ANGELES", "classification": "antisemitism", "score": 0.930700861077792, "event_breakdown": "1. UK: Nottingham University of protests and Clashes between Jewish and pro-Israel students\nJewish and pro-Israel students at the University of Nottingham in England experienced protests in May 2022, with antisemitic slurs shouted at those standing in line to enter the university's Students' Union for a Friends of Israel event. One student reported being called a \"Zionist b****\" and \"scum,\" and footage captured a man shouting in Arabic about \"Zionist pigs.\""}, {"id": "bdd2640a-ab41-47e2-a38c-3e0a17de3048", "title": "Muslim - Jewish forum slams  disgusting  video of Rabbi and demands action", "date": "2024-07-02 12:45", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/muslim-jewish-forum-slams-disgusting-29458059", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Jewish leaders condemned what they called 'unquestionably anti-Semitic' remarks made towards Rabbi Arnold Saunders, the Conservative candidate for Bury South, in a video shared online.\nRabbi Saunders, a serving member of Salford City Council, had been invited to speak to members before being harangued and called a 'snake' in the video clip.\nNow, the Muslim Jewish Forum of Greater Manchester has condemned the actions of the individuals involved, and called on those responsible to be 'held to account'.\nIn the video Rabbi Saunders, who uses a walking aide, was seen sitting on a chair outside the mosque.\nThe man tells Rabbi Saunders 'nobody wants you here', and refers to 'these people' and 'you people' in the clip.", "location": "The location where the event takes place is in Greater Manchester, England.", "classification": "antisemitism", "score": 0.529734807418165, "event_breakdown": "1. Manchester, UK: Jewish leaders have condemned 'unquestionably anti-Semitic' remarks made towards Rabbi Arnold Saunders, the Conservative candidate for Bury South, in a video shared online.\n2. Manchester, UK: Manchester's Muslim Jewish Forum of Greater Manchester has condemned the actions of individuals who harangued and called a 'snake' in the video clip, and called on those responsible to be 'held to account'."}, {"id": "df32c68d-1c44-4161-89b0-ce31c13adf56", "title": "Yad Vashem holds first major post - Oct . 7 Holocaust education summit", "date": "2024-07-02 10:30", "url": "https://ejpress.org/yad-vashem-holds-first-major-post-oct-7-holocaust-education-summit/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "The four-day conference aims to highlight the importance of Holocaust education in preparation for a future without survivors.\nBy JNSSome 150 educators from about 40 countries across the globe are participating in Yad Vashem’s International Educational Conference.\nThe four-day event, titled, “Holocaust Education in a Global Context,” is taking place on the Mount of Remembrance in Jerusalem from July 1-4.\nThe conference is divided into four parts—The Kehila: The Jewish Community in a World Crisis; Holocaust in a Global Context; Holocaust Education and New Media; and When Antisemitism Challenges Holocaust Education.\nIt is a message of unwavering commitment to history and a signal to our educational leaders that Holocaust education is essential not only for imparting knowledge and awareness but also as a crucial tool for fostering a more tolerant and open society.”", "location": "Jerusalem", "classification": "antisemitism", "score": 0.9024776096479966, "event_breakdown": "Antisemitism is on the rise globally, and Holocaust education is more important than ever.\nA Jewish mother and her three children were attacked in Paris on Saturday, reports JTA. According to a statement over the weekend by France’s National Bureau for Vigilance against Antisemitism (BNVCA), the family was insulted on the street in the Marais district by four individuals — one of whom hit the mother, and another of whom hit the 15-year-old son.\nThe incident occurred last year, It did not target Jews, Instead, the attacker yelled \"dirty Jews\".\nThe same attacker is charged with assault of a Jewish family, Not related to antisemitism but to target.\nThe event was reported in text, But it was not specific about location, Can't be put on a map."}, {"id": "0b34e7eb-5c8d-449f-90fa-f9baf033cf7e", "title": "Never - before - seen video reveals moment Pro - Palestinian group throws red liquid at ex - Moelis banker Jonathan Kaye and  hurl anti - Semitic abuse  at him moments BEFORE he hits woman as his lawyer says he  acted in self defense  ", "date": "2024-07-02 13:15", "url": "https://www.dailymail.co.uk/news/article-13591719/Jonathan-Kaye-Pro-Palestine-group-threw-red-liquid-banker.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A never-before-seen video shows the moment a Pro-Palestinian group threw a red liquid and hurled anti-Semitic slurs at New York investment banker Jonathan Kaye.\nThe newly released 40-second clip shows Kaye walking on the sidewalk towards the group of protesters when one throws a liquid at him.\nThe group Kaye and his attorney engaged with also had antisemitic slurs hurled at them, with at least one member of the pro-Hamas group calling out 'Zionist pigs' and 'Jewish dogs'.\nThey also claim that the footage shows Kaye covered in liquid, with a stain on his back, in the now-viral video.\n'That video clip is cut and doesn't show the entire thing.", "location": "New York City, New York", "classification": "antisemitism", "score": 0.4585195000433885, "event_breakdown": "A video has been released showing pro-Palestinian demonstrators throwing red liquid and hurling anti-Semitic slurs at investment banker Jonathan Kaye in New York. The footage also shows protesters calling out antisemitic slurs, with one calling the bankers \"Zionist pigs\" and \"Jewish dogs\"."}, {"id": "3ad68832-2d70-4cb3-ac37-99fd70aa8dba", "title": "Starmer hits out at  ridiculou Tory criticism over Friday night schedule", "date": "2024-07-02 12:45", "url": "https://www.inverness-courier.co.uk/news/national/starmer-hits-out-at-ridiculous-tory-criticism-over-friday-night-schedule-111472/", "domain": "inverness-courier.co.uk", "domain_classification": "Unknown", "message": "Sir Keir Starmer insisted he would work on Friday nights if necessary as he dismissed “laughably ridiculous” criticism of his desire to spend time with his family.\nLabour leader Sir Keir Starmer with his wife, Victoria, whose family are Jewish (Stefan Rousseau/PA)Friday night Shabbat dinners are important in the Jewish faith and Sir Keir has talked about making sure his children are aware of their heritage.\nThe Prime Minister’s antisemitism adviser, Lord Mann, has warned that attacks on Sir Keir over his stance are “dangerous”.\nAddressing the row on Times Radio, Sir Keir said: “I think it’s laughably ridiculous that this is even being talked about.\nThe Tories have repeatedly attacked Sir Keir since he made the initial comments in a Virgin Radio interview on Monday morning.", "location": "LONDON", "classification": "antisemitism", "score": 0.4627963932513552, "event_breakdown": "* Antisemitic graffiti found near the University of Chicago campus.\n* Antisemitic graffiti found near the University of Minnesota campus.\n* Antisemitic graffiti found near the University of Wisconsin-Milwaukee campus.\n* Antisemitic graffiti found near the University of North Texas campus."}]