[{"id": "8d8dffef-6196-46bc-ac11-a73f57213b8d", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | The Canberra Times", "date": "2024-06-07 03:15", "url": "https://www.canberratimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The student association ANUSA is also in hot water over how it conducted its recent annual general meeting where it is alleged antisemitic behaviour took place.\nThe independent organisation has been asked by ANU management to explain itself and how it can represent all students going forward, not only those deep in the pro-Palestine movement.", "location": ".)\nCanberra", "classification": "antisemitism", "score": 0.41473612925528053, "event_breakdown": "Antisemitism is rising again in Europe\n\nVandalism on the synagogue\n\nA protester pushed a rabbi in the studio\n\nAntisemtic tweeter not verified\nAntisemitism is rising again in Europe\n\nBelgium. A video of a Christmas tree with a yellow star on its top circulates on facebook\n\nThe intent is obvious :\\"}, {"id": "4ea5499f-83dc-42a9-9995-ac8a7213d354", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | Braidwood Times", "date": "2024-06-07 05:30", "url": "https://www.braidwoodtimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The right-wing senators came armed with images and stories of antisemitic behaviour and offensive slogans on campus.\nJewish students, some of whom were sitting in the back of the room to observe the hearing, were feeling unsafe and unwelcome in the place where they lived and studied, the politicians said.", "location": "California", "classification": "antisemitism", "score": 0.878341726665214, "event_breakdown": "1. The City of Louisville in Kentucky will formally apologize on Tuesday for forcing black-owned businesses in the predominantly black neighborhood Parkland to sell to white buyers in the early 1920s.\n2. The Florida Senate will vote on a bill that would ban abortions in Florida if the U.S. Supreme Court overturns Roe v. Wade, which guaranteed a woman's right to an abortion.\n3. A federal judge in Florida ruled on Monday that the state's 24-hour waiting period before an abortion violates the U.S. Constitution.\n4. A federal jury on Monday cleared Idaho State University of allegations that it discriminated against three women's sports programs.\n5. The Florida Senate passed the \"Parental Rights in Education\" bill, also known as the \"Don't Say Gay\" bill, by a vote of 23 to 16 on Monday."}, {"id": "7b62deb2-ac9e-4e44-8d4f-2823ac7f4c9c", "title": "Genesis Prize Marks Tenth Anniversary by Honoring Barbra Streisand", "date": "2024-06-07 07:30", "url": "https://www.prnewswire.com/news-releases/genesis-prize-marks-tenth-anniversary-by-honoring-barbra-streisand-302166892.html", "message": "10th Anniversary Genesis Prize Laureate Barbra Streisand receives a glass sculpture of a shofar from Genesis Prize Foundation co-founder Stan Polovets.\n(Photo by Kevin Mazur/Getty Images for Genesis Prize Foundation)The Genesis Prize was established in 2014 when New York City Mayor, businessman and philanthropist Michael R. Bloomberg was announced as its inaugural laureate.\nBarbra Streisand stated: \"I am delighted to be honored by the special 10th Anniversary Genesis Prize and to work with The Genesis Prize Foundation to support organizations that acknowledge our shared humanity and seek to better our society.\nShe founded the Barbra Streisand Women's Heart Center at Cedars-Sinai to support research and raise awareness about women's heart disease.\nAbout The Genesis Prize FoundationThe Genesis Prize is a global award that celebrates Jewish achievement and contribution to humanity.", "location": "LOS ANGELES", "classification": "antisemitism", "score": 0.41528328476723736, "event_breakdown": "The following current events of antisemitism have been reported and can be mapped:\nA teenager threw a large rock at a synagogue in California, causing about $1,200 in damage. https://www.nbcnews.com/news/us-news/california-teen-charged-chucking-rock-synagogue-apparently-random-ncna1274571\nAn assailant threw rocks through the windows of a synagogue in Pittsburgh, PA, but was caught by security. The police are now investigating the crime. https://www.jpost.com/diaspora/assault-on-jewish-synagogue-pittsburgh-696244\nTeens knocked the hats off boys wearing yarmulkes in Brooklyn, NY. The police are investigating the incident as a bias crime. https://www.nbcnewyork.com/news/local/Crown-Heights-Yarmulkes-Defaced-Anti-Semitism-Brooklyn-Police-512058927.html"}, {"id": "b5afe9fe-f4fe-46f0-93e3-c72cfcf20011", "title": "Outrageous Antisemitic Incident at New Jersey High School Shows Lack of Leadership", "date": "2024-06-07 19:30", "url": "https://www.algemeiner.com/2024/06/07/outrageous-antisemitic-incident-at-new-jersey-high-school-shows-lack-of-leadership/", "message": "“Hate has no place in East Brunswick and antisemitism will not be tolerated,” he said in a Facebook post.\n“East Brunswick Public Schools has been a pillar educational organization, thriving on our diversity.\nIn East Brunswick, it means recognizing that what happened in the yearbook was not a mistake — it was deliberate.\nFor the East Brunswick school community in the wake of this controversy, true leadership would involve a thorough investigation, transparency in findings, and concrete actions to prevent such mistakes in the future.\nThe East Brunswick incident is a stark reminder of the need for such leadership today — leadership that does not just offer apologies but takes definitive action to uphold the values of inclusivity, respect, and justice.", "location": "East Brunswick", "classification": "antisemitism", "score": 0.6730933931187095, "event_breakdown": "1. In East Brunswick, New Jersey, antisemitic symbols and hate speech were discovered in a high school yearbook.\n2. The incident has been reported on by a number of media outlets, including the New York Times and the New Jersey Globe.\n3. The school's administration has ordered the yearbook to be removed from circulation until the issue is resolved.\n4. The incident has sparked protests and calls for an investigation from the East Brunswick community.\n5. The school's principal has spoken out against the incident, stating that the school does not tolerate such behavior.\n6. The incident brings to the forefront the ongoing need for leadership within the school and community to promote inclusivity and respect for diversity."}, {"id": "1b6a90d6-c786-454d-b564-9dc3aac7bee8", "title": "A night for hope", "date": "2024-06-07 17:00", "url": "https://www.jpost.com/israel-news/article-805380", "message": "‘What a night,” wrote Zvika Klein, Editor-in-Chief of The Jerusalem Post, on Facebook.\nRONIT FARKASH, Director of Strategic Partnerships at IDSF, said that her son is among the soldiers fighting Hamas in Gaza.\nYaron Buskila, who served in the Gaza war, described the chaos he witnessed on Oct. 7, when people were calling him for help.\n“Have no doubt – the Jewish people are under attack.”Lion described the difficult war that Israel is waging against its enemies.\nThe reception ended with the singing of “Hatikvah.”This article was written in cooperation with the Israel Defense and Security Forum.", "location": "Israel", "classification": "antisemitism", "score": 0.7117439739870873, "event_breakdown": "1. Violence and vandalism against Jews has been reported in France during what the President of the Jewish Community described as ‘the most serious outbreak of anti-Semitism since World War II’.\n2. A Jewish teenager wearing a kippah (skullcap) was assaulted by unidentified assailants in St Petersburg. Anti-Semitic graffiti was also reported to have been found near a local synagogue in Russia.\n3. In London, about 150 demonstrators held a rally outside the Israeli embassy to protest against what they called ‘Israeli crimes’ and called for ‘a free Palestine from the river to the sea’, a phrase that is widely considered to be a call for the elimination of the State of Israel.\n4. In Germany, thousands of people rallied in the eastern city of Dresden to protest against Israel and in support of ’Palestinian resistance’.\n5. In New York, Palestinian-American activists held a ‘Keffiyeh march’ to protest against Israel and condemn the United States for providing it with weapons.\n6. In Palermo, a city in Sicily, a swastika was drawn on the front gate of a local synagogue."}, {"id": "a8e96e73-ec6a-42dd-89bf-346441711fc7", "title": "Time to show some solidarity : Why Toronto mayor should attend this weekend Walk with Israel", "date": "2024-06-07 22:00", "url": "https://www.theglobeandmail.com/canada/toronto/article-time-to-show-some-solidarity-why-torontos-mayor-should-attend-this/", "message": "The mayor, Olivia Chow, should walk alongside them.\nThat sent a terrible message to Toronto Jews, many of whom have deep connections to Israel.\nThe Walk with Israel is an annual event intended to express backing for the Jewish state and celebrate the strength of the Jewish community.\nDoing so would illustrate, more powerfully than any statement or speech, that she understands what Toronto Jews are enduring.\nThat is just what the Walk with Israel is meant to be.", "location": "Toronto", "classification": "antisemitism", "score": 0.9549815938056004, "event_breakdown": "A recent report from the Anti-Defamation League found antisemitic incidents in Canada more than doubled in the second quarter of 2022.\n\nA rabbi in Cambridge, Massachusetts, went for a morning walk wearing a kippah, and was attacked by a passerby.\n\nThe walk in New York City last month was a response to a May 21 shooting at Tops Friendly Market in Buffalo, where 10 people were killed.\n\nCouncil leaders have been told not to use the phrase \"anti-Zionism\" to describe opposition to the creation of the state of Israel.\n\nIt comes after two incidents in a single week in which a Jewish woman was targeted in Toronto, Canada, in an attack that left her with a broken nose and bruises."}]