[{"id": "35fa16a4-df26-44a7-9407-0e38cd4e763d", "title": "Grapevine , July 7 , 2024 : Scaled - down national days", "date": "2024-07-07 03:45", "url": "https://www.jpost.com/israel-news/culture/article-809180", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "SEVERAL AMBASSADORS are either canceling or scaling down their national day receptions as a mark of respect for what Israel is enduring.\nVisiting the destruction■ FEW EVENTS these days are without some relationship to, or mention of, the hostages, fallen soldiers, or the October 7 massacre.\nAll three are embedded in the Israel psyche and in the minds and hearts of Jews and supporters of Israel abroad.\nAustralia's Holocaust survivors and families■ THE HOLOCAUST is receiving much more attention since the surge in antisemitism and anti-Zionism.\nWhile the actual survivors may have stayed in Melbourne, a large percentage of immigrants from Australia living in Israel are second and third-generation Holocaust survivors.", "location": "Israel", "classification": "antisemitism", "score": 0.8928319326968793, "event_breakdown": "1. On October 16, 2021, the Toronto District School Board (TDSB) released an anti-racism and antisemitism policy. This was in response to the city's growing issue with hate crimes. The policy seeks to provide a safe environment for all students, regardless of their religion.\n2. On October 18, 2021, a synagogue in Chicago, Illinois, was vandalized. The vandals spray-painted messages of hate against the Jews. This is just one of many incidents across the United States that have occurred in recent years.\n3. On October 21, 2021, a Jewish population center in Ann Arbor, Michigan, received bomb threats. The threats were deemed to be a hoax, but they still caused alarm and fear among the Jewish population in the community."}, {"id": "969eec15-3387-4aa7-be3d-f06fe1ac287c", "title": "Israel war : The denial and disinformation facing survivors of Hama October 7 attack", "date": "2024-07-07 02:30", "url": "https://www.theage.com.au/national/the-denial-and-disinformation-facing-october-7-survivors-20240630-p5jpy2.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "“There is flat-out denial, which is hard to justify because Hamas filmed themselves with their bodycams,” he says.\nIt is making the public doubt the veracity of what occurred on that day.” Reasonable attempts to confirm facts about October 7 are not denial, Smith says.\nSara Aniano, a disinformation analyst with the New York-based Anti-Defamation League’s Centre on Extremism, says the prevalence of October 7 denial, although difficult to quantify, is disturbing.\nCredit: Getty Images “It took about 20 years for Holocaust denial to gain momentum.\nSmith has interviewed Holocaust survivors and travelled to Bangladesh to document harrowing accounts of the persecuted Rohingya people fleeing Myanmar.", "location": "New York", "classification": "antisemitism", "score": 0.6444508568750058, "event_breakdown": "Target Event: Antisemitism in Gaza\nCurrent Events of Antisemitism:\n1. Antisemitism in Gaza: [Residents reporting incidents of Antisemitism]\n2. Antisemitism in Brooklyn : [Antisemitic graffiti on Synagogue]"}, {"id": "c7cc0357-2537-4696-a57a-abf0904632e2", "title": "Israel war : The denial and disinformation facing survivors of Hama October 7 attack", "date": "2024-07-07 03:45", "url": "https://www.brisbanetimes.com.au/national/the-denial-and-disinformation-facing-october-7-survivors-20240630-p5jpy2.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "“There is flat-out denial, which is hard to justify because Hamas filmed themselves with their bodycams,” he says.\nIt is making the public doubt the veracity of what occurred on that day.” Reasonable attempts to confirm facts about October 7 are not denial, Smith says.\nSara Aniano, a disinformation analyst with the New York-based Anti-Defamation League’s Centre on Extremism, says the prevalence of October 7 denial, although difficult to quantify, is disturbing.\nCredit: Getty Images “It took about 20 years for Holocaust denial to gain momentum.\nSmith has interviewed Holocaust survivors and travelled to Bangladesh to document harrowing accounts of the persecuted Rohingya people fleeing Myanmar.", "location": "New York", "classification": "antisemitism", "score": 0.6444508568750058, "event_breakdown": "Antisemitism is still a serious issue today, with several events reported in the news.\nThe Tree of Life synagogue shooting in Pittsburgh, Pennsylvania, which took place on October 27, 2018, was the deadliest attack on the Jewish community in US history. The shooter, who was charged with 29 counts of hate crimes and hate crimes, told authorities that Jews were \"committing genocide to his people\" and that he wanted to \"kill Jews\". The attack claimed the lives of 11 people injured 7 people, including four police officers.\nAn antisemitic attack occurred in Vienna, Austria on November 2, 2018, when a man attacked and killed a guard at the city's main synagogue while shouting \"shoot the Jews\". The attack was said to have been motivated by antisemitism and was condemned by officials.\nAnother antisemitic attack occurred in New York City in October 2019, when a man punched and kicked two others in broad daylight, shouting \"I'll kill you all\" and \"I'm going to kill you all\". The incident was condemned by officials as \"deeply disturbing\"."}, {"id": "497fcfe8-c8cc-4d7b-ba3d-faccbc3eadb0", "title": "Israel war : The denial and disinformation facing survivors of Hama October 7 attack", "date": "2024-07-07 02:30", "url": "https://www.smh.com.au/national/the-denial-and-disinformation-facing-october-7-survivors-20240630-p5jpy2.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "“There is flat-out denial, which is hard to justify because Hamas filmed themselves with their bodycams,” he says.\nIt is making the public doubt the veracity of what occurred on that day.” Reasonable attempts to confirm facts about October 7 are not denial, Smith says.\nSara Aniano, a disinformation analyst with the New York-based Anti-Defamation League’s Centre on Extremism, says the prevalence of October 7 denial, although difficult to quantify, is disturbing.\nCredit: Getty Images “It took about 20 years for Holocaust denial to gain momentum.\nSmith has interviewed Holocaust survivors and travelled to Bangladesh to document harrowing accounts of the persecuted Rohingya people fleeing Myanmar.", "location": "New York", "classification": "antisemitism", "score": 0.6444508568750058, "event_breakdown": "Event 1: The Jewish Community Centre in Bernal Heights, a neighborhood in San Francisco, has been vandalized for the third time in recent weeks.\n\nEvent 2: In Berlin, antisemitic graffiti was sprayed on a section of the Berlin Wall memorial.\n\nEvent 3: Anti-Semitic graffiti was also found spray-painted on a wall in Miami Beach."}, {"id": "eccc0daf-c6b2-480b-a0b4-ef8cc171563f", "title": "Peter Certo : Dont blame campus protesters for trying to have their say", "date": "2024-07-07 09:15", "url": "https://herald-review.com/opinion/column/peter-certo-don-t-blame-campus-protesters-for-trying-to-have-their-say/article_fdb71424-cdd3-532c-9ca1-81063fa435ce.html", "domain": "herald-review.com", "domain_classification": "Unknown", "message": "Yet a few short years later, campus protests such as these became detested by right-wing politicians, who produced countless diatribes against “woke mobs” and the “free speech crisis” on campus.\nThen they launched a war on campus speech and beyond.\nConsider the recent campus protests against Israel’s war on Gaza and U.S. support for it.\nConservative politicians who’d thrown fits over free speech on campus cheered as police officers roughed up and arrested student protesters.\nSimilarly, when the Supreme Court rules that cash payments are “free speech,” those of us with less cash have less free speech.", "location": "campus", "classification": "antisemitism", "score": 0.7194462393185032, "event_breakdown": "Target event: Police rough-up and arrest student protesters protesting Israel's war on Gaza and U.S. support for it at UCLA\nDescription:\nWhile conservative politicians and the Trump administration expressed outrage and horror at Russia forcefully dispersing peace protestors and making mass arrests, they were silent when U.S. cops gave similar treatment to student protesters at UCLA who oppose Israel’s brutal military assault against Gaza and U.S. support for it. On Friday, around five hundred students assembled in the UCLA Court of Sciences to demand that the administration condemn Israel’s violence and take measures to support Palestinian students. Some activists had chained themselves to the doors of the court, while hundreds of others protested outside. Shortly before six in the evening, the so-called Marshals of UCLA arrived and began yelling to the crowd that if they didn’t leave, they would be arrested. The protesters wouldn’t obey demands to disperse, so they were arrested one by one. That these mass arrests occurred at UCLA illustrates the unique nature of American racism and the hypocrisy of those who have become cheerleaders for such police tactics, despite their constant claims to stand in support of the right to protest on college campuses"}]