[{"id": "680036b5-4fce-4e23-9dbe-b0b87199aadb", "title": "Wildfire danger in Eagle County is pretty low , thanks to a cool , moist spring", "date": "2024-05-16 03:00", "url": "https://www.vaildaily.com/news/eagle-county-fire-danger-low-spring/", "message": "Mitigation efforts over the past several years have helped reduce the risk of wildfire, but nothing helps keep fire danger at bay like a lot of snow and a cool, moist spring.\nBirch Barron, the county’s emergency management director, on Tuesday updated the Eagle County Board of Commissioners on current wildfire conditions in the area.\nBut, he noted, no part of Eagle County was in any form of drought at the end of April, adding that the county was bordering on “abnormally dry” at the end of April in 2023.\nThat snow is coming off fairly slowly, again thanks to a reasonably cool spring so far.\nThe good news from the cooler spring conditions applies to spring runoff.", "location": "Eagle County, Colorado", "classification": "natural-disasters", "score": 0.7142953460519166, "event_breakdown": "Wildfire conditions\nDrought conditions"}, {"id": "00d6f4ae-28d9-4217-9da9-090729f2359c", "title": "Oregon officials say 2024 fire season threat slightly less than 2023", "date": "2024-05-16 05:45", "url": "https://www.kptv.com/2024/05/16/oregon-officials-say-2024-fire-season-threat-slightly-less-than-2023/", "message": "PORTLAND Ore. (KPTV) - The threat of wildfires in Oregon for summer 2024 should be less than last year, at least for the early summer months, state forestry experts said on Wednesday.\nThat’s according to experts with the state’s forestry department - who provided a look at what we can expect as wildfire season approaches.\nOregon saw a considerable amount of rain and snow throughout the winter months, building a strong snowpack.\nTina Kotek, said this could mean more complex and challenging wildfire conditions in the later summer months.\nThe Department of Forestry said it’s preparing for the season by making sure resources are in place to fight fires when they do start, including new modernized equipment.", "location": "Portland, Oregon", "classification": "natural-disasters", "score": 0.5602950217365397, "event_breakdown": ".\nWildfires, Snowpack, Precipitation (Rain), Forestry experts."}, {"id": "b393497d-9344-4aa5-a8ae-91218367a732", "title": "State wildfire agencies prepared to respond to fire season but will need more staff in future", "date": "2024-05-16 00:15", "url": "https://www.yahoo.com/news/state-wildfire-agencies-prepared-respond-225435339.html", "message": "Oregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nOregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nAt a news conference Wednesday, the leaders of the Oregon Department of Forestry, the Oregon State Fire Marshal and the Oregon Department of Emergency Management discussed the upcoming wildfire season, which typically begins in mid-May.\n“This is all trying to get (the land) health back to a more natural state,” Cline said.\nThe post State wildfire agencies prepared to respond to fire season but will need more staff in future appeared first on Oregon Capital Chronicle.", "location": ")\nOregon", "classification": "natural-disasters", "score": 0.6894429113296674, "event_breakdown": "- Increasing the scale of prescribed burns across Oregon to prevent severe wildfires.\n- Wildfire season in Oregon typically begins in mid-May.\n- Efforts to restore the land to a more natural state were discussed.\n- Prescribed burns help to restore the health of the forest."}, {"id": "8e11155a-20f7-42b0-b7fd-1c53f109ac9c", "title": "Army Corps prepares Lake Okeechobee ahead of  extremely active  hurricane season", "date": "2024-05-16 03:45", "url": "https://winknews.com/2024/05/15/army-corps-prepares-lake-okeechobee-ahead-of-extremely-active-hurricane-season/", "message": "In February, the Corps implemented releases to the Caloosahatchee and St. Lucie Estuary to bring lake levels down ahead of the 2024 hurricane season, which is already forecasted to be “extremely active.”The plan worked.\nAs of Wednesday, May 15, 2024, Lake Okeechobee stands at 13.73 feet.\nThe 143-mile earthen dam system encircles Lake Okeechobee and is routinely inspected.\nIt reduces impacts from flooding as a result of high lake levels for a large area of south Florida.\nOn the cusp of this hurricane season, the Corps is prepared for it.", "location": "LAKE OKEECHOBEE", "classification": "natural-disasters", "score": 0.8200145792511231, "event_breakdown": "natural-disasters events:\n1. Hurricane season 2024\n2. High lake levels\n3. Flooding in south Florida\n4. Army Corps plan to reduce high lake levels\n5. Releases to the Caloosahatchee and St. Lucie Estuary"}, {"id": "7a6250ae-a394-4665-94b3-d5bc8bc77b96", "title": "KATU News special  Wildfire Season : Prepare & Protect  ", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/katu-news-special-wildfire-season-prepare-protect", "message": "Wildfire season 2024 is here.\nThe first fire started burning last month 25 miles southeast of Chemult in southern Oregon.\nKATU News is 'On Your Side,' helping you prepare before a wildfire threatens your health, life, or home.\nIn KATU’s half-hour special called ‘Wildfire Season: Prepare & Protect,’ we’ll show you how to make the area around your home more fire-safe and how to build ‘defensible space.\"\nWatch ‘Wildfire Season: Prepare & Protect’ Memorial Day May 27th at 6:30 p.m. on KATU.", "location": "southern Oregon", "classification": "natural-disasters", "score": 0.6188788988633401, "event_breakdown": ".\n- 25 miles southeast of Chemult in southern Oregon wildfire\n- Wildfire Season 2024\n- ‘Wildfire Season: Prepare & Protect’"}, {"id": "cf8fe3a5-2d0e-4648-a04f-dae26c786e63", "title": "Canadian wildfires haze U . S . skies , trigger air quality warnings in multiple states", "date": "2024-05-16 00:00", "url": "https://wjla.com/weather/first-alert-weather-blog/canadian-wildfire-smoke-returns-northern-united-states-minneapolis-kansas-city-upper-level-winds-wisconsin-wildfire-season-snowpack-cooler-weather-washington-dc-dmv", "message": "Wildfire smoke has lowered air quality and made for some hazy skies in areas like Minneapolis and Kansas City this week.\nThe upper-level winds have shifted, which resulted in the smoke from these fires filtering into the United States.\nOn Tuesday, Code Orange (3 of 6) air quality was reported in cities like Topeka, Kansas.\nThe 2023 Canadian wildfire season was record-breaking with about 45 million acres burned, which is nearly two and a half times the previous record of 17.5 million acres burned in 1995.\nWhile it is expected to be another busy wildfire season this year, it is also not expected to be anywhere near the activity and widespread as last year.", "location": "TORONTO", "classification": "natural-disasters", "score": 0.6845268966027263, "event_breakdown": "1. 2023 Canadian wildfire season, with 45 million acres burned\n2. Wildfire smoke in the United States, including Minneapolis and Kansas City, resulting in hazy skies and lowered air quality"}, {"id": "0522b230-70fa-4507-ab61-552dd7e40496", "title": "Looming fires are forcing thousands of Canadians to evacuate . Some may not return home until next week", "date": "2024-05-16 07:00", "url": "https://www.yahoo.com/news/looming-fires-forcing-thousands-canadians-060956937.html", "message": "Colossal wildfires burning across Canada over the last week have driven thousands of people to evacuate with their kids, pets and precious belongings in tow – many uncertain when they may be able to return home.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nBut that is far from the amount of precipitation needed to offset drought conditions and extinguish the fires, the British Columbia Wildfire Service said.\nSmoke rises as fire singes Fort Nelson on May 14.\n“This region has experienced multiple years of drought, with a below normal snowpack this past winter,” said Ben Boghean, fire behavior specialist for the BC Wildfire Service.", "location": "CANADA", "classification": "natural-disasters", "score": 0.8305664934698607, "event_breakdown": "Here are the natural-disaster events reported in the provided text:\n- Wildfires burning across Canada in May 2022:\n  - 51,000 acre fire in Alberta, near Fort McMurray\n  - 51,000 acre fire in Fort Nelson, British Columbia\n- Drought conditions in British Columbia"}, {"id": "11243e59-31c7-4365-bb18-6fbb7697c8f5", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said.", "location": "Oregon", "classification": "natural-disasters", "score": 0.5914707575233541, "event_breakdown": ".\n1. Wildfire in east of Oregon expected for July and August 2022\n1. Oregon has a goal of having 700 firefighters in East Oregon during the wildfire season\n1. The pool of fire fighters in the state is shrinking and it is decreasing the number of firefighters in the state"}, {"id": "584765d7-6668-431e-8ae1-5cf71abefda2", "title": "Houston weather : Heavy rain , flooding possible for Thursday through early Friday", "date": "2024-05-16 07:00", "url": "https://www.fox26houston.com/weather/houston-weather-heavy-rain-flooding-possible-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.9422199841802245, "event_breakdown": "Here is a summary of the events mentioned in this text:\nHeavy Rain\nStrong Storms\nSevere Storms\nFlooding"}, {"id": "f872a7e0-beff-444c-89d7-0df6dc0074a4", "title": "Houston weather : FOX 26 Storm Alert Day issued for Thursday through early Friday", "date": "2024-05-16 02:30", "url": "https://www.fox26houston.com/weather/houston-weather-fox-26-storm-alert-day-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.9422199841802245, "event_breakdown": "* Heavy rain\n* Severe storms"}, {"id": "a130c0f9-22bb-4379-b35e-184a682919f0", "title": "Wet roads , poor visibility for morning commute", "date": "2024-05-16 09:45", "url": "https://www.wfsb.com/2024/05/16/wet-roads-poor-visibility-morning-commute/", "message": "(WFSB) - A storm that brought heavy rain and some wind led to some road closures in parts of the state.\nChannel 3 meteorologists issued a First Alert through Thursday morning because of an isolated chance for minor flooding and gusty winds.\nSimsbury police posted that Old Meadow Plain Road was closed between Lawton Road and Pine Glen because of a downed tree.\nIn Enfield, police said Taylor Road was closed between Scitico Plaza and Heron Road because of a crash that brought down wires in the road.\nClick HERE for the latest FIRST ALERT TRAFFIC information for your MORNING COMMUTEClick HERE for the latest FIRST ALERT WEATHER FORECAST from Channel 3 Meteorologists.", "location": "ENFIELD", "classification": "natural-disasters", "score": 0.48993683997142545, "event_breakdown": "The events mentioned in the text are:\n- A storm that caused heavy rain and brought down trees leading to road closures in Simsbury and Enfield.\n- A car crash in Enfield that caused wires to go down on Taylor Road and resulted in a closure for road clean-up."}, {"id": "3f2f7509-c93f-4b92-840c-3f52358035fd", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:45", "url": "https://kval.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said.", "location": "Oregon", "classification": "natural-disasters", "score": 0.5914707575233541, "event_breakdown": "Wildfires in Oregon\nExpected above-average wildfire season for eastern parts of Oregon in July and August."}, {"id": "3200faa3-f8ef-4e92-8cdc-0e231e719b38", "title": "Two rainstorms heading for Ghana - GMet warns", "date": "2024-05-16 08:15", "url": "https://www.myjoyonline.com/two-rainstorms-heading-for-ghana-gmet-warns/", "message": "The Ghana Meteorological Agency (GMet) says its weather monitoring station has observed double rainstorms heading for the country on Thursday, May 16.\nAreas within the coastal and northern sectors will be hit by heavy rainfall accompanied by strong winds and thundery conditions.\n\"A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country,\" the statement read.\nThe recent severe rainstorm left in its wake destruction in parts of Accra, as trees fell and damaged several cars.", "location": "ghana", "classification": "natural-disasters", "score": 0.7757850751810021, "event_breakdown": "1.) Severe rainstorm hitting Ghana's capital, Accra\n2.) Trees falling due to strong winds and causing destruction"}, {"id": "7c8cdfcd-4873-4b5d-afc7-1e02717310b7", "title": "Officials learn from the past in responding to this year Fort McMurray wildfire", "date": "2024-05-16 12:15", "url": "https://www.theglobeandmail.com/canada/article-officials-learn-from-the-past-in-responding-to-this-years-fort/", "message": "“The system was designed after 2016,” said Derek Sommerville, a wildfire specialist with the Alberta company Fire and Flood Emergency Services.\nJody Butz, the fire chief in charge of the Fort McMurray region, said Wednesday that the highway is open and day-to-day life continues in many parts of the region.\nJosee St-Onge, an Alberta Wildfire information officer, said favourable winds should push the fire from the city, but weather can change at any point.\nAnother much smaller wildfire has popped up, about three kilometres north of Fort McMurray, west of Highway 63 and north of Parsons Creek.\nThis is the second time Fort McMurray, a city of 68,000, has been forced to flee the flames.", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.8848216078763553, "event_breakdown": "Here are the natural-disasters events mentioned in the text:\n1. A wildfire in Fort McMurray.\n2. A much smaller wildfire north of Fort McMurray."}, {"id": "e61220b1-2cba-4755-b638-128660911c40", "title": "Houston under flood watch Thursday ahead of soaking rains", "date": "2024-05-16 00:15", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/houston-texas-flood-watch-weather-19460286.php", "message": "He brings five years of experience forecasting tropical systems, severe weather outbreaks, and blizzards to the Houston Chronicle.\nJustin looks forward to his work with the Houston Chronicle, where he'll be responsible for posting daily weather forecasts.\nOn top of daily forecasts, he is excited to tackle more in-depth weather and climate stories that impact the residents of Southeast Texas.\nA North Carolina native, Justin joined the Chronicle in July 2023.\nHe graduated with his bachelor's degree in meteorology from the University of North Carolina at Charlotte in December 2017.", "location": "HOUSTON, TEXAS", "classification": "natural-disasters", "score": 0.6202850864236111, "event_breakdown": "Tropical storms, severe-weather outbreaks, blizzards."}, {"id": "179b272a-4ae5-41b7-a59c-9dbf1a51e596", "title": "Weather Alert : Flash flood potential continues this morning . ", "date": "2024-05-16 10:45", "url": "https://turnto10.com/weather/weather-blog/weather-alert-flash-flood-potential-continues-this-morning", "message": "6:30 AM UPDATE: An areal flooding has been issued for much of the region until 9:30 AM.\nAs expected, a wide swath of 1-3\" of rainfall is being reported across the region this morning.\nGreen Airport has surpassed the 1\" mark, places along the south coast are nearing 4\".\nThe heaviest rain this morning has been slowly shifting from the south coast northward towards Providence.\nMore off and on showers are expected through the afternoon before the rain comes to an end tonight.", "location": "SOUTH COAST", "classification": "natural-disasters", "score": 0.7826918977653848, "event_breakdown": "1. Areal flooding\n2. Heavy rainfall"}, {"id": "41290d17-ca78-4b3f-8f3c-0a95dccef156", "title": "GMet alert : Two rainstorms set to hit Ghana , residents urged to prepare", "date": "2024-05-16 12:15", "url": "https://www.businessghana.com/site/news/General/306886/GMet-alert:-Two-rainstorms-set-to-hit-Ghana,-residents-urged-to-prepare", "message": "Their morning forecast pinpointed the arrival of dual rainstorms, with the Nigerian storm projected to make landfall around 9:30 am.\nRegions along the coast and in the north are anticipated to bear the brunt of heavy downpours, accompanied by robust winds and thunderous conditions.\nThe statement elaborated, “A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country.”GMet emphasised the heightened risk of flooding and wind damage, urging residents in vulnerable areas to remain vigilant and take necessary precautions.", "location": "GHA", "classification": "natural-disasters", "score": 0.9346625565241006, "event_breakdown": "The forecasted natural-disaster events in the text are as follows:\n\n1. Heavy downpours\n2. Strong winds\n3. Thunderstorms\n4. Flooding\n5. Wind damage"}, {"id": "4c955104-59e7-46a7-81ca-28207a32630c", "title": "Storms arrive tonight with multiple rounds into the weekend", "date": "2024-05-16 14:00", "url": "https://www.fox8live.com/2024/05/16/storms-arrive-tonight-with-multiple-rounds-into-weekend/", "message": "NEW ORLEANS (WVUE) - A stormy period is expected to develop over the region starting tonight and continuing into the weekend.\nThere will be a small shower chance this morning but as the day progresses, dry skies will become more likely.\nOur first storm threat develops overnight tonight as a line of strong to severe storms move in around midnight.\nI’m not too concerned about flooding with tonight’s round of storms as it should be moving pretty quickly.\nThe second round of storms develops later Friday in the late afternoon and evening.", "location": "NEW ORLEANS", "classification": "natural-disasters", "score": 0.7983992049385898, "event_breakdown": "1. Stormy period\n2. Strong to severe storms\n3. Flooding"}, {"id": "2a5e1d3c-ee52-45f8-ac25-f09967d38987", "title": "Omaha area flash flood warning expires", "date": "2024-05-16 04:30", "url": "https://omaha.com/news/local/weather/omaha-area-flash-flood-warning-expires/article_05926272-1308-11ef-8cc5-0316b0405c6f.html", "message": "Parts of the Omaha metro area was under a flash flood warning as strong rains moved through the area Wednesday evening.\nA Flash Flood Warning was issued until 8 p.m. for Omaha, Council Bluffs and La Vista, according to the National Weather Service.\nBecky Kern, warning coordination meteorologist with the NWS office in Valley, said they had received unofficial reports of rain falling at a rate of more than 3 inches per hour in parts of the Omaha area.\nThe weather service issued a reminder on social media to not drive through flooded roadways.\nThe Omaha Public Power District said more than 3,600 customers were without power as of 5:15 p.m. due to a circuit outage in northwest Omaha and another in north central Omaha.", "location": "OMAha", "classification": "natural-disasters", "score": 0.7679131978419396, "event_breakdown": "1. Strong rains moved through the Omaha metro area Wednesday evening.\n2. A Flash Flood Warning was issued for the Omaha, Council Bluffs and La Vista area.\n3. The NWS had received unofficial reports of rain falling at a rate of more than 3 inches per hour in parts of the Omaha area.\n4. The NWS reminded the public to not drive through flooded roadways in the Omaha area.\n5. Over 3,600 customers were without power due to a circuit outage in northwest Omaha and another one in north central Omaha (Omaha Public Power District)."}, {"id": "930b9b26-677d-4a3c-87e8-c2f87154ef79", "title": "Oilsands capital of Canada now grappling with second wildfire", "date": "2024-05-16 11:30", "url": "https://www.bnnbloomberg.ca/oilsands-capital-of-canada-now-grappling-with-second-wildfire-1.2073586", "message": "The unofficial capital of Canada’s oilsands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nSuncor, which operates oil-sands mines to the north of the city, said the latest fire hasn’t affected operations.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts.", "location": "Fort McMurray, Alberta", "classification": "natural-disasters", "score": 0.8028636508274997, "event_breakdown": "List of events related to the wildfire near Fort McMurray, Canada:\n1. Wildfire near Fort McMurray, Alberta - size is 3 hectares (7 acres), 10 km away from Suncor Energy Inc.’s Millennium and Steepbank mine sites"}, {"id": "f4303c5d-a5b8-45ee-b01f-a11b0b18bc49", "title": "Insurance Premiums Are Heating Up in States Prones to Wildfires", "date": "2024-05-16 01:30", "url": "https://robbreport.com/shelter/homes-for-sale/wildfires-raising-home-insurance-rates-1235618129/", "message": "“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nPaul Bersebach/MediaNews Group/Orange County Register via Getty ImagesIt’s a similar story in Florida, where insurance rates tripled over the last three years.", "location": "California", "classification": "natural-disasters", "score": 0.6572408140062118, "event_breakdown": "1. The State Farm Insurance Company canceling policies for wildfires in California in 2024.2. The State Farm Insurance Company raising rates for wildfires in Florida in 2021."}, {"id": "141ac141-3f43-4028-b202-41091bc2b833", "title": "Oil - Sands Capital of Canada Now Grappling With Second Wildfire", "date": "2024-05-16 09:45", "url": "https://www.insurancejournal.com/news/international/2024/05/16/774400.htm", "message": "The unofficial capital of Canada’s oil-sands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts.\nTopics Catastrophe Natural Disasters Wildfire Energy Oil Gas Canada", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.9194954249236119, "event_breakdown": "The text describes two natural-disasters events:\n- A wildfire near Fort McMurray, Alberta\n- A fire 10 kilometers north of Fort McMurray, Alberta"}, {"id": "3d919369-76aa-4a27-9ff5-1d491540382e", "title": "Fire threat eases near Canada oil sands hub , but a long , hot summer looms", "date": "2024-05-16 04:15", "url": "https://www.columbian.com/news/2024/may/15/fire-threat-eases-near-canadas-oil-sands-hub-but-a-long-hot-summer-looms/", "message": "The threat from a wildfire near Canada’s oil sands hub of Fort McMurray, Alberta, appeared to be easing on Wednesday, a day after it forced thousands of residents to evacuate and stirred memories of a damaging blaze nearly a decade earlier.\nFavorable winds were expected to push the fire away from the city of about 68,000 in northwest Canada, where many residents earn a paycheck from the nearby oil industry.\nBut scientists have said it’s not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city’s southern end while others were on on alert.\nIt was familiar terrain for the Albertan city, which survived a catastrophic blaze in 2016 that destroyed 2,400 homes and forced more than 80,000 people to flee.", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.7856512707214203, "event_breakdown": ".\n1. Wildfire near Canada's oil sands hub of Fort McMurray, Alberta\n2. Fire destroyed 2,400 homes in 2016 in Fort McMurray, Alberta"}, {"id": "84932c85-52e2-41e4-9777-c885e3b16385", "title": "Natural Disasters Are Making It Harder for Wealthy Homeowners to Insure Their Properties", "date": "2024-05-16 00:00", "url": "https://finance.yahoo.com/news/natural-disasters-making-harder-wealthy-220000573.html", "message": "“She wanted to renegotiate.”More from Robb ReportThen, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nIt’s a similar story in Florida, where insurance rates tripled over the last three years.", "location": "California", "classification": "natural-disasters", "score": 0.6102208828395559, "event_breakdown": "Here's the list:\n- Wildfires in California\n- Hurricane in Florida"}, {"id": "47c582e0-df66-4fb0-97f0-7e315945180c", "title": "Tropics watch : National Hurricane Center tropical outlook . See what weather is out there", "date": "2024-05-16 14:00", "url": "https://www.yahoo.com/news/tropics-watch-national-hurricane-centers-121746633.html", "message": "The National Hurricane Center's second tropical outlook for the 2024 Atlantic hurricane season is out.\nForecasters with the National Hurricane Center didn't highlight any tropical cyclones or tropical waves in Thursday morning's outlook.\nWeather watches and warnings issued in FloridaWhen is the Atlantic hurricane season?\nThe Atlantic hurricane season runs from June 1 through Nov. 30.\nThis article originally appeared on Treasure Coast Newspapers: Hurricane season: NHC forecasts no tropical cyclone activity 7 days", "location": "given\nBased on the provided text, I was unable to identify a specific location for the main event.", "classification": "natural-disasters", "score": 0.9371147485696391, "event_breakdown": ".\nThe National Hurricane Center's second tropical outlook predicts no tropical cyclone activity over the next seven days. The Atlantic hurricane season runs June 1 through Nov. 30."}, {"id": "188c9623-2503-42ce-97c4-5b283b01ec50", "title": "Buckle Up For More Dust Storms Thanks To Land Degradation , Climate Change", "date": "2024-05-16 02:45", "url": "https://www.freepressjournal.in/analysis/buckle-up-for-more-dust-storms-thanks-to-land-degradation-climate-change", "message": "In India dust storm and thunderstorm activity usually peak in the pre-monsoon period, between March and May.\nThe worst sand and dust storms India experienced was on May 2, 2018 when severe dust storms, thunderstorms and lightning hit several parts of India, resulting in the deaths of at least 124 people and injuries to 300 others.\nClimate change — which is bringing droughts and more extreme temperatures — is amplifying these factors.\nIn some areas, desert dust has doubled in the 20th century, increasing the chance of sand and dust storms.\nCombating sand and dust storms requires accelerated action and relevant capacity in multiple- hazard risk reduction for both adaptation and mitigation.", "location": "India", "classification": "natural-disasters", "score": 0.8474821908846071, "event_breakdown": "Here is your list of reported natural-disasters events mentioned in the text:\n- Sand and dust storms in India\n- Dust storms resulting in deaths and injuries in India on May 2, 2018"}, {"id": "9106fab5-fc42-4fa8-aa33-e6fba386cbb7", "title": "Turn Around Dont Drown : More Flooding Possible in So . Indiana", "date": "2024-05-16 03:00", "url": "https://103gbfrocks.com/turn-around-indiana-flooding/", "message": "Recent rains have caused flooding in some Southern Indiana neighborhoods, and the National Weather Service is predicting more rainfall in the coming days.\nSo here is your reminder of the importance of the phrase Turn Around Don't Drown.\nThe National Weather Service has issued a Hazardous Weather Outlook for a number of counties in Indiana, Kentucky, and Illinois, including Vanderburgh, Warrick, Posey, and Henderson Counties.\nTurn Around Don't DrownWith the possibility of flash flooding in the forecast, it felt like the right time to remind you: Turn Around Don't Drown.\n[Source: National Weather Service]", "location": "Southern Indiana", "classification": "natural-disasters", "score": 0.5752460065989593, "event_breakdown": "Turn around don't drown advisories in those counties\nflooding in those neighborhoods"}, {"id": "262ae2f9-fcbe-4b0b-8e77-ff728f397adc", "title": "Coimbatore Corporation must implement pre - emptive measures ahead of heavy rain , say experts", "date": "2024-05-16 14:15", "url": "https://www.thehindu.com/news/cities/Coimbatore/coimbatore-corporation-must-implement-pre-emptive-measures-ahead-of-heavy-rain-say-experts/article68182774.ece", "message": "As the district is expected to get heavy rain in the coming days, residents have urged Coimbatore Corporation take a three-fold approach to tackle monsoon-related problems: clean stormwater drains, promote rainwater harvesting, and check electric lines.\n“Once the monsoon arrives, we often witness flooded underpasses and unfortunate cases of electrocution, all pointing to the unpreparedness of the civic body,” said J. Jayaprakash, a resident.\nAccording to the Corporation, areas near the seven smart city lakes are susceptible to flooding because of their low-lying terrain, particularly along Selvachintamani tank and Valankulam, which are downstream.\n“We have also begun cleaning storm water drains across the city.\n“Today, no civic body can afford to waste rainwater.", "location": "Coimbatore", "classification": "natural-disasters", "score": 0.8625237776094028, "event_breakdown": "The events related to natural-disasters of the text are listed bellow:\n1 : Inundated Underpasses\n2 : Electrocution Cases\n3 : Flooding areas near seven smart city lakes"}, {"id": "52e99fc6-6720-4bc1-9f36-c300471ebdb8", "title": "Update : Allegheny County under a flash flood warning Wednesday night", "date": "2024-05-16 02:45", "url": "https://www.pennlive.com/weather-alerts/2024/05/allegheny-county-under-a-flash-flood-warning-wednesday-night.html", "message": "On Wednesday at 9:04 p.m. the National Weather Service issued an updated flash flood warning in effect until 10:30 p.m. for Allegheny County.\n\"Flash flooding of small creeks and streams, urban areas, highways, streets and underpasses as well as other poor drainage and low-lying areas.\"\nUnderstanding the differences between advisories, watches, and warningsFlash flood warning: Take action!\nA flash flood warning is issued when a flash flood is imminent or occurring.\nA flash flood is a sudden violent flood that can take from minutes to hours to develop.", "location": "Based on the text, there is no specific location mentioned in the event that corresponds to the flash flood warning.", "classification": "natural-disasters", "score": 0.83833413395513, "event_breakdown": "A flash flood warning was issued in Allegheny County, Wednesday at 9:04 p.m. It had a termination time of 10:30 p.m. It warned of flooding in small creeks, urban areas, highways, streets and underpasses as well as other poor drainage and low-lying areas."}, {"id": "ad981986-33f2-47f2-ac7a-8d71580de9a5", "title": "4 . 0 Magnitude Earthquake Reported In US | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-16 00:00", "url": "https://1450wkip.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "- Chile earthquake, magnitude 5.2 (May 13)\n- Mexico, Guatemala and El Salvador earthquake, magnitude 6.4 (May 12)\n- California earthquake, magnitude 4.3 (April 18)\n- Indonesia earthquake, magnitude 6.1 (May 13)\n- Japan earthquake, magnitude 6.5 (May 13)\n- Taiwan earthquake, magnitude 6.0 (April 22)"}, {"id": "7a56cdb4-ac43-4c14-a38f-c9352c4e30ff", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://kprcradio.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\n- 6.5 earthquake struck Mexico\n- 7.1-magnitude earthquake struck Mexico on September 19, 2017\n- 7.1-magnitude earthquake struck Mexico on September 19, 2017\n- 7.1-magnitude earthquake struck Mexico on September 19, 2017\n- 7.1-magnitude earthquake struck Mexico on September 19, 2017\n- 7.1-magnitude earthquake struck Mexico on September 19, 2017\n- 6.4 earthquake struck Japan on April 16, 2017\n- 6.4 earthquake struck Japan"}, {"id": "afab58f9-a880-4f96-90b0-3be40f743649", "title": "4 . 0 Magnitude Earthquake Reported In US | News Talk 99 . 5 WRNO", "date": "2024-05-16 00:00", "url": "https://wrno.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "List:\n- 6.5-magnitude earthquake hits Japan\n- 6.1-magnitude earthquake hits Indonesia\n- 6.0-magnitude earthquake hits Taiwan"}, {"id": "af3a1218-a6d5-43f4-a893-118d9373e916", "title": "4 . 0 Magnitude Earthquake Reported In US | Newsradio WTAM 1100", "date": "2024-05-16 00:00", "url": "https://wtam.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": ")\nBased on the text provided, it was not possible to determine a specific location for the main event.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Chile Earthquake, Mexico Earthquake, El Salvador Earthquake, Guatemala Earthquake, Indonesia Earthquake, Japan Earthquake, Taiwan Earthquake"}, {"id": "fe12462f-ed97-447b-bf1f-cfd6c6d836f4", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://600wrec.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Japan", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The reported events related to natural disasters are:\n1. 5.2-magnitude earthquake in Chile on May 13.\n2. 6.4-magnitude earthquake in Mexico, Guatemala and El Salvador on May 12.\n3. 6.4-magnitude earthquake in Indonesia on May 13, hours after a 6.5-magnitude earthquake in Japan.\n4. 6.0-magnitude earthquake in Taiwan on April 22.\n5. 4.3-magnitude earthquake in California on April 18."}, {"id": "6d1bc21b-5a6b-42ce-b2cc-2aa0a8b8afe9", "title": "4 . 0 Magnitude Earthquake Reported In US | Talk Radio 105 . 9", "date": "2024-05-16 00:00", "url": "https://knrs.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "These related events are the following:\n- 5.2-magnitude earthquake hit Chile Monday (13-MAY-2019)\n- 6.4-magnitude earthquake was reported in México, El Salvador and Guatemala were hit by a 6.4 earthquake on Sunday (12 MAY-2019)\n- A 6.1-magnitude earthquake was reported in Indonesia on Monday (13-MAY-2019) after a 6.5-magnitude earthquake was reported to the japanese island of Ryukyu on Sunday (12-MAY-2019)\n- Last but not list a 6.0-magnitude earthquake forced to more than 30 buildings to collapse in Taipei, Taiwan on Tuesday (22 APR-2019)."}, {"id": "01a93ee4-99d0-47e1-8d70-b9a3cd3f8733", "title": "Wildfire updates today : Fort McMurray , Fort Nelson", "date": "2024-05-16 11:15", "url": "https://www.ctvnews.ca/climate-and-environment/latest-updates-on-the-major-wildfires-currently-burning-in-canada-1.6889304", "message": "FORT MCMURRAY, Alta.\n-Bright red hoses thicker than a thigh snake along the highways near Fort McMurray, studded with cannons that can blast enough water into fire-threatened ditches to fill an Olympic-sized swimming pool every 90 minutes.\nThis is the second time Fort McMurray, a city of 68,000, has been forced to flee the flames.\nA view of the Parker Lake wildfire near Fort Nelson, B.C.\nA wildfire burns in northern Manitoba near near Flin Flon, as seen from a helicopter surveying the situation, Tuesday, May 14, 2024.", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.4224962028755605, "event_breakdown": "The events described in the text are:\n\n1. Fort McMurray wildfire: The bright red hoses and cannons are located near Fort McMurray, the 68,000-person city located near Edmonton and in the northern province of Alberta. The hoses, which are bigger than thighs, can shoot water into ditches that might threaten the city. The cannons can pump enough water into ditches every 90 minutes to fill an Olympic-sized swimming pool. Fort McMurray has had to evacuate residents of the city twice over fires, the latest of which occurred in May 2024."}, {"id": "b89a1fd9-3688-4ccd-8b87-43c4267ed2ef", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 07:15", "url": "https://kpic.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said.", "location": "Oregon", "classification": "natural-disasters", "score": 0.5914707575233541, "event_breakdown": "Based on the information provided, the only natural-disaster event mentioned in the text is a predicted above-average wildfire season for July and August in eastern Oregon."}, {"id": "0c4cd662-41fe-45ae-9347-8cd8f0bcc314", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 04:30", "url": "https://kcby.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said.", "location": "Oregon", "classification": "natural-disasters", "score": 0.5914707575233541, "event_breakdown": "The natural-disaster events described in the text are:\n- Increasing temperatures in Oregon state\n- Above-average wildfire season in eastern parts of the state\n- Small pool of firefighters available\n- Forest fire season in Oregon state"}, {"id": "fec15f7e-7581-4186-87e5-12479238f4ae", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:30", "url": "https://nbc16.com/news/wildfires/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said.", "location": "Oregon", "classification": "natural-disasters", "score": 0.5914707575233541, "event_breakdown": "Natural Disasters Events in Oregon:\n- Above-average wildfire season in eastern parts of the state (July and August).\n- Dwindling pool of firefighters.\n\nNote: This event list only includes natural disaster events relevant to the text provided."}, {"id": "74c37c28-bcc1-460d-a7d7-1d03eeeb1f17", "title": "Light magnitude earthquake hits Stilfontein in North West", "date": "2024-05-16 08:15", "url": "https://www.citizen.co.za/news/south-africa/earthquake-hits-stilfontein-north-west/", "message": "Light magnitude earthquake hits Stilfontein in North WestThe quake was felt by many near the epicentre.\nAccording to Volcano Discovery, the 3.5 earthquake hit 15.6 km away from Stilfontein just after 10am on Wednesday.\nPicture: iStockThere were no reports of any damages or injuries after a light magnitude earthquake hit the North West province.\nJust two weeks later, on 29 June, Johannesburg residents were shaken awake by a 2.9 magnitude quake originating in Soweto.\nALSO READ: 2.5 magnitude earthquake rattles parts of Joburg and West Rand", "location": "STILfontein", "classification": "natural-disasters", "score": 0.9111730622217155, "event_breakdown": "List of disaster reports:\nJune 15, 2022: \"Light magnitude earthquake hits Stilfontein in North West. There were no reports of any damages or injuries.\"\nJune 29, 2022: \"Johannesburg residents were shaken awake by a 2.5 magnitude earthquake originating in Soweto. There were no reports of any damages or injuries.\"\nJuly 7, 2022: \"According to Volcano Discovery, the 3.5 earthquake hit 15.6 km away from Stilfontein just after 10am on Wednesday. There were no reports of any damages or injuries.\""}, {"id": "63240f84-dee2-43e5-81be-0574cd94af72", "title": "ESA - Canada wildfire season begins", "date": "2024-05-16 14:00", "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Canada_s_wildfire_season_begins", "message": "Applications Canada’s wildfire season begins 16/05/2024 130 views 2 likesWildfire season has arrived in full force in Canada, prompting evacuation orders and alerts in several towns in British Columbia and Alberta due to the danger of uncontrolled blazes.\nThe 2023 wildfire season in Canada was one of the worst on record.\nWith the 2024 wildfire season already in full swing, Canadian authorities are bracing for a challenging summer.\nWildfire season in Canada typically runs from April until September or October when cooler temperatures dampen fire activity.\nAs the wildfire season progresses, ESA’s World Fire Atlas continues to be a valuable resource in tracking new fire outbreaks.", "location": "CANADA", "classification": "natural-disasters", "score": 0.7979104964415961, "event_breakdown": "Here is the list of reports:\n* Canada’s wildfire season begins 16/05/2024\n* Canada is hit by wildfires causing evacuation orders and alerts for towns in British Columbia/Alberta. 2023/2024 was particularly hard \n* There are wildfire seasons, which are from April to October  where the temperatures are cooler, helping to stop fire activity"}, {"id": "0526cdd6-d23d-49a3-a8c0-fba986a61ab6", "title": "Cities look for new ways to keep people safe and alive as extreme summer heat looms", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/cities-look-ways-keep-people-100556373.html", "message": "Ward and her colleagues specialize in “heat governance,” helping local and state governments prepare for extreme heat events.\nThe work includes finding ways to mitigate heat and develop emergency responses for major heat waves.\nWard said that it’s heartening to see cities take extreme heat seriously but emphasized that major challenges lie ahead.\nFor one, preparing early for extreme heat requires funding, which is a major challenge, especially for rural communities.\nEven trickier will be addressing the underlying social issues that get magnified during heat waves, such as homelessness, rising energy costs and economic inequality.", "location": "Florida", "classification": "natural-disasters", "score": 0.4918543988258561, "event_breakdown": "The extreme heat events."}, {"id": "a613b1ee-efc8-4ccd-818e-400f1b771824", "title": "Cranberry Portage wildfire evacuees could return home this weekend with rainy conditions expected - Winnipeg", "date": "2024-05-16 04:45", "url": "https://globalnews.ca/news/10499580/cranberry-portage-wildfire-evacuees-could-return-home-this-weekend-with-rainy-conditions-expected/", "message": "Send this page to someone via emailWith plenty of rain in the forecast the next few days in Northwestern Manitoba, provincial officials say evacuees forced from the area could return home by the weekend.\nThat optimistic outlook coming from the Manitoba Wildfire Service’s acting director Earl Simmons, who says while the fire near Flin Flon and Cranberry Portage hasn’t dropped in size, there’s some encouraging signs.\n“Our biggest concern at this time, the Cranberry Portage end of the fire, is probably 80 per cent contained, ” Simmons told 680 CJOB’s The News.\nThe province says the fire, that has caused around 580 people to evacuate, is around 31,600 hectares and impacting Cranberry Portage along with Sourdough Bay, Whitefish Lake, Twin Lakes, and Schist Lake North.\nThe latest provincial wildfire report shows that nine wildfires are burning in Manitoba, with two considered out of control.", "location": "WINNIPEG.", "classification": "natural-disasters", "score": 0.7372277799822572, "event_breakdown": ".\nHere is a list of natural-disasters events in Northwestern Manitoba wildfires:\n- A fire is threatening communities. \n- This fire has scorched about 32 square km and forced around 580 people to flee. \n- The fire is 80% contained according to the latest report from Wildfire Services in Manitoba. \n- This fire has forced around 580 people to evacuate. \n- This fire is considered a threat to homes."}, {"id": "5a7b64ea-1b41-47b7-bc9c-7888e6647493", "title": "Farming : Farming activities resume in southern Karnataka and Malnad regions after heavy rain , farmers hopeful for good monsoon | Mysuru News", "date": "2024-05-16 00:15", "url": "https://timesofindia.indiatimes.com/city/mysuru/farming-activities-resume-in-southern-karnataka-and-malnad-regions-after-heavy-rain-farmers-hopeful-for-good-monsoon/articleshow/110160497.cms", "message": "Rain showers relief, raises farmers fearsCoastal Saurashtra experienced unseasonal rain, dust storms, and cyclonic circulation, providing relief from summer heat but causing fears of crop damage.\nPre-monsoon mayhem shows Bengaluru is woefully unpreparedHeavy pre-monsoon rain in Bengaluru exposed BBMP's poor preparedness, lack of coordination, and vulnerabilities in storm-water drains.\nMysuru: Agricultural activities in southern Karnataka and Malnad regions have resumed following heavy rain in the region.\nFarmers have started sowing with the expectation of a good monsoon season in the coming days.Meanwhile, the inflow to the major reservoirs of this region is also gradually increasing.\nAccording to the data from the Karnataka State Natural Disaster Monitoring Centre (KSNDMC), all districts in the region recorded excess rain in the last seven days.According to KSNDMC data, in the last seven days, all the districts of the region recorded excess rain.", "location": "Mysuru", "classification": "natural-disasters", "score": 0.8349789259969884, "event_breakdown": ".\nHere are the natural-disasters events from the text:\n\n- Heavy pre-monsoon rain in Bengaluru\n- Rain showers in coastal Saurashtra\n- Cyclonic circulation in Saurashtra\n- Dust storms in Saurashtra\n- Pre-monsoon mayhem shows Bengaluru is woefully unprepared"}, {"id": "b03b53b5-9469-4610-8075-9b4a49d08a22", "title": "Wow !  Extreme  geomagnetic storm creates beautiful aurora over NJ", "date": "2024-05-16 01:30", "url": "https://sojo1049.com/ixp/385/p/wow-extreme-geomagnetic-storm-creates-beautiful-aurora-over-nj/", "message": "🌠 Extreme geomagnetic storm puts power grids, satellites at risk🌠 The same solar flares make Northern Lights visible in New Jersey🌠 Send us your jaw-dropping photos!\nThe first extreme solar storm in two decades is affecting Earth this weekend, creating paintings in New Jersey's night sky.\nAccording to the National Oceanic and Atmospheric Administration, the extreme conditions first reached the planet around 7 p.m. Friday.\nNorthern Lights visible in New JerseyWhile no major disruptions have been detected as of 10 a.m. Saturday, this extreme geomagnetic storm is making its impact in New Jersey.\nAnd scroll down to see some of the most inspiring photos from last night's Northern Lights.", "location": "New Jersey", "classification": "natural-disasters", "score": 0.5716562049805198, "event_breakdown": ".\nExtreme geomagnetic storm\nNorthern Lights visible in New Jersey"}, {"id": "9dc44488-0cde-4b6f-ad39-943e0fc6e247", "title": "How rain gardens can help prevent stormwater runoff", "date": "2024-05-16 04:15", "url": "https://www.cbsnews.com/detroit/news/science-of-weather-rain-gardens/", "message": "But what is a rain garden?\nBarbara Lucas, who also has a rain garden, said the purpose of collecting rainwater off the roof is to prevent it from leaking into the street and storm drains.\n\"A rain garden is a great way to keep the water on your property and going down into the groundwater to refill our aquifer,\" Lucas said.\nDaley, who has two rain gardens, said she uses a lot of Michigan native plants in her garden, and there's a specific reason for that.\nThese native plants are smart enough to know the ways of Michigan weather, and they can handle it.\"", "location": "MICHIGAN", "classification": "natural-disasters", "score": 0.6524400192331752, "event_breakdown": "- Rain gardens\n- Rainwater collecting off the roof"}, {"id": "be36cf13-49e4-4355-bdde-7ce03cabdc5e", "title": "Climate change could force Bangkok to move , official warns", "date": "2024-05-16 02:30", "url": "https://www.thenews.com.pk/print/1189648-climate-change-could-force-bangkok-to-move-official-warns", "message": "Thailand's Deputy DG Department of Climate change and Environment Pavich Kesavawong.\n— AFP/FileBANGKOK: Thailand may have to consider relocating its capital Bangkok because of rising sea levels, a senior official in the country’s climate change office said on Wednesday.\nProjections consistently show that low-lying Bangkok risks being inundated by the ocean before the end of the century.\nPavich Kesavawong, deputy director-general of the government’s department of climate change and environment, warned that the city might not be able to adapt with the world on its current warming pathway.\nThailand is suffering the effects of climate change across a range of sectors, from farmers struggling with heat and drought to tourism businesses affected by coral bleaching and pollution.", "location": "BANGKOK", "classification": "natural-disasters", "score": 0.44233176304020555, "event_breakdown": "Thailand also faces frequent floods, thunderstorms, and tropical storms. The country's disaster management system has been activated over the past month, and the situation is expected to improve in the rainy season.\nDuring this rainy season, Thailand regularly experiences flash floods, thunderstorms, and intermittent tropical storms. Recently, Thailand's disaster management system has been activated, and the government expects the situation to improve by November."}, {"id": "cb1bda7d-8e5a-4fb2-82d2-48717231418f", "title": "Drought shuttered Texa last sugar mill . Now , farmers are asking which crop is next ? ", "date": "2024-05-16 00:15", "url": "https://www.yahoo.com/news/drought-shuttered-texas-last-sugar-214010839.html", "message": "MERCEDES, Texas – The last sugar mill in Texas shut its doors last month, citing a lack of water.\n\"Our main water source is the Rio Grande River, which is also an international boundary with Mexico,\" England said.\nTEXAS DROUGHT, DRY HEAT LOWERING COTTON QUALITYFile: The Rio Grande River dividing Reynosa, Mexico (L) with Hidalgo, Texas in the United States (R).\nOut of his 2,500 acres, England only planted 500 acres of cotton and 120 acres of sorghum grain.\nOriginal article source: Drought shuttered Texas' last sugar mill.", "location": "MERCEDES, Texas", "classification": "natural-disasters", "score": 0.5523423080041258, "event_breakdown": "Drought, low water levels in the Rio Grande River"}, {"id": "c60dc7b4-30a6-4798-9be3-df98f817f891", "title": "Texas Governor Greg Abbott requests presidential disaster declaration following recent severe weather", "date": "2024-05-16 02:30", "url": "https://www.fox26houston.com/news/texas-governor-greg-abbott-requests-presidential-disaster-declaration-following-recent-severe-weather", "message": "Texas Governor Greg Abbott has sent a letter to President Joe Biden requesting a Presidential Disaster Declaration for Texas communities that were impacted by recent weather and flooding that began last month.\nThe Governor's letter requests individual assistance programs for seven impacted counties and public assistance programs for 26 impacted counties.\n\"Due to severe weather and flooding that continues to cause devastating damage in several of our communities, I am requesting a Presidential Disaster Declaration,\" Abbott said in a statement.\nThis Presidential Disaster Declaration will give local communities across to critical financial assistance that will help cover costs ranging from temporary housing and home repairs to grant funding for roads and bridges.\nI thank the Texas Division of Emergency Management for working with our local and federal partners to bolster Texas' recovery efforts across the state.\"", "location": "Texas", "classification": "natural-disasters", "score": 0.7385046588575057, "event_breakdown": "The following is the list of natural-disaster events extracted from the text:\nEvents in Texas:\n- Weather and flooding: Heavy rains and flooding affected several Texas communities, causing damage to roads and bridges, as well as homes and businesses.\n- Presidential Declaration: The governor of Texas has requested a Presidential Disaster Declaration for affected counties, which would provide critical financial assistance to help with recovery efforts."}, {"id": "0632cb9d-8a7e-4c29-8a93-36ac2d72b99a", "title": "FIRST ALERT : Impactful weather is expected Friday", "date": "2024-05-16 02:45", "url": "https://www.wtok.com/2024/05/15/first-alert-impactful-weather-is-expected-friday/", "message": "(WTOK) -After starting our work week with the threat of severe storms and flooding, it looks like we’ll end our work week the same.\nThen, more rain is expected overnight into Saturday AM... but the severe risk will be minimal.\nHowever, a few storms could develop Saturday afternoon as an upper disturbance slides by...and we’ll have to monitor those for isolated severe weather.\nAs for temps, upper 80s are expected Thursday with low 80s Friday.\nSaturday brings mid 80s with upper 80s for Sunday.", "location": "main location:\nJACKSON, MISSISSIPPI", "classification": "natural-disasters", "score": 0.6709647233288076, "event_breakdown": "The events mentioned in the text are:\n\n- Severe storms and flooding threat on Monday\n- More rain expected overnight into Saturday AM\n- Isolated severe storms possible on Saturday afternoon\n\nPlease note that this list may not be exhaustive and may be subject to change."}, {"id": "06d1803b-215c-410f-90f4-18079c8dd28c", "title": "Canadians are hopeful shifting winds may push wildfire away from the oil sands hub of ... ", "date": "2024-05-16 00:00", "url": "https://article.wn.com/view/2024/05/15/Canadians_are_hopeful_shifting_winds_may_push_wildfire_away__m/", "message": "Canadian officials say favorable winds are expected to push an “out of control” wildfire away from Canada’s oil sands hub of Fort McMurray, Alberta, a day after thousands were evacuated ...... read full story", "location": "The main location where the event takes place is Fort McMurray, Alberta, Canada.", "classification": "natural-disasters", "score": 0.46107016592190797, "event_breakdown": "Natural disasters:\n- Forest fires in Canada\n- Wildfire near Fort McMurray, Alberta"}, {"id": "c893536e-ea3c-4f43-821b-1f68a97bdbd2", "title": "NWS issues flood watch for burn scars in northern New Mexico", "date": "2024-05-16 12:15", "url": "https://www.kob.com/new-mexico/santa-fe-northern-new-mexico/nws-issues-flood-watch-for-burn-scars-wednesday-in-northern-new-mexico/", "message": "As we progress closer to monsoon season, there is one thing we are watching closely in northern New Mexico – burn scar flooding.\nALBUQUERQUE, N.M. – As we progress closer to monsoon season, there is one thing we are watching closely in northern New Mexico – burn scar flooding.\nOn Wednesday, we’ve seen some rain and thunderstorms pretty close to the burn scars.\nIt doesn’t take much for flooding to happen over our burn scars, either.\nThat is why the National Weather Service in Albuquerque has already put out a flood watch for the Calf Canyon/Hermits Peak burn scar and the McBride burn scar for Thursday.", "location": "NEW MEXICO.", "classification": "natural-disasters", "score": 0.8497055619586148, "event_breakdown": "1. Burn scar flooding in northern New Mexico\n2. Monsoon season\n3. Rain and thunderstorms close to the burn scars"}, {"id": "28cc2d6e-3706-47a4-ba5c-4dc28dac42b5", "title": "Fire threat eases near Canada oil sands hub , but a long , hot summer looms – Butler Eagle", "date": "2024-05-16 00:15", "url": "https://www.butlereagle.com/20240515/fire-threat-eases-near-canadas-oil-sands-hub-but-a-long-hot-summer-looms/", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city's southern end while others were on on alert.\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\n“They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,” Angus wrote.", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.49921967460927547, "event_breakdown": "List of Natural Disaster Events:\n- 2016 Fort McMurray Wildfire\n- Haze from 2016 Fort McMurray Wildfire"}, {"id": "6a038c5a-2796-46eb-ad63-5bbf40435223", "title": "Texas Governor Greg Abbott requests presidential disaster declaration following recent severe weather", "date": "2024-05-16 03:30", "url": "https://www.yahoo.com/news/texas-governor-greg-abbott-requests-223516884.html", "message": "HOUSTON - Texas Governor Greg Abbott has sent a letter to President Joe Biden requesting a Presidential Disaster Declaration for Texas communities that were impacted by recent weather and flooding that began last month.\nThe Governor's letter requests individual assistance programs for seven impacted counties and public assistance programs for 26 impacted counties.\n\"Due to severe weather and flooding that continues to cause devastating damage in several of our communities, I am requesting a Presidential Disaster Declaration,\" Abbott said in a statement.\nThis Presidential Disaster Declaration will give local communities across to critical financial assistance that will help cover costs ranging from temporary housing and home repairs to grant funding for roads and bridges.\nI thank the Texas Division of Emergency Management for working with our local and federal partners to bolster Texas' recovery efforts across the state.\"", "location": "Houston", "classification": "natural-disasters", "score": 0.7385046588575057, "event_breakdown": "1. Severe weather events.\n2. Flooding events."}, {"id": "94f6a33c-59f2-414d-b69a-d1b60c1527eb", "title": "After three devastating years of drought , there no future for our farm", "date": "2024-05-16 05:30", "url": "https://www.macleans.ca/undefined/farm-canada-climate-change/", "message": "Our farm has suffered for three years from the devastating droughts that’s struck farmers across Alberta, and that’s forced our hands.\nThe drought in 2021 was reportedly just as devastating as the Dirty Thirties, when my grandpa nearly lost everything in the dust bowl.\nThat drought reduced our hay crops, which we used to feed to our animals, to nothing.\nThe Canadian Drought Monitor classified the severity as “exceptional drought,” a label reserved for once-in-50-year events.\nWe were running out of options, and there was no carryover hay thanks to the drought in 2022.", "location": "The main location is the Canadian province of Alberta.", "classification": "natural-disasters", "score": 0.618773889632059, "event_breakdown": "- The devastating droughts in 2021 reduced farmers’ crops in Alberta to nothing. -  The Canadian Drought Monitor classified the severity of the drought as \"exceptional drought\"."}, {"id": "a75713dd-d16a-401b-a17e-e833c7b0f8e4", "title": "Houston weather : FOX 26 Storm Alert Day issued for Thursday through early Friday", "date": "2024-05-16 03:30", "url": "https://www.yahoo.com/news/houston-weather-fox-26-storm-224755249.html", "message": "HOUSTON - You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nWe will cover every angle of this severe and flood threat where you live on our smart TV app, FOX Local, so download it and check it out!", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.952343855438303, "event_breakdown": "-Heavy Rain\n-Strong to Severe Storms\n-Hail\n-Damaging Winds\n-Flooding"}, {"id": "dd0eb9f9-7a0f-48a2-af5c-e7674b220366", "title": "Rare  high risk  warning for flash flooding issued in Texas , Louisiana", "date": "2024-05-16 14:00", "url": "https://abcnews.go.com/US/rare-high-risk-warning-flash-flooding-issued-texas/story?id=110298719", "message": "A rare \"high risk\" warning for flash flooding has been issued in Texas and Louisiana as the states brace for up to 9 inches of rain in the next 24 hours.\n\"High risk\" days account for just 4% of days, but they are responsible for more than one-third of flooding deaths, according to the Weather Prediction Center.\nBesides the rain, damaging winds, large hail and a few tornadoes are also forecast to hit Texas on Thursday.\nSome of that severe weather will move into Louisiana Thursday evening, with damaging winds possible in Lake Charles and Alexandria.\nDamaging winds, hail and possible tornadoes will threaten New Orleans; Jackson, Mississippi; Mobile, Alabama; and Pensacola, Florida.", "location": "Louisiana", "classification": "natural-disasters", "score": 0.9349296184497639, "event_breakdown": "1. Flash Flooding in Texas and Louisiana\n2. Damaging Winds in Texas\n3. Damaging Winds in Louisiana\n4. Damaging Winds in Lake Charles\n5. Damaging Winds in Alexandria\n6. Damaging Winds in New Orleans\n7. Damaging Winds in Jackson, Mississippi\n8. Damaging Winds in Mobile, Alabama\n9. Damaging Winds in Pensacola, Florida\n10. Damaging Winds in Pensacola, Florida"}, {"id": "7f25ceee-e2fb-4d72-bd00-5c1cfee87b13", "title": "Texas and Louisiana flooding : Rare high risk of extreme rainfall to trigger  life - threatening  flooding", "date": "2024-05-16 15:30", "url": "https://us.cnn.com/2024/05/16/weather/south-flooding-texas-louisiana-climate/", "message": "CNN —A dangerous, life threatening flash flooding event is unfolding Thursday as torrential storms pound the already-soaked South.\nA rare Level 4 of 4 high risk of excessive rainfall was issued for parts of eastern Texas and western Louisiana by the Weather Prediction Center Thursday.\nA few spots caught under multiple torrential storms may pick up 8 inches or more of rain.\nTexas and Louisiana have been in the bull’s-eye of seemingly unrelenting rounds of torrential, flooding downpours since the start of April.\nSerious flash flooding is likely in any areas caught under multiple storms unloading 2 to 3 inches of rain per hour.", "location": "TEXAS", "classification": "natural-disasters", "score": 0.9450979073524752, "event_breakdown": ".\nFlash flooding event in Southern Texas and Western Louisiana."}, {"id": "73c73fab-7dfd-49a1-b655-a5e304d1bd63", "title": "Flood - Prone Houston Faces a Deluge of More Rain : Weather Watch", "date": "2024-05-16 18:45", "url": "https://www.insurancejournal.com/news/southcentral/2024/05/16/774512.htm", "message": "Heavy rain will sweep across eastern Texas into Louisiana and Mississippi on Thursday, raising flood risks across the Gulf of Mexico states.\nFlood watches have been posted from Dallas and Houston eastward across Louisiana and Mississippi.\nFlood-prone Houston saw waters rising earlier this month, closing roads, affecting energy supplies and sending residents fleeing.\nModerate geomagnetic storms are likely in coming days, the US Space Weather Prediction Center said.\nTopics Texas Louisiana Flood Mississippi", "location": "Louisiana", "classification": "natural-disasters", "score": 0.8455155970646696, "event_breakdown": "Heavy rain will sweep across eastern Texas into Louisiana and Mississippi on Thursday, raising flood risks, flood watches from Dallas and Houston eastward across Louisiana and Mississippi will be posted."}, {"id": "d71cd1c6-464f-414b-a18d-cc988d3cbdbe", "title": "Flood - Prone Houston Faces a Deluge of More Rain : Weather Watch", "date": "2024-05-16 16:45", "url": "https://www.bnnbloomberg.ca/flood-prone-houston-faces-a-deluge-of-more-rain-weather-watch-1.2074027", "message": "Heavy rain will sweep across eastern Texas into Louisiana and Mississippi on Thursday, raising flood risks across the Gulf of Mexico states.\nFlood watches have been posted from Dallas and Houston eastward across Louisiana and Mississippi.\nFlood-prone Houston saw waters rising earlier this month, closing roads, affecting energy supplies and sending residents fleeing.\nOravec said the heaviest rains will move east into Louisiana and Mississippi, giving Texas a potential respite on Friday.\nModerate geomagnetic storms are likely in coming days, the US Space Weather Prediction Center said.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.8245180316895039, "event_breakdown": "Floods in Texas, Louisiana, Mississippi, and parts of the Gulf of Mexico."}, {"id": "401e0a11-bf49-4322-899e-db87d9e19245", "title": "Moderate earthquake : M5 . 3 quake has struck near Tobelo in Indonesia", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-3-quake-has-struck-near-tobelo-in-indonesia/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was detected on Tuesday, 152 km WNW of Tobelo, Indonesia (94 miles).\nThe earthquake occurred at a depth of 35 km (22 miles) below the earth’s surface.\nExact location of earthquake, 126.7684° East, 2.3081° North, depth 35 km.\nDate and time of earthquake in UTC/GMT: 30/04/24 / 2024-04-30 13:52:43 / April 30, 2024 @ 1:52 pm.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 152 km WNW of Tobelo, Indonesia.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.8990862980430203, "event_breakdown": ".\nA moderate earthquake with magnitude 5.3 (ml/mb) was detected on Tuesday, 152 km WNW of Tobelo, Indonesia (94 miles). The earthquake occurred at a depth of 35 km (22 miles) below the earth’s surface. Exact location of earthquake, 126.7684° East, 2.3081° North, depth 35 km. Date and time of earthquake in UTC/GMT: 30/04/24 / 2024-04-30 13:52:43 / April 30, 2024 @ 1:52 pm."}, {"id": "7061c211-265b-4a99-adc3-297b29459530", "title": "Moderate earthquake 5 . 3 mag , South Sandwich Islands region", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-south-sandwich-islands-region-2/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has occurred on Thursday, South Sandwich Islands region (0 miles).\nExact location of earthquake, -27.01° West, -55.8567° South, depth 12.416 km.\nIds that are associated to the earthquake: us6000mvmb.\nIn the past 24 hours, there have been twelve, in the last 10 days fourteen, in the past 30 days sixteen and in the last 365 days sixteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: South Sandwich Islands region.", "location": ".\nThe location of the earthquake is South Sandwich Islands region.", "classification": "natural-disasters", "score": 0.810296931792075, "event_breakdown": ".\nEarthquake detected near: South Sandwich Islands region."}, {"id": "6f8153c7-f95b-44d0-87ff-471e4c6004fd", "title": "Moderate earthquake , 5 . 4 mag was detected near Kermadec Islands , New Zealand", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-kermadec-islands-new-zealand/", "message": "A moderate earthquake with magnitude 5.4 (ml/mb) was detected on Sunday, Kermadec Islands, New Zealand (0 miles).\nExact time and date of earthquake 12/05/24 / 2024-05-12 03:26:19 / May 12, 2024 @ 3:26 am UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Kermadec Islands, New Zealand.", "location": ")\nKermadec Islands, New Zealand", "classification": "natural-disasters", "score": 0.9611165742838714, "event_breakdown": ".\nThe list below includes 0 reports on Natural-Disaster events:\n\n- A strong earthquake occurred in Kermadec Islands, New Zealand on Sunday."}, {"id": "53a2e276-19bc-4c0e-8860-f67c930b8b81", "title": "Moderate earthquake , 5 . 3 mag has occurred near Kermadec Islands , New Zealand", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-kermadec-islands-new-zealand/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Sunday, Kermadec Islands, New Zealand (0 miles).\nExact time and date of earthquake 05/05/24 / 2024-05-05 06:15:37 / May 5, 2024 @ 6:15 am UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -178.6294 West, latitude -29.4481 South, depth = 216.068 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Kermadec Islands, New Zealand.", "location": ")\nNew Zealand is the most specific location.", "classification": "natural-disasters", "score": 0.972005685106144, "event_breakdown": ".\nbebeppe11pl, Not registered or logged in."}, {"id": "79feee15-db8a-467d-a7f7-efcecaa8d4a0", "title": "Moderate earthquake , 5 . 4 mag was detected near Pacific - Antarctic Ridge", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-pacific-antarctic-ridge-2/", "message": "A moderate earthquake magnitude 5.4 (ml/mb) strikes Pacific-Antarctic Ridge (0 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000myih.\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Pacific-Antarctic Ridge.", "location": ".\nPacific-Antarctic Ridge", "classification": "natural-disasters", "score": 0.9654856741665324, "event_breakdown": ".\n2021 Pacific-Antarctic Ridge earthquake\nThe Pacific-Antarctic Ridge earthquake magnitude of 5.4 (ml/mb) on Tuesday, 2021-12-28 10:22:01. A tsunami warning has not been issued."}, {"id": "9dd6dd8f-5f24-4361-bc3d-769d66b3615a", "title": "Moderate earthquake , 5 . 3 mag has occurred near central East Pacific Rise", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-central-east-pacific-rise/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) strikes central East Pacific Rise (0 miles) on Monday.\nId of earthquake: us6000my7f.\nExact location of earthquake, -103.7904° West, -4.0317° South, depth 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: central East Pacific Rise.", "location": ")\ncentral East Pacific Rise", "classification": "natural-disasters", "score": 0.9668647692277772, "event_breakdown": "List:\n- Earthquake\n  - Magnitude 5.3"}, {"id": "07f36e42-6df7-453f-bd2a-9bf23e8788ce", "title": "Moderate earthquake , 5 . 3 mag has occurred near Mid - Indian Ridge", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-mid-indian-ridge-3/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has occurred on Saturday, Mid-Indian Ridge (0 miles).\nDate and time of earthquake in UTC/GMT: 27/04/24 / 2024-04-27 01:44:21 / April 27, 2024 @ 1:44 am.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nIn the past 24 hours, there have been thirty-nine, in the last 10 days thirty-nine, in the past 30 days thirty-nine and in the last 365 days thirty-nine earthquakes of magnitude 3.0 or greater that have been detected in the same area.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Mid-Indian Ridge.", "location": ".\nMid-Indian Ridge.", "classification": "natural-disasters", "score": 0.8661927783153235, "event_breakdown": ".\n* A moderate earthquake magnitude 5.3 (ml/mb) has occurred on Saturday, April 27, 2024 01:44:21 / April 27, 2024 @ 1:44 am (local time epicenter).\n* Date and time of earthquake in UTC/GMT: 27/04/24 / 2024-04-27 01:44:21 / April 27, 2024 @ 1:44 am.\n* The earthquake occurred at a depth of 10 km (6 miles) below the earth's surface.\n* In the past 24 hours, there have been thirty-nine, in the last 10 days thirty-nine, in the past 30 days thirty-nine and in the last 365 days thirty-nine earthquakes of magnitude 3.0 or greater that have been detected in the same area.\n* The number of tectonic quakes (M 3.0+) increased by a factor of 1."}, {"id": "12d742e4-7791-4d61-8061-30c993fbfe3e", "title": "Moderate earthquake 5 . 3 mag , 97 km NNW of Finschhafen , Papua New Guinea", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-97-km-nnw-of-finschhafen-papua-new-guinea/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was detected on Sunday, 97 km NNW of Finschhafen, Papua New Guinea (60 miles).\nEvent ids that are associated to the earthquake: us6000mxsc.\nId of event: us6000mxsc.\nIn the past 24 hours, there have been four, in the last 10 days five, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 97 km NNW of Finschhafen, Papua New Guinea.", "location": "Papua New Guinea", "classification": "natural-disasters", "score": 0.7694751181761028, "event_breakdown": ".\ne. Magnitude 5.3 earthquake strikes 97 km NNW of Finschhafen, Papua New Guinea"}, {"id": "eb7c5178-5bed-466d-9adf-479d37e8472d", "title": "Moderate earthquake , 5 . 3 mag strikes near Höfn in Iceland", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hofn-in-iceland/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Sunday, 119 km WNW of Höfn, Iceland (74 miles).\nEvent ids that are associated to the earthquake: us7000mdlk.\nId of event: us7000mdlk.\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 119 km WNW of Höfn, Iceland.", "location": ")\nIceland", "classification": "natural-disasters", "score": 0.861501807563859, "event_breakdown": "The earthquake is listed in linked reports ranging from 5.2 to 5.3 in magnitude, located around 119 kilometers away from Höfn, Iceland."}, {"id": "3b1f9f2b-8d0e-4d54-8143-23fcc009b2ec", "title": "Moderate earthquake , 5 . 4 mag was detected near Rabaul in Papua New Guinea", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-rabaul-in-papua-new-guinea-2/", "message": "A moderate earthquake with magnitude 5.4 (ml/mb) was detected on Thursday, 83 kilometers (52 miles) from Rabaul in Papua New Guinea.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nClose country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nEpicenter of the earthquake was 102 km (64 miles) from Kokopo (c. 26 300 pop), 85 km (53 miles) from Rabaul (c. 8 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 83 km WNW of Rabaul, Papua New Guinea.", "location": "Papua New Guinea", "classification": "natural-disasters", "score": 0.8093178286291685, "event_breakdown": "Earthquake in Papua New Guinea on April 21, 2022"}, {"id": "6d580aef-1bb6-487e-8a3d-37879a653d94", "title": "Moderate earthquake 5 . 3 mag , 71 km NNW of Neiafu , Tonga", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-71-km-nnw-of-neiafu-tonga/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 71 kilometers (44 miles) from Neiafu in Tonga on Wednesday.\nThe earthquake was roughly at a depth of 138.285 km (86 miles).\nExact location of event, depth 138.285 km, -174.1443° West, -18.0276° South.\nEarthquake epicenter was 71 km (44 miles) from Neiafu (c. 4 300 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 71 km NNW of Neiafu, Tonga.", "location": "Neiafu", "classification": "natural-disasters", "score": 0.853509569567644, "event_breakdown": ".\n1. A moderate earthquake with magnitude 5.3 (ml/mb) was reported 71 kilometers (44 miles) from Neiafu in Tonga on Wednesday.\n2. The earthquake was roughly at a depth of 138.285 km (86 miles).\n3. Exact location of event, depth 138.285 km, -174.1443° West, -18.0276° South.\n4. Earthquake epicenter was 71 km (44 miles) from Neiafu (c. 4 300 pop)."}, {"id": "1297868b-f63c-4bcd-a34b-71fcc946cb1d", "title": "Moderate earthquake , 5 . 3 mag was detected near Basco in Philippines", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-was-detected-near-basco-in-philippines/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 74 kilometers (46 miles) from Basco in Philippines on Tuesday.\nThe earthquake occurred at a depth of 19.555 km (12 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent epicenter was 75 km (46 miles) from Basco (c. 7 300 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 74 km WSW of Basco, Philippines.", "location": ".\nBasco", "classification": "natural-disasters", "score": 0.9714899783667515, "event_breakdown": "Related volcano monitoring:\nEvent ID: 2022-040014 (no Location)\nVolcanic ash advisory (MIROVA):\nVolcanic ash advisory 17 2022-Apr-12 13:12:06.9 UTC\nEvent ID: 2022-040014 (no Location)\nVolcanic ash advisory 14 2022-Apr-12 10:00:589.6 UTC\nThe events described are five earthquakes with magnitudes of 5.3, 4.4, 5.4, 5.1, and 5.4, respectively."}, {"id": "7d2800d9-9dda-4638-aca1-051050375e2f", "title": "Moderate earthquake , 5 . 3 mag was detected near Port - Olry in Vanuatu", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-was-detected-near-port-olry-in-vanuatu/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Saturday, 44 kilometers (27 miles) from Port-Olry in Vanuatu.\nCountry/countries that might be effected, Vanuatu (c. 222 000 pop).\nEpicenter of the event was 97 km (60 miles) from Luganville (c. 13 400 pop), 95 km (59 miles) from Sola (c. 1 200 pop).\nIn the past 24 hours, there have been twelve, in the last 10 days thirteen, in the past 30 days thirteen and in the last 365 days thirteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 44 km NNE of Port-Olry, Vanuatu.", "location": "Port-Olry in Vanuatu", "classification": "natural-disasters", "score": 0.7892067300233873, "event_breakdown": ".\nmoderate earthquake of magnitude 5.3, Vanuatu on Saturday."}, {"id": "d690aabd-06cc-4170-aebc-320e685d7aec", "title": "Moderate earthquake , 5 . 3 mag strikes near Hualien City in Taiwan", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hualien-city-in-taiwan-2/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 24 kilometers (15 miles) from Hualien City in Taiwan on Monday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 12.232 km (8 miles) below the earth’s surface.\nCountry/countries that might be effected, Taiwan (c. 22 894 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 24 km S of Hualien City, Taiwan.", "location": "Hualien City", "classification": "natural-disasters", "score": 0.9758506823752086, "event_breakdown": ".\n1. On Monday, September 20th, 2021, a 5.3 magnitude earthquake occurred 24 kilometers (15 miles) from Hualien City, Taiwan.\n2. The earthquake occurred at a depth of 12.232 km (8 miles) below the earth’s surface.\n3. No tsunami warning was issued.\n4. The earthquake affected Taiwan (c. 22 894 000 pop)."}, {"id": "82503d22-505f-4b56-a6e4-d4411b58d4c0", "title": "Clay Humane shares do and donts to get your pets storm ready", "date": "2024-05-16 15:15", "url": "https://www.news4jax.com/news/local/2024/05/16/clay-humane-shares-dos-and-donts-to-get-your-pets-storm-ready/", "message": "Identify Pet-Friendly Shelters: Not all shelters accept pets, and the ones that do may have limitations on which animals they allow.\nDon’ts:Don’t Leave Pets Outside: It isn’t safe to leave pets outside during a storm.\nDon’t Leave Pets Behind: If you evacuate, be sure to take your animals with you.\n“This leaves pet owners at risk of not finding essential pet supplies or being equipped to evacuate and find pet-friendly shelters.\nFollowing these do’s and don’ts can set pet owners and their animals up for a safer hurricane season.”", "location": "With the given information, I did not find a specific location for the event.", "classification": "natural-disasters", "score": 0.5953470050746226, "event_breakdown": "Natural-disaster Events:\n1. Storms\n2. Hurricanes"}, {"id": "48df36a7-6714-4191-8938-ecfec73441ca", "title": "Moderate earthquake , 5 . 3 mag strikes near Hualien City in Taiwan", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hualien-city-in-taiwan/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 30 kilometers (19 miles) from Hualien City in Taiwan on Monday.\nExact location of event, longitude 121.6098 East, latitude 23.7004 North, depth = 8.892 km.\nThe earthquake occurred at a depth of 8.892 km (6 miles) below the earth’s surface.\nNearby country/countries, Taiwan (c. 22 894 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 30 km S of Hualien City, Taiwan.", "location": "Taiwan", "classification": "natural-disasters", "score": 0.9142310619384859, "event_breakdown": ".\nA moderate earthquake with magnitude 5.3 (ml/mb) was reported 30 kilometers (19 miles) from Hualien City in Taiwan on Monday."}, {"id": "3233ee17-d6e1-49d0-ab87-d95c83381f41", "title": "Fort Nelson , B . C ., wildfire expands to 127 sq km but cooler temps expected", "date": "2024-05-16 18:00", "url": "https://globalnews.ca/news/10500486/fort-nelson-bc-fire-size-latest/", "message": "See more sharing optionsSend this page to someone via emailShare this item on TwitterShare this item via WhatsAppShare this item on FacebookBritish Columbia’s wildfire service says the blaze threatening the northern community of Fort Nelson now spans nearly 130 square kilometres, but it had spread away from the town along its southern flank.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nIt says cooler temperatures and higher relative humidity were expected to make for more favourable conditions over the next couple of days fighting the fire that was only two kilometres southwest of the town earlier this week.\nStory continues below advertisementThere may be some light rain, but the BC Wildfire Service says it won’t be enough to “offset the prolonged drought and cause the fires to self-extinguish.”Breaking news from Canada and around the world sent to your email, as it happens.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, told a community meeting that he now feels confident they will get word eventually that the fire is not threatening the community.", "location": "Fort Nelson", "classification": "natural-disasters", "score": 0.71897909426373, "event_breakdown": "Here are the natural-disasters events from the text:\n- A wildfire in British Columbia, Canada\n- The Parker Lake fire, which threatens the northern community of Fort Nelson and spans nearly 130 square kilometres"}, {"id": "0b35f8dd-6e13-40be-8099-ad14db5a971e", "title": "Local officials keeping eye on busy hurricane season forecast", "date": "2024-05-16 16:45", "url": "https://coastalcourier.com/news/local-officials-keeping-eye-busy-hurricane-season-forecast/", "message": "Predictions are calling for a busier than usual Atlantic storm season, and Liberty County officials have begun getting organized for a potentially active summer and fall.\nHurricane season begins June 1 and ends November 30.\nForecasters at Colorado State University are predicting an unusually active Atlantic hurricane season, with 23 named storms, 11 hurricanes and five major hurricanes.\nWater temperatures in the eastern and central Atlantic are at record warm levels and are expected to remain well above average for the upcoming hurricane season.\nCSU’s forecast team anticipates a well above-average probability for major hurricanes making landfall along the U.S. coast for the 2024 hurricane season.", "location": "Based on the text, the main location where the main event takes place is 'Liberty County, Florida'.", "classification": "natural-disasters", "score": 0.9272236314848052, "event_breakdown": "Atlantic hurricane season.\nWarm water temperatures.\nhurricane landfall prediction.\n23 named storms.\n11 hurricanes.\n5 major hurricanes."}, {"id": "db395a8b-804b-4759-a844-17a45d7c898a", "title": "Local officials keeping eye on busy hurricane season forecast", "date": "2024-05-16 16:45", "url": "https://www.bryancountynews.com/news/local-officials-keeping-eye-busy-hurricane-season-forecast/", "message": "Predictions are calling for a busier than usual Atlantic storm season, and Liberty County officials have begun getting organized for a potentially active summer and fall.\nHurricane season begins June 1 and ends November 30.\nForecasters at Colorado State University are predicting an unusually active Atlantic hurricane season, with 23 named storms, 11 hurricanes and five major hurricanes.\nWater temperatures in the eastern and central Atlantic are at record warm levels and are expected to remain well above average for the upcoming hurricane season.\nCSU’s forecast team anticipates a well above-average probability for major hurricanes making landfall along the U.S. coast for the 2024 hurricane season.", "location": "The most active part of Atlantic Ocean is the eastern and central part of the ocean.", "classification": "natural-disasters", "score": 0.9272236314848052, "event_breakdown": "1. 23 named storms\n2. 11 hurricanes\n3. 5 major hurricanes\n4. Record warm ocean temperatures (ocean)\n5. U.S. coast major hurricanes (U.S)\n6. Busy Atlantic storm season\n7. Hurricane season\n8. Forecasters\n9. Colorado State University\n10. Warm ocean temperatures\n11. Major hurricanes\n12. Making landfall"}, {"id": "5ed509df-e2f7-4170-9aa9-8992fa112bfd", "title": "Prepare for the Coming Storm Season at Port St . Lucie 2024 Hurricane Expo", "date": "2024-05-16 16:45", "url": "https://www.wqcs.org/wqcs-news/2024-05-16/prepare-for-the-coming-storm-season-at-port-st-lucies-2024-hurricane-expo", "message": "Port St. Lucie - Thursday May 16, 2024: Hurricane season is right around the corner, which makes now the perfect time to start preparing.\nThe 18th annual Hurricane Preparedness Expo will take place Saturday, June 1 from 10 a.m. to 2 p.m. at MIDFLORIDA Event Center, located at 9221 SE Event Center Place in Port St. Lucie.\nThis free, family-friendly event connects residents with businesses and emergency providers who can help them prepare for extreme weather situations.\nThis year’s Expo will feature informative presentations from meteorologists, emergency managers, City of Port St. Lucie staff and community organizations that can assist with hurricane preparations.\nWhile supplies last, attendees will receive a tote bag with hurricane and preparedness information, and those who complete the scavenger hunt will receive a water bottle.", "location": "Port St. Lucie", "classification": "natural-disasters", "score": 0.8321810980352679, "event_breakdown": "- Hurricane season\n- The 18th annual Hurricane Preparedness Expo"}, {"id": "b1b9767c-848f-40f4-8d84-7bf6c24ace41", "title": "Huge wildfires burn across Canada", "date": "2024-05-16 15:30", "url": "https://www.cbc.bb/news/international-news/huge-wildfires-burn-across-canada/", "message": "Fire officials warn slight changes in weather conditions or wind direction could quickly place nearby homes and businesses at risk.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nBut that is far from the amount of precipitation needed to offset drought conditions and extinguish the fires, the British Columbia Wildfire Service said.\n“Because the conditions are so extremely dry up there, the fires burned down deep,” Earl Simmons, the director of the Manitoba Wildfire Service, told CBC.\n“This region has experienced multiple years of drought, with a below normal snowpack this past winter,” said Ben Boghean, fire behavior specialist for the BC Wildfire Service.", "location": "Fort McMurray in Alberta", "classification": "natural-disasters", "score": 0.932383229036528, "event_breakdown": "- Wildfires - Fort McMurray, Alberta\n- Drought - British Columbia\n- Fires - Manitoba"}, {"id": "96d06778-ec51-461b-bd9c-81eef5ac6543", "title": "Wildfire approaches Canada largest oil - producing area . again . | World News", "date": "2024-05-16 15:30", "url": "https://indianexpress.com/article/world/wildfire-approaches-canadas-largest-oil-producing-9333513/", "message": "A wildfire near Canada’s largest oil-producing region prompted the evacuation of about 6,600 people Tuesday from Fort McMurray, Alberta.\nOn Wednesday morning, the leading edge of the fire was about 3 miles from parts of Fort McMurray.\nAlberta Wildfire said diminishing winds and cooler temperatures were reducing the fire’s severity.\nBut she said the strong winds that were expanding the fire while pushing it toward Fort McMurray had weakened and reversed direction Wednesday.\n“Please, please allow these communities to evacuate first,” Butz told residents during a news conference Tuesday.", "location": "EDMONTON", "classification": "natural-disasters", "score": 0.8048293516168926, "event_breakdown": "Here are the natural-disasters events related in the text:\n1. Wildfire in Canada near Canada’s largest oil-producing region:\n- people who were evacuated about 6,600 people from Fort McMurray, Alberta.\n- leading edge of the fire was about 3 miles from parts of Fort McMurray.\n2. Wildfire reducing the fire’s severity that helped diminish its expansion:\n- a wildfire near Canada’s largest oil-producing region\n- on Wednesday, Beiseker was evacuated and the wildfire moving toward it was weakening and reversed direction, diminishing fires."}, {"id": "669d9e84-d518-48dd-b3a6-247feb505b60", "title": "  Short fuse storm are a major concern as Florida prepares for hurricane season", "date": "2024-05-16 19:00", "url": "https://www.wfit.org/tropical-weather/2024-05-16/short-fuse-storms-are-a-major-concern-as-florida-prepares-for-hurricane-season", "message": "“These short fuse storms are hurricane emergencies that require the ability to put action plans into place on constrained or reduced timelines — not even five days out,” National Hurricane Center Director Mike Brennan said during the annual Governor’s Hurricane Conference in West Palm Beach.\nForecasters are also able to better predict storm surge and wind field, helpfully explained in simple graphics.\nDaniel Kozin / AP This aerial photo shows homes surrounded by floodwaters in Steinhatchee, Fla., Wednesday, Aug. 30, 2023, left behind by Hurricane Idalia.\n“There were no storm surge fatalities in Idalia in Florida,” Brennan said.\nWe're going to stage, like we did in Hurricane Idalia, 8,000 National Guard members.", "location": "Florida", "classification": "natural-disasters", "score": 0.7979440781130019, "event_breakdown": "2 hurricane emergencies, with action plans put into place on constrained or reduced timelines - not even 5 days out\n1 tropical cyclone, Hurricane Idalia\n1 storm surge, caused by the storm after five days\n1 no storm surge fatalities in Hurricane Idalia after five days\n1 many homes in Florida, surrounded by floodwaters left behind by Hurricane Idalia."}, {"id": "8e0cf7ca-0a33-4d4a-81f6-d3c126873da7", "title": "Damaging thunderstorms to jolt Gulf Coast states into the weekend", "date": "2024-05-16 16:45", "url": "https://www.yahoo.com/news/damaging-thunderstorms-jolt-gulf-coast-151035425.html", "message": "AccuWeather meteorologists are tracking new episodes of severe weather that are forecast to erupt into the weekend.\nWhile hazardous weather will shift eastward across the South into Saturday, the central Plains will once again take center stage for damaging thunderstorms by the end of the weekend.\n\"An active pattern across the Southern states and Gulf Coast will continue with more rounds of potentially severe thunderstorms and flooding downpours from Friday into Saturday,\" AccuWeather Senior Meteorologist Dan Pydynowski said.\n\"Severe thunderstorms could cause isolated tornadoes, damaging wind gusts and hail in this zone,\" Pydynowski said.\nGET THE FREE ACCUWEATHER APPThe risk of severe weather will continue into the weekend, at least in a localized fashion.", "location": "The central Plains.", "classification": "natural-disasters", "score": 0.8229329519720696, "event_breakdown": ".\n- Tornadoes\n- Severe thunderstorms\n- Flooding downpours"}, {"id": "95369bae-c086-4b4d-ad70-3abab61ca911", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 16:45", "url": "https://kicks105.com/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country.", "location": "The most specific location in the event is East Texas.", "classification": "natural-disasters", "score": 0.9436164254161378, "event_breakdown": "The severe storms and the high rainfall amounts in East Texas and western Louisiana."}, {"id": "da5b8de4-9fce-45b3-a3d1-e0814ce480cc", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 18:30", "url": "https://kfox95.com/ixp/151/p/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country.", "location": "BEAUMONT, TEXAS", "classification": "natural-disasters", "score": 0.9436164254161378, "event_breakdown": "High-Impact Event: Severe Thunderstorm and Flash Flooding\nLow-Impact Event: Large to Very-Large Hail\nLarge to very large hail threat is expected from central Texas through much of the Hill Country."}, {"id": "0ecaeb5d-eced-4366-a986-09bcfbacbfc4", "title": "Fire threat eases near Canada oil sands hub , but long , hot summer looms", "date": "2024-05-16 16:45", "url": "https://www.naharnet.com:443/stories/en/305262-fire-threat-eases-near-canada-s-oil-sands-hub-but-long-hot-summer-looms", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city's southern end while others were on on alert.\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\n\"They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,\" Angus wrote.", "location": "Fort MacMurray", "classification": "natural-disasters", "score": 0.49921967460927547, "event_breakdown": "Here is the text with the events listed in bold:\nBut scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nDuring May, twowildfires burned in the forests around the city.Dozens ofgassandoil wells in Fort McMurray, Alta. were destroyedMonday by lightning.\nCanadian Prime Minister Justin Trudeau declined to say if he would help the oil and gas companies in Fort McMurray, but did say the federal government would offer \"every support\" to those affected by the fires.\nTwo displaced families are suing the provincial and federal governments for allegedly failing to protect the region from the effects of climate change.\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nAbitibiBowater, which owns the mills, has not yet received the permits necessary to rebuild.\nEmergency officials in Fort McMurray said the fires were spreading north and east through the city.And another fire in the south of the town remains out of control.\nResidents who were told to leave north and central Fort McMurray should head south, emergency management said.\nAn emergency official says it is still too early to determine the cause of the fires.\nScientists say the wildfires could lead to health problems including heart disease, lung disease, and cancer.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\nFort McMurray is in crisis.\nHere is the list of events extracted from the text:\n-Dozens of oil and gas wells in Fort McMurray, Alberta were destroyed Monday by lightning.\n-Two fires remain out of control in Fort McMurray, Alberta, with fire officials asking for more aircraft to fight the fires."}, {"id": "2263608b-86da-4122-8fab-f7b99020d306", "title": "Province urges British Columbians to be  FireSmart  ahead of long weekend", "date": "2024-05-16 17:45", "url": "https://globalnews.ca/news/10500567/bc-firesmart-long-weekend/", "message": "Send this page to someone via emailThe government of British Columbia is urging its residents and community members to be cautious and “FireSmart” ahead of the coming Victoria Day long weekend.\nWildfires near Fort Nelson and the Fort Nelson First Nation have already resulted in evacuation orders and alerts for several communities in northeastern B.C.\nduring wildfire season are encouraged to stay up to date with the upgraded BC Wildfire Service mobile app.\nThe app will provide critical information such as evacuation orders and alerts, fire bans and wildfire details.\nFor the upcoming Victoria Day long weekend, the government is warning that there will be an increase in traffic volume around the province.", "location": "BC", "classification": "natural-disasters", "score": 0.6428237160599694, "event_breakdown": "Wildfires near Fort Nelson and the Fort Nelson First Nation have resulted in evacuation orders impacting several communities in northeastern B.C."}, {"id": "3d2168b0-d047-4c3a-b3ba-6905c09b22dd", "title": "Less than a third of Iowa has drought", "date": "2024-05-16 18:00", "url": "https://www.yahoo.com/news/less-third-iowa-drought-162602963.html", "message": "(Courtesy of National Drought Mitigation Center)The state’s dryness has subsided to a level comparable with about a year ago, and less than a third of Iowa now has drought, according to the U.S. Drought Monitor.\nA Thursday report — which is a snapshot of the conditions two days before — said about 27% of the state has some measure of drought.\nAlmost all of the remaining drought resides in the northeast quadrant of the state, and most of that drought is classified as “severe.”About 92% of the topsoil in farm fields has adequate or surplus moisture for growing crops, the USDA reported Monday.\nThose totals might exceed two inches in parts of northern and eastern Iowa.\nThe post Less than a third of Iowa has drought appeared first on Iowa Capital Dispatch.", "location": "IOWA", "classification": "natural-disasters", "score": 0.5440035807247902, "event_breakdown": ".\nThe events listed in this text are:\n- drought\n- excess moisture"}, {"id": "e1d4e731-3274-42b5-9b0c-e0dabc7fc90e", "title": "Expect Heavy Rain", "date": "2024-05-16 16:45", "url": "https://easttexasradio.com/expect-heavy-rain/", "message": "However, the primary concern is heavy rain and flooding, likely due to prolonged heavy rainfall.\nStorms will progress from northwest to southeast, beginning in western North Texas this morning and moving into Central Texas early in the afternoon.\nFlash flooding is likely to occur, mainly south of I-20, where you can expect the heaviest rain, with the grounds already saturated by recent rainfall.\nRainfall amounts of 3 to 5 inches will be likely, with isolated higher amounts possible.\nAn enhanced risk for severe weather has been introduced for portions of the area this afternoon and this evening.", "location": "From the information provided, it is not possible to determine a specific location for the main event.", "classification": "natural-disasters", "score": 0.9648720596627178, "event_breakdown": "The natural disasters mentioned in the text are:\n\n1. Heavy rain and flooding\n2. Flash flooding\n3. Severe weather"}, {"id": "ddbbb950-9817-4cc2-868a-7613815f21f9", "title": "Every united kingdom town at risk of flooding this weekend as Brits warned of travel chaos", "date": "2024-05-16 18:30", "url": "https://www.mirror.co.uk/news/uk-news/every-uk-town-risk-flooding-32828666", "message": "Currently, 30 flood alerts are in place across the south of England including Canterbury, Swindon and Cambridge, as well as Luton and Winchester.\nFlooding is likely tonight as nearly one month's rainfall is expected to batter the UK in just a few hours, the Met Office said.\nLoss of power is likely, homes and businesses could be damaged and hail and lightning will become hazardous for many.\n\"Local flooding is also possible but not expected more widely across England today (Thursday) and again on Friday and Saturday.\nFlood alert area: Areas at risk from Groundwater flooding including Caterham Bourne, Coulsdon Bourne, Beddington, Carshalton, Coulsdon, Kenley, Purley, South Croydon, Whyteleafe, Bromley, Bexley, Greenwich and Lewisham.\"", "location": "LONDON", "classification": "natural-disasters", "score": 0.8195790150077414, "event_breakdown": "List of natural-disaster events :\n- Flooding\n- Flash flooding"}, {"id": "f790c83b-d6f9-40d7-9309-021e73ffc561", "title": "The latest news on wildfires in Canada as thousands forced from homes in the West", "date": "2024-05-16 18:00", "url": "https://www.timescolonist.com/national-news/the-latest-news-on-wildfires-in-canada-as-thousands-forced-from-homes-in-the-west-8755560", "message": "Roughly 6,600 residents have been evacuated out of parts of Fort McMurray, Alta., while the rest of the city remains on evacuation alert.\nThe BC Wildfire Service says the blaze threatening Fort Nelson is spreading away from the northern community.\nCrews are back on the fire line today near Fort McMurray.\n_9: 50 a.m.A spokesman for Athabasca Oil Corp. says the company has taken a number of measures to protects its facility near Fort McMurray.\n_9:45 a.m.Crews battling the Fort McMurray wildfire woke up today to light rain, cloudy skies and cooler temperatures.", "location": "Fort McMurray, Alberta", "classification": "natural-disasters", "score": 0.6974982937344764, "event_breakdown": "Based on the text you provided, the natural-disasters events mentioned in the following list:\n\n1. Wildfire near Fort McMurray, Alberta - The fire is threatening parts of Fort Nelson in BC and northern parts of Fort McMurray in Alberta.\n2. Evacuation from Fort McMurray, Alberta - Roughly 6600 residents have been evacuated out of parts of the city.\n3. Athabasca Oil Corp takes protective measures - To protect the environment near Fort McMurray, Alta.\n4. Weather Conditions - The morning brought light rain and cloudy skies, which helped firefighters in battling the blaze.\n5. Crews back from Fort McMurray fire line - Firefighters have taken up patrols around the affected region."}, {"id": "ff8f9644-a4a9-4e9a-8da2-90bd8051e0cd", "title": "JRAP receives £13M FCDO grant for earthquake relief in Western Nepal", "date": "2024-05-16 12:15", "url": "https://thehimalayantimes.com/kathmandu/jrap-receives-13m-fcdo-grant-for-earthquake-relief-in-western-nepal", "message": "\"This new £13m commitment builds on the immediate support the UK provided of £0.5m for immediate humanitarian relief after the earthquake.\nOn 3 November 2023, Nepal's deadliest earthquake since April 2015 struck Jajarkot, West Rukum and adjoining districts in Karnali Province.\nThe Chief Executive of the NDRRMA Anil Pokhrel said, \"FCDO has been consistently supporting the Government of Nepal's Humanitarian Response including reconstruction and recovery.\nThe overarching goal of the Joint Recovery Action Plan (JRAP)-Western Nepal Earthquake is to complement the ongoing Government of Nepal's reconstruction and recovery endeavors while strengthening resilience in the face of future disasters.\nOut of the total funding need, FCDO is providing GBP 13 million (equivalent to USD 16.2 million).", "location": "Nepal", "classification": "natural-disasters", "score": 0.5922782600144129, "event_breakdown": "Jajarkot, West Rukum and adjoining districts in Karnali Province in Nepal."}, {"id": "bcbc3442-7e5e-4f31-9c7f-03c85ed4632a", "title": "Small businesses , municipalities urged to apply for portion of $35 million aid to rebuild after storms", "date": "2024-05-16 18:30", "url": "https://www.pressherald.com/2024/05/16/small-businesses-municipalities-encouraged-to-apply-for-portion-of-35-million-in-aid-to-rebuild-after-storms/", "message": "Small businesses and municipalities are encouraged to seek a portion of $35 million to help rebuild from severe storms in December and January, Gov.\nThe state Department of Economic and Community Development launched applications for $10 million for Maine small businesses and nonprofits, while the Department of Transportation has made applications available for $25 million for municipalities.\nThe storms lashed the Northeast, causing flooding and heavy damage to dozens of businesses in Maine and New Hampshire.\nThe money will not only help small businesses and communities rebuild but also prepare for future storms, the governor said.\nThe Business Recovery and Resilience Fund will provide grants for businesses and organizations, including nonprofits, that have been affected by severe storms.", "location": "Maine", "classification": "natural-disasters", "score": 0.5670632314039278, "event_breakdown": "Natural disasters events :\n- Severe storms in December 2022 and January 2023 that caused the flooding and heavy damage in the Northeast.\n- Flooding in the vicinity of  Maine and New Hampshire, damaging dozens of businesses.\n- A $35 million reconstruction aid for businesses and municipalities recovering from severe storms."}, {"id": "feb9d56b-ca4f-4987-87e1-a8a1a9080ca3", "title": "Sunday Forecast : Storms in the High Plains", "date": "2024-05-16 18:30", "url": "https://www.weathernationtv.com/news/sunday-forecast-storms-in-the-high-plains", "message": "16 May 2024 5:00 PMYet another severe weather chance is ahead for the central Plains with a large swath of Nebraska and Kansas highlighted by the Storm Prediction Center [SPC] on Sunday for the severe weather potential.\nAll modes of severe weather are possible as storms develop through the heat of the day.\nMay is the busiest month of the year for severe weather with most storms setting up over the Great Plains of Nebraska, Kansas, Oklahoma, and northern Texas.\nAlready 2024 has been one of the busiest severe weather seasons with the second most tornadoes on record (2011 still holds the record).\nStay with WeatherNation for the latest storm timing and threats ahead of the severe weather threat.", "location": "Nebraska", "classification": "natural-disasters", "score": 0.8541102155162694, "event_breakdown": "Tornado, Severe weather"}, {"id": "6d2ab401-09e1-401e-8cae-6a0e17468102", "title": "Why is Texas prone to flooding in the spring ? Here how to find out if your home is in danger", "date": "2024-05-16 20:30", "url": "https://www.yahoo.com/news/why-texas-prone-flooding-spring-194351878.html", "message": "Texas is frequently battered by storm after storm in the spring, leaving a soggy landscape with nowhere to let all the rain out.\nTexas’ version of the water cycle frequently causes flooding because of the state’s diverse terrain and location along the Gulf of Mexico.\nA Blue Ribbon Study found that Texas had 4,722 flash floods during the 14-year period from 1986 to 2000.\nTypes of flooding most common in TexasGiven that Texas is located in “flash flood alley,” it is not shocking that more than 500 flash floods have been reported in the previous ten years.\nThe most vulnerable time of year for flooding in Texas depends on the type of flood.", "location": "TEXAS", "classification": "natural-disasters", "score": 0.9666119177479016, "event_breakdown": "1. Texas frequently experiences flash floods during the spring.\n2. Flash floods are common throughout the state, and are especially prevalent along the Gulf Coast.\n3. The Texas version of the water cycle frequently causes flooding.\n4. Texas had 4,722 flash floods during the 14-year period from 1986 to 2000.\n5. More than 500 flash floods have been reported in the previous ten years.\n6. Flooding in Texas is most common during times of heavy rain, when the state's terrain and location along the Gulf of Mexico exacerbate the problem.\n7. The most common types of flooding in Texas include flash floods, river floods, and coastal floods."}, {"id": "2f24e822-d1a8-430e-83e8-e410aeb2a228", "title": "Tornado warning goes up as severe storms near Houston", "date": "2024-05-16 23:15", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/houston-severe-weather-tornado-watch-19462273.php", "message": "Strong storms arrive late Thursday afternoon north of Houston and will push into Houston around the time of the evening commute.\nThose under the tornado watch need to be prepared to seek shelter immediately if a tornado warning is issued for your location.\nIf you do not have a basement or storm shelter, seek shelter in an interior closet in the lowest level of your home.\nAdvertisement Article continues below this adScattered strong storms have been ongoing north of I-10 early Thursday afternoon.\nStrong storms will arrive north of I-10 by the evening commute and will push into Houston after commuters hit the road.", "location": "HOUSTON", "classification": "natural-disasters", "score": 0.639766999439192, "event_breakdown": "Tornado watch, Strong storms, Tornado warning"}, {"id": "d98b08c6-96d4-4ae9-8468-8b6cc2a7c8c9", "title": "Moderate earthquake 5 . 2 mag , 195 km SE of Akutan , Alaska", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-195-km-se-of-akutan-alaska/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Sunday, 195 km SE of Akutan, Alaska (121 miles).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 5.2-magnitude earthquake has occurred at 08:27:46 / 8:27 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 195 km SE of Akutan, Alaska.", "location": "Akutan, Alaska", "classification": "natural-disasters", "score": 0.9764815978132784, "event_breakdown": "1. A 5.2-magnitude earthquake occurred on Sunday, 195 km SE of Akutan, Alaska.\n2. The epicenter of the earthquake was roughly 10 km below the surface.\n3. No tsunami warning was issued."}, {"id": "ccece27d-9595-4398-8c3e-ca58bad39bfe", "title": "Moderate earthquake : M5 . 1 quake has struck near western Xizang", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-1-quake-has-struck-near-western-xizang-2/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) has struck on Thursday, western Xizang (0 miles).\nThe 5.1-magnitude earthquake has occurred at 17:40:02 / 5:40 pm (local time epicenter).\nId of earthquake: us7000mczb.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: western Xizang.", "location": ")\nXizang (Tibet), China", "classification": "natural-disasters", "score": 0.8654664261485678, "event_breakdown": "List of natural-disasters events:\n{\n\"id\": \"us7000mczb\",\n\"Magnitude\": 5.1,\n\"Depth\": 10,\n\"Status\": \"review\",\n\"DateTime\": \"2021-05-06 17:40:02\",\n\"Region\": \"Xizang\"\n}"}, {"id": "4bf5cfcb-1d5a-484d-b11b-0e5e0f50edc4", "title": "Moderate earthquake , 5 . 2 mag strikes near Vanuatu region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-strikes-near-vanuatu-region/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Monday, Vanuatu region (0 miles).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nThe 5.2-magnitude earthquake has occurred at 13:33:38 / 1:33 pm (local time epicenter).\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Vanuatu region.", "location": "Vanuatu", "classification": "natural-disasters", "score": 0.8725909814969817, "event_breakdown": ".\n[1] A shallow magnitude 5.2 (ml/mb) earthquake occurred in Vanuatu at 1:33 PM (local time epicenter) at a depth of 10 km underneath the earth's surface as per the USGS [2] As per Geo,earthquake.usgs.gov, quake occurred at 1:33 PM (local time epicenter) at a depth of 10 km."}, {"id": "d7e13668-0374-4771-88d9-01e928f54530", "title": "Moderate earthquake : M5 . 2 quake has struck near Finschhafen in Papua New Guinea", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-finschhafen-in-papua-new-guinea-2/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 84 km SE of Finschhafen, Papua New Guinea (52 miles) on Thursday.\nDate and time of earthquake in UTC/GMT: 16/05/24 / 2024-05-16 03:48:01 / May 16, 2024 @ 3:48 am.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nEvent ids that are associated to the earthquake: us6000mywa.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 84 km SE of Finschhafen, Papua New Guinea.", "location": ")\nThe most specific location I was able to find for this event was Papua New Guinea.", "classification": "natural-disasters", "score": 0.8678144976612029, "event_breakdown": ", then list other individual events.\nA moderate earthquake magnitude 5.2 (ml/mb) has struck 84 km SE of Finschhafen, Papua New Guinea (52 miles) on Thursday. Exact location of event, depth 10 km, 146.33 East, -5.3142 South. Unique identifier: us6000mywa."}, {"id": "bce3ee13-c3b8-4f1e-a9e1-3eb4f7fff6c2", "title": "Moderate earthquake , 5 . 2 mag was detected near Kandrian in Papua New Guinea", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-was-detected-near-kandrian-in-papua-new-guinea/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was reported 113 km WNW of Kandrian, Papua New Guinea (70 miles) on Monday.\nThe 5.2-magnitude earthquake was detected at 12:32:35 / 12:32 pm (local time epicenter).\nIds that are associated to the earthquake: us6000my9b.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 113 km WNW of Kandrian, Papua New Guinea.", "location": "Papua New Guinea", "classification": "natural-disasters", "score": 0.9476345014886011, "event_breakdown": "Title: Moderate earthquake hits Papua New Guinea\n1. Earthquake with magnitude 5.2 degrees on the Richter scale and occurred at 12:32:35 near Kandrian, Papua New Guinea.\n2. No tsunami warning was issued."}, {"id": "9b91c1e0-2026-4306-b847-e39700b5e9dd", "title": "Moderate earthquake 5 . 1 mag , Kermadec Islands region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-kermadec-islands-region-7/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) has struck on Sunday, Kermadec Islands region (0 miles).\nThe earthquake occurred at a depth of 46.324 km (29 miles).\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nIn the past 24 hours, there have been six, in the last 10 days seven, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Kermadec Islands region.", "location": ")\nKermadec Islands region", "classification": "natural-disasters", "score": 0.8053230772698114, "event_breakdown": ".\nEvent: A moderate earthquake magnitude 5.1 (ml/mb) strikes on Sunday, Kermadec Islands region (0 miles).\nDate: 2022-01-23\nLocation: Kermadec Islands region\nEvent: A moderate earthquake magnitude 5.1 (ml/mb) strikes on Sunday, New Zealand (149 miles).\nDate: 2022-01-23\nLocation: New Zealand\nEvent: A moderate earthquake magnitude 5.0 (ml/mb) strikes on Sunday, Massif de la Fournaise, Reunion (980 miles).\nDate: 2022-01-23\nLocation: Massif de la Fournaise, Reunion"}, {"id": "817ee946-555e-4d00-b8e7-8321184a6fb2", "title": "Moderate earthquake , 5 . 2 mag has occurred near Houma in Tonga", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-houma-in-tonga/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 153 km WSW of Houma, Tonga (95 miles) on Sunday.\nThe earthquake occurred at a depth of 168.178 km (105 miles) below the earth’s surface.\nThe 5.2-magnitude earthquake has occurred at 12:55:52 / 12:55 pm (local time epicenter).\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 153 km WSW of Houma, Tonga.", "location": "Tonga", "classification": "natural-disasters", "score": 0.8729462076269356, "event_breakdown": "event - 5.2 magnitude earthquake strikes 153 km WSW of Houma, Tonga"}, {"id": "3d538912-0129-4678-aaaf-f27e61df73c1", "title": "Moderate earthquake : M5 . 2 quake has struck near South Sandwich Islands region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-south-sandwich-islands-region/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was detected on Thursday, South Sandwich Islands region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000mvnj.\nThe 5.2-magnitude earthquake was detected at 08:02:27 / 8:02 am (local time epicenter).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: South Sandwich Islands region.", "location": "South Sandwich Islands region", "classification": "natural-disasters", "score": 0.9529182097199788, "event_breakdown": "1. Earthquake with magnitude 5.2 detected on Thursday in South Sandwich Islands region, without a tsunami warning."}, {"id": "69bae694-b86a-4095-9352-e95fcc1d67d4", "title": "Moderate earthquake , 5 . 2 mag has occurred near Luganville in Vanuatu", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-luganville-in-vanuatu-2/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 113 km ENE of Luganville, Vanuatu (70 miles) on Wednesday.\nIds that are associated to the event: us6000mx7t.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nIn the past 24 hours, there have been sixteen, in the last 10 days seventeen, in the past 30 days seventeen and in the last 365 days seventeen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 113 km ENE of Luganville, Vanuatu.", "location": ")\nLuganville, Vanuatu", "classification": "natural-disasters", "score": 0.8272699185082985, "event_breakdown": "[\n(5.2, 113 km ENE of Luganville, Vanuatu, id: us6000mx7t)\n]"}, {"id": "87495177-41ea-4674-8238-16d3fc070639", "title": "Moderate earthquake : M5 . 2 quake has struck near Lajes das Flores in Portugal", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-lajes-das-flores-in-portugal/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday.\nThe epicenter was at a depth of 18.011 km (11 miles).\nEvent ids that are associated to the earthquake: us6000mt7i.\nId of event: us6000mt7i.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 138 km SSE of Lajes das Flores, Portugal.", "location": "or proper nouns\nLAjes das Flores", "classification": "natural-disasters", "score": 0.8668374563176562, "event_breakdown": ".\nA moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday.\nA moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday.\nA moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday.\nA moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday."}, {"id": "6f03fac2-ca79-4b0a-9593-abce6237a14d", "title": "Moderate earthquake , 5 . 1 mag strikes near Trenggalek in Indonesia", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-strikes-near-trenggalek-in-indonesia/", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Monday, 107 km SSW of Trenggalek, Indonesia (66 miles).\nEvent id: us7000mdtk.\nIds that are associated to the earthquake: us7000mdtk.\nThe 5.1-magnitude earthquake was detected at 11:10:48 / 11:10 am (local time epicenter).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 107 km SSW of Trenggalek, Indonesia.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.8663927229150351, "event_breakdown": "These are the natural-disaster events mentioned in the text:\nModerate earthquake with magnitude 5.1\nTrenggalek, Indonesia"}, {"id": "f8319343-ffd4-4dc3-9e9b-1a8c930fd60d", "title": "Moderate earthquake , 5 . 2 mag was detected near Constitución in Chile", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-was-detected-near-constitucion-in-chile/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Monday, 76 kilometers (47 miles) from Constitución in Chile.\nThe 5.2-magnitude earthquake was detected at 09:18:49 / 9:18 am (local time epicenter).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nEarthquake epicenter was 76 km (47 miles) from Constitución (c. 37 900 pop), 104 km (65 miles) from Cauquenes (c. 31 400 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 76 km W of Constitución, Chile.", "location": "Constitución in Chile", "classification": "natural-disasters", "score": 0.8798584782464292, "event_breakdown": ".\n2023 (year) in Chile, Constitución, Cauquenes: \n\n- On Monday, June 27, 2023, a 5.2-magnitude earthquake struck 76 kilometers west of Constitución, Chile, at 9:18:49 / 9:18 am local time.\n- The epicenter was 10 kilometers (6 miles) below the earth’s surface.\n- The tremor was felt strongly in Constitución and Cauquenes."}, {"id": "63e2659b-8d46-4f73-80e9-3ae9f814b1c3", "title": "Moderate earthquake , 5 . 2 mag has occurred near Modisi in Indonesia", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-modisi-in-indonesia/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was reported 83 kilometers (52 miles) from Modisi in Indonesia on Monday.\nThe earthquake was roughly at a depth of 271.971 km (169 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nAll ids that are associated to the event: us6000my6q.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 83 km NW of Modisi, Indonesia.", "location": ".\nIndonesia", "classification": "natural-disasters", "score": 0.9752759291603403, "event_breakdown": "- A moderate earthquake with magnitude 5.2 (ml/mb) was reported 83 kilometers (52 miles) from Modisi in Indonesia on Monday.\n- The earthquake was at a depth of 271.971 km (169 miles).\n- A tsunami warning has not been issued."}, {"id": "b460cc09-a918-4688-8325-76440f46cf69", "title": "Moderate earthquake , 5 . 1 mag was detected near Hualien City in Taiwan", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-was-detected-near-hualien-city-in-taiwan/", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was reported 56 kilometers (35 miles) from Hualien City in Taiwan on Sunday.\nThe earthquake was roughly at a depth of 34.394 km (21 miles).\nNearest city/cities or towns, with min 5000 pop, to epicentrum/hypocenter was Lugu, Taitung City, Puli.\nEpicenter of the event was 57 km (35 miles) from Hualian (c. 350 500 pop), 92 km (57 miles) from Taitung City (c. 109 600 pop), 86 km (54 miles) from Puli (c. 86 400 pop), 93 km (58 miles) from Lugu (c. 19 600 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 56 km S of Hualien City, Taiwan.", "location": "Taiwan", "classification": "natural-disasters", "score": 0.7560440828375922, "event_breakdown": "Earthquake: 5.1 Magnitude, 56 kilometers south of Hualien City, Taiwan."}, {"id": "44308b36-3443-4055-995e-6a171bf71c7a", "title": "Moderate earthquake 5 . 2 mag , 51 km WSW of Santiago , Peru", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-51-km-wsw-of-santiago-peru/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has struck on Thursday, 51 kilometers (32 miles) from Santiago in Peru.\nExact location of event, depth 35 km, -76.1516° West, -14.3528° South.\nId of earthquake: us6000mywl.\nThe epicenter was at a depth of 35 km (22 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 51 km WSW of Santiago, Peru.", "location": "Santiago, Peru", "classification": "natural-disasters", "score": 0.888006047999692, "event_breakdown": "Event ID: us6000mywl\nDate and Time: 2022-05-19 15:32:56 UTC (Saturday)\nMagnitude: mb 5.2\nDepth: 35 km\nLocation: -76.1516° West, -14.3528° South\nGeographic coordinates: 51 km WSW of Santiago, Peru"}, {"id": "b12f7b68-06bf-40d2-b086-9f1b625fd1e3", "title": "Moderate earthquake , 5 . 1 mag has occurred near Hualien City in Taiwan", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-has-occurred-near-hualien-city-in-taiwan/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) strikes 21 kilometers (13 miles) from Hualien City in Taiwan on Monday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nThe 5.1-magnitude earthquake was detected at 09:12:11 / 9:12 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 21 km S of Hualien City, Taiwan.", "location": "Taiwan", "classification": "natural-disasters", "score": 0.9707981746174102, "event_breakdown": "Here is a list of the natural-disasters events mentioned in the text:\n\n1. The earthquake detected in Taiwan on Monday with a magnitude of 5.1 (ml/mb).\n2. The epicenter of the earthquake was 21 kilometers (13 miles) from Hualien City.\n3. The earthquake was detected at 09:12:11 / 9:12 am (local time epicenter).\n4. The earthquake's epicenter was approximately 10 km (6 miles) below the earth’s surface."}, {"id": "ed61fbba-731b-4654-b5c8-41f756ff2960", "title": "Threat of heavy rain , strong storms ramping up Thursday night", "date": "2024-05-16 23:15", "url": "https://www.wbrz.com/news/threat-of-heavy-rain-strong-storms-ramping-up-thursday-night", "message": "1 to 4 inches of rainfall with locally higher amounts in excess of 6 inches will be possible, enhancing the flash flooding threat.\nThe Storm Prediction Center has placed most of the WBRZ coverage area under a slight (2/5) risk for severe weather for Thursday night storms.\nThat said, the flash flooding threat will be higher just to the north of the front.\nWhile the severe weather threat should be lower with the storms into early Saturday, they still pose threat of flash flooding.\nClick HERE to watch WBRZ streaming live onlineClick HERE for the WBRZ weather page.", "location": "BATON ROUGE, Louisiana", "classification": "natural-disasters", "score": 0.9639201835679165, "event_breakdown": "Based on the text you have shared, here are the natural-disaster events described:\n\n1. Flash flooding threat\n2. Severe weather threat\n3. Storms\n4. Rainfall\n\nThese events are related to each other, as they are all part of the natural-disaster events mentioned in the text."}, {"id": "11109a3e-e4ac-447a-b1a1-7b7135d09e72", "title": "Firefighters Gain Control of One Blaze Threatening Oil Sands in Alberta", "date": "2024-05-16 20:45", "url": "https://finance.yahoo.com/news/firefighters-gain-control-one-blaze-195526122.html", "message": "(Bloomberg) -- Firefighters gained control of one wildfire near the main oil-sands region of Alberta on Wednesday, but continued to battle a much larger blaze to the south that’s threatening the area’s biggest city.\nWorkers based in Fort McMurray help staff the surrounding oil-sands operations that produce the bulk of Canada’s 4.9 million barrels of daily crude output.\n“More than 2.1 million barrels per day of marketable oil sands output could be at risk should conditions materially worsen.”So far, no oil-sands producer has reported operational disruptions.\nA devastating fire eight years ago leveled parts of Fort McMurray and forced the entire population to evacuate.\nThat blaze shut more than 1 million barrels of daily oil output for weeks and caused about C$3.7 billion ($2.7 billion) in insured losses, making it Canada’s costliest natural disaster.", "location": "Fort McMurray", "classification": "natural-disasters", "score": 0.5594002926387255, "event_breakdown": "Here is a summary of the natural-disaster events mentioned in the text:\n1. Fort McMurray wildfires (2022)\n2. Fort McMurrary wildfires (2014)"}, {"id": "0fe8d409-316d-43e3-970a-0b6e171aa57c", "title": "Charleston Heights homeowners report more flooding after SC Ports construction", "date": "2024-05-16 23:00", "url": "https://www.live5news.com/2024/05/16/charleston-heights-homeowners-report-more-flooding-after-sc-ports-construction/", "message": "CHARLESTON, S.C. (WCSC) - Longtime Charleston Heights neighbors report flooding issues have become exponentially worse after the South Carolina Ports Authority began construction on its multi-million-dollar project next door, leaving them with the clean-up.\nBut neighbors say they really began to notice an issue in the summertime.\nThe South Carolina Ports Authority released the following statement:“South Carolina Ports is proactively working with the City of North Charleston to improve the stormwater drainage system at Orvid Street as this area is susceptible to flooding, much like other low-lying areas in Charleston.\nThe South Carolina Ports Authority reported temporary measures were in place to alleviate flooding on May 1.\nSome neighbors are hopeful the Ports Authority will take accountability for their damaged property, and that the problem will be solved.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.4313939121586849, "event_breakdown": "It rains a lot in the region\nPort of Charleston released water several times\nThey really noticed the issue in the springtime\nConstruction in Porto started with flooding issues\nThe SCPA will take accountability for the damaged property\nThere will be working to fix the problem"}, {"id": "145a5730-bd24-4c6a-8ecf-4b47bab47137", "title": "NHC begins issuing outlooks today , including 7 - day outlook", "date": "2024-05-16 22:45", "url": "https://www.wuwf.org/florida-news/2024-05-16/nhc-begins-issuing-outlooks-today-including-7-day-outlook", "message": "The 2024 Atlantic hurricane season is still a little over two weeks away, but the first forecasts start today.\nThe National Hurricane Center began issuing their tropical weather outlooks today, which show the probability of tropical cyclones forming over a given area in the next two to seven days.\nEven though hurricane season doesn’t officially begin until June 1, the National Hurricane Center started issuing their outlooks ahead of the season to account for early activity, which has been common in recent years.\nThe NHC started issuing the Tropical Outlook products in Mid May of 2021.\nAlthough a special outlook was issued in late April for a system with a sub-30-percent chance of development, it failed to become a tropical system.", "location": "The main location where the National Hurricane Center (NHC) begins issuing their tropical outlook", "classification": "natural-disasters", "score": 0.8610990145398817, "event_breakdown": "- 2023 Atlantic hurricane season\n- Early tropical outlooks\n- NHC starting tropical outlooks\n- Atlantic hurricane season beginning june 1"}, {"id": "46f8d40b-6b1a-4a29-8c4d-91a8129e9bef", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 22:15", "url": "https://q1077.com/ixp/151/p/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country.", "location": ".\nEast Texas", "classification": "natural-disasters", "score": 0.9436164254161378, "event_breakdown": "- Storm system pushing across East Texas and western Louisiana\n- Severe storms and high rainfall amounts\n- Flash Flooding Risk for East Texas to Dallas/Fort Worth Metroplex\n- Large to very large hail threat in central Texas to Hill Country"}, {"id": "1a2d2fef-efdf-4f26-8b7a-16094d05e915", "title": "Population growth , housing market added challenges for governor conference", "date": "2024-05-16 22:15", "url": "https://www.wflx.com/2024/05/16/population-growth-housing-market-added-challenges-governors-conference/", "message": "\"So many lessons learned that they tell you things you would never expect,\" Martin County's Emergency Management Director Sally Waite said.\n\"You really got to be ready for all that temporary housing, disaster housing, where do you put people?”That seemed to be the conundrum across the region this year: finding disaster housing for a population exponentially larger.\nMartin County Emergency Management Director Sally Waite says the aim is to learn from other directors and see what the needs are in a disaster.\n“I think recovery is huge after seeing Ian for most emergency management directors,\" Waite said.\nThe Governor's Hurricane Conference runs through May 17 at the Palm Beach County Convention Center.", "location": "WEST PALM BEACH, FLORIDA", "classification": "natural-disasters", "score": 0.6893047002474387, "event_breakdown": ".\n* Hurricane Irma\n* Disaster housing\n* Disaster recovery"}, {"id": "7aaafe0b-e906-4411-ba35-34761e276523", "title": "Earthquake this Morning , Storms & Showers Coming Tonight", "date": "2024-05-16 22:00", "url": "https://www.wbbjtv.com/2024/05/16/earthquake-this-morning-storms-showers-coming-tonight/", "message": "Earthquake this Morning, Storms & Showers Coming TonightWBBJ 7 Forecast UpdateWBBJ 7 Forecast Update:An earthquake felt as far away as Parsons hit just after 3am, 4 miles south of Ridgely this morning and a couple small aftershocks developed this afternoon.\nWe will have a recap on the earthquake, tracking any storms on the radar and your complete weekend forecast all coming up here.\nShowers and storms will be possible during the late evening and especially overnight into Friday morning with increasing in coverage and intensity.\nChances for rain overnight Thursday into Friday morning is at 90% as of now.\nFRIDAY:Like Tuesday earlier this week, showers and storms are expected to impact almost all of our viewing area.", "location": "Ridgely", "classification": "natural-disasters", "score": 0.8385902920776429, "event_breakdown": "Earthquake felt in Ridgely, Storms & Showers Tonight"}, {"id": "07a6954e-b1f4-4d3a-b7eb-725363aa4ed3", "title": "FIRST ALERT | Chris Bailey says here we go again", "date": "2024-05-16 20:30", "url": "https://www.wkyt.com/2024/05/16/first-alert-chris-bailey-says-here-we-go-again/", "message": "LEXINGTON, Ky. (WKYT) - Much better weather is back in the Bluegrass state today and you had better get out there and enjoy it!\nRounds of showers and storms are back in here for the next couple of days.\nLow pressure to our west then rumbles toward the region into Friday with more waves of showers and storms spinning through.\nA few of those may get into western Kentucky this evening and there’s even the low-end risk for a few severe storms.\nHere’s today’s Severe Weather Outlook from the Storm Prediction Center.", "location": "Kentucky.", "classification": "natural-disasters", "score": 0.8535331374603319, "event_breakdown": "- Low pressure to our west moves into Kentucky\n- Spins waves of showers and storms through the area\n- A few severe storms may rattle western Kentucky"}, {"id": "3b36a633-00a0-4dc3-ac3e-9c0bc75bba0c", "title": "New Mexico getting $28 million for wildfire defense", "date": "2024-05-16 21:45", "url": "https://www.yahoo.com/news/mexico-getting-28-million-wildfire-200830652.html", "message": "NEW MEXICO (KRQE) – Around New Mexico, 11 communities are getting a share of $28 million to boost wildfire defenses.\nOtero County received $243,100 to develop a community wildfire protection plan for Otero County.\nValencia County received $159,600 to update and expand community wildfire protection plans throughout the county of Valencia, NM.\nSan Miguel County received $88,000 to update the San Miguel County community wildfire protection plan following the Hermits Peak/Calf Canyon Fire.\nMora County received $88,000 to update the Mora County community wildfire protection plan following the Hermits Peak/Calf Canyon Fire.", "location": "New Mexico.", "classification": "natural-disasters", "score": 0.5334821668711158, "event_breakdown": "Hermits Peak/Calf Canyon Fire"}, {"id": "b41e673d-b282-4a59-9bc9-b0bc84ddcc6c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | News Radio 103 . 1 and 810 WGY", "date": "2024-05-16 21:30", "url": "https://wgy.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Chile earthquake, Mexico, Guatemala, El Salvador (May 12)\nCalifornia earthquake (Apr. 18)\nIndonesia earthquake (May 13)\nJapan earthquake (May 13)\nTaiwan earthquake (Apr. 22)"}, {"id": "3e15dd93-9c3f-42f3-8bc5-63d2197183b0", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:30", "url": "https://wonw1280.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\nHere are the natural-disasters events from the text:\n1. A 6.4-magnitude earthquake struck Mexico, Guatemala and El Salvador on Sunday (May 12).\n2. A 5.2-magnitude earthquake struck Chile on Monday (May 13).\n3. A 6.1-magnitude earthquake struck Indonesia on Monday (May 13).\n4. A 6.5-magnitude earthquake struck Indonesia on Monday (May 13).\n5. A 4.3-magnitude earthquake struck California on April 18.\n6. A 6.0-magnitude earthquake struck Taiwan on April 22.\n7. A 6.1-magnitude earthquake struck Japan on April 24."}, {"id": "8b84184e-1ce0-4d49-9624-962870bb6d28", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:15", "url": "https://720thevoice.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Natural-disasters events:\n- 5.2-magnitude earthquake in Chile on May 13th\n- 6.4-magnitude earthquake in Mexico, Guatemala and El Salvador on May 12th\n- 4.3-magnitude earthquake in California on April 18th\n- 6.1-magnitude earthquake in Indonesia on May 14th\n- 6.5-magnitude earthquake in Japan on May 8th\n- 6.0-magnitude earthquake in Taiwan on April 22nd"}, {"id": "e3fc7367-9ca1-4c9f-8af6-8f8517030fde", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:15", "url": "https://kxic.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The events mentioned in the text are:\n- A 6.4-magnitude earthquake striking Mexico, Guatemala, and El Salvador on Sunday, May 12. \n- A 6.5-magnitude earthquake striking Chile on Monday, May 13.\n- A 6.1-magnitude earthquake striking Indonesia on Monday, May 13.\n- A 6.5-magnitude earthquake striking Japan on Tuesday, May 14.\n- A 6.0-magnitude earthquake striking Taiwan on Wednesday, April 22."}, {"id": "9e5fb5e9-e4b9-4ef7-9807-cb71c59cde14", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://talk1200boston.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Natural disasters in the text are: The California earthquake on April 18, a 6.4 earthquake in Mexico, Guatemala and El Salvador on May 12, a 6.4 earthquake in Chile on May 13, a 6.5 in Japan on May 14, a 6.1 in Mexico on April 22, a 6.5 in California on March 23rd, and a 6.4 earthquake in Mexico on May 13."}, {"id": "a8b6328e-587b-41ac-9cea-586ad9e2fdd3", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://kfiam640.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "California earthquake, 5.2-magnitude earthquake in Chile, 6.4-magnitude earthquake in Mexico, 6.4-magnitude earthquake in Guatemala, 6.4-magnitude earthquake in El Salvador, 6.1-magnitude earthquake in Indonesia, 6.5-magnitude earthquake in Japan, 6.0-magnitude earthquake in Taiwan"}, {"id": "eaa67357-99fe-4ca7-b934-b1592e0c03c5", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://newsradio540.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "given\nBased on the information in the text, it was not possible to determine a specific location for the event that took place.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\nHere are the natural-disasters events mentioned in the text:\n1. The 5.2-magnitude earthquake that struck Chile on May 13\n2. The 6.4-magnitude earthquake that struck Mexico, Guatemala, and El Salvador on May 12\n3. The 4.3-magnitude earthquake that struck California on April 18\n4. The 6.1-magnitude earthquake that struck Indonesia on May 13\n5. The 6.5-magnitude earthquake that struck the Japanese island region on May 15\n6. The 6.0-magnitude earthquake that struck Taiwan on April 22"}, {"id": "4bbce615-c1d5-401e-9b81-6b6905aa545b", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://kfab.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The related natural-disasters events are:\n- 5.2-magnitude earthquake in Chile\n- 6.4-magnitude earthquake in Mexico, Guatemala and El Salvador\n- 4.3-magnitude earthquake in California\n- 6.1-magnitude earthquake in Indonesia\n- 6.5-magnitude earthquake in Japan\n- 6.0-magnitude earthquake in Taiwan"}, {"id": "7ed4a88e-b358-4336-916d-8ccccc9142ed", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://twincitiesnewstalk.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Here are the natural-disasters events in the text:\n\nMay 13 - 5.2-magnitude earthquake reported in Chile\nMay 12 - 6.4-magnitude earthquake reported in Mexico, Guatemala, and El Salvador\nMay 13 - 6.1-magnitude earthquake reported in Indonesia\nMay 22 - 6.0-magnitude earthquake reported in Taiwan\nMay 13 - 6.5-magnitude earthquake reported in Japan\n\nThese events are listed based on their dates of occurrence and locations as reported by the United States Geological Survey."}, {"id": "866a65ed-7a01-4474-abe0-30e753e2261f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://wrko.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "These are the natural-disasters events from the text :\n\nMexico, Guatemala, El Salvador, Sunday 5.2\nChile, Monday 6.4\nMexico, Sunday 6.4\nEl Salvador, Sunday 5.2\nIndonesia, Friday 6.5\nJapan, Friday 6.5\nTaiwan, Sunday 4.3"}, {"id": "fce216d9-638f-48b1-b601-ceed11166be7", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://800wvhu.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "CHICHAQUA, IA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "1. Indonesia earthquake - May 13\n2. Chile earthquake - May 13\n3. Mexico earthquake - May 12\n4. California earthquake - April 18\n5. Taiwan earthquake - April 22"}, {"id": "38c9b5cb-192a-4793-97be-1571e532276c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://790waeb.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\n5.2 Earthquake in Chile\n6.4 Earthquake in Meixco\n6.4 Earthquake in Indonesia\n6.4 Earthquake in Guatemala\n6.1 Earthquake in Indonesia\n6.5 Earthquake in Japan\n6.0 Earthquake in Taiwan"}, {"id": "bdde34c5-3c38-4393-85da-d59ca0ca4371", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-05-16 20:45", "url": "https://powertalk1460.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "CALIFORNIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Based on the text you provided, here are the natural-disasters events you mentioned:\n\n1. A 5.2-magnitude earthquake struck Chile on May 13, 2022, according to the United States Geological Survey.\n2. A 6.4-magnitude earthquake struck Mexico, Guatemala, and El Salvador on May 12, 2022, according to the United States Geological Survey.\n3. A 6.4-magnitude earthquake struck Indonesia on May 15, 2022, according to the United States Geological Survey.\n4. A 6.5-magnitude earthquake struck Japan’s Ryukyu Islands region on May 15, 2022, according to the United States Geological Survey.\n5. A 6.0-magnitude earthquake struck Taiwan on April 22, 2022, according to the United States Geological Survey."}, {"id": "5cb5ac77-b05c-4fda-8a4f-7f362493e60a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://newsradio710.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The reported events are as follows:\n1. Chile earthquake - 5.2 magnitude\n2. Mexico-Guatemala-El Salvador earthquake - 6.4 magnitude\n3. California earthquake - 4.3 magnitude\n4. Indonesian earthquake - 6.1 magnitude\n5. Japanese earthquake - 6.5 magnitude\n6. Taiwan earthquake - 6.0 magnitude"}, {"id": "4d6e9123-c80a-43b9-aa26-4f96399a5ce9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://ktsmradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia, Chile and Mexico earthquakes\nCalifornia earthquake\nJapan and Taiwan earthquakes"}, {"id": "483b416c-1a75-4db6-a3c7-95eddeca5e9e", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsTalk WMEQ", "date": "2024-05-16 20:45", "url": "https://wmeq.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "According to the text provided, there was no specific location identified by which the main event takes place.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Earthquake in Indonesia, 6.1 magnitude\nEarthquake in Chile, 5.2 magnitude\nEarthquake in Mexico, 6.4 magnitude\nEarthquake in Guatemala, 6.4 magnitude\nEarthquake in El Salvador, 6.4 magnitude\nEarthquake in California, 6.1 magnitude\nEarthquake in Indonesia, 6.5 magnitude\nEarthquake in Japan, 6.5 magnitude\nEarthquake in Taiwan, 6.0 magnitude"}, {"id": "3d02ea2a-aa95-441b-b597-b74313569a32", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://710wor.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia earthquake\nChile earthquake\nMexico, Guatemala and El Salvador earthquake\nCalifornia earthquake\nIndonesian earthquake\nJapan earthquake\nTaiwan earthquake"}, {"id": "19c37975-f596-45cb-b359-a3c43d8f0d8e", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wilm.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Earthquakes:\n- 5.2-magnitude earthquake in Chile on Monday.\n- 6.4-magnitude earthquake in Mexico, Guatemala, and El Salvador on Sunday.\n- 6.4-magnitude earthquake in Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\n- 6.0-magnitude earthquake in Taiwan on April 22.\n- 4.3-magnitude earthquake in California on April 18."}, {"id": "f22b1b2a-4c5b-4576-8a21-8dec1a1aedd1", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wham1180.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "- 5.2 magnitude earthquake strikes Chile (May 13)\n- 6.4 magnitude earthquake strikes Mexico, Guatemala and El Salvador (May 12)\n- 6.4 magnitude earthquake strikes Indonesia (May 14)\n- 6.0 magnitude earthquake strikes Taiwan (April 22)\n- 6.1 magnitude earthquake strikes Indonesia (May 14)\n- 6.5 magnitude earthquake strikes Japan (May 15)"}, {"id": "60e658c8-d987-4d64-9592-b6f2c650cb7d", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wspd.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\n1. 5.2-magnitude earthquake reported in Chile.\n2. 6.4 earthquake reported in Mexico, Guatemala, and El Salvador.\n3. 6.4-magnitude earthquake reported in Indonesia.\n4. 6.5 earthquake reported in Japan.\n5. 6.1 earthquake reported in Indonesia.\n6. 6.0 earthquake reported in Taiwan."}, {"id": "aa76be9d-1b5f-4245-8f9e-ba6a43077a1c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://realradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Here are the natural-disasters events mentioned in the text:\n1. A 6.4 earthquake strikes Mexico, Guatemala, and El Salvador on Sunday, May 12.\n2. A 5.2-magnitude earthquake strikes Chile on Monday, May 13.\n3. A 6.1-magnitude earthquake strikes Indonesia hours after a 6.5-magnitude earthquake strikes a Japanese island region.\n4. A 6.0-magnitude earthquake strikes Taiwan on April 22.\n5. A 4.3-magnitude earthquake strikes California on April 18."}, {"id": "3f8fdd95-1bf4-4c28-90b8-90b3f9ffbffe", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://kwhn.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "These events include:\n- A 6.4-magnitude earthquake in Mexico, Guatemala and El Salvador on May 12.\n- A 6.4-magnitude earthquake in Japan on May 12.\n- A 6.5-magnitude earthquake in Taiwan on April 22.\n- A 5.2-magnitude earthquake in Chile on May 13.\n- A 6.1-magnitude earthquake in Indonesia on May 13."}, {"id": "0d2ebaec-9a35-42ba-89c4-28b12156b34f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://khvhradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "CALIFORNIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Chile earthquake 5.2-magnitude on Monday, May 13\nMexico-Guatemala-El Salvador 6.4-magnitude earthquake on Sunday, May 19\nCalifornia 4.3-magnitude earthquake on Sunday, April 18\nIndonesian earthquake 6.1-magnitude on Monday, May 13\nJapan earthquake 6.5-magnitude on Tuesday, May 14\nTaiwan earthquake 6.0-magnitude on Saturday, April 22"}, {"id": "6f813ee8-4f13-4bf3-ab17-d606b16de6ae", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://700wlw.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "California earthquake\nMexico, Guatemala and El Salvador earthquake\nTaiwan earthquake\nChile earthquake\nIndonesia earthquake\nJapanese island region earthquake"}, {"id": "74144487-3bc3-4c73-b3f4-c6211ba58157", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | AM 600 WMT", "date": "2024-05-16 22:15", "url": "https://600wmtradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia earthquake,Chile earthquake,Mexico earthquake,Guatemala earthquake,El Salvador earthquake,California earthquake,Japanese island earthquake,Taiwan earthquake"}, {"id": "b4a1af16-152f-4c41-8d19-b190cfd64cc2", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://hallelujah955.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "NULL", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia earthquake, Chile earthquake, Mexico earthquake, Guatemala earthquake, El Salvador earthquake, California earthquake, Japan earthquake, earthquake in Taiwan"}, {"id": "4970af4f-da29-453b-b6c9-3c8a4cdf9f6f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://wlap.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "itself\nindonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The following is a text-only list of the natural-disasters events referenced in the question, presented in chronological order:\n\nApril 18: A 4.3-magnitude earthquake strikes California\n\nMay 12: A 6.4-magnitude earthquake is reported in Mexico, Guatemala, and El Salvador\n\nMay 13: A 5.2-magnitude earthquake strikes Chile, followed by a 6.4-magnitude earthquake reported in El Salvador\n\nMay 13: A 6.1-magnitude earthquake strikes Indonesia\n\nMay 15: A 6.0-magnitude earthquake strikes Taiwan\n\nMay 18: A 5.2-magnitude earthquake strikes California"}, {"id": "25d5827d-e4e6-4e45-89ad-2cc32bf6001c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://kfyi.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "5.2-magnitude earthquake struck Chile on Monday May 13\n6.4-magnitude earthquake struck Mexico, Guatemala and El Salvador on Sunday, May 12\n6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region on Saturday, May 11\n6.0-magnitude earthquake struck Taiwan on April 22"}, {"id": "d9b698f0-03be-426e-ae79-77d51c51d74a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://wbhpam.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "California", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "-May 12: 5.2-magnitude earthquake strikes Chile\n-May 12: 6.4-magnitude earthquake strikes Mexico, Guatemala, El Salvador\n-April 18: 4.3-magnitude earthquake strikes California\n-May 13: 6.1-magnitude earthquake strikes Indonesia\n-May 13: 6.5-magnitude earthquake strikes Japanese island region"}, {"id": "6f11bdea-6dbe-457c-9494-458066e69364", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsRadio WKCY", "date": "2024-05-16 22:30", "url": "https://newsradiowkcy.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Japan", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "These events are related to earthquakes:\n- A 5.2-magnitude earthquake struck Chile on Monday (May 13)\n- A 6.4-magnitude earthquake was reported in Mexico, Guatemala, and El Salvador on Sunday (May 12)\n- A 6.4-magnitude earthquake was reported in Mexico on Saturday (May 11)\n- A 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region on Friday (May 10)\n- A 6.0-magnitude earthquake struck Taiwan on Sunday (April 22)\n- A 6.0-magnitude earthquake struck Taiwan on Friday (April 20)\n- A 5.2-magnitude earthquake struck Taiwan on Wednesday (April 18)\n- A 6.0-magnitude earthquake was reported in Alaska on Sunday (May 12)\n- A 6.0-magnitude earthquake reported in Mexico on Saturday (May 11)\n- A 6.1-magnitude earthquake reported in Mexico on Friday (May 10)\n- A 6.1-magnitude earthquake reported in Mexico on Wednesday (May 8)\n- A 6.0-magnitude"}, {"id": "6983ef21-1bc2-4404-9215-75ddafb99ef2", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://knst.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": ".\nThe main focus of the event is Indonesia.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Natural disaster events in the text:\n- 5.2-magnitude earthquake in Chile\n- 6.4-magnitude earthquake in Mexico, Guatemala and El Salvador\n- 6.4-magnitude earthquake in Indonesia\n- 6.1-magnitude earthquake in Japan\n- 6.0-magnitude earthquake in Taiwan"}, {"id": "1f264a97-5bed-4d55-b8af-b057d0ab1739", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://wccfradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Here are the natural-disasters events in the list reported:\n-Chile earthquake\n-Guatemala earthquake\n-Mexico earthquake\n-Indonesia earthquake\n-California earthquake\n-Tawain earthquake"}, {"id": "9556dd4b-4d29-47ad-a87f-9c62054d23b6", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://945wpti.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Earthquakes:\n- Chile Earthquake\n- Mexico, Guatemala and El Salvador Earthquake\n- California Earthquake\n- Indonesia Earthquake\n- Japanese Island Earthquake\n- Taiwan Earthquake"}, {"id": "cd0d178e-2e96-47e3-8e7c-f5a8825f0f85", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://600wrec.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "5.2-magnitude earthquake struck Chile on May 13\n6.4-magnitude earthquake struck Mexico, Guatemala and El Salvador on May 12\n6.4-magnitude earthquake struck Mexico and Guatemala on May 10\n6.4-magnitude earthquake struck Japan on April 18\n6.5-magnitude earthquake struck Guatemala on May 11\n6.1-magnitude earthquake struck Indonesia on May 15\n6.0-magnitude earthquake struck Taiwan on April 22\n6.1-magnitude earthquake struck Indonesia on May 14"}, {"id": "5eb0e910-c3be-4aed-bb43-6923dd61735b", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://55krc.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "California", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Here are the natural-disasters events in the text:\n- 5.2-magnitude earthquake struck Chile on Monday (May 13)\n- 6.4-magnitude earthquake was reported in Mexico, Guatemala, and El Salvador on Sunday (May 12)\n- 5.9-magnitude earthquake struck California on Monday (May 13)\n- 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region"}, {"id": "da92b7f9-105d-4155-8240-20bc8b487f0f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-16 22:45", "url": "https://1450wkip.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": ")\nJAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "5.2 magnitude earthquake in Chile\n6.4 magnitude earthquake in Mexico, Guatemala, and El Salvador\n4.3  magnitude earthquake in California\n6.1 magnitude earthquake in Indonesia\n6.5 magnitude earthquake in the Japanese island region\n6.0 magnitude earthquake in Taiwan"}, {"id": "93f506e7-9feb-4a50-a2e2-69fbc576e3ff", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://wrak.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "5.2-magnitude earthquake in Chile\n6.4-magnitude earthquake in Mexico, Guatemala, and El Salvador\n6.4-magnitude earthquake in Chile\n4.3-magnitude earthquake in California\n6.1-magnitude earthquake in Indonesia\n6.5-magnitude earthquake in Japan"}, {"id": "437a5e8c-e92e-46bd-806b-efbe96643c3a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://newstalk1090.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Based on the information given, the most specific location for the main event is 'Taiwan'.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Natural-disaster events:\n5.2-magnitude earthquake in Chile\n6.4-magnitude earthquake in Mexico, Guatemala, and El Salvador\n6.4-magnitude earthquake in Indonesia\n6.1-magnitude earthquake in Taiwan\n6.1-magnitude earthquake in Japan"}, {"id": "dc27324a-a133-448d-8337-0bd9bcc0e92f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://veropatriot.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia, Chile and Mexico earthquakes were reported in various magnitudes, all occurring within hours apart. California earthquake struck weeks later and Taiwan in April."}, {"id": "2bc3a9dc-dd8a-42e9-80ef-819f32f41a92", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://newstalk1230.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "-May 13, 2022: 5.2 magnitude earthquake is reported in Chile, hours after 4.3 magnitude earthquake is reported in Mexico, Guatemala and El Salvador. \n\n-May 14, 2022: 6.0 magnitude earthquake is reported in Taiwan. \n\n-May 18, 2022: 6.0 magnitude earthquake is reported in Indonesia.\n\n-May 21, 2022: 6.1 magnitude earthquake is reported in Indonesia, hours after a 6.5 magnitude earthquake is reported in Japan."}, {"id": "021c7f9a-77c4-4e64-9a8c-7152a52713a8", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://koacolorado.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "The natural-disasters events listed in the text are as follows:\n1. 5.2-magnitude earthquake strikes Chile on May 13\n2. 6.4-magnitude earthquake strikes Mexico, Guatemala and El Salvador on May 12\n3. 6.4-magnitude earthquake strikes Japan on May 13\n4. 6.0-magnitude earthquake strikes Taiwan on April 22\n5. 4.3-magnitude earthquake strikes California on April 18"}, {"id": "4ab43bfe-61f5-49c5-b6da-1f3d2b001003", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://newstalk1130.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Events reported in the text:\n- California (4.3 magnitude) on April 18\n- Mexico, Guatemala and El Salvador (6.4 magnitude) on May 12\n- Chile (5.2 magnitude) on May 13\n- Indonesia (6.1 magnitude) on May 13\n- Japanese island region (6.5 magnitude) on May 13\n- Taiwan (6.0 magnitude) on April 22"}, {"id": "b784245f-1692-447f-8c04-fed25499dbd1", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://ktok.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia earthquake, Chile earthquake, Mexico earthquake, Guatemala earthquake, El Salvador earthquake, California earthquake, Japan earthquake, Taiwan earthquake."}, {"id": "e367e947-abed-40e9-9bb2-438a8d7340f9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://whp580.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\nHere are the related natural-disasters events:\n1. Mexico earthquake on May 12\n2. Indonesia earthquake on May 13\n3. Chile earthquake on May 13\n4. California earthquake on May 18\n5. Japan earthquake on May 14\n6. Taiwan earthquake on April 22"}, {"id": "29f02042-a309-4ea5-b359-b2f0b8798f44", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wsyr.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "INDONESIA", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": ".\n1. 5.2-magnitude earthquake strikes Chile on Monday (May 13)\n2. 6.4-magnitude earthquake strikes Mexico, Guatemala, and El Salvador on May 12\n3. 6.4-magnitude earthquake strikes Indonesia on Saturday (February 6)\n4. 6.1-magnitude earthquake strikes Japan on Monday (April 18)\n5. 5.2-magnitude earthquake strikes Taiwan on Tuesday (April 22)\n6. 6.5-magnitude earthquake strikes Indonesia on May 4\n7. 6.6-magnitude earthquake strikes Indonesia on Monday (May 11)\nBased on these disasters, one can conclude that this is an unusually active period for major earthquakes. It's worth noting that earthquakes are not uncommon in the region, as it is part of the so-called \"Ring of Fire,\" a horseshoe-shaped region around the Pacific where several tectonic plates meet, causing frequent earthquakes and volcanic eruptions."}, {"id": "ec539feb-23cc-4818-b2a5-3c8b9ce834a0", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wtag.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "JAPAN", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia, Chile, Mexico, Guatemala, El Salvador, California, Japan, Taiwan"}, {"id": "967bda80-e1e3-4205-b1e7-82f3eb563b15", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://newsradio967.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "NULL", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "1. 5.2-magnitude earthquake strikes Chile on May 13\n2. 6.4-magnitude earthquake strikes Mexico, Guatemala and El Salvador on May 12\n3. 6.1-magnitude earthquake strikes Indonesia on May 13\n4. 6.5-magnitude earthquake strikes Japan on May 14\n5. 6.0-magnitude earthquake strikes Taiwan on April 22"}, {"id": "ecc657a0-e759-4589-b251-4f00a405d8d9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wiba.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": "Indonesia", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "Indonesia Earthquake, 5.2-magnitude (May 13)\nChile Earthquake, 5.2-magnitude (May 13)\nMexico, Guatemala, El Salvador Earthquake, 6.4-magnitude (May 12)\nCalifornia Earthquake, 4.3-magnitude (April 18)\nIndonesia Earthquake, 6.1-magnitude (March 11)\nCalifornia Earthquake, 6.5-magnitude (February 11) \nJapan Earthquake, 6.5-magnitude (April 25)\nTaiwan Earthquake, 6.0-magnitude (April 22)"}, {"id": "575b9927-80eb-4ce5-a55b-87bef5a9e9e5", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wjno.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey.", "location": ".\nCalifornia.", "classification": "natural-disasters", "score": 0.7460802764109014, "event_breakdown": "California Earthquake, Mexico, Guatemala, El Salvador Earthquake, Indonesia Earthquake, Chile Earthquake"}, {"id": "31e0637a-1b26-4a35-b096-e073a0687248", "title": "Texas Will Feel The Wrath of La Niña , Starting This Summer", "date": "2024-05-16 23:15", "url": "https://kfyo.com/ixp/190/p/la-nina-return/", "message": "The eastward winds of El Niño are fading, but a terrible little girl we know as La Niña is brewing on the horizon.\nWith El Niño, the temperatures in the eastern Pacific Ocean drop by half a degree Celsius; with El Niña, the inverse holds true.\nThe key difference between El Niño and La Niña in how it impacts Texas is that the former brings about a wet winter, the latter brings warmer, drier weather.\nThere may be a period of neutral weather, but we can expect a rapid cycle over to La Niña by June or August at the latest.\nAll aboard the Somewhat Small Texas Panhandle Towns tour!", "location": ")\nTexas", "classification": "natural-disasters", "score": 0.4111770150184765, "event_breakdown": "1. El Niño\n2. La Niña\n3. Neutral weather\n4. Rapid cycle over to La Niña"}, {"id": "6d7a4f2c-6009-424e-8956-98f672127b57", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 21:45", "url": "https://www.vernonmorningstar.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate.", "location": "Fort St. John", "classification": "natural-disasters", "score": 0.7278512672472682, "event_breakdown": "Wildfire threatening town of Fort Nelson in B.C."}, {"id": "658295ac-b402-459b-9488-b81fde2a4639", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 22:30", "url": "https://www.comoxvalleyrecord.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate.", "location": "Fort St. John", "classification": "natural-disasters", "score": 0.7278512672472682, "event_breakdown": "The wildfire threatening the town of Fort Nelson in far northeast B.C. occurred on rural properties outside the town, around the northern flank of the fire.\nThe impact of the wildfire was immediate on other businesses in the surrounding areas of Fort St. John. The evacuees added to the swelling town, and a local eatery quickly ran out of burgers."}, {"id": "c81c9728-5a62-42f0-8a84-25363095f6e7", "title": "Fort St . John eatery out of burgers as B . C . wildfire evacuees swell town", "date": "2024-05-16 22:45", "url": "https://www.kimberleybulletin.com/news/fort-st-john-eatery-out-of-burgers-as-bc-wildfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate.", "location": "Fort St. John", "classification": "natural-disasters", "score": 0.7278512672472682, "event_breakdown": "The wildfires threatening the town of Fort Nelson, Fort St. John businesses being overwhelmed as B.C. wildfire evacuees swell town and the impact on the rural properties in the Fort Nelson."}, {"id": "32d1813d-6eba-4e27-856b-8dc34f2d52c8", "title": "Fort St . John eatery out of burgers as B . C . wildfire evacuees swell town", "date": "2024-05-16 23:15", "url": "https://www.cranbrooktownsman.com/news/fort-st-john-eatery-out-of-burgers-as-bc-wildfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate.", "location": "Fort St. John", "classification": "natural-disasters", "score": 0.7278512672472682, "event_breakdown": "The wildfire threatening the town of Fort Nelson in far northeastern B.C. was mainly located on rural properties outside the town.  The impact was immediate for the Fort St. John businesses, which faced swelling crowds due to the influx of B.C. wildfire evacuees.  People properties suffered a damage in the northern flank of the fire in the northern Rockies Regional Municipality."}, {"id": "d03fb0a8-cb58-423a-bb99-cab3973c87a1", "title": "Severe storm threat increases across San Antonio . What can you expect ? ", "date": "2024-05-16 20:30", "url": "http://www.expressnews.com/san-antonio-weather/forecast/article/severe-storm-threat-increases-across-san-antonio-19461712.php", "message": "SEVERE THREATSWhat’s new for San Antonio is the upgraded severe threat from the Storm Prediction Center.\nSan Antonio has been upgraded to a level 2 of 5 severe threat for the afternoon and evening.\nNational Weather ServiceAccording to the National Weather Service, once the capping inversion erodes around lunchtime, we will see isolated to widely scattered thunderstorms develop and quickly intensify.\nFLOODING IS POSSIBLEIn addition to the severe thunderstorms, heavy rain is likely, especially east and north of San Antonio.\nHeavy downpours are likely with any strong storms but the heaviest rain will happen north and east of San Antonio.", "location": "SAN ANTONIO", "classification": "natural-disasters", "score": 0.9525504612079989, "event_breakdown": "the natural-disasters events listed in the text are:\n- Severe thunderstorms\n- Heavy rain"}, {"id": "87795757-85d1-4ff0-8846-8a3bb67a79c5", "title": "Canadian wildfire smoke just blanketed the Midwest . Again . ", "date": "2024-05-16 21:45", "url": "https://grist.org/wildfires/canadian-wildfire-smoke-just-blanketed-the-midwest-again/", "message": "“We issue this particular advisory when it’s at a 10-plus, and it is due to wildfire smoke,” Smith said.\nHere's HowIn 2023, parts of the Midwest and Northeast United States saw some of the worst air quality in the world.\nAnd while the movement of wildfire smoke is difficult to predict, the location of the fires is an important factor.\nLast summer, some of the wildfire smoke that blanketed much of the Midwest and Northeast U.S. came from areas that were hard to reach, according to Alec Kownacki, a meteorologist with Michigan’s Air Quality Division.\nThere’s no access roads.’”In Canada, fires are initially managed by local governments in partnership with provinces and territories.", "location": "Northeast United States", "classification": "natural-disasters", "score": 0.6228509661420724, "event_breakdown": "Based on the text, here are the list of the natural-disasters events related to wildfire smoke in 2023:\n1. Wildfire smoke in the Midwest and Northeast United States.\n2. Hard to reach wildfire areas.\n3. Fires initially managed by local governments in partnership with provinces and territories in Canada."}, {"id": "5033f9aa-f55d-4a17-bfb0-c33253ce1bb4", "title": "Rains Helping To Ease Iowa Drought | AM 600 WMT", "date": "2024-05-16 22:15", "url": "https://600wmtradio.iheart.com/content/2024-05-16-rains-helping-to-ease-iowas-drought/", "message": "(Undated) -- This week's U.S. Drought Monitor shows continued improvement in Iowa.\nRecent heavy rains have helped to lift more areas out of drought and to ease the severity of drought in other locations.\nThe driest conditions continue to be in northeast Iowa, where a large part of that region remains in severe drought.\nThe National Weather Service is predicting warm and dry weather for the next few days.\nForecasters are predicting active weather next week with more chances for storms.", "location": "Iowa", "classification": "natural-disasters", "score": 0.914385257182678, "event_breakdown": "Natural disasters in the text:\n1. Drought in Iowa.\n2. Heavy rains in Iowa.\n3. Dry weather in Iowa.\n4. Severe drought in Iowa."}, {"id": "c9e83a56-9d9f-40e6-bb08-e0fec38867ed", "title": "Nebraska Drought Improves Slightly | NewsRadio 1110 KFAB", "date": "2024-05-16 20:30", "url": "https://kfab.iheart.com/content/2024-05-16-nebraska-drought-improves-slightly/", "message": "(Lincoln, NE) -- Drought conditions in Nebraska improved slightly in the past week.\nThe U.S. Drought Monitor shows around 30-percent of the state as either abnormally dry or in moderate drought.\nIowa's drought picture has improved as well.\nMost of Pottawattamie County, Iowa is in moderate drought.\nThe National Weather Service in Valley, NE predicts warm temperatures this weekend with a good chance at widespread showers and thunderstorms returning on Sunday.", "location": "LINCOLN", "classification": "natural-disasters", "score": 0.7043437855098117, "event_breakdown": "Drought Conditions in Nebraska Improved Slightly in the Past Week and Most of Pottawattamie County is in moderate drought."}, {"id": "5c6508a0-2b02-467d-98f7-6c02068767b8", "title": "John Swinney confirms support Fife residents affected by Storm Gerrit", "date": "2024-05-16 21:45", "url": "https://www.thenational.scot/news/24326020.john-swinney-confirms-support-fife-residents-affected-storm-gerrit/", "message": "John Swinney announced on Thursday that funds will be made available to Fife Council to support households and businesses in Cupar flooded as a result of Storm Gerrit, on the same basis as the support provided to those worst affected by Storm Babet.\nSwinney said the Scottish Government takes the issue of flood resilience “very seriously”, adding that the grant will be made available for residents “as swiftly as possible”.\nDear WillieFlood support for Cupar residents and businessesThank you for raising the issue of support for Cupar residents and businesses impacted by flooding from Storm Gerrit.\nWe know that in the face of climate change improving flood resilience is one of the largest adaptation challenges we face.\nResponsibility for flood resilience is primarily that of the occupier of a property, and then for a Local Authority to consider community level resilience.", "location": "Cupar, Scotland", "classification": "natural-disasters", "score": 0.8043869894733068, "event_breakdown": "Flood support for Cupar residents and businesses impacted by flooding from Storm Gerrit."}, {"id": "76f08077-2d74-4146-a243-1ab5cffef823", "title": "Congressional Delegation On $60M From Inflation Reduction Act To Strengthen Water Security In Rio Grande Basin", "date": "2024-05-16 22:15", "url": "https://ladailypost.com/new-mexico-congressional-delegation-announces-60-million-from-inflation-reduction-act-to-strengthen-water-security-in-rio-grande-basin/", "message": "Representatives Teresa Leger Fernández (D-N.M.), Melanie Stansbury (D-N.M.), and Gabe Vasquez (D-N.M.) are announcing $60 million from the Inflation Reduction Act to help Doña Ana and Sierra County residents and farmers with drought mitigation and climate adaptation efforts, which will strengthen water security in the Rio Grande Basin.\n“New Mexicans are regularly seeing the effects of climate change and long-term aridification on the Rio Grande.\nShorter irrigation seasons and an increased reliance on groundwater pumping demonstrate the dramatic changes the Rio Grande has undergone as our water resources decline,” Heinrich said.\nThis funding from the Inflation Reduction Act means communities in New Mexico will now have more resources to protect the Rio Grande and the clean, essential water supply it brings to the state.\nIn 2022, Heinrich and Luján wrote to DOI Assistant Secretary Tanya Trujillo requesting that DOI allocate funds appropriated by the Inflation Reduction Act to support drought mitigation, resilience, and Tribal and Pueblo irrigation and water needs in the Rio Grande Basin.", "location": "NEW MEXICO", "classification": "natural-disasters", "score": 0.6033173374340963, "event_breakdown": "- Drought in New Mexico\n- Effects of climate change in New Mexico\n- Aridification in New Mexico\n- Groundwater pumping in New Mexico\n- Irrigation seasons in New Mexico"}, {"id": "a701bf4d-2f3d-4725-9368-4e64d78bf317", "title": "Burgers run out , hotels heave , as wildfire evacuees swell a B . C . town", "date": "2024-05-16 20:30", "url": "https://lethbridgeherald.com/news/national-news/2024/05/16/burgers-run-out-hotels-heave-as-wildfire-evacuees-swell-a-bc-town/", "message": "Burgers run out, hotels heave, as wildfire evacuees swell a B.C.\nA view of the Parker Lake wildfire near Fort Nelson, B.C.\nis shown on Monday, May 13, 2024 in a BC Wildfire Service handout photo.\nis shown on Monday, May 13, 2024 in a BC Wildfire Service handout photo.\n– The Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said.", "location": "Fort St. John, British Columbia", "classification": "natural-disasters", "score": 0.401190068393579, "event_breakdown": "Here is the list of natural-disasters events in the text:\n1. Parker Lake wildfire\n2. Forest fire near Fort Nelson, B.C."}]