[{"id": "4f7583c2-9e9a-4e74-88c6-9b3c27570560", "title": "Ukraine War Escalates : Seven Killed in Kharkiv Strike as US Debates Missile Deployment into Russia", "date": "2024-05-24 04:15", "url": "https://trendydigests.com/2024/05/24/ukraine-war-escalates-seven-killed-in-kharkiv-strike-as-us-debates-missile-deployment-into-russia/", "message": "As the conflict in Ukraine intensifies, a recent Russian missile attack on Kharkiv has left seven people dead and more than a dozen injured, according to Ukrainian officials.\nThe Ukrainian Foreign Minister, Dmytro Kuleba, also denounced the Kharkiv attack, emphasizing the urgency for additional defensive systems.\nRussian foreign ministry spokesperson Maria Zakharova stated that British sites “within Ukraine’s territory and beyond” could be targeted in retaliation.\nRelevant articles:– Ukraine war live: 7 killed in Russian Kharkiv strike amid US missile push , The Independent, 05/24/2024– Russia-Ukraine war – live: Putin’s forces kill 7 in Kharkiv amid push for US missiles to be fired into Russia, Yahoo!\nVoices, 05/23/2024– Russia war: Russia retakes unrecognisable village from Ukraine, The Telegraph, 05/23/2024Glad you enjoyed above story, be sure to follow TrendyDigests on Microsoft Start.", "location": "Kharkiv", "classification": "security", "score": 0.7071984749778257, "event_breakdown": "Security events:\n- Russian forces kill 7 people in Kharkiv, Ukraine on May 24, 2024 \n- Russian Foreign Ministry spokesperson Maria Zakharova states that British sites ‘within Ukraine’s territory and beyond’ could be targeted in retaliation. \n- Russia retakes unrecognisable village from Ukraine on May 23."}, {"id": "5247caa8-e228-40bf-9c1c-6c6ed662da32", "title": "Israel - Hezbollah Tensions : Conflict on Lebanon Border Risks Spiraling", "date": "2024-05-24 00:45", "url": "https://foreignpolicy.com/2024/05/23/israel-and-hezbollah-inch-closer-to-war/", "message": "Just beyond the clusters of villages that dot the mountainous region—home to Jews, Arabs, Christians, and Druze—lies Israel’s northern border with Lebanon.\nOn the other side lies one of Israel’s most powerful foes: Hezbollah, the most heavily armed non-state actor in the world.\nSince the Hamas attack on southern Israel on Oct. 7, 2023, Hamas’s ally Hezbollah has launched hundreds of mortar, missile, and rocket attacks into Israel in near-daily clashes with the Israel Defense Forces (IDF).\nFollowing the 2006 Israel-Hezbollah War (also called the Second Lebanon War), the area was relatively quiet, with Hezbollah mounting just a few dozen attacks in the 17 years since.\n“We’ve been through wars, we’ve been through the Second Lebanon War, and basically we thought to ourselves, ‘If they’re going to bomb, we know what they’re sending.’ We thought we knew,” he said.", "location": "Northern border of Israel with Lebanon", "classification": "security", "score": 0.8498932937268351, "event_breakdown": "Hezbollah attack against Israel\nHamas attack against Israel"}, {"id": "2cd62f05-c1c0-42f8-bf3e-c1d85d774408", "title": "Israel - Hezbollah Tensions : Conflict on Lebanon Border Risks Spiraling", "date": "2024-05-24 00:45", "url": "https://foreignpolicy.com/2024/05/23/israel-and-hezbollah-inch-closer-to-war/?tpcc=recirc_trending062921", "message": "Just beyond the clusters of villages that dot the mountainous region—home to Jews, Arabs, Christians, and Druze—lies Israel’s northern border with Lebanon.\nOn the other side lies one of Israel’s most powerful foes: Hezbollah, the most heavily armed non-state actor in the world.\nSince the Hamas attack on southern Israel on Oct. 7, 2023, Hamas’s ally Hezbollah has launched hundreds of mortar, missile, and rocket attacks into Israel in near-daily clashes with the Israel Defense Forces (IDF).\nFollowing the 2006 Israel-Hezbollah War (also called the Second Lebanon War), the area was relatively quiet, with Hezbollah mounting just a few dozen attacks in the 17 years since.\n“We’ve been through wars, we’ve been through the Second Lebanon War, and basically we thought to ourselves, ‘If they’re going to bomb, we know what they’re sending.’ We thought we knew,” he said.", "location": "Lebanon", "classification": "security", "score": 0.8498932937268351, "event_breakdown": "Security events in the text:\n\n1. Hamas attacks southern Israel on Oct. 7, 2023\n2. Hezbollah launches hundreds of mortar, missile, and rocket attacks into Israel in near-daily clashes with the Israel Defense Forces (IDF)\n3. Hezbollah mounting just a few dozen attacks in the 17 years since the 2006 Israel-Hezbollah War (also called the Second Lebanon War)"}, {"id": "755f0dc3-d1cc-4116-b81c-25b82619d2b1", "title": "Israeli forces kill dozens of Palestinians in Gaza", "date": "2024-05-24 00:45", "url": "https://www.illawarramercury.com.au/story/8639567/israeli-forces-kill-dozens-of-palestinians-in-gaza/?cs=7484", "message": "Israel launched its assault on Gaza following a Hamas-led attack on southern Israeli communities on October 7 that killed 1200 people and led to more than 250 hostages, by Israeli tallies.\nSince then, Israel's assault in Gaza has killed more than 35,000 people, with thousands more feared buried under the rubble, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9360633628891979, "event_breakdown": "- Hamas-led attack on southern Israeli communities on October 7\n- Israel's assault on Gaza\n- Israel's assault in Gaza has killed more than 35,000 people"}, {"id": "c5835244-4602-4c07-a638-fcc34f4690a7", "title": "Suleiman  Sam  Abdulrahim shooting : Underworld figure and boxer known as  The Punisher  survives second assassination attempt outside his Thomastown home", "date": "2024-05-24 03:00", "url": "https://www.dailymail.co.uk/news/article-13454387/Suleiman-Abdulrahim-shooting-Melbourne.html", "message": "Underworld figure Suleiman 'Sam' Abdulrahim has survived another assassination attempt as police investigate whether he was lured outside his home before he was shot at in an attempted gangland hit.\nThe shooting outside the Melbourne home of Abdulrahim, a professional boxer known as 'The Punisher', is suspected to be the latest development in the city's underworld tobacco wars.\nIt's understood shots were fired outside Abdulrahim's home in Larch St, at Thomastown in the city's north, about 3.15am on Friday morning.\nUnderworld figure Suleiman 'Sam' Abdulrahim (pictured) has survived another suspected assassination attempt following a shooting outside his Melbourne homeNeighbours reportedly heard the commotion before the offenders fled the scene.\nOn June 25, 2022, Abdulrahim was peppered with bullets near Fawkner Memorial Park in Melbourne's north during his cousin's funeral procession - sparking fears Melbourne's underworld was set to explode in a wave of violence.", "location": "Melbourne", "classification": "security", "score": 0.9899279881848939, "event_breakdown": "Security Events:\n\n1. An assassination attempt was made on Suleiman 'Sam' Abdulrahim at his home at Melbourne, Australia at 3:15 AM, Friday July 1, 2022.\n2. Shots were fired (unknown number of times by unknown number of shooters) outside of Abdulrahim's home in Melbourne's north side in Melbourne, Australia.\n3. A small disturbance was heard by neighbors before the shooters fled the scene.\n4. On June 25, shots were fired on June 25 near Fawkner Memorial Park in Melbourne's north during Abdulrahim's cousin's funeral procession.\n5. Two events, July 1st - July 25th, might be related."}, {"id": "ee22f819-4757-4ddd-bb09-5b3815e1943d", "title": "Israel pushes deeper into Rafah , defying growing pressure", "date": "2024-05-24 01:15", "url": "https://www.bostonglobe.com/2024/05/23/world/israel-pushes-deeper-into-rafah-defying-growing-pressure/", "message": "Israel’s military battled deeper into Rafah in the southern Gaza Strip on Thursday, expanding its offensive into the city and driving more people out of it, while Israel faced growing international pressure and isolation over its war against Hamas.\nEven while international support for Israel has eroded over its devastating military response in Gaza, Israelis have remained focused on the brutality of the Hamas-led Oct. 7 attacks.\nAid continues to enter by other routes, but relief groups say not enough is reaching people in parts of Gaza.\nThe Israeli news media continually report the stories of victims, survivors, and the families of those held hostage in Gaza.\n“Israel is not only isolated, but feels that it is under some kind of siege,” said Alon Pinkas, a former Israeli diplomat.", "location": "GAZA", "classification": "security", "score": 0.5795315222160963, "event_breakdown": "* Israeli military battled deeper into Rafah in the southern Gaza Strip on Thursday, expanding its offensive into the city\n* Israel's ongoing war on Hamas has resulted in international pressure on Israel.\n* As foreign support for Israel erodes over its devastating military response in Gaza, the Israeli people remain focused on the brutality of Hamas-led attacks.\n* Aid continues to enter Gaza from other routes, but not enough is reaching people in specific parts of the conflict zone.\n* The Israeli news media continue to report the stories of victims, survivors, and the families of those held hostage in Gaza.\n* Alon Pinkas, a former Israeli diplomat, claims Israel is both feels isolated and under siege."}, {"id": "e282c7a5-c8e8-4ee2-98a7-4256f05c811a", "title": "New law targeting support for terrorism passes vote in US House", "date": "2024-05-24 03:15", "url": "https://www.jpost.com/american-politics/article-802499", "message": "According to the measure, if the Treasury secretary determines that a nonprofit is delivering material support to a terrorist group, it can lose its tax-exempt status.\nExisting law, the column by Matthew Petti pointed out, already banned material support for terrorist groups.\nUnder current law, the government must take to trial any group that authorities deem to be providing material support to terrorists, which can be a lengthy ordeal.\nAnd what counts as material support?\nThe groups have in the past joined legal efforts to challenge the material support definition, contending that it hinders funding for humanitarian relief groups.", "location": "Washington, D.C.", "classification": "security", "score": 0.5812514435358558, "event_breakdown": "1. Treasury secretary must determine if nonprofit is delivering material support to a terrorist group\n2. The government already bans material support for terrorist groups\n3. Existing law states that the government must take to trial any group that authorities deem to be providing material support to terrorists\n4. Some groups have in the past joined legal efforts to challenge the material support definition\n5. The material support definition hinders funding for humanitarian relief groups."}, {"id": "c1dd5723-a3be-4c67-b61e-96ae783ad4e2", "title": "12 Palestinians killed in Israeli airstrike on aid center in Gaza", "date": "2024-05-24 01:15", "url": "https://www.dailyfinland.fi/worldwide/37852/12-Palestinians-killed-in-Israeli-airstrike-on-aid-center-in-Gaza", "message": "12 Palestinians killed in Israeli airstrike on aid center in GazaHumanitarian aid dropped by a plane falls at a school in the southern Gaza Strip city of Khan Younis, on May 23, 2024.\nAt least 12 Palestinians were killed in an Israeli airstrike targeting an aid distribution center in central Gaza, Palestinian security and medical sources said Thursday, reported Xinhua.\nSecurity sources told Xinhua that an Israeli aircraft targeted the center in the east of Deir al-Balah city with a missile.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and more than 250 were taken hostage.\nThe majority of the population in the Gaza Strip suffer from a lack of food, medicine, and basic humanitarian needs since the outbreak of the war.", "location": ".\nGAZA", "classification": "security", "score": 0.9722692455873195, "event_breakdown": "- Israeli airstrike on aid center in Gaza\n- Large-scale offensive against Hamas\n- Hamas rampage through the southern Israeli border"}, {"id": "bbad6d7a-9012-4225-8378-21047119a905", "title": "COAS meets civil , military leaders in Germany", "date": "2024-05-24 00:15", "url": "https://www.thenews.com.pk/print/1192637-coas-meets-civil-military-leaders-in-germany", "message": "COAS General Syed Asim Munir meets German military officers during official visit to Germany on May 23, 2024.\n— ISPRRAWALPINDI: Chief of Army Staff (COAS) Gen Syed Asim Munir, who is on an official visit to Germany, met General Carsten Breuer, Chief of Defence.\nOn arrival at the Ministry of Defence, he was presented with Honour Guard by the contingent of German Armed Forces.\nThe COAS also met Lieutenant General Alfons Mais, Chief of the German Army and visited the Army Combat Training Centre, Gardelegen along with the German Army Chief.\nThe COAS was briefed on various facets of the centre and the training being imparted to the German Army and contingents of other armies.", "location": "Germany", "classification": "security", "score": 0.8644741503113703, "event_breakdown": "The security events in the text are:\n1) Chief of Army Staff (COAS) Gen Syed Asim Munir visited Germany on May 23, 2024.\n2) On arrival at the Ministry of Defence, the COAS met General Carsten Breuer, Chief of Defence.\n3) The COAS also met Lieutenant General Alfons Mais, Chief of the German Army.\n4) The COAS visited the Army Combat Training Centre, Gardelegen along with the German Army Chief."}, {"id": "f3405b51-3d76-45c1-9ea3-346184ba4008", "title": "Israel , The ICC , And The Disintegration Of Our Species", "date": "2024-05-24 01:15", "url": "https://www.patheos.com/blogs/gracecoloredglasses/2024/05/israel-the-icc-and-the-disintegration-of-our-species/", "message": "So you probably heard that on Monday, the International Criminal Court announced that it would be seeking arrest warrants for the Prime Minister of Israel, Benjamin Netanyahu, and his Minister of Defense, Yoav Gallant.\n(Don’t worry: the ICC is also seeking arrest warrants for several members of Hamas.)\nThe level-headed prime minister of Israel, Benjamin Netanyahu, had a few choice words following the announcement.\nThe prosecutor’s absurd charges against me and Israel’s defense minister are merely an attempt to deny Israel the basic right of self-defense.\nThe ICC has no problem with Israel defending itself – it has a problem with how Israel is defending itself, that is, by starving and killing civilians.", "location": "Jerusalem", "classification": "security", "score": 0.7294078708284951, "event_breakdown": "1. The ICC announced that it would be seeking arrest warrants for Benjamin Netanyahu, the Prime Minister of Israel, and Yoav Gallant, the Minister of Defense.\n2. Benjamin Netanyahu, the Prime Minister of Israel, responded to the announcement."}, {"id": "50dd3c24-bbda-4177-9970-495913ad0890", "title": "Russian missiles kill 7 in Ukraine second - largest city where Moscow troops are pressing | News , Sports , Jobs", "date": "2024-05-24 04:00", "url": "https://www.tribtoday.com/news/latest-news/2024/05/russian-missiles-kill-7-in-ukraines-second-largest-city-where-moscows-troops-are-pressing/", "message": "At least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, lies about 12 miles from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 6 miles west of Kharkiv city, Russian missiles struck the town’s center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "KHARKIV", "classification": "security", "score": 0.960468964377795, "event_breakdown": "Security events:\n\n- 16 people were injured as S-300 missiles struck the city of Kharkiv.\n- Russian missiles struck the center of Liubotyn, a small town near Kharkiv, injuring eight civilians.\n- Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka, and Rozdolivka in Donetsk."}, {"id": "537c83d6-41ad-4d87-8eb8-01b857905401", "title": "Lebanese children narrowly escape deadly strike on Hezbollah fighter", "date": "2024-05-24 05:00", "url": "https://dunyanews.tv/en/World/813802-Lebanese-children-narrowly-escape-deadly-strike-on-Hezbollah-fighter", "message": "Lebanese children narrowly escape deadly strike on Hezbollah fighterWorld World Lebanese children narrowly escape deadly strike on Hezbollah fighterLebanese children on a minibus had a narrow escape when a drone strike killed a Hezbollah fighter.\nFollow on Published On: Fri, 24 May 2024 07:21:01 PKTNABATIEH (Lebanon) (AFP) – Lebanese school children on a minibus had a narrow escape Thursday when a drone strike killed a Hezbollah fighter in the car ahead, blowing out the windscreen of their vehicle and wounding three pupils.\nI backed up and that's when the second strike hit the car\" in front of him, Qubaisi added.\nThe source close to Hezbollah told AFP that Israel was behind the strike, which killed a Hezbollah member who was named as Mohammad Ali Nasser Farran.\nThe attack \"killed a car driver\" and \"wounded three pupils\" who were in a bus heading to school, it said.", "location": "NABATIEH", "classification": "security", "score": 0.9596098462459339, "event_breakdown": "Security events:\nHezbollah claims Israel targeted a Hezbollah member near the Nabi Sheet ridge;\nHezbollah member killed when his car was hit with a missile;\nA minibus full of school children was hit after the Hezbollah target was struck. Three school children were injured;"}, {"id": "b2ab8b23-8f27-4015-89b7-4e014fcca741", "title": "113 combat clashes with Russians took place at contact line in past day – General Staff", "date": "2024-05-24 08:45", "url": "https://www.yahoo.com/news/113-combat-clashes-russians-took-055817753.html", "message": "113 combat clashes with Russians took place at contact line in past day – General StaffThere have been 113 combat clashes with the Russian forces at the contact line over the past day.\nSource: General Staff of the Armed Forces of Ukraine spokesperson Dmytro Lykhovii during a national joint 24/7 newscastQuote: \"There have been 113 combat clashes with the Russian forces at the contact line over the past day. \"\nA total of 4 combat clashes took place there.\nThe fighting took place in the vicinity of Lyptsi, Starytsa and Tykhe.\nOn the Prydniprovske front, the Russians are continuing to try to push Ukrainian forces from the left bank of the Dnipro River.", "location": "LVIV", "classification": "security", "score": 0.9039705063340271, "event_breakdown": "1. Ukraine - Russia: 113 combat clashes with Russians took place at contact line in past day\n2. Ukraine - Russia: 4 combat clashes took place there in the vicinity of Lyptsi, Starytsa and Tykhe.\n3. Ukraine - Russia: Russians keep pushing Ukrainian forces from the left bank of the Dnipro River."}, {"id": "2078c0fd-bfda-4f53-bf4a-3ecdf6ae3876", "title": "Eager Lion Drill Concludes At Qaser Tuba Training Field", "date": "2024-05-24 04:45", "url": "https://menafn.com/1108252522/Eager-Lion-Drill-Concludes-At-Qaser-Tuba-Training-Field", "message": "(MENAFN- Jordan Times) AMMAN - The 2024 Eager Lion Drill, carried out by the Jordan Armed Forces-Arab Army (JAF), concluded on Thursday, with an exercise led by the 48th Princess Alia Mechanised Brigade, operating under the Northern Military Zone.\nHeld at the Qaser Tuba training field, the exercise saw the participation of many countries, senior officers from the Jordanian Armed Forces-Arab Army (JAF), as well as military attachés, according to an armystatement.\nParticipants demonstrated exceptional precision and professionalism in the execution of joint operations, highlighting their ability to manoeuvre and coordinate weapon systems effectively throughout the exercise phases.\nFocusing on strategic, operational and tactical objectives, this year's Eager Lion Drill aimed to address various security challenges, including maritime security, anti-terrorism capabilities, enhancing information operations and AI capabilities, crisis and disaster response capabilities, humanitarian assistance, integrated air and missile defence systems, intelligence capabilities and the development of response capabilities to security threats and internal crises.\nBesides Jordan, the exercise saw the participation of 33 countries, including the US, Australia, New Zealand, Bahrain, South Africa, Cyprus, France, Germany, Greece, Iraq, Italy, Japan, Kenya, Kuwait, Lebanon, Norway, Pakistan, Saudi Arabia, UAE, United Kingdom, Kazakhstan, Oman, Egypt, Poland, Morocco, Canada, Spain, Romania, Yemen, Kosovo, Brunei and The Netherlands.`", "location": "Qaser Tuba", "classification": "security", "score": 0.6371558613773083, "event_breakdown": "Here is the text with the events listed:\nEager Lion Drill 2024\nEvent: Jordanian Army 48th Princess Alia Mechanised Brigade leads 2024 Eager Lion Drill at the Qaser Tuba training field.\nEvent: 2024 Eager Lion Drill addresses various security challenges including maritime security, anti-terrorism capabilities, enhanced information operations and AI capabilities, crisis and disaster response capabilities, humanitarian assistance, integrated air and missile defence systems, intelligence capabilities, and response to security threats and internal crises.\nEvent: The 2024 Eager Lion Drill involves 33 nations, including the US, Australia, New Zealand, Bahrain, South Africa, Cyprus, France, Germany, Greece, Iraq, Italy, Japan, Kenya, Kuwait, Lebanon, Norway, Pakistan, Saudi Arabia, UAE, United Kingdom, Kazakhstan, Oman, Egypt, , Poland, Morocco, Canada, Spain, Romania, Yemen, Kosovo, Brunei, and The Netherlands."}, {"id": "a15793cd-ac4e-4a35-898e-8e07295aeb4f", "title": "Man Kills 8 , Injures 1 In Knife Attack In Central China", "date": "2024-05-24 08:45", "url": "https://www.ndtv.com/world-news/man-kills-8-and-wounds-1-in-knife-attack-in-central-china-5734342", "message": "Mass violent crime is relatively rare in China.\n(Representational)A man killed eight people and wounded one more with a knife in central China, state media reported Friday, citing local authorities.\nMass violent crime is relatively rare in China, which strictly prohibits citizens from owning firearms, but there has been a spate of stabbings in recent years.\nOn Monday, a woman wielding a fruit knife killed two people and injured four more at a primary school in central Jiangxi province.\nAlso this month, two people were killed and 21 wounded after a man went on a stabbing spree at a hospital in southwest China's Yunnan province.", "location": "CHINA", "classification": "security", "score": 0.6338540539073937, "event_breakdown": "Mass stabbings in China:\n\n* Eight people were killed and another wounded in a knife attack in central China on Friday.\n* A woman killed two people and injured four more at a primary school in Jiangxi province on Monday.\n* This month, two people were killed and 21 wounded after a man went on a stabbing spree at a hospital in Yunnan province."}, {"id": "007f2554-349c-4fc6-b7d3-7125b4022bf3", "title": "Eight killed in central China stabbing : state media", "date": "2024-05-24 08:45", "url": "https://www.thedailystar.net/news/asia/china/news/eight-killed-central-china-stabbing-state-media-3617556", "message": "A man killed eight people and wounded one more with a knife in central China, state media reported Friday, citing local authorities.\nThe stabbing took place on Thursday morning in the city of Xiaogan in Hubei province, state broadcaster CCTV said.\nThe wounded person's injuries were not life-threatening, according to state news agency Xinhua.\nOn Monday, a woman wielding a fruit knife killed two people and injured four more at a primary school in central Jiangxi province.\nAlso this month, two people were killed and 21 wounded after a man went on a stabbing spree at a hospital in southwest China's Yunnan province.", "location": "XIANGFAN", "classification": "security", "score": 0.8845567164928144, "event_breakdown": "1. Thursday, 27 October 2022, a man killed eight people and wounded one more with a knife in central China, state media reported.\n2. Monday, 24 October 2022, a woman wielding a fruit knife killed two people and injured four more at a primary school in central Jiangxi province.\n3. Monday, 24 October 2022, two people were killed and 21 wounded after a man went on a stabbing spree at a hospital in southwest China's Yunnan province."}, {"id": "1295bbcc-f902-4709-b4c2-9ed1e6e718da", "title": "US - led coalition airstrikes on Yemen Hodeidah airport – Firstpost", "date": "2024-05-24 05:15", "url": "https://www.firstpost.com/world/us-led-coalition-airstrikes-on-yemens-hodeidah-airport-13774455.html", "message": "These attacks, targeting what the Houthis claim are Israeli-linked ships transiting the Red Sea, began in November of the previous year.\nread moreWarplanes of the US-British coalition conducted two airstrikes on Hodeidah airport in western Yemen late Thursday night, as reported by the Houthi-run al-Masirah TV.\nThe Hodeidah airport is situated in the southern part of the Red Sea port city of Hodeidah, which is under the control of the Houthi group.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.\nAdvertisementOn Tuesday, the Iran-backed Houthi rebels claimed that they shot down an American drone over the country on the Arabian Peninsula.", "location": "Hodeidah", "classification": "security", "score": 0.7216460836189216, "event_breakdown": "1) Houthi rebels conduct airstrike on Hodeidah airport in Yemen."}, {"id": "0579f37f-95e5-4572-b531-78af2bca66ce", "title": "Remains of unknown Newfoundland soldier who fought in France coming home this weekend – Winnipeg Free Press", "date": "2024-05-24 07:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/sci-tech/2024/05/24/remains-of-unknown-newfoundland-soldier-who-fought-in-france-coming-home-this-weekend", "message": "HALIFAX – The remains of an unknown Newfoundland soldier who died in France during the First World War are expected to arrive Saturday in St. John’s, N.L., where preparations are being made for a solemn reburial ceremony on July 1.\nThe remains of an unknown Newfoundland soldier buried in France during the First World War is to arrive Saturday in St. John’s, N.L., where preparations are underway for a solemn reinterment ceremony on July 1.\nThe Beaumont-Hamel Newfoundland Monument in Beaumont-Hamel, France, is shown in a photo taken with a drone on Friday, June 10, 2016.\nThe preserved battlefield is the grounds on which the Newfoundland Regiment made their unsuccessful attack on July 1, 1916, the opening day of the Battle of the Somme.\nOn Saturday, the government of France is expected to formally transfer the remains of the unknown soldier to the governments of Canada and Newfoundland and Labrador during a repatriation ceremony at the Beaumont-Hamel Newfoundland Memorial, followed by ramp ceremonies at airports in France and St. John’s.", "location": "St. John's, Newfoundland", "classification": "security", "score": 0.40466552028055575, "event_breakdown": "Title: Unknown Soldier's Remains Arrive in St. John's, NL\n\nEvents:\n\n1. Transfer of Remains: On Saturday, June 25, the French government is to transfer the remains of an unknown Newfoundland soldier to the governments of Canada and Newfoundland and Labrador during a repatriation ceremony at the Beaumont-Hamel Newfoundland Memorial in Beaumont-Hamel, France.\n2. Newfoundland and Labrador Airport: After the repatriation ceremony, ramp ceremonies will take place at the airports in France and St. John's, Newfoundland and Labrador.\n3. Lieu de Memoire: The remains will be repatriated from France to the Newfoundland Memorial Park in St. John's, Newfoundland and Labrador, which serves as a lieu de memoire.\n4. Reburial Ceremony: The remains will be received in St. John's and a solemn reburial ceremony is planned for July 1.\n\nNote: The events are listed in the same order as they appear in the text, but they are not a complete list of all the events in the text."}, {"id": "4891a8a1-3234-4536-b0c8-f6609eac6dce", "title": "Israel Deepens Rafah Operation and Says 1 Million Civilians Have Moved Out", "date": "2024-05-24 08:45", "url": "https://www.yahoo.com/news/israel-deepens-rafah-operation-says-052048549.html", "message": "(Bloomberg) -- Israel is expanding its military operations in Rafah against Hamas and says 1 million civilians have now moved out of the city in southern Gaza.\nMost Read from Bloomberg“We are strengthening our effort in Rafah,” Defense Minister Yoav Gallant said Thursday.\nThe city, which borders Egypt, had about 1.4 million civilians before Israel’s military started urging them to move out in early May.\nPrime Minister Benjamin Netanyahu pledged to allow civilians to evacuate before a ground assault on Rafah, which Israel describes as the last bastion of Hamas.\nIsraeli troops are mostly operating on the outskirts of Rafah, but are moving further into the city as more civilians leave.", "location": "GAZA", "classification": "security", "score": 0.8015042540264325, "event_breakdown": "Here is the text with the events in bold:\nIsrael is expanding its military operations in Rafah against Hamas and says 1 million civilians have now moved out of the city in southern Gaza. The city, which borders Egypt, had about 1.4 million civilians before Israel’s military started urging them to move out in early May. Benjamin Netanyahu pledged to allow civilians to evacuate before a ground assault on Rafah, which Israel describes as the last bastion of Hamas."}, {"id": "61516e5f-7130-4beb-9ffe-9c830427660f", "title": "Chhattisgarh : One more naxal body recovered after exchange of fire between naxals and security forces", "date": "2024-05-24 08:45", "url": "https://news.webindia123.com/news/Articles/India/20240524/4200112.html", "message": "Eight Naxalites were killed in an ongoing encounter with security personnel, which started yesterday in the border area of Narayanpur and Bijapur districts in Chhattisgarh.\nFollowing the exchange of gunfire, the security forces conducted a thorough search operation in the area.\nChhattisgarh Chief Minister Vishnu Deo Sai congratulated the security forces saying that his government was committed to fighting against Naxalism.\n\"There is information coming in of seven Naxalites being killed in an encounter between security forces and Naxalites in the border area of Narayanpur-Bijapur district.\nCertainly, the security forces have achieved great success.", "location": "Bijapur district\".", "classification": "security", "score": 0.9478177883621561, "event_breakdown": "Security Event 1: A fierce gun battle between State security forces and a group of armed Naxal insurgents is taking place in the boundary areas of Narayanpur and Bijapur districts in Chhattisgarh state within Central India.\nSecurity Event 2: Reports confirm the successful elimination of seven Naxal insurgents during the state security operation.\nSecurity Event 3: Security forces continue combat operations in the region and embark on a thorough search operation to recover any insurgents that were hit during the gunfire exchange.\nSecurity Event 4: Chhattisgarh state Chief Minister Vishnu Deo Sai extends his congratulations and appreciation to the efficient state security units for successful operations—promising continued support in the fight against Naxal terrorists."}, {"id": "17a08afe-d06c-4439-9c43-8fa8da10be71", "title": "Greek - Owned Ship Targeted Off Yemen", "date": "2024-05-24 03:45", "url": "https://menafn.com/1108252467/Greek-Owned-Ship-Targeted-Off-Yemen", "message": "(MENAFN- Gulf Times) A missile attack targeted a Greek-owned cargo vessel off Yemen yesterday without causing any casualties or damage.\nYemen's Iran-backed Huthi rebels have waged a campaign of attacksagainst Israeli-linked shippingin the Red Sea and the Gulf of Aden since November in a show of support for Gaza amid the Israel-Hamas war.\nThe vessel targeted in the latest attack was the Maltese-flagged bulk carrier Yannis.\nAnother bulk carrier owned by the same company, the Cyclades, was attacked by the Houthis late last month.\nMaritime security firm Ambrey said the Cyclades was likely targeted \"due to its listed operator's ongoing trade with Israel\".", "location": "Southern Red Sea", "classification": "security", "score": 0.7128728493770639, "event_breakdown": "Events:\n* The Yemeni Huthi rebels target a Greek-owned cargo vessel off Yemen with a missile attack, causing no casualties or damage.\n* The Maltese-flagged bulk carrier Yannis, owned by the same company, Cyclades Bulkers Management Corp, is targeted by the Yemeni rebels.\n* The Cyclades, another bulk carrier owned by the same company, Cyclades Bulkers Management Corp, is targeted."}, {"id": "7d43b100-c4ce-4f82-8cfe-f2fd402bde59", "title": "Former bikie turned boxer survives shooting ambush", "date": "2024-05-24 04:00", "url": "https://www.standard.net.au/story/8640040/former-bikie-turned-boxer-survives-shooting-ambush/", "message": "It is the second shooting attempt on the former bikie, who was ambushed in his Mercedes as he was leaving a funeral in Fawkner in June 2022.", "location": "Fawkner", "classification": "security", "score": 0.9304102056362037, "event_breakdown": "Security Events:\n\n1. Shooting attempt on former bikie leaving funeral in Fawkner in June 2022.\n2. Ambush of former bikie in his Mercedes as he was leaving a funeral in Fawkner in June 2022."}, {"id": "a1257901-055d-4d86-9934-666bb564d4cf", "title": "Despite Blood On Its Hands , The Pentagon Once Again Fails To Make Amends", "date": "2024-05-24 07:30", "url": "https://countercurrents.org/2024/05/despite-blood-on-its-hands-the-pentagon-once-again-fails-to-make-amends/", "message": "Moral Imperatives“The Department recognizes that our efforts to mitigate and respond to civilian harm respond to both strategic and moral imperatives,” reads the Pentagon’s new 2022 civilian casualty report.\nI asked Lisa Lawrence, the Pentagon spokesperson who handles civilian harm issues, why the 2023 report was late and when to expect it.\nThis year-long silence stands in stark contrast to the Defense Department’s trumpeting of new policies and initiatives for responding to civilian harm and making amends.\nIn 2022, the Pentagon issued a 36-page Civilian Harm Mitigation and Response Action Plan, written at the direction of Secretary of Defense Lloyd Austin.\nBut despite $15 million allocated by Congress since 2020 to provide just such payments and despite members of Congress repeatedly calling on the Pentagon to make amends for civilian harm, it has announced just one such payment in the years since.", "location": "The focus of this event appears to be at the Pentagon, which is a building in Arlington County, Virginia, across the", "classification": "security", "score": 0.4778613221814318, "event_breakdown": "Security Events:\n\n1. Pentagon's 2022 civilian casualty report was issued.\n2. The Department of Defense announced new policies and initiatives for responding to civilian harm and making amends.\n3. $15 million was allocated by Congress since 2020 to provide just such payments and members of Congress repeatedly called on the Pentagon to make amends for civilian harm.\n4. The Pentagon announced a payment for civilian harm in the years since."}, {"id": "cb8dae11-f086-42e4-b45e-c22f58343f56", "title": "IDF Assassinates Hezbollah Chief Drone Maker , Hits Drone Production Facilities Deep Inside Lebanon | The Jewish Press - JewishPress . com | David Israel | 16 Iyyar 5784 – Friday , May 24 , 2024", "date": "2024-05-24 10:15", "url": "https://www.jewishpress.com/news/middle-east/hezbollah/idf-assassinates-hezbollahs-chief-drone-maker-hits-drone-production-facilities-deep-inside-lebanon/2024/05/24/", "message": "As it turned out, that site was one of several manufacturing facilities dedicated to producing new, more effective weapons – the Iranian-designed drones.\nAdvertisementOn Thursday, the IDF confirmed reports about the assassination of the man in charge of these production sites, and there are reports of bombing missions deep inside Lebanese territory to eliminate the sites.\nJihad Mughniyah was a prominent member of Hezbollah and the son of Imad Mughniyah, Hassan Nasrallah’s deputy and the terrorist group’s chief of staff.\nAccording to the IDF, these attacks caused severe damage to the production project of the precision UAVs and arrays related to the project.\nAmong the targets were warehouses, production systems of the precision missiles, outposts connected to the project, and R&D locations.", "location": "The main event is the assassination of Jihad Mughniyah, which took place at one of several manufacturing facilities dedicated to producing new", "classification": "security", "score": 0.8497017845372788, "event_breakdown": "Events:\n1. Assassination of Jihad Mughniyah, head of Iranian-designed drone production site.\n2. Bombing of Iranian-designed drone production sites deep inside Lebanese territory."}, {"id": "59fbe198-db66-4b57-8963-506356e695bb", "title": "Russia smashes train tracks in a battered Ukrainian border region where children are being evacuated – Winnipeg Free Press", "date": "2024-05-24 12:15", "url": "https://www.winnipegfreepress.com/business/2024/05/24/russia-smashes-train-tracks-in-a-battered-ukrainian-border-region-where-children-are-being-evacuated", "message": "The overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nA rescuer recovers a lifeless body from under the rubble after a Russian missile hit a large printing house in Kharkiv, Ukraine, Thursday, May 23, 2024.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6739298224850815, "event_breakdown": "From Information Gathering\n1. Russia conducted overnight strikes on railway infrastructure in Ukraine\n2. The Russian troops are trying to create an overwatch/buffer zone/enclave in the Kharkiv region"}, {"id": "be66a5a1-26b5-4e38-84a0-411e63b59be4", "title": "Russian attack on Kharkiv printing house destroys 50 , 000 books – photos", "date": "2024-05-24 12:00", "url": "https://www.yahoo.com/news/russian-attack-kharkiv-printing-house-082932833.html", "message": "50,000 books were burned in the Russian missile strike on the Factor-Druk printing house in the Osnovianskyi district of Kharkiv.\nThis printing house produced books for children, magazines, school diaries, newspapers, and much more.\nIn addition to Vivat books, Factor-Druk produced books for KSD, Ranok, Folio, Svichado, Zelenyi Pes and other publishers.\nOther attacks on Kharkiv printing housesThe printing house Hurov & K burned down on 20 March as a result of a Russian strike on the industrial zone of Kharkiv.\nEarlier, the Budynok Druku printing house was damaged in yet another Russian attack on Kharkiv.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.8925012106516352, "event_breakdown": "Events:\n- Russian missile strike on Factor-Druk printing house in Kharkiv, 50,000 books burned\n- Russian missile strike on Hurov & K printing house in Kharkiv, printing house burned down\n- Russian attack on Kharkiv, Budynok Druku printing house damaged"}, {"id": "c0cedbd2-b8ab-41b6-9ed4-d0423fa06deb", "title": "Russia smashes train tracks in a battered Ukrainian border region where children are being evacuated", "date": "2024-05-24 12:00", "url": "https://www.yahoo.com/news/russia-smashes-train-tracks-battered-113940145.html", "message": "Rescuers carry a body after a Russian missile hit a large printing house in Kharkiv, Ukraine, Thursday, May 23, 2024.\nThe overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.6739298224850815, "event_breakdown": "Security events from the text:\n\n1. Russian army launched an offensive in the Kharkiv region on May 10, 2024.\n2. At least 11,000 people have been evacuated by authorities from the Kharkiv region since May 10, 2024.\n3. Overnight Russian strike caused damage in Kharkiv, Ukraine.\n4. The strike damaged rolling stock and railway tracks.\n5. The strike also damaged several buildings.\n6. Russian President Vladimir Putin says the offensive is intended to create a \"buffer zone\" in the Kharkiv region."}, {"id": "6595443a-c47d-43c4-8075-1ae867a7e45d", "title": "Russia smashes train tracks in a battered Ukrainian border region", "date": "2024-05-24 13:00", "url": "https://abcnews.go.com/International/wireStory/russia-smashes-train-tracks-battered-ukrainian-border-region-110531194", "message": "The overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.\nThursday’s strike on Kharkiv using S-300 missiles hit a printing company, burning about 50,000 books, Zelenskyy said.", "location": "KHARKIV.", "classification": "security", "score": 0.520269193915714, "event_breakdown": "List of security events:\n- New Russian offensive launches in Kharkiv region.\n- Authorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10.\n- Russian President Vladimir Putin said the Kremlin's army was attempting to create a \"buffer zone\" in the Kharkiv region to prevent Ukrainian cross-border attacks."}, {"id": "278e6a73-18ea-4e39-9cc6-e2a3fe414a49", "title": "Russia smashes train tracks in a battered Ukrainian border region where children are being evacuated", "date": "2024-05-24 13:00", "url": "https://www.clickondetroit.com/business/2024/05/24/russia-smashes-train-tracks-in-a-battered-ukrainian-border-region-where-children-are-being-evacuated/", "message": "Rescuers carry a body after a Russian missile hit a large printing house in Kharkiv, Ukraine, Thursday, May 23, 2024.\nThe overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nRecommended VideosAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.", "location": "Kharkiv", "classification": "security", "score": 0.6548127191976794, "event_breakdown": ".\n-At least one person killed and three people injured in an overnight Russian missile strike on a large printing house in Kharkiv, Ukraine.\n-Overnight strike on rolling stock and railway tracks damaged buildings in the Kharkiv region, according to Ukraine's national railway operator Ukrzaliznytsia.\n-Authorities evacuated more than 11,000 people from the Kharkiv region since Russia launched a new offensive there on May 10, regional Gov. said.\n-Impacts of the new Russian offensive on the Ukrainian side will remain to be seen."}, {"id": "3bb0d1db-4491-4cc3-b4b8-697ba38e50a7", "title": "Who are the Houthis , the newest addition to Australia terrorist list ? ", "date": "2024-05-24 09:45", "url": "https://www.sbs.com.au/news/article/who-are-the-houthis-the-newest-addition-to-australias-terrorist-list/hjc8jsdjo", "message": "Key Points Ansar Allah, otherwise known as the Houthis, is the latest group to be listed a terrorist organisation in Australia.\nAnsar Allah is closely affiliated with Iran, whose officials have expressed support for the Houthis’ cause.\nThe move makes Ansar Allah the 30th group to be currently listed as a terrorist organisation under Australia’s Criminal Code, and follows the United States’ earlier decision to label it a Specially Designated Global Terrorist group in January.\nAnsar Allah is an Iran-aligned Islamist movement that has been fighting Yemen’s Sunni-majority government since 2004.\nAnsar Allah is closely affiliated with Iran, whose officials have expressed support for the Houthis’ cause.", "location": "Yemen", "classification": "security", "score": 0.5544883532982007, "event_breakdown": "Below is a partial list of security events related to the text:\n\n1. Yemen's Sunni-majority government has been fighting Ansar Allah (also known as the Houthis) since 2004.\n2. Ansar Allah is an Iran-aligned Islamist movement.\n3. Iran has expressed support for the Houthis' cause.\n4. Australia has listed Ansar Allah as a terrorist organisation under the Criminal Code, making it the 30th group to be listed.\n5. The United States had earlier labelled Ansar Allah a Specially Designated Global Terrorist group in January."}, {"id": "f82db261-7b46-4699-a577-d9a5fa6229df", "title": "US pressure could derail ICC arrest warrants for Israeli leaders", "date": "2024-05-24 11:30", "url": "https://www.aljazeera.com/news/2024/5/24/us-pressure-could-derail-icc-arrest-warrants-for-israeli-leaders", "message": "Court faces pressure after chief prosecutor announces he is seeking to arrest Israeli leaders for actions in Gaza.\nAbu Shaban was in a displacement camp in Rafah when she learned that an Israeli missile had struck her home.\nHe was there with another family that was displaced in our house,” Abu Shaban, 38, told Al Jazeera.\n“We believe that [ICC] arrest warrants can have a deterrent effect,” the source from Al Mezan Center told Al Jazeera.\nIf these efforts continue, they eventually will lead to something,” she told Al Jazeera.", "location": "GAZA", "classification": "security", "score": 0.9058532402592048, "event_breakdown": "- Al Mezan Center tells Al Jazeera that the ICC arrest warrants can have a deterrent effect\n- An Israeli missile struck the home of 38-year-old Abu Shaban while she was in a displacement camp in Rafah"}, {"id": "4f41f845-fac1-459c-83bc-509aaaac612f", "title": "After northern distraction , Russia steps up attacks on Ukraine east | Russia - Ukraine war News", "date": "2024-05-24 11:30", "url": "https://www.aljazeera.com/news/2024/5/24/after-northern-distraction-russia-steps-up-attacks-on-ukraines-east", "message": "Russia has intensified its attacks on the strategically important town of Chasiv Yar and other targets in Ukraine’s east, taking advantage of the fact that some Ukrainian units were diverted to fight its new incursion in the northern region of Kharkiv.\nBut so far Ukraine has managed its slender resources efficiently enough to thwart Russia at every turn.\nRussian forces unleashed a company-sized mechanised assault in Chasiv Yar on May 17 and 18, including two tanks and 21 infantry fighting vehicles.\nZelenskyy told Reuters that the Russian incursion in Kharkiv had been stabilised, whereas the real fight was in the east.\nBut military observers say defending Ukraine is impossible if Russia can marshal its forces on the other side of the border immune from strikes.", "location": "EASTERN UKRAINE", "classification": "security", "score": 0.6896331851274368, "event_breakdown": "Events:\n- First Russian assault Kharkiv\n- Russian Federation has increased attacks in Donetsk region"}, {"id": "fbcba3bc-eb26-4b2c-95bc-36091ca5f279", "title": "I couldnt bury my brother because of Sudan bombing", "date": "2024-05-24 11:15", "url": "https://news.yahoo.com/news/couldnt-bury-brother-because-sudan-174804820.html", "message": "\"I had to abandon my brother's body on my way to the cemetery,\" Mr Abdallah, 30, told the BBC.\nEl Fasher resident Ibrahim al-Tayeb al-Faki said his sister was killed in a military airstrike that had also destroyed his home.\n“There is no safe place in El Fasher right now,” he said.\nEl Fasher residents say that access to food and water has become increasingly difficult.\n\"Survival is incredibly challenging,\" 32-year-old lawyer Mahmoud Ahmed Adam, who has had to move repeatedly to escape the fighting, told the BBC.", "location": "EL FASHER", "classification": "security", "score": 0.49436592970707055, "event_breakdown": "Security events:\n\n- Airstrikes in El Fasher\n- Destruction of homes\n- Death of Ibrahim al-Tayeb al-Faki's sister\n- Easy access to food and water in El Fasher"}, {"id": "bde559fd-58dd-4c6a-9986-e6031fe270db", "title": "Israel has  surprising plan for Lebanon , Netanyahu says", "date": "2024-05-24 11:00", "url": "https://www.naharnet.com:443/stories/en/305434-israel-has-surprising-plans-for-lebanon-netanyahu-says", "message": "Israeli Prime Minister Benjamin Netanyahu said that Israel has \"surprising plans\" for Lebanon.\n\"We have eliminated hundreds of Hezbollah operatives, and the hand is still bent, even today,\" Netanyahu said Thursday.\n\"We have detailed, important, even surprising plans,\" he added, without elaborating.\nLebanon's Hezbollah, an ally of Palestinian militant group Hamas, has traded near daily cross-border fire with Israel since the October 7 attack on southern Israel.\nIsrael says 14 soldiers and 11 civilians have been killed on its side of the border.", "location": ")\nLebanon", "classification": "security", "score": 0.42184622163727375, "event_breakdown": "Hezbollah attack on Israel from Lebanon - fires rockets near Israel's southern border: October 7, 2021\nHezbollah fires rockets into Israel: November 2020"}, {"id": "e9161773-d26b-4fc2-bc4f-439043d4d645", "title": "T - 38 Flyover Highlights Whiteman Wreath Ceremony", "date": "2024-05-24 14:00", "url": "https://ksisradio.com/t-38-flyover-highlights-whiteman-wreath-ceremony/", "message": "A flyover by four T-38s from Whiteman Air Force Base highlighted the 36th Memorial Wreath Laying Ceremony last Saturday morning at Memorial Park Cemetery.\nThe event was sponsored by the Military Affairs Committee of the Sedalia Area Chamber of Commerce.\nWhiteman Air Force Base was later renamed for him.\nWhiteman made the decision to attend the Rolla School of Mines for two years.\nCol. Butler is responsible for the combat readiness of the Air Force's only B-2 base, including development and employment of the B-2's combat capability as part of Air Force Global Strike Command.", "location": "MAINE, MISSOURI", "classification": "security", "score": 0.5208157634265718, "event_breakdown": ".\n1. A flyover by four T-38s from Whiteman Air Force Base was held at the 36th Memorial Wreath Laying Ceremony last Saturday morning at Memorial Park Cemetery.\n2. Whiteman Air Force Base was later renamed for him.\n3. Whiteman made the decision to attend the Rolla School of Mines for two years.\n4. Col. Butler is responsible for the combat readiness of the Air Force's only B-2 base, including development and employment of the B-2's combat capability as part of Air Force Global Strike Command."}, {"id": "ba0b4279-e3e4-4d29-a710-a6c82b249d12", "title": "Zelenskyy Visits Kharkiv | Newsmax . com", "date": "2024-05-24 14:15", "url": "https://www.newsmax.com/world/globaltalk/ukraine-president-volodymyr-zelenskyy/2024/05/24/id/1166019/", "message": "President Volodymyr Zelenskyy visited Ukraine's northeastern city of Kharkiv on Friday as it faces intensified Russian air attacks amid an offensive push by Moscow's forces into the north of the surrounding region.\nRussia says it wants to set up a \"buffer\" zone in the region in what it calls a response to Kyiv's shelling of Russian border regions such as Belgorod.\nKharkiv, Ukraine's second largest city which lies some 30 km from the border with Russia, and the surrounding region have faced daily missile, drone and guided bomb strikes for months.\nMost of the energy infrastructure has been severely damaged in the city, which is still home to around 1.3 million people.\n\"The entire city and region of Kharkiv deserve our support, gratitude, and respect,\" Zelenskyy said.", "location": "Kharkiv", "classification": "security", "score": 0.4961399084788286, "event_breakdown": "- Kharkiv, Ukraine's second largest city is hit by intensified Russian air attacks.\n- The surrounding region of Kharkiv faces daily missile, drone and guided bomb attacks for months.\n- Russian forces pushing into the north of Kharkiv region are facing intensified Ukrainian resistance."}, {"id": "2ac3bfb4-cbc6-4f1b-ab43-32d4f09570ac", "title": "Armstrong Williams : Freedom of speech is our deliverance from terror", "date": "2024-05-24 11:15", "url": "https://www.baltimoresun.com/2024/05/24/armstrong-williams-freedom-of-speech-is-our-deliverance-from-terror-staff-commentary/", "message": "Dan Rodricks: With sentencing, the Marilyn Mosby drama is done.\nIt’s time to move on.\n| STAFF COMMENTARY", "location": "Baltimore, Maryland", "classification": "security", "score": 0.5457270528438759, "event_breakdown": "Security Events:\n\n1. Prosecution of Marilyn Mosby\n2. Sentencing of Marilyn Mosby"}, {"id": "dd660298-fec8-4b24-881f-bb4741eb2e96", "title": "Children in Gaza being  unequivocally failed  by united kingdom government , aid group says", "date": "2024-05-24 13:15", "url": "https://www.independent.co.uk/news/world/middle-east/gaza-war-children-rafah-israel-b2551006.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Civilians in Gaza have been “unequivocally failed” by the UK government’s inaction in the face of Israel’s bombing campaign in Gaza, aid organisation Save the Children has told The Independent.\nSave the Children’s senior adviser on conflict, Liz Bradshaw, told The Independent that there has been a “shameful failure by the UK government” when children in Gaza are facing “the most dangerous and dire situation for children anywhere in the world”.\nThe severity of trauma that children and young people in Gaza have been subjected to is a major concern for NGOs like Save the Children.\nWe hear a lot about the deep concern that they have, but frankly, their deep concern is meaningless to children in Gaza.", "location": "Gaza", "classification": "security", "score": 0.5190272582920459, "event_breakdown": "Civilians in Gaza have been unequivocally failed by the UK government's inaction in the face of Israel's bombing campaign in Gaza, aid organisation Save the Children has told The Independent."}, {"id": "8407a967-2567-4413-9e6a-5e7e1be58811", "title": "France Successfully Conducts Evaluation Launch Of ASMPA - R Nuclear Missile ( With Inert Warhead ) ", "date": "2024-05-24 13:45", "url": "https://theaviationist.com/2024/05/24/france-conducts-launch-of-asmpa-r/", "message": "France steps up its nuclear deterrence, in the ever changing European security landscape with test of ASMA-R supersonic nuclear-capable missile.\nAujourd’hui, l’@Armee_de_lair et les équipages des FAS ont réussi le premier tir d’évaluation des forces du missile ASMP-A rénové en coopération avec la @DGA.\nAt the heart of France’s maritime nuclear capability lie its four Le Triomphant-class submarines: Le Triomphant, Le Téméraire, Le Vigilant, and Le Terrible.\nForemost among these is the Air-Sol Moyenne Portée-Amélioré (ASMP-A) missile, which ensures France’s ability to project nuclear power across strategic distances.\nIn essence, France’s nuclear deterrence scheme is a meticulously orchestrated fusion of maritime and aerial capabilities, underpinned by cutting-edge technology and operational proficiency.", "location": "The main focus of the given event is France. Given that France is a country in Europe, the location provided", "classification": "security", "score": 0.4612824098721865, "event_breakdown": "France's testing of ASMA-R supersonic nuclear-capable missiles, as well as the country's submarine-launched nuclear arsenal, Le Triomphant-class submarines, and Air-Sol Moyenne Portée-Amélioré (ASMP-A) missiles, which ensure France's ability to project nuclear power."}, {"id": "fcadab6d-4d9a-4a3b-9700-7719fbc96833", "title": "Israeli drone strikes car in Tyre Hanaouay", "date": "2024-05-24 11:00", "url": "https://www.naharnet.com:443/stories/en/305438-israeli-drone-strikes-car-in-tyre-s-hanaouay", "message": "An Israeli drone struck Friday a parked car deep into south Lebanon in the village of Hanaouay in the Tyre District, north-west of Qana.\nHezbollah later announced targeting the surveillance equipment at the Israeli post of Bayyad Blida with the \"appropriate weapons,\" saying it managed to destroy the devices.\nHezbollah had targeted overnight an Israeli military post facing Yaroun, while Israeli artillery shelled the outskirts of Alma al-Shaab and Ramia.\nIsraeli Prime Minister Benjamin Netanyahu said Thursday that Israel has \"surprising plans\" for Lebanon, hours after an Israeli drone strike killed a Hezbollah fighter in his car in Nabatiyeh.\n\"We have detailed, important, even surprising plans,\" he added, without elaborating.", "location": "Qana", "classification": "security", "score": 0.8792763275878475, "event_breakdown": "Event 1: Israeli drone strike a parked car in village of Hanaouay, Tyre District, in south-east Lebanon.\n\nEvent 2: Hezbollah retaliated and targeted the surveillance equipment at Israeli post of Bayyad Blida, claiming to have destroyed it.\n\nEvent 3: Israeli strike targeted an Israeli military post overnight and Israeli tearritory shelled the outskirts of Alma al-Shaab and Ramia.\n\nEvent 4: An Israeli drone attacked a parking car in Nabatiyeh, killing a Hezbollah fighter."}, {"id": "472dbe8d-ec7f-4829-a665-e516bc92d776", "title": "Israel launches deadly Gaza strikes , says ready for new truce talks", "date": "2024-05-24 12:00", "url": "https://www.justiceinfo.net/en/132303-israel-launches-deadly-gaza-strikes-says-ready-for-new-truce-talks.html", "message": "Israel launched devastating air strikes on Gaza early Thursday while also saying it is ready to resume stalled talks on a truce and hostage release deal with Hamas to pause the war raging since October 7.\nThe Gaza Strip's civil defence agency said two pre-dawn air strikes had killed 26 people, including 15 children, in Gaza City alone.\nThere was no immediate comment from the Israeli military.\n- Bleak assessment -The previous round of truce talks, involving US, Egyptian and Qatari mediators, ended shortly after Israel launched its attack on Gaza's far-southern city of Rafah early this month.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.", "location": "Gaza City", "classification": "security", "score": 0.7834649497112457, "event_breakdown": "1. Israel launches devastating air strikes on Gaza \n2. Israel says it is ready to resume stalled talks on truce and hostage release deal with Hamas \n3. Militants took 252 hostages \n4. Terrorists recorded 124 of the imprisoned people are still being held in Gaza, 37 of them the Israel army says are now dead."}, {"id": "1c5e8d35-7154-4671-a578-5d5c9086dd5c", "title": "Ukraine - Russia war live : Ukrainian missile attack on Crimea kills two", "date": "2024-05-24 07:45", "url": "https://www.telegraph.co.uk/world-news/2024/05/24/ukraine-russia-war-latest-news6/", "message": "Ukrainian forces have “stopped” a Russian ground offensive from advancing further into northeastern Kharkiv, the military have said, and was now launching a counter-defence.\n“The Ukrainian Defense Forces have stopped Russian troops in the Kharkiv sector and are conducting counter-offensive actions,” the military said in a statement on social media.\nDespite Russian forces being halted in Kharkiv, Moscow’s troops were reinforcing its assault on other parts of the frontline.\nThe fresh Russian land assault has been raging across the northeastern Kharkiv region since May 10, when thousands of Russian forces stormed the border, making their biggest territorial advances in 18 months.\nFollow the latest updates below", "location": "Kharkiv", "classification": "security", "score": 0.5206888119917604, "event_breakdown": "- Russian troops launch a ground offensive towards the northeastern Ukrainian city of Kharkiv\n- Ukrainian forces stop the Russian ground offensive from advancing further in the northeastern sector of Kharkiv and are launching a counter-offensive"}, {"id": "16b6e30e-0772-45cd-9c17-964bbdce9f48", "title": "Israel recovers bodies of three hostages from of Hamas in Gaza including Shani Louk partner", "date": "2024-05-24 10:00", "url": "https://nypost.com/2024/05/24/world-news/israel-recovers-bodies-of-three-hostages-from-of-hamas-in-gaza-including-shani-louks-partner/", "message": "Their recovery comes less than a week after the army said it found the bodies of three other Israeli hostages killed on Oct. 7, including Louk.\nHe is seen here with girlfriend Shani Louk.\nInstagram / @shanukkk7 An Israeli army tank returns to a forward staging area inside the southern Israeli border near Gaza on May 22, 2024.\nJim Hollander/UPI/Shutterstock7 Orion Hernandez Radoux’s partner Shani Louk was also taken hostage and later killed by Hamas.\nInstagram / @shanukkk7 Shani Louk was pictured lying in the back of a truck with Hamas terrorists during the Oct. 7 attack.", "location": "The main location where the main event takes place is the southern Israeli border near Gaza.", "classification": "security", "score": 0.8721345229400311, "event_breakdown": "The security events in the text are as follows:\n\n1. Israeli soldiers were taken hostage by Hamas on Oct. 7.\n2. The bodies of three Israeli soldiers, including Louk, were found on Oct. 13.\n3. Louk’s partner, Orion Hernandez Radoux, was also taken hostage by Hamas.\n4. Shani Louk was pictured lying in the back of a truck with Hamas terrorists during the Oct. 7 attack."}, {"id": "8e0ab8c9-2d86-475e-92c7-e14b2670c38e", "title": "Bodies of 3 hostages recovered in Gaza , Israeli forces say", "date": "2024-05-24 11:30", "url": "https://saudigazette.com.sa/article/643072/World/Mena/Bodies-of-3-hostages-recovered-in-Gaza-Israeli-forces-say", "message": "LONDON — The bodies of three hostages taken by Hamas have been found in Jabalya, in northern Gaza, the Israeli military said on Friday.\nThe three victims were identified as Hanan Yablonka, Michel Nisenbaum, and Orion Hernandez, the Israel Defense Forces (IDF) said.\nTheir bodies were recovered by the IDF and the ISA, Israel’s domestic security agency, in a military operation in Jabalya overnight.\nIsraeli attacks in Gaza have since killed at least 35,800 Palestinians, according to the Ministry of Health there.\nMeanwhile, a group representing hostages' families said the recovery of the three bodies from northern Gaza on Thursday “provides important closure” for their loved ones.", "location": "GAZA STRIP", "classification": "security", "score": 0.9577626575062622, "event_breakdown": "* Hamas took three hostages in Jabalya, northern Gaza.\n  * The Israeli military said the hostages were found dead in Jabalya.\n  * The victims were identified as Hanan Yablonka, Michel Nisenbaum, and Orion Hernandez.\n  * The IDF and ISA recovered the victims’ bodies in a military operation in Jabalya.\n  * Israeli attacks in Gaza have killed at least 35,800 Palestinians.\n  * A group representing hostages’ families said the recovery of three bodies in northern Gaza provided closure for their loved ones."}, {"id": "054d3519-4d11-46e1-ac98-07131b928bcc", "title": "Israel strikes Gaza as world court ruling due", "date": "2024-05-24 11:00", "url": "https://www.digitaljournal.com/world/israel-strikes-gaza-as-world-court-ruling-due/article", "message": "They were all “murdered” during the October 7 attack that sparked the war and taken into Gaza, the army said.\nThe military earlier reported targeted raids in Jabalia and ongoing activity in central Gaza.\nAs the hostilities continued, the International Court of Justice is set to rule Friday on a plea to halt the Israeli military offensive in Gaza over accusations of “genocide”.\nIsrael’s retaliatory offensive has killed at least 35,800 people in Gaza, mostly women and children, according to the Hamas-run territory’s health ministry.\nIsrael has imposed a siege on Gaza that has deprived the territory’s 2.4 million people of most clean water, food, medicine and fuel.", "location": "GAZA STRIP", "classification": "security", "score": 0.8381536468136701, "event_breakdown": "Events:\nTargeted strikes in Jabalia\nOngoing activity in central Gaza\nRequest for halt of Israeli military offensive in Gaza"}, {"id": "ed6a49fd-afd6-4966-9156-7d2c33e2e108", "title": "Israel strikes Gaza as world court ruling due", "date": "2024-05-24 11:15", "url": "https://www.al-monitor.com/originals/2024/05/israel-strikes-gaza-world-court-ruling-due", "message": "May 24, 2024 — Gaza Strip (Palestinian Territories) (AFP)The Israeli military said the bodies of three hostages seized in the October 7 attack that sparked the Gaza war had been recovered from the Palestinian territory, where fighting raged on Friday.\nThe announcement of the discovery came ahead of a ruling by the UN's top court, the International Court of Justice, in a case accusing Israel of \"genocide\".\nIt follows the recovery last week of four bodies of hostages found in tunnels under Jabalia, including of Hernandez Radoux's girlfriend Shani Louk.\nOther facilities across Gaza are suffering severe shortages of medical supplies and fuel to power generators, according to UN and Palestinian officials.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the army says are dead.", "location": "GAZA STRIP", "classification": "security", "score": 0.8127578170324329, "event_breakdown": ".\n* October 7, 2024 - A group of armed men attacked an Israeli facility, killing eight workers and taking three hostages.\n*  May 10, 2024 - The Israeli military announced that the bodies of three hostages abducted in the October 7 attack had been recovered in the Gaza Strip, where fighting was still raging.\n* October 14, 2024 - Four bodies were found in tunnels in Gaza, including Shani Louk, the girlfriend of one of the abductees, Hernandez Radoux.\n* February 2025 - Militants captured 252 hostages, of whom 121 are still in captivity, according to the authorities."}, {"id": "0de93f13-a6aa-4bd4-b9c4-f83ec5d640c0", "title": "Israel strikes Gaza as world court ruling due", "date": "2024-05-24 10:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-strikes-gaza-as-world-court-ruling-due/articleshow/110389746.cms", "message": "Israeli forces struck the Gaza Strip on Friday, as the UN's top court was due to rule on a plea to halt the military offensive over accusations of \"genocide\".On the ground in Gaza, witnesses and correspondents reported overnight air and naval strikes on Gaza City and gunfire to its south, with several casualties reported in two separate raids on residential blocks in the city's north and centre.\nIsrael in early May launched an assault on Rafah, the last city in Gaza to be entered by its ground troops, defying global opposition and sending more than 800,000 people fleeing, according to UN figures.\n\"We're not smashing into Rafah; we're operating carefully and precisely,\" Israeli military spokesman Daniel Hagari said.In a statement Friday, the Israeli army said its \"troops are continuing operations against terror targets\" in the southern city, where they had \"destroyed weapon storage facilities\" and tunnel shafts.A local Palestinian source said military vehicles were advancing from eastern Rafah towards the city centre.Urban combat has flared again in northern areas of the Palestinian territory, which Israeli forces initially entered months ago.\n\"We hear nothing but the sound of explosions and gunfire,\" said Mahmud al-Sharif, 31, in the Jabalia refugee camp.On Friday, a local source reported helicopters firing at the camp and renewed artillery shelling in the area.The military reported \"targeted raids\" in the Jabalia area and ongoing \"activity\" in the central Gaza Strip.- ICJ ruling on ceasefire -Doctor Mohammad Saleh, the acting director of Al-Awda hospital -- one of only two hospitals still functioning in northern Gaza according to the UN -- said it had been under Israeli siege for five consecutive days.\nHamas denies the accusation.Witnesses said Israeli drones were hovering around the European Hospital near Khan Yunis, southern Gaza's largest city.Israel has imposed a siege on Gaza that has deprived the territory's 2.4 million people of most clean water, food, medicine and fuel.The sporadic arrival of aid by truck slowed further after Israeli forces closed the Palestinian side of the Rafah border crossing with Egypt.The war has triggered violence across the region, including regular cross-border fire between Israeli forces and Hezbollah militants in Lebanon.Early Friday Israel's military said a drone that \"approached northern Israel from the east\" was intercepted before entering Israeli territory, but a falling shrapnel caused a fire near the town of Safed.bur-ami/dv", "location": "Gaza", "classification": "security", "score": 0.947572651377704, "event_breakdown": "Here's the list:\nOvernight air and naval strikes on Gaza City, gunfire near Rafah, Israel’s assault on Rafah that has displaced 800,000 people according to UN figures, renewed artillery shelling near Jabalia refugee camp, siege on Al-Awda hospital by Israeli forces, drones seen hovering around European Hospital near Khan Yunis, warning to Israel from Lebanon about Hezbollah cross border fire, reports of drones shot down by Israel over Israel, strikes against Gaza Friday."}, {"id": "b0ba15c3-8a79-4b8c-b98a-8f330656b2bf", "title": "In reply : Woode - Smith misses the mark on Dr Soni , Israel - Palestine", "date": "2024-05-24 11:00", "url": "https://www.biznews.com/rational-perspective/2024/05/24/reply-woode-smith-dr-soni-israel-palestine", "message": "Neil Horne responds to Nicholas Woode-Smith’s article on Dr Aayesha Soni and Israel-Palestine.\nWoode-Smith does not deny the obvious – that Israel has attacked and rendered inoperable all the hospitals in Gaza, and that it has killed medical personnel and patients.\nCiting Eswatini, Lesotho and other landlocked countries, Woode-Smith notes “ these are not deemed prisons just because they share a controlled border.” He’s right.\nAgain, a reference to this explosion is not found in the Soni article to which his piece links.\nThis might be due to a lapse in the editing but makes the remarks difficult to appreciate in the context of a reply to Soni.", "location": "Gaza", "classification": "security", "score": 0.6780107563824613, "event_breakdown": "Security Events :\n\n- Israel attacked and rendered all the hospitals in Gaza inoperable\n- Israel has killed medical personnel and patients\n- Woode-Smith notes Eswatini, Lesotho are not deemed prisons just because they are landlocked\n- Woode-Smith notes a reference to an explosion of Israel attacking all the hospitals in Gaza is not found in Dr Aayesha Soni article"}, {"id": "3f58b9e9-1a01-4d34-a1c2-80a0b23530b6", "title": "Israel strikes Gaza as world court ruling due", "date": "2024-05-24 10:15", "url": "https://www.hurriyetdailynews.com/israel-strikes-gaza-as-world-court-ruling-due-193892", "message": "Israel strikes Gaza as world court ruling dueGAZA STRIPIsraeli forces struck the Gaza Strip on Friday, as the U.N.'s top court was due to rule on a plea to halt the military offensive over accusations of \"genocide\".\nUrban combat has flared again in northern areas of the Palestinian territory, which Israeli forces initially entered months ago.\nAs the hostilities continued, the International Court of Justice is set to rule Friday on a plea to halt the Israeli military offensive in Gaza over accusations of \"genocide\".\nIsrael has imposed a siege on Gaza that has deprived the territory's 2.4 million people of most clean water, food, medicine and fuel.\nThe war has triggered violence across the region, including regular cross-border fire between Israeli forces and Hezbollah militants in Lebanon.", "location": "GAZA STRIP", "classification": "security", "score": 0.8662705732566355, "event_breakdown": "Events:\n- Israeli forces struck a the Gaza Strip on Friday.\n- Urban combat has flared again in northern areas of the Gaza Strip.\n- The hostilities continued as the UN's top court was set to rule Friday on a plea to halt the Israeli military offensive in Gaza.\n- Israel has imposed a siege on Gaza that has deprived the territory of clean water, food, medicine and fuel.\n- The war has triggered violence across the region, including regular cross-border fire between Israel and Hezbollah militants in Lebanon."}, {"id": "33e27037-e1ac-4547-a00d-264a2588b1ca", "title": "Ukrainian President visits Kharkiv after deadly Russian attack", "date": "2024-05-24 14:00", "url": "https://www.yahoo.com/news/ukrainian-president-visits-kharkiv-deadly-125500286.html", "message": "Ukrainian President Volodymyr Zelenskyy visited Kharkiv a day after a significant deadly Russian attack to convene a meeting regarding the operational situation in the oblast and preparations for the heating season, as stated in his post on Telegram on May 24.\nRussian strikes on Kharkiv and oblast on May 23Read also: Russia's 'brutal attack' on Kharkiv only possible because Ukraine lacks proper air defenses - ZelenskyyRussia launched a devastating missile attack on Kharkiv and the cities of Zolochiv and Lyubotyn in Kharkiv Oblast, killing seven people and injuring several others.\nSeven people killed in Kharkiv were employees of a printing house, presumably Vivat.\nRead also:Kharkiv Mayor Ihor Terekhov reported that Russian forces targeted the city’s transport infrastructure and a municipal unit vital for the city's life support systems.\nRead the original article on The New Voice of Ukraine", "location": "Kharkiv", "classification": "security", "score": 0.79761963559088, "event_breakdown": "Security events in text:\nBombing of Kharkiv\nBombing of Zolofit\nBombing of Lyubotyn"}, {"id": "e7770642-aa2e-4139-b1d6-1414814cacf7", "title": "The US gave Ukraine glide bombs but they keep missing because Russia is so good at jamming them", "date": "2024-05-24 12:00", "url": "https://www.yahoo.com/news/us-gave-ukraine-glide-bombs-105043914.html", "message": "The US gave Ukraine glide bombs — but they keep missing because Russia is so good at jamming themThe US gave Ukraine glide bombs — but they keep missing because Russia is so good at jamming themUS-provided glide bombs are struggling against Russian electronic jamming in Ukraine.\nBut Russian electronic warfare has blunted the effectiveness of the US-supplied munitions.\nUS-provided glide bombs are struggling against sophisticated Russian electronic jamming in Ukraine, Reuters reported.\nBut their guidance systems are running into Russian jamming, causing many of the launches to miss their targets, three sources familiar with the matter told Reuters.\nIn 2022, marketing materials for the bomb said that its navigation system is \"supported by a highly jamming resistance GPS.\"", "location": "KYIV", "classification": "security", "score": 0.7469053320908791, "event_breakdown": "Security events in the text are as follows:\n1. Russia jamming US-supplied glide bombs in Ukraine.\n2. Russia providing sophisticated electronic jamming in Ukraine.\n3. US-supplied glide bombs struggling against Russian electronic warfare in Ukraine.\n4. Russian electronic warfare blunting the effectiveness of the US-supplied munitions.\n5. US-provided glide bombs missing targets in Ukraine.\n6. Russian jamming causing many of the launches to miss their targets, according to three sources.\n7. Russia jamming US-supplied glide bombs in Ukraine.\n8. Russia's GPS navigation systems supported by highly jamming-resistant GPS.\n9. US-supplied glide bombs encountering Russian jamming in Ukraine.\n10. US-provided glide bombs missing targets in Ukraine."}, {"id": "deb6051d-adb1-40e9-9c33-4439bc571ae3", "title": "The US gave Ukraine glide bombs but they keep missing because Russia is so good at jamming them", "date": "2024-05-24 12:00", "url": "https://www.yahoo.com/news/us-gave-ukraine-glide-bombs-105043311.html", "message": "The US gave Ukraine glide bombs — but they keep missing because Russia is so good at jamming themThe US gave Ukraine glide bombs — but they keep missing because Russia is so good at jamming themUS-provided glide bombs are struggling against Russian electronic jamming in Ukraine.\nBut Russian electronic warfare has blunted the effectiveness of the US-supplied munitions.\nUS-provided glide bombs are struggling against sophisticated Russian electronic jamming in Ukraine, Reuters reported.\nBut their guidance systems are running into Russian jamming, causing many of the launches to miss their targets, three sources familiar with the matter told Reuters.\nIn 2022, marketing materials for the bomb said that its navigation system is \"supported by a highly jamming resistance GPS.\"", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.7469053320908791, "event_breakdown": "* Russia's electronic warfare capabilities are proving effective against US-provided glide bombs in Ukraine\n* Russian jamming is causing many of the US-supplied glide bombs to miss their targets in Ukraine, according to three sources familiar with the matter"}, {"id": "a6d9eb87-52a9-46c6-b0e8-0496c801df3e", "title": "Pune : Chief of Army Staff Gen Manoj Pande Reviews 146th NDA Passing Out Parade", "date": "2024-05-24 11:15", "url": "https://thenorthlines.com/pune-chief-of-army-staff-gen-manoj-pande-reviews-146th-nda-passing-out-parade/", "message": "Pune (Maharashtra), May 24: The Chief of Army staff, General Manoj Pande reviewed the Passing out Parade (POP) of the 146th course – the Spring Term of 2024 – of the National Defence Academy (NDA), on Tuesday.\nAddressing the cadets, COAS General Pande praised their commitment to the noble profession of soldiering.\nGeneral Pande highlighted the rapidly changing nature of warfare, driven by technological advancements in space, cyber, and information domains.\nI wish to compliment the parade commander and cadets of the parade for their emasculate turnout & excellent drill.\nGeneral Pande gave special recognition to the female cadets, praising them for epitomizing “Nari Shakti” and highlighting the armed forces'“Female cadets of the parade truly epitomised Nari Shakti & our commitment towards an inclusive armed forces,” General Pande said.", "location": "Pune", "classification": "security", "score": 0.7581557935266156, "event_breakdown": ".\n1. Chief of the Army staff, General Manoj Pande reviewed the Passing out Parade (POP) of the 146th course - the Spring Term of 2024 - of the National Defence Academy (NDA)."}, {"id": "821af5ca-c8c6-46d2-97a2-b534f33e6b94", "title": "Russia Accuses Ukraine Of Direct Involvement In Deadly Concert Hall Attack", "date": "2024-05-24 08:45", "url": "https://www.ndtv.com/world-news/russia-accuses-ukraine-of-direct-involvement-in-deadly-concert-hall-attack-5734004", "message": "(File)Ukrainian military intelligence was directly involved in a deadly attack on a concert hall near Moscow in which over 140 people were killed, the head of Russia's Federal Security Service (FSB) Alexander Bortnikov said, TASS reported on Friday.\n\"The investigation is ongoing, but it is already safe to say that Ukrainian military intelligence is directly involved in this attack,\" the state news agency quoted Bortnikov as saying.\nIslamic State claimed responsibility for the concert hall massacre in March and U.S. officials said they had intelligence showing it was carried out by the network's Afghan branch, Islamic State Khorasan.\nBortnikov was cited by TASS as saying that Islamic State Khorasan had played a role in coordinating the attackers' actions and that Ukrainian military intelligence had also played a direct role.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "location": "Makka", "classification": "security", "score": 0.5870634800595319, "event_breakdown": "Events:\n- Concert hall attack near Moscow, 140 killed\n- Islamic State terrorist group claimed responsibility\n- Intelligence showing attack was perpetrated by Islamic State Khorasan's branch in Afghanistan."}, {"id": "d718601a-38ec-4c08-a9ee-86c4df4a29ce", "title": "Over 50 , 000 books destroyed and three publishers affected in Russian strike on Kharkiv printing house", "date": "2024-05-24 14:45", "url": "https://www.yahoo.com/news/over-50-000-books-destroyed-114439484.html", "message": "Over 50,000 books destroyed and three publishers affected in Russian strike on Kharkiv printing houseThe aftermath of the Russian attack on Kharkiv on 23 May.\nPhoto: Oleh Syniehubov, Head of the Kharkiv Oblast Military AdministrationMore than 50,000 books were destroyed and at least three publishers – Vivat, Family Leisure Club (KSD) and Ranok (Morning) – have been affected by a Russian attack on the Faktor-Druk printing house in Kharkiv on 23 May.\nSource: Ukrainian President Volodymyr Zelenskyy; Vivat publishing house; KSD and Ranok in comments for Ekonomichna PravdaDetails: During a massive missile strike on Kharkiv on 23 May, the Russians hit the Faktor-Druk printing house based there.\nThe Vivat publishing house and Vivat bookshops are also part of the group.\nIt doesn’t just print Vivat books, but books from nearly every Ukrainian publisher as well,\" Vivat said.", "location": "KHARKIV", "classification": "security", "score": 0.6098838837818794, "event_breakdown": "Security Events:\n- Russian attack on Kharkiv printing house on 23 May\n- More than 50,000 books destroyed\n- Three publishers affected: Vivat, Family Leisure Club (KSD) and Ranok (Morning)\n- Kharkiv Oblast Military Administration chief Oleh Syniehubov reported aftermath of attack"}, {"id": "c356d642-0dd9-42a1-a899-a6300a7130b7", "title": "31 Martyrs in a Single Israeli Strike - Voices from the Gaza Genocide", "date": "2024-05-24 21:30", "url": "https://www.palestinechronicle.com/31-martyrs-in-a-single-israeli-strike-voices-from-the-gaza-genocide/", "message": "Over the last eight months, Israeli forces have carried out relentless strikes throughout the war-torn Gaza Strip.\nOnly this month, scores of Palestinians were killed and wounded in Nuseirat, where Israeli strikes have wiped out entire families.\n31 Killed in One StrikeOn May 18, Israeli occupation forces bombed a residential area in the Nuseirat refugee camp.\nThe Israeli bombing resulted in the complete destruction of a residential area, damage to dozens of houses, and the killing of 31 Palestinians, including many children.\nHe was responsible for raising his sisters and children after his father was killed in the Israeli war on Gaza in 2012.", "location": "GAZA", "classification": "security", "score": 0.9952632716089845, "event_breakdown": "Security Events:\n- Israeli strikes in Nuseirat refugee camp, Gaza.\n- Bombing of residential area in Nuseirat refugee camp, Gaza.\n- Killing of 31 Palestinians, including many children.\n- Destruction of residential area in Nuseirat refugee camp, Gaza.\n- Damage to dozens of houses.\n- Killing of 31 Palestinians by a residential area in the Nuseirat refugee camp.\n- Bombing of residential area in Nuseirat refugee camp, Gaza.\n- Israeli occupation forces bombing a residential area in the Nuseirat refugee camp."}, {"id": "0727c93f-427b-49b5-9a9b-939973de21f9", "title": "Russian attack destroys train tracks in Ukraine", "date": "2024-05-24 18:00", "url": "https://www.ctvnews.ca/world/russia-smashes-train-tracks-in-a-battered-ukrainian-border-region-where-children-are-being-evacuated-1.6899498", "message": "The overnight strike on rolling stock and railway tracks also damaged buildings, according to Ukraine’s national railway operator Ukrzaliznytsia.\nAuthorities have evacuated more than 11,000 people from the Kharkiv region since Russia launched an offensive there on May 10, regional Gov.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nUkraine's ranks depletedThe new Russian offensive is stretching thin Ukraine’s depleted ranks, exhausted by more than two years of war.\nThursday’s strike on Kharkiv using S-300 missiles hit a printing company, burning about 50,000 books, Zelenskyy said.", "location": "Kharkiv", "classification": "security", "score": 0.520269193915714, "event_breakdown": "1. Russia launched an offensive in the Kharkiv region on May 10, 2022.\n2. More than 11,000 people were evacuated from the Kharkiv region, according to the regional Gov.\n3. On May 19, 2022, Russia targeted a printing company in Kharkiv, burning about 50,000 books.\n4. The Kremlin’s President Vladimir Putin announced a buffer zone in the Kharkiv region to prevent Ukrainian cross-border attacks."}, {"id": "1eb677f2-3bf7-4d55-b4b0-5238325a98b9", "title": "PYD / YPG terrorists attack political party HQ in northern Syria", "date": "2024-05-24 17:30", "url": "https://www.dailysabah.com/politics/war-on-terror/pydypg-terrorists-attack-political-party-hq-in-northern-syria", "message": "Elements of the PKK terrorist group’s Syrian offshoot YPG/PYD carried out an attack against the Syrian Kurdistan Democratic Party (SKDP) office in Syria’s Hassakeh and Qamishli on Friday, security sources said.\nThe SKDP previously announced that it would boycott the upcoming election, organized by the terrorist group, which targets all political parties that offer an alternative to their occupation in northern Syria.\nThe terrorist group is planning to organize elections in Syria, a move viewed as void.\nThe terrorist group conveniently contravened the resolution and launched a “local election” process in northeastern Syria.\nSince then, U.S. forces in Syria have trained thousands of YPG/PKK terrorists in their military bases in the region under the pretext of combating terrorism.", "location": "Qamishli", "classification": "security", "score": 0.8797638496535135, "event_breakdown": "Events:\n1- An attack by YPG/PYD (PKK terrorist group's Syrian offshoot) on Syrian Kurdistan Democratic Party (SKDP) office in Syria's Hassakeh and Qamishli on Friday.\n2- The SKDP previously announced that it would boycott the upcoming elections organized by the terrorist group targeting all political parties that offer an alternative to their occupation in northern Syria.\n3- The PKK terrorist group is planning a local election process in northeastern Syria.\n4- U.S. forces in Syria have trained thousands of YPG/PKK terrorists in their military bases under the pretext of combating terrorism.\n5- The move of the PKK terrorist group contravened the resolution and launched a \"local election\" process in northeastern Syria."}, {"id": "8fcaa929-4d0b-494d-8272-02f9986621a8", "title": "Missionary couple from US killed in Haiti gang violence", "date": "2024-05-24 19:45", "url": "https://www.kiro7.com/news/trending/missionary-couple-us-killed-haiti-gang-violence/D2EZB4XQO5DGXAOKJ2S6QOIR3E/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "There is a robot\nThe robot destroys a website\nThe country tries to go to a website or an application\nThe country is not the United States\nAccess to a specific website or application is intentionally limited or denied\nThe country is outside of the United States\nWhen a user initiates an attempt to access a website or application, they receive the error message \"Error 451: This website is unavailable in your location.\"\nAccess is limited to a specific country, indicating that the website or application is inaccessible to users outside the country."}, {"id": "30494428-e42c-45e4-a860-5130f44f0e4e", "title": "Missionary couple from US killed in Haiti gang violence", "date": "2024-05-24 19:15", "url": "https://www.wsbradio.com/news/trending/missionary-couple-us-killed-haiti-gang-violence/D2EZB4XQO5DGXAOKJ2S6QOIR3E/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "USA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "451 Error Code\nAccess Denied\nWebsite is Unavailable\nGeographic Restriction"}, {"id": "77bafed5-ec40-4293-b484-a409ba1433e2", "title": "Ukraine Kharkiv region facing another onslaught as Russia attempts to  set conditions for a larger offensive  - 25 - May - 2024", "date": "2024-05-24 20:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399057", "message": "As emergency workers arrived at the scene of yet another Russian air strike in Ukraine's Kharkiv this week, charred pages littered the rubble — thousands of burned books.\nThe building, Vivat publishing house, was one of Ukraine's largest printing presses, printing both translated international bestsellers and Ukrainian authors.\nNow it has become the latest casualty in a series of attacks on Kharkiv, Ukraine's second largest city.\nAccording to authorities, Russia launched about 15 missiles at the city and the nearby town of Liubotyn.\nThe Institute for the Study of War has said the fresh attacks on Kharkiv are likely meant to \"set conditions for a larger offensive effort ... at a later date\".", "location": "Kharkiv", "classification": "security", "score": 0.4498950463107153, "event_breakdown": ".\nRussian air strike in Kharkiv, Ukraine"}, {"id": "058e0624-92c2-4bf5-b3c1-f260a856f5b3", "title": "IDF kills two senior Hamas officials in Gaza Strip operations", "date": "2024-05-24 17:30", "url": "https://www.jpost.com/israel-hamas-war/article-802571", "message": "The IDF killed the deputy commander of Hamas's National Security in the Gaza Strip in a continued effort to specifically target additional senior terrorists, the IDF reported on Friday.\nIn an operation led by Division 99, the IDF Intelligence Unit, and the Shin Bet, Air Force fighter jets attacked on Thursday in the center of the Gaza Strip and killed the terrorist Tziad al-Din al-Sharfa, the deputy commander of National Security in the Gaza Strip.\nIn his role, he was responsible for managing the mechanism that secures the borders of the Gaza Strip.\nRoadblocks set up by Hamas on evacuation routes designed by the IDF in Gaza.\n(credit: IDF SPOKESPERSON'S UNIT)Another Hamas senior member killedAdditionally, earlier this week, the terrorist Yusuf al-Shobaki was attacked and killed in the city of Gaza.", "location": "Gaza Strip", "classification": "security", "score": 0.982372182644816, "event_breakdown": "Events:\n1. IDF operation led by Division 99, IDF Intelligence Unit, and Shin Bet targeted terrorists in the Gaza Strip.\n2. Hamas deputy commander Tziad al-Din al-Sharfa was killed in an operation by the air force in Gaza.\n3. Another Hamas member Yusuf al-Shobaki was attacked and killed in the city of Gaza."}, {"id": "385d4a5b-0955-42dc-bc35-45a6ff5f147b", "title": "Man sentenced to 25 years for teaching bomb - making to person targeting authorities", "date": "2024-05-24 19:15", "url": "https://www.wfmz.com/news/man-sentenced-to-25-years-for-teaching-bomb-making-to-person-targeting-authorities/article_a3f9a686-eac7-5905-a05b-5d7b1cd11a0d.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission.", "location": ")\nNULL", "classification": "security", "score": 0.6245355648029417, "event_breakdown": "According to the provided text, there is only one security event listed:\n\nUnauthorized broadcast or rebroadcast of copyrighted material without permission (Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission)."}, {"id": "a17bc6d0-5bd6-4fd9-ba22-bb1f58a2a711", "title": "High casualties for Russians in Vovchansk street battles , reveals Ukrainian Army Commander Syrskyi", "date": "2024-05-24 17:15", "url": "https://www.yahoo.com/news/high-casualties-russians-vovchansk-street-155100907.html", "message": "Following initial minor successes in Kharkiv Oblast, Russian troops are now completely bogged down in street battles for Vovchansk and have suffered very high losses among their assault units, Commander-in-Chief Oleksandr Syrskyi said on May 23.\nОлександр Сирський/FacebookRead also: Ukrainian military reveals devastation in Vovchansk, Kharkiv OblastThe Russians also suffered significant losses near Lyptsi in Kharkiv Oblast, and have now switched to active defense, and are conducting mining and fire attacks on Ukrainian troops' positions.\nSeveral villages in northern Kharkiv Oblast came under Russian occupation, monitoring groups reported.\nUkrainian forces were able to stabilize the situation in Vovchansk, Khortytsia Operational-Strategic Troop Grouping spokesperson, Nazar Voloshyn, said, adding that the Russian troops continue attempts to break through Ukrainian defenses near Lyptsi, Vovchansk, and Starytsia.\nAccording to the U.S.-based Institute for the Study of War, as of May 23, Ukraine had recaptured some ground in Vovchansk.", "location": "Vovchansk", "classification": "security", "score": 0.7529623293972253, "event_breakdown": "* Russian troops are completely bogged down in street battles for Vovchansk in Kharkiv Oblast, Ukraine.\n* The Russians also suffered significant losses near Lyptsi in Kharkiv.\n* Several villages in northern Kharkiv Oblast came under Russian occupation.\n* Ukrainian forces have been able to stabilize the situation in Vovchansk, despite Russian attempts to break through Ukrainian defenses."}, {"id": "870eac61-674f-4ad0-9137-8965f1c36769", "title": "Bearing witness to the horrors of this war means remembering the pain on both sides", "date": "2024-05-24 17:30", "url": "https://religionnews.com/2024/05/24/bearing-witness-to-the-horrors-of-this-war-still-begins-with-the-facts-of-oct-7/", "message": "A resident of the kibbutz K’far Aza looks at destroyed houses near the Gaza Strip, in southern Israel, Nov. 13, 2023.\nThe kibbutz was attacked during the Hamas cross-border attack on Oct. 7, killing and capturing members of its community.\nWith me, I brought members from my Manhattan synagogue, to bear witness to the horrors of Hamas’ attack on Israel and to learn more about the ongoing war.\nAs this morbid tour continued, with the sounds of war nearby, I had a disturbing realization: I actually found them comforting.\nI hope to one day walk along these paths again without the sounds of war in the distance.", "location": "GAZA STRIP", "classification": "security", "score": 0.9710856695965516, "event_breakdown": "Events:\n* Oct. 7, 2023\n  * Kibbutz Kfar Aza attacked during Hamas cross-border attack.\n* Tour of kibbutz attack site and presentation of \"destroyed houses.\"\n* Witnessing the horrors of the Hamas cross-border attack.\n* Visiting the southern Israel kibbutz, specifically Kfar Aza.\n* Nov. 13, 2023\n  * Another look at the destroyed houses near the Gaza Strip\n  * A resident of the kibbutz looking at the destruction.\n* Up to 2023\n  * Ongoing war that was started by Hamas.\n    * bringing membmer from Manhattan synagogue.\n    * Witness the ordinary horrors of Hamas' attack on Israel\n    * Presenting the ongoing war.\n* A tour bringing a sense of comfort and hope to the visitors, while they should be sad or terrified."}, {"id": "8497561c-016a-4f82-a4b8-7b011b22545e", "title": "Russian jamming leaves some high - tech U . S . weapons ineffective in Ukraine", "date": "2024-05-24 21:30", "url": "https://www.sunjournal.com/2024/05/24/russian-jamming-leaves-some-high-tech-u-s-weapons-ineffective-in-ukraine/", "message": "“I’m not saying no one was worried about it before, but now they’re starting to worry,” one senior Ukrainian military official said.\nKyiv still considers its HIMARS rockets effective, but Russian jamming can cause them to miss a target by 50 feet or more.\nRussian jamming signals are sent up from the ground and form a cone-shaped area.\nIts smaller surface area makes it more difficult for Russian systems to detect and intercept, the documents said.\nThe Ukrainian officials said they expect that weapons effective on the battlefield now will similarly slump within a year.", "location": "Kyiv", "classification": "security", "score": 0.45612796409789336, "event_breakdown": "I’ve extracted the events from the text:\nEvent 1: Senior Ukrainian military official says that people are worrying about the effectiveness and counteraction of Russian jamming.\nEvent 2: Kyiv still views the effectiveness of HIMARS rockets as effective, but Russian jamming can result in a miss by 50 feet or more.\nEvent 3: Russian jamming signals create a cone-shaped area that makes it harder for Russian systems to detect and intercept.\nEvent 4: The small surface area of the jamming signal makes detection by Russian systems harder."}, {"id": "aa0697a0-77a7-4436-84ce-0bb9f6a31861", "title": "T - 38 Flyover Highlights Whiteman Wreath Ceremony", "date": "2024-05-24 15:45", "url": "https://kxkx.com/ixp/468/p/t-38-flyover-highlights-whiteman-wreath-ceremony/", "message": "A flyover by four T-38s from Whiteman Air Force Base highlighted the 36th Memorial Wreath Laying Ceremony last Saturday morning at Memorial Park Cemetery.\nThe event was sponsored by the Military Affairs Committee of the Sedalia Area Chamber of Commerce.\nWhiteman Air Force Base was later renamed for him.\nWhiteman made the decision to attend the Rolla School of Mines for two years.\nCol. Butler is responsible for the combat readiness of the Air Force's only B-2 base, including development and employment of the B-2's combat capability as part of Air Force Global Strike Command.", "location": "Whiteman Air Force Base", "classification": "security", "score": 0.5208157634265718, "event_breakdown": "Security Events:\n\n* Memorial Wreath Laying Ceremony\n* Four T-38 flyover at Memorial Park Cemetery\n* Whiteman Air Force Base\n* Sedalia Area Chamber of Commerce\n* Rolla School of Mines\n* Air Force Global Strike Command\n* Only one B-2 base"}, {"id": "65ec707a-3995-4dda-9572-9e5b7425d2b9", "title": "Zelenskyy visits Kharkiv in show of support for city pounded by Russian strikes", "date": "2024-05-24 19:00", "url": "https://www.stripes.com/theaters/europe/2024-05-24/zelenskyy-visits-kharkiv-russian-strikes-13964236.html", "message": "Ukraine’s President Volodymyr Zelenskyy attends a briefing in Kyiv, Ukraine, on April 29, 2024.\n(Thomas Peter/Reuters)President Volodymyr Zelenskyy visited Ukraine’s northeastern city of Kharkiv on Friday as it faces intensified Russian air attacks amid an offensive push by Moscow’s forces into the north of the surrounding region.\nRussia says it wants to set up a “buffer” zone in the region in what it calls a response to Kyiv’s shelling of Russian border regions such as Belgorod.\nKharkiv, Ukraine’s second largest city which lies some 30 km from the border with Russia, and the surrounding region have faced daily missile, drone and guided bomb strikes for months.\n“The entire city and region of Kharkiv deserve our support, gratitude, and respect,” Zelenskyy said.", "location": "Kharkiv", "classification": "security", "score": 0.5760390091336743, "event_breakdown": "- President Volodymyr Zelenskyy visits the northeastern city of Kharkiv, Ukraine on Friday.\n- Kharkiv is facing intensified Russian airstrikes amidst an offensive push by Moscow’s forces into its region.\n- Russia says they want to create a “buffer zone” in the region."}, {"id": "366c8f5d-6875-4335-8177-bb5df7feacd7", "title": "Israel eliminates deputy commander of Hamas national forces in Gaza strip", "date": "2024-05-24 18:00", "url": "http://www.israelnationalnews.com/news/390504", "message": "Yesterday (Thursday), IAF fighter jets directed by the IDF and ISA struck and eliminated in central Gaza the terrorist Deya Aldin Alsharafa, deputy commander of Hamas' national security forces in the Gaza Strip.\nAlsharafa was responsible for overseeing the forces that secured the Gaza Strip's borders.\nDuring the war, these forces prevented the civilian population from evacuating from combat zones.\nIn addition, the Hamas terrorist Yusuf Alshubaki was eliminated this week in Gaza City.\nHe served in the industrial equipment department on Hamas’ Staff and was responsible for the operation and advancement of Hamas' weapons production.", "location": "GAZA CITY", "classification": "security", "score": 0.9719018287076018, "event_breakdown": "Event 1: IAF fighter jets directed by the IDF and ISA eliminated Deya Aldin Alsharafa, deputy commander of Hamas' national security forces in the Gaza Strip. \nEvent 2: Yusuf Alshubaki, who served as an industrial equipment department on Hamas' Staff, was eliminated in Gaza City.\nEvent 3: Alsharafa was overseeing the forces that secured the Gaza Strip's borders. \nEvent 4: During the war, the Hamas terrorist Yusuf Alshubaki prevented the civilian population from evacuating from combat zones."}, {"id": "ef413264-3d9a-4ecb-84dc-351222744262", "title": "WW2 forgotten heroes : The brave exploits of black and Asian soldiers have been overlooked , says Idris Elba . His new show aims to redress that", "date": "2024-05-24 21:30", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13442993/WW2s-forgotten-heroes-brave-exploits-black-Asian-soldiers-overlooked-says-Idris-Elba-new-aims-redress-that.html", "message": "An assistant surgeon in India who had been working as a medic with the British Army during World War II, he and two fellow PoWs jumped from the train under cover of nightfall.\nThis anomaly is addressed in Erased: WWII's Heroes Of Colour – a documentary highlighting these overlooked stories.\nLuther star Idris Elba, whose grandad was a World War II veteran, narrates, saying, 'We'll restore these unsung heroes to their rightful place.'\nTheir efforts during the Battle of the Bulge, the bloodiest US battle of the war, proved pivotal to Europe's liberation from the Nazis.\nOf the countless stories of World War II heroes recounted over the decades, those featured in the documentary have largely gone unheard.", "location": "the location is Europe.", "classification": "security", "score": 0.5144083451865256, "event_breakdown": "Event 1: An assistant surgeon in India, who worked as a medic with the British Army in World War II, jumped from a train with two fellow PoWs under cover of nightfall.\nEvent 2: The documentary Erased: WWII's Heroes of Colour addresses the anomaly of overlooked stories of heroes of colour during World War II.\nEvent 3: British actor Idris Elba, whose grandfather was a World War II veteran, narrates the documentary, which aims to restore unsung heroes of colour to their rightful place.\nEvent 4: The efforts of the trio during the Battle of the Bulge, the bloodiest US battle of the war, proved pivotal to Europe's liberation from the Nazis."}, {"id": "3bed7855-1de4-422b-a5b2-d6bc185600e6", "title": "Man sentenced to 25 years for teaching bomb - making to person targeting authorities", "date": "2024-05-24 19:00", "url": "https://www.krmg.com/news/national/man-sentenced-25/ZEAOPQQFB3GRK3CJBBYIWHFQ6Q/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The United States", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "From the provided text, there are four security events listed:\n\n1. Attempt to access a website from a location outside the United States.\n2. Unable to grant access to the website.\n3. Error 451 displayed.\n4. Access to website is declined."}, {"id": "5a58c8bb-87a5-4c25-96e6-fd1db439feb8", "title": "Bodies of three hostages discovered as fighting continues in Rafah", "date": "2024-05-24 21:30", "url": "https://www.irishtimes.com/world/middle-east/2024/05/24/bodies-of-three-hostages-discovered-as-fighting-continues-in-rafah/", "message": "Photograph: Amir Levy/Getty ImagesThe Israel Defence Forces announced on Friday that they had discovered three more bodies of hostages and brought them back to Israel for burial.\nThe army said the bodies were retrieved in Jabalia, north of Gaza city, after precise information was obtained during the interrogation of Palestinians arrested in Gaza.\nThe development came a week after the bodies of four other hostages were discovered, also in Jabalia.\nIsrael believes Hamas is holding hostages in Rafah, where four Hamas battalions are said to have remained on the eve of the Israeli assault on the city on May 7th.\nIsrael says 1,200 people were killed and 253 hostages seized in the surprise Hamas attack on October 7th.", "location": "GAZA CITY", "classification": "security", "score": 0.9446188203872179, "event_breakdown": "Security events:\n1. Hostages seized in the surprise Hamas attack on October 7th.\n2. Hostages believed held by Hamas in Rafah, where four Hamas battalions are said to have remained on the eve of the Israeli assault on the city on May 7th.\n3. Bodies of hostages discovered in the city of Jabalia.\n4. The Israel Defence Forces (IDF) announced on Friday that three more bodies of hostages were discovered in the city of Jabalia.\n5. The IDF retrieved the bodies in Jabalia after precise information was obtained during the interrogation of Palestinians arrested in Gaza.\n6. Israel believes Hamas is holding more hostages in Rafah.\n7. Troops retrieved three more bodies of hostage in the city of Jabalia."}, {"id": "ff3a896f-d8e6-4b1c-93fc-dc5d0f262966", "title": "International Court of Justice orders Israel to halt Rafah attack , with situation in ... ", "date": "2024-05-24 17:30", "url": "https://www.lbc.co.uk/news/international-court-of-justice-orders-israel-to-halt-rafah-attack/", "message": "International Court of Justice orders Israel to halt Rafah attack, with situation in southern Gaza city 'disastrous'Israel has been ordered to stop its assault on Rafah.\nPicture: AlamyBy Kit HerenThe International Court of Justice has ordered Israel to stop its offensive on the southern Gaza city of Rafah and withdraw its troops.\nThe court also ordered Israel to open the Rafah crossing for emergency aid, and to report back on its progress in a month.\nIDF spokesperson Daniel Hagari said on Thursday: \"Hamas is in Rafah, Hamas has been holding our hostages in Rafah, which is why our forces are manoeuvering in Rafah.\nPresident Nawaf Salam (M) during a ruling by the International Court of Justice (ICJ) on the situation in Rafah.", "location": "RAMATHI (the Gaza Strip)", "classification": "security", "score": 0.5177575145414385, "event_breakdown": "Security events:\n-Israel ordered to stop its assault on Rafah.\n-Court orders Israel to withdraw its troops.\n-Israel to open the Rafah crossing for emergency aid."}, {"id": "5e60b596-8de5-492c-807b-204908328ce6", "title": "Ukrainian Civilians Report Ongoing Russian Attacks in North - East", "date": "2024-05-24 18:30", "url": "https://www.miragenews.com/ukrainian-civilians-report-ongoing-russian-1242767/", "message": "The Monitoring Mission in Ukraine has interviewed 90 displaced civilians since the 10 May attack and the team has visited many sites that were struck.\nMany of the interviewees recalled not being able to get shelter, and witnessing their neighbours being killed and injured.\nIn one instance on 10 May, two medical workers, two ambulance drivers and a local official received injuries while assisting civilians in evacuating Buhaivka.\nSeparately, on 19 May, Russian armed forces attacked a recreation centre in the village of Cherkaska Lozova near Kharkiv city twice in 20 minutes.\nShe continued, \"In the third year of the Russian Federation's full-scale armed attack on Ukraine, with no end in sight, lives, homes, and futures continue to be destroyed.", "location": "Kharkiv city", "classification": "security", "score": 0.9314032002387047, "event_breakdown": "From the text, here are the security events:\n\n1. 10 May attack in Buhaivka, Ukraine: 2 medical workers, 2 ambulance drivers and a local official received injuries while assisting civilians in evacuating the area.\n2. 19 May attack on a recreation centre in Cherkaska Lozova, near Kharkiv city: Russian armed forces attacked the recreation centre twice in 20 minutes."}, {"id": "3806ced2-2980-4476-a338-53d9ddbaa1d5", "title": "Families of Uvalde school shooting victims sue Meta , Microsoft , gunmaker", "date": "2024-05-24 21:30", "url": "https://www.theglobeandmail.com/world/article-families-of-uvalde-school-shooting-victims-sue-meta-microsoft-gunmaker/", "message": "Meta, Microsoft and Daniel Defense did not immediately respond to requests for comment.\nThe Uvalde shooter played Call of Duty – which features, among other weapons, an assault-style rifle manufactured by Daniel Defense, according to the lawsuit – and visited Instagram obsessively, where Daniel Defense often advertised.\nThe second lawsuit, filed in Uvalde County District Court, accuses Daniel Defense of deliberately aiming its ads at adolescent boys in an effort to secure lifelong customers.\n“There is a direct line between the conduct of these companies and the Uvalde shooting,” Josh Koskoff, one of the families’ lawyers, said in a statement.\nThe families also reached a $2 million settlement with the city of Uvalde.", "location": "Uvalde, Texas", "classification": "security", "score": 0.5921792314579851, "event_breakdown": "1) Uvalde shooting\n2) Visit of Uvalde shooter to Instagram"}, {"id": "6d6974d1-b509-4168-981e-569946b1f706", "title": "Memorial Day : A bond shared over Marine service unites veterans in a mission to remember", "date": "2024-05-24 20:45", "url": "https://www.dailybreeze.com/2024/05/24/memorial-day-a-bond-shared-over-marine-service-unites-veterans-in-a-mission-to-remember/", "message": "(Photo by Mindy Schauer, Orange County Register/SCNG)Army and Marine veteran Billy Hall, 98, holds a photo of himself as a young boy.\n(Photo by Mindy Schauer, Orange County Register/SCNG)Army and Marine veteran Billy Hall, 98, served in WWII, the Korean War, and Vietnam.\n(Photo by Mindy Schauer, Orange County Register/SCNG)Army and Marine veteran Billy Hall, 98, holds a photo of himself as a young boy.\n(Photo by Mindy Schauer, Orange County Register/SCNG)Marine veteran Dwight Hanson, 55, center, and Marine and Army veteran Billy Hall, 98, left, are bonded by their military service.\n(Photo by Mindy Schauer, Orange County Register/SCNG)Veterans Billy Hall, left, and Chaarles Cram, both 98, take part in Armed Forces day in Newport Beach on Saturday, May 18, 2024.", "location": "Newport Beach", "classification": "security", "score": 0.641641794141877, "event_breakdown": "List of security events:\n1. Billy Hall, 98, served in WWII.\n2. Billy Hall, 98, served in the Korean War.\n3. Billy Hall, 98, served in the Vietnam War.\n4. Billy Hall, 98, was bonded with Dwight Hanson, 55, due to their military service.\n5. Billy Hall, 98, took part in a military event in Newport Beach.\n6. Charles Cram, 98, took part in a military event in Newport Beach."}, {"id": "f32ef770-2cb3-4ffe-a58a-efc9d5bd09f1", "title": "Airsoft grenades thrown at Israeli embassy in Belgium", "date": "2024-05-24 17:30", "url": "https://www.jpost.com/breaking-news/article-802569", "message": "An investigation has been launched after a man threw two airsoft grenades at the Israeli embassy in Brussels, Belgium on Friday morning, according to local media reports.\nWhile airsoft grenades do not explode like normal grenades, they use compressed air to expel pellets in all directions in a less deadly imitation of a real grenade, according to The Brussels Times.\nA kid holds an Israeli flag to protest about the conflict between Israel and Hamas, in Brussels, Belgium, October 9, 2023.\nIsrael's ambassador to Belgium posted on X \"Early this morning two airsoft grenades were launched at my Embassy.\nEarly this morning two airsoft grenades were launched at my Embassy.", "location": "BRUSSELS", "classification": "security", "score": 0.9055411470543548, "event_breakdown": ".\n* At the Israeli embassy in Brussels, Belgium on Friday morning, a man threw two airsoft grenades."}, {"id": "30455a9e-2567-45c4-89ea-bafaa983add1", "title": "Three US troops have non - combat injuries during Gaza pier operation", "date": "2024-05-24 08:15", "url": "https://dunyanews.tv/en/World/813835-Three-US-troops-have-non-combat-injuries-during-Gaza-pier-operation", "message": "Three US troops have non-combat injuries during Gaza pier operationWorld World Three US troops have non-combat injuries during Gaza pier operationThe injuries were the first during the latest US operation to bring humanitarian aid to PalestiniansFollow on Published On: Fri, 24 May 2024 10:01:55 PKTWASHINGTON (Reuters) – Three US troops suffered non-combat injuries in the effort to make a temporary pier off the coast of Gaza into a conduit for humanitarian aid, with one in critical condition at an Israeli hospital, US officials said on Thursday.\nThe injuries were the first for US forces during the latest operation to bring humanitarian aid to Palestinians.\nThe pier was announced by US President Joe Biden in March and involved the military assembling the floating structure off the coast.\nEstimated to cost $320 million for the first 90 days and involve about 1,000 US service members, it went into operation last week.\nUS lawmakers have voiced concern about the risks to positioning US troops off the coast of Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.44735737596250214, "event_breakdown": "Relevant Security Events mentioned from the text, in order of occurrence:\n1. Three US Troops suffering non-combat injuries during a Gaza humanitarian operation.\n2. Medics report from Israeli hospital about US Troops in critical condition.\n3. US Troops being involved in a humanitarian aid operation off coast of Gaza.\n4. The $320 million project estimates to extend the pier's operational time by 90 days.\n5. 1000 US Troops to be deployed for the project's assemblage of floating structure off the coast.\n6. Concerns voiced by US Lawmakers on risk to positioning Troops off the coast of Gaza."}, {"id": "82c76cb3-6ae8-4227-92f4-103165f21b2d", "title": "Congolese Civilians Caught in Crossfire In The Kivus", "date": "2024-05-24 18:30", "url": "https://allafrica.com/view/group/main/main/id/00089286.html", "message": "Congolese Civilians Caught in Crossfire In The KivusCivilians have been caught up in fighting between armed groups around Goma, the capital of North Kivu province, which has forced thousands to flee, according to Medecins Sans Frontieres.\nMSF said Goma has been surrounded by several front lines, \"with between 600,000 and 1 million people displaced being crammed alongside the city's two million residents\".\nThe aid group said civilians have \"no way out\" due to the concentration of armed men in and around the densely populated camps.\n\"The camps for displaced persons must be respected by all parties to the conflict and fighting in the vicinity must stop\" MSF said in a statement.", "location": "Goma", "classification": "security", "score": 0.4423675155104896, "event_breakdown": "Security Events:\n\n1. Armed groups surrounding Goma, the capital of North Kivu province.\n2. Displaced civilians trapped between front lines alongside the city's 2 million residents.\n3. Concentration of armed men in densely populated camps around Goma.\n4. Infighting among armed groups causing displacement of civilians.\n5. Armed groups breaching camps for displaced persons.\n6. MSF calls for immediate cessation of fighting near camps for displaced persons.\n7. MSF urges all parties to the conflict to respect camps for displaced persons.\n8. MSF calls on international community to protect civilians and enforce cessation of hostilities."}, {"id": "8461c16e-4d70-454a-b248-bf2bffe55de3", "title": "Israel Hamas Bodies of three more Israeli hostages recovered from Gaza", "date": "2024-05-24 14:30", "url": "https://www.9news.com.au/world/israel-hamas-gaza-bodies-of-three-more-hostages-recovered/0873d7eb-cbe0-4c0c-88df-28a554b834f7", "message": "The army said they were killed on the day of the attack at the Mefalsim intersection and their bodies were taken to Gaza.\n(Hostages Families Forum Headquarters via AP)The announcement comes less than a week after the army said it found the bodies of three other Israeli hostages killed on October 7.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of at least 39 more, while 17 bodies of hostages have been recovered.\nIsraeli Prime Minister Benjamin Netanyahu has vowed to both eliminate Hamas and bring all the hostages back, but he’s made little progress.\nThe group representing the families of the hostages said the bodies had been returned to their families for burial.", "location": "GAZA", "classification": "security", "score": 0.938411707107865, "event_breakdown": "* October 7: Three hostages were killed.\n* October 7: Twenty-one bodies were found.\n* October 7: Bodies were taken to Gaza.\n* October 7: Three hostages were killed."}, {"id": "d4e82088-2c6e-4bb0-9921-aec1e66b2fce", "title": "Police watchdog provide update on Wycombe crossbow shooting", "date": "2024-05-24 09:15", "url": "https://www.bucksfreepress.co.uk/news/24342717.police-watchdog-provide-update-wycombe-crossbow-shooting/", "message": "King was then gunned down by an armed officer moments after the incident and was taken to hospital with potentially life-changing injuries.\nFollowing the incident, the Independent Office for Police Conduct launched an investigation into the shooting.\nA mandatory referral was made from Thames Valley Police (TVP) after the armed man [King] was seriously injured.\nBlood on one of the front doors of the properties involved was still seen roughly three days after the incident, whilst the crossbow was retrieved by police.\nThe man who was stabbed and the officer who was shot were treated by paramedics at a nearby hospital, before being discharged later that evening.", "location": "URBANNA, VIRGINIA", "classification": "security", "score": 0.9873645253184989, "event_breakdown": ".\n- An armed man was shot and injured.\n- A police officer was shot and injured.\n- A man was stabbed and injured.\n- The man was taken to hospital.\n- The Independent Office for Police Conduct launched an investigation into the shooting.\n- Blood was seen outside of a house 3 days after the incident.\n- A crossbow was retrieved by police."}, {"id": "56c4fa31-7263-40f3-b89d-d2a758f98514", "title": "Zelenskyy : Ukraine Armed Forces control border areas of Kharkiv Oblast", "date": "2024-05-24 20:45", "url": "https://www.yahoo.com/news/zelenskyy-ukraines-armed-forces-control-182812601.html", "message": "President Volodymyr Zelenskyy said that Ukraine’s Defence Forces took combat control of the border areas of Kharkiv Oblast where Russian troops had entered earlier.\nSource: Zelenskyy’s video address on 24 MayQuote: \"I held a security meeting in Kharkiv with reports from the military [command], heads of security services, oblast and city authorities.\nNow our warriors have managed to take combat control of the border area, where the Russian occupiers have entered.\"\nBackground:Ukrainian President Volodymyr Zelenskyy held a meeting in Kharkiv on Friday, 24 May, regarding the operational situation in the oblast.\nOn 23 May, Russian forces delivered about 15 strikes with S-300/S-400 missiles on the civilian infrastructure of Kharkiv and Kharkiv Oblast, in particular hitting a printing house, on 23 May.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.5125275619446534, "event_breakdown": ".\n[May, 24th]\n- Zelenskyy had a meeting with the military [command], heads of security services, oblast and city authorities in Kharkiv\n- Soldiers successfully seized the Kharkiv border area where Russian troops had entered\n- 15 Russian airstrikes attacks on civilian infrastructure in Kharkiv\n[May, 23rd]"}, {"id": "206185a9-0e9f-4330-befa-2aa0d99b52dd", "title": "Missouri Lawmaker Daughter Among Americans Killed in Haiti", "date": "2024-05-24 19:45", "url": "https://www.bnnbloomberg.ca/missouri-lawmaker-s-daughter-among-americans-killed-in-haiti-1.2077296", "message": "(Bloomberg) -- A Missouri state representative’s daughter and son-in-law were among three people killed in an attack in Haiti, where armed gangs have tightened their grip on the country.\n“Please pray for my family we desperately need strength.”Baker’s daughter Natalie and her husband Davy Lloyd were ambushed as they left church on Thursday evening, according to Missions in Haiti Inc.\nThe couple, both full-time workers for the faith-based group, were attacked and killed by gunmen in three vehicles, the group said.\nDavid was the son of the Missions in Haiti founders, David and Alicia Lloyd.\nRead More: Biden Says He Kept US Troops Out of Haiti to Avoid MisperceptionAn email request for comment to Missions in Haiti and phone calls to Baker’s office in Missouri were not immediately returned.", "location": "Haiti.", "classification": "security", "score": 0.5322398921285882, "event_breakdown": ".\n- April 14, 2022 - Three people, including the daughter of a Missouri state representative, are killed in Haiti in an attack.- Undetermined - The couple were attacked and killed by gunmen.- Undetermined - David and Alicia Lloyd's son was killed.- Undetermined - The victims were attacked as they left a church by gunmen in three vehicles."}, {"id": "560209b1-7855-4953-8a78-f799f3b987ae", "title": "Top UN court demands Israel halt military operations in Rafah", "date": "2024-05-24 14:45", "url": "https://www.yahoo.com/news/top-un-court-demands-israel-133506784.html", "message": "Israel must immediately halt its military operations in the area of Rafah in the southern Gaza Strip, the United Nations top court ruled Friday.\nIsrael Prime Minister Benjamin Netanyahu has vowed to keep up the military operation to achieve “complete victory” over Hamas.\nThe court focused its ruling on the southern Gazan city of Rafah, which sits on the border with Egypt and is the epicenter of a nearly two-week military campaign being carried out by Israel.\nIsrael said its military operations are focused on rooting out the last four battalions of Hamas’s conventional army, and searching for hostages — alive or dead — being held in Rafah.\nStill, the court has limited ability to enforce its ruling and Israel is unlikely to adhere to the court’s order.", "location": "GAZA", "classification": "security", "score": 0.7367958219633008, "event_breakdown": "Events:\n1. Israel's military operations in the area of Rafah in the southern Gaza Strip\n2. Israel's military operation in Rafah aimed at rooting out the last four battalions of Hamas's conventional army\n3. Israel's military operation in Rafah to search for hostages, alive or dead, being held in Rafah\n4. Israel's military operation in the Gaza Strip aimed at achieving a \"complete victory\" over Hamas."}, {"id": "d4ca2df5-03ea-450b-ba87-ccf301c58192", "title": "Airsoft grenades thrown at Israeli embassy in Belgium", "date": "2024-05-24 19:15", "url": "https://live.jpost.com/breaking-news/article-802569", "message": "An investigation has been launched after a man threw two airsoft grenades at the Israeli embassy in Brussels, Belgium on Friday morning, according to local media reports.\nWhile airsoft grenades do not explode like normal grenades, they use compressed air to expel pellets in all directions in a less deadly imitation of a real grenade, according to The Brussels Times.\nA kid holds an Israeli flag to protest about the conflict between Israel and Hamas, in Brussels, Belgium, October 9, 2023.\nIsrael's ambassador to Belgium posted on X \"Early this morning two airsoft grenades were launched at my Embassy.\nEarly this morning two airsoft grenades were launched at my Embassy.", "location": "BRUSSELS", "classification": "security", "score": 0.9055411470543548, "event_breakdown": "- A man threw two airsoft grenades at the Israeli embassy in Brussels, Belgium."}, {"id": "8244bc1b-28b9-4524-8f37-7195821644a2", "title": "World ignoring risk of Sudan genocide - UN expert", "date": "2024-05-24 18:30", "url": "https://www.myjoyonline.com/world-ignoring-risk-of-sudan-genocide-un-expert/", "message": "She said many civilians were targeted based on their ethnicity in Sudan's besieged city of El Fasher, where fierce fighting has intensified in recent days.\nEl Fasher is the last major urban centre in the Darfur region that remains in the hands of Sudan's army.\n“There is no safe place in El Fasher right now,” he said.\nThe situation is unfolding to a \"Rwanda-like\" genocide of 1994, Ms Nderitu said, citing a UN analysis on the increasing risk factors.\nThe internet has been cut making access to the city difficult, as soldiers from the RSF group continue to besiege the city.", "location": "EL FASHER", "classification": "security", "score": 0.4585156087763519, "event_breakdown": "1. Sudan's soldiers have besieged El Fasher city, cutting off the internet.\n2. Sudan's army (Rapid Support Forces) targeted civilians based on their ethnicity.\n3. Fighting takes place in El Fasher (Sudan's major urban centre in Darfur region), where soldiers from the RSF group are besieging the city.\n4. The humanitarian coordinator for Darfur raised the alarm on the rapidly deteriorating security situation in El Fasher, comparing it to a \"Rwanda-like\" genocide."}, {"id": "96ef060d-16a3-4f50-9bb8-67c145750846", "title": "Daesh - K responsible for Moscow terrorist attack : Russia", "date": "2024-05-24 20:30", "url": "https://www.dailysabah.com/world/europe/daesh-k-responsible-for-moscow-terrorist-attack-russia", "message": "A top Russian security official said that the March 22 concert hall attack in Moscow was carried out by the Daesh terrorist group.\nThe terrorist attack, which targeted the Crocus City Hall, left 144 people dead and 360 others injured.\nDaesh Khorasan Province (Daesh-K) had initially claimed responsibility for the terrorist attack, but Moscow blamed Ukraine for it.\nIn early 2024, Daesh-K carried out an attack, killing 103 people and injuring dozens of others, during a commemoration ceremony for slain Gen. Qassem Soleimani on the anniversary of his killing, in Kerman, Iran.\nAccording to sources, terrorist Shamsidin Fariduni entered Türkiye on a flight on Feb. 20, 2024, and left on March 2, 2024.", "location": "Russia", "classification": "security", "score": 0.9841514158349374, "event_breakdown": "Security Events:\n\n1. Daesh claimed responsibility for the March 22, 2024 attack in Moscow, Russia.\n2. Daesh-K carried out a terrorist attack in 2024 in Kerman, Iran.\n3. Shamsidin Fariduni entered Türkiye from a flight on February 20, 2024.\n4. Shamsidin Fariduni left Türkiye on a flight on March 2, 2024."}, {"id": "763dbfe1-06bd-486a-80c7-4fc559cf6b52", "title": "Uvalde shooting victim parents sue Meta ,  Call of Duty  maker and weapons manufacturer", "date": "2024-05-24 23:30", "url": "https://www.yahoo.com/news/uvalde-shooting-victims-parents-sue-220249829.html", "message": "Days later, he carried out the second worst mass shooting in the country's history, where hundreds of law enforcement officers waited more than an hour before entering the classroom.\nCrosses dedicated to the 21 victims of the 2022 mass shooting at Robb Elementary are placed around the fountain at the City of Uvalde Town Square.\n“There is a direct line between the conduct of these companies and the Uvalde shooting,\" Josh Koskoff, attorney for the families, said in the press release.\nOn Wednesday, 19 families of the Uvalde victims announced a lawsuit against the Texas Department of Public Safety and 92 named troopers who responded to the scene of the shooting.\nThis article originally appeared on Austin American-Statesman: Parents of Uvalde shooting victims sue Meta, Activision, AR-15 maker", "location": "Uvalde, Texas", "classification": "security", "score": 0.6191769954526882, "event_breakdown": ".\n- 19 families of victims of the Uvalde shooting filed a lawsuit against several tech companies and an AR-15 manufacturer. - Lawsuit accuses these enterprises of contributing directly to the mass shooting by failing to stop the spread of violent content on their platform and selling the shooters weapons. - Lawsuit against DPS and 92 named troopers who did not respond."}, {"id": "a3f0fea6-6790-476e-9ea6-854e59c30ad9", "title": "Top UN court to rule on SA Gaza ceasefire bid", "date": "2024-05-24 10:00", "url": "https://www.ecr.co.za/news/news/top-un-court-rule-sa-gaza-ceasefire-bid/", "message": "In a highly-charged ruling in January, the court ordered Israel to do everything in its power to prevent genocidal acts in Gaza but stopped short of ordering a ceasefire.\n\"Although the present application was triggered by the unfolding situation in Rafah, Israel's genocidal onslaught across Gaza has intensified over the past few days, also warranting the attention of this Court,\" he said.\n- Bloodiest ever Gaza war -Israel pressed ahead with the assault on Rafah, the last city in Gaza to be entered by its ground troops, in defiance of global opposition, including from top ally the United States.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.\nIsrael's retaliatory offensive has killed at least 35,800 people in Gaza, mostly women and children, according to the Hamas-run territory's health ministry.", "location": "GAZA", "classification": "security", "score": 0.6210357575248725, "event_breakdown": "- Gaza war (Israel-Gaza conflict) (2014)\n- Israel-Gaza conflict (2014)\n- Siege of Rafah (2014)\n- Hostage-taking (2014)"}, {"id": "55169664-7a41-427c-88a4-474705c855c7", "title": "Dozens of terrorists eliminated in Jabaliya", "date": "2024-05-24 08:45", "url": "http://www.israelnationalnews.com/news/390482", "message": "The IDF continues operational activity in Jabaliya in the northern Gaza Strip.\nDuring targeted raids on terrorist infrastructure in the area, the troops eliminated dozens of terrorists and destroyed launch posts and underground tunnel shafts.\nIDF troops are continuing operations against terror targets in the area of Rafah.\nSimultaneously, a number of enemy spotters that were identified near IDF forces were eliminated in aerial and tank fire.\nIn another activity, a terrorist that fired mortars at the soldiers was eliminated.", "location": "GAZA", "classification": "security", "score": 0.9939308381048239, "event_breakdown": "- IDF continues operational activity in Jabaliya in the northern Gaza Strip\n- Dozens of terrorists were eliminated in targeted raids on terrorist infrastructure in the area.\n- Launch posts and underground tunnel shafts were destroyed during the raids.\n- IDF troops are continuing operations against terror targets in the area of Rafah.\n- Several enemy spotters were identified near IDF forces and were eliminated in aerial and tank fire.\n- A terrorist who fired mortars at soldiers was also eliminated."}, {"id": "9eaf5485-d163-480b-a328-b0aaef1cc788", "title": "Ukraine air defense woes cant be fixed by American aid", "date": "2024-05-24 19:15", "url": "https://www.yahoo.com/news/ukraine-air-defense-woes-t-185235715.html", "message": "Ukraine’s air defenses are succumbing to myriad air threats that cannot be held off, despite the passage of a recent aid bill that provided an additional $61 billion in military aid.\nUkraine’s air defenses are already facing an untenable situation, one which additional Patriot batteries simply cannot remedy.\nBy President Zelenskyy’s own reckoning, Ukraine’s patchwork of Soviet, European and American air defense systems is only about 25% of what Ukraine would need to adequately defend itself.\nRussia is exploiting Ukraine’s lack of air defense to both gather timely intelligence and to take out strategic targets behind the front line, such as air defenses and power plants.\nWhile Patriot systems are inherently defensive and cannot be employed in a kinetically offensive manner, this only describes their tactical effect.", "location": "Kyiv", "classification": "security", "score": 0.5048966170640623, "event_breakdown": "* Ukraine’s air defenses are succumbing to myriad air threats that cannot be held off, despite the passage of a recent aid bill that provided an additional $61 billion in military aid.\n* Ukraine’s air defenses are already facing an untenable situation, one which additional Patriot batteries simply cannot remedy.\n* By President Zelenskyy’s own reckoning, Ukraine’s patchwork of Soviet, European and American air defense systems is only about 25% of what Ukraine would need to adequately defend itself.\n* Russia is exploiting Ukraine’s lack of air defense to both gather timely intelligence and to take out strategic targets behind the front line, such as air defenses and power plants.\n* While Patriot systems are inherently defensive and cannot be employed in a kinetically offensive manner, this only describes their tactical effect."}, {"id": "9656ddae-0c26-42af-97aa-cc385d044a95", "title": "Zelensky visits Kharkiv in show of support for city pounded by Russian strikes", "date": "2024-05-24 13:45", "url": "https://thefrontierpost.com/zelensky-visits-kharkiv-in-show-of-support-for-city-pounded-by-russian-strikes/", "message": "KHARKIV (Reuters): President Volodymyr Zelensky visited Ukraine’s northeastern city of Kharkiv on Friday as it faces intensified Russian air attacks amid an offensive push by Moscow’s forces into the north of the surrounding region.\nOleksandr Syrskyi, Ukraine’s top commander, said on Thursday that Russian forces were locked in street fighting in Vovchansk and that they had moved onto a defensive footing near Lyptsi.\nRussia says it wants to set up a “buffer” zone in the region in what it calls a response to Kyiv’s shelling of Russian border regions such as Belgorod.\nKharkiv, Ukraine’s second largest city which lies some 30 km from the border with Russia, and the surrounding region have faced daily missile, drone and guided bomb strikes for months.\n“The entire city and region of Kharkiv deserve our support, gratitude, and respect,” Zelensky said.", "location": "The main location where the event takes place is Kharkiv, Ukraine.", "classification": "security", "score": 0.4599501649289299, "event_breakdown": "- Russia offensive in the north of the surrounding Kharkiv region.\n- Street fighting in Vovchansk.\n- Defensive stance near Lyptsi by Russia forces.\n- Daily missile, drone and guided bomb strikes in Kharkiv city and the surrounding region."}, {"id": "aaae267b-7fc3-45b0-8a3a-08971f67761e", "title": "Israeli army recovers bodies of 3 more hostages from Gaza", "date": "2024-05-24 11:15", "url": "https://www.cbc.ca/news/world/israel-hamas-war-day-231-1.7213523", "message": "The bodies of three more hostages killed on Oct 7. were recovered overnight from Gaza, Israel's army says.\nThe army said they were killed on the day of the attack at the Mefalsim intersection and their bodies were taken to Gaza.\nThe announcement comes less than a week after the army said it found the bodies of three other Israeli hostages killed on Oct. 7.\nIsrael says around 100 hostages are still captive in Gaza, along with the bodies of around 30 more.\nOn May 17, Israel's military says it retrieved the bodies of the three hostages from Gaza.", "location": "GAZA", "classification": "security", "score": 0.9150861775337766, "event_breakdown": "1. The bodies of three more hostages killed on Oct 7 were recovered overnight from Gaza, Israel's army says.\n2. The army said they were killed on the day of the attack at the Mefalsim intersection and their bodies were taken to Gaza.\n3. The announcement comes less than a week after the army said it found the bodies of three other Israeli hostages killed on Oct. 7.\n4. On May 17, Israel's military says it retrieved the bodies of the three hostages from Gaza."}, {"id": "45c754a4-84a1-403f-a768-9cfaf390ec25", "title": "Dave Chappelle Calls Israel War Against Hamas  Genocide  ", "date": "2024-05-24 14:00", "url": "https://www.breitbart.com/entertainment/2024/05/24/dave-chappelle-calls-israels-war-against-hamas-genocide/", "message": "Stand-up comedian and actor Dave Chappelle drew cheers from his audience in Abu Dhabi on Thursday by reportedly calling the Israeli war on Hamas terrorists in Gaza a “genocide.”The capital of the federation of seven sheikdoms that make up the United Arab Emirates (UAE) on the Arabian Peninsula delivered the audience that cheered on Chappelle’s observations.\nAP reports the full crowd at Abu Dhabi’s Etihad Arena cheered as DJ Trauma, who accompanied Chappelle on the trip, played the song “My Blood is Palestinian” by the Palestinian singer Mohammed Assaf.", "location": "ABU DHABI", "classification": "security", "score": 0.8497769944357663, "event_breakdown": "Chappelle is said to have attended a UAE government-arranged event honoring two jets donated by the UAE to Israel.\nChappelle reportedly appeared on stage at Etihad Arena at an event organised by the government of the UAE to honour two UAE F-35 jets donated to Israel just a few days before the attack against Gaza (which is said to calm down with Israel ) where the capital Abu Dhabi cheered on his words. The event was attended by an Arab sheikh and other Arab celebrities"}, {"id": "ab8346c7-48cc-4547-90a5-53e04212e422", "title": "The Pitt County Sheriff Office says they put the SHE in SHEriff at competition", "date": "2024-05-24 03:15", "url": "https://www.witn.com/2024/05/24/pitt-county-sheriffs-office-says-they-put-she-sheriff-competition/", "message": "PITT COUNTY, N.C. (WITN) -One of three female Pitt County Sheriff’s deputies competing in a shooting competition took home top honors.\nThe sheriff’s office says three of their female deputies put the SHE in SHEriff when they competed in the 2nd Annual Tar River Top Gun Shooting Competition in Edgecombe County.\nThe Second Annual Tar River Top Gun Shooting Competition is an event that brings law enforcement women together from different agencies along the Tar River to compete in individual events.\nIn addition to Deputy Guisado, Deputy Mariah Hudson, Community Impact Unit, SRO, and Deputy Elizabeth Krohn, Patrol Division, Uniformed Patrol Unit, also competed.\n*Deputy Jasmine Guisado, Community Impact Unit, SRO *Deputy Mariah Hudson, Community Impact Unit, SRO *Deputy Elizabeth Krohn, Patrol Division, Uniformed Patrol Unit (none)Copyright 2024 WITN.", "location": "-\nTar River Top Gun Shooting Competition takes place in Edgecombe County, North Carolina.", "classification": "security", "score": 0.409740988516787, "event_breakdown": "Security events in the list form:\n1. Three female Pitt County Sheriff's Deputies (Jasmine Guisado, Mariah Hudson, and Elizabeth Krohn) participated in the 2nd Annual Tar River Top Gun Shooting Competition in Edgecombe County.\n2. The deputies competed in individual events at the shooting competition, which aimed to unite law enforcement women from different agencies along the Tar River."}, {"id": "68856bc1-318c-4f5e-ad03-6c5e4e85a6c3", "title": "1 day of probation for man who opened fire inside South Loop movie theatre", "date": "2024-05-24 03:45", "url": "https://www.yahoo.com/news/1-day-probation-man-opened-012722686.html", "message": "1 day of probation for man who opened fire inside South Loop movie theatre1 day of probation for man who opened fire inside South Loop movie theatreCHICAGO — A man who opened fire inside a Chicago theatre amid an argument with a teen will not spend time behind bars.\nCourt records show Babacar Mbengue pled guilty to one misdemeanor count of reckless conduct.\nCook County judge sentenced Mbengue to one day of court supervision.\n***The video above is from a previous report***SEE ALSO: Stabbing outside Chicago Theatre prompts police presence, draws large crowdThe shooting occurred around 7:30 p.m. on Saturday, April 8, 2023 at the ICON Movie Theatre in South Loop, located in the 1100 block of South Delano Court.\nDuring the fight, a handgun fell from the teen’s pocket, and Mbengue picked it up and fired into the floor.", "location": "South Loop", "classification": "security", "score": 0.8733113643014289, "event_breakdown": ".\n1. Shooting at ICON Movie Theatre in South Loop, Chicago (Location: 1100 South Delano Court)\n2. Man involved in fight with a teen in a movie theater picks up a handgun thrown out of the teen's pocket and fires into the floor."}, {"id": "b4e1b5dd-e421-4701-93a1-839c6b440944", "title": "Top UN court to rule on S Africa Gaza ceasefire bid", "date": "2024-05-24 20:30", "url": "https://www.thedailystar.net/news/world/israels-attack-on-palestine/news/top-un-court-rule-s-africa-gaza-ceasefire-bid-3617716", "message": "The top United Nations court on Friday will rule on a plea by South Africa to order a halt to the Israeli military offensive in Gaza, with Pretoria accusing Israel of \"genocide\".\nIn a highly-charged ruling in January, the court ordered Israel to do everything in its power to prevent genocidal acts in Gaza but stopped short of ordering a ceasefire.\nSouth Africa argues that the recent Israeli operation in Rafah changed the situation on the ground and should compel the court to issue fresh emergency orders.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.\nIsrael's retaliatory offensive has killed at least 35,800 people in Gaza, mostly women and children, according to the Hamas-run territory's health ministry.", "location": "GAZA", "classification": "security", "score": 0.8049113133001367, "event_breakdown": "* July-August 2014 Israel-Gaza Conflict\n  * Operation Protective Edge - An Israeli military operation in the Gaza Strip in response to rocket attacks from the territory.\n  * At least 2,100 Palestinians, including more than 500 children, were killed in seven weeks of conflict with Israel, while 67 Israeli soldiers and six civilians in Israel were also killed.\n  * July 23, 2014 Israeli airstrike on the Shuja'iyya market. This was the deadliest single attack of all the war."}]