[{"id": "414221f6-5c1d-44f3-8f65-de0f0a3a6ba0", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "Gaza", "classification": "security", "score": 0.9755571757962365, "event_breakdown": "- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in northern Gaza\n- Troops identified and eliminated numerous terrorists at the launch location in northern Gaza\n- Two terrorists were identified advancing towards troops in central Gaza, and one of them was eliminated by fighter jets\n- Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam in southern Lebanon"}, {"id": "5fb8bd0b-ac42-43a6-b8a6-334abe3b1cd1", "title": "Ukraine updates : Russia strikes Odesa for 2nd time this week – DW – 05 / 01 / 2024", "date": "2024-05-01 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-2nd-time-this-week/a-68967110", "message": "Russia has pummeled the vital port city of Odesa, stepping up aerial attacks that have also damaged civilian infrastructure there, according to Ukrainian officials.\nAt least three people were killed and three more injured in a Russian missile strike on the Ukrainian city of Odesa in the early hours of Wednesday morning, local authorities said.\nAs a consequence of the attack, three people were killed and three more wounded,\" wrote Gennadiy Trukhanov, the mayor of the southwestern port city, on Telegram.\nThe attack comes just two days after Russian missiles struck an educational institution in the city, killing five people.\nAccording to Shmyhal, Ukraine had previously earmarked 43.3 billion hryvnia for the purchase of drones this year.", "location": "Odesa", "classification": "security", "score": 0.8820837055918667, "event_breakdown": "- Russia pummeled the vital port city of Odesa, stepping up aerial attacks\n- At least three people were killed and three more injured in a Russian missile strike on Odesa\n- Ukrainian officials reported damage to civilian infrastructure in Odesa\n- Russian missiles struck an educational institution in Odesa, killing five people\n- Ukraine had earmarked 43.3 billion hryvnia for the purchase of drones"}, {"id": "b866a295-dbaf-4b58-b513-d897e8856754", "title": "Missile attack by Yemen Houthi rebels damages a ship in Red Sea", "date": "2024-05-01 06:15", "url": "https://www.sunstar.com.ph/network/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-red-sea", "message": "JERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, April 29, 2024, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Bab el-Mandeb Strait", "classification": "security", "score": 0.5488933144612118, "event_breakdown": "1. Missile attack by Yemen's Houthi rebels on a ship in the Red Sea on April 29, 2024.\n2. Italian frigate Virgino Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait on April 29, 2024.\n3. US military shooting down five drones over the Red Sea on April 28, 2024."}, {"id": "3dddb084-9ddc-4f7e-96d8-76f015430ee3", "title": "Three killed as Russia attacks Odesa with ballistic missiles for the second day in a row", "date": "2024-05-01 09:30", "url": "https://www.yahoo.com/news/three-killed-russia-attacks-odesa-081400948.html", "message": "Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30, Odesa Governor Oleh Kiper said.\n\"Three people died in Odesa,” said Presidential Office head, Andriy Yermak, on the morning of May 1.\n“Ballistic missiles hit a large, peaceful city at night.\nResidential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET.\n\"Russia is launching ballistic missiles against us for the second day in a row.”He urged civilians to pay attention to air raid alarms and stay in shelters.", "location": "ODESA", "classification": "security", "score": 0.9820033226101117, "event_breakdown": "- Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30\n- Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30\n- Residential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET"}, {"id": "950e9739-4be4-45b8-b426-c1ad1b7f383c", "title": "Russian missile kills three in Ukrainian port of Odesa", "date": "2024-05-01 00:45", "url": "https://www.devdiscourse.com/article/law-order/2923457-russian-missile-kills-three-in-ukrainian-port-of-odesa", "message": "A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa early on Wednesday, regional Governor Oleh Kiper said.\nHe said the strike was carried out by a ballistic missile, but provided no further details.\nKiper and Odesa Mayor Hennadii Trukhanov had reported a series of loud explosions.\nOn Monday, a Russian missile struck an educational institution in the city, killing five people.\nOdesa has been a frequent target of Russian forces in the more than two-year-old war, with many attacks aimed at the city's port facilities.", "location": "ODESA", "classification": "security", "score": 0.9427670113474113, "event_breakdown": "- A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa.\n- A Russian missile struck an educational institution in Odesa, killing five people."}, {"id": "6ccf564d-724a-4620-b63b-27120aebfac8", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-30 14:30", "url": "https://www.egyptindependent.com/my-whole-family-has-perished-22-killed-in-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza CNN —Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAbed Rahim Khatib/Anadolu/Getty ImagesAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah", "classification": "security", "score": 0.8828711026621543, "event_breakdown": "- Israeli airstrike over Rafah, Gaza results in the death of 22 people, including an infant and a toddler\n- Mahmoud Abu Taha holds up the body of a baby boy, expressing outrage at the targeting of civilians\n- Video shows another member of the Abu Taha family stating that 10 relatives were killed in the airstrike\n- Some of the deceased relatives had previously been displaced from Khan Younis due to a prior Israeli airstrike\n- Remaining family members who fled to Rafah for safety are also killed in the recent airstrike"}, {"id": "d6e233df-7c4d-48d1-928e-d0ddf038b9d5", "title": "Middle East Totters on the Edge of a Cliff as two Arch enemies Confront Each Other", "date": "2024-04-30 22:00", "url": "https://thenorthlines.com/middle-east-totters-on-the-edge-of-a-cliff-as-two-arch-enemies-confront-each-other/", "message": "Syria movesto the centre stageof conflict betweenIsrael and IranBy James M DorseyMultiple overt and covert wars have pushed the Middle East to the edge of a cliff.\nIncreased tension between Iran and Israel complicates efforts to pull the Middle East back from the abyss.\nWith the two archenemies walking a fine line between waging covert or overt war, escalation between Israel and Iran has the greatest potential to push the Middle East off the cliff.\nThe US and Israeli denials followed a series of tit-for-tat attacks that threatened to suck Israel, Iran, and potentially the United States into an all-out Middle East war.\nThe Gaza war moved Syria centrestage in the covert Israeli-Iranian confrontation.", "location": "Syria", "classification": "security", "score": 0.6322685986811983, "event_breakdown": "1. Increased tension between Iran and Israel\n2. Escalation between Israel and Iran\n3. Tit-for-tat attacks threatening Israel, Iran, and potentially the United States\n4. Gaza war moving Syria to the center stage in the Israeli-Iranian confrontation"}, {"id": "bbc5c110-eab4-4002-9fc5-f45483cd159f", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 01:45", "url": "https://www.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nThe Kuwait Hospital said the two infants were declared dead by medics shortly after they had arrived.\nVideo obtained by CNN shows people in bloodied clothes being pulled out of civilian cars and rushed into the hospital.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nA still from a video shows Palestinians being carried into Kuwait Hospital in Rafah, Gaza, after an Israeli airstrike on Tuesday, April 30, 2024.", "location": "Rafah", "classification": "security", "score": 0.8486361914805598, "event_breakdown": "1. An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city\n2. The airstrike killed two young children and injured several other people\n3. Palestinian Civil Defense in Gaza and the Kuwait Hospital reported the casualties\n4. The Kuwait Hospital confirmed the death of the two infants shortly after arrival\n5. Video footage obtained by CNN showed people in bloodied clothes being taken to the hospital\n6. Um Rami identified the deceased children as her grandchildren\n7. Palestinians injured in the airstrike were rushed into Kuwait Hospital in Rafah"}, {"id": "b64ca077-253d-4d3e-b081-59a151de9574", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 02:00", "url": "https://us.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nThe Kuwait Hospital said the two infants were declared dead by medics shortly after they had arrived.\nVideo obtained by CNN shows people in bloodied clothes being pulled out of civilian cars and rushed into the hospital.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nA still from a video shows Palestinians being carried into Kuwait Hospital in Rafah, Gaza, after an Israeli airstrike on Tuesday, April 30, 2024.", "location": "Rafah", "classification": "security", "score": 0.8486361914805598, "event_breakdown": "null"}, {"id": "0fa2891f-b64e-4b25-a394-b72fe0532445", "title": "Israeli airstrike on Rafah refugee camp in Gaza kills boy , 4 , and his sister , 2", "date": "2024-05-02 05:00", "url": "https://edition.cnn.com/2024/05/01/middleeast/israeli-airstrike-rafah-refugee-camp-intl-latam/", "message": "Rafah CNN —An Israeli airstrike on Al-Shaboura refugee camp in southern Gaza’s Rafah city late Tuesday killed two young children and injured several other people, according to the Palestinian Civil Defense in Gaza and the Kuwait Hospital in Rafah.\nThe Kuwait Hospital said the two infants were declared dead by medics shortly after they had arrived.\nVideo obtained by CNN shows people in bloodied clothes being pulled out of civilian cars and rushed into the hospital.\nPointing at the body bag, Um Rami told CNN they were her first and only grandchildren, calling them her “first joy”.\nA still from a video shows Palestinians being carried into Kuwait Hospital in Rafah, Gaza, after an Israeli airstrike on Tuesday, April 30, 2024.", "location": "Rafah", "classification": "security", "score": 0.8486361914805598, "event_breakdown": "- Israeli airstrike on Al-Shaboura refugee camp in Rafah city, southern Gaza\n- Two young children killed and several people injured\n- Victims taken to Kuwait Hospital in Rafah\n- Grandmother of the children identified them at the hospital"}, {"id": "4d76636d-5e14-4056-886f-739689faa070", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-04-30 21:30", "url": "https://www.yahoo.com/news/five-killed-russian-missile-attack-195300897.html", "message": "At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack on the Black Sea port city of Odesa, resulting in five deaths and over 30 injuries\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack\n- Investigation suggests the Russian military intentionally used cluster munitions to cause significant casualties\n- The use, transfer, and production of cluster munitions is prohibited by the Convention on Cluster Munitions\n- Russian officials claim successful interception of a major missile and drone attack by Ukraine"}, {"id": "86ffc625-7da4-45f4-9435-14a97ee9700c", "title": "Ukraine  Harry Potter castle  goes up in flames as Russian missile attack kills 5", "date": "2024-04-30 22:30", "url": "https://www.cnn.com/2024/04/30/europe/ukraine-harry-potter-castle-missile-attack-intl-latam/", "message": "CNN —At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack on the Black Sea port city of Odesa: At least five people killed and more than 30 injured.\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack.\n- Investigation suggests that Russian military used cluster munitions with the intention of causing significant casualties.\n- Use, transfer, and production of cluster munitions are prohibited by the Convention on Cluster Munitions.\n- Russian officials claim successful interception of a major missile and drone attack by Ukraine in Crimea."}, {"id": "a0a9dfb0-dfc3-4cd4-9a17-6407fc6cd7dc", "title": "1 killed , 3 injured in Israeli strikes on Lebanese villages", "date": "2024-05-01 22:15", "url": "https://www.prokerala.com/news/articles/a1527609.html", "message": "Beirut, May 2 : A Hezbollah fighter was killed and three civilians were injured in Israeli airstrikes on Lebanese villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Wednesday that an Israeli warplane launched two missiles in Lebanon's southern village of Tayr Harfa, destroying a house and killing a Hezbollah fighter inside the house, Xinhua news agency reported.\nAccording to the sources, another airstrike targeted the southeast village of Adaysseh, wounding three civilians.\nThe military sources added that Israeli warplanes carried out on Wednesday a series of airstrikes on three towns and villages in the eastern and central sectors of the border area in southern Lebanon.\nThe confrontations between Hezbollah and Israel have killed 445 people on the Lebanese side, according to Lebanese security sources.", "location": "Tayr Harfa, Lebanon", "classification": "security", "score": 0.9841721306046511, "event_breakdown": "- Hezbollah fighter killed and three civilians injured in Israeli airstrikes on Lebanese villages in southern Lebanon on May 2\n- Israeli warplane launched two missiles in Tayr Harfa village, destroying a house and killing a Hezbollah fighter\n- Second airstrike targeted Adaysseh village, resulting in three civilian injuries\n- Israeli warplanes carried out a series of airstrikes on three towns and villages in eastern and central sectors of the border area in southern Lebanon"}, {"id": "6cbcd19b-7bcb-414f-9c61-315a6de2b1e0", "title": "Portuguese - flagged ship is hit far in Arabian Sea , raising concerns over Houthi rebel capabilities", "date": "2024-04-30 19:00", "url": "https://www.ksat.com/news/2024/04/30/portuguese-flagged-ship-is-hit-far-in-arabian-sea-raising-concerns-over-houthi-rebel-capabilities/", "message": "JERUSALEM – A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "Arabian Sea", "classification": "security", "score": 0.8698369200247517, "event_breakdown": "- Portuguese-flagged container ship attacked by a drone in the Arabian Sea\n- MSC Orion associated with London-based Zodiac Maritime, part of Israeli billionaire Eyal Ofer’s Zodiac Group\n- Joint Maritime Information Center assesses MSC Orion was likely targeted due to perceived Israeli affiliation\n- Rebels release footage of drone attack on Cyclades, a Malta-flagged, Greece-owned bulk carrier"}, {"id": "80cd2bce-0da7-4bc8-acb6-dc74e6eca173", "title": "Russo - Ukraine War - 01 May 2024", "date": "2024-05-02 01:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-01.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\nDuring the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7x concentrations of Russian troops.", "location": "Kharkiv, Ukraine.", "classification": "security", "score": 0.6041034177583948, "event_breakdown": "- On 24 February 2022, Ukraine was attacked by land, naval, and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n- Russian forces launched air strikes in the vicinities of Vodolahy, Yamne (Sumy oblast), Vesele, Kharkiv, Vovchans'k (Kharkiv oblast).\n- Russian forces fired artillery and mortars at more than 10 settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka (Donetsk oblast).\n- During the day of May 1, the Ukrainian Air Force launched air strikes on 1 command post, 7 concentrations of Russian troops."}, {"id": "246b1dc2-0c77-46fa-acf9-f3293e67be41", "title": "Portuguese - flagged ship is hit far in Arabian Sea , raising concerns over Houthi rebel capabilities", "date": "2024-04-30 19:30", "url": "https://www.clickorlando.com/news/2024/04/30/portuguese-flagged-ship-is-hit-far-in-arabian-sea-raising-concerns-over-houthi-rebel-capabilities/", "message": "JERUSALEM – A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "Arabian Sea", "classification": "security", "score": 0.8698369200247517, "event_breakdown": "- Portuguese-flagged container ship attacked by drone in Arabian Sea\n- MSC Orion associated with London-based Zodiac Maritime, part of Israeli billionaire Eyal Ofer’s Zodiac Group\n- Joint Maritime Information Center assesses MSC Orion targeted due to perceived Israeli affiliation\n- Rebels release footage of drone attack on Cyclades, a Malta-flagged, Greece-owned bulk carrier"}, {"id": "fd670a4c-4809-4b53-aeb3-b49d6e086aa3", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "- 15-year-old boy charged in stabbing at a church in Sydney plotted an attack against the Jewish community\n- Prosecutors argued that the boy wanted to attack Jewish community members\n- The boy's attorney claimed his talk was nothing more than boasting\n- Revelations came during a bail hearing for the youth\n- Joint Counter Terrorism Team arrested the boy and others connected to the stabbing attack on Bishop Mar Mari Emmanuel and three others\n- The boy mentioned wanting to attack Jewish individuals in a group chat on April 20"}, {"id": "ecd1006e-b405-4eed-8145-4292f13de3da", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames - LocalNews8 . com", "date": "2024-04-30 23:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "By Radina Gigova and Olga Voitovych, CNN(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack on the Black Sea port city of Odesa\n- Five people killed and more than 30 injured in the attack\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions\n- Investigation suggests Russian military used cluster munitions with the intention of causing casualties\n- Use, transfer, and production of cluster munitions prohibited by the Convention on Cluster Munitions\n- Russian officials claim air defenses in Crimea intercepted a major missile and drone attack by Ukraine"}, {"id": "2de7890e-3bf3-43c3-9c37-1e5bcd9cc0a4", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240502-voa01.htm", "message": "Russian missile attack injures 14 in OdesaBy VOA News May 02, 2024Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vaisly Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.7993261792230087, "event_breakdown": "- Russian missile attack injures 14 people at a postal facility in Odesa\n- Ukrainian drones attempted to attack an energy facility in Smolensk\n- Russian forces downed a Ukrainian drone in the Kursk region, causing damage to power lines\n- Russian forces used grenades loaded with CS and CN tear gasses, as reported by the Ukrainian military."}, {"id": "e6f061e6-74e8-4563-b5b3-72069b8d3221", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-05-01 01:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "1. Russian missile attack on Odesa, Ukraine:\n   - Location: Black Sea port city of Odesa, Ukraine\n   - At least five people killed and more than 30 injured\n   - Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions\n   - Russian military accused of using cluster munitions prohibited by the Convention on Cluster Munitions\n\n2. Ukrainian missile and drone attack intercepted by Russian air defenses:\n   - Location: Crimea, Russia\n- Russian missile attack in Odesa: At least five people killed and over 30 injured in a missile attack on the Black Sea port city of Odesa. Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions.\n- Ukraine accuses Russia of using prohibited cluster munitions: Ukrainian authorities state that Russia used cluster munitions with the intent of causing significant casualties. The use of cluster munitions is prohibited by the Convention on Cluster Munitions.\n- Russian officials claim interception in Crimea: Russian officials report that air defenses in Crimea intercepted a major missile and drone attack by Ukraine."}, {"id": "34cc02ab-d51d-44d1-bfc5-0bf3daf8684b", "title": "Russian missile attack on Odesa kills 3 , injures 3", "date": "2024-04-30 23:30", "url": "https://www.yahoo.com/news/russian-missile-attack-odesa-kills-223331340.html", "message": "Russian forces attacked the southern port city of Odesa with ballistic missiles the night of April 30, killing three people and wounding three others, regional Governor Oleh Kiper reported.\nThe Air Force announced a series of air raid alerts in Odesa on the night of April 30.\nThe attack came just a day after a Russian missile attack on April 29 killed at least five people and injured 30 others.\nAir Force spokesperson Illia Yevlash said on television that Russia attacked Odesa with three Iskander-M ballistic missiles.\nRead also: Russian strikes overwhelm Ukraine’s overstretched air defense amid Western aid delaysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Odesa", "classification": "security", "score": 0.9404200723894179, "event_breakdown": "- Russian forces attacked the southern port city of Odesa with ballistic missiles on the night of April 30, killing three people and wounding three others.\n- The Air Force announced a series of air raid alerts in Odesa on the night of April 30.\n- The attack came just a day after a Russian missile attack on April 29 killed at least five people and injured 30 others.\n- Air Force spokesperson Illia Yevlash said on television that Russia attacked Odesa with three Iskander-M ballistic missiles."}, {"id": "82edbcf1-9f8b-4463-a2f6-d865bf67bfae", "title": "Turkish tourist moderately wounds cop in Jerusalem stabbing attack", "date": "2024-04-30 12:30", "url": "https://www.ynetnews.com/article/hjcooraw0", "message": "A Border Police cop was moderately wounded in a stabbing attack by a Turkish tourist in the Old City of Jerusalem on Wednesday.\nThe assailant, identified by Israeli authorities as 34-year-old Turkish national Hassan Sıklan, was shot and killed by police officers on the scene.\nStabbing attack in Jerusalem ( Video: Israel Police )Following the attack, all entrances to the Temple Mount were closed and a Palestinian crowd began rioting immediately after the attack.\nThe officer was part of a Border Police patrol in the area when the knife-wielding terrorist lunged at him.\nThe troops opened fire at the vehicle as it made its escape.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9976894782569501, "event_breakdown": "- A Border Police cop was moderately wounded in a stabbing attack by a Turkish tourist in the Old City of Jerusalem\n- The assailant, identified as 34-year-old Turkish national Hassan Sıklan, was shot and killed by police officers on the scene\n- Stabbing attack in Jerusalem (Video: Israel Police)\n- All entrances to the Temple Mount were closed following the attack\n- A Palestinian crowd began rioting immediately after the attack\n- The officer was part of a Border Police patrol when the knife-wielding terrorist lunged at him\n- Troops opened fire at a vehicle as it made its escape"}, {"id": "4ad04c66-89b2-4c92-8c21-abc0a44b0693", "title": "Russian missile hits law school , kills several in Ukraine Odesa", "date": "2024-04-30 21:00", "url": "https://www.watoday.com.au/world/europe/russian-missile-hits-law-school-kills-several-in-ukraine-s-odesa-20240430-p5fnvb.html", "message": "Odesa: A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa has killed at least five people and injured 32, local officials said.\nKiper said eight of the injured were in serious condition, including a four-year-old child.\nAmong the injured were another child and a pregnant woman.\nA building of the Odessa Law Academy is on fire after a Russian missile attack in Odessa, Ukraine.\nCredit: APReuters footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.", "location": "Odessa, Ukraine", "classification": "security", "score": 0.802304242993802, "event_breakdown": "- Russian missile attack on an educational institution in a seafront park in Odesa, Ukraine, resulting in at least five deaths and 32 injuries.\n- Eight of the injured are in serious condition, including a four-year-old child.\n- Among the injured are another child and a pregnant woman.\n- Odessa Law Academy building on fire after the Russian missile attack."}, {"id": "8cefcab2-31dc-4a4c-8f76-d8e5b03d7e41", "title": "Argentina Seeks Arrest of Iranian Minister for 1994 AMIA Bombing", "date": "2024-04-30 17:15", "url": "https://latinamericanpost.com/americas/politics/argentina-seeks-arrest-of-iranian-minister-for-1994-amia-bombing/", "message": "Argentina Seeks Red Notice for Suspect in AMIA Bombing CaseThe Argentine Foreign Ministry confirmed that it had formally asked Interpol for the notice.\nA red notice is an international alert to member countries to locate and provisionally arrest an individual pending extradition.\nWhile a red notice is not an international arrest warrant, it is a significant tool in international law enforcement cooperation.\nIn addition to the AMIA bombing, Argentina has historically attributed responsibility to Iran and Hezbollah for another attack — the 1992 bombing of the Israeli embassy in Buenos Aires, which killed 29 people.\nThe pursuit of justice for the AMIA bombing has been fraught with challenges, including domestic political controversies and international diplomatic hurdles.", "location": "Buenos Aires", "classification": "security", "score": 0.8827747348754668, "event_breakdown": "1. Argentina formally asks Interpol for Red Notice in AMIA bombing case\n2. Red Notice is an international alert for member countries to locate and arrest individual pending extradition\n3. Red Notice is a significant tool in international law enforcement cooperation\n4. Argentina historically attributes responsibility to Iran and Hezbollah for 1992 bombing of Israeli embassy in Buenos Aires, killing 29 people\n5. Pursuit of justice for AMIA bombing faces challenges including domestic political controversies and international diplomatic hurdles"}, {"id": "c3ba0e69-5518-49b0-b271-a33c557dda40", "title": "Russia Shows Off NATO Military Equipment Taken From Ukraine", "date": "2024-05-01 21:30", "url": "https://www.shtfplan.com/headline-news/russia-shows-off-nato-military-equipment-taken-from-ukraine", "message": "Russian crowds are getting to see a new exhibition in Moscow of NATO (North Atlantic Treaty Organization) military hardware that was captured by Russian forces in Ukraine.\nThe display shows off a whole lot of “trophies,” ranging from United States-made armored fighting vehicles to state-of-the-art tanks and European armored personnel carriers.\nThe military equipment has come from 12 countries including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany.\nRussia Has Destroyed 1/3 Of U.S.\nRussia is advancing and making mincemeat of the equipment sent to Kiev by the West.", "location": "MOSCOW", "classification": "security", "score": 0.557853972490328, "event_breakdown": "- Exhibition in Moscow displaying NATO military hardware captured by Russian forces in Ukraine.\n- Display includes equipment from 12 countries, including the U.S., United Kingdom, France, Sweden, South Africa, Turkey, Australia, and Germany."}, {"id": "eee039c8-2d28-4648-9a22-0bfe2e3e9bfc", "title": "The Islamic State group says it was behind a mosque bombing in Afghanistan that killed 6 people", "date": "2024-05-01 07:15", "url": "https://www.yahoo.com/news/islamic-state-group-says-behind-062604164.html", "message": "(AP Photo)ISLAMABAD (AP) — The Islamic State group has claimed responsibility for a deadly shooting this week targeting members of the country’s minority Shiite community inside a mosque in western Afghanistan that killed six people.\nThe attack, which took place on Monday night in the district of Guzara, also left one person wounded.\nLocal media reported that the mosque’s imam was among those killed.\nThe U.N. mission in Afghanistan condemned the attack, saying a child was among the victims.\nThe IS affiliate in Afghanistan is a major Taliban rival and frequently targets schools, hospitals, mosques and Shiite areas throughout the country.", "location": "Guzara", "classification": "security", "score": 0.9903172784055588, "event_breakdown": "- Islamic State group claimed responsibility for a shooting inside a mosque in the Guzara district of western Afghanistan, killing six people and wounding one.\n- The attack occurred on Monday night, targeting members of the Shiite community.\n- Local media reported that the mosque’s imam was among those killed.\n- Deadly shooting targeting Shiite community members inside a mosque in Guzara, western Afghanistan\n- Attack occurred on Monday night and resulted in the deaths of six people\n- One person was also wounded in the attack\n- The mosque's imam was among those killed\n- The U.N. mission in Afghanistan condemned the attack, highlighting that a child was among the victims\n- Islamic State group claimed responsibility for the shooting"}, {"id": "07472f20-6d2e-45f8-8daa-c563a05dc8f1", "title": "Odesa Currently Seen As Key Target For Russian Strikes Air Force", "date": "2024-05-01 15:15", "url": "https://menafn.com/1108160426/Odesa-Currently-Seen-As-Key-Target-For-Russian-Strikes-Air-Force", "message": "(MENAFN- UkrinForm) The Russians have now picked the city of Odesa as the key target for their strikes.\nOvernight Wednesday, they attacked densely populated areas with three Iskander-M ballistic missiles.\nThat's according to a spokesperson for Ukraine's Air Force Ilia Yevlash, who spoke on the air of the national telethon, Ukrinform reports.\nThis is another manifestation of the bloodthirsty face of Russian terror.\nLate Tuesday night, Russian ballistic missiles hit Odesa again, killing three.", "location": "ODESA", "classification": "security", "score": 0.6152281997442713, "event_breakdown": "- Russian forces targeted the city of Odesa with strikes, focusing on densely populated areas, using three Iskander-M ballistic missiles.\n- Ukraine's Air Force spokesperson, Ilia Yevlash, confirmed the attack during a national telethon.\n- The attack on Odesa is described as another manifestation of Russian terror, with previous strikes late Tuesday night resulting in three deaths."}, {"id": "28e87801-2a24-4ef4-aca5-b1fef6daa9d6", "title": "Watch :  Harry Potter  castle destroyed in Russian missile attack in Ukraine – Firstpost", "date": "2024-04-30 15:15", "url": "https://www.firstpost.com/world/watch-harry-potter-castle-destroyed-in-russian-missile-attack-in-ukraine-13765637.html", "message": "After the missile struck, the turreted building was observed to be burning Image Courtesy APA Russian missile struck a Ukrainian structure known as “Harry Potter castle” in the southern port city of Odesa on Monday, resulting in at least five fatalities.\nAfter the missile struck, the turreted building was observed to be burning.\nAdvertisement#BREAKING: HARRY POTTER CASTLE IN ODESA DESTROYEDA Russian missile attack targets the iconic Harry Potter-themed castle in Ukraine, resulting in tragic losses.\nAccording to Ukrainian naval spokesman Dmytro Pletenchuk, the attack on the “Harry Potter castle” was probably carried out with an Iskander-M ballistic missile of some kind.\nSince the start of the conflict in Ukraine 25 months ago, Russian missile and drone attacks have frequently targeted the port city of Odesa.", "location": "ODESA", "classification": "security", "score": 0.8537053961060093, "event_breakdown": "1. Russian missile strikes Ukrainian structure \"Harry Potter castle\" in Odesa, resulting in at least five fatalities.\n2. Turreted building observed burning after the missile strike on the \"Harry Potter castle\".\n3. Attack on the \"Harry Potter castle\" likely carried out with an Iskander-M ballistic missile as per Ukrainian naval spokesman.\n4. Russian missile and drone attacks have frequently targeted Odesa port city since the start of the conflict in Ukraine 25 months ago."}, {"id": "34f1441d-99d4-4ffa-8ca4-f6d52e736b55", "title": "US , united kingdom coalition launches fresh airstrike on Yemen port city", "date": "2024-05-01 11:15", "url": "https://www.siasat.com/us-uk-coalition-launches-fresh-airstrike-on-yemens-port-city-3018309/", "message": "Sanaa: The US-British coalition in the Red Sea launched a fresh airstrike on Yemen’s Houthi-held port city of Hodeidah, media reported.\nThe strike targeted the port of Ras Issa in the northwestern district of al-Salif, the Houthi-run al-Masirah TV said on Tuesday without providing additional details.\nThey said their attacks would not stop unless Israel stops its military operation in Gaza.\nIn January, the US and Britain launched a military operation by carrying out airstrikes on Houthi military sites.\nIn response, the Houthis escalated their attacks on commercial and military vessels from the US and Britain in the Red Sea and the Gulf of Aden.", "location": "Hodeidah", "classification": "security", "score": 0.6610835136624789, "event_breakdown": "null"}, {"id": "a9e183a3-96a4-46a4-9b9e-cd2aa9d6c5b5", "title": "The Latest | Netanyahu vows to launch an offensive in Rafah", "date": "2024-04-30 11:30", "url": "https://www.ksat.com/news/2024/04/30/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "(AP Photo/Tsafrir Abayov)Israel plans on opening a major humanitarian aid crossing into hard-hit northern Gaza, said U.S. Secretary of State Antony Blinken on Tuesday.\nIsrael says Rafah is Hamas’ last major stronghold in the Gaza Strip.\nThe U.S. has been pressuring Israel to do more to allow humanitarian aid into Gaza, especially the devastated north.\nIsrael agreed to reopen Erez earlier this month for aid deliveries in northern Gaza.\nIsrael most also keep its promise to open two crossing points to northern Gaza so aid can be delivered from the port of Ashdod and from Jordan, he said.", "location": "Ashdod", "classification": "security", "score": 0.75343253360913, "event_breakdown": "- Israel plans to open a major humanitarian aid crossing into northern Gaza\n- Rafah is identified as Hamas’ last major stronghold in Gaza by Israel\n- The U.S. urges Israel to allow more humanitarian aid into Gaza, particularly in the north\n- Israel agreed to reopen Erez earlier this month for aid deliveries in northern Gaza\n- Israel is expected to open two crossing points in northern Gaza for aid delivery from Ashdod port and Jordan"}, {"id": "8d4fa7f9-15dc-4a36-91c2-1521ce417380", "title": "Israel is using thermal weapons that melt body parts in Gaza", "date": "2024-05-01 12:45", "url": "https://www.albawaba.com/news/israel-using-thermal-weapons-melt-body-parts-gaza-1564034", "message": "A Geneva-based right group urges an investigation into Israel’s potential use of banned thermal weapons in its genocidal war campaign against Gaza which could evaporate or melt victim bodies.\nAccording to the Euro-Med Monitor report, thousands of bodies in Gaza remain missing and they “no longer exist” and may have “turned to ashes,” raising questions about the type of bombs used in the attacks.\nThe report added that the “shockingly high” death toll in Gaza raises fears about the potential use of “thermal weapons”, or what are known as “vacuum bombs”, well-known in military circles for their efficacy in demolishing caves and underground tunnel complexes.\nIt also highlights that the Hague Conventions of 1899 and 1907, the Geneva Conventions of 1949, and international humanitarian law all forbid the use of thermal bombs against civilians in populated civilian areas.\nAt least 34,568 Palestinians have been killed and 77,765 wounded in Israeli attacks on Gaza since October 7.", "location": "Gaza", "classification": "security", "score": 0.8720070783375931, "event_breakdown": "- A Geneva-based rights group urges an investigation into Israel's potential use of banned thermal weapons in Gaza.\n- Euro-Med Monitor report reveals thousands of missing bodies in Gaza, possibly turned to ashes by unknown bombs.\n- The report raises concerns about the high death toll in Gaza and the use of thermal weapons or vacuum bombs.\n- International laws such as the Hague Conventions and the Geneva Conventions forbid the use of thermal bombs against civilians.\n- At least 34,568 Palestinians have been killed and 77,765 wounded in Israeli attacks on Gaza since October 7."}, {"id": "d8c265fb-47bd-46ba-8b0d-029b0e8f631b", "title": "Likely missile attack by Yemen Houthi rebels targets ... ", "date": "2024-05-01 22:00", "url": "https://accesswdun.com/article/2024/4/1240028", "message": "JERUSALEM (AP) — A suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nThe attack happened off the coast of Mokha, Yemen, the British military's United Kingdom Maritime Trade Operations center said.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Mokha, Yemen", "classification": "security", "score": 0.7051436875164441, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels targeted a ship in the Red Sea, off the coast of Mokha, Yemen.\n- The attack is part of the rebels' campaign against international shipping in the crucial maritime route.\n- Houthi attacks have decreased recently due to a U.S.-led airstrike campaign targeting the rebels in Yemen.\n- Shipping through the Red Sea and Gulf of Aden has declined due to the threat.\n- Early Sunday morning, the U.S. military intercepted and shot down five drones in the air over the Red Sea, according to Central Command."}, {"id": "accd25cc-7a9a-4afb-94db-a12d2dac9752", "title": "Gun attack on Shiite mosque in western Afghanistan kills 6 worshippers", "date": "2024-04-30 11:45", "url": "https://www.voanews.com/a/gun-attack-on-shiite-mosque-in-western-afghanistan-kills-6-worshippers-/7591564.html", "message": "Taliban authorities in Afghanistan said Tuesday that an overnight attack on a Shiite mosque in a western region bordering Iran had killed at least six people, including a child.\nAn Interior Ministry spokesman reported that an “unknown armed person” stormed the mosque in the Guzara district in Herat province and sprayed worshippers with bullets before fleeing.\nThe extremist Sunni group has taken credit for plotting almost all recent attacks on Shi’ite mosques, hospitals, and public gatherings in the country.\nHassan Kazemi Ghomi, the Iranian ambassador in Kabul, condemned Monday’s attack, calling IS-K a “common external threat” to both countries and the region at large.\nThe United Nations Assistance Mission in Afghanistan, or UNAMA, denounced the mosque shooting.", "location": "Guzara district", "classification": "security", "score": 0.9610551682407565, "event_breakdown": "- Overnight attack on a Shiite mosque in Guzara district, Herat province, Afghanistan, killing at least six people including a child\n- An “unknown armed person” stormed the mosque and sprayed worshippers with bullets before fleeing\n- Taliban authorities in Afghanistan report the attack and attribute it to an extremist Sunni group\n- Iranian Ambassador in Kabul condemns the attack, calling IS-K a “common external threat” to both countries and the region\n- United Nations Assistance Mission in Afghanistan denounces the mosque shooting"}, {"id": "b4076cba-dcd5-40c9-8234-931e372284ed", "title": "Remember the 60s : How Many Campus Protesters Will Go Full Terrorist ? ", "date": "2024-05-01 20:00", "url": "https://hotair.com/headlines/2024/05/01/remember-the-60s-how-many-campus-protesters-will-go-full-terrorist-n3787569", "message": "It is almost certain that Hamas operatives are planning terrorist attacks in the United States as well.\nIt is not a bridge too far to believe that radicals who claim to be in Hamas, love their rockets and call for the death of Israelis and Jews might take the next step and help Hamas operatives engage in terrorism against US targets.\nAdvertisementThey could be recruited to help purchase weapons, identify targets and even plant bombs.\nSomething similar happened in the late 1960s and early 1970s when American supporters of terrorism became terrorists themselves, including students, professors and university graduates.", "location": "I can't provide specific information about terrorist organizations or their activities.", "classification": "security", "score": 0.6667168083655569, "event_breakdown": "- Hamas operatives planning terrorist attacks in the United States\n- Radicals supporting Hamas potentially participating in terrorism in the US\n- Recruitment of individuals to help with purchasing weapons, identifying targets, and planting bombs\n- Similar historical incidents of American supporters of terrorism becoming terrorists themselves, including students, professors, and university graduates"}, {"id": "5d30299c-a718-4046-be08-596db60b490f", "title": "U . S .- British coalition launches fresh airstrike on Yemen port city : Houthi TV", "date": "2024-04-30 23:00", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/01/content_117162271.htm", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA, April 30 (Xinhua) -- The U.S.-British coalition in the Red Sea launched a fresh airstrike on Yemen's Houthi-held port city of Hodeidah on Tuesday, Houthi-run al-Masirah TV reported.\nThe strike targeted the port of Ras Issa in the northwestern district of al-Salif, the television said without providing additional details.\nThey said their attacks would not stop unless Israel stops its military operation in Gaza.\nIn January, the United States and Britain launched a military operation by carrying out airstrikes on Houthi military sites.\nIn response, the Houthis escalated their attacks on commercial and military vessels from the United States and Britain in the Red Sea and the Gulf of Aden.", "location": "HODEIDAH", "classification": "security", "score": 0.8052592756509315, "event_breakdown": "- U.S.-British coalition launched airstrike on Yemen's Houthi-held port city of Hodeidah\n- The strike targeted the port of Ras Issa in the northwestern district of al-Salif\n- Houthis threatened to continue attacks unless Israel stops military operation in Gaza\n- United States and Britain previously launched military operation with airstrikes on Houthi military sites\n- Houthis escalated attacks on commercial and military vessels from the United States and Britain in the Red Sea and the Gulf of Aden"}, {"id": "3e90bedc-4382-4e8f-a743-fbbba6c34c9f", "title": "Russian missiles hit Ukraine Odesa for the third time in a week , injuring 14 – Winnipeg Free Press", "date": "2024-05-02 10:15", "url": "https://www.winnipegfreepress.com/world/2024/05/02/russian-missiles-hit-ukraines-odesa-for-the-third-time-in-a-week-injuring-14", "message": "KYIV, Ukraine (AP) — Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine’s biggest private delivery company, Nova Poshta.\nIn this photo provided by the Ukrainian Emergency Service, emergency services personnel work to extinguish a fire following a Russian attack in Odesa, Ukraine, Wednesday, May 1, 2024.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "ODESA", "classification": "security", "score": 0.6904642536684017, "event_breakdown": "- Russia struck the southern Ukrainian port city of Odesa with ballistic missiles, injuring 14 people and starting a massive blaze\n- The attack targeted a sorting depot belonging to Ukraine’s biggest private delivery company, Nova Poshta\n- Ukrainian emergency services personnel worked to extinguish the fire following the Russian attack in Odesa\n- Ukraine deployed increasingly sophisticated long-range drones to target Russian soil, focusing on infrastructure supporting the Russian economy and war effort\n- Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov, and Belgorod regions according to the Russian Defense Ministry"}, {"id": "e0da44a0-3569-43a2-885b-6019de07d9ba", "title": "CNN gets a rare look at the Iranian missiles and drones that hit Israel - LocalNews8 . com", "date": "2024-05-01 22:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/05/01/cnn-gets-a-rare-look-at-the-iranian-missiles-and-drones-that-hit-israel/", "message": "But he’s more than happy to show the missiles and drones Iran used in its first ever attack against Israel launched directly from Iranian soil.\nAt the permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran, dozens of long- and medium-range ballistic missiles stand tall along with cruise missiles and drones.\nIran’s attack on Israel included drones, ballistic missiles and cruise missiles.\n“NATO, The United States and Arab countries of the region wanted to create barriers for our drones, missiles and cruise missiles, but they failed,” Belali says.\nIsrael Defense Forces (IDF) spokesperson Daniel Hagari said that ballistic missiles that reached Israel fell on the airbase and caused only light structural damage.", "location": "Tehran", "classification": "security", "score": 0.7751195832775303, "event_breakdown": "- Display of missiles and drones used by Iran in its first-ever attack against Israel, showcased at the Revolutionary Guard Aerospace Forces exhibit in western Tehran.\n- The exhibit features dozens of long- and medium-range ballistic missiles, cruise missiles, and drones.\n- Iran's attack on Israel involved drones, ballistic missiles, and cruise missiles.\n- Belali, a spokesperson, claims that attempts by NATO, the United States, and Arab countries to obstruct Iranian drones, missiles, and cruise missiles were unsuccessful.\n- Iran's first ever attack against Israel using missiles and drones launched from Iranian soil\n- Permanent exhibit of the Revolutionary Guard Aerospace Forces in western Tehran displaying long- and medium-range ballistic missiles, cruise missiles, and drones\n- Iran's attack on Israel with drones, ballistic missiles, and cruise missiles\n- Belali's statement about NATO, the United States, and Arab countries trying to create barriers for Iranian drones, missiles, and cruise missiles\n- Israeli Defense Forces (IDF) spokesperson Daniel Hagari's report on ballistic missiles reaching Israel and causing light structural damage at an airbase"}, {"id": "1c146a6b-4730-4e0c-82ee-e1ec78e3cbba", "title": "Judge dismisses lawsuit over 2019 Pensacola Navy base shooting", "date": "2024-04-30 18:45", "url": "https://www.yahoo.com/news/judge-dismisses-lawsuit-over-2019-174328019.html", "message": "PENSACOLA, Fla. — A Florida judge has dismissed a lawsuit against Saudi Arabia over a 2019 mass shooting at Naval Air Station Pensacola that killed three U.S. service members and wounded several others.\nU.S. District Judge M. Casey Rodgers ruled last month that Saudi Arabia is protected from the lawsuit under the Foreign Sovereign Immunities Act, which limits court actions against foreign governments.\nCameron Walters, Joshua Watson and Mohammed Haitham, all Navy service members, were shot and killed in the Dec. 6 2019 attack.\nAl-Shamrani was a Saudi Air Force officer who was training at the Pensacola base.\nThe lawsuit contended that Saudi Arabia bore responsibility for the shooting because the kingdom allegedly condoned Al-Shamrani’s jihadist radicalization.", "location": "PENSACOLA", "classification": "security", "score": 0.896283647586733, "event_breakdown": "- U.S. District Judge M. Casey Rodgers dismisses a lawsuit against Saudi Arabia over a 2019 mass shooting at Naval Air Station Pensacola.\n- The shooting killed three U.S. service members: Cameron Walters, Joshua Watson, and Mohammed Haitham.\n- The lawsuit claimed Saudi Arabia bore responsibility for the shooting due to alleged condoning of the shooter's jihadist radicalization.\n- Saudi Arabia is protected from the lawsuit under the Foreign Sovereign Immunities Act, ruled Judge Rodgers."}, {"id": "6e17d542-a46b-47bf-8e91-f4dcf119f373", "title": "Judge dismisses lawsuit over 2019 Pensacola Navy base shooting", "date": "2024-04-30 20:45", "url": "https://www.militarytimes.com/news/your-navy/2024/04/30/judge-dismisses-lawsuit-over-2019-pensacola-navy-base-shooting/", "message": "PENSACOLA, Fla. — A Florida judge has dismissed a lawsuit against Saudi Arabia over a 2019 mass shooting at Naval Air Station Pensacola that killed three U.S. service members and wounded several others.\nU.S. District Judge M. Casey Rodgers ruled last month that Saudi Arabia is protected from the lawsuit under the Foreign Sovereign Immunities Act, which limits court actions against foreign governments.\nCameron Walters, Joshua Watson and Mohammed Haitham, all Navy service members, were shot and killed in the Dec. 6 2019 attack.\nAl-Shamrani was a Saudi Air Force officer who was training at the Pensacola base.\nThe lawsuit contended that Saudi Arabia bore responsibility for the shooting because the kingdom allegedly condoned Al-Shamrani’s jihadist radicalization.", "location": "PENSACOLA, Fla.", "classification": "security", "score": 0.896283647586733, "event_breakdown": "- Location: Pensacola, Florida\n- Event: Dismissal of lawsuit against Saudi Arabia over 2019 mass shooting at Naval Air Station Pensacola\n- Victims: Cameron Walters, Joshua Watson, Mohammed Haitham (all Navy service members)\n- Attacker: Al-Shamrani, a Saudi Air Force officer training at the Pensacola base\n- Lawsuit claiming Saudi Arabia's responsibility for the shooting due to alleged condoning of Al-Shamrani's jihadist radicalization"}, {"id": "9950951a-dabd-4593-b559-1841ddaa179c", "title": "Russian missile attack injures 14 in Odesa", "date": "2024-05-02 06:30", "url": "https://www.voanews.com/a/russian-missile-attack-injures-14-in-odesa/7594669.html", "message": "Ukrainian officials said a Russian missile attack injured 14 people Thursday at a postal facility in the southern city of Odesa.\nOleh Kiper, the regional governor of Odesa, said the latest attack was another crime committed by Russia against Ukrainian civilians.\nIn Smolensk, the regional governor, Vasily Anokhin, said the Ukrainian drones tried to attack an energy facility.\nRoman Staravoit, the governor in the Kursk region, said Russian forces downed a Ukrainian drone there, but that there was also damage to power lines.\nAdditionally, Russian forces have used grenades loaded with CS and CN tear gasses, according to the Ukrainian military.", "location": "Odesa", "classification": "security", "score": 0.8121557017618638, "event_breakdown": "- Russian missile attack injured 14 people at a postal facility in Odesa\n- Ukrainian drones tried to attack an energy facility in Smolensk\n- Russian forces downed a Ukrainian drone in the Kursk region, causing damage to power lines\n- Russian forces used grenades loaded with CS and CN tear gasses"}]