[{"id": "ee798848-724e-4b93-b8dc-59f71ac39a52", "title": "NYC University Enabling and Encouraging Anti - Israel Boycotts and Activities | The Jewish Press - JewishPress . com | Ronn Torossian | 15 Iyyar 5784 – Wednesday , May 22 , 2024", "date": "2024-05-23 00:45", "url": "https://www.jewishpress.com/indepth/opinions/nyc-university-enabling-and-encouraging-anti-israel-boycotts-and-activities/2024/05/22/", "message": "The purest of Anti-Semitism, a boycott of the Jewish state is being proposed from a major NY University.\nAs politicians are silent, one wonders why are trustees encouraging and supporting these decisions.\nThe board of Trustees of Universities are the bosses of these schools and responsible for decision.\nWhen reached for comment, Mr. Gural refused to condemn New School’s proposed boycott of Israel, Anti-Semitism on campus and violent language on campus.\nFranci J. Blassberg is yet another New School board member, she also serves at one of the world’s leading law firms, Debevoise & Plimpton.", "location": "New York, NY", "classification": "antisemitism", "score": 0.9389443310470236, "event_breakdown": "* A boycott of the Jewish state is being proposed from a major NY University - New School.\n* Anti-Semitism on campus.\n* Violent language on campus."}, {"id": "f3e3671e-02c1-4504-8d64-a14070a1585d", "title": "From The River . . . To The Yearbook | Jane The Actuary", "date": "2024-05-23 08:15", "url": "https://www.patheos.com/blogs/janetheactuary/2024/05/from-the-river-to-the-yearbook.html", "message": "One sign reads “from the river to the sea” written across, with Arabic text underneath reiterating the latter.\nFor Palestinians and their allies, the slogan “from the river to the sea” is a call for peace and equality after 75 years of Israeli statehood and decadeslong, open-ended Israeli military rule over millions of Palestinians, according to The Associated Press.\nAccording to Avi Gordon, executive director of Alums for Campus Fairness, he and other pro-Israeli community members believe the term “from the river to the sea” is an anti-semitic charge.\n“That chant calls for the dismantling of Israel from the Jordan River in the east to the Mediterranean Sea in the West,” Gordon said.\nShe joined the Tribune as a suburban reporter and has previously worked for NBC Sports, WGN-TV and Boston 25 News.", "location": "Based on the provided text, I was not able to determine a specific location for the main event.", "classification": "antisemitism", "score": 0.6084837220047523, "event_breakdown": "* Arabic text written alongside sign reading “from the river to the sea”\n  * Call for peace, equality after 75 years of Israeli statehood"}, {"id": "22c47638-ca7a-4d23-b223-28650caa6f9e", "title": "Dalla largest Shabbat dinner unites – White Rock Lake Weekly", "date": "2024-05-23 05:30", "url": "https://whiterocklakeweekly.com/dallas-largest-shabbat-dinner-unites/", "message": "In an inspiring response to the recent upheaval in Israel and a global rise in antisemitism, more than 500 young Jewish professionals gathered for Dallas’ largest Shabbat dinner.\nThe event, organized by The InTown Chabad Dallas, was a powerful evening of unity, heritage and resilience at Griggs Park.\nThis Shabbat, we stood together, not just in defiance of hatred, but in celebration of our rich and vibrant heritage.”The event commenced with Shabbat candle lighting, followed by a heartfelt prayer for the hostages still in Hamas captivity.\nHighlighting the evening was a personal account from an IDF soldier who has served on the frontlines, sharing his experiences and the strength found in unity.\nThe evening program began with candle lighting, a prayer service and speeches from young adult leaders followed by a traditional Shabbat dinner and presentations.", "location": "DALLAS", "classification": "antisemitism", "score": 0.8777911386200601, "event_breakdown": "- Jews worldwide face antisemitism\n- More than 500 Jewish professionals gathered in Dallas for the largest Shabbat dinner\n- The event, organized by The InTown Chabad Dallas, was a powerful evening of unity and resilience.\n- Highlighted by a moving personal account from an IDF soldier who has served on the frontlines, sharing their experiences."}, {"id": "3a7b2186-daf4-4f55-809f-b9af76778cf2", "title": "Ari Emanuel Accepts Simon Wiesenthal Center Honor , Slams Netanyahu", "date": "2024-05-23 06:45", "url": "https://www.hollywoodreporter.com/movies/movie-news/ari-emanuel-accepts-simon-wiesenthal-center-honor-1235906198/", "message": "Emanuel, who is Jewish, then went on to slam, at length, Israeli prime minister Benjamin Netanyahu for his handling of the Israel-Gaza war.\nAnd it’s become clear that getting to a political solution and Netanyahu remaining in power are irreconcilable paths… Netanyahu is tarnishing a legacy that doesn’t belong to him.\nAs he said, in the absence of a plan, “only two negative options remain”: Hamas rules Gaza or the Israeli military rules Gaza.\nFor two decades, he has divided Jews in Israel and around the world to stay in power as long as possible.\nAnd it’s become clear that getting to a political solution and Netanyahu remaining in power are irreconcilable paths.", "location": "Israel", "classification": "antisemitism", "score": 0.44608526944612725, "event_breakdown": "List of Anti-Semitism events:\n- Chicago Mayor, who is a Jew, went on criticized Israeli Prime Minister for his handling of the Israel-Gaza war.\n- Chicago Mayor said Netanyahu is tarnishing a legacy that doesn't belong to him.\n- Chicago Mayor said Netanyahu divided Jews in Israel and around the world to stay in power as long as possible."}, {"id": "ad8e7011-fff2-4ddf-a206-142d96770f1b", "title": "Ari Emanuel Rips Israeli Leader In Fiery Speech :  Time For Bibi Netanyahu To Go  ", "date": "2024-05-23 05:45", "url": "https://deadline.com/2024/05/ari-emanuel-netanyahu-must-go-1235927987/", "message": "Ari Emanuel tonight left no ambiguity of what he thinks about Benjamin Netanyahu.\nIt is not a time to stay silent,” Emanuel said to the packed Beverly Wilshire ballroom.\nThis is a painful and crucial moment for all of us who are Jews and who love Israel.\nAs he said, in the absence of a plan, “only two negative options remain”: Hamas rules Gaza or the Israeli military rules Gaza.\nFor two decades, he has divided Jews in Israel and around the world to stay in power as long as possible.", "location": "Beverly Wilshire", "classification": "antisemitism", "score": 0.5850891569667879, "event_breakdown": "List of antisemitism events from the text:\n\n1. Ari Emanuel attacked Benjamin Netanyahu's political actions in Israel, accusing Netanyahu of dividing Jews and staying in power as long as possible.\n2. Emanuel said that it is not time to stay silent and that it is a regrettable and crucial moment."}, {"id": "6e4688fc-a821-4403-a213-39632827b121", "title": "Deadline", "date": "2024-05-23 05:45", "url": "https://deadline.com/print-article/1235927987/", "message": "It is not a time to stay silent,” Emanuel said to the packed Beverly Wilshire ballroom.\nThis is a painful and crucial moment for all of us who are Jews and who love Israel.\nMy connection to Israel goes back to before I was born and even before the state of Israel was founded.\nAs he said, in the absence of a plan, “only two negative options remain”: Hamas rules Gaza or the Israeli military rules Gaza.\nFor two decades, he has divided Jews in Israel and around the world to stay in power as long as possible.", "location": "BEVERLY WILSHIRE BALLROOM", "classification": "antisemitism", "score": 0.7012753441729497, "event_breakdown": "form\nAntisemitism events from the text:\n- Antisemitism event \"Antisemitism on the rise\": As Emanuel said, in the absence of a plan, “only two negative options remain”: Hamas rules Gaza or the Israeli military rules Gaza.\n- Antisemitism event \"Jewish people are not united\": For two decades, he has divided Jews in Israel and around the world to stay in power as long as possible."}, {"id": "30c6d2a6-c11e-4ed0-8ca4-6caf1bdf7d2b", "title": "Oporto Community Creates Film on Portugal Genocide of Jews | The Jewish Press - JewishPress . com | Hana Levi Julian | 15 Iyyar 5784 – Thursday , May 23 , 2024", "date": "2024-05-23 10:15", "url": "https://www.jewishpress.com/news/global/europe/oporto-community-creates-film-on-portugals-genocide-of-jews/2024/05/23/", "message": "Photo Credit: courtesy, Oporto Jewish CommunityThe Oporto Jewish Community has released its latest project on the anniversary of the creation of the Portuguese Inquisition at an event attended by around a thousand Portuguese schoolchildren.\nAdvertisementA year after being deported to the islands, only 600 children had survived the conditions and wild animals.\n“This dark episode demonstrates the depths that many went to in order to try and defeat and destroy our people,” said Michael Rothwell, the director of the Oporto Jewish Museum which hosted the event.\nThe schoolchildren were given a tour of the Oporto Jewish Museum and the Holocaust Museum to teach them about the history of Jews in Portugal and the antisemitism that they experienced.\n“It is important to show the context of current antisemitism as a continuation of what has gone before.", "location": "Oporto, Portugal", "classification": "antisemitism", "score": 0.9864850599045665, "event_breakdown": "1. Oporto Jewish Community releases a project on the anniversary of the creation of the Portuguese Inquisition.\n2. Oporto Jewish Museum hosts an event that was attended by around a thousand Portuguese schoolchildren.\n3. 600 schoolchildren survived the deportations to the islands after a year.\n4. Jews experienced antisemitism in Portugal."}, {"id": "aa36d945-9eb8-497d-a788-dcfa4b33b526", "title": "Rising Antisemitism in K - 12 Schools Demands National Attention", "date": "2024-05-23 16:45", "url": "https://www.algemeiner.com/2024/05/23/rising-antisemitism-in-k-12-schools-demands-national-attention/", "message": "As I walked through the US Capitol on May 8th — the day of the Congressional hearings on Antisemitism in K-12 schools — I was imbued with a sense of hope.\nSince the appalling terrorist attack against Israel on October 7, reports of antisemitism in K-12 public and independent schools across the country have surged to shocking levels.\nDisciplinary measures that were once seen as fair are now used selectively to target Jewish students, while their aggressors often face no consequences.\nThe hearing was a promising start, yet two hours is scarcely enough to tackle the widespread problem of antisemitism in schools.\nAs it stands, Jewish students and teachers are suffering, students are being indoctrinated, and our educational system is woefully unequipped to address these issues.", "location": "The US Capitol", "classification": "antisemitism", "score": 0.9176642072418336, "event_breakdown": "null"}, {"id": "5af61df3-dd9d-495b-9802-cc54367138e2", "title": "Analysis : why no one knows how to talk about Israel and Gaza", "date": "2024-05-23 17:45", "url": "https://www.broadcastnow.co.uk/broadcast-magazine/analysis-why-no-one-knows-how-to-talk-about-israel-and-gaza/5193897.article", "message": "Eight months on, there are still many questions: how do we talk openly and share strong views about Israel and Palestine?\n“It’ll be a meeting that’s got nothing to do with what’s going on in Israel, and I’ll be preparing myself for it.\nHe feels isolated because he refuses to engage in “ignorant” debates about the war that disparage Israel.\nLucky for him, he quips, in Hollywood, “most people have no spine”, and are happy to sidestep talking about Israel and Palestine altogether.\n“[The Israeli government’s] threats are so frightening, and what has become of us in our behaviour in Gaza is so frightening.", "location": "Based on the context provided, I was unable to determine a specific location for the main event.", "classification": "antisemitism", "score": 0.5793982301744286, "event_breakdown": "Description of antisemitic events:\n\n1. A person in Los Angeles feels pressured into not engaging in debates about Israel and Palestine, fearing reprisal.\n2. After refusing to engage in debates about the war that disparage Israel, the person feels isolated in Hollywood."}, {"id": "2f964d24-10c4-4360-b8d3-1ace68dbefbb", "title": "Analysis : why no one knows how to talk about Israel and Gaza", "date": "2024-05-23 17:45", "url": "https://www.broadcastnow.co.uk:443/broadcast-magazine/analysis-why-no-one-knows-how-to-talk-about-israel-and-gaza/5193897.article", "message": "Eight months on, there are still many questions: how do we talk openly and share strong views about Israel and Palestine?\n“It’ll be a meeting that’s got nothing to do with what’s going on in Israel, and I’ll be preparing myself for it.\nHe feels isolated because he refuses to engage in “ignorant” debates about the war that disparage Israel.\nLucky for him, he quips, in Hollywood, “most people have no spine”, and are happy to sidestep talking about Israel and Palestine altogether.\n“[The Israeli government’s] threats are so frightening, and what has become of us in our behaviour in Gaza is so frightening.", "location": "The main event is in Israel", "classification": "antisemitism", "score": 0.5793982301744286, "event_breakdown": "Here are a list of antisemitism events related to this discussion:\n\n- antisemitic events at Del Amo mall\n- antisemitic events in Orange County\n- Antisemitic events in a small street\n- Threats from Israeli goverment"}, {"id": "80d0b874-4412-48e2-9257-1d181264b8ab", "title": "US University leaders slammed over campus antisemitism", "date": "2024-05-23 22:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-802443", "message": "Rutgers President Jonathan Holloway, Northwestern President Michael Schill, and UCLA Chancellor Gene Block faced more than three hours of intense scrutiny in the Committee’s sixth event held on the responses of schools to antisemitism.\nEach of you refused to enforce your own rules, preserve campus safety, and protect Jewish students,” committee chair Rep. Virginia Foxx (R-North Carolina, 5th District) said in her opening remarks.\nOn Wednesday ahead of the Capitol Hill hearing, hundreds of Jewish Rutgers University staff and students released letters describing their school as an intimidating campus environment for Jews.\nChicago’s Jewish Federation condemned the agreement, saying: “The overwhelming majority of your Jewish students, faculty, staff, and alumni feel betrayed.\n“Let me tell you why you earned an F.”The representative questioned the university president on allegations of Jewish students being verbally and physically assaulted.", "location": "Based on the context provided, it was not possible to determine the specific location of the event described.", "classification": "antisemitism", "score": 0.9704931896337263, "event_breakdown": ".\n* More than 100 Jewish students, scholars, and staff complain to Rutgers president Holloway of being verbally harassed for their religion.\n* Three hundred Rutgers University staff and students describe antisemitic acts and the president of the university as doing too little.\n* A verbal and physical assault on Jewish students in campus.\n* Representatives of Michigan charge Northwestern University President Michael Schill, along with Rutgers President Jonathan Holloway and Chancellor Gene Block with failing to enforce their own rules, ruining campus safety, and protecting Jewish students.\n* Chicago Jews are receiving support from the congress."}, {"id": "fe42707b-a207-411c-bcf8-b7b5813ea642", "title": "Oporto Jewish community releases new educational project on Inquisition anniversary", "date": "2024-05-23 20:15", "url": "https://www.israelnationalnews.com/news/390459", "message": "The Oporto Jewish Community has released its latest project on the anniversary of the creation of the Portuguese Inquisition at an event attended by around a thousand Portuguese schoolchildren.\n“This dark episode demonstrates the depths that many went to in order to try and defeat and destroy our people,” said Michael Rothwell, the director of the Oporto Jewish Museum which hosted the event.\n“We are once again living in a dark time when the Jewish People are under attack around the world.\nThe schoolchildren were given a tour of the Oporto Jewish Museum and the Holocaust Museum to teach them about the history of Jews in Portugal and the Antisemitism that they experienced.\nIt is important to show the context of current Antisemitism as a continuation of what has gone before.", "location": "Oporto", "classification": "antisemitism", "score": 0.9834948944863314, "event_breakdown": "1. Children of Portugal were taken to the Oporto Jewish Museum and the Holocaust Museum to learn about the dark past when the Jews in Portugal were attacked.\n2. This event was held to teach children about the anti-Semitism that the Jewish population had endured in the past."}, {"id": "e9d807de-cae0-4811-bc87-115619fe7e4b", "title": "Eric Adams , NYC Mayor , joining Jerusalem Post Conference", "date": "2024-05-23 22:15", "url": "https://www.jpost.com/conferences/article-802399", "message": "New York Mayor Eric Adams will participate in the much-anticipated Jerusalem Post Annual Conference in New York City amid rising tensions surrounding the Israel-Hamas war in the city.\nA dedicated public servant, Mayor Eric Adams was elected as the 110th mayor of New York City in 2021.\nAs mayor, he continues to champion the city's diverse communities and is a vocal supporter of the Jewish community and Israel.\nThis year's gathering is expected to attract diplomats, politicians, and business leaders, with Mayor Adams being one of the most fascinating faces.\nNew York City has the largest Jewish population outside of Israel, and Mayor Adams has consistently expressed his solidarity with the community.", "location": ")\nThe main event takes place in New York City.", "classification": "antisemitism", "score": 0.46452761610012033, "event_breakdown": ".\n* New York City has the largest Jewish population outside of Israel."}, {"id": "8f3387cb-fe91-4633-b410-e0c4c878a043", "title": "Israel Jewish humor show offers a serious message for a dark time : We will survive", "date": "2024-05-23 21:45", "url": "https://www.jta.org/2024/05/23/culture/israels-jewish-humor-show-offers-a-serious-message-for-a-dark-time-we-will-survive", "message": "(JTA) — Israelis have long taken pride in two things: the long arc of Jewish history, and their relentlessly dark humor in the face of unspeakable tragedy.\nNearly every sketch in the show satirizes an event from millennia’s worth of Jewish and Israeli religious texts and history.\nThis week, we got our answer: In unprecedented times, “The Jews Are Coming” did something unprecedented: It got serious.\nIts premiere a decade ago was delayed for months after a promo clip satirizing right-wing extremist murderers from Israeli history drew charges of political bias.\nAnd decide what kind of generation you want to be: a generation that destroys or a generation that builds.", "location": "Jerusalem", "classification": "antisemitism", "score": 0.6584031655004812, "event_breakdown": "1. Israeli sketch comedy show “The Jews Are Coming” satirizes antisemitic events from Jewish and Israeli history - May 9, 2022\n2. The promo clip satirizing right-wing extremist murderers from Israeli history draws charges of political bias - January 2012\n3. “The Jews Are Coming” does something unprecedented: It got serious - May 9, 2022"}]