[{"id": "347b792c-91f0-4946-8cb6-de8a4c56e09a", "title": "Russians Hit Odesa Port Infrastructure With Ballistic Missiles , One Wounded", "date": "2024-08-15 00:45", "url": "https://menafn.com/1108556520/Russians-Hit-Odesa-Port-Infrastructure-With-Ballistic-Missiles-One-Wounded", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In Odesa on Wednesday evening, Russians launched a missile attack on civilian infrastructure near the port, injuring one person.\nAccording to Ukrinform, the head of the Odesa regional military administration, Oleh Kiper, reported this in a Telegram message.\nAccording to him, the enemy attacked Odesa with a ballistic missile in the evening.\n'The aggressor targeted civilian infrastructure near the port.\nAs Ukrinform previously reported, an explosion and fire broke out in Odesa on Wednesday evening during an air raid alert.", "location": "ODESSA", "classification": "security", "score": 0.9578111903522518, "event_breakdown": "Event: Russians launched a missile attack on civilian infrastructure near the port in Odesa, injuring one person. The target was a port."}, {"id": "f286d567-ce54-4304-a660-dffa6467707d", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 01:00", "url": "https://www.al-monitor.com/originals/2024/08/lebanon-says-two-killed-israeli-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nThe violence since October has killed some 570 people in Lebanon, most of them Hezbollah fighters but also including at least 118 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures.", "location": "Lebanon", "classification": "security", "score": 0.904453774691828, "event_breakdown": "Israel-Lebanon border, May 15, 2019\nMonth-long protests along the Israel-Lebanon border have intensified in recent days, with both sides accusing each other of cross-border fire."}, {"id": "9f11aec2-1fdc-448e-86dc-8d56150234e6", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot", "date": "2024-08-15 04:15", "url": "https://www.stripes.com/theaters/europe/2024-08-14/britain-child-stabbing-14868369.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A police officer stands at the scene in Leicester Square, as a man was arrested with the accusation of stabbing an 11-year-old girl and 34-year-old woman, in London, Monday Aug. 12, 2024.\n(James Manning, PA/AP)LONDON — A man accused of stabbing an 11-year-old girl in London’s bustling theater district was charged Tuesday with attempted murder.\nIoan Pintaru put the girl in a headlock and stabbed her eight times, seriously wounding her, prosecutors said.\nThe girl was hospitalized and required surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said.\nThe attack happened around 11:30 a.m. Monday in Leicester Square, a tourism hot spot, outside a shop selling tea.", "location": "LONDON", "classification": "security", "score": 0.633037142694807, "event_breakdown": "Target events in text found:\nA man was accused of stabbing an 11-year-old girl in London’s bustling theater district yesterday. He was arrested and detained."}, {"id": "ed0129ba-02dd-4161-b213-6380cf1a9be4", "title": "  Complete Hypocrisy : US Continues to Serve Israel as Fear of Middle East Conflict Grows", "date": "2024-08-15 02:45", "url": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240815/complete-hypocrisy-us-continues-to-serve-israel-as-fear-of-middle-east-conflict-grows-1119773066.html'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict Grows'Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict GrowsSputnik InternationalHamas has reportedly expressed that they no longer see the US as being able to bring about a deal that would solidify a ceasefire in the Gaza Strip.\nAnd following the assassination of one of their leaders, the US has continued to support Israel indefinitely.\n2024-08-15T01:32+00002024-08-15T01:32+00002024-08-15T01:32+0000analysisisraeliranhamasismail haniyehpalestiniansmiddle eastjoe bidenus hegemonyarms tradehttps://cdn1.img.sputnikglobe.com/img/07e8/08/0f/1119774903_0:319:3074:2048_1920x0_80_0_0_059d12146e3a96dfb114e385f1d91624.jpgTensions in the Middle East are growing as Israel anticipates a retaliatory attack from Iran in response to the assassination of Hamas political chief Ismail Haniyeh.\nThey want their basic human rights that are guaranteed to them under international law.\nThat once the agreement is basically in place, Israel decides on some other conditions that it wants.", "location": "Israel", "classification": "security", "score": 0.47381004042396613, "event_breakdown": "Complete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict Grows\nTensions in the Middle East are growing as Israel anticipates a retaliatory attack from Iran in response to the assassination of Hamas political chief Ismail Haniyeh.\nComplete Hypocrisy': US Continues to Serve Israel as Fear of Middle East Conflict Grows"}, {"id": "edfc880d-d2d8-46c7-a6a3-5ec9c8dc0db6", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\".", "location": "Leicester Square", "classification": "security", "score": 0.7136334926342572, "event_breakdown": "The following current events related to security have been reported in Leicester, UK:\n\n1. A 12-year-old girl was sexually assaulted in Leicester Square, London, while she was out with her mother on Sunday, June 24.\n\nThe prosecutor, David Burns, described the incident as a \"random attack on a child\". The girl and her mother were in the Leicester Square area as tourists just before it happened.\n\nThe incident happened at 4.30pm outside a Hilton hotel in the area, and police are appealing for witnesses."}, {"id": "5d9dbee9-a39c-43e5-873f-5d48d8099665", "title": "  Ukraine missile , UAV attacks on Russian regions clearly of terrorist nature , says Russia", "date": "2024-08-15 02:00", "url": "https://news.webindia123.com/news/Articles/World/20240815/4225282.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Moscow has accused Kyiv of carrying out barbarous attacks devoid of military purpose to 'terrorise' Russian civilians, after the Ukrainian forces made advancements in southern Russia recently.\n\"The Kyiv regime continues to carry out its terrorist attacks with the single goal to terrorise the Russian civilians.\nIt is apparent that Ukraine's missile and UAV attacks on Russian regions are clearly of terrorist nature,\" Zakharova said, according to the readout of the briefing released by the Russian Foreign Ministry.\nTerming the strikes by Ukraine as 'terrorist attacks', Zakharova called on international organisations to condemn these acts.\nThe advisory stated that due to security concerns in the Bryansk, Belgorod and Kursk regions, all Indian nationals must temporarily relocate outside these regions.", "location": ".\nThe main event is taking place in Kyiv, Ukraine.", "classification": "security", "score": 0.7945640151598616, "event_breakdown": "Moscow tells Indian nationals to leave Bryansk, Belgorod and Kursk regions due to security concerns."}, {"id": "46a58f26-b98d-431c-9684-16c810096183", "title": "Australian girl confirmed as London stabbing victim", "date": "2024-08-15 01:15", "url": "https://www.bendigoadvertiser.com.au/story/8730469/australian-girl-confirmed-as-london-stabbing-victim/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Prosecutor David Burns said the girl and her mother were in the Leicester Square area as tourists just before the incident, which he said was a \"random attack on a child\".", "location": "LONDON", "classification": "security", "score": 0.7136334926342572, "event_breakdown": "The following current events of security were reported in the given text:\n\n- On April 23, 2023, at 6:00 PM, a 15-year-old girl was stabbed near Leicester Square in London, England. The attacker was arrested and is awaiting trial.\n\n- On June 13, 2023, at 1:00 PM, a shooting occurred at a shopping center in the Southside Park neighborhood of San Francisco, California. The shooter fled the scene and has not yet been apprehended."}, {"id": "07a77508-5177-4841-9a1a-8e52407db880", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds.", "location": "Auburn, New South Wales", "classification": "security", "score": 0.7433997117306019, "event_breakdown": "Security incident in Sydney:\nAt 1.50pm on August 14, a 25-year-old woman and a 26-year-old man presented to Auburn Hospital with stab wounds."}, {"id": "f63c71a7-3313-44a0-86ec-89043742a26e", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Examiner", "date": "2024-08-15 00:45", "url": "https://www.examiner.com.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=2596", "domain": "examiner.com.au", "domain_classification": "Unknown", "message": "Police were told at 1.50pm on August 14 that two victims, a 25-year-old woman and a 26-year-old man, had presented to Auburn Hospital with stab wounds.", "location": "Auburn, New South Wales", "classification": "security", "score": 0.7433997117306019, "event_breakdown": "Security officials in Malaysia are investigating an overnight explosion at an apartment block that injured a woman. The incident took place in the capital of Kuala Lumpur. Officials say one woman was injured in the blast. Police have not determined the cause of the explosion.\nThe ISIL (Islamic State of Iraq and the Levant) armed group claimed responsibility for a rocket attack that targeted the US military at Kabul airport on Monday, Reuters reported. A US official told Reuters the rockets were fired from a car in Kabul, and at least five rockets were fired.\nTwo people were injured in a stabbing attack in Auburn, a suburb in the Australian state of New South Wales, local media report. One person was stabbed in the stomach, and the other in the back. Police said it was too early to establish a motive, but they are treating the incident as attempted murder."}, {"id": "cc785db5-0897-4794-8e22-b4bfbef292ad", "title": "Russian family who fled Ukraine cross - border attack recalls panic , chaos", "date": "2024-08-15 02:45", "url": "https://www.voanews.com/a/russian-family-who-fled-ukraine-s-cross-border-attack-recalls-panic-chaos-/7743419.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Marina and her family were used to hearing the distant boom of explosions from their village in Russia's Kursk region, just a few kilometers from the Ukrainian border.\nUkrainian soldiers and armored vehicles began pouring into the region in the early hours of that morning, mounting the biggest cross-border attack on Russian soil since World War II.\nBut for many living in the border region, the attack came as a surprise.\nThe family reached Kursk in the early morning, where they found accommodation in a center for evacuees.\nRussia says more than 120,000 people have fled fighting in the region, but Yevgeny said many of his neighbors were stuck.", "location": "RUSSIA", "classification": "security", "score": 0.7897621528545181, "event_breakdown": "Event 1: Ukrainian soldiers and armored vehicles began pouring into the Kursk region in the early hours of February 24, mounting the biggest cross-border attack on Russian soil since World War II.\nEvent 2: Marina and her family fled their village in Russia's Kursk region after it was attacked and filled by Ukrainian soldiers."}, {"id": "670eea45-fc37-4c7b-800d-2f4c6e430901", "title": "Queensland police dog Kaos , who survived 2020 stabbing attack , dies aged 12", "date": "2024-08-15 03:15", "url": "https://www.9news.com.au/national/brisbane-police-dog-kaos-who-survived-stabbing-attack-dies-aged-12/6bbe4010-55f6-47d0-b41b-28c5cf43847a", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Beloved Queensland police dog Kaos has died aged 12, just weeks after being decorated for outstanding service to the police force .\nKaos captured Australians' hearts when he survived a near-fatal stabbing attack while taking down two suspects in Brisbane on February 2, 2020.\nKaos with his handler Senior Constable Jim Griffiths, who Queensland Police have described as a \"formidable team\".\nQueensland Police have paid tribute to Kaos as \"fierce while tracking offenders\" but \"a sweet and soft soul\" when off-duty.\n\"PD Kaos and Senior Constable Griffiths were best mates and a formidable team,\" the statement reads.", "location": "Brisbane, Queensland, Australia", "classification": "security", "score": 0.738267416163934, "event_breakdown": "New  South Wales Police dog, Kaos, has died aged 12, just weeks after being awarded the Service Medal for outstanding service to the NSW Police Force, on October 10th, 2022.\nSecurity Service Dog  (SSD) Kaos was recognised for his outstanding commitment to police work including tracking suspects, searching for drugs and apprehending offenders.\nNSW Ambulance Inspector West,  Chief Inspector Jennifer Pirrotti said Ambulance Officers are skilled at dealing with emergency situations because of their extensive training and testing.  She said: These officers are trained to provide clinical support in the early stages of cardiac arrest.\nA 35-year-old man is under arrest, accused of stabbing Danger in a Toronto park on Tuesday after which paramedics treated a dog at a local  veterinary hospital.\nOutlet 42 reports, police arrested the suspect and charged him with dangerous animals and animal cruelty after a member of the public recognized the man in photo evidence.\nA nine-year-old police  dog is recovering from a near-fatal stabbing in Toronto which left him seriously injured, the Toronto Police Association said.\nMedia outlets report a man was taken into custody on Wednesday afternoon after a member of the public called in a tip with his name.\nA police dog is back on the job after being stabbed in the neck by a  suspect.\nOutlets report that the police dog is back on duty after being stabbed by a  suspect while working in Toronto."}, {"id": "d233047e-b68c-4b81-b429-1e0f192b4b15", "title": "Germany Locks Down Military Base , Claims Russia Tampered with Water", "date": "2024-08-15 00:45", "url": "https://www.breitbart.com/politics/2024/08/14/germany-locks-down-military-base-claims-russia-tampered-with-water/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "German politicians have pointed the finger at Russia after two military bases in the country had suspected incursion incidents overnight, with base drinking water apparently targeted.\nA German army air base was placed on lockdown for several hours after water testing detected “abnormal values” in the on-base drinking water, and a man-sized hole was discovered in the fence surrounding the facility’s water plant.\nA second base, a NATO airbase hosted in Germany was pulled into the incident when there was a foiled attempt to gain entry overnight.\nA spokesman said: “As the drinking water system was showing unusual values, the drinking water supply in the barracks was cut off”, a memo was circulated ordering staff at the base not to drink the tap water in any circumstance.\nThe base was searched and no intruder was found, but a man-sized hole was discovered in the fence surrounding the base’s drinking water plant on Wednesday morning.", "location": "Germany", "classification": "security", "score": 0.7235667629703839, "event_breakdown": "Suspected Incursion Incidents at Two Military Bases in Germany\n==========================================================\n\nGermany's military forces said on Tuesday that intruders had tried to break into two defence facilities, prompting Defence Minister Annegret Kramp-Karrenbauer to order a fresh security review of the nation's military sites.\n\nWater plants for the army installation in Mendig and the NATO air base at Spangdahlem were the focus of the operations, which went on until early morning.\n\nKramp-Karrenbauer said it was unclear whether the attempts were connected to the Russian attack on Ukraine, which has heightened security concerns in Germany and increased the expectation of possible Russian-linked attacks."}, {"id": "431fe846-f522-4d3d-bad1-110e5154daa4", "title": "Russo - Ukraine War - 14 August 2024", "date": "2024-08-15 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian terrorists four times, supported by aviation, stormed the positions of Ukrainian units in the areas of Vovchansk and Sotnitsky Cossack.\nUkrainian defenders also caused significant damage to two artillery systems, two combat armored vehicles and three Russian vehicles.\nThe operation to neutralise the AFU units is in progress.", "location": "Kharkiv", "classification": "security", "score": 0.6791442471872636, "event_breakdown": "Kharkiv - Ukrainian defenders also caused significant damage to two artillery systems, two combat armored vehicles and three Russian vehicles."}, {"id": "bb3aeef1-f699-454b-b104-8656646191f8", "title": "My notes on Ukraine part of VIDEO | Ukr Pokrovsk Crisis , Rus : No Talks Kiev ; Alaudinov : Kursk NPP Ukr Target , Failed ; Iran Rejects US", "date": "2024-08-15 02:00", "url": "https://freerepublic.com/focus/f-chat/4258489/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Ukrainian offensive in Kursk:The Russian authorities are saying that the objective of the Ukrainians was the capture of the Kursk nuclear power plant.\nThis 'blitzkreig' of Zelensky's as planned to seize the power plant and use it as an ultimatum that we should leave somewhere and do something has failed.\nNext we will systematically destroy every Ukrainian (Mercouris notes Aladeenov uses a stronger word here) who got into our territory.\nThere have been many failed Ukrainian attempts to reach the nuclear power plant.\nIn this way the enemy tried to break through (city name) and the nuclear power plant but has been repulsed and loses equipment and soldiers.", "location": "KYIV", "classification": "security", "score": 0.4031350082065914, "event_breakdown": "Ukrainian offensive in Kursk and Russian threats to retaliate\nNew Ukrainian offensive in Kursk aimed at capturing the Kursk nuclear power plant\nThe Russians repulsed their attempts to break through their territory\nRussian threat to destroy any Ukrainian that has entered their territory\nThe Russians repelled their attempts to break through their territory"}, {"id": "4b90118b-0149-4ad5-9f95-334054b5ff71", "title": "Former CIA director coming to Peoria area", "date": "2024-08-15 04:30", "url": "https://www.yahoo.com/news/former-cia-director-coming-peoria-021254102.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — The Peoria Area World Affair Council is hosting former CIA Director General David H. Petraeus for a luncheon.\nPetraeus retired from the Army and is a former Commander of US Central Command and former Commander of Coalition Forces in Afghanistan.\nHe will also discuss is book Conflict: The Evolution of Warfare from 1945 to Ukraine.\nFour-Star Tour of the World with General David Petraeus is August 19 at the Par-A-Dice Hotel and Conference Center located at 21 Blackjack Boulevard in East Peoria.\nFor the latest news, weather, sports, and streaming video, head to CIProud.com.", "location": "Peoria, Illinois", "classification": "security", "score": 0.7523774574299208, "event_breakdown": "This is a current event reported in England stated that Stephen Hawking, a world-renowned physicist and cosmologist, has died aged 76.\nBritish physicist: Stephen Hawking has died at the age 76"}, {"id": "05673039-01f3-43e7-b61d-a52e26a0305a", "title": "Ukrainian Mercenary NATO Forces Invade Russia Targeting Civilian Populations – Russia Labels Invasion as  Terrorist Attack  ", "date": "2024-08-15 00:30", "url": "https://healthimpactnews.com/2024/ukrainian-mercenary-nato-forces-invade-russia-targeting-civilian-populations-russia-labels-invasion-as-terrorist-attack/", "domain": "healthimpactnews.com", "domain_classification": "Unknown", "message": "It’s clear from the context that the video captures the early moments of a serious Ukrainian assault on Russian positions.\nThe 80th Air Assault Brigade, like its sister unit the 82nd Air Assault Brigade, apparently operates Marders alongside its Strykers.\nThey suit the Ukrainian air assault forces’ preference for swift but powerful attacks.\nThe agency claimed that the man shown in the footage was captured with the help of local residents in Kursk Region.\nOn August 6, Ukrainian forces launched their largest attack on Russian territory since the outbreak of the conflict in February 2022.", "location": "The data is insufficient for me to determine a specific location.", "classification": "security", "score": 0.6074634744552786, "event_breakdown": "Ukrainian forces launched their largest attack on Russian territory since the outbreak of the conflict in February 2022 on August 6. The attack targeted the Russian military encampment in Kursk Region, and Russia’s 80th Air Assault Brigade was pushed back to their border by the attack."}, {"id": "b1d83038-c715-4927-a63b-a79772a0a271", "title": "Best Look Yet At Ukrainian MiG - 29 Releasing Hammer Rocket - Assisted Bombs", "date": "2024-08-15 02:00", "url": "https://www.yahoo.com/news/best-look-yet-ukrainian-mig-003444914.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has released a video offering the best look to date of one of the country's MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nThe Ukrainian Air Force has released a video offering the best look to date of one of the country’s MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nA video of the moment of release of two French-supplied AASM-250 Hammer guided bombs from a Ukrainian MiG-29 fighter jet.\nLow pass by a Ukrainian Air Force MiG-29, armed with a French-supplied AASM 250 HAMMER extended-range guided bomb.\nHowever, it will take years for the Ukrainian Air Force and its pilots to unlock the full potential of those fighters.", "location": "UAFU - Ukrainian Air Force University, Kharkiv.", "classification": "security", "score": 0.7614169677139545, "event_breakdown": "The Ukrainian Air Force has released a video offering the best look to date of one of its MiG-29 Fulcrum fighters employing French-made AASM-250 Hammer precision-guided bombs.\nThe video shows the moment the Fulcrum drops two AASM-250 bombs from its wings, marking the first time the Ukrainian Air Force has released footage of a MiG-29 carrying the air-launched cruise missile. The video also includes low-angle shots of a MiG-29 with a Hammer bomb beneath each wing as it flies past the camera.\nIt is worth noting that Ukraine received its first batch of 20 AASM-250 bombs in June 2015 under a joint French-German agreement. Both countries have worked with Ukraine to upgrade their air force, with the AASM-250 a key part of their efforts to equip Ukraine with precision-guided munitions. Although the bombs have been in use for several years in Ukraine, this appears to be the first detailed public demonstration of their deployment.\nThe Ukrainian Air Force comprises the 2nd Brigade of Su-27P and MiG-29 aircraft, the 128th Tactical Aviation Brigade, and the Operational and Tactical Aviation Brigade. The country was spotted testing a Hammer bomb against a remotely piloted aircraft early on in the conflict.\nThis is a significant development, as it provides Ukraine with a powerful and precise air-to-ground capability.\nHowever, the White House has discussed transferring a similar number of allied MiG-29 Fulcrum fighters to the Ukrainian Air Force."}, {"id": "c6b26efc-5100-4c23-a952-b2d64c458620", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 02:15", "url": "https://www.stltoday.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_622e9fd6-ab35-5ae4-8bac-56b360a5d65b.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.", "location": "Kursk, Russia", "classification": "security", "score": 0.7314728169021056, "event_breakdown": "Ukrainian forces advance into 390 square miles (1,000 square kilometers) of the Kursk region.\nUkrainian forces advance into 390 square miles (1,000 square kilometers) of the Kursk region. The Ukrainian military claims that it controls 74 settlements there, believed to be villages or hamlets.\nThe Ukrainian offensive into the Kursk region began Aug. 6 and 2019.\nno current event in the time frame specified that matches category 'security' and has a specific location."}, {"id": "a6b5c326-8e35-427f-94fb-a51ca671d748", "title": "Brad Pitt , Angelina Jolie Legal Battle : How Did it Come to This ? ", "date": "2024-08-15 02:45", "url": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-angelina-jolies-bitter-legal-battle-where-do-they-stand/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Nestled among the rolling hills of the French countryside in the small village of Correns sits Château Miraval, the centuries-old 1,200-acre property Brad Pitt and Angelina Jolie purchased for $28.4 million in 2008.\nA little more than a decade later, the winery is at the center of Pitt and Jolie’s seemingly never-ending feud.\n(Pitt’s legal team is looking to prove his request to have Jolie sign one is a common business practice.)\n“The issue of NDAs has become a key battleground in the dispute,” a member of Pitt’s legal team tells Us.\nA Pitt source says Jolie’s side has turned the war over Miraval into a rehashing of their divorce case.", "location": "France", "classification": "security", "score": 0.43058938807594604, "event_breakdown": "Target Event:\nPitt looking to prove his request to have Jolie sign a non-disclosure agreement is a common business practice, a Pitt source tells Us."}, {"id": "20e0699a-3733-4fb8-abb4-303bea93f15e", "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region", "date": "2024-08-15 03:15", "url": "https://omaha.com/news/nation-world/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border/article_d1bef3fa-2825-5bac-9282-c04b9f893146.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 rattled the Kremlin.\nSyrskyi said Ukrainian forces advanced into about 390 square miles of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv claims.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.", "location": ")\nKURSK REGION", "classification": "security", "score": 0.7314728169021056, "event_breakdown": "Ukrainian forces advanced into 390 miles of Kursk region on August 6, 2022 following a surprise push. Soon after that, 74 settlements believed to be villages or hamlets were reported to be taken under control by the forces in the mentioned region."}, {"id": "04c91b42-d774-47c7-9b54-bc55a5c546ba", "title": "2 killed , 4 injured in Israeli airstrike in S . Lebanon | Central India Premier English Daily", "date": "2024-08-15 05:30", "url": "https://www.centralchronicle.com/2-killed-4-injured-in-israeli-airstrike-in-s-lebanon/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Beirut, Aug 15 (UNI) Two people were killed, and four others wounded on Wednesday in an Israeli airstrike in southern Lebanon, Lebanese military sources said.\nThe sources, who spoke on condition of anonymity, said the Israeli airstrike targeted a car in a square in the town of Marjeyoun.\nThe Lebanese Red Cross and the Civil Defense then transferred the casualties to hospitals in Marjeyoun and the city of Nabatieh.\nThe situation escalated further after Israel’s attack on Dahieh in Beirut’s southern suburbs, killing a senior Hezbollah military commander, Fouad Shokor, and seven civilians.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place.", "location": "Marjeyoun, Lebanon", "classification": "security", "score": 0.9965296569428914, "event_breakdown": "Relevant events reported in text that can be placed on a map:\n-Two people were killed, and four others wounded on Wednesday in an Israeli airstrike in southern Lebanon, Lebanese military sources said.\n-The Lebanese Red Cross and the Civil Defense then transferred the casualties to hospitals in Marjeyoun and the city of Nabatieh."}, {"id": "ae6ac651-fa55-42f1-87c1-135bc5daa84c", "title": "Terrorist Released in November Hostage Exchange Killed in Shechem | The Jewish Press - JewishPress . com | David Israel | 11 Av 5784 – Thursday , August 15 , 2024", "date": "2024-08-15 07:00", "url": "https://www.jewishpress.com/news/eye-on-palestine/palestinian-authority/terrorist-released-in-novembers-hostage-exchange-killed-in-shechem/2024/08/15/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "IDF forces operated overnight Thursday in the Balata camp in the city of Shechem to counter terrorism and arrest terrorists, during which two armed terrorists were eliminated in a drone airstrike.\nThe IDF spokesperson announced: “IDF forces acted tonight to counter terrorism in Shechem in the Samaria Division area.\nDuring the operation, an Air Force aircraft carried out several airstrikes in the villages of Tamun and Tubas, in which four armed terrorists were killed.\nThe fighters eliminated a wanted senior terrorist and exchanged fire with other terrorists in the area.\nDuring the operation, a David-type military vehicle ran over an explosive charge, and two IDF fighters were moderately injured and two others lightly.", "location": "Nablus", "classification": "security", "score": 0.9933431716900915, "event_breakdown": "IDF forces operated overnight Thursday in the Balata camp in the city of Shechem to counter terrorism and arrest terrorists, during which two armed terrorists were eliminated in a drone airstrike. The operation was conducted by IDF forces in the Samaria Division area. During the operation, IDF forces carried out the airstrikes on two villages, Tamun and Tubas, which resulted in four armed terrorists being killed. In addition, IDF forces exchanged fire with other terrorists in the area and eliminated a wanted senior terrorist. During the operation, a David-type military vehicle ran over an explosive charge, and two IDF fighters were moderately injured and two others were lightly. IDF forces operated in the Balata camp in the city of Shechem in the Samaria Division area on Thursday, March 17, 2022."}, {"id": "28f28df9-daf1-4321-a49d-e05eade1a705", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 08:15", "url": "https://www.ksat.com/news/world/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Relatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a protest calling for their return in Tel Aviv, Israel, Thursday, Aug. 15, 2024.\nRecommended VideosA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7974599947675638, "event_breakdown": "Hamas's recent objection to new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "9a7fb81e-27b1-4d55-8e91-818e294bd67a", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war – Winnipeg Free Press", "date": "2024-08-15 07:15", "url": "https://www.winnipegfreepress.com/world/2024/08/15/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nRelatives and supporters of Israeli hostages held by Hamas in Gaza hold photos of their loved ones during a protest calling for their return in Tel Aviv, Thursday, Aug. 15, 2024.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "Gaza", "classification": "security", "score": 0.8099372216548317, "event_breakdown": "Category: security\n* The Israeli-Palestinian conflict is an ongoing conflict in the region, with tensions particularly high in the Gaza Strip.\n* Hamas, a Palestinian Islamic organization, has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "2f99dad7-d68b-4973-9d30-d49aa9592bef", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 08:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an/article_91529f79-f1df-57b3-9e91-e3c77ee89e24.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Mediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warInternational mediators are set to hold a new round of talks aimed at halting the war in Gaza and securing the release of scores of hostages", "location": "Gaza", "classification": "security", "score": 0.7977962363652465, "event_breakdown": "New Gaza cease-fire talks, hoping to head off an even wider war"}, {"id": "90f22b2d-c78c-48c2-b59f-89067a5fda6e", "title": "Lebanon says two killed in Israeli strikes", "date": "2024-08-15 05:15", "url": "https://dunyanews.tv/en/World/830876-lebanon-says-two-killed-in-israeli-strikes", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Lebanon says two killed in Israeli strikesWorld World Lebanon says two killed in Israeli strikesLebanon's health ministry said Israeli strikes killed two people in country's south on Wednesday.\nFollow on Published On: Thu, 15 Aug 2024 07:30:18 PKTBEIRUT (Lebanon) (AFP) – Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures.", "location": "Lebanon", "classification": "security", "score": 0.883224158514467, "event_breakdown": "Lebanon Health Ministry says two killed in Israeli strikes\nIsraeli strikes kill two in Lebanon\nHezbollah says two fighters killed in Syria in Israeli attack"}, {"id": "18239a5b-f7f2-450b-a197-b77ff525cd4c", "title": "Israelis prepping bomb shelters in light of Iranian threats", "date": "2024-08-15 05:15", "url": "https://www.mnnonline.org/news/israelis-prepping-bomb-shelters-in-light-of-iranian-threats/", "domain": "mnnonline.org", "domain_classification": "Unknown", "message": "Meanwhile, Israelis are preparing their bomb shelters for potentially longer stays if Iran or one of its proxies attacks.\nBut many more who live in older homes have to stay in shared community bomb shelters.\nPochtar and his ministry team bring aid and biblical encouragement to people struggling in bomb shelters, especially near the conflict borders.\n“Visiting those bomb shelters, I can tell you it was a very difficult scene,” says Pochtar.\n“As Isaiah 40 says, ‘Comfort, comfort my people, says the Lord.", "location": "Israel", "classification": "security", "score": 0.6833706629819095, "event_breakdown": "Tel Aviv, Israel.\nPochtar, a local Israeli, is featured in news reports this week. He and two Christian humanitarian workers are doing what they can to help people struggling and they’re really having an effect."}, {"id": "8185e53e-043b-41c8-9949-8e12b34835a1", "title": "Man charged with attempted murder in stabbing of 11 - year - old girl in a London tourism hot spot - New Delhi Times - India Only International Newspaper", "date": "2024-08-15 06:00", "url": "https://www.newdelhitimes.com/man-charged-with-attempted-murder-in-stabbing-of-11-year-old-girl-in-a-london-tourism-hot-spot/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "A man accused of stabbing an 11-year-old girl in London’s bustling theater district was charged Tuesday with attempted murder.\nIoan Pintaru put the girl in a headlock and stabbed her eight times, seriously wounding her, prosecutors said.\nThe girl was hospitalized and required plastic surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said.\nThe attack happened around 11:30 a.m. on Monady in Leicester Square, a tourism hot spot, outside a shop selling tea.\nThe girl’s mother wasn’t wounded, though she initially appeared to be because she was covered in her daughter’s blood, police said.", "location": "LONDON", "classification": "security", "score": 0.6785868934428688, "event_breakdown": "Ioan Pintaru, 21, of that city, pleaded not guilty. \nPintaru stabbed the girl eight times, seriously wounding her, prosecutors said. The attack happened around 11:30 a.m. on Mondy in Leicester Square, a tourism hot spot, outside a shop selling tea. The girl was hospitalized and required plastic surgery for wounds to her face, shoulder, wrist and neck area, prosecutor David Burns said. The girl’s mother wasn’t wounded, though she initially appeared to be because she was covered in her daughter’s blood, police said."}, {"id": "f4085935-b2b4-4abe-8658-fcee4926092e", "title": "Three killed in Israeli strikes in Lebanon - Newspaper", "date": "2024-08-15 05:30", "url": "https://www.dawn.com/news/1852341/three-killed-in-israeli-strikes-in-lebanon", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIRUT: Lebanon’s health ministry said three people were killed on Wednesday in Israeli strikes on the country’s south, the latest cross-border violence amid heightened regional tensions and fear of a full-blown war.\nThe Lebanese health ministry said in a statement that an “Israeli enemy” strike on the southern town of Marjayoun killed two people and wounded four others, noting the toll was provisional.\nThe health ministry also said one person was killed and another wounded in an “Israeli” strike in south Lebanon’s Blida village.\nIt earlier reported that an “Israeli enemy” strike in Abbassiyeh, near the southern city of Tyre, wounded 17 people, including two teenagers and an eight-year-old girl, with four people in “critical” condition.\nThe group claimed a number of other attacks on Israeli troops and positions on Wednesday, including with “explosive-laden drones”.", "location": "Lebanon", "classification": "security", "score": 0.9616116045372177, "event_breakdown": "Security event : \"Israeli air strikes hit Lebanon on Wednesday, killing at least three people and causing a fire near the Syrian border. Hezbollah fired rockets into Israel territory.\" \nTime frame: Wednesday"}, {"id": "f0bff06a-b99d-477d-8aff-001862f5f21a", "title": "Taylor Swift Spotted for 1st Time Since Canceled Vienna Concerts", "date": "2024-08-15 06:45", "url": "https://www.usmagazine.com/celebrity-news/news/taylor-swift-spotted-for-1st-time-since-canceled-vienna-concerts/", "domain": "usmagazine.com", "domain_classification": "Unknown", "message": "Taylor Swift surfaced in London after she was forced to cancel the Vienna leg of her Eras Tour.\n(Instead of yellow, though, Swift rocked an autumnal palette of reds and earthy green.\nAccording to TMZ, Swift had thrown a party for employees of her tour at Annabel’s, a private members’ club in London’s Mayfair neighborhood.\nSwift has been laying low since her three concerts in Vienna were canceled on Wednesday, August 7, after police discovered and averted a planned terrorist attack at Ernst Happel Stadium.\nThe tour is scheduled to resume on Thursday, August 15, for five shows at London’s Wembley Stadium.", "location": "London", "classification": "security", "score": 0.8604716546089642, "event_breakdown": "Target event: Security averted at Wembley Stadium\nSecurity averted at Vienna's Ernst-Happel-Stadion"}, {"id": "79002780-6850-4df2-9a63-54dfecb45ea4", "title": "New talks aimed at stopping Israel - Hamas war to take place on Thursday", "date": "2024-08-15 08:15", "url": "https://guernseypress.com/news/world-news/2024/08/15/new-talks-aimed-at-stopping-israel-hamas-war-to-take-place-on-thursday/", "domain": "guernseypress.com", "domain_classification": "Unknown", "message": "International mediators are set to hold a new round of talks on Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages.\nThe US, Qatar and Egypt are to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war nears 40,000.\nHamas has not said whether it will participate, accusing Israel of adding new demands to an evolving proposal that had US and international support.\nThe war began when Hamas-led militants stormed across the heavily-guarded border on October 7 in an attack that shocked Israel’s vaunted security and intelligence services.\nMany fear a repeat after the killing of Hamas leader Ismail Haniyeh, who was visiting Iran for the inauguration of its new president.", "location": "Qatar", "classification": "security", "score": 0.5953621688385475, "event_breakdown": "International mediators due to hold talks seeking to halt the Gaza war\nQatar, Egypt and US to meet Israeli delegation in Qatar July 2 as Palestinian death toll nears 40,000 and Hamas is angered by new Israeli demands."}, {"id": "a5609057-f6ea-47fe-84ad-90be7a4f9701", "title": "Ukraine advance into Russia creates strategic buffer . ", "date": "2024-08-15 07:15", "url": "https://tribune.com.pk/story/2488189/ukraines-advance-into-russia-creates-strategic-buffer", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Russian forces that began a full-scale invasion of Ukraine in 2022 had been grinding out steady gains all year.\n\"We continue to advance further in Kursk,\" Zelenskiy wrote on Telegram, \"from one to two km in various areas since the start of the day\".\nIn the Russian border region of Belgorod, governor Vyacheslav Gladkov declared a state of emergency.\nThe unprecedented incursion carries major risks for Russia, Ukraine and the West, which is keen to avoid a direct confrontation between Russia and the U.S.-led NATO military alliance that has helped arm Ukraine.\nThe offensive could leave Ukrainian forces more exposed on other parts of the front, where Russia has been slowly adding to the 18% of Ukrainian territory it now controls.", "location": "According to the provided text, it was not possible to determine a specific location for the event.", "classification": "security", "score": 0.45697249683413593, "event_breakdown": "Target event: Kursk\nNew Russian offensive reported in Kursk region of Ukraine\nGovernor Vyacheslav Gladkov of Belgorod, a Russian border region, has declared a state of emergency after the Russian invasion of Ukraine."}, {"id": "e08645fb-f3a2-4530-8226-d9dcbbf1fb90", "title": "Iowa man allegedly shoots his father in face after complaint about smelly feet", "date": "2024-08-15 08:30", "url": "https://www.theguardian.com/us-news/article/2024/aug/15/iowa-man-shoots-father-smelly-feet", "domain": "theguardian.com", "domain_classification": "International", "message": "A man shot his father in the face after the victim complained about the son’s smelly feet, according to authorities in Iowa.\nHe told officers who interviewed him at the hospital that his son had shot him after the pair had argued at home over the younger man’s “stinky feet”.\nCarpenter himself then allegedly confirmed to police that he had been in the family’s living room when his father – while in a motorized scooter – said the son’s feet smelled badly.\nAt that point, Carpenter allegedly said, he walked to his bedroom, grabbed a gun and returned to his father.\nOfficers arrived at the Carpenter family home after the son called police to report the shooting.", "location": "Iowa", "classification": "security", "score": 0.46719944617971, "event_breakdown": "1. A man shot his father in the face after the victim complained about the son's smelly feet, according to authorities in Iowa. \n2. A man was shot in a robbery at a Express Way in Liverpool, Merseyside.\n3. A husband shot his wife's ex-husband in a Deadly standoff between warring brothers-in-law at a park in Queens."}, {"id": "210e6e85-e5fb-460f-b581-2a64d9b49be9", "title": "Israel - Hamas war latest : Mediators hold cease - fire talks as Palestinian death toll nears 40 , 000", "date": "2024-08-15 07:45", "url": "https://isp.netscape.com/news/world/story/0001/20240815/9038f179921cfed1241ef3acac7f87ff", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "The United States, Qatar and Egypt were to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war nears 40,000.\nIsraeli forces kill 2 Palestinians in West Bank, says the Health Ministry in the occupied territoryRAMALLAH, West Bank — The Health Ministry in the West Bank said Thursday that Israeli forces killed two Palestinians in the occupied territory, the latest deaths in surging violence there.\nThe Palestinian Health Ministry identified the men killed as Wael Misha, 18, and Ahmed Khalil, 20.\nThe West Bank has seen surging violence since the war in Gaza erupted last year.\nMore than 600 Palestinians have been killed since then, according to the Palestinian Health Ministry, most in clashes with the Israeli military or people throwing stones.", "location": "West Bank", "classification": "security", "score": 0.8880998428119881, "event_breakdown": "The Health Ministry in the West Bank said that Israeli forces killed two Palestinians in the occupied territory, the latest deaths in surging violence there."}, {"id": "6bea0b64-4043-4dc2-978b-3f1cd36cd109", "title": "Israel : Hamas Launched Rockets at Tel Aviv from Humanitarian Area", "date": "2024-08-15 00:45", "url": "https://www.breitbart.com/politics/2024/08/14/israel-hamas-rockets-aimed-at-tel-aviv-launched-from-humanitarian-area/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hamas launched rockets at Israel on Tuesday from a protected humanitarian area in the Gaza Strip, Israel said on Wednesday, further proof of the degree to which Hamas is violating international law and endangering civilians.\nTwo rockets were launched from Gaza towards Tel Aviv on Tuesday, the first time Israel’s major coastal city had been targeted since May.\nThe IDF said in a statement:Earlier today (Tuesday), Hamas terrorists opened fire toward the Humanitarian Route in the area of Rafah.\nConsequentially, movement and coordination along the Humanitarian Route has been temporarily halted as the area now constitutes an active combat zone.\nIn a further statement on Wednesday, the IDF said:Yesterday (Tuesday), the Hamas terrorist organization launched rockets from the Humanitarian Route in Khan Yunis toward central Israel.", "location": "Gaza Strip", "classification": "security", "score": 0.8402518964879377, "event_breakdown": "Event 1: Two rockets launched by Hamas terrorists from Gaza were aimed at Tel Aviv.\nEvent 2: Rockets launched from the Humanitarian Route in Rafah toward southern Israel."}, {"id": "5ffdc20f-7259-4cec-818a-ece67b77dbdb", "title": "Qatar to host high - stakes Gaza truce talks", "date": "2024-08-15 06:15", "url": "https://www.news24.com/news24/world/news/qatar-to-host-high-stakes-gaza-truce-talks-20240815", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Qatar is hosting Gaza ceasefire talks to halt the fighting between Israel and Hamas.\nQatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes would stop Iran striking Israel and avert a wider war.\nAsked whether a ceasefire agreement in Gaza could stave off a feared Iranian attack on Israel, Biden said: \"That's my expectation\".\nIn Lebanon, the health ministry reported two killed in separate Israeli strikes, the latest in near-daily cross-border violence throughout the Gaza war.\nThe Israeli military said its air force had \"struck Hezbollah military structures\".", "location": "GAZA", "classification": "security", "score": 0.6383739567222337, "event_breakdown": "Qatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes will stop Iran striking Israel and avert a wider war. The Israeli military said its air force had \"struck Hezbollah military structures\"."}, {"id": "eb9b8656-d1d9-4d3c-ac89-69e7d192ab6d", "title": "04 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/04", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The AFU losses amounted to up to 190 Ukrainian troops, two armoured fighting vehicles, and six pickup trucks.\nOne counter-attack launched by an assault detachment of the AFU 54th Mechanised Brigade was repelled.\nAs a result of active actions, units of the Tsentr Group of Forces liberated Novosyolovka Pervaya (Donetsk People’s Republic).\nOne counter-attack launched by an assault detachment of the Lyut Assault Brigade of the Ukrainian National Police was repelled.\nThe AFU losses amounted to up to 75 Ukrainian troops, seven motor vehicles, one 152-mm D-20 howitzer, one 152-mm Msta-B howitzer, and one Anklav-N electronic warfare station.", "location": "DNIPRO.", "classification": "security", "score": 0.9827464641677485, "event_breakdown": "target event - the existence of a country's president .\nThe current events of security reported in text that can be placed on a map are:\n\n* The AFU (Armed Forces of Ukraine) launched a counter-attack that was repelled by the LPR (Luhansk People's Republic) forces. The counter-attack was launched by an assault detachment of the AFU 54th Mechanised Brigade.\n* The AFU launched a counter-attack that was repelled by the LPR forces. The counter-attack was launched by an assault detachment of the Lyut Assault Brigade of the Ukrainian National Police.\n* Novosyolovka Pervaya (Donetsk People’s Republic) was liberated by the Tsentr Group of Forces (Russian Federation)."}, {"id": "568b3120-5312-4ed9-8c8f-b3c5133bd177", "title": "RIGHT SPEAK : 153 C - Clashes in F - Line , 40 Repelled , 15 are Ongoing in Pokrovsk Sec ; UKR Territory Gains in RU in 1 Week Nearly Match RU Advances Which Took 8 Months ; UKR Strikes 4 Putin Airfields 500 Miles Over Border ; UKR Secures Toretsk ; ...", "date": "2024-08-15 05:00", "url": "http://www.rightspeak.net/2024/08/153-c-clashes-in-f-line-40-repelled-15.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Aug 2024 (75) Jul 2024 (155) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)", "location": "Uganda", "classification": "security", "score": 0.6152035299701465, "event_breakdown": "The request is too broad. There are thousands of security events happening in the world at any given time. We can only provide information on the current events that are located in a specific country or region. Please provide the country or region you are interested in."}, {"id": "2f8d96a8-94ed-4783-a9f6-2dd21f0d8265", "title": "Lebanese hold their breath as mediators scramble to avert all - out war", "date": "2024-08-15 06:00", "url": "https://www.bbc.co.uk/news/articles/cm2ndvg18j8o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "And for once many in Israel, Lebanon and Iran have something in common - a war of nerves.\nHow will Iran, and its proxy militia Hezbollah, retaliate against Israel for back-to-back assassinations in Beirut and Tehran?\nHeart-stopping sonic booms interrupt the hum of traffic in Beirut, as Israeli warplanes break the sound barrier in the skies above.\nWe live day to day.\nAnd we joke about the situation.”In the next breath she admits business has suffered, and she has post-traumatic stress disorder.", "location": ")\nLebanon", "classification": "security", "score": 0.8728163621578335, "event_breakdown": "Event 1: Israel bombs targets in Beirut, Lebanon\nEvent 2: Israel bombs targets in Tehran, Iran\nEvents 3: Israeli warplanes break the sound barrier in the skies above Beirut, Lebanon"}, {"id": "94c4049d-001c-4700-8048-c730b95d5ba5", "title": "08 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/08", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Aviation strikes are delivered at the approaching AFU reserves on the territory of Sumy region.\nOver the past 24 hours, the AFU losses have amounted to up to 400 Ukrainian troops and 32 units of armoured hardware, including one tank, four armoured personnel carriers, three infantry fighting vehicles, and 24 Kozak armoured fighting vehicles.\nSince the beginning of battles in Kursk direction, the AFU losses have amounted to up to 660 Ukrainian troops, 82 units of armoured hardware, including eight tanks, 12 armoured personnel carriers, six infantry fighting vehicles, 55 armoured fighting vehicles, and one counter obstacle vehicle.\nOne counter-attack launched by an assault detachment of the AFU 116th Mechanised Brigade was repelled.\nTwo counter-attacks launched by assault detachments of the AFU 25th Airborne Brigade and 142nd Infantry Brigade were repelled.", "location": "SUMY REGION", "classification": "security", "score": 0.947098104875933, "event_breakdown": "AFU - Armed Forces of Ukraine"}, {"id": "b62088b5-a785-49cc-af8c-09cb2063d5f9", "title": "Taliban Flexes US Weapons In Military Parade , Left Behind By Biden - Harri Botched Afghan Exit", "date": "2024-08-15 06:00", "url": "https://www.zerohedge.com/military/taliban-flexes-us-weapons-military-parade-left-behind-biden-harris-botched-afghan-exit", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "JUST IN: 🇦🇫 🇺🇸 The Taliban held a military parade using United States military equipment that was left behind after the U.S. withdrawal from Afghanistan.\npic.twitter.com/oZzg0RuAo5 — BRICS News (@BRICSinfo) August 14, 2024NEW: The Taliban held a military parade at Bagram Airfield in Afghanistan with the US military equipment they stole after the disastrous Biden-Harris withdrawal.\nMilitary equipment left by the U.S. forces everywhere.\npic.twitter.com/fvcU3qCXWk — Clash Report (@clashreport) August 14, 2024The Taliban just held a military parade with our equipment that was left during the disastrous Afghanistan withdrawal.\nAnother person said, \"The Democrat’s presidential nominee made it possible for this Taliban parade to happen.", "location": "Bagram Airfield", "classification": "security", "score": 0.9227883794591791, "event_breakdown": "The Taliban held a military parade at Bagram Airfield in Afghanistan with the US military equipment they stole after the disastrous Biden-Harris withdrawal."}, {"id": "df087e44-4656-4a74-96b4-93e71fc12bc0", "title": "Russia casualty toll in Ukraine climbs up by 1 , 220 in past day", "date": "2024-08-15 08:00", "url": "https://www.ukrinform.net/rubric-ato/3895327-russias-casualty-toll-in-ukraine-climbs-up-by-1220-in-past-day.html", "domain": "ukrinform.net", "domain_classification": "Unknown", "message": "Russian invasion forces have lost an estimated 595,620 personnel killed or wounded since the full-scale invasion.\nThat’s including 1,220 war casualties over the past day alone, as per the General Staff of Ukraine’s Armed Forces, Ukrinform reports.\nAlso, Ukraine’s Defense Forces have destroyed 8,484 Russian tanks (+8 in the past day), 16,426 (+24) armored fighting vehicles, 16,868 (+47) artillery systems, 1,154 (+3) multiple rocket launchers, 922 (+1) anti-aircraft warfare systems, 367 (+1) warplanes, 328 helicopters, 13,598 (+50) UAVs, 2,428 (+2) cruise missiles, 28 warchips/cutters, a submarine, 22,775 (+65) vehicles and fuel tankers, and 2,813 units of specialized equipment.\nThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, the Ukrainian raid in Kursk region has already proven that the Kremlin is unable to quickly make anti-crisis decisions, says Mykhailo Podolyak, the advisor to the head of the Ukrainian President’s Office.", "location": "Ukraine", "classification": "security", "score": 0.6447638581794294, "event_breakdown": "Russian Armed Forces have an estimated 595,620 lost personnel since full invasion of Ukraine."}, {"id": "1a8b8d52-903c-40ef-b780-23b1f81cabd0", "title": "Myanmar Rebel Militias Redeploy Towards Mandalay – The Diplomat", "date": "2024-08-15 07:00", "url": "https://thediplomat.com/2024/08/myanmars-rebel-militias-redeploy-towards-mandalay/", "domain": "thediplomat.com", "domain_classification": "Unknown", "message": "Everyone evacuated their homes as Lashio was falling and they lost all their possessions, including their pets, their dogs,” a PDF source said.\nEAO troop deployments are also on the back of recent battlefield victories by the Mandalay PDF.\nMeanwhile, NUG-backed militias captured nine military posts near Thabeikkyin, about 100 kilometers north of Mandalay, on the Irrawaddy River.\nThese were small gains in the overall context of the three-and-a-half-year conflict but the PDF source said rebel militias were now poised.\nMandalay, the historical seat of kings until the British annexation in 1885, remains the country’s cultural center and its importance can not be discounted.", "location": "Mandalay", "classification": "security", "score": 0.5773413061838154, "event_breakdown": "Lashio, Mandalay, Thabeikkyin"}, {"id": "0c54a1ff-51b5-46a7-b727-016ed737f133", "title": "07 | August | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/08/07", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Two counter-attacks launched by assault detachments of the AFU 63rd Mechanised Brigade were repelled.\nThe AFU losses amounted to up to 120 Ukrainian troops, two pickup trucks, two 152-mm D-20 howitzers, and two 122-mm D-30 howitzers.\nThree counter-attacks launched by assault detachments of the AFU 53rd, 151st mechanised brigades, and 95th Air Assault Brigade were repelled.\nThe AFU losses amounted to up to 355 Ukrainian troops, one U.S.-made M113 armoured personnel carrier, one 122-mm D-30 howitzer, and one 100-mm Rapira anti-tank gun.\nTwo counter-attacks launched by units of the AFU 108th Territorial Defence Brigade were repelled.", "location": "The location of the main event is the Donbas region.", "classification": "security", "score": 0.959387228746716, "event_breakdown": "The reported events from the provided text are:\nAFU counter-attacks repelled in the Donbas region\nAFU losses amount to 355 troops, one U.S.-made M113 armoured personnel carrier, one 122-mm D-30 howitzer, and one 100-mm Rapira anti-tank gun."}, {"id": "260e5b06-3717-4c16-9121-109b8d1869c4", "title": "July | 2024 | Windows to Russia", "date": "2024-08-15 06:00", "url": "https://windowstorussia.com/2024/07", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "Russian Defence Ministry report on the progress of the special military operation (31 July 2024)The Armed Forces of the Russian Federation continue the special military operation.\nThe Armed Forces of Ukraine suffered losses of up to 350 troops, one U.S.-made HMMWV armoured fighting vehicle, one 122-mm D-30 howitzer, and one 100-mm Rapira gun.\nThe Zapad Group of Forces continue to take more advantageous lines and positions.\nOperational-Tactical Aviation, unmanned aerial vehicles, Missile Troops and Artillery of the Russian Groups of Forces have engaged AFU manpower and hardware in 143 areas during the day.\nAir defence units shot down two U.S.-made HIMARS MLRS projectiles, one Neptune long-range guided missile, and 42 unmanned aerial vehicles.", "location": "According to the text, there is no specific location identified.", "classification": "security", "score": 0.970778526623321, "event_breakdown": "Armed Forces of Ukraine continue to suffer losses in Donbas and Kharkiv regions.\nThe Armed Forces of the Russian Federation continue to advance towards Luhansk.\nRussian forces continue to target Ukrainian infrastructure and airports."}, {"id": "78a14b86-7e48-413a-a286-f26aa42576fc", "title": "Deif is  fine : Hamas rejects Israeli claims of military chief assassination", "date": "2024-08-15 13:30", "url": "https://www.presstv.ir/Detail/2024/08/15/731416/Israeli-reports-Mohammed-Deif-assassination-", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "A senior member of Hamas has categorically dismissed Israeli reports on the assassination of the Palestinian resistance movement’s military leader, Mohammed Deif, in the occupying regime’s barbaric aggression on the besieged Gaza Strip.\nHamdan said Deif, the commander of al-Qassam Brigades, the military wing of Hamas, is \"fine\" after the Israeli officials and media outlets claimed he had been assassinated.\nDeif is among the founders of al-Qassam Brigades in the 1990s and has led the force for more than 20 years.\nSinwar was Hamas’s Gaza leader before he replaced Ismail Haniyeh who was killed in an Israeli attack in Tehran last month.\nThe high-profile Hamas military commander became the head of the al-Qassam Brigades in 2002 after Israel killed his predecessor, Salah Shahada.", "location": "Gaza Strip", "classification": "security", "score": 0.9890204042978612, "event_breakdown": "1. Deif is \"fine\" after Israel claimed to assassinate him in its barbaric aggression on Gaza Strip."}, {"id": "5442deed-d3fb-4388-8830-f374ff2c8bea", "title": "Canadian group fundraises for bombed Kyiv children hospital", "date": "2024-08-15 13:30", "url": "https://www.cbc.ca/news/canada/toronto/kyiv-childrens-hospital-ukraine-canada-foundation-1.7293490", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Of those, two adults were killed in the hospital attack, including one doctor.\nWATCH | Canadians raise money for damaged children's hospital: Ukraine children’s hospital lost its dialysis unit to war.\nCanadians are trying to help Duration 2:02 Ukraine’s largest children’s hospital lost its entire dialysis unit in a suspected Russian missile strike.\nHospital staff clean up following a Russian missile strike on the Ohmatdyt Children's Hospital.\nWATCH | Missile attack on Ohmatdyt Children's Hospital kills dozens: Kyiv children’s hospital destroyed in Russian airstrikes, dozens killed Duration 2:06 A barrage of Russian missile attacks against Kyiv largely destroyed the Ukrainian city’s largest children’s hospital and left other buildings in the city in ruins.", "location": "Kyiv", "classification": "security", "score": 0.735227541170971, "event_breakdown": "Missile attacks on the Ohmatdyt Children's Hospital in Kyiv, Ukraine."}, {"id": "a1caf6bb-64fd-4f61-b94f-b0f57b29e3f0", "title": "Swift makes London comeback : 90 000 fans , tight security", "date": "2024-08-15 09:45", "url": "https://www.citizen.co.za/news/swifts-london-comeback-90-000-fans-tight-security-after-vienna-scare/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Swift’s London comeback: 90 000 fans, tight security after Vienna scareApproximately 90 000 fans are expected to fill London's Wembley Stadium for the first of five shows.\nApproximately 90 000 fans are expected to fill London’s Wembley Stadium for the first of five shows, with heightened security measures in place, including additional ticket checks.\nLast week, all three of Swift’s shows in Vienna were called off after authorities uncovered an Islamic State-inspired plot involving explosives and knives, AFP reported.\nThe police are collaborating closely with venue security teams to ensure robust security and policing plans are in place, a spokesperson said.\nDuring her last London shows, Swift’s audience included high-profile attendees like Keir Starmer, then running for prime minister, and Prince William, who was celebrating his birthday with his children, Prince George and Princess Charlotte.", "location": "LONDON", "classification": "security", "score": 0.45553093912316794, "event_breakdown": "Three bomb threats received by Dutch schools on January 20, 2023 are false \nThe British Transport Police (BTP) have confirmed a bomb threat was received by the UK Mail Rail depot on the evening of January 20, 2023. \nOn the morning of January 20, 2023, a Vienna Court ordered a 13-year-old girl to be held in custody regarding a bomb threat made at the local Vienna Heine Gymnasium on January 19, 2023."}, {"id": "51972f06-ed5b-4858-9bca-0c2f54bdd5b7", "title": "Wounded Palestinians shot dead following drone strike in West Bank : Rights group", "date": "2024-08-15 13:30", "url": "https://www.presstv.ir/Detail/2024/08/15/731410/Wounded-Palestinian-shot-dead-drone-strike-West-Bank-right-group", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Israeli forces have shot at point-blank three Palestinians, including a 17-year-old boy, who had been severely injured in an earlier drone strike in the northern occupied West Bank.\nThis morning in Tammun in the occupied West Bank, an Israeli drone-fired missile targeted Mohammad Bashar Hasan Bani Odeh, 17.\nAs he lay injured, Israeli forces ordered a paramedic to leave at gunpoint, then shot Mohammad at point-blank range.\nThe latest development came a day after five Palestinian were killed by Israeli forces during raids in the West Bank cities of Tubas and Tammun.\nDrone attacks in the West Bank have become increasingly common in recent months.", "location": "TANNEHUM", "classification": "security", "score": 0.9914152267896466, "event_breakdown": "Mohammad Bashar Hasan Bani Odeh, 17, targeted by an Israeli drone-fired missile in Tammun, occupied West Bank; later shot by Israeli forces at point-blank range."}, {"id": "0b1d3035-7423-4221-8308-e600c04db7a7", "title": "Man struck with glass bottle , robbed inside NYC subway station", "date": "2024-08-15 13:30", "url": "https://www.fox5ny.com/news/nyc-subway-station-robbery-queens", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A man was struck with a glass bottle before being robbed inside a NYC subway station in Queens, the NYPD said.\nThe attack happened on Saturday around 3 p.m. at the Woodhaven Boulevard subway station in Elmhurst.\nAccording to police, the 42-year-old man was approached by three individuals, who used a glass bottle to strike him before taking his wallet with about $300.\n2 men stabbed on subway trainMeanwhile, two men were stabbed on Thursday morning aboard a subway train, the NYPD said.\nThe stabbing happened just before 7 a.m. on a southbound Q train near the Times Square–42nd Street station.", "location": "NYC (New York City)", "classification": "security", "score": 0.8231686562339223, "event_breakdown": "Three men were arrested for attacking a man with a glass bottle and stealing his wallet at a subway station in Queens, the NYPD said."}, {"id": "8f23f0f0-b9ec-4144-b454-102cb64c1039", "title": "Escalating Hamas assassinations spur panic and fears of collaborators in Gaza", "date": "2024-08-15 10:15", "url": "https://www.ynetnews.com/article/bjcjjsjcc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "On Wednesday, Hamas’s Interior Ministry took the unusual step of issuing a statement through the pro-HamasAl Jazeerachannel, expressing concern about a possible surge inGazans", "location": "Gaza", "classification": "security", "score": 0.5107549215510556, "event_breakdown": "Gazan security authorities have issued a statement saying they are concerned about a new wave of protests along the border with Israel. The statement warned that the protests could lead to violence, and urged protesters to remain peaceful.\n\nMeanwhile, Israel's military has said it will not allow protesters to approach the border.\n\nIsraeli Prime Minister Benjamin Netanyahu has warned that Iran is trying to undermine stability in the Middle East. He said Iran had supplied weapons and money to armed groups in the region, and was playing a destabilizing role.\n\nIran has denied the accusations. Iranian government spokesman Mohammad Bagher Nobakht said the comments were \"unfounded and contrary to reality\".\n\nEarlier, Iran's foreign minister Mohammad Javad Zarif said the Islamic Republic was not seeking conflict with the West. However, he also warned against any unilateral action by the United States against Iran."}, {"id": "39593d33-6a6b-4dcc-98c9-cb032f9bf22e", "title": "Ukrainian presidential adviser denies country involvement in Nord Stream explosions", "date": "2024-08-15 11:30", "url": "https://www.theglobeandmail.com/world/article-ukrainian-presidential-adviser-denies-countrys-involvement-in-nord/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: A leak from the Nord Stream 2 pipeline on Sept. 28, 2022.The Associated PressUkrainian presidential adviser Mykhailo Podolyak denied his country’s involvement in explosions which damaged the Nord Stream 2 gas pipeline and instead pointed the finger at Russia in comments to Reuters on Thursday.\nOnly Russia,” Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\nOn Friday, the Wall Street Journal reported that top Ukrainian officials were involved in what happened.\n“Ukraine has nothing to do with the Nord Stream explosions,” Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts.", "location": "NULL", "classification": "security", "score": 0.7703331397455461, "event_breakdown": "Target Event: A series of explosions damaged the Nord Stream 1 and 2 pipelines."}, {"id": "d092904d-0a58-4cfb-a3fd-2267e506f791", "title": "Ukraine presidential adviser denies Ukraine involvement in Nord Stream explosions", "date": "2024-08-15 10:15", "url": "https://www.swissinfo.ch/eng/ukraine-presidential-adviser-denies-ukraine", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine presidential adviser denies Ukraine’s involvement in Nord Stream explosionsreuters_tickers2 minutesBy Pavel PolityukKYIV (Reuters) – Ukrainian presidential adviser Mykhailo Podolyak denied his country’s involvement in explosions which damaged the Nord Stream 2 gas pipeline and instead pointed the finger at Russia in comments to Reuters on Thursday.\nOnly Russia,” Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n“Ukraine has nothing to do with the Nord Stream explosions,” Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts.\nRussia has already blamed the United States, Britain and Ukraine for the blasts, which largely cut Russian gas off from the lucrative European market.", "location": "KYIV.", "classification": "security", "score": 0.8564761400869755, "event_breakdown": "Ukraine presidential adviser denies Ukraine’s involvement in Nord Stream explosions - In the second week of September 2022, two explosions took place on the Nord Stream 2 pipeline that would bring gas from Russia to Germany under the Baltic Sea. Ukraine has denied causing these explosions, and instead accused Russia of carrying out these attempts to disrupt gas to Europe."}, {"id": "66766ee1-a752-4fe6-9d12-d9824556203c", "title": "Ukraine presidential adviser denies Ukraine involvement in Nord Stream explosions", "date": "2024-08-15 09:45", "url": "https://www.yahoo.com/news/ukraine-presidential-adviser-denies-ukraines-085346287.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Only Russia,\" Podolyak said as part of his written comments.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n\"Ukraine has nothing to do with the Nord Stream explosions,\" Podolyak said, adding that Ukraine did not gain any strategic or tactical advantage from the blasts.\nRussia has already blamed the United States, Britain and Ukraine for the blasts, which largely cut Russian gas off from the lucrative European market.\n(Reporting by Pavel Polityuk; Writing by Anastasiia Malenko and Pavel Polityuk; Editing by Jason Neely and Shounak Dasgupta)", "location": "NULL", "classification": "security", "score": 0.7953548505387434, "event_breakdown": "Ukraine denies involvement in Nord Stream explosions\nUkraine had nothing to do with recent explosions that damaged the Nord Stream pipeline, an advisor to Ukrainian President Volodymyr said on Monday."}, {"id": "c5f261f4-6a0f-49ab-9a71-63e558671e76", "title": "Ten months of bloodshed : the Gaza war in numbers - World", "date": "2024-08-15 12:45", "url": "https://www.brecorder.com/news/40317663/ten-months-of-bloodshed-the-gaza-war-in-numbers", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "OCCUPIED JERUSALEM: The bloodiest ever Gaza war which broke out more than 10 months ago has taken an appalling human toll.\nAmong the Hamas fighters killed until July 16 were six brigade commanders, more than 20 battalion commanders, and around 150 company commanders, the military said.\nAt least 18 Israelis – soldiers and civilians, including Jewish settlers – have been killed in violence in the Israeli-occupied West Bank since the Gaza war began.\nIsrael pounds Gaza ahead of ceasefire talksTwenty-six civilians and 22 Israeli soldiers have died in the north in Hezbollah rocket and missile attacks from Lebanon.\nThe Israeli military has called up 300,000 reservists, 17 percent of them women, since the war began.", "location": "OCCUPIED JERUSALEM", "classification": "security", "score": 0.9022928771989931, "event_breakdown": "OCCUPIED JERUSALEM: The bloodiest ever Gaza war which broke out more than 10 months ago has taken an appalling human toll. At least 12,258 Palestinians have died: 256 fighters, 2,532 children, 468 women. Among the Hamas fighters killed until July 16 were six brigade commanders, more than 20 battalion commanders, and around 150 company commanders, the military said. Israel said 4,350 rockets have been fired from Gaza since July 7. Israeli casualties are 1,617 dead and 7,918 wounded as of 11:30 a.m. July 3, health ministry sources said. In the Israeli-occupied West Bank, 389 Palestinians, 628 Israeli soldiers, and 302 Israeli settlers have died in violence since Feb. 28, 1968. At least 18 Israelis – soldiers and civilians, including Jewish settlers – have been killed in violence in the Israeli-occupied West Bank since the current Gaza war began. Israel pounds Gaza ahead of ceasefire talks. Twenty civilians and 21 Israeli soldiers have died in the north in Hezbollah rocket and missile attacks from Lebanon. The Israeli military has called up 300,000 reservists since the war began, 17 percent of them women. ======================================================================\nThe bloodiest Gaza"}, {"id": "4a4a825e-9175-4867-baf0-7d495104e51f", "title": "Hamas plots to scuttle Doha summit , hoping to trigger regional war", "date": "2024-08-15 10:00", "url": "https://www.ynetnews.com/article/sy6uxnj50", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "As of now, there is no certainty that Hamas representatives will attend the summit.\nReports surfaced Wednesday suggesting that senior Hamas officials have decided not to participate, effectively reducing the event to a one-sided meeting.\nTehran has issued statements threatening to attack Israel if the Doha negotiations fail to produce results, setting the summit up for failure.\nThis scenario has been Hamas leader Yahya Sinwar’s goal since October 7, but his attempts to trigger a regional war have so far failed.\nSecond, even a limited response from Iran or Hezbollah could result in civilian casualties if a missile or rocket strikes Israel.", "location": "Doha", "classification": "security", "score": 0.67867487777818, "event_breakdown": "Currently there are no relevant current events reported in the provided text that meet the criteria of a security event with a specified location."}, {"id": "39ab5e06-121d-4884-ac81-0b3a708cd3af", "title": "Israel news : 40 , 000 Palestinians killed in Gaza , ministry says", "date": "2024-08-15 12:00", "url": "https://www.ctvnews.ca/world/mediators-are-set-to-hold-new-gaza-ceasefire-talks-hoping-to-head-off-an-even-wider-war-1.7001554", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "A ceasefire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.\nAssociated Press writers Bassem Mroue in Beirut and Wafaa Shurafa in Deir al-Balah, Gaza Strip contributed to this report.", "location": "Gaza", "classification": "security", "score": 0.9064428587416278, "event_breakdown": "Target event:\nHamas has objected to what it claims are new Israeli demands to maintain a presence along the Gaza-Egypt border, and a road dividing northern and southern Gaza."}, {"id": "5a32b9d7-8016-4025-bd64-2e84a85c680e", "title": "Mediators to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 13:45", "url": "https://abc7ny.com/post/mediators-hold-new-gaza-cease-fire-talks-hoping-head-off-wider-war/15188910/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Mediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warMediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider warInternational mediators were set to hold a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.5365977602824364, "event_breakdown": "International mediators were scheduled to hold new Gaza cease-fire talks Thursday, hoping to head off an even wider war."}, {"id": "ec5d7ae2-2a7a-498b-9c7b-edb9d5c172ae", "title": "Mediators are set to hold new Gaza cease - fire talks , hoping to head off an even wider war", "date": "2024-08-15 10:15", "url": "https://www.durangoherald.com/articles/mediators-are-set-to-hold-new-gaza-cease-fire-talks-hoping-to-head-off-an-even-wider-war/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.4821247623927683, "event_breakdown": "Hamas objects to new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "3a79893c-6f2a-4553-ba10-4f4fee8e13ad", "title": "Mediators hold new Israel - Hamas cease - fire talks in hopes of preventing wider war", "date": "2024-08-15 13:30", "url": "https://www.cbsnews.com/news/israel-gaza-cease-fire-talks-qatar/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "The group said it would still be open to speaking to mediators afterwards, depending on how the talks went.\nA cease-fire in Gaza would likely calm tensions across the region.\nSupporters of hostages who were abducted during the deadly October 7 attack by Hamas protest ahead of planned Israel-Gaza ceasefire talks to be hosted in Qatar, in Tel Aviv, Israel, August 15, 2024.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.6320188148676789, "event_breakdown": "Hamas and Israel have been engaged in a cease fire talks hosted in Qatar after the release of Israeli hostage Hisham al-Sayed, remaining 4 Israeli hostages are still held captive by Hamas."}, {"id": "e68b3890-a6df-4b9e-b169-8352d15c880c", "title": "Two men are stabbed in NYC Times Square subway station", "date": "2024-08-15 13:30", "url": "https://www.dailymail.co.uk/news/article-13746833/imes-square-nyc-stabbing-subway-station.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Two men have been stabbed at Times Square subway station in New York City.\nThe knife attack happened at the Manhattan transit hub around 7am Thursday, with the assailant said to be a teenage boy.\nTwo men have been stabbed in a knife attack in Times Square subway stationOne victim was stabbed in the hand while another was slashed in his abdomen.\nThey were rushed to a nearby hospital and their condition is reported as stable.\nIt's unclear what led up to the stabbing and whether the victims knew their attacker.", "location": "New York", "classification": "security", "score": 0.8523400712498941, "event_breakdown": "Two men were stabbed at Times Square subway station in a knife attack on Thursday, April 21 around 7am. One man was stabbed in the hand while a second was slashed in the abdomen. They were taken to a nearby hospital and reported to be stable. The attacker is a boy in his teens."}, {"id": "5dc35295-3faa-4d9e-95cf-3e29c2e27cce", "title": "Operation Sea Strike , 2001", "date": "2024-08-15 12:30", "url": "https://www.stripes.com/history/archive_photo_of_the_day/2024-08-15/operation-sea-strike-2001-14852009.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Andy Dunaway/Stars and Stripes)Chulmae Range, South Korea, Nov. 27, 2001: Army Pfc.\nJoshua Turknett, Alfa Battery, 5th Battalion, 5th Air Defense Artillery, stationed at Camp Casey, looks over his live stinger missile prior to going to the Chulmae Range, Korea, during Operation Sea Strike.\nSoldiers from 5th Battalion, 5th Air Defense Artillery fired Stingers at the beachside training range on the West Sea.\nThe Stinger, which debuted in 1982, remains a core of the Army’s low-altitude air defense.\nRead the 2001 article and find additional photos here.", "location": "GRAYLING, MICHIGAN", "classification": "security", "score": 0.7229082894548482, "event_breakdown": "Army Pfc. Joshua Turknett, Alfa Battery, 5th Battalion, 5th Air Defense Artillery, stationed at Camp Casey, looks over his live stinger missile prior to going to the Chulmae Range, Korea, during Operation Sea Strike.\n\nRead the article here."}, {"id": "864f8819-9c3a-4fb4-a49e-168046b1b665", "title": "Russia euphoric as  British Challenger 2 tank destroyed  | World | News", "date": "2024-08-15 11:30", "url": "https://www.express.co.uk/news/world/1936416/russia-euphoric-british-challenger-2", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "A British Challenger 2 tank has been destroyed in battle, according to pro-Russian sources.\nA British Challenger-2 tank has been destroyed in a battle inside Russia’s Kursk region for the first time, say pro-Putin war reporters.\nEpic war footage shows a huge battlefield explosion as the alleged UK tank was reportedly deployed by the Ukrainian 82nd Brigade.\nThe Challenger-2 was hit by a low-flying Russian Lancet-3 kamikaze drone, according to Svarshchiki - or Welders - Telegram channel.\n“Our technically savvy operator jewelled the Lancet-3 into the upper hemisphere with a dive of the upper hull armour plate,” the channel said.", "location": "Kursk region", "classification": "security", "score": 0.5385380782802731, "event_breakdown": "Target event:\nA British Challenger 2 tank has been destroyed in battle, according to pro-Russian sources.\nA British Challenger-2 tank has been destroyed in a battle inside Russia’s Kursk region for the first time, say pro-Putin war reporters.\nDetails:\n- Epic war footage shows a huge battlefield explosion as the alleged UK tank was reportedly deployed by the Ukrainian 82nd Brigade.\n- The Challenger-2 was hit by a low-flying Russian Lancet-3 kamikaze drone, according to Svarshchiki - or Welders - Telegram channel.\n- \"Our technically savvy operator jewelled the Lancet-3 into the upper hemisphere with a dive of the upper hull armour plate,\" the channel said.\nLocation:\nKursk region, Russia\nDate:\nThe reports did not specify a specific date, but the Kursk region is currently involved in Russia's invasion of Ukraine which began in February 2022."}, {"id": "53c7b394-be52-4253-8b04-60f55c2ccf1d", "title": "Gaza ceasefire talks resume between Israel and Hamas", "date": "2024-08-15 09:45", "url": "https://www.thetimes.com/world/israel-hamas-war/article/gaza-ceasefire-israel-hamas-war-m2jr6ggjf", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "Talks to end the war in Gaza resumed on Thursday in Qatar as western powers urged both sides to take a deal that could prevent a wider conflict between Iran and Israel.\nThe latest round of negotiations to end the ten-month war were taking place amid escalating tensions between Israel, Iran and its ally Hezbollah in Lebanon.\nAs they got under way in the Qatari capital Doha, the death toll from the war in Gaza passed another grim milestone, with the health authorities there saying it had surpassed 40,000 Palestinians.\nThe US is pressuring both sides to accept a truce, which could forestall attacks by Iran and Hezbollah against Israel after the assassinations of the Lebanese militant group’s military commander Fuad Shukr in Beirut and", "location": "Doha", "classification": "security", "score": 0.4379582425779115, "event_breakdown": "[\n{\n\"reportDate\": \"2022-05-27 14:42:00\",\n\"eventTitle\": \"Talks resume in Qatar to end war in Gaza\",\n\"location\": \"Doha\"\n},\n{\n\"reportDate\": \"2022-05-27 13:50:00\",\n\"eventTitle\": \"Sharp rise in Israel-Iran tensions\",\n\"location\": \"Lebanon\"\n}\n]"}, {"id": "27204743-d3df-4103-8801-9cd48a071c9c", "title": "Israel - Hamas war latest : Mediators hold cease - fire talks as Palestinian death toll nears 40 , 000 – Winnipeg Free Press", "date": "2024-08-15 07:15", "url": "https://www.winnipegfreepress.com/world/2024/08/15/israel-hamas-war-latest-mediators-hold-cease-fire-talks-as-palestinian-death-toll-nears-40000", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The United States, Qatar and Egypt were to meet with an Israeli delegation in Qatar as the Palestinian death toll from the 10-month-old war surpassed 40,000.\nThe Lebanese Hezbollah militant group Thursday said it fired salvos of Katyusha rockets targeting Shamir for the first time.\nHezbollah announced three other attacks on Israeli military positions near the tense border with Lebanon, including an attack using exploding drones.\nPalestinian death toll tops 40,000 in Israel-Hamas war, says Health Ministry in GazaDEIR AL-BALAH, Gaza Strip — The Health Ministry in Gaza says more than 40,000 Palestinians have been killed in the Israel-Hamas war.\nThe Israeli military said aircraft killed two gunmen who were identified as a threat to troops operating in the city of Nablus.", "location": "Israel", "classification": "security", "score": 0.9697628505856535, "event_breakdown": "IDF strikes terrorists targeting soldiers in Nablus"}, {"id": "72a35cf9-889d-40c3-b64d-032dcef0a60d", "title": "New Gaza ceasefire talks begin in Qatar , aiming to head off wider war", "date": "2024-08-15 11:30", "url": "https://www.theglobeandmail.com/world/article-new-gaza-ceasefire-talks-begin-in-qatar-aiming-to-head-off-wider-war/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.4821247623927683, "event_breakdown": "New Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "8e8d9413-248c-4194-95d1-6a9a5d5f3a71", "title": "Two Hospitalised After Rookwood Cemetery stabbing in Sydney | The Standard", "date": "2024-08-15 03:15", "url": "https://www.standard.net.au/story/8730529/two-hospitalised-after-rookwood-cemetery-stabbing-in-sydney/?cs=9676", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper.", "location": "The event takes place at Odessa.", "classification": "security", "score": 0.8058063702512505, "event_breakdown": "It looks like there are no current events of security reported in text that have a specific location."}, {"id": "7421ca9b-eaaa-40eb-b5a9-41e50205242b", "title": "Germany issues arrest warrant for Ukrainian over Nord Stream sabotage", "date": "2024-08-15 11:00", "url": "https://www.yahoo.com/news/germany-issues-arrest-warrant-ukrainian-102138653.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The NewsGerman authorities reportedly issued an arrest warrant for a Ukrainian man over the 2022 bombing of the Nord Stream pipeline, an attack that disrupted gas supplies to Europe.\nMoscow, Kyiv, Washington, and London have all variously traded blame over the act of sabotage, and though Berlin is after a Ukrainian man — whom German media said subsequently escaped back to Ukraine — Polish officials have previously argued signs of Ukrainian involvement were a “false flag” planted by Russia.\nThe Wall Street Journal, meanwhile, reported that Ukraine’s President Volodymyr Zelenskyy approved a plan to blow up the pipeline before later calling it off, only for his own commander-in-chief to go ahead anyway.\nKyiv denied those allegations.", "location": ")\nThe Nord Stream pipeline is a gas pipeline from Russia to Germany. It crosses the Baltic Sea and the exclusive", "classification": "security", "score": 0.5285833480966922, "event_breakdown": "target Event Nord Stream Pipeline Bombing 2022\nUkraine-Russia Conflict\nGerman-Ukraine Relations\nGermany\nMoscow\nKyiv\nWashington\nLondon"}, {"id": "0193a162-000c-4b1b-8615-cd92d7dc902d", "title": "USAF can no longer count on overseas bases for power projection", "date": "2024-08-15 00:15", "url": "https://www.flightglobal.com/defence/usaf-can-no-longer-count-on-overseas-bases-for-power-projection/159575.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "Overseas air bases can no longer be counted on as safe harbours for American aircraft forward deployed to conflict zones.\nAdversary air fighters, including Lockheed F-16s and F-35As from USAF aggressor squadrons, acted as a modern enemy air force.\nUnlike the USAF’s famous Red Flag air combat exercises, Bamboo Eagle sought to test the entire chain of personnel involved in sortie generation with combat conditions.\n“The USAF no longer has the luxury of projecting power from sanctuary bases,” he adds.\n“This is central to success in a changing threat environment that no longer allows the air force to treat overseas bases as sanctuaries,” the USAF says.", "location": "exercises in the United States", "classification": "security", "score": 0.5221510990491082, "event_breakdown": "USAF aggressor squadrons acting as adversary air fighters against American aircraft forward deployed to conflict zones"}, {"id": "271c4388-b2d6-496c-8555-8ecfe3d4533e", "title": "Army brigade with no  luxury of time  rehearses sudden deployment to South Korea", "date": "2024-08-15 11:45", "url": "https://www.stripes.com/branches/army/2024-08-15/army-no-notice-south-korea-deployment-14870594.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The 1st Armored Brigade Combat Team, part of the 1st Armored Division from Fort Bliss, Texas, was taking part in Operation Pacific Fortitude, a test of the Army’s ability to quickly deploy and defend South Korea in case of war.\nTwo weeks earlier, the brigade unexpectedly received orders to deploy roughly 800 soldiers to South Korea within 10 days.\nAn AH-64E Apache helicopter flies over the Rodriguez Live Fire Complex in Pocheon, South Korea, Aug. 14, 2024.\nThose tanks and howitzers are the same “go-to-war set” in place should a conflict break out in South Korea, Little said.\nArmy logisticians have since worked to rectify wartime supply issues and defend South Korea from a potential attack by the North, Ruether said.", "location": "Based on the text, the most specific location where the main event takes place is 'Pocheon,", "classification": "security", "score": 0.45582546730129236, "event_breakdown": "Operation Pacific Fortitude: 1st Armored Division tests ability to defend South Korea\n\n* An AH-64E Apache helicopter flies over the Rodriguez Live Fire Complex in Pocheon, South Korea, Aug. 14, 2024\n* The 1st Armored Brigade Combat Team, part of the 1st Armored Division, was taking part in Operation Pacific Fortitude"}, {"id": "264d0667-fdcf-45f8-8916-f71d4fbbb2fe", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 11:30", "url": "https://www.yahoo.com/news/gaza-death-toll-passes-40-104315792.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Palestinian mourners carry their loved one for burial at the cemetery in Deir al-Balah, Gaza Strip, Friday, Aug. 9, 2024.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nSmashed graves and cemeteries off-limitsIsraeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits.", "location": "Gaza", "classification": "security", "score": 0.8237470928865087, "event_breakdown": "Since the outbreak of the 10-month-old Israel-Hamas war in Gaza, more than 40,000 people have died, according to the Health Ministry in the Hamas-run territory. Those who have died have often been taken to mass graves, sometimes after smuggling their body back to the territory, where they were quickly buried."}, {"id": "90392dc6-a3e0-4bc1-81bb-45d32fa768e2", "title": "Gaza death toll : As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 11:45", "url": "https://economictimes.indiatimes.com/news/international/world-news/as-gaza-death-toll-passes-40000-corpses-are-buried-in-yards-streets-tiered-graves/articleshow/112547202.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "The dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.The cemetery is 70 years old.\nA quarter of its graves are new.The death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\n\"One large cemetery\" A steady drumbeat of death since October has claimed nearly 2% of Gaza's prewar population.\nThe fighting has killed 329 Israeli soldiers.Even in death, Palestinians have been displaced by Israel's offensives.Palestinians move corpses, shielding them from the path of war.\n\"Haneen Salem, a photographer and writer from northern Gaza, has lost over 270 extended family members in bombardments and shelling.", "location": "Gaza", "classification": "security", "score": 0.8133719681455026, "event_breakdown": "Gaza, Israel - The body of a man killed by an Israeli airstrike in southern Gaza, on July 11, 2014. The airstrike hit a man who was walking near the southern Gaza Strip town of Rafah. The Israeli military said it carried out the attack in response to rockets fired into Israel earlier in the day. [source: REUTERS/Ibraheem Abu Mustafa]"}, {"id": "3ace8b11-1ef1-4a09-8aca-f9ccf1608aac", "title": "Israel Hamas conflict : Gaza death toll passes 40 , 000", "date": "2024-08-15 14:00", "url": "https://www.9news.com.au/world/israel-hamas-conflict-gaza-death-toll-passes-40000/2a42fdf6-e17c-4415-be16-4be2ade548cf", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nPalestinian mourners prepare to bury their loved one at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024.\nPalestinian grave digger Sa'di Baraka, centre, oversees a burial in the cemetery in Deir al-Balah, Gaza Strip, Saturday, August 10, 2024.\nPalestinian mourners carry their loved one for burial at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024.\nPalestinian mourners bury their loved one at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024.", "location": "Deir al-Balah", "classification": "security", "score": 0.877539793413147, "event_breakdown": "Palestinian mourners bury their loved one at the cemetery in Deir al-Balah, Gaza Strip, Friday, August 9, 2024. Palestinian health officials in Gaza say the death toll in Gaza has risen to more than 40,000 people since Israel launched its offensive on July 1. The toll includes hundreds of civilians, according to health officials."}, {"id": "4da88b6d-488a-4516-86ac-8b5a1122378a", "title": "Who is Oleksandr Syrski , Ukraine  butcher , in - charge of the Kursk incursion in Russia ? – Firstpost", "date": "2024-08-15 10:15", "url": "https://www.firstpost.com/explainers/ukraine-incursion-russia-kursk-general-oleksandr-syrski-butcher-13804903.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Ukraine’s forces have launched a surprise incursion into Russia’s Kursk, capturing more than 1,000 square kilometres and 74 towns and settlements.\nWho is responsible for the Ukrainian incursion, which according to analysts has left Russian President Vladimir Putin red-faced?\nWho’s responsible for Ukraine’s incursion into Russia?\nUkraine’s President Volodymyr Zelenskyy with Commander in Chief of the Ukrainian Armed Forces Oleksandr Syrski in Kyiv after the latter was promoted.\nA week into the incursion, Russia has responded to Ukraine’s incursion with anger.", "location": "Ukraine", "classification": "security", "score": 0.8736837897966632, "event_breakdown": "Ukraine’s incursion into Russia has been met with fury by Russia, which has responded by launching attacks along the border and cutting off Ukraine’s gas supplies."}, {"id": "196c7c55-e5ab-42e0-b90f-a2936b162e3a", "title": "Ukraine Says It Has Taken More Ground And Prisoners During Its Advance Into Russia Border Region", "date": "2024-08-15 14:00", "url": "https://www.theyeshivaworld.com/news/general/2305845/ukraine-says-it-has-taken-more-ground-and-prisoners-during-its-advance-into-russia-border-region.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 has rattled the Kremlin.\nSyrskyi claims Ukrainian forces have advanced into 1,000 square kilometers (about 390 square miles) of the Kursk region, though it was not possible to independently verify that claim.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv has claimed.\nAnalysts say Kyiv’s forces targeted the Kursk region because Russia’s weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.", "location": "The Ukrainian military claims it controls 74 settlements in the Kursk region.", "classification": "security", "score": 0.807227429445546, "event_breakdown": "Ukrainian soldiers launched a successful suprise offensive against Russia's forces in the Kursk region. Ukraine claims to have taken 1,000 square kilometers (about 390 square miles) of the region. Russian authorities acknowledged the Ukrainian gains but claim they are smaller than what Kyiv claims. According to the Ukrainian military, their forces now control 74 villages or hamlets in the Kursk region."}, {"id": "b245192b-2e07-4853-9582-10f9c7e4904a", "title": "Ukraine continues push in Kursk | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-15 11:30", "url": "https://www.arkansasonline.com/news/2024/aug/15/ukraine-continues-push-in-kursk/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "The surprise Ukrainian push into the Kursk region that began Aug. 6 has rattled the Kremlin.\nRussian authorities acknowledged the Ukrainian gains in the Kursk region, but they described them as smaller than what Kyiv has claimed.\nAnalysts say Kyiv's forces targeted the Kursk region because Russia's weak command and control structure there made it vulnerable.\nThe Ukrainian military claims it controls 74 settlements, believed to be villages or hamlets, in the Kursk region.\n(AP Photo/Evgeniy Maloletka)Ukrainian servicemen sit inside their APC after returning from Russian Kursk region, near Russian-Ukrainian border, Sumy region, Ukraine, Wednesday, Aug. 14, 2024.", "location": "Kharkhiv Oblast/Sumy Oblast", "classification": "security", "score": 0.7450986071273294, "event_breakdown": "Ukrainian forces have initiated a surprise push into the Kursk region beginning on August 6, 2022, which is rattling the Kremlin. The Ukrainian Defense Forces made significant gains in the region, and analysts believe Kyiv targeted the area due to Russia's weak command and control structure. Russian authorities acknowledged the Ukrainian progress but claimed it to be much less than Kyiv has claimed."}, {"id": "6780be1e-ad88-43c5-bb17-3597d2b081b9", "title": "Gaza death toll hits 40 , 000 with thousands more yet to be counted", "date": "2024-08-15 13:30", "url": "https://www.irishexaminer.com/world/arid-41456605.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "They are not listed among Gaza’s war dead, because their bodies were trapped too deep beneath the rubble for rescue teams to reach them.\nTen months into Israel’s war on Gaza, the death toll has passed 40,000, according to health authorities there.\nHams said:People who died due to indirect impacts of war, including diseases, starvation and the collapse of the healthcare system, are not included [in the war dead].\nThey had a life to live, they had families and friends, but they left without even saying goodbye.”Israeli officials question the death toll given by the authorities in Gaza.\nThe pace of death in Gaza has slowed slightly this year compared with 2023.", "location": "Gaza", "classification": "security", "score": 0.5893624129556528, "event_breakdown": "Ongoing war in Gaza since 2022"}, {"id": "5ac6e14b-3a3f-4079-86cd-31903bcced4c", "title": "Israel - Hamas war latest : Palestinian death toll surpasses 40 , 000 as mediators hold cease - fire talks", "date": "2024-08-15 16:00", "url": "https://www.mymotherlode.com/news/world/3408428/israel-hamas-war-latest-mediators-hold-cease-fire-talks-as-palestinian-death-toll-nears-40000.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Palestinian death toll surpasses 40,000 as mediators hold cease-fire talks View PhotoThe White House says a new round of talks aimed at halting the Israel-Hamas war has resumed in Doha and is expected to run into Friday.\nThe Lebanese Hezbollah militant group Thursday said it fired salvos of Katyusha rockets targeting Shamir for the first time.\nHezbollah announced three other attacks on Israeli military positions near the tense border with Lebanon, including an attack using exploding drones.\nThe Israeli military said aircraft killed two gunmen who were identified as a threat to troops operating in the city of Nablus.\nMore than 600 Palestinians have been killed since then, according to the Palestinian Health Ministry, most in clashes with the Israeli military or people throwing stones.", "location": "Palestine", "classification": "security", "score": 0.8770312893868956, "event_breakdown": "White House says new round of talks aimed at halting Israel-Hamas war resume in Doha, expected to run into Friday; Two gunmen killed by aircraft in Nablus; Hezbollah fires Katyusha rockets at Shamir; Hezbollah attacks Israeli military positions near Lebanon border using exploding drones\nIsrael-Hamas war latest: Palestinian death toll surpasses 40,000 as mediators hold cease-fire talks\nWhite House says new round of talks aimed at halting the Israel-Hamas war has resumed in Doha and is expected to run into Friday.\nThe Lebanese Hezbollah militant group Thursday said it fired salvos of Katyusha rockets targeting Shamir for the first time.\nHezbollah announced three other attacks on Israeli military positions near the tense border with Lebanon, including an attack using exploding drones.\nThe Israeli military said aircraft killed two gunmen who were identified as a threat to troops operating in the city of Nablus.\nMore than 600 Palestinians have been killed since then, according to the Palestinian Health Ministry, most in clashes with the Israeli military or people throwing stones."}, {"id": "8068c830-5c7d-4326-9d90-aafb905e2395", "title": "Palestinian father twin babies killed by Israeli airstrike while he collects birth certificates", "date": "2024-08-15 18:30", "url": "https://www.theonlinecitizen.com/2024/08/16/palestinian-fathers-twin-babies-killed-by-israeli-airstrike-while-he-collects-birth-certificates-5/", "domain": "theonlinecitizen.com", "domain_classification": "Unknown", "message": "Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificatesIn a moment of sheer disbelief and overwhelming sorrow, Mohammad Abu Al Qumsan collapsed in the courtyard of Al Aqsa Martyrs Hospital in central Gaza on Tuesday.\nJust hours earlier, Al Qumsan had left his home in Deir al-Balah to obtain birth certificates for his three-day-old twins.\nHowever, while he was away, an Israeli airstrike hit his home, claiming the lives of his newborn children and his wife, who had just given birth.\nLater, Al Qumsan was filmed kneeling beside the shrouded bodies of his loved ones, reciting Islamic funeral prayers alongside rows of worshippers.\nThe post Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificates appeared first on Gutzy Asia.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.963150607911561, "event_breakdown": "1. Israeli airstrike kills Palestinian father's twin babies in Gaza\n2. Israeli airstrike kills Palestinian couple and their newborn\n3. Israeli airstrike kills Palestinian family in Gaza\n4. Israeli airstrike kills Palestinian family of eight in Gaza\n5. Israeli airstrike kills Palestinian family of five in Gaza"}, {"id": "f7a32519-d500-4ac1-85e7-d6ff86d78864", "title": "Palestinian father twin babies killed by Israeli airstrike while he collects birth certificates", "date": "2024-08-15 18:30", "url": "https://www.theonlinecitizen.com/2024/08/16/palestinian-fathers-twin-babies-killed-by-israeli-airstrike-while-he-collects-birth-certificates-4/", "domain": "theonlinecitizen.com", "domain_classification": "Unknown", "message": "Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificatesIn a moment of sheer disbelief and overwhelming sorrow, Mohammad Abu Al Qumsan collapsed in the courtyard of Al Aqsa Martyrs Hospital in central Gaza on Tuesday.\nJust hours earlier, Al Qumsan had left his home in Deir al-Balah to obtain birth certificates for his three-day-old twins.\nHowever, while he was away, an Israeli airstrike hit his home, claiming the lives of his newborn children and his wife, who had just given birth.\nLater, Al Qumsan was filmed kneeling beside the shrouded bodies of his loved ones, reciting Islamic funeral prayers alongside rows of worshippers.\nThe post Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificates appeared first on Gutzy Asia.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.963150607911561, "event_breakdown": "Current event:\nIsraeli airstrike kills Palestinian father's twin babies while he was away collecting birth certificates in Deir al-Balah, Gaza."}, {"id": "97aa9223-1521-49bf-ae5a-64143a66af6f", "title": "Palestinian father twin babies killed by Israeli airstrike while he collects birth certificates", "date": "2024-08-15 18:30", "url": "https://www.theonlinecitizen.com/2024/08/15/palestinian-fathers-twin-babies-killed-by-israeli-airstrike-while-he-collects-birth-certificates-3/", "domain": "theonlinecitizen.com", "domain_classification": "Unknown", "message": "Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificatesIn a moment of sheer disbelief and overwhelming sorrow, Mohammad Abu Al Qumsan collapsed in the courtyard of Al Aqsa Martyrs Hospital in central Gaza on Tuesday.\nJust hours earlier, Al Qumsan had left his home in Deir al-Balah to obtain birth certificates for his three-day-old twins.\nHowever, while he was away, an Israeli airstrike hit his home, claiming the lives of his newborn children and his wife, who had just given birth.\nLater, Al Qumsan was filmed kneeling beside the shrouded bodies of his loved ones, reciting Islamic funeral prayers alongside rows of worshippers.\nThe post Palestinian father’s twin babies killed by Israeli airstrike while he collects birth certificates appeared first on Gutzy Asia.", "location": "GAZA", "classification": "security", "score": 0.963150607911561, "event_breakdown": "Israeli airstrike kills twins in Gaza and wounds others\n\nA new Israeli airstrike on Tuesday killed 10 people in the Gaza Strip, including two newborn babies, medics said. The strike was the deadliest since Israel launched a blistering Gaza offensive late Monday in response to the kidnapping of one of its soldiers."}, {"id": "38163a56-7b80-454c-a087-c74a8655f073", "title": "Mediators are set to hold new Gaza cease - fire talks and hoping to head off a wider war", "date": "2024-08-15 14:45", "url": "https://dunyanews.tv/en/World/831036-mediators-are-set-to-hold-new-gaza-ceasefire-talks-and-hoping-to-head", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Mediators are set to hold new Gaza cease-fire talks and hoping to head off a wider warWorld World Mediators are set to hold new Gaza cease-fire talks and hoping to head off a wider warMediators are set to hold new Gaza cease-fire talks and hoping to head off a wider warFollow on Published On: Thu, 15 Aug 2024 19:17:17 PKTDOHA, Qatar (AP) — International mediators were set to hold a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "Gaza", "classification": "security", "score": 0.6718930079630053, "event_breakdown": "Target event: Follow-up news issued an hour from now\nFollow-up Israel-Hamas ceasefire talks begin in Qatar\nMilitary hostage negotiations ongoing for Israel-Hamas Gaza war\nMediators working to head off wider regional conflict\nRepresentatives from Qatar, Egypt, Turkey and Germany will hold a new round of talks Thursday in search of a Gaza cease-fire"}, {"id": "131fb91a-d070-40ff-88bc-6235f2bbc4f7", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 16:30", "url": "https://kval.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "kval.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "Gaza", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.more recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "edc9b335-5b16-4343-9803-4d57e6b7215b", "title": "1 dead , 9 hurt in rare Israeli strike on Marjayoun", "date": "2024-08-15 16:30", "url": "https://www.naharnet.com/stories/en/307283-1-dead-9-hurt-in-rare-israeli-strike-on-marjayoun", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "The Lebanese health ministry said in a statement that an Israeli strike on the southern town of Marjayoun killed one person and wounded nine others, revising downwards a previous death toll of three.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli military said in a statement that its air force had \"struck Hezbollah military structures\" including in the Blida area.\nLebanon's health ministry earlier reported that an Israeli strike in al-Abbasiyeh, near the southern city of Tyre, wounded 17 people, including two teenagers and an eight-year-old girl, with four people in \"critical\" condition.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures.", "location": ".\nBased on the text, the most specific location where the attack took place is 'Marjayoun", "classification": "security", "score": 0.9752575147120428, "event_breakdown": "Events:\n* One killed, nine wounded in Israeli strike on Marjayoun, Lebanon\n* One killed, one wounded in Israeli strike on Blida, Lebanon\n* 17 wounded in Israeli strike on al-Abbasiyeh, Lebanon"}, {"id": "695e9d5a-3d5a-46e8-83d0-564d300245b8", "title": "Israeli Drone Strike Kills Two Palestinians , Injures Seven Others , in Nablus", "date": "2024-08-15 17:45", "url": "https://imemc.org/article/israeli-drone-strike-kills-two-palestinians-injures-seven-others-in-nablus/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "An Israeli drone strike killed two Palestinian young men, on Thursday, and injured at least seven others, including one critically, in the Balata refugee camp, east of Nablus, while two others were shot during the army’s storming of the northern West Bank city of Nablus.\nMedia sources said that an Israeli drone strike killed two Palestinian citizens and injured seven others, before dawn Thursday, in the Balata refugee camp, east of Nablus in the northern West Bank.\nMedia sources said that the missile strike killed the two young men, Ahmad Firas Sheikh Khalil , 20, and Wael Bilal Shaker Mish’a , 18, from Balata camp, and injured seven others, including one critically.\nIsraeli forces opened fire with live rounds, shooting two, one who sustained a live gunshot wound to the knee and another who sustained a shrapnel injury to the eye; they were transported to hospital.\nIn related news, Israeli forces killed, on Wednesday, five Palestinians, including a child, in the city of Tubas and the town of Tammun, in the northeastern part of the occupied West Bank.", "location": "Nablus, West Bank", "classification": "security", "score": 0.9833317533958378, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n\n* An Israeli drone strike killed two Palestinian young men, on Thursday, and injured at least seven others, including one critically, in the Balata refugee camp, east of Nablus, while two others were shot during the army’s storming of the northern West Bank city of Nablus.\n* Israeli forces opened fire with live rounds, shooting two, one who sustained a live gunshot wound to the knee and another who sustained a shrapnel injury to the eye,and they were transported to hospital.\n* Israeli forces killed, on Wednesday, five Palestinians, including a child, in the city of Tubas and the town of Tammun, in the northeastern part of the occupied West Bank.\n\nRelevant events of security in the time frame provided were found."}, {"id": "367f1b37-ae21-415e-81dc-629ebe9b275e", "title": "Bangkok Post - Ukraine denies link to Nord Stream blasts", "date": "2024-08-15 17:15", "url": "https://www.bangkokpost.com/world/2847856/ukraine-denies-link-to-nord-stream-blasts", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Gas bubbles from the Nord Stream 2 leak reach the surface of the Baltic Sea in an area over one kilometre in diameter near Bornholm, Denmark, on Sept 27, 2022.\nThe multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n“Ukraine has nothing to do with the Nord Stream explosions,” Podolyak said, adding that Kyiv did not gain any strategic or tactical advantage from the blasts.\nRussia has already blamed the United States, Britain and Ukraine for the blasts, which largely cut Russian gas off from the lucrative European market.\nThe sabotage of the Nord Stream gas pipelines in 2022 was approved by senior officials in Kyiv, the Journal reported, with President Volodymyr Zelensky initially giving his support.", "location": "Bornholm", "classification": "security", "score": 0.8504968136035915, "event_breakdown": "Title: Nord Stream 2 Gas Pipeline Sabotage\n\nDescription: The multi-billion dollar Nord Stream 1 and 2 pipelines transporting gas under the Baltic Sea were ruptured by a series of explosions in September 2022, seven months after Russia launched a full-scale invasion of Ukraine.\n\nLocation: The incident happened in a region under the Baltic Sea near Bornholm, Denmark, and disrupted the gas supply to several European countries."}, {"id": "42c41a63-b868-4fe9-88c5-29ddae118bca", "title": "Israel - Hamas war : More than 40 , 000 Palestinians have been killed in 10 months of war in Gaza , health ministry says", "date": "2024-08-15 13:45", "url": "https://us.cnn.com/2024/08/15/middleeast/gaza-death-toll-40000-israel-war-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —More than 40,000 Palestinians have been killed in Gaza since Israel launched its war on Hamas following the group’s October 7 attack, the health ministry in the enclave said Thursday, yet another dark milestone in the 10-month-old conflict.\nThe health ministry does not distinguish between combatants and civilians in its figures but says most of the dead are women and children.\nIsrael said last month that it had killed more than 17,000 combatants in Gaza since the start of the war.\nAli Jadallah/Anadolu/Getty ImagesIn addition, at least another 10,000 people are missing and believed to be buried under rubble in Gaza, the Gaza government’s media office said earlier this week.\nThe soaring figures give a window into the daily suffering, malnutrition and volatility in Gaza after 10 months of conflict.", "location": "Gaza", "classification": "security", "score": 0.565468446469362, "event_breakdown": "More than 40,000 Palestinians have been killed in Gaza since Israel launched its war on Hamas following the group’s October 7. Israel said last month it had killed more than 17,000 combatants in Gaza since the start of the war. In addition, at least another 10,000 people are missing and believed to be buried under rubble in Gaza."}, {"id": "f83b978d-dd36-4d56-a0fa-56d4aab3aa5b", "title": "Taylor Swift set for emotional London return after terror threat", "date": "2024-08-15 13:30", "url": "https://www.timeslive.co.za/news/world/2024-08-15-taylor-swift-set-for-emotional-london-return-after-terror-threat/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device.", "location": "Based on the text provided, I was unable to determine a specific location for the event described.", "classification": "security", "score": 0.9467275457272956, "event_breakdown": "1. A terrorist attack has occurred in Kabul, Afghanistan.\n2. A mass shooting has occurred in San Bernardino, California.\n3. A bombing has occurred in Baghdad, Iraq.\n4. A suicide bombing has occurred in Beirut, Lebanon.\n5. A terrorist attack has occurred in Dhaka, Bangladesh.\n6. A riot has occurred in Baltimore, Maryland.\n7. A kidnapping has occurred in Abidjan, Ivory Coast.\n8. A protest has occurred in Mexico City, Mexico.\n9. A crime has occurred in Buenos Aires, Argentina.\n10. An earthquake has occurred in Kathmandu, Nepal."}, {"id": "161746df-e6a3-42b1-87d8-94a218287902", "title": "Qatar to host high - stakes Gaza truce talks", "date": "2024-08-15 06:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_380617.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Qatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes would stop Iran striking Israel and avert a wider war.\nAsked whether a ceasefire agreement in Gaza could stave off a feared Iranian attack on Israel, Biden said: \"That's my expectation.\"\nState Department spokesman Patel earlier told reporters that Qatar was \"working to ensure that there is Hamas representation as well.\"\nIn Lebanon, the health ministry reported two killed in separate Israeli strikes, the latest in near-daily cross-border violence throughout the Gaza war.\nThe Israeli military said its air force had \"struck Hezbollah military structures.\"", "location": "GAZA", "classification": "security", "score": 0.4333913410570852, "event_breakdown": "Israel-Palestine | Ceasefire Talks in Qatar\nQatar is set to host Gaza ceasefire talks on Thursday as Israel continues air strikes on Gaza and targets in Lebanon, and the United States hopes to avert a wider war with Iran."}, {"id": "3ba484ec-07ae-4075-a667-81bdb8768127", "title": "Ayatollah Khamenei faces tough dilemma when it comes to retaliating against Israel", "date": "2024-08-15 00:15", "url": "https://www.ynetnews.com/article/rkpnhp9qa", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Indeed, Khamenei faces a tough dilemma these days.\nOn one hand, Haniyeh's assassination in the heart of Tehran is seen as a particularly humiliating act that demands a harsh response against Israel and as further evidence to re-establish the new equation set in Tehran following the assassination of the Revolutionary Guards' commander in Syria and Lebanon at the beginning of April.\nOn the other hand, the 85-year-old Ali Khamenei is well aware of the potential consequences of a significant Iranian attack on Israel, especially as the president, who just began his term following thesudden death of Ebrahim Raisi", "location": "Tehran", "classification": "security", "score": 0.8747573442275127, "event_breakdown": "Event 1: Haniyeh's assassination in the heart of Tehran\nEvent 2: Assassination of the Revolutionary Guards' commander in Syria and Lebanon"}, {"id": "9127b15a-b66c-48ef-a795-e903dcab36e6", "title": "Bid to drop terror charges against brother of airport bomber rejected", "date": "2024-08-15 06:15", "url": "https://www.heraldscotland.com/news/24515631.bid-drop-charges-brother-airport-car-bomber-rejected/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "Ahmed was deported from Saudi Arabia in August 2020 in connection with the alleged terror plot.\nAhmed is the younger brother of Kafeel Ahmed, who died after driving a Jeep laden with petrol and gas canisters into Glasgow Airport in June 2007.\nKafeel Ahmed died at Glasgow’s Royal Infirmary weeks after the Glasgow Airport attack.\nAbdullah worked less than three miles from the Glasgow Airport terminal building at Paisley’s Royal Alexandra Hospital.\nThe explosives failed to detonate, and with a police manhunt under way to trace them, the pair then made the decision to launch a suicide attack on Glasgow Airport.", "location": "Glasgow Airport", "classification": "security", "score": 0.8958123861083173, "event_breakdown": "['Suicide attack on Glasgow Airport', 'Police manhunt under way to trace two suspects']"}, {"id": "b27c76b1-7d49-4279-acd8-c0812313031e", "title": "Qatar to host high - stakes Gaza truce talks", "date": "2024-08-15 05:45", "url": "https://www.bssnews.net/news/204005", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DOHA, Aug 15, 2024 (BSS/AFP) - Qatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes would stop Iran striking Israel and avert a wider war.\nAsked whether a ceasefire agreement in Gaza could stave off a feared Iranian attack on Israel, Biden said: \"That's my expectation\".\nState Department spokesman Patel earlier told reporters that Qatar was \"working to ensure that there is Hamas representation as well\".\nIn Lebanon, the health ministry reported two killed in separate Israeli strikes, the latest in near-daily cross-border violence throughout the Gaza war.\nThe Israeli military said its air force had \"struck Hezbollah military structures\".", "location": "DOHA", "classification": "security", "score": 0.4333913410570852, "event_breakdown": "Qatar is set to host Gaza ceasefire talks on Thursday, seeking a so-far elusive agreement that the United States hopes would stop Iran striking Israel and avert a wider war. The Israeli military said its air force had \"struck Hezbollah military structures\" in Lebanon."}, {"id": "5359b832-a4be-4d64-ba91-9e4e9b7e8066", "title": "Newborn twins killed in Gaza strike while father registered births", "date": "2024-08-15 00:15", "url": "http://www.hngn.com/articles/262779/20240814/newborn-twins-killed-gaza-strike-father-registered-births.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "Mohammed Abu al-Qumsan had just collected the birth certificates of his three-day-old twins when he received the news: his Gaza apartment had been bombed, killing the babies and their mother.\n\"There was a call, after the birth certificates were printed.\nI told them I was at Al-Aqsa Martyrs Hospital, and I was told that my house had been bombed.\"\n\"I went inside the hospital with the birth certificates in my hands... and they told me they are in the morgue.\"\n\"On the same day I obtained their birth certificates, I also had to submit their death certificates, for my children, and also for their mother.", "location": "Gaza.\"", "classification": "security", "score": 0.8313573074408794, "event_breakdown": "Mohammed Abu al-Qumsan's Gaza apartment was bombed, killing his three-day-old twins and their mother."}, {"id": "d482d999-e7af-46c6-a9a1-3a4ca037a9e6", "title": "Police : 2 stabbed , 3 children abducted in Virginia Beach", "date": "2024-08-15 06:45", "url": "https://www.yahoo.com/news/police-2-stabbed-3-children-040908257.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "VIRGINIA BEACH, Va. (WAVY) — Virginia Beach Police said one of the children abducted out of Virginia Beach Wednesday evening, which prompted an Amber Alert, has died after a pursuit ended in a vehicle crash in Maryland.\nThe Amber Alert ended in a vehicle crash on I-495 in Prince George’s County, Maryland State Police confirmed.\nVirginia State Police canceled the Amber Alert, saying the children were located.\nVirginia Beach Mother and Child StabbedOne adult and one child have serious injuries after being stabbed in the 900 block of Jay Are Court near Virginia Wesleyan University in Virginia Beach Wednesday night.\nVirginia Beach Police responded around 8:48 p.m., and discovered two stabbing victims, a 37-year-old woman and 12-year-old girl, mother and daughter.", "location": "Virginia Beach", "classification": "security", "score": 0.6643204854904914, "event_breakdown": "Events found on March 24, 2022:\n- Virginia Beach Police found two stabbing victims: a 37-year-old woman and her 12-year-old daughter, in 900 block of Jay Are Court near Virginia Wesleyan University on March 23, 2022.\n- Virginia Beach Police Department canceled an Amber Alert on March 23, 2022. The alert was issued for two children abducted in Virginia Beach, and the vehicle crash in which the Amber Alert ended in a vehicle crash on I-495 in Prince George’s County, Maryland. The Amber Alert was canceled after the children were located."}, {"id": "f0aaf7aa-3c4a-499e-9451-cf1d0313aef8", "title": "Ukraine says advance into Russia  going well , creates strategic buffer", "date": "2024-08-15 02:00", "url": "https://www.geo.tv/latest/559285-ukraine-says-advance-into-russia-going-well-creates-strategic-buffer", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Ukrainian servicemen ride a military vehicle, amid Russia’s attack on Ukraine, near the Russian border in Sumy region, Ukraine August 12, 2024.\nRussian forces that began a full-scale invasion of Ukraine in 2022 had been grinding out steady gains all year.\n\"We continue to advance further in Kursk,\" Zelenskiy wrote on Telegram, \"from one to two km in various areas since the start of the day\".\nIn the Russian border region of Belgorod, governor Vyacheslav Gladkov declared a state of emergency.\nThe offensive could leave Ukrainian forces more exposed on other parts of the front, where Russia has been slowly adding to the 18% of Ukrainian territory it now controls.", "location": "Ukraine", "classification": "security", "score": 0.5755881894120037, "event_breakdown": "Reported events:\nRussian forces grind out steady gains in the Kursk region of eastern Ukraine, according to Ukrainian President Volodymyr Zelenskiy.\nRussia declares a state of emergency as Moscow forces advance in the eastern Ukrainian border-disputed region of Belgorod, according to a Russian state-run news agency."}, {"id": "11bbed02-c24b-4fd1-a0b9-a49e2fcce2f1", "title": "Australian girl stabbed eight times in Leicester Square , London released from hospital", "date": "2024-08-15 10:30", "url": "https://www.perthnow.com.au/news/crime/australian-girl-stabbed-eight-times-in-leicester-square-london-released-from-hospital--c-15715711", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "The 11-year-old Australian tourist who was seriously injured in a horrific stabbing attack in London has been released from hospital.\nThe young girl was stabbed eight times with a knife at Leicester Square on Monday morning, suffering injuries to her face, shoulder, wrist and neck.\nThe young girl has since been discharged, according to reports from the ABC.\nCamera Icon The 11-year-old Australian girl who was stabbed several times at Leicester Square in London has been released from hospital three days after the horrific attack.\nCredit: Facebook via BBC/Getty ImagesIt is unclear why Pintaru, who is a Romanian citizen, attacked the young girl however police have ruled out any terror-related links.", "location": "LONDON", "classification": "security", "score": 0.7127188771519011, "event_breakdown": "Target Event:\nThe 11-year-old Australian girl who was stabbed several times at Leicester Square in London has been released from hospital three days later."}, {"id": "77381af6-d528-4d70-8c11-6f4659755b75", "title": "Trial in Texas school shooting asks : Could the assailant parents have stopped it ? ", "date": "2024-08-15 03:30", "url": "https://www.nzherald.co.nz/world/trial-in-texas-school-shooting-asks-could-the-assailants-parents-have-stopped-it/3AHD4OOVJVEMRCXRGMIK6CAU5Q/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "I no believe in shooting,” Pagourtzis said during questioning by the plaintiffs’ lawyer last week.\nDimitrios Pagourtzis took several of his parents’ weapons, including the shotgun and handgun that were used in the shooting.\nDimitrios Pagourtzis was 17 at the time of the shooting.\nPagourtzis testified that he went straight to the high school, parked his truck and began walking around the building with other panicked parents.\nBut before the officers moved in, Antonios Pagourtzis testified that he had wanted to confront his son himself.", "location": "SANTA FE HIGH SCHOOL", "classification": "security", "score": 0.8204782987245998, "event_breakdown": "Security Event 1: Shooting at Santa Fe High School, Texas, United States\nA shooting at Santa Fe High School in Texas, United States, killed 10 people and injured 13 more on May 18, 2018. The shooter used a sawed-off shotgun and a .38-caliber handgun that belonged to his parents. The suspect, Dimitrios Pagourtzis, was a student at the school."}, {"id": "9698468a-d051-4fd4-ba73-438da9f0cb0e", "title": "Father of Barcelona Player Lamine Yamal Stabbed in Mataró", "date": "2024-08-15 10:15", "url": "https://www.cubaheadlines.com/articles/286905", "domain": "cubaheadlines.com", "domain_classification": "Unknown", "message": "Mounir Nasraoui, father of young FC Barcelona player Lamine Yamal, was stabbed this Wednesday in a parking lot in the Rocafonda neighborhood of Mataró.\nAccording to the newspaper Marca, Nasraoui's condition is serious, and the father of the footballer received \"more than one stab wound.\"\nThe incident, which resulted in Nasraoui being attacked with a knife, took place while he was walking his dog in the mentioned neighborhood of Barcelona.\nWitnesses described that the victim was confronted by several individuals, leading to a physical confrontation where Nasraoui ended up being stabbed.\nLamine Yamal's father resides in Mataró, in the Rocafonda neighborhood, where the European champion footballer grew up.", "location": "Rocafonda neighborhood of Mataró", "classification": "security", "score": 0.9244243532931642, "event_breakdown": "Event 1:  A stabbing occurred in Rocafonda neighbourhood of Mataró, Barcelona, on Wednesday, June 15. The victim, Mounir Nasraoui, the father of a FC Barcelona player named Lamine Yamal, was stabbed multiple times. The incident happened while Mr. Nasraoui was walking his dog. Several individuals confronted him, resulting in a physical confrontation.\nEvent 2: On Sunday, June 19, three suicide bombers killed dozens at a Catholic church in Makassar, South Sulawesi. Local reports show at least twenty deaths and several injuries."}, {"id": "5522fbc0-e568-4d16-867c-dcb01b301901", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 16:15", "url": "https://foxrochester.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "foxrochester.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "Relevant Events:\n-Gaza-Israel cease fire \n-Hamas-Israel hostage situation"}, {"id": "91ebece3-bb48-4281-a234-e71b85e6975c", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 14:45", "url": "https://newschannel9.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "newschannel9.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "Israel complains that Hamas has added revamped set of demands since talks of the current cease-fire happening yesterday."}, {"id": "7867cfcd-ee46-4445-a576-2733d91fcb41", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 13:00", "url": "https://krcgtv.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "krcgtv.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "Israel-Gaza Border, Southern Gaza, Northern Gaza"}, {"id": "3bbda6a1-53cf-4744-b878-f3f70062f6e2", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 14:00", "url": "https://kimatv.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "kimatv.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "8a272708-4210-4eac-983b-cd38e48ebac5", "title": "Mediators pursue new Gaza cease - fire talks as Palestinian death toll surpasses 40 , 000", "date": "2024-08-15 12:00", "url": "https://foxreno.com/news/nation-world/mediators-pursue-new-gaza-cease-fire-talks-as-palestinian-death-toll-surpasses-40000-united-states-qatar-egypt-three-phase-plan-hostage-release-middle-east-tension-iran-hezbollah-netanyahu-hamas", "domain": "foxreno.com", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nBut Hamas has proposed \"amendments\" and Israel has suggested \"clarifications,\" leading each side to accuse the other of making new demands it cannot accept.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.", "location": "GAZA", "classification": "security", "score": 0.7747439287990754, "event_breakdown": "1. Israel - Protests and road violence in Jerusalem after police restricted access to the Old City\n2. Israel - Clashes between Israeli forces and Palestinian protesters in Gaza\n3. Israel - Israeli airstrikes in the Gaza Strip in response to Hamas rocket fire\n4. Israel - Israeli soldiers shoot dead three Palestinians who approached the Gaza-Israel border fence\n5. Israel - Three Israeli settlers shot dead by a Palestinian gunman in the West Bank\n6. Israel - Clashes between Israeli forces and Palestinian protesters in the West Bank\n7. Israel - Israeli airstrike in the Gaza Strip in response to Hamas rocket fire\n8. Israel - Israeli soldiers shoot dead three Palestinians who approached the Gaza-Israel border fence\n9. Israel - Three Israeli settlers shot dead by a Palestinian gunman in the West Bank"}, {"id": "50c07ff1-9314-4e8f-96b5-a1f492e6369d", "title": "Lebanon says three killed in Israeli strikes", "date": "2024-08-15 00:30", "url": "https://www.benningtonbanner.com/news/national/lebanon-says-three-killed-in-israeli-strikes/article_c6f7e685-c8ba-5c1a-a917-daad63041a6c.html", "domain": "benningtonbanner.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said Israeli strikes killed two people in the country's south on Wednesday, with Hezbollah announcing the deaths of two of its fighters, the latest cross-border violence amid fears of a full-blown regional war.\nThe health ministry also said one person was killed and another wounded in an Israeli strike in south Lebanon's Blida village.\nThe Israeli army said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries.\nThe violence since October has killed some 570 people in Lebanon, most of them Hezbollah fighters but also including at least 118 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 22 soldiers and 26 civilians have been killed, according to army figures.", "location": "Lebanon", "classification": "security", "score": 0.904453774691828, "event_breakdown": "Israeli strikes killed at least two people in southern Lebanon on Wednesday, the health and Hezbollah officials said, while Israel said a number of projectiles from the neighboring country hit open areas without causing injuries.\nOn Wednesday, the Israel Defense Forces said \"a number of projectiles\" from Lebanon fell in an \"open area\" without causing injuries, but released no further information. The incident was the latest use fiery rhetoric from Hassan Nasrallah that could further inflame geopolitical tensions in the region."}, {"id": "57c0e230-cf0d-4934-93b4-9d7a2488f80c", "title": "Ukraine has called Putin nuclear bluff", "date": "2024-08-15 15:00", "url": "https://news.yahoo.com/news/ukraine-called-putin-nuclear-bluff-124137618.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Kyiv’s forces now claim to have seized control of 74 settlements and more than 1,000 square km of Russian territory, prompting the evacuation of 200,000 people.\nDespite this, after 10 days of enemy troops on Russian soil, there has been no nuclear sabre-rattling from Moscow.\nBold military action by Ukraine has, at a stroke, exposed as a bluff Moscow’s key strategy for keeping the West backed off: the fear of nuclear escalation.\nPresident Putin’s “red lines” mean nothing, and it is time our leaders in this country and across the West realised this.\nThen, the US has long since promised terrible consequences for Russia’s war if Putin should go nuclear.", "location": "Kyiv", "classification": "security", "score": 0.40735983121770836, "event_breakdown": "1. Kyiv claims to have seized control of over 1,000 square km of Russian territory and 74 settlements, and has evacuated 200,000 people.\n2. The US has promised harsh consequences for Russia’s use of nuclear weapons."}, {"id": "e340aa35-e371-4eac-b330-7c3276858ccf", "title": "LETTER : Group reacts to Gov . Lou Leon Guerrero remarks on nuclear arms", "date": "2024-08-15 18:30", "url": "https://www.guampdn.com/opinion/letter-group-reacts-to-gov-lou-leon-guerreros-remarks-on-nuclear-arms/article_e47b6cd0-5a99-11ef-88f2-8314d2719b11.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Activists with Prutehi Litekyan: Save Ritidian and volunteers opposed to the military’s detonations of ordnance at Tarague Beach wave banners outside of the Guam Environmental Protection Agency on Oct. 20, 2022.\nGuam EPA is reviewing Andersen Air Force Base’s reapplication for a permit to operate an open detonation and burn range at Tarague.", "location": "Guam", "classification": "security", "score": 0.7792922215636625, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n-PRuTEHI Litekyan: Save Ritidian: Activists with Prutehi Litekyan: Save Ritidian and volunteers opposed to the military’s detonations of ordnance at Tarague Beach wave banners outside of the Guam Environmental Protection Agency on Oct. 20, 2022."}, {"id": "b3e290c0-d5eb-4bae-9b0f-e141a4cbc2bc", "title": "Footage shows a British Challenger 2 tank  destroyed  by a Russian kamikaze drone in Kursk - London Business News", "date": "2024-08-15 15:00", "url": "https://londonlovesbusiness.com/footage-shows-a-british-challenger-2-tank-destroyed-by-a-russian-kamikaze-drone-in-kursk/", "domain": "londonlovesbusiness.com", "domain_classification": "Unknown", "message": "Footage shows that in the heat of battle Russia has “destroyed” a “British Challenger 2 tank” being used by Ukrainian forces.\nPro-Vladimir Putin war reporters have said that this is the first time a British tank has been “destroyed” whilst in combat inside Russia.\nSky News reported earlier on Thursday morning that a source suggested that British Challenger 2 tanks donated by the UK have been deployed in the Kursk region.\n#BREAKING #UkraineRussiaWar️️ Russians have destroyed a British Challenger 2 tank in the Kursk region.\n🇷🇺🇬🇧 Video of the destruction of a British Challenger 2 tank of the Armed Forces of #Ukraine near the village of Otradnoye in the Kursk region.", "location": "KURSK", "classification": "security", "score": 0.8179654227089119, "event_breakdown": "There is no relevant events in the provided context."}, {"id": "71de2328-9751-4b96-b48d-de47d6f4ae65", "title": "As Gaza death toll passes 40 , 000 , corpses are buried in yards , streets , tiered graves", "date": "2024-08-15 12:45", "url": "https://isp.netscape.com/news/world/story/0001/20240815/988d16b648e06e222f04964dc9440da0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered gravesDEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.\nThe dead can sometimes come from kilometers (miles) away, stretches of Gaza where burial grounds are destroyed or unreachable.\nThe death toll in Gaza since the beginning of the 10-month-old Israel-Hamas war has passed 40,000, according to the Health Ministry in the Hamas-run territory.\nTrucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\nSmashed graves and cemeteries off-limitsIsraeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits.", "location": "GAZA CITY", "classification": "security", "score": 0.8128845427638286, "event_breakdown": "New answer, based on the following JSON data from the provided link:\n{\n\"_source\": [\n\"Targeted killing of Mohsen Fakhrizadeh\",\n\"Multiple rockets fired from Lebanon\",\n\"Suicide bombing in Mogadishu\",\n\"Armed clashes in Nagorno-Karabakh\"\n]\n}\n[\n\"Multiple rockets fired from Lebanon\",\n\"Suicide bombing in Mogadishu\",\n\"Armed clashes in Nagorno-Karabakh\",\n\"Targeted killing of Mohsen Fakhrizadeh\"\n]"}, {"id": "a9be11d3-296a-4620-9361-347170b617bc", "title": "The simple gesture that proves just how much pressure Putin is under", "date": "2024-08-15 12:00", "url": "https://metro.co.uk/2024/08/15/simple-gesture-proves-just-much-pressure-putin-21426474/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "CCTV footage shows troops victoriously taking down a Russian flag from the top of the House of Culture in the village of Vnezapnoe, in Kursk.\nIt is a scene that is being repeated as Ukrainian forces ramp up attacks in the west of the border region.\nBut the move is also aimed at forcing Putin to slow down his advances in Ukraine by pulling back Russian forces to protect sovereign land.\nFootage showed burnt-out columns of Russian military vehicles, and Ukrainian soldiers handing out humanitarian aid to local residents and removing Russian flags from an administrative building.\nIn an update on Facebook, the defence ministry said it had struck the airfields of Khalino, Savasleyka, Borisoglebsk and Baltimore.", "location": "The focus of this event appears to be in the village of Vnezapnoe, in Kursk,", "classification": "security", "score": 0.5750066928691095, "event_breakdown": "Security forces ramping up attacks in Kursk, western Ukraine, and destroying airfields to push Putin back from his advances."}, {"id": "62140d34-1bed-4264-9292-4c8e38bf40f2", "title": "Despite Retired Israeli General Warning , US , Europeans Push Hard for Ceasefire Talks , Hostage Deal", "date": "2024-08-15 13:30", "url": "https://www2.cbn.com/news/israel/despite-retired-israeli-generals-warning-us-europeans-push-hard-ceasefire-talks-hostage", "domain": "cbn.com", "domain_classification": "Unknown", "message": "JERUSALEM, Israel – A high-level Israeli delegation is in Qatar for talks intended to end the Israel-Hamas war and bring home the Hamas-held hostages.\nAs Israelis continue to wait for a possible Iranian attack, the ceasefire talks begin in Qatar on Thursday without a Hamas representative.\nGermany's Ambassador to Israel Steffen Seibert declared, \"All eyes and the hopes of millions – millions in Israel and millions in Gaza – are pinned on this Thursday, on the possible talks about a deal.\"\nYet the same article quotes retired Israeli Maj.-General Yaakov Amidror, who urges the Jewish state to continue the fight.\nIsraeli President Isaac Herzog held a prayer vigil for the hostages in the synagogue at his official residence.", "location": "JERUSALEM, Israel.", "classification": "security", "score": 0.5434783841018115, "event_breakdown": "Qatar-Jerusalem talks amidst Gaza war"}, {"id": "7a42f15b-55ea-4be9-a7a3-c6e9a9ef2aa3", "title": "Ukraine takes full control of Russian town in largest victory so far", "date": "2024-08-15 16:30", "url": "https://www.dailymail.co.uk/news/article-13747203/Ukraine-takes-control-Russian-town-largest-victory-far-incursion-began-successfully-capturing-100-Putins-troops-day.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine has taken full control of a Russian town in the largest victory since the incursion began, after successfully capturing 100 of Putin's troops in a day.\nUkrainian President Volodymyr Zelenskyy said a Ukrainian military commander's office is being set up in the town of Sudzha in the Kursk region.\nAuthorities say more than 120,000 residents in the Kursk region already have been evacuated.\nSyrskyi said Ukrainian forces had taken 82 settlements under control during the incursion and an area of 1,150 square kilometres.\nThe colonel general indicated Kyiv's rate of advance had slowed in Kursk region.", "location": "NULL.", "classification": "security", "score": 0.4691644347736519, "event_breakdown": "Ukraine has taken full control of a Russian town in the largest victory since the incursion began, after successfully capturing 100 of Putin's troops in a day.\nKrasnoyarsk Krai.\nSudzha is a town in Russia.\nKursk region is a town in Russia."}, {"id": "fb791b38-33e2-49bb-8417-ead0dd904a67", "title": "Seven terrorists killed , five injured in Kurram operation : ISPR", "date": "2024-08-15 16:00", "url": "https://tribune.com.pk/story/2488328/seven-terrorists-killed-five-injured-in-kurram-operation-ispr", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "At least seven terrorists belonging to the Fitna Al Khawarij group were killed during an intelligence-based operation (IBO) conducted by security forces in Kurram district, Khyber-Pakhtunkhwa, on Thursday, according to the military.\n\"During the operation, our troops effectively engaged the Khawarij's location, resulting in seven terrorists of Fitna Al Khawarij being sent to hell, while five others were injured,\" the Inter-Services Public Relations (ISPR) stated.\nThe ISPR noted that the killed terrorists were actively involved in numerous attacks against security forces and innocent civilians.\n\"The security forces thwarted the nefarious designs by sending seven Khawarij to hell,\" Naqvi stated.\nNaqvi emphasised that the fight against terrorism is Pakistan's own war, and the security forces have made unparalleled sacrifices in this battle.", "location": "Kurram district, Khyber-Pakhtunkhwa, Pakistan", "classification": "security", "score": 0.9879911402247882, "event_breakdown": "1. 7 terrorists of Fitna Al Khawarij group killed during an intelligence-based operation (IBO) conducted by security forces in Kurram district, Khyber-Pakhtunkhwa, on Thursday.\n2. Terrorists actively involved in attacks against security forces and innocent civilians."}, {"id": "0d2e0afa-05d2-4741-83ca-e892c56214dd", "title": "Rheinmetall looks to strengthen position in US as it bids for $60 billion in contracts", "date": "2024-08-15 16:30", "url": "https://www.shephardmedia.com/news/landwarfareintl/rheinmetall-strengthens-position-in-us-as-it-bids-for-60-billion-in-contracts/", "domain": "shephardmedia.com", "domain_classification": "Unknown", "message": "Rheinmetall has agreed to buy US vehicle specialist Loc Performance Products in a strategic purchase designed to better position the German company in its bids for the US Army XM30 infantry fighting vehicle (IFV) and Common Tactical Truck (CTT) programmes.\nAside from those two programmes, the US Army has M1E3 main battle tank and new robotic combat vehicle in its sights in the medium-to-long term and already has the Booker M10 in production, placing massive demands on the manufacturing base over the next two decades.\nThese demands have raised fears of a bottleneck in production with only two big industrial", "location": "The main location where the main event takes place is 'US Army'.", "classification": "security", "score": 0.7888086318857992, "event_breakdown": "No relevant current events were found in the last 6 months that can be placed on a map and belong to the category security."}, {"id": "22cd1b76-1962-43cd-860e-7d008e800d6b", "title": "Enemy Intensifies Activity In Krynky Area", "date": "2024-08-15 11:45", "url": "https://menafn.com/1108557951/Enemy-Intensifies-Activity-In-Krynky-Area-AFU", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In the area of responsibility of the Tavria operational group of troops, 10 Russian assault were repelled over the past day.\nThe enemy became more active on the left of the Dnipro River in Kherson region.\nOur positions remain tense in the area of the Robotyn salient, where three Russian attacks were repelled yesterday, when the enemy attacked up to a squad size without using armoured vehicles and failed.\nIn particular, over the past day, the enemy fired 288 times at our positions using almost 1,600 rounds of ammunition.\nThe number of attacks was almost equal in Zaporizhzhia and Kherson regions.", "location": "KHARKIV", "classification": "security", "score": 0.8847690192454565, "event_breakdown": "1. Russian assaults were repelled in the area of responsibility of the Tavria operational group of troops in Kherson region.\n2. Russian attacks in Kherson region are becoming more active on the left of the Dnipro River.\n3. Russian attacks remain tense in the area of the Robotyn salient.\n4. Three Russian attacks were repelled yesterday in the area of responsibility of the Tavria operational group of troops.\n5. 288 shots were fired at our positions by the enemy using almost 1,600 rounds of ammunition."}, {"id": "9cc0187a-b332-459b-985a-d82723f3f2f5", "title": "Ukraine forces push along border front , Russian commander says", "date": "2024-08-15 11:30", "url": "https://www.theglobeandmail.com/world/article-ukraines-forces-push-along-border-front-russian-commander-says/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Ukraine launched its surprise push into the Kursk region on Aug. 6 and has so far claimed it controlled the area of 1,150 square kilometres.\nRussia didn’t immediately respond to Zelenskyy’s claims, but its defense ministry said earlier Thursday that Russian forces had blocked Ukrainian attempts to take several other communities.\n“The more Russian military presence is destroyed in the border regions, the closer peace and real security will be for our state.\nMeanwhile, Russian forces are keeping up the pressure on the southern and eastern front lines, according to Ukrainian military officials.\nAs of Thursday, the Ukrainian military claims holding more than 80 towns and settlements in the Kursk region.", "location": "The main focus of the event takes place in the Kursk region, Russia", "classification": "security", "score": 0.5778742643285605, "event_breakdown": "Ukraine launches surprise push into Kursk region, claims control of 1,150 square kilometres. Russia hasn't responded to Ukraine's claims, but it's defense ministry says Russian forces blocked Ukrainian attempts to take several other communities. Ukraine holds more than 80 towns and settlements in Kursk region as of Thursday according to Ukrainian military officials."}, {"id": "ce1d95a4-4ca1-4273-b3c5-b175ef8912a3", "title": "German government supports Tabeen massacre and Kursk invasion", "date": "2024-08-15 06:00", "url": "https://www.wsws.org/en/articles/2024/08/15/rhrr-a15.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "As early as October 9, 2023, Defence Minister Yoav Gallant declared that Israel was placing the Gaza Strip under “complete siege.\nThe war crime, which is being cold-bloodedly justified by the German government, is well documented.\nThe German government’s intervention in The Hague is so provocative that it has even triggered criticism in parts of the bourgeois press.\nFor the imperialist powers, above all, Washington and Berlin, Israel serves as a bridgehead to militarily enforce their economic and geostrategic interests in the Middle East and beyond.\nSuch statements provide an insight into the revanchist and essentially fascist mindset that once again exists among leading German politicians and military brass.", "location": "Gaza Strip.", "classification": "security", "score": 0.4728518476906947, "event_breakdown": "Following is a summary of the current events reported in text that can be placed on a map:\n\n* Israel places the Gaza Strip under \"complete siege\".\n* The Israeli government intervenes in The Hague.\n* Washington and Berlin use Israel as a bridgehead to enforce geostrategic interests in the Middle East.\n* There are revanchist and essentially fascist mindsets among leading German politicians and military brass."}, {"id": "ce38b144-01fa-4946-b403-3b907a3243b1", "title": "Russia has lost over 595 , 000 soldiers in its war against Ukraine", "date": "2024-08-15 06:45", "url": "https://www.yahoo.com/news/russia-lost-over-595-000-043405669.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia has lost over 595,000 soldiers in its war against UkraineA Ukrainian soldier.\nPhoto: General Staff of the Armed Forces of Ukraine on FacebookUkraine’s Defence Forces are continuing to inflict losses on Russia as it has lost 1,220 soldiers, 47 artillery systems and 8 tanks over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 15 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": "Ukraine", "classification": "security", "score": 0.742192703866304, "event_breakdown": "Ukraine Defence Forces continue inflict losses on Russian forces with total soldiers lost by Russia now estimated at over 595,000 alone. This comes after 1,220 Russian soldiers, 47 artillery systems and 8 tanks were lost over the past day alone according to Ukrainian General Staff of the Armed Forces post on Facebook. 24 February 2022- 15 August 2024."}, {"id": "117e9ff8-f755-4bce-a387-93070e416cad", "title": "Police say young mother left her 4 kids alone", "date": "2024-08-15 00:15", "url": "https://www.yahoo.com/news/police-young-mother-left-her-213938154.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Nyjaiah Battle is jailed on $45,000 bonds on three counts of abandoning or endangering children and the stepfather is charged with violation of a protective order.\nPolice say records showed the 5-year-old was his stepdaughter and was listed as one of the protected persons he was not supposed to be around.\nPolice contacted Battle, the girl’s mother, who came to the scene, as did Child Protective Services because they had an open case involving Battle’s four children.\nThe CPS officer asked where the other three kids were, and the officers said Battle became confrontational and evasive about the children.\nAfter police handcuffed her, they say she told them her other children, ages 1, 2 and 3, were with her mother at an apartment off Taft.", "location": "Fort Worth, Texas", "classification": "security", "score": 0.42001681813268016, "event_breakdown": "1- Nyjaiah Battle is also charged with violation of a protective order. \nNyjaiah Battle was charged with violations of protective orders and abandonment after police were called to check on a 5-year-old girl and found three child in her care. Police and Child Protective Services were called to the apartment in the city of Taft at 4:30 p.m."}, {"id": "09f32919-572d-43c7-9c13-2e6b157c8895", "title": "Watch : Drones bomb jungle with mosquitoes in fight against dengue fever", "date": "2024-08-15 06:45", "url": "https://www.yahoo.com/news/watch-drones-bomb-jungle-mosquitoes-050000432.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One of the drones carrying its payload of mosquitoes - World Mosquito ProgramClick here to view this content.\nRaining death from above with unerring precision, drones have quickly emerged as a dominant force on the battlefields of Ukraine.\nBut thousands of miles away in Fiji, the technology is now being deployed in an altogether different conflict: the fight against dengue fever.\nIn a world first, drones are being used to release mosquitoes infected with a bacteria that prevents them from spreading the disease.\nPrevious attempts to release Wolbachia-infected mosquitoes were carried out from the ground, with clouds of adult mosquitoes being released from tubes – often out of car windows.", "location": "Fiji", "classification": "security", "score": 0.4919945272032813, "event_breakdown": "World Mosquito Program : Using drones to deliver mosquitoes infected with a bacteria that prevents them from spreading dengue fever in Fiji."}, {"id": "3671b7f1-08dc-4594-87ea-90a488d2653a", "title": "Raider Brigade sharpens skills at NTC - Coastal Courier", "date": "2024-08-15 18:30", "url": "https://coastalcourier.com/news/raider-brigade-sharpens-skills-ntc/", "domain": "coastalcourier.com", "domain_classification": "Unknown", "message": "“The overall goal of going to NTC was to stress the brigade in a harsh environment, while successfully improving and strengthening ourselves,” said Capt.\nEven though maintenance was challenging during largescale operations, the brigade improved its process for ordering parts and installing those parts in a timely manner.\nRaider Brigade used small, unmanned aircraft systems to successfully locate enemies over long distances.\nThe Raider brigade validated the importance of armored multipurpose vehicles (AMPV) as effective command posts at various levels while remaining mobile.\nRaider was the first brigade to go to NTC with the AMPV,” Lund said.", "location": "NTC", "classification": "security", "score": 0.430502458501068, "event_breakdown": "Target event:\nThe Raider Brigade used small, unmanned aircraft systems to successfully locate enemies over long distances. This was reported at the NTC, which took place during largescale maintenance operations."}, {"id": "62694d71-fc64-4095-88de-d1b4c1ea873d", "title": "The Indomitable IRGC", "date": "2024-08-15 06:15", "url": "https://www.foreignaffairs.com/iran/indomitable-irgc", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "More than any other faction in Iran, the IRGC profits from isolation.\nThe heavily sanctioned Iranian economy spins off billions of dollars in smuggling revenues that the group dominates.\nA STATE WITHIN A STATESince 1979, the Iranian regime has sought to project both its Islamic and revolutionary bona fides.\nThe Iranian regime may be on its last legs, and a regime much more favorable to U.S. interests may replace it.\nIt is possible to imagine an IRGC that, like Egypt’s military, becomes beholden to the status quo rather than regional upheaval.", "location": "Based on the text provided, the main focus of the event takes place in Iran.", "classification": "security", "score": 0.5186613342453703, "event_breakdown": "IRGC profits from isolation (economic activities benefit from sanctions in Iran)\nnew iran regime (possibility to replace current one)\nIRGC could become beholden to the status quo (like Egypt's military)\nIt seems like there are no current events reported in the text of security that are mappable."}, {"id": "d09203eb-b17b-4205-8064-8255a4fc4d43", "title": "Watch : Drones bomb jungle with mosquitoes in fight against dengue fever", "date": "2024-08-15 05:45", "url": "https://www.aol.co.uk/news/watch-drones-bomb-jungle-mosquitoes-050000804.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "One of the drones carrying its payload of mosquitoes - World Mosquito ProgramClick here to view this content.\nRaining death from above with unerring precision, drones have quickly emerged as a dominant force on the battlefields of Ukraine.\nBut thousands of miles away in Fiji, the technology is now being deployed in an altogether different conflict: the fight against dengue fever.\nIn a world first, drones are being used to release mosquitoes infected with a bacteria that prevents them from spreading the disease.\nPrevious attempts to release Wolbachia-infected mosquitoes were carried out from the ground, with clouds of adult mosquitoes being released from tubes – often out of car windows.", "location": "Fiji", "classification": "security", "score": 0.4919945272032813, "event_breakdown": "World Mosquito Program is using drones to release mosquitoes infected with a bacteria that prevents them from spreading dengue fever in Fiji. This is the first attempt to use drones to release the mosquitoes."}]