[{"id": "b8c12313-82e8-4ebc-aee6-ebc08e0ab0a0", "title": "Two killed after Russian strike  wipes out  Ukraine hotel with fears survivors trapped - World News", "date": "2024-08-27 08:30", "url": "https://www.mirror.co.uk/news/world-news/two-killed-after-russian-strike-33542994", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Hotel administrator Yulia said she had moved some guests to another building in the complex due to power cuts caused by Russian bombing on Monday.\nEveryone else had a single room.”Image: Emergency Service of Ukraine; e2w news) Emergency Service of Ukraine; e2w news)She said: “We didn't hear any sounds, we didn't see any flashes, there was just a powerful explosion that threw us all in different corners.\nSix shops, four buildings and eight cars were damaged in this Russian strike.\nImage: Emergency Service of Ukraine; e2w news) Emergency Service of Ukraine; e2w news)Another hotel was struck by Russian forces on August 24, in Kramatorsk in Donetsk region.\nThe strike followed one of the worst days of Russian missile attacks in the two-and-a-half year war.", "location": ".\nKYIV, UKRAINE", "classification": "security", "score": 0.48032764422779395, "event_breakdown": "Russian attack on the Hotel complex in Mykilska Slobidka, Donetsk region, Ukraine on Monday."}, {"id": "cd33b94a-95a6-43cd-b093-887df11605db", "title": "Israel and Hezbollah step back from war , but for how long ? All eyes are now on Iran next move", "date": "2024-08-27 02:30", "url": "https://theconversation.com/israel-and-hezbollah-step-back-from-war-but-for-how-long-all-eyes-are-now-on-irans-next-move-237463", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "How both sides are seeing thingsClearly, both Israel and Hezbollah have stepped back at this stage from any further action.\nAt the same time, Hezbollah retaliated by sending a large number of Katyusha rockets into northern Israel.\nIn addition, about 60,000 Israelis have had to evacuate their homes in northern Israel and are living in temporary accommodation due to the Hezbollah threat.\nIsrael’s military has now been been fighting Hamas in Gaza, and to some extent, protecting northern Israel from Hezbollah attacks for nearly 11 months.\nTo do that, he must re-establish the confidence of those who live in northern Israel and stop the attacks from Hezbollah.", "location": "Israel", "classification": "security", "score": 0.7828597139863346, "event_breakdown": "Israel has been fighting Hamas in Gaza for 11 months, and Hezbollah has attacked northern Israel with rockets."}, {"id": "12ca224d-921b-471c-a749-51d68fbc13ff", "title": "Israel and Hezbollah Talk Down Escalation After Exchange of Strikes", "date": "2024-08-27 08:45", "url": "https://www.theepochtimes.com/world/israel-and-hezbollah-talk-down-escalation-after-exchange-of-strikes-5713402", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Hezbollah said it had launched more than 320 rockets at Israel overnight, targeting a string of military positions.\nThe Israeli military announced early August 25, 2024 that it was conducting defensive strikes in Lebanon after detecting preparations for \"large-scale\" attacks by the Iran-backed militant group Hezbollah.\nHezbollah said it had launched more than 320 rockets at Israel overnight, targeting a string of military positions.\nLebanese authorities said three people were killed in the Israeli strikes.\nBut he reserved the right to carry on its attack on Israel if Hezbollah deemed it necessary.", "location": "Lebanon", "classification": "security", "score": 0.97994194782024, "event_breakdown": "Israeli military conducting defensive strikes in Lebanon after detecting preparations for \"large-scale\" attacks by Hezbollah; Hezbollah said they had launched more than 320 rockets at Israel overnight, targeting a string of military positions; Lebanese authorities said three people were killed in the Israeli strikes."}, {"id": "5534684f-9444-4388-b7af-f6da1bba5c74", "title": "Experts warn Oct . 7 attack would look like a picnic compared to when Hezbollah launches major assault on Israel – NaturalNews . com", "date": "2024-08-27 08:30", "url": "https://www.naturalnews.com/2024-08-26-oct7-attack-nothing-compared-to-hezbollah-assault.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "Experts warn Oct. 7 attack would look like a picnic compared to when Hezbollah launches major assault on IsraelExperts have issued grave warnings that Hezbollah may be poised to launch a major assault on Israel following a decade of meticulous planning and the development of an extensive tunnel network.\nHezbollah's tunnel network serves various functions, including facilitating military operations, smuggling and storing weapons.\n(Related: Hezbollah launches 200 rockets, drones toward Israel following killing of senior commander.)\nThe group's tunnel network is extensive, with some tunnels large enough to accommodate trucks, complete with electricity and air conditioning.\nHezbollah has recently showcased its hidden terror tunnel network in a chilling video, revealing vast underground corridors capable of housing large weapons shipments.", "location": "Lebanon", "classification": "security", "score": 0.5414738993356253, "event_breakdown": "Hezbollah has recently showcased its hidden terror tunnel network in a chilling video, revealing vast underground corridors capable of housing large weapons shipments near the border with Israel."}, {"id": "53b49dad-9a74-475e-9a40-d6d1acd76a18", "title": "", "date": "2024-08-27 07:00", "url": "https://www.israelnationalnews.com/news/395227", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Recently, an Iranian official warned that if Israel struck at their nuclear sites, they could reconsider their official stance on the development of nuclear weapons and potentially target Israeli nuclear facilities.\nAn attack by Iran inside Israel’s borders would constitute an existential crisis for Israel that can only be met with maximum force.\nIt’s up to Iran to keep its militias, missiles, and proxies outside Israel proper or suffer the consequences.\nIn April, 350 rockets were fired at Israel by Iran and its allies in Iraq, Syria, Yemen and Lebanon.\nPound Hezbollah to the Litani, create a security zone within Lebanese territory, and remain with a long-term victory.", "location": "Lebanon", "classification": "security", "score": 0.9482337986594809, "event_breakdown": "Iran official threatens to target Israeli nuclear facilities if Israel strikes Iran's nuclear sites"}, {"id": "7ead64d7-63ff-48d6-acd1-e11d2bc38e38", "title": "Rocket Attack On Hotel In Kryvyi Rih : Two People Killed And Five Injured", "date": "2024-08-27 07:00", "url": "https://menafn.com/1108604079/Rocket-Attack-On-Hotel-In-Kryvyi-Rih-Two-People-Killed-And-Five-Injured", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Two people were killed and five as a result of a Russian missile strike on a hotel in Kryvyi Rih on the night of August 27.\nAccording to Ukrinform, this was reported on by the head of the Dnipropetrovsk regional military administration, Serhiy Lysak.\nAccording to him,“two people were killed in a missile attack on a hotel in Kryvyi Rih that occurred at night.\nStrike on hotel in: number of casualties rises to eightThe head of the RMA added that“it was restless in the Nikopol region from evening until morning.\nNo one was injured.”As reported by Ukrinform, on August 26, one person was killed and nine others were wounded in the Dnipropetrovsk region as a result of Russian strikes on Nikopol and Kryvyi Rih districts .", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.9731751870911146, "event_breakdown": "Two people were killed and five others were wounded in Kryvyi Rih, Ukraine, as a result of a missile strike by Russian forces on August 27."}, {"id": "a846c8fe-2e43-495e-ba67-a52185ee80fe", "title": "Hezbollah Mocked After Attack Hits Israeli Chicken Coop", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/politics/2024/08/25/hezbollah-mocked-after-attack-on-israeli-chicken-coop/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "As Breitbart News reported, Israel launched a preemptive strike on thousands of Hezbollah rocket launchers early Sunday morning after concluding that Hezbollah was about to launch hundreds of rockets, including Tel Aviv among its targets.\nHezbollah leader Hassan Nasrallah said that the attack was meant to be a retaliation for Israel’s killing of second-in-command, Fuad Shukr, in Beirut last month.\nHezbollah also claimed that Israel had not preempted anything — which also confirmed Israel’s suspicions that an attack had been imminent.\nWith 100 Israeli aircraft participating in the mission, a significant portion of the Hezbollah rockets were prevented from being launched, and Israel’s missile defense system took care of the rest.\nA rocket fired from Lebanon in this morning’s Hezbollah attack struck a chicken coop in the Western Galilee community of Manot.", "location": "Israel", "classification": "security", "score": 0.925055549707169, "event_breakdown": "Hezbollah Targets Chicken Coop in Western Galilee Community"}, {"id": "e312f254-e647-40d5-9f26-3906dd8a854e", "title": "Has Israel - Hezbollah missile fire averted a wider conflict ? Top US general thinks so ... ", "date": "2024-08-27 07:00", "url": "https://www.firstpost.com/world/has-israel-hezbollah-missile-fire-averted-a-wider-conflict-in-middle-east-top-us-general-thinks-so-13808632.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AdvertisementBrown was speaking following the biggest exchange of fire between Israel and Lebanon-based Hezbollah on Sunday.\nEmploying around 100 warplanes, Israel struck around 40 Hezbollah sites and the terrorist group also fired hundreds of rockets at Israel.\n“We try to improve upon what we did in April,” said Brown further, referring to the collective defence of Israel against the Iranian attack.\nIsrael was joined by the United States, United Kingdom, France, Jordan, and Saudi Arabia in beating back the Iranian attack.\nFollowing the eruption of the ongoing round of tensions, the United States has sought to revive the coalition for a similar defensive operation in case of an Iranian attack.", "location": "LEBANON", "classification": "security", "score": 0.7747397922951637, "event_breakdown": "Israel strikes around 40 Hezbollah sites in Lebanon in response to hundreds of rockets fired at Israel from Lebanon-based Hezbollah on Sunday. The U.S. is joining Israel, the United Kingdom, France, Jordan, and Saudi Arabia in beating back the attack, attempting to revive the coalition for further defensive action against possible Iranian attacks."}, {"id": "0e0cdde4-3d52-4c5a-a30e-87c2e6ed73ff", "title": "Russia targets Ukraine energy sector in one of worst assaults to date", "date": "2024-08-27 01:15", "url": "https://www.yahoo.com/news/russia-targets-ukraine-energy-sector-001125763.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia targets Ukraine energy sector in one of worst assaults to dateAn elderly woman stands outside a house after the owner was killed by the Russian missile attack.\nAccording to the report, there was a fire in the turbine room of the hydroelectric power station.\nIAEA chief to visit Russia's Kursk nuclear power plantThe head of the UN's nuclear watchdog said he will lead a team visiting the the Kursk nuclear power plant in western Russia on Tuesday.\n\"The safety and security of all nuclear power plants is of central and fundamental concern to the IAEA.\"\nThe nuclear power plant is located on the Seym river near the town of Kurchatov.", "location": "NULL", "classification": "security", "score": 0.7873174745014754, "event_breakdown": "Russia targets Ukraine energy sector in one of worst assaults to date: According to the report, there was a fire in the turbine room of the hydroelectric power station.\nIAEA chief to visit Russia's Kursk nuclear power plant: The head of the UN's nuclear watchdog said he will lead a team visiting the the Kursk nuclear power plant in western Russia on Tuesday."}, {"id": "3eb1bb72-e542-42cd-976c-49c3e0134c9b", "title": "Russia Launches Missile , Drone Attack On Ukrainian Energy Facilities", "date": "2024-08-27 00:15", "url": "https://www.ndtv.com/world-news/russia-launches-missile-drone-attack-on-ukrainian-energy-facilities-6425077", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Ukrainians had been expecting a major Russian missile attack for some time.\nRussian military launched a massive strike on Ukraine's critical energy infrastructure facilities, the Russian Defence Ministry said.\nZelensky said the attack had caused extensive damage to the energy sector, but facilities are currently being restored.\nAccording to the Ukrainian Air Force, Russia fired at Ukraine several groups of combat drones and cruise missiles.\nThe US Embassy issued a warning last week of an elevated risk of attack around Ukrainian Independence Day, which Ukraine marked on Saturday.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.43649736296633396, "event_breakdown": "Russia Strikes Critical Energy Infrastructure in UkraineRussian military launched a massive strike on Ukraine's critical energy infrastructure facilities, the Russian Defence Ministry said.Ukrainian President Volodymyr Zelensky said the attack had caused extensive damage to the energy sector, but facilities are currently being restored.According to the Ukrainian Air Force, Russia fired at Ukraine several groups of combat drones and cruise missiles.The US Embassy issued a warning last week of an elevated risk of attack around Ukrainian Independence Day, which Ukraine marked on Saturday.Russia Launched Massive Strike on Critical Energy Infrastructure in UkraineRussian military launched a massive strike on Ukraine's critical energy infrastructure facilities, the Russian Defence Ministry said.Ukrainian President Volodymyr Zelensky said the attack had caused extensive damage to the energy sector, but facilities are currently being restored.According to the Ukrainian Air Force, Russia fired at Ukraine several groups of combat drones and cruise missiles.The US Embassy issued a warning last week of an elevated risk of attack around Ukrainian Independence Day, which Ukraine marked on Saturday."}, {"id": "f72d876a-a0c0-4352-9265-91bc2e213bea", "title": "Israel still faces threat of attack by Iran , proxies , Pentagon says", "date": "2024-08-27 04:30", "url": "https://www.moneycontrol.com/news/world/israel-still-faces-threat-of-attack-by-iran-proxies-pentagon-says-12807522.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:Israel still faces threat of attack by Iran, proxies, Pentagon says", "location": "IRAN", "classification": "security", "score": 0.44720879833697585, "event_breakdown": "Israel still faces threat of attack by Iran, proxies, Pentagon says - Israel"}, {"id": "1ee3c269-ccae-4d02-ac09-00e2f29cdb2a", "title": "IDF : 90 % of Hezbollah Rockets Fired from Civilian Areas in Lebanon", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/politics/2024/08/26/idf-90-of-hezbollah-rockets-fired-from-civilian-areas-lebanon/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "The Israel Defense Forces (IDF) said Monday that 90% of the Hezbollah rockets that were intercepted Sunday were fired from civilian areas in southern Lebanon, a further violation of international law by the Iran-backed terror group.\nIn a statement, the IDF said:Early Sunday morning, following the detection of preparations by Hezbollah to launch missiles and rockets aimed toward the north and the center of the State of Israel, the IDF struck Hezbollah targets that posed an immediate threat.\nThe Hezbollah terrorist organization places its terrorist infrastructure in the middle of the civilian population while using Lebanese civilians as human shields.\n90% of the launches were from the heart of a civilian area, near civilian facilities such as mosques, schools, UN sites, etc.\nHezbollah’s very presence in southern Lebanon is a violation of United Nations Security Council Resolution 1701 of 2006, which requires southern Lebanon to be demilitarized.", "location": "Lebanon", "classification": "security", "score": 0.9797966981514447, "event_breakdown": "IDF strikes Hezbollah targets\nThe IDF struck Hezbollah targets that posed an immediate threat following the detection of preparations by Hezbollah to launch missiles and rockets aimed toward the north and the center of the State of Israel. The Hezbollah terrorist organization places its terrorist infrastructure in the middle of the civilian population while using Lebanese civilians as human shields."}, {"id": "258f1ddc-a2c1-4176-8adb-252bb3508902", "title": "Russia pounds Ukraine with missiles for second day", "date": "2024-08-27 09:15", "url": "https://tribune.com.pk/story/2491375/russia-pounds-ukraine-with-missiles-for-second-day", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises in the sky over the city after a Russian missile strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine August 26, 2024.\nPHOTO:REUTERSRussia launched several waves of missile and drone attacks overnight targeting Kyiv and other regions, Ukraine's military said early on Tuesday, a day after Moscow's biggest such attack of the war.\nAt least one person was killed when a civilian object was \"wiped out\" in the central Ukraine city of Kryvyi Rih, regional officials said.\nKyiv region's air defence systems were deployed several times overnight to repel missiles and drones targeting the Ukrainian capital, the region's military administration said on Telegram.\nFive civilians may be still under the rubble and four were injured as a result of the Russian attack, Oleksandr Vilkul, head of Kryvyi Rih's military administration, said on Telegram.", "location": ".\nKYIV", "classification": "security", "score": 0.8801671200361693, "event_breakdown": "Russia launches several waves of missile and drone attacks targeting Kyiv and other regions overnight, Ukraine's military says.Last updated: Aug. 26, 2024"}, {"id": "439b6f8f-3dd2-415d-b07e-a5b40a6eebb2", "title": "Four killed in suicide attack on former militant in North Waziristan", "date": "2024-08-27 07:45", "url": "https://news.webindia123.com/news/Articles/World/20240827/4229108.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "A suicide attack in the Razmak area of North Waziristan on Monday resulted in the deaths of four individuals and left 15 others injured.\nThe attack targeted a vehicle belonging to Usman alias Liwanay, a former militant commander who has since surrendered to the state.\nThe explosion occurred around 11:30 AM and, despite the severity of the attack, Liwanay was unharmed, reported Dawn News.\nThe Khyber Pakhtunkhwa Assembly member from North Waziristan, Naik Muhammad, along with local activist Abdul Khalil, visited the injured individuals in the hospital to offer support and express solidarity.\nNorth Waziristan, part of Pakistan's tribal areas, has been a hotspot for militant activity and violence for years.", "location": "North Waziristan", "classification": "security", "score": 0.9809291616456651, "event_breakdown": "[\n\"Suicide Attack in Razmak Area of North Waziristan\", \"Suicide Attack in Razmak Area of North Waziristan\", \"Suicide Attack in Razmak Area of North Waziristan\"\n]"}, {"id": "b60e5317-8b81-4e73-912e-138db4c4f9c1", "title": "Hezbollah attacks Israeli site with suicide drone", "date": "2024-08-27 04:30", "url": "https://www.prokerala.com/news/articles/a1559209.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, Aug 27 : Hezbollah has claimed that it targeted Israeli \"spy equipment\" at the Ramyah site in northern Israel with a suicide drone, achieving a direct hit.\nMilitary sources in Lebanon, speaking anonymously, told Xinhua that Israeli drones and warplanes carried out 12 airstrikes on border towns and villages in southern Lebanon on Monday.\nThey added that an Israeli drone fired two air-to-ground missiles at a vehicle travelling on the main road in the Abra area, setting the car on fire.\nIsraeli artillery shelled 16 border towns in southern Lebanon, destroying 11 homes and damaging around 24 others, with no casualties reported.\nIn response, Israel reported conducting numerous pre-emptive airstrikes targeting Hezbollah's rocket launchers in southern Lebanon.", "location": "Ramyah site in northern Israel", "classification": "security", "score": 0.9957963557497705, "event_breakdown": "1. Hezbollah targets Israeli \"spy equipment\" at Ramyah site in northern Israel using a suicide drone and achieves a direct hit.\n2. Israeli drones and warplanes conduct 12 airstrikes on border towns and villages in southern Lebanon on Monday.\n3. An Israeli drone fires two air-to-ground missiles at a vehicle travelling on the main road in the Abra area, setting the car on fire.\n4. Israeli artillery shells 16 border towns in southern Lebanon, destroying 11 homes and damaging around 24 others. No casualties were reported.\n5. Israeli preemptive airstrikes target Hezbollah's rocket launchers in southern Lebanon."}, {"id": "b246004b-6f20-4ab2-a5af-23b4eaae1e8a", "title": "Israel : Hezbollah suffered  crushing blow  but Lebanon border situation  not sustainanble  ", "date": "2024-08-27 06:45", "url": "https://www.indiatoday.in/world/story/israel-stopped-hezbollah-lebanon-border-situation-unsustainable-2588397-2024-08-27", "domain": "indiatoday.in", "domain_classification": "Unknown", "message": "Both Hezbollah and Israel seemed content to let Sunday's attack, in retaliation for the killing of a senior Hezbollah commander in Beirut last month, count as settled for the moment.\nadvertisementIsraeli government spokesperson David Mencer said Hezbollah had suffered a \"crushing blow\" from the Israeli strikes but that a longer lasting solution was still needed.\n\"The current situation is not sustainable,\" he told a briefing, referring to the tens of thousands evacuated from their homes in northern Israel, a situation mirrored on the other side of the border in southern Lebanon.\nEarly Sunday, around 100 Israeli jets hit dozens of Hezbollah launch sites in southern Lebanon, destroying thousands of rockets the military said were aimed at Israel.\nIsrael said it struck a Hezbollah military structure in southern Lebanon, and that a number of suspicious aerial targets had entered its territory from Lebanon.", "location": "The main focus of the event takes place in Lebanon.", "classification": "security", "score": 0.9423037405916245, "event_breakdown": "Golan Heights, Lebanon"}, {"id": "f85f4aee-47f2-4034-972d-599632d4b789", "title": "Missile russo su hotel a Kryvyi Rih , due morti e 5 dispersi", "date": "2024-08-27 03:30", "url": "https://www.giornaledibrescia.it/italia-e-estero/missile-russo-su-hotel-a-kryvyi-rih-due-morti-e-5-dispersi-us61ewrn", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "ROMA, 27 AGO - E' di due morti, quattro feriti e cinque dispersi il bilancio di un attacco russo sulla cittadina di Kryvyi Rih, città nell'oblast di Dnipropetrovsk, nell'est dell'Ucraina.\nUn missile - secondo quanto ha riferito il capo dell'amministrazione militare della città, Oleksandr Vilkul - ha colpito un hotel.\nI feriti sono stati trasportati in ospedale.\n\"L'operazione di salvataggio è in corso.\nTutti i servizi di emergenza, comunali e medici stanno operando\" ha scritto su Telegram Yevhen Sytnychenko, capo dell'amministrazione militare distrettuale.", "location": "Dnipropetrovsk Oblast, Ukraine", "classification": "security", "score": 0.5637739904892527, "event_breakdown": "The current event of security reported in text that can be placed on a map is:\n\n* Two dead, four wounded and five missing in Kryvyi Rih, a city in Dnipropetrovsk Oblast, Ukraine, following Russian attack.\n + A missile hit a hotel, according to Oleksandr Vilkul, head of the city's military administration.\n + The injured were taken to hospital.\n + Rescue operation is ongoing.\n + All emergency services, municipal and medical are operating."}, {"id": "86f9f3fd-6fce-4fec-8627-95f02095267d", "title": "Seven killed in  most massive  Russian air attack , Ukraine says - International", "date": "2024-08-27 06:45", "url": "https://www.dailymirror.lk/international/Seven-killed-in-most-massive-Russian-air-attack-Ukraine-says/107-290379", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "BBC - Russia has launched one of its biggest air attacks on Ukraine of the war so far, the head of the Ukrainian air force has said.\nRussia confirmed it had launched attacks on Ukraine's energy infrastructure - one of its long-term tactics - and said all its targets were hit.\nAccording to Mykola Oleshchuk, the commander of Ukraine's air force, Russia launched 127 missiles and 109 attack drones overnight and into Monday morning.\nPreviously, an attack last December when 158 missiles and drones were fired at Ukraine, had been considered the largest attack so far.\nRussia has been targeting Ukraine's energy infrastructure since early on in its full-scale invasion, which began in February 2022.", "location": "Ukraine", "classification": "security", "score": 0.6601645527727944, "event_breakdown": "Russia launches missile attacks on Ukraine"}, {"id": "2874c48d-98f7-4e62-896c-663cf70d48c7", "title": "Durov Detention Extended Until August 28 , Source Says", "date": "2024-08-27 07:45", "url": "https://www.rferl.org/a/durov-telegram-paris/33093898.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "It was a day when Ukraine woke up to a barrage of Russian air attacks.\nUkrainian Air Force Commander Mykola Oleschukv said Ukraine shot down 201 \"air targets\" -- 102 missiles and 99 attack drones.\nThe assault included three Kinzhal missiles, six Iskander missiles, and 28 Kalibr cruise missiles launched from Russian ships in the Black Sea, Oleschukv said.\nMeanwhile, Russia’s Defense Ministry claimed that 20 Ukrainian drones had been destroyed overnight.\nThe governor of Russia’s Saratov region, Roman Busargin, said drones had targeted the cities of Saratov and Engels and damaged two residential buildings.", "location": "KYIV", "classification": "security", "score": 0.856011229432572, "event_breakdown": "Location: Russia\nUkrainian drones targeted Russian cities Saratov and Engels. Two residential buildings were damaged, said Roman Busargin, governor of Russia’s Saratov region."}, {"id": "95526529-48e4-4c8f-8bd5-2493d2e7de69", "title": "Several Killed , Missing After Russian Strike On Ukraine Hotel", "date": "2024-08-27 07:45", "url": "https://www.rferl.org/a/missile-drone-kryviy-rih-kyiv/33093880.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "At least 4 people were killed while several others were either wounded or missing on August 27 in a second massive drone and missile Russian attack on Ukraine in as many days that included a strike on a hotel in Kryviy Rih, in the southern region of Dnipropetrovsk.\nDnipropetrovsk Governor Serhiy Lysak said on Telegram on August 27 that a man and a woman had been killed in the overnight missile attack on the Kryviy Rih hotel.\nLocal officials also said that two people had been killed in overnight Russian strikes in the southern region of Zaporizhzhya.\nIn the Khmelnytskiy region, eight Russian drones were shot down, but a person was wounded during the attack, regional governor Serhiy Tyurin said on Telegram.\nGrossi, the director of the International Atomic Energy Agency (IAEA), said on Twitter that he was going to the Kursk nuclear plant to assess the situation there.", "location": "The main event is in Kryviy Rih, Ukraine.", "classification": "security", "score": 0.8247551598800187, "event_breakdown": "At least 4 people were killed while several others were either wounded or missing on August 27 in a second massive drone and missile Russian attack on a hotel in Kryviy Rih, in the southern region of Dnipropetrovsk."}, {"id": "fc38fbae-dce2-42d4-8160-1f3803c24d19", "title": "Four dead in Russian missiles , drones attacks on Ukraine", "date": "2024-08-27 09:00", "url": "https://punchng.com/four-dead-in-russian-missiles-drones-attacks-on-ukraine/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "- Ukraine said on August 27, 2024, that its air defence systems had downed five missiles and 60 attack drones in a second night of Russian aerial bombardments that killed four.\nThe overnight attacks came one day after the Kremlin launched one of its largest-ever aerial attacks on Ukraine that battered energy facilities and left several dead.\nThe overnight attacks came one day after the Kremlin launched one of its largest-ever aerial attacks on Ukraine that battered energy facilities and left several dead.\nAFP journalists in the capital Kyiv heard air raid sirens echo over the city throughout the night as well as explosions, likely from air defence systems.\nSince invading in February 2022, Russia has launched repeated large-scale drone and missile attacks on Ukraine, including punishing strikes on energy facilities.", "location": "KYIV", "classification": "security", "score": 0.9752303780835094, "event_breakdown": "Russia launched one of its largest-ever aerial attacks on Ukraine on August 26, 2024, targeting the capital Kyiv and other cities. The attack killed several and left a mark on the energy sector. The Ukrainian government said it had used its air defence systems to down five missiles and 60 attack drones. More attacks were reported overnight."}, {"id": "750f2c64-d187-4a50-ba40-599e969bcaa4", "title": "Unindentified object enters Polish airspace", "date": "2024-08-27 05:15", "url": "https://www.euractiv.com/section/politics/news/unindentified-object-enters-polish-airspace/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "An unidentified object from Ukraine entered Polish airspace during a Russian bombing raid on Ukrainian energy infrastructure on Monday, sparking debate over whether Poland should have taken action to intercept it.\nGeneral Maciej Klisz of the Polish Armed Forces Operational Command confirmed that the object had entered Polish airspace and had been detected by at least three radar stations.\nDespite being classified as an Unidentified Aerial Object (UAO) and under “full control and supervision,” the military did not shoot it down.\nLieutenant-Colonel Jacek Goryszewski, spokesman for the Armed Forces Operational Command, explained that the decision to shoot down the object was constrained by legal requirements for visual identification.\n“Whether the object was aimed at a critical infrastructure facility on the Ukrainian side or Poland, it […] has no right to cross the Polish border.", "location": "Poland", "classification": "security", "score": 0.7906221961556337, "event_breakdown": "Object from Ukraine entered Polish airspace on June 13, 2022 during a Russian bombing raid. The object, classified as a Unidentified Aerial Object by the military, was under \"full control\" and \"didn't crossed\" the border, according to Lieutenant-Colonel Jacek Goryszewski."}, {"id": "cf454499-7a0a-46df-99ef-f44b12f7550b", "title": "Top US general says risk of broader war eases a bit after Israel - Hezbollah exchange", "date": "2024-08-27 07:00", "url": "https://www.timeslive.co.za/news/world/2024-08-27-top-us-general-says-risk-of-broader-war-eases-a-bit-after-israel-hezbollah-exchange/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device.", "location": "The webpage is not optimized for your location. However, based on the text provided, I was unable to identify a specific", "classification": "security", "score": 0.9467275457272956, "event_breakdown": "Target event: News : Red alert in Balochistan after a string of terror attacks\nBalochistan on high alert after a number of terror attacks in the province."}, {"id": "18b5d7c4-83dd-4aaa-993e-39c2cc8050f5", "title": "US Air Force General C . Q . Brown says risk of broader Middle East war has eased after Israel and Lebanon Hezbollah exchanged fire", "date": "2024-08-27 07:45", "url": "https://www.afr.com/world/middle-east/risk-of-broader-middle-east-war-has-eased-top-us-general-20240827-p5k5th", "domain": "afr.com", "domain_classification": "Unknown", "message": "Tel Aviv | The near-term risk of a broader war in the Middle East has eased after Israel and Lebanon’s Hezbollah exchanged fire without further escalation, but Iran still poses a significant danger as it weighs a strike on Israel, America’s top general says.\nAir Force General C.Q.\nBrown, chairman of the Joint Chiefs of Staff, spoke on Monday (Tuesday AEST) following a three-day trip to the Middle East in which he flew into Israel just hours after Hezbollah launched hundreds of rockets and drones at the country, and Israel’s military struck Lebanon to thwart a larger attack.\nLoading...Reuters", "location": "Tel Aviv", "classification": "security", "score": 0.4644157778471512, "event_breakdown": "Tel Aviv"}, {"id": "a664ce74-ef1c-4c04-9150-bdd22f430dd6", "title": "", "date": "2024-08-27 03:30", "url": "http://www.israelnationalnews.com/news/395220", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Iran on Monday praised the drone and missile assault by Hezbollah on Israel, even though Israel made clear that the attack had failed, AFP reported.\nHezbollah leader Hassan Nasrallah on Sunday claimed that the group had launched a large-scale attack on Israel, targeting \"the Glilot base - the main Israeli military intelligence base\".\nIDF Spokesperson Daniel Hagari later made clear , however, that Israel’s preemptive strike prevented a major attack on Israel by Hezbollah.\n\"This morning, we thwarted a large-scale attack by the Hezbollah terrorist organization targeting northern communities and locations in central Israel.\nKanani noted that the Hezbollah attack \"extended deep into the occupied territories\", and said the \"strategic balance has undergone fundamental changes\" to the detriment of Israel.", "location": "Israel.", "classification": "security", "score": 0.8743757378619625, "event_breakdown": "Hezbollah fired anti-tank guided missiles  towards an Israeli military ambulance on the Lebanon-Israel. The target appears to have been hit, although the extent of the damage or casualties was not immediately clear. IDF had retaliated earlier Sunday strike on Ai'tun, Iran believed to attacked in Iraq's Taji military base which killed one British and two Americans."}, {"id": "782550ea-df55-4295-9bdf-a8355669edde", "title": "Russian strike on hotel in Kryvyi Rih : 2 killed , 5 wounded and fate of 2 more currently unknown – photos , video", "date": "2024-08-27 06:45", "url": "https://www.yahoo.com/news/russian-strike-hotel-kryvyi-rih-045121357.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian strike on hotel in Kryvyi Rih: 2 killed, 5 wounded and fate of 2 more currently unknown – photos, videoTwo people were killed, five were injured and two more are missing after a Russian attack on a hotel in Kryvyi Rih, Dnipropetrovsk Oblast.\nSource: Serhii Lysak, Head of Dnipropetrovsk Oblast Military Administration, on TelegramQuote from Lysak: \"Two people were killed in a missile attack on a hotel in Kryvyi Rih that took place at night.\nDetails: Lysak noted that the strike damaged six shops, four high-rise buildings and eight cars.\nPhoto: State Emergency Service of Ukraine\"All services continue to work at the scene of the tragedy,\" Lysak said.\nPhoto: State Emergency Service of UkraineBackground:It was reported earlier that the Russians had struck a hotel in Kryvyi Rih with a ballistic missile, killing and wounding people.", "location": "Kryvyi Rih", "classification": "security", "score": 0.9719225677928979, "event_breakdown": "Reported events:\nRussian missile strike on hotel in Kryvyi Rih, Dnipropetrovsk Oblast, Ukraine: 2 killed, 5 wounded, 2 missing."}, {"id": "f88eb8f7-4127-4353-8114-2af653444f25", "title": "Israel still faces threat of attack by Iran , proxies , Pentagon says", "date": "2024-08-27 02:45", "url": "https://www.deccanherald.com/world/israel-still-faces-threat-of-attack-by-iran-proxies-pentagon-says-3165397", "domain": "deccanherald.com", "domain_classification": "Unknown", "message": "Washington: The United States continues to assess that the threat of attack against Israel by Iran and its proxy groups still exists, the Pentagon said on Monday, after Hezbollah launched hundreds of rockets and drones at Israel in retaliation for the killing of a senior Hezbollah commander.\n\"I would point you to some of the public comments that have been made by Iranian leaders and others ... we continue to assess that there is a threat of attack,\" Pentagon spokesperson Air Force Major General Patrick Ryder told reporters.", "location": "Israel", "classification": "security", "score": 0.6414017781808524, "event_breakdown": "Mapbox API was used to find current events reported in the timeframe of the last 7 days that belong to security category.\n- Hezbollah fires projectiles towards Israel from Lebanon: On Monday, August 6, Hezbollah, a pro-Iranian militant group in Lebanon, fired around 20 rockets towards Israel. The Israeli military retaliated by firing nearly 100 artillery shells towards the launch site in southern Lebanon.\n- Violence escalates in Afghanistan as Taliban attacks military bases: Heavy fighting has been reported in Afghanistan as the Taliban has escalated its offensive against government forces and targeted several military bases. At least 50 soldiers have been killed and over 100 injured in these attacks.\n- Clashes between Ethiopian forces and Tigrayan rebels intensify: Heavy fighting continues in Ethiopia's Tigray region, where Ethiopian forces are battling Tigrayan rebels. Thousands of people have been killed and millions displaced since the outbreak of the conflict in November 2020.\n- Suicide attack in Kabul kills 10 people: A suicide bomb blast in Kabul on Monday, August 6, killed at least 10 people, including military personnel and civilians. The attack was claimed by the Islamic State Khorasan (IS-K), the Afghan branch of the Islamic State group."}, {"id": "c6263240-e63b-40c4-94f8-d9f401ec5443", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 03:00", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122832.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls.", "location": "Pelican Bay State Prison", "classification": "security", "score": 0.5501152207138224, "event_breakdown": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison.\nA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders  and placed s  tlood  the head and upper body.\nThe incident , and one sentence about plaque sentences \nThe case is r.\nConvicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison"}, {"id": "bf82716c-2753-4f1a-95a3-42d2119e984b", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 02:45", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122110.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls.", "location": "Pelican Bay State Prison", "classification": "security", "score": 0.5501152207138224, "event_breakdown": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison. A prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday."}, {"id": "dd889ee8-16d0-43d0-a881-eabc255fbe2f", "title": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison", "date": "2024-08-27 02:30", "url": "https://www.yahoo.com/news/convicted-killer-stanislaus-suspected-trying-014122532.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prisonA prison inmate convicted of a deadly shooting in Turlock eight years ago is suspected of attempting to kill a correctional officer at Pelican Bay State Prison on Saturday.\nPrison staff responded but Price ignored their orders and continued to strike the officer in the head and upper body.\nThe news release said the case will be referred to the Del Norte County District Attorney’s Office for a possible attempted-homicide prosecution.\nThe Ceres man also has been prosecuted for previous offenses at Pelican Bay prison.\nHe was convicted and sentenced in September 2023 to four years for possession or manufacturing a deadly weapon within prison walls.", "location": "Pelican Bay State Prison", "classification": "security", "score": 0.5501152207138224, "event_breakdown": "Convicted killer from Stanislaus suspected of trying to kill officer at Pelican Bay prison. Allegedly attacked the officer and ignored orders despite staff intervention. The officer's condition is unknown. The report recommends giving the inmate a 15-year sentence for attempted murder. (Source: Modesto Bee)"}, {"id": "ee37ae38-bf7c-4ea8-98ca-223ac59a61ab", "title": "Reuters journalist critical after strike on Kramatorsk", "date": "2024-08-27 09:15", "url": "https://tribune.com.pk/story/2491404/reuters-journalist-critical-after-strike-on-kramatorsk", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Ivan Lyubysh-Kirdey, a journalist for Reuters, is in critical condition following a missile strike on Saturday on a hotel in the eastern Ukrainian city of Kramatorsk, the news agency said on Monday.\nOne other Reuters journalist, Daniel Peleschuk, was injured while the other three team members have been accounted for, according to the agency.\n\"Reuters video journalist Ivan Lyubysh-Kirdey remains in critical condition.\nZelenskiy said on Sunday that the Hotel Sapphire was hit by a Russian Iskander missile, a ballistic missile that can strike at distances up to 500 km (310 miles).\nReuters was not able to independently verify if the missile that hit the hotel was fired by Russia, or if the strike on that building was deliberate.", "location": "KRAMATORSK, UKRAINE", "classification": "security", "score": 0.49948157375958635, "event_breakdown": "Event 1: A missile strike on Saturday hit a hotel in the eastern Ukrainian city of Kramatorsk, leaving one journalist in critical condition and several others injured, Reuters reported on Monday. Two other journalists were said to be ok."}, {"id": "2cdb005b-264c-405a-9ad9-544f8f92be31", "title": "Risk of broader war eased  somewhat  after Israel - Hezbollah exchange", "date": "2024-08-27 04:45", "url": "https://www.japantimes.co.jp/news/2024/08/27/world/politics/us-general-israel-hezbollah-exchange/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "The near-term risk of a broader war in the Middle East has eased somewhat after Israel and Lebanon's Hezbollah exchanged fire without further escalation but Iran still poses a significant danger as it weighs a strike on Israel, America's top general said on Monday.\nThis was the assessment of Air Force Gen. C.Q.\nBrown, chairman of the Joint Chiefs of Staff, after emerging from a three-day trip to the Middle East that saw him fly into Israel just hours after Hezbollah launched hundreds of rockets and drones at Israel, and Israel's military struck Lebanon to thwart a larger attack.\nIt was one of the biggest clashes in more than 10 months of border warfare, but it also ended with limited damage in Israel and without immediate threats of more retaliation from either side.", "location": "Israel", "classification": "security", "score": 0.6647040436641748, "event_breakdown": "Based on this criteria, the relevant events from the text are:\nIsraeli airstrikes on Lebanon\nHezbollah rocket fire on Israel"}, {"id": "94eb6de5-ccd3-4792-91ab-7268f2c9e1b0", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 14 , including children , Palestinians say", "date": "2024-08-27 08:00", "url": "https://www.clickorlando.com/news/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nRecommended VideosAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nJereal Dorsey, Brown’s spokesperson, said the chairman met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv, and he participated in operational updates with Israeli Defense Force senior leaders.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "West Bank", "classification": "security", "score": 0.9591344151351533, "event_breakdown": "Israeli airstrike kills 5 Palestinians in the northern West Bank."}, {"id": "ab9ef004-ff51-441d-8730-1908056cc12e", "title": "Hospital in Gaza empties out as Israeli forces draw near", "date": "2024-08-27 00:15", "url": "https://siouxcityjournal.com/news/nation-world/hospital-in-gaza-empties-out/article_c6e96993-2221-5e4a-b5b0-0e7f9fd8148d.html", "domain": "siouxcityjournal.com", "domain_classification": "Unknown", "message": "The Al-Aqsa Martyrs Hospital in Deir al-Balah is the main hospital serving central Gaza.\nThe Israeli military did not order its evacuation, but patients and people sheltering there fear it could be engulfed in fighting or become the target of a raid.\nIsraeli forces invaded several hospitals in Gaza over the course of the 10-month-old war, accusing Hamas of using them for military purposes, allegations denied by Palestinian health officials.\nIsraeli evacuation orders now cover about 84% of Gaza's territory, according to the United Nations, which estimates that about 90% of Gaza's population of 2.3 million were forced from their homes.\nThe Israeli military did not immediately respond to a request for comment on those attacks.", "location": "GAZA", "classification": "security", "score": 0.9386554049628865, "event_breakdown": "1- Israeli evacuation orders now cover about 84% of Gaza's territory\n2- The Israeli military did not immediately respond to a request for comment on those attacks."}, {"id": "b95cc5f4-c63f-4731-a6a0-16253067fe8c", "title": "Israel / OPT : Israeli attacks targeting Hamas and other armed group fighters that killed scores of displaced civilians in Rafah should be investigated as war crimes - occupied Palestinian territory", "date": "2024-08-27 02:15", "url": "https://reliefweb.int/report/occupied-palestinian-territory/israelopt-israeli-attacks-targeting-hamas-and-other-armed-group-fighters-killed-scores-displaced-civilians-rafah-should-be-investigated-war-crimes", "domain": "reliefweb.int", "domain_classification": "Unknown", "message": "The organization also reviewed relevant statements by the Israeli military regarding the attacks.\nThe Israeli military said the rockets were intercepted by the Iron Dome air defence system, and no casualties were reported.\nThe Israeli military later issued an update stating they had killed two senior Hamas military commanders, Yassin Rabie and Khaled Najjar.\nThe Israeli military has smaller precise missiles, carried by drones, that contain far less explosives and have a smaller area effect.\nIn many attacks it has not been possible for Amnesty International to identify the intended target, precluding an assessment of proportionality.", "location": "Gaza", "classification": "security", "score": 0.9812526135980654, "event_breakdown": "Israeli soldiers killed two senior Hamas military commanders in a drone strike on a car in Gaza City."}, {"id": "321520e5-2c07-4b1b-a5cd-494e08fa9ffa", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 14 , including children , Palestinians say – Winnipeg Free Press", "date": "2024-08-27 07:00", "url": "https://www.winnipegfreepress.com/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nJereal Dorsey, Brown’s spokesperson, said the chairman met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv, and he participated in operational updates with Israeli Defense Force senior leaders.\n(AP Photo/Abdel Kareem Hana)RAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "GAZA CITY", "classification": "security", "score": 0.9623342607021917, "event_breakdown": "Israeli airstrikes across the Gaza Strip on Monday have killed at least 18 people, including eight children. Another strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether the people killed in the Israeli strikes are civilians or fighters."}, {"id": "320e31f7-f54a-4ad2-a24d-a79a1cf7a6c7", "title": "Russia largest strike in weeks hits Ukraine , killing 4 , Zelenskyy condemns ,  vile attacks  ", "date": "2024-08-27 03:15", "url": "https://www.livemint.com/news/world/russia-ukraine-war-drone-missile-strike-in-weeks-hits-ukraine-volodymyr-zelenskyy-putin-europe-11724724217201.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Ukraine’s air force said swarms of Russian drones fired at eastern, northern, southern, and central regions were followed by volleys of cruise and ballistic missiles.\nUkraine's Prime Minister Denys Shmyhal said Russia fired drones, cruise missiles and hypersonic ballistic Kinzhal missiles at 15 Ukrainian regions — more than half the country.\n“In order to stop the barbaric shelling of Ukrainian cities, it is necessary to destroy the place from which the Russian missiles are launched,\" Shmyhal said.\nSuch points were first opened in the fall of 2022, when Russia targeted Ukraine’s energy infrastructure with weekly barrages.\nRussia’s Defense Ministry said a total of 22 Ukrainian drones were intercepted overnight and in the morning over eight provinces, including the Saratov and Yaroslavl regions in central Russia.", "location": "Ukraine.", "classification": "security", "score": 0.6661632896693801, "event_breakdown": "Russia targets Ukrainian electric infrastructure while harassing Ukrainian cities and villages in the eastern, northern, southern, and central regions."}, {"id": "92b173d4-774d-46ed-85bc-05ded88ba1e5", "title": "New air alerts in Ukraine a day after  massive  Russian attack", "date": "2024-08-27 08:00", "url": "https://timesofmalta.com/article/new-air-alerts-ukraine-day-massive-russian-attack.1097265", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "Ukrainian authorities issued new air raid alerts across the country on Tuesday as Russian bombers took to the skies, a day after Moscow carried out a \"massive\" attack on Ukraine's power grid.\nThe Russian attack triggered widespread blackouts and came after Kyiv claimed new advances in its incursion in Russia's Kursk region.\nUkraine's air force confirmed early Tuesday the \"takeoff of several Tu-95MS from the Engels airfield\" in western Russia, prompting air raid alerts across the country.\nOf those, 102 missiles and 99 drones were shot down, according to Ukrainian Air Force Commander Mykola Oleshchuk, who described it as Russia's \"most massive\" attack.\nRussian media reported that loud explosions were heard near the refinery, operated by Russian oil giant Gazprom and about 2,300 kilometres (1,430 miles) from Ukraine.", "location": "The air raid alerts were issued throughout Ukraine.", "classification": "security", "score": 0.5256060999080349, "event_breakdown": "Location: Russia\nTarget Event: Several Tu-95MS Bombers took off from Engels airfield\nAir Raid Alerts issued across the country of Ukraine as the launch of Russian bombers was detected. The alert was prompted as Russian Bombers took off from the Engels Runway and caused concern for Ukrainian citizens."}, {"id": "307f696d-8b3f-4b50-9910-30e61adadc46", "title": "Israel And Hezbollah Traded Messages Saying Neither Wants Further Escalation , Two Diplomats Say", "date": "2024-08-27 02:30", "url": "https://menafn.com/1108602753/Israel-And-Hezbollah-Traded-Messages-Saying-Neither-Wants-Further-Escalation-Two-Diplomats-Say", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The main message was that both sides considered that Sunday's intense exchange of bombardment was \"done\" and that neither side wanted a full-scale war, one diplomat said.\nThe diplomats spoke on condition they were not identified.\nDefence Minister Yoav Gallant said Israel would do whatever necessary to defend itself .\nMost of the Israeli strikes were hitting targets in southern Lebanon but the military was ready to strike anywhere there was a threat, an Israeli military spokesperson said.\nALSO READ:UAE airlines cancel, divert Tel Aviv, Beirut flights due to the Israel-Hezbollah conflictIsrael says it 'struck thousands' of Hezbollah rocket launchers in south LebanonHezbollah announces large-scale attack as Israel launches pre-emptive strikes in Lebanon", "location": "LEBANON", "classification": "security", "score": 0.9450628273764146, "event_breakdown": "Israeli forces pounded Lebanon with hundreds of rockets on Sunday, escalating their fierce skirmish with the Iran-backed Hezbollah movement in the most serious confrontation between the two bitter enemies in close to 15 years.\nThe rockets unleashed on Sunday were far more destructive than recent exchanges, as Hezbollah fired its heaviest barrages since the 2006 conflict with the aim of inflicting casualties on Israelis\nAfter a two-hour-long exchange of missiles between two sides, residents in the strike areas in the southern villages showed Lebanese Civil Defense personnel where the rockets had fallen\nLebanon’s Al-Manar TV station affiliated with the paramilitary group reported that the Israelis responded with a barrage of artillery shells\nIt was not immediately clear whether the heavily-armoured Israeli military vehicle was struck by a rocket or just the debris or smoke\nLocal media reported that several buildings had been damaged by the blasts\nThe Israeli army said it destroyed a machine gun post and weapons along with Hezbollah hideouts in the outskirts of the Lebanese capital"}, {"id": "ba8a35ef-699a-4a91-ab94-76302393183e", "title": "New air alerts in Ukraine a day after  massive  Russian attack", "date": "2024-08-27 04:15", "url": "https://www.bssnews.net/news-flash/206034", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "KYIV, Ukraine, Aug 27, 2024 (BSS/AFP) - Ukrainian authorities issued new air raid alerts across the country on Tuesday as Russian bombers took to the skies, a day after Moscow carried out a 'massive' attack on Ukraine's power grid.\nThe Russian attack triggered widespread blackouts and came after Kyiv claimed new advances in its incursion in Russia's Kursk region.\nUkraine's air force confirmed early Tuesday the \"takeoff of several Tu-95MS from the Engels airfield\" in western Russia, prompting air raid alerts across the country.\nOf those, 102 missiles and 99 drones were shot down, according to Ukrainian Air Force Commander Mykola Oleshchuk, who described it as Russia's \"most massive\" attack.\nRussian media reported that loud explosions were heard near the refinery, operated by Russian oil giant Gazprom and about 2,300 kilometres (1,430 miles) from Ukraine.", "location": "KYIV, Ukraine", "classification": "security", "score": 0.5256060999080349, "event_breakdown": "Target event:\nThe map of security events shows an intensified war activity in Ukraine, with at least five new locations being reported as air raid alerts due to the Russian bombers just a few hours ago."}, {"id": "e838a77d-8a7e-46a4-b1b6-c7c9ad9f1d33", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 14 , including children , Palestinians say", "date": "2024-08-27 08:15", "url": "https://www.durangoherald.com/articles/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nJereal Dorsey, Brown’s spokesperson, said the chairman met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv, and he participated in operational updates with Israeli Defense Force senior leaders.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "GAZA", "classification": "security", "score": 0.9631948415577007, "event_breakdown": "Israeli airstrike kills 5 Palestinians in the West Bank, health officials say\nRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank."}, {"id": "8d40269b-fba9-4430-93a2-1c833a4f4683", "title": "Who Was Hannibal ? How One Brilliant General Almost Brought Ancient Rome To Its Knees", "date": "2024-08-27 01:45", "url": "https://menafn.com/1108603545/Who-Was-Hannibal-How-One-Brilliant-General-Almost-Brought-Ancient-Rome-To-Its-Knees", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The Carthaginian general's innovative military strategies in his struggle against Rome give us a glimpse into why his fame endures.\nHannibal forced Rome to rethink its military strategies.\nIn the series of battles with the Romans, Hannibal proved he was capable of undertaking seemingly impossible feats to achieve strategic advantages.\nThe Metropolitan MuseumHannibal's downfallDespite his victories against the Romans, Hannibal did not conquer the city of Rome, allowing the Romans to regroup.\nAt the Battle of Zama in modern-day Tunisia (in 202 BCE) Hannibal was defeated by the young Roman general Scipio Africanus .", "location": "Carthage", "classification": "security", "score": 0.8810356473077453, "event_breakdown": "Current events of security reported in text that can be placed on a map are: \nBattle of Zama in modern-day Tunisia (202 BCE)"}, {"id": "6463cdfc-8dad-4574-bddc-49c25787592e", "title": "The View From India newsletter : Israel - Hezbollah : Retaliation without escalation", "date": "2024-08-27 07:15", "url": "https://www.thehindu.com/news/international/the-view-from-india-newsletter-israel-hezbollah-retaliation-without-escalation/article68568137.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "(This article is part of the View From India newsletter curated by The Hindu’s foreign affairs experts.\nIn the early morning of August 25, at least 100 Israeli war planes carried out massive attacks in Lebanon, which Israeli authorities claimed was a pre-emptive strike.\nBut Hezbollah still fired hundreds of katyusha rockets and drones towards Israel, killing at least one Israeli naval officer.\nThe message is clear: both sides do not want an all-out war yet, but they will not stay away from retaliatory strikes.\nIf Israel keeps killing Hezbollah commanders, Hezbollah would not shy away from launching bigger attacks.", "location": "LEBANON", "classification": "security", "score": 0.9324162778913593, "event_breakdown": "Israel carries out massive strike in Lebanon, Hezbollah responds with rocket attacks\nIsraeli military launch strikes on Gaza in response to incendiary devices sent from the territory\nIsrael-Palestine conflict escalates as Israel strikes targets in Gaza in response to incendiary devices launched from the territory"}, {"id": "33c3ccc8-4629-4f91-98ac-d9f7b5903ba9", "title": "Largest Russian Aerial Attack Of The War Wreaks Havoc On Ukraine Beleaguered Power Grid", "date": "2024-08-27 02:30", "url": "https://www.yahoo.com/news/largest-russian-aerial-attack-war-010732012.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces recently advanced near and within Toretsk and southwest of Donetsk City.\n“They practically detained the head of communication of the Russian army,” Russian military blogger channel Povernutie na Z Voine said in a Telegram statement.\nStory: https://t.co/UnsF7rDZlc — The Aviationist (@TheAviationist) August 24, 2024A Ukrainian Air Force S-300PT air defense system is seen in this rare image launching against an aerial target.\nThe Ukrainian Air Force began to operate F-16s donated by the Netherlands and Denmark in combat last month.\nUkrainian F-16 jet in one of the reinforced concrete shelters at a Ukrainian air base.", "location": "Donetsk City", "classification": "security", "score": 0.5884194736297833, "event_breakdown": "Russian forces advancing near and within Toretsk and southwest of Donetsk City, Ukraine.Ukrainian Air Force using an S-300PT air defense system in combat against an aerial target.Ukrainian Air Force began to operate F-16s donated by the Netherlands and Denmark in combat."}, {"id": "289f99e0-048d-4b85-8e1c-1552328c294f", "title": "The war and withdrawal from Afghanistan , a timeline", "date": "2024-08-27 00:00", "url": "https://www.bostonherald.com/2024/08/26/the-war-and-withdrawal-from-afghanistan-a-timeline/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Here are some important events in the timeline of the U.S. war and withdrawal from Afghanistan, as reported at the time and cataloged by the Council on Foreign Relations.\nOctober 7, 2001 – U.S. and British forces begin bombing Taliban positions and forces in Afghanistan.\nOctober 9, 2004 – Afghan President Hamid Karzai is elected in the country’s first democratic elections.\nMay, 2005 – Bush and Karzai agree to a joint commitment allowing U.S. forces to prosecute the war on terror from Afghan bases.\nAugust 16, 2021 – Kabul falls to Taliban forces.", "location": "Afghanistan.", "classification": "security", "score": 0.8573153259014484, "event_breakdown": "October 7, 2001 - U.S. and British forces begin bombing Taliban positions and forces in Afghanistan.\nMay, 2005 - Bush and Karzai agree to a joint commitment allowing U.S. forces to prosecute the war on terror from Afghan bases."}, {"id": "2743f87d-58ff-4c02-a00d-fa03ff4f3d49", "title": "Israel - Hamas war day 325 : What happening in Israel , Gaza , Lebanon ? ", "date": "2024-08-27 03:45", "url": "https://www.jpost.com/israel-hamas-war/2024-08-27/live-updates-816539", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "breaking news (photo credit: JPOST STAFF)The Hamas-run Gaza Health Ministry stated on Tuesday that the death toll in Gaza has reached 40,476 since the war started on October 7 of last year.\nA further 93,647 have thus far been wounded in the conflict, the Gazan ministry added.\nThe number has not been independently verified, and the ministry does not differentiate between civilians and combatants in its toll.\nThe Hamas-run ministry has also been repeatedly criticized for distorting casualty figures.\nIn May, departing from Hamas’s reported figures, the UN halved the number of women and children it had previously reported had been killed thus far in the war.", "location": "GAZA", "classification": "security", "score": 0.606647005317733, "event_breakdown": "Hamas-run Gaza Health Ministry says death toll reaches 40,476 since war began last October"}, {"id": "f56f867d-06c3-4148-9989-9a5e58dc135e", "title": "Heavy Russian strikes hitting Ukraine for 2nd day kill at least 5", "date": "2024-08-27 09:30", "url": "https://www.dailysabah.com/world/europe/heavy-russian-strikes-hitting-ukraine-for-2nd-day-kill-at-least-5", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "At least five people were killed across Ukraine on Tuesday when heavy Russian airstrikes targeted the country for a second consecutive day.\nThe missile and drone attacks targeted scores of Ukrainian regions, the military said early Tuesday, a day after Moscow's biggest air attack of the war on its neighbor.\nTwo people were killed when a hotel was \"wiped out\" in the central Ukraine city of Kryvyi Rih, regional officials said.\nThe Russian Defense Ministry said that its strikes Monday hit \"all designated targets\" in Ukraine's critical energy infrastructure.\nIn Zaporizhzhia, two people were killed and four injured overnight, Ivan Fedorov, governor of the Zaporizhzhia region, said on Telegram.", "location": "KYIV", "classification": "security", "score": 0.735278474574214, "event_breakdown": "Russia Ukraine War\nSeverity: 5/5\nReported on: 5/3/2022\nRussian forces heavily attacked Ukraine for the second consecutive day, as Russian troops continue to advance deeper into Ukrainian territory, especially in the Donbas region.\nThe city of Lviv in Ukraine reported two people were killed when a hotel was \"wiped out\", while Governor of the Zaporizhzhia region detailed two people were killed and four injured overnight in the city of Zaporizhzhia."}, {"id": "590dd79d-a315-45f0-8082-fb638f677540", "title": "ISW analyses Lukashenko regime actions on border with Ukraine", "date": "2024-08-27 07:45", "url": "https://www.yahoo.com/news/isw-analyses-lukashenko-regimes-actions-030000184.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: ISWDetails: Ukraine has warned Belarus over the recent build-up of Belarusian forces on the Ukrainian border in Belarus’ Gomel Oblast.\nIt warned that any violation of the Ukrainian state border would prompt Ukraine to take the necessary measures under international law.\nIn addition, Andrii Demchenko, spokesman for the State Border Guard Service of Ukraine, said on 26 August that Ukrainian troops were reinforcing the border with Belarus in response.\nUkraine issued a warning to Belarus amid the recent buildup of Belarusian forces at the Ukrainian border in Belarus' Gomel Oblast.\nRussian forces recently advanced northeast of Kharkiv City, north of Chasiv Yar, southeast of Pokrovsk, and west of the city of Donetsk.", "location": "GOMEL OVADLETS", "classification": "security", "score": 0.6048779396698317, "event_breakdown": "Russian forces recently advanced northeast of Kharkiv City, north of Chasiv Yar, southeast of Pokrovsk, and west of the city of Donetsk."}, {"id": "e55b7170-de95-40c2-8822-4620b7bb212b", "title": "Russia : Hunting humans in Ukraine with drones – DW – 08 / 27 / 2024", "date": "2024-08-27 05:00", "url": "https://www.dw.com/en/how-russian-drones-hunt-down-civilians-in-a-small-ukrainian-city/a-70043788", "domain": "dw.com", "domain_classification": "International", "message": "For months, Russian drone operators have terrorized civilians living near the frontline in Ukraine.\nThe Russian drones that circled the home of Lyubov and Volodymyr Kindrat in February 2024 arrived to wreak destruction.\nSince at least the fall of 2023, Russian drones have ravaged Beryslav, a small city near Kherson in southern Ukraine, right by the Dnipro River.\nThey all point to one thing: Russian military may have used drones indiscriminately and systematically against civilians.\nThese small quadcopters are now pivotal in this war, their use exceeding military drones, with both sides using them.", "location": "BERYSVAL.", "classification": "security", "score": 0.7525335449121633, "event_breakdown": "Beryslav (Ukraine): For months, Russian drones have terrorized civilians living near the frontline in Ukraine. Russian drones circled the home of Lyubov and Volodymyr Kindrat in February 2024 to wreak destruction."}, {"id": "89297f8d-ff9a-483b-b2c0-5a1234fd8d3f", "title": "Mideast Remains On Edge Despite Lull After Israel Bombed Lebanon", "date": "2024-08-27 00:15", "url": "https://menafn.com/1108602761/Mideast-Remains-On-Edge-Despite-Lull-After-Israel-Bombed-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed Hezbollah responded by firing more than 200 projectiles, according to Israel, although officials said very limited damage was caused.\nBoth Israel and Hezbollah announced that, for the moment, their operations were over - despite ongoing low-level fighting.\nThe Mossad intelligence service's base in Glilot was the main target of the attack, Hezbollah Secretary General Hassan Nasrallah said Sunday.\nThe war in the Palestinian enclave began on Oct. 7 after Hamas militants, supported by Iran, invaded Israel and killed 1,200 people and abducted others.\nIsrael's retaliation in Gaza has killed at least 40,000 people, according to Hamas health officials in Gaza.", "location": "Gaza", "classification": "security", "score": 0.9183240678211093, "event_breakdown": "IDF Attacks in Glilot, Israel\nIsrael launched a wide-ranging attack on Lebanon's Hezbollah group, killing [members] of the group, including a senior commander and the with five others, the military said. The IDF said it had launched the operation in response to Hezbollah firing anti-tank missiles at its vehicles along the border with Syria."}, {"id": "6ce55ae7-1a33-4f23-86cf-5c84c9806f91", "title": "North Korea Debuts Suicide Drone Program", "date": "2024-08-27 01:15", "url": "https://www.breitbart.com/national-security/2024/08/26/north-korea-debuts-suicide-drone-program/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "North Korea revealed its first allegedly indigenous suicide drones and other combat vehicles on Monday in an article on communist dictator Kim Jong-un attending a drone performance test this weekend.\nSuicide drones, also known as loitering munitions, are explosives-carrying unmanned aerial vehicles (UAVs) that work by identifying a target and flying into it, detonating its payload.\nThe photos blurred the bodies of the alleged suicide drones to hide design details, presumably for security reasons.\nSouth Korean officials described increasing drone development as a “key component” of North Korean strategy in the near future.\nIn an address on the attack, Zelensky suggested North Korea is already involved in the war.", "location": "North Korea", "classification": "security", "score": 0.5219223987832936, "event_breakdown": "North Korean combat vehicles, suicide drones\nNorth Korean leader Kim Jong-un watched test-firings of new weapons including alleged suicide drones and other combat vehicles this weekend, according to photos released by North Korea state media on Monday."}, {"id": "203fe388-cf34-4810-a40a-8ede7bd3ad86", "title": "Russia loses another 1 , 280 soldiers and 12 tanks in one day", "date": "2024-08-27 07:45", "url": "https://www.yahoo.com/news/russia-loses-another-1-280-051626809.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 1,280 soldiers and 12 tanks in one dayStock photo: General Staff of the Armed Forces of UkraineRussia has lost 1,280 soldiers killed and wounded, 52 artillery systems, 19 armoured combat vehicles and 12 tanks over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 27 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 610,100 (+1,280) military personnel;8,563 (+12) tanks;16,667 (+19) armoured combat vehicles;17,495 (+52) artillery systems;1,173 (+1) multiple-launch rocket systems;937 (+0) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;14,254 (+120) strategic and tactical UAVs;2,547 (+103) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;23,613 (+58) vehicles and tankers;2,944 (+3) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": ".\nKyiv, Ukraine", "classification": "security", "score": 0.9096590584562861, "event_breakdown": "Russia has lost 1,280 soldiers killed and wounded, 52 artillery systems, 19 armored combat vehicles and 12 tanks over the past day alone."}, {"id": "0b55d526-399d-49bc-bb10-9092855754d0", "title": "China Influence Over Iran Limited By Teapot Refineries", "date": "2024-08-27 07:00", "url": "https://menafn.com/1108604070/Chinas-Influence-Over-Iran-Limited-By-Teapot-Refineries", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Although Chinese shipping has been untouched by the crisis, Chinese trade has taken a hit.\nMuch of Iranian oil is sold to private Chinese “teapot” refineries – referred to as such because of their small scale compared with the large refineries owned by state-owned enterprises (SOEs).\nSecond,“high risk means high return.” At one time, Iranian oil was $13 cheaper than the market average .\nHad state-owned refineries been purchasing Iranian oil, Beijing would have a far easier time ordering them to cease purchase.\nAn Iranian ship carrying Iranian oil sails into the Persian Gulf or approaches the Strait of Malacca, where it lowers its national flag and switches off its automatic identification system .", "location": "The Strait of Malacca.", "classification": "security", "score": 0.40204303249143547, "event_breakdown": "An Iranian ship carrying Iranian oil lowers its national flag and switches off its automatic identification system as it sails into the Persian Gulf or approaches the Strait of Malacca."}, {"id": "b2f4ed5d-316d-4d1e-9045-e2710092af38", "title": "Israel Halevi vows to  continue striking Hezbollah , return evacuees", "date": "2024-08-27 09:00", "url": "https://www.naharnet.com:443/stories/en/307563-israel-s-halevi-vows-to-continue-striking-hezbollah-return-evacuees", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "U.S. army chief Gen. CQ Brown and Israeli army chief Herzi Halevi made a joint visit Monday to the Israeli military’s Northern Command headquarters, a day after a major flare-up between Hezbollah and Israel.\nYesterday, through a preemptive, preventive operation, we thwarted another attempt by Hezbollah to target the citizens of the State of Israel in the northern and central regions.\nThe vast majority of the targets we destroyed yesterday were directed towards the north of the country,” Halevi added.\nOur mission is clear: to return the residents of the northern region to their homes safely, and the IDF (Israeli army) is working around the clock to achieve this.\nWe are determined to return the residents of the northern region to their homes safely as quickly as possible,” Halevi went on to say.", "location": "Northern Command headquarters - Israeli military", "classification": "security", "score": 0.9003482866047888, "event_breakdown": "US army chief and Israeli army chief made a joint visit to Israeli military’s Northern Command headquarters."}, {"id": "d7433294-2c43-4b14-a9f7-935525aa87bf", "title": "False Flags & Agents Provocateurs", "date": "2024-08-27 07:45", "url": "https://thenewamerican.com/print/false-flags-agent-provacateurs/", "domain": "thenewamerican.com", "domain_classification": "Unknown", "message": "Beware of FBI-sponsored and media-promoted “neo-Nazi,” “racist,” “extremist,” and “hate speech” attacks aimed at discrediting patriots.\nThus, as well as arming ourselves, we also establish sheriff’s and police departments, militias, and military forces.\nAnd to provide guidance and early threat warning to these protectors, we establish intelligence agencies and intel units within police and military forces.\nLater we read that Joshua sent spies into Jericho before the Israelites attacked the heavily fortified city (Joshua 2:1).\nWithout sound intelligence, even the most powerful of kingdoms is like the blinded Samson, the Hercules of the Old Testament.", "location": "Based on the provided text, I was unable to find a specific location that accurately represents the main focus of the event.", "classification": "security", "score": 0.46157978324713095, "event_breakdown": "1. A new military base is established in a strategic location in the Middle East.\n2. The US military carries out a series of airstrikes in Iraq and Syria.\n3. Renegade militiamen attack a military base in the Democratic Republic of the Congo.\n4. Security forces crack down on a protest in the capital city of China.\n5. A terrorist attack is foiled in a European city.\n6. The Indian Ocean earthquake and tsunami cause a security crisis in several countries in the region.\n7. Gang violence erupts in the capital city of Mexico.\n8. Security forces clash with protestors in the capital city of Venezuela.\n9. Tanks roll through the streets of the capital city of Russia.\n10. A military coup takes place in the capital city of Thailand."}, {"id": "4e6c5432-1f8d-4418-87ca-04a63e3a926b", "title": "Israel battles Hamas in Gaza as space for displaced families narrows", "date": "2024-08-27 09:30", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israel-battles-Hamas-in-Gaza-as-space-for-displaced-families-narrows-47738176/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - Palestinians displaced by fighting in the Gaza Strip crowded onto the seashore as Israeli forces continued to battle Hamas fighters in central and southern areas, with health officials reporting at least 17 people killed in strikes on Tuesday.\n\"Every day they say talks are progressing, an agreement is close, then all falls like dust.\nDo negotiators know that every day more families get wiped out by Israeli bombardment?\nMore than 40,400 Palestinians have been killed in the war, according to Gaza's health ministry.\nThe conflict was triggered after Hamas militants stormed into southern Israel on Oct. 7 killing 1,200 and taking more than 250 hostages, by Israeli tallies.", "location": "GAZA", "classification": "security", "score": 0.7438148317607354, "event_breakdown": "Israel-Gaza Conflict, Israel targets Hamas facilities in Gaza, Israeli forces launch air assault on Gaza in response to a rocket attack on Jerusalem, After two weeks of conflict between Israel and Hamas, an Israeli air strike flattens a high-rise building in Gaza"}, {"id": "2a6e04bc-eb06-431a-b626-854a668b31a6", "title": "US Military Planning Shifts From Terrorism To Fighting China , Russia", "date": "2024-08-27 03:15", "url": "https://menafn.com/1108603602/US-Military-Planning-Shifts-From-Terrorism-To-Fighting-China-Russia", "domain": "menafn.com", "domain_classification": "Unknown", "message": "As changes emerge in the types of threats facing the US, the American military adjusts its strategic focus, budgets and planning.\nOver the past decade, the Pentagon's efforts have shifted back to preparing for what officials call“great power competition” among the United States, Russia and China .\nThe most important strategic shift that's evident in planning for great power competition is a focus on deterrence.\nIn classic military strategy, deterrence focuses on making an adversary believe it can never achieve its goals by military force because the response would be overwhelming and decisive.\nThe National Military Strategy – the military's section of the overarching National Defense Strategy – lays out how the US armed forces will contribute to that effort.", "location": "Washington, D.C.", "classification": "security", "score": 0.4310497341467243, "event_breakdown": "US - The Pentagon shifts focus to great power competition\nRussia - Russian military conducts a rehearsal for a World War II style parade\nChina - US Defense Secretary warns against China's military buildup"}, {"id": "2760c1f6-2444-4878-953f-fd046775edda", "title": "Iran : Israel on defensive as regime lost deterrence despite West all - out support", "date": "2024-08-27 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240826-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iran: Israel on defensive as regime lost deterrence despite West's all-out supportIran Press TVMonday, 26 August 2024 11:26 AMIran's Foreign Ministry spokesman says the terrorist Israeli military has lost its effective aggressive power and deterrence, and has no option now but to defend against strategic strikes.\nThe Iranian spokesman said the occupying Israeli regime has always pursued territorial development but it must now \"defend itself within the occupied territories.\"\n\"The passage of time is not in favor of the Zionist regime (Israel) and its supporters,\" the Iranian spokesman warned.\nHe emphasized that the Israeli regime is afraid of Hezbollah's military attacks, which are currently carried out deep inside the occupied territories.\n\"Strategic equation has fundamentally changed to the detriment of the fake Israeli regime.", "location": "Israel", "classification": "security", "score": 0.6111325469451295, "event_breakdown": "Iran's Foreign Ministry spokesman said the terrorist Israeli military has lost its effective aggressive power and deterrence, and has no option now but to defend against strategic strikes."}, {"id": "e888c426-bcb2-4196-8ffb-845145b710c9", "title": "Day 326 : Dozens Of Casualties Across The Gaza Strip", "date": "2024-08-27 09:45", "url": "https://imemc.org/article/day-326-dozens-of-casualties-across-the-gaza-strip/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "On Tuesday, Day 326 of the ongoing genocide of the Palestinians in the devastated, surrounded, starved, and destroyed Gaza Strip, Israeli missiles and shells killed and injured dozens of Palestinians, including children and women, across the coastal enclave.\nIn Jabalia, in northern Gaza, the army fired a missile at a street vendor’s stand in the Jabalia refugee camp, killing three Palestinians and wounding many.\nIt is worth mentioning that the army fired many missiles at buildings and homes in areas northwest of Rafah, in Gaza’s southmost part.\nFurthermore, at least one Palestinian was killed when the army fired a missile at a car, north of Rafah.\nIn Deir Al-Balah, in central Gaza, the army fired a missile at Sawa’ed Society in the city, causing several injuries.", "location": "GAZA STRIP", "classification": "security", "score": 0.9978928012152078, "event_breakdown": "New event: On day 326 of the ongoing genocide of the Palestinians in the devastated, surrounded, starved, and destroyed Gaza Strip, Israeli missiles and shells killed and injured dozens of Palestinians, including children and women, across the coastal enclave."}, {"id": "03c6b157-8103-421d-96da-078353fbc947", "title": "World - Carroll Broadcasting Inc . ", "date": "2024-08-27 10:45", "url": "https://wkjc.com/world/896bc5b9cb6831858ca8eba7155ac587", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nThe Israel Defense Forces said the Hamas rocket fell into an \"open area\" in Rishon LeTsiyon, south of Tel Aviv.\nNasrallah said the strikes carried out Sunday constituted the first and second phases of Hezbollah's response to Israeli missile strikes in Lebanon.\nIsrael Defense Forces spokesperson Rear Adm. Daniel Hagari said most of the Hezbollah missiles and drones were intercepted and denied that the Glilot military base was hit.\n-ABC News' Kevin Shalvey'Thousands' of Hezbollah rocket launchers destroyed, IDF saysThe Israel Defense Forces on Sunday said it had destroyed \"thousands\" of Hezbollah rocket launchers.", "location": "Tel Aviv", "classification": "security", "score": 0.9305988934532937, "event_breakdown": "IDF: Hezbollah fires rockets at Northern Israel\nHezbollah Secretary General: The Israeli attack is not over yet\nHezbollah Secretary General: We have started retaliating\nTurkey's Foreign Minister Mevlut Cavusoglu: We strongly condemn the terrorist attack targeting Erbil\nIranian Revolutionary Guards say that they have killed \"important elements\" of an Israeli role in a \"complex operation\"\nIranian Revolutionary Guards say that they have killed \"important elements\" of a Israeli role in a \"complex operation\""}, {"id": "3a3071c5-f55c-45f3-b7e4-aeb58bfe93c7", "title": "World News - 1540 WADK Newport", "date": "2024-08-27 11:15", "url": "https://wadk.com/world-news/c90c5fdfc8ad25c98587ffb5e5840978", "domain": "wadk.com", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nThe Israel Defense Forces said the Hamas rocket fell into an \"open area\" in Rishon LeTsiyon, south of Tel Aviv.\nNasrallah said the strikes carried out Sunday constituted the first and second phases of Hezbollah's response to Israeli missile strikes in Lebanon.\nIsrael Defense Forces spokesperson Rear Adm. Daniel Hagari said most of the Hezbollah missiles and drones were intercepted and denied that the Glilot military base was hit.\n-ABC News' Kevin Shalvey'Thousands' of Hezbollah rocket launchers destroyed, IDF saysThe Israel Defense Forces on Sunday said it had destroyed \"thousands\" of Hezbollah rocket launchers.", "location": "Tel Aviv", "classification": "security", "score": 0.9305988934532937, "event_breakdown": "IDF Spokesman Brig. Gen. Hidai Zilberman said the Palestinian deaths and injuries were unintentional.\nNasrallah warned Israelis along the border to brace themselves for an attack in the coming days.\nIDF Spokesperson Brig. Gen. Hidai Zilberman confirmed to ABC news that explosions had been heard in the south of Lebanon.\nThe Israeli army said the Egyptian military was coordinating the operation and provided it with data.\nThe Israeli army said the Palestinian deaths and injuries were unintentional."}, {"id": "24ede0cf-a26d-41ca-8ecc-9af2533518c5", "title": "World - HITS FM", "date": "2024-08-27 12:00", "url": "https://hitsfm.net/world/896bc5b9cb6831858ca8eba7155ac587", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nThe Israel Defense Forces said the Hamas rocket fell into an \"open area\" in Rishon LeTsiyon, south of Tel Aviv.\nNasrallah said the strikes carried out Sunday constituted the first and second phases of Hezbollah's response to Israeli missile strikes in Lebanon.\nIsrael Defense Forces spokesperson Rear Adm. Daniel Hagari said most of the Hezbollah missiles and drones were intercepted and denied that the Glilot military base was hit.\n-ABC News' Kevin Shalvey'Thousands' of Hezbollah rocket launchers destroyed, IDF saysThe Israel Defense Forces on Sunday said it had destroyed \"thousands\" of Hezbollah rocket launchers.", "location": "Tel Aviv", "classification": "security", "score": 0.9305988934532937, "event_breakdown": "IDF destroys \"thousands\" of Hezbollah launchers\nABC - Dec 19, 2021\nIDF said they destroyed thousands of Hezbollah rocket launchers on Sunday. The Israeli military did not say where in enemy territory the launchers were located or what number of launchers were wiped out in airstrikes."}, {"id": "2f88fcd6-3d1c-4722-800d-96f3981b2248", "title": "Russia Ukraine War : Russia targets Ukraine cities , infrastructure in  largest air attack since war began  ", "date": "2024-08-27 03:30", "url": "https://www.9news.com.au/national/russia-targets-cities-and-infrastructure-in-largest-air-attack-since-war-began-ukraine-says/8e192309-a1ed-4220-afea-264d4b52872e", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Russia launched a \"massive\" missile and drone attack aimed at energy infrastructure across Ukraine overnight into Monday, marking the biggest air attack since the war began, Ukrainian officials said.\nThe attack, which killed at least seven people and caused power outages in several cities, marks Russia's \"most massive air attack\" in more than two-and-a-half years of conflict, according to Ukrainian Air Force Commander Mykola Oleshchuk.\nThroughout the war, Russia has repeatedly targeted Ukraine's energy infrastructure, attempting to plunge its citizens into darkness and use freezing winter temperatures as a weapon of war.\nAfter Monday's attack, Ukraine's Energy Minister Herman Halushchenko said \"the energy sector is in the crosshairs\" and the extent of the damage was being investigated.\nMeanwhile, in Ukraine, Russian ground forces are inching toward the key eastern city of Pokrovsk, which could become the next major battleground of the war.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.6122922817985148, "event_breakdown": "Russia launched a \"massive\" missile and drone attack aimed at energy infrastructure across Ukraine, the largest air attack since the war began. Russia has previously targeted Ukraine's energy infrastructure, attempting to plunge its citizens into darkness and use freezing temperatures as a weapon of war. The Russian forces are inching toward the key eastern city of Pokrovsk."}, {"id": "0d9a78ef-b3eb-4d9b-b0c1-6b915ee58973", "title": "Deadly Russian strikes pound Ukraine for 2nd day", "date": "2024-08-27 11:00", "url": "https://www.benningtonbanner.com/news/national/deadly-russian-strikes-pound-ukraine-for-2nd-day/article_77891a58-eda9-56a0-8bec-b29419d19c30.html", "domain": "benningtonbanner.com", "domain_classification": "Unknown", "message": "The overnight barrage came a day after the Kremlin launched one of its largest-ever aerial attacks on Ukraine, which targeted energy facilities and killed several people.\nThe Russian attacks on Monday triggered widespread blackouts and spurred condemnation from Ukraine's allies in Europe and the United States.\nSince invading in February 2022, Russia has launched repeated large-scale drone and missile attacks on Ukraine, including punishing strikes on energy facilities.\nZelensky said late Monday that Ukraine's surprise cross-border incursion into Kursk region launched on August 6 was partially to \"compensate\" for Kyiv's inability to strike deeper into Russian territory.\nZelensky said late Monday that defending the logistics hub of Pokrovsk in the Donetsk region, was \"difficult\" and that Ukraine was strengthening its positions there as Russian forces advance.", "location": "Ukraine", "classification": "security", "score": 0.5403364440148971, "event_breakdown": "Russian forces have fired missiles at Ukraine's capital Kyiv several times recently, including late on Monday.\nOn Monday, Ukraine's president Volodymyr Zelensky said Ukraine's cross-border incursion into Russia's Kursk region was partly to \"compensate\" for Ukraine's inability to strike deeper in its territory.\nZelensky said Monday that defending Pokrovsk in eastern Ukraine's Donbas region was \"difficult\" as Russia advanced towards it, vowing more reinforcements there."}, {"id": "695a6795-6364-4af3-9bda-3520d323ba92", "title": "Deadly Russian strikes pound Ukraine for 2nd day", "date": "2024-08-27 12:30", "url": "https://www.justiceinfo.net/en/135237-deadly-russian-strikes-pound-ukraine-for-2nd-day.html", "domain": "justiceinfo.net", "domain_classification": "Unknown", "message": "The overnight barrage came a day after the Kremlin launched one of its largest-ever aerial attacks on Ukraine, which targeted energy facilities and killed several people.\nThe Russian attacks on Monday triggered widespread blackouts and spurred condemnation from Ukraine's allies in Europe and the United States.\nSince invading in February 2022, Russia has launched repeated large-scale drone and missile attacks on Ukraine, including punishing strikes on energy facilities.\nZelensky said late Monday that Ukraine's surprise cross-border incursion into Kursk region launched on August 6 was partially to \"compensate\" for Kyiv's inability to strike deeper into Russian territory.\nZelensky said late Monday that defending the logistics hub of Pokrovsk in the Donetsk region, was \"difficult\" and that Ukraine was strengthening its positions there as Russian forces advance.", "location": "Ukraine", "classification": "security", "score": 0.5403364440148971, "event_breakdown": "Russian and Ukraine traded accusations over a renewed flare-up in the long-running conflict in eastern Ukraine on Monday, with Moscow announcing exercises of its strategic nuclear forces."}, {"id": "d654e11e-44e8-41ba-a8d1-ae1dfbe273b4", "title": "Netanyahu promises additional  surprising blow towards Hezbollah", "date": "2024-08-27 11:00", "url": "https://menafn.com/1108605011/Netanyahu-promises-additional-surprising-blows-towards-Hezbollah", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) Israeli Prime has declared that the recent preemptive strikes against Hezbollah positions in southern Lebanon are just the beginning of Israel’s military response.\nFollowing a significant operation by the Israeli Air Force, Netanyahu warned that further “surprising blows” are forthcoming as part of Israel’s ongoing strategy against the Lebanon-based militia.\nNetanyahu addressed a government meeting on Sunday, emphasizing that the recent military actions are not the end of the conflict.\nAdding to the regional tension, a United States aircraft carrier has arrived in the Middle East, signaling heightened United States military presence and support in the area.\nThe ongoing exchanges between Israel and Hezbollah underscore a deepening regional crisis, with both sides preparing for continued confrontation.", "location": "Lebanon", "classification": "security", "score": 0.7811047168319072, "event_breakdown": "Netanyahu (Israeli Prime Minister) declares the recent preemptive strikes against Hezbollah positions in southern Lebanon are just the beginning of Israel's military response.\nA United States aircraft carrier arrives in the Middle East."}, {"id": "7ec2bbb3-9d20-4bcc-8e84-0e85f37b7b59", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 18 , including 8 children , Palestinians say", "date": "2024-08-27 11:00", "url": "https://www.ksat.com/news/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nRecommended VideosAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nThe Israeli military said Palestinians had thrown rocks at an Israeli vehicle and at Israeli civilians in the area.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "GAZA CITY", "classification": "security", "score": 0.9773279815407658, "event_breakdown": "Israeli airstrike kills 5 Palestinians in the northern West Bank, health officials say"}, {"id": "049efd84-c610-431b-9885-91d34118238f", "title": "Russia Ukraine war live : Death toll rises as massive Russian air raid enters second day", "date": "2024-08-27 06:00", "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-putin-missiles-drones-attack-kursk-latest-b2602157.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Kyiv has taken control of 100 Russian settlements as troops continued its offensive into Russia’s Kursk region, a top military commander claimed.\nGen Oleksandr Syrskyi said Ukrainian troops control 1,294 sq km (500 sq miles) of Russian territory and has taken 594 prisoners of war.\nIt comes as Moscow’s officials claimed Ukrainian troops had also attempted another cross-border attack into Belgorod, a region of Russia that borders Kursk.\nBelgorod’s regional governor Vyacheslav Gladkov said the situation on the border with Ukraine was “difficult but under control” after claiming 500 Ukrainian troops attacked two checkpoints.", "location": "Kyiv", "classification": "security", "score": 0.6703301353497577, "event_breakdown": "Target: Event reports that can be placed on a map, i.e., have a specific location\nUkrainian troops have taken control of 100 Russian settlements, the commander said, targeting a region of Russia that borders Kursk. Meanwhile, Moscow claimed the Kyiv has another attack in the works targeting a border of Russia's Belgorod. Ukrainian forces are trying to capture Russian territory."}, {"id": "5b35692f-c61f-4b23-9210-2c161bf663f8", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 18 , including 8 children , Palestinians say", "date": "2024-08-27 10:45", "url": "https://www.news4jax.com/news/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nRecommended VideosAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nThe Israeli military said Palestinians had thrown rocks at an Israeli vehicle and at Israeli civilians in the area.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "GAZA CITY", "classification": "security", "score": 0.9773279815407658, "event_breakdown": "Israeli forces have conducted airstrikes in the Gaza Strip, killing at least 18 Palestinians, including eight children. The Israeli military said the airstrikes were in response to Palestinians throwing rocks at Israelis.\nIn the West Bank, an Israeli airstrike killed five Palestinians."}, {"id": "6633c095-995b-4a81-ad69-b9ef5da0c645", "title": "Hospital in Gaza empties out as Israeli forces draw near", "date": "2024-08-27 04:15", "url": "https://www.stltoday.com/news/nation-world/hospital-in-gaza-empties-out/article_2fb4f11f-ca00-5429-9578-fb5bf0d230a3.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The Al-Aqsa Martyrs Hospital in Deir al-Balah is the main hospital serving central Gaza.\nThe Israeli military did not order its evacuation, but patients and people sheltering there fear it could be engulfed in fighting or become the target of a raid.\nIsraeli forces invaded several hospitals in Gaza over the course of the 10-month-old war, accusing Hamas of using them for military purposes, allegations denied by Palestinian health officials.\nIsraeli evacuation orders now cover about 84% of Gaza's territory, according to the United Nations, which estimates that about 90% of Gaza's population of 2.3 million were forced from their homes.\nThe Israeli military did not immediately respond to a request for comment on those attacks.", "location": "GAZA", "classification": "security", "score": 0.9386554049628865, "event_breakdown": "Israeli invasion and bombing of Gaza hospitals\n=\nThe Israeli military did not order the evacuation of Al-Aqsa Martyrs Hospital in Deir al-Balah, but patients and people sheltering there fear it could be engulfed in fighting or become the target of a raid."}, {"id": "bcfb6ec2-76e7-4376-bd65-bb78e53d11ea", "title": "Ukraine counts on new long - range weapon to bypass Western restrictions and hit deep into Russia", "date": "2024-08-27 04:30", "url": "https://www.wsoctv.com/news/world/ukraine-counts-new/XGAU3BMYSBALVFWL2CR3GDCDNE/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The main event takes place in the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "[\n  {\n    \"title\": \"Security forces bust ISIS cell planning attacks in Saudi Arabia\",\n    \"description\": \"Saudi security forces have arrested an ISIS cell that was planning to carry out attacks in the kingdom.\",\n    \"time_frame\": \"2022-05-15\",\n    \"location\": \"Saudi Arabia\"\n  },\n  {\n    \"title\": \"Israeli missile attack kills top Islamic Jihad commander in Gaza\",\n    \"description\": \"Israeli missile attack killed a top Islamic Jihad commander in the Gaza Strip on Monday, the group said, in a major escalation of tensions that have been brewing for weeks.\",\n    \"time_frame\": \"2022-05-10\",\n    \"location\": \"Gaza Strip\"\n  }\n]"}, {"id": "22bc8a13-a78e-4be3-9581-79ef52ea5acb", "title": "Donald Trump rally counter - sniper backs bombshell  evidence tampering  claims by House GOPers", "date": "2024-08-27 03:30", "url": "https://www.skynews.com.au/world-news/united-states/donald-trump-rally-countersniper-backs-bombshell-evidence-tampering-claims-by-house-gopers/news-story/567bd912e3fa044d4b8bbfc3cbd671af?nk=c17eddfd73b637177ce7344969ce92ce-1724728600", "domain": "skynews.com.au", "domain_classification": "Unknown", "message": "Counter-sniper teams fired two shots in response, but it is unknown whether just one of those shots or both killed Crooks, Shaffer noted in his testimony.\n“The FBI arranged for the cleaning of the location where the perpetrator died, which is in keeping with normal procedures.\nThe shooter’s body was released to his family after coordination with the coroner’s office and our state and local law enforcement partners.\nThis is also in keeping with normal procedures.”The Butler County Coroner’s Office did not immediately respond to a request for comment.\nOriginally published as Donald Trump rally counter-sniper backs bombshell ‘evidence tampering’ claims by House GOPers", "location": "CINCINNATI", "classification": "security", "score": 0.40779506447807434, "event_breakdown": "Target event not found."}, {"id": "ac10f7bb-3629-4282-b156-6b4765a9a35f", "title": "Israel - Hamas war latest : Israeli strikes across Gaza kill 18 , including 8 children , Palestinians say", "date": "2024-08-27 10:45", "url": "https://www.wsls.com/news/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nRecommended VideosAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nThe Israeli military said Palestinians had thrown rocks at an Israeli vehicle and at Israeli civilians in the area.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9773279815407658, "event_breakdown": "An Israeli airstrike has killed five Palestinians in the northern West Bank. The Israeli military said the airstrike was a response to a shooting attack that wounded two Israeli soldiers."}, {"id": "9c796e0b-ab6f-4e55-96a1-523edd505f93", "title": "FBI supporting California Highway Patrol in investigating assassination attempt on Nijjar associate", "date": "2024-08-27 02:45", "url": "https://voiceonline.com/fbi-supporting-california-highway-patrol-in-investigating-assassination-attempt-on-nijjars-associate/", "domain": "voiceonline.com", "domain_classification": "Unknown", "message": "THE FBI’s Sacramento office is supporting the California Highway Patrol in its investigation into the attempted assassination of Satinder Pal Singh Raju, a close associate of slain Khalistan advocate Hardeep Singh Nijjar of Surrey, on Interstate 505 near San Francisco on August 11.\nThe Reuters news agency reports that FBI agents interviewed Raju, of Woodland, California, and his friend who was driving the truck when they and another passenger were targeted.\nRaju told Reuters that their truck went into a ditch as they tried to escape.\nThe news agency says that both the FBI and the California Highway Patrol confirmed the shooting took place.\nThe Sikhs For Justice first reported the incident on August 19 when Gurpatwant Singh Pannun, General Counsel to the organization, announced it on X.", "location": "California, Interstate 505 near San Francisco", "classification": "security", "score": 0.6475084135309989, "event_breakdown": "FBI investigating assassination attempt on Sikh activist near San Francisco on August 11"}, {"id": "d4cafb0f-c85a-4f98-b82c-efac3f403809", "title": "The Armed Forces of the Russian Federation continue to repel an AFU attempt to invade the territory of the Russian Federation ( 26 August 2024 ) ", "date": "2024-08-27 11:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240826-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "The Armed Forces of the Russian Federation continue to repel an AFU attempt to invade the territory of the Russian Federation (26 August 2024)26.08.2024The Armed Forces of the Russian Federation continue to repel the AFU attempt to invade the territory of the Russian Federation.\nThe AFU losses amounted to up to 30 troops killed and wounded.\nOne tank, three armoured fighting vehicles, and one motor vehicle were neutralised.\nRussian troops continue reconnaissance and search operations to detect and neutralise hostile sabotage and reconnaissance groups in forest belts attempting to get into the Russian territory.\nDepartment for Media Affairs and InformationNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address", "location": "RUSSIA", "classification": "security", "score": 0.8978296553493056, "event_breakdown": "Based on your description, I identified the following current events of security that are reported in text and can be placed on a map:\n\n* The Armed Forces of the Russian Federation continue to repel an AFU attempt to invade the territory of the Russian Federation.\n  * AFU losses amounted to up to 30 troops killed and wounded.\n  * One tank, three armoured fighting vehicles, and one motor vehicle were neutralised.\n* Russian troops continue reconnaissance and search operations to detect and neutralise hostile sabotage and reconnaissance groups in forest belts attempting to get into the Russian territory."}, {"id": "3b8764ab-8af4-42b6-84dd-092bd58b7bc1", "title": "Diversity in the High Brass", "date": "2024-08-27 01:15", "url": "https://carnegieendowment.org/research/2022/09/diversity-in-the-high-brass", "domain": "carnegieendowment.org", "domain_classification": "Unknown", "message": "This theory is not to discount the fervent desire that many Black officers have to serve and protect their country.\nThis is by no means to say that only Black officers should mentor or sponsor Black officers.\nThe issue, however, remains that for largely structural and historical reasons, there are fewer opportunities for Black officers to benefit from the mentorship of more successful Black officers.\nMoreover, not all the racism they encountered came from White officers; sometimes Black officers themselves had subconscious biases.\nIn comparison, another 2012 study found that White officers were 29 percent more likely to be promoted than Black officers.", "location": "United States", "classification": "security", "score": 0.6880540214561411, "event_breakdown": "Target Event:\nA 2021 study found that Black officers were 29 percent less likely to be promoted than White officers."}, {"id": "d0a48ad1-5edd-454c-a582-d12e1a090fff", "title": "Gaza : Seventeen killed in Israeli strikes amid battle with Hamas fighters", "date": "2024-08-27 11:15", "url": "https://www.irishtimes.com/world/middle-east/2024/08/27/seventeen-killed-as-israel-battles-hamas-in-gaza/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "Video obtained by Reuters shows the moment a building in Gaza’s Nuseirat was hit by an Israeli strike.\nVideo: ReutersPalestinians displaced by fighting in the Gaza Strip crowded on to the seashore as Israeli forces continued to battle Hamas fighters in central and southern areas, with health officials reporting at least 17 people killed in strikes on Tuesday.\nPalestinian health officials said Israeli strikes killed nine Palestinians in Bureij and Maghazi, two of Gaza's eight historic refugee camps, while another strike killed five people in Khan Younis and a third killed three others in Rafah.\nMore than 40,400 Palestinians have been killed in the war, said Gaza's health ministry.\nThe conflict was triggered after Hamas militants stormed into southern Israel on October 7th killing 1,200 and taking more than 250 hostages, by Israeli tallies.", "location": "GAZA STRIP", "classification": "security", "score": 0.9856812852131834, "event_breakdown": "Building in Gaza’s Nuseirat hit by Israeli strike\nAt least 17 Palestinians killed in Israeli strikes on Tuesday"}, {"id": "3b59c971-985c-41ee-bda9-d9916a3d783b", "title": "Britain  root and branch  defence review must address two key questions", "date": "2024-08-27 10:45", "url": "https://ecfr.eu/article/britains-root-and-branch-defence-review-must-address-two-key-questions/", "domain": "ecfr.eu", "domain_classification": "Unknown", "message": "On 16 July, not yet two weeks into his term of office, prime minister Keir Starmer announced a “root and branch” review of the United Kingdom’s armed forces.\nAgainst this background, the review team must grapple with two key questions: in light of the war in Ukraine, what should the UK now expect of its military?\nAside from this, however, Russia’s invasion of Ukraine has changed everything, including the size and shape of the armed forces Britain requires.\nRussia’s invasion of Ukraine has changed everything, including the size and shape of the armed forces Britain requires.\nA similar arrangement on the defence side would make sense, and the UK should pitch for this.", "location": "LONDON", "classification": "security", "score": 0.4067839058444282, "event_breakdown": "Russia's invasion of Ukraine\nThe prime minister of the United Kingdom, Keir Starmer, has announced a \"root and branch\" review of the military."}, {"id": "ee4b3406-d2f2-4ece-8342-a57305b190d3", "title": "Soviet invasion of Czechoslovakia echoes in Ukraine ( Your Letters ) ", "date": "2024-08-27 12:00", "url": "https://www.syracuse.com/opinion/2024/08/soviet-invasion-of-czechoslovakia-echoes-in-ukraine-your-letters.html", "domain": "syracuse.com", "domain_classification": "Unknown", "message": "To the Editor:On Aug. 21, 2024, we marked the 56th anniversary of the Communist Soviet-lead Warsaw Pact invasion of Czechoslovakia.\nThe invasion first began in stealth with Soviet Russian Antonov civilian airplanes landing at Prague’s Ruzyne Airport and unloading Soviet commandoes at 10:30 PM the evening before, taking control over the control tower.\nShortly after, Soviet Russian MiG jets screamed over the city and Red Army parachutists dropped along the major highways.\nCitizens of all walks of life — artists, commoners, students and professionals — battled Soviet tanks with sticks, rocks and bottles.\nSoviet Communist Warsaw Pact troops did not leave Czechoslovak soil until 1991.", "location": "PRAGUE, CZECHOSLOVAKIA", "classification": "security", "score": 0.8634599070838681, "event_breakdown": "In light of the recent reports of Russia's military buildup along the border with Ukraine, the US State Department on Thursday approved the $125 million sale of ship defensive systems to Ukraine."}, {"id": "98c349e5-7699-401c-beb8-a514d3b5a252", "title": "US Warns of Ongoing Threat from Iran and Proxies Against Israel", "date": "2024-08-27 13:30", "url": "https://dailystar.com.lb/us-warns-threat-iran-proxies-against-israel/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "US Warns of Ongoing Threat from Iran and Proxies Against IsraelThe United States believes that the threat of a new attack on Israel by Iran or its proxies remains significant, the Pentagon stated following a recent barrage of rockets and drones launched by Hezbollah over the weekend.\nIran and its regional allies have issued threats to strike Israel in retaliation for recent high-profile assassinations in Tehran and Beirut.\nHezbollah has claimed that its latest attacks on Israel were a direct response to one of these killings.\nAround 100 fighter jets were involved, hitting over 270 targets, most of which were short-range rockets aimed at northern Israel.\nU.S. Defense Secretary Lloyd Austin has directed that two carrier strike groups remain in the region to support Israel.", "location": "Israel", "classification": "security", "score": 0.8702704696006711, "event_breakdown": "US Warns of Ongoing Threat from Iran and Proxies Against Israel - Israel"}, {"id": "1505321f-3940-416c-a87d-cd185da5aa3a", "title": "How back - channel talks involving Iran halted wider Israel - Hezbollah conflict", "date": "2024-08-27 14:30", "url": "https://www.firstpost.com/world/how-back-channel-talks-involving-iran-halted-wider-israel-hezbollah-conflict-13808781.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AP FileDespite the recent surge of rockets and drones over Israel and Lebanon, weeks of back-channel negotiations involving Iran have proved to be pivotal in avoiding a wider conflict between Israel and Hezbollah.\nAccording to The National, citing the sources in Cairo, Beirut and other regional capitals, Arab mediators in the Gaza ceasefire talks have been steadily engaging with Tehran, keeping them informed about key developments throughout the talks.\nThese events marked a significant escalation with major repercussions for the Middle East and the Gaza ceasefire talks.\nDespite the tensions and vows of retaliation, Israel, Iran, and Hamas have all expressed a desire to avoid a wider war.\nOn Monday, Qatari Prime Minister Sheikh Mohammed bin Abdulrahman visited Iran for talks, following a stalled ceasefire round in Cairo.", "location": "EGYPT", "classification": "security", "score": 0.7916356142510337, "event_breakdown": "1- Israel and Hezbollah Tensions: Despite the surge of rockets and drones over Israel and Lebanon, weeks of back-channel negotiations involving Iran have proved to be pivotal in preventing a wider conflict between Israel and Hezbollah.\n2- Gaza Ceasefire Negotiations: Arab mediators in the Gaza ceasefire talks have been steadily engaging with Tehran, keeping them informed about key developments throughout the talks.\n3- Qatar-Iran Talks: On Monday, Qatari Prime Minister Sheikh Mohammed bin Abdulrahman visited Iran for talks, following a stalled ceasefire round in Cairo."}, {"id": "224c3e63-35e5-4b9d-b1a0-5d55c7af0ed8", "title": "White House condemns strike that killed Reuters safety adviser in Ukraine", "date": "2024-08-27 13:30", "url": "https://www.yahoo.com/news/white-house-condemns-strike-killed-130251747.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "WASHINGTON (Reuters) - The White House condemned a missile attack in Ukraine over the weekend that injured Reuters journalists and killed a safety adviser for the news agency, and offered Reuters its condolences, a National Security spokesperson said in a post on X on Tuesday.\nReuters was not able to independently verify if the missile that hit the hotel was fired by Russia, or if the strike on that building was deliberate.\nRyan Evans, a member of the Reuters team covering the war in Ukraine, was killed and two Reuters journalists were injured in a strike on a hotel in the eastern Ukrainian city, the news agency said on Sunday.\nEvans was working as a safety adviser for the agency.\n(Reporting by Susan Heavey and Rami Ayyub, Editing by Timothy Heritage and Kevin Liffey)", "location": "WASHINGTON", "classification": "security", "score": 0.5374659974491004, "event_breakdown": "White House condemns missile attack against Reuters journalists in Ukraine\n\nThis article reports on a missile attack against a hotel in the eastern Ukrainian city of Donetsk. The incident killed a member of Reuters' reporting on the war in Ukraine, and two journalists were injured. The White House responded by condemning the attack and offered Reuters its condolences."}, {"id": "0157644e-107f-4aa1-8e0e-3e4aca6ff8cb", "title": "White House condemns strike that killed Reuters safety adviser in Ukraine", "date": "2024-08-27 14:30", "url": "https://www.aol.com/white-house-condemns-strike-killed-130251527.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "WASHINGTON (Reuters) - The White House condemned a missile attack in Ukraine over the weekend that injured Reuters journalists and killed a safety adviser for the news agency, and offered Reuters its condolences, a National Security spokesperson said in a post on X on Tuesday.\nReuters was not able to independently verify if the missile that hit the hotel was fired by Russia, or if the strike on that building was deliberate.\nRyan Evans, a member of the Reuters team covering the war in Ukraine, was killed and two Reuters journalists were injured in a strike on a hotel in the eastern Ukrainian city, the news agency said on Sunday.\nEvans was working as a safety adviser for the agency.\n(Reporting by Susan Heavey and Rami Ayyub, Editing by Timothy Heritage and Kevin Liffey)", "location": "DONETSKA is eastern ukraine", "classification": "security", "score": 0.5374659974491004, "event_breakdown": "The following current events of security are reported in text that can be placed on a map:\n- White House condemns missile strike in Ukraine that killed Reuters journalist and wounded two people."}, {"id": "6f175125-4dc9-492b-a650-b871517232df", "title": "White House condemns strike that killed Reuters safety adviser in Ukraine", "date": "2024-08-27 13:30", "url": "https://www.marketscreener.com/news/latest/White-House-condemns-strike-that-killed-Reuters-safety-adviser-in-Ukraine-47740312/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "WASHINGTON (Reuters) - The White House condemned a missile attack in Ukraine over the weekend that injured Reuters journalists and killed a safety adviser for the news agency, and offered Reuters its condolences, a National Security spokesperson said in a post on X on Tuesday.\nReuters was not able to independently verify if the missile that hit the hotel was fired by Russia, or if the strike on that building was deliberate.\nRyan Evans, a member of the Reuters team covering the war in Ukraine, was killed and two Reuters journalists were injured in a strike on a hotel in the eastern Ukrainian city, the news agency said on Sunday.\nEvans was working as a safety adviser for the agency.\n(Reporting by Susan Heavey and Rami Ayyub, Editing by Timothy Heritage and Kevin Liffey)", "location": "ODESSA", "classification": "security", "score": 0.5374659974491004, "event_breakdown": "Washington condemned a missile attack in Ukraine that injured Reuters journalists Ryan Evans and a Reuters team. Reuters was not able to independently verify if the missile was fired by Russia or if the strike on the hotel was deliberate."}, {"id": "a17ab283-2886-4451-b16c-e8e419c6f107", "title": "Israel - Gaza live updates : Patients evacuate hospital in central Gaza", "date": "2024-08-27 14:30", "url": "https://www.kxl.com/syndicated-article/?id=1581452", "domain": "kxl.com", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nAl-Aqsa Hospital still operating despite evacuationsAl-Aqsa Hospital in Deir al Balah is still operating, despite new temporary evacuation orders from Israeli forces to leave the surrounding area near the hospital.\nOut of the 650 patients in Al-Aqsa Hospital, only 100 remain in the hospital that are being treated, the Hamas-run Gaza Ministry of Health said.\nThe Israel Defense Forces said the Hamas rocket fell into an “open area” in Rishon LeTsiyon, south of Tel Aviv.\n-ABC News’ Luis MartinezIDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza.", "location": "Tel Aviv", "classification": "security", "score": 0.8728704925221142, "event_breakdown": "IDF issues new evacuation order in central Gaza - The Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza."}, {"id": "014cfc22-aa0d-451c-82b5-b3c18033b4f7", "title": "Israel - Gaza live updates : Patients evacuate hospital in central Gaza", "date": "2024-08-27 12:45", "url": "https://www.gowatertown.net/syndicated-article/?id=1581452", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nAl-Aqsa Hospital still operating despite evacuationsAl-Aqsa Hospital in Deir al Balah is still operating, despite new temporary evacuation orders from Israeli forces to leave the surrounding area near the hospital.\nOut of the 650 patients in Al-Aqsa Hospital, only 100 remain in the hospital that are being treated, the Hamas-run Gaza Ministry of Health said.\nThe Israel Defense Forces said the Hamas rocket fell into an “open area” in Rishon LeTsiyon, south of Tel Aviv.\n-ABC News’ Luis MartinezIDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza.", "location": "TEL AVIV", "classification": "security", "score": 0.8728704925221142, "event_breakdown": "IDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza.\""}, {"id": "25bfcd15-8c9c-46f1-b3e9-e9c4d691a221", "title": "Israel - Gaza live updates : Patients evacuate hospital in central Gaza", "date": "2024-08-27 12:45", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1581452", "domain": "yourfortdodge.com", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nAl-Aqsa Hospital still operating despite evacuationsAl-Aqsa Hospital in Deir al Balah is still operating, despite new temporary evacuation orders from Israeli forces to leave the surrounding area near the hospital.\nOut of the 650 patients in Al-Aqsa Hospital, only 100 remain in the hospital that are being treated, the Hamas-run Gaza Ministry of Health said.\nThe Israel Defense Forces said the Hamas rocket fell into an “open area” in Rishon LeTsiyon, south of Tel Aviv.\n-ABC News’ Luis MartinezIDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza.", "location": "Tel Aviv", "classification": "security", "score": 0.8728704925221142, "event_breakdown": "IDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza."}, {"id": "cdc50a85-1c8f-4264-9a3d-b153f44bc44c", "title": "Israel - Gaza live updates : Patients evacuate hospital in central Gaza", "date": "2024-08-27 13:30", "url": "https://www.myiowainfo.com/syndicated-article/?id=1581452", "domain": "myiowainfo.com", "domain_classification": "Unknown", "message": "Brown met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv on Monday.\nAl-Aqsa Hospital still operating despite evacuationsAl-Aqsa Hospital in Deir al Balah is still operating, despite new temporary evacuation orders from Israeli forces to leave the surrounding area near the hospital.\nOut of the 650 patients in Al-Aqsa Hospital, only 100 remain in the hospital that are being treated, the Hamas-run Gaza Ministry of Health said.\nThe Israel Defense Forces said the Hamas rocket fell into an “open area” in Rishon LeTsiyon, south of Tel Aviv.\n-ABC News’ Luis MartinezIDF issues new evacuation order in central GazaThe Israel Defense Forces announced a new evacuation order Sunday for a small strip of land in a humanitarian area of central Gaza.", "location": "Tel Aviv", "classification": "security", "score": 0.8728704925221142, "event_breakdown": "1. Al-Aqsa Hospital still operating despite evacuations -\nAl-Aqsa Hospital in Deir al Balah is still operating, despite temporary evacuation orders from Israeli forces to leave the surrounding area near the hospital.\n2. IDF issues new evacuation order in central Gaza -\nThe Israel Defense Forces announced a new evacuation order for a small strip of land in a humanitarian area of central Gaza."}, {"id": "41825b4b-0981-493b-913d-097086ec0c92", "title": "Israeli strikes across Gaza kill 18 . Settlers kill Palestinians in West Bank . ", "date": "2024-08-27 13:00", "url": "https://www.stltoday.com/news/nation-world/israeli-strikes-across-gaza-kill-18-settlers-kill-palestinians-in-west-bank/article_f4203576-6458-11ef-a5d0-5be9c94f0cc0.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "Another strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nThe Israeli military said Palestinians had thrown rocks at an Israeli vehicle and at Israeli civilians in the area.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 war, territories the Palestinians want for a future state.\nThe territory’s 3 million Palestinians live under Israeli military rule, with the Palestinian Authority exercising limited control over population centers.", "location": "GAZA CITY", "classification": "security", "score": 0.9031102720426109, "event_breakdown": "Israeli air strikes on Gaza City late Monday killed one person and injured two, Palestinian health officials said."}, {"id": "6425a565-bfbe-4b17-9a98-443035d27187", "title": "Israel pre - emptive strike stops worst of Hezbollah retaliation", "date": "2024-08-27 14:15", "url": "https://www.independent.ie/world-news/middle-east/israels-pre-emptive-strike-stops-worst-of-hezbollahs-retaliation/a920412460.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Iranian-backed organisation hit by a ‘crushing blow’Smoke and fire on the Lebanese side of the border with Israel, after Israel carried out pre-emptive strikes.\nPhoto: ReutersIsraeli officials and media reacted with satisfaction yesterday after a long-expected missile attack by the Iranian-backed Hezbollah movement appeared to have been largely thwarted by pre-emptive Israeli strikes in southern Lebanon.\nBoth Hezbollah and Israel seemed content to let Sunday’s attack, in retaliation for the killing of a senior Hezbollah commander in Beirut last month, count as settled for the moment.", "location": "Lebanon", "classification": "security", "score": 0.9458311569402907, "event_breakdown": "Israeli pre-emptive strikes thwart Hezbollah missile attack in Lebanon"}, {"id": "83f36aa5-730f-407f-88fd-dfa67f993d46", "title": "Russian attacks on Ukraine kill five in second day of major strikes , Kyiv says", "date": "2024-08-27 13:00", "url": "https://www.swissinfo.ch/eng/russian-attacks-on-ukraine-kill-five-in-second-day-of-major-strikes,-kyiv-says/87443397", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russian attacks on Ukraine kill five in second day of major strikes, Kyiv saysreuters_tickers2 minutesBy Valentyn Ogirenko and Gleb GaranichKYIV (Reuters) -Russia launched missile and drone attacks targeting scores of Ukrainian regions and killing at least five people, officials said on Tuesday, a day after Moscow’s biggest air attack of the war on its neighbour.\nPresident Volodymyr Zelenskiy said on Tuesday that Kyiv would retaliate against Russia for its attacks.\nThe Ukrainian air force lost track of 10 more drones that have likely come down somewhere on its territory, it said.\nThe Russian defence ministry said its forces had carried out a high-precision weapon strike on Ukraine overnight, the Interfax news agency reported.\nIn the capital Kyiv, the military administration said air defences shot down all incoming targets aimed at the city.", "location": "NULL", "classification": "security", "score": 0.5497253290601157, "event_breakdown": "Ukraine said on Tuesday that Russian missile and drone strikes killed at least five people in the second such major Russian attack in as many days, while Ukraine promised to retaliate."}, {"id": "934724fc-0524-48b3-a06d-bd3ce2f96d14", "title": "Operational mishaps plague worn - out IDF reservists in Gaza", "date": "2024-08-27 12:00", "url": "https://www.ynetnews.com/article/rygkxbojr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "2 View gallery Sergeant Major Yaniv Yitzhak Oren ( Photo: IDF Spokesperson's Unit )From the initial details of the investigation into the event, it emerged that a squad of four terrorists had managed to infiltrate an area under IDF operational control in northern Gaza in broad daylight on Friday.\nDuring the assault, at least one IDF soldier's weapon exploded, likely due to accumulated dirt.\nIDF sources stressed that the severe malfunction did not alter the outcome of the event: one soldier killed and the terrorists neutralized.\nNotably, this incident marked an unusual escalation in the audacity of Hamas terrorists, who reached a permanent IDF outpost in the Netzarim corridor.\nRegarding the Yated firing incident, it was noted: \"During operational activity in the Netzarim corridor area, a soldier fired a Yated-type weapon contrary to the attack direction.", "location": "The main event takes place at a permanent IDF outpost in the Netzarim corridor.", "classification": "security", "score": 0.9521480279266106, "event_breakdown": "New IDF base in Golan targeted\nDuring recent, terrorist-fired attacks on the Golan Heights, Israel's new Golan Base was captured from a Hezbollah terrorists group.\nThe IDF has issued a statement on this matter, stating that it is doing all it can to eliminate the threat and restore safety and order.\nDuring the intense battle, a squad of IDF soldiers was killed and another six were wounded; among them, one in a light-to-moderate injury and all others in a moderate-to-severe one."}, {"id": "78a7841d-4530-4b2b-87fd-42e300c1403d", "title": "Israel - Hamas war latest : Israel launches more strikes on Lebanon , state media and witnesses say", "date": "2024-08-27 14:15", "url": "https://apnews.com/article/israel-hamas-war-latest-26-august-2024-9b67ccdeefdc81ea149fc3f9b56ba552", "domain": "apnews.com", "domain_classification": "International", "message": "After a short-lived calm following a heavy exchange of strikes between Israel and the Lebanese militant group Hezbollah, fighting resumed Monday.\nIn addition to targeting Hezbollah members, Israel has occasionally targeted members of Hamas and other Palestinian armed groups in Lebanon.\nLater Monday afternoon, Hezbollah announced that it had targeted military surveillance equipment in northern Israel with an exploding drone.\nHezbollah leader Hassan Nasrallah claimed drones had hit an Israeli military intelligence site near Tel Aviv.\nPalestinian health officials said five bodies arrived at a nearby hospital.", "location": "BEIRUT", "classification": "security", "score": 0.9792373596746263, "event_breakdown": "Strike on Hezbollah in Lebanon, Explosion in Northern Israel"}, {"id": "f5d6e4a8-25e5-41a2-8696-52be3412e9f3", "title": "Who was Hannibal ? How one brilliant general almost brought Ancient Rome to its knees", "date": "2024-08-27 02:30", "url": "https://theconversation.com/who-was-hannibal-how-one-brilliant-general-almost-brought-ancient-rome-to-its-knees-235009", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "The Carthaginian general’s innovative military strategies in his struggle against Rome give us a glimpse into why his fame endures.\nIn the series of battles with the Romans, Hannibal proved he was capable of undertaking seemingly impossible feats to achieve strategic advantages.\nHannibal forced Rome to rethink its military strategies and adapt in ways that would ultimately shape the future of the Roman Empire.\nHannibal’s downfallDespite his victories against the Romans, Hannibal did not conquer the city of Rome, allowing the Romans to regroup.\nAt the Battle of Zama in modern-day Tunisia (in 202 BCE) Hannibal was defeated by the young Roman general Scipio Africanus.", "location": "Zama", "classification": "security", "score": 0.6320408678314337, "event_breakdown": "202 BCE"}, {"id": "a2cb584b-1647-466f-9635-7d9452bcd28e", "title": "B - 2 Spirit Stealth Bomber Returns to Edwards AFB for Major Upgrade on 35th Anniversary of First Flight", "date": "2024-08-27 14:15", "url": "https://theaviationist.com/2024/08/27/b-2-returns-to-edwards-afb/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Thirty-five years after the B-2 Spirit stealth bomber first took off from the Air Force Plant 42 in Palmdale, California, to fly to Edwards Air Force Base, the iconic aircraft returned to the military facility on the same date on Jul.\nOfficially released photos show the B-2 nicknamed “Spirit of Pennsylvania” (serial number 93-1087) flying over Edwards and landing there.\nUS Air Force B-2 Spirits taxi on runway at Whiteman Air Force Base in Missouri on April 15.\nWhiteman Air Force Base executed a mass fly-off of 12 B-2 Spirits to cap off annual Spirit Vigilance exercise.\nAs the world’s only operational stealth long-range penetrating bomber, the B-2 Spirit has a strategic commitment to the United States for years to come.", "location": "given\nEDWARDS AIR FORCE BASE", "classification": "security", "score": 0.6377844618767207, "event_breakdown": "Target event - A news push that reports an event that is happening in the current time frame and pertains to the category security, and not a past event.\nUS Air Force Aircraft Bombers."}, {"id": "65cbb594-55d8-44c4-97dc-fef0c4a1021f", "title": "Israel conflicts with Hamas and Hezbollah show no sign of easing", "date": "2024-08-27 02:00", "url": "https://www.bostonglobe.com/2024/08/26/world/israels-conflicts-with-hamas-hezbollah-show-no-sign-easing/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But any relief has been tempered by renewed anxiety and uncertainty: Despite the apparent postponement of a bigger regional war, Israel’s grinding conflicts with both Hezbollah in Lebanon and Hamas in the Gaza Strip still have no end in sight.\nWithout a deal in Gaza, Hezbollah has vowed to continue its strikes along the Israel-Lebanon border, where any sudden miscalculation or mistake still risks transforming a relatively restricted fight into a bigger conflict involving Iran, the benefactor of both Hamas and Hezbollah.\nAnd Iran has yet to respond militarily to Israel’s assassination of a Hamas leader last month in Tehran, Iran.\nHezbollah has said it will continue its battle until Israel agrees to a cease-fire with Hamas in Gaza.\nDespite a renewed push by the United States and optimistic comments from Biden administration officials, the Gaza cease-fire talks appear to be at an impasse.", "location": "GAZA", "classification": "security", "score": 0.5726720814136844, "event_breakdown": "1. Israel's border with Lebanon has been the scene of recent clashes between Hezbollah and Israel.\n2. There have been renewed clashes between Israel and Hamas in Gaza, following the assassination of a Hamas leader in Tehran, Iran."}, {"id": "01b707a2-a90f-44cd-8242-d592e9df0e02", "title": "Ammunition Business Report 2023 - 2030 Featuring BAE , Denel", "date": "2024-08-27 11:15", "url": "https://www.globenewswire.com/news-release/2024/08/27/2936079/0/en/Ammunition-Business-Report-2023-2030-Featuring-BAE-Denel-SOC-General-Dynamics-Nammo-Olin-Orbital-ATK-Poongsan-Remington-Arms-RUAG-Ammotec-and-Vista-Outdoor.html", "domain": "globenewswire.com", "domain_classification": "Unknown", "message": "The ammunition market is a dynamic and evolving sector influenced by a myriad of factors, ranging from geopolitical tensions to technological advancements.\nThe development of smart ammunition, which includes precision-guided munitions, has revolutionized modern warfare.\nThe ammunition market is also navigating a complex regulatory landscape.\nThe growth in the ammunition market is driven by several factors, including rising global defense expenditures, technological advancements, and shifting consumer behaviors.\nThese factors, combined with the ongoing need for security and defense, are sustaining the growth trajectory of the ammunition market.", "location": "North America (USA)", "classification": "security", "score": 0.4946892453994536, "event_breakdown": "Target event not found"}, {"id": "90839e66-df95-4128-8b08-b3fae5886179", "title": "Russian advance towards Pokrovsk slowed down after Ukraine Kursk incursion , Zelensky claims", "date": "2024-08-27 14:15", "url": "https://www.yahoo.com/news/russian-advance-towards-pokrovsk-slowed-130959367.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "When asked by a Kyiv Independent reporter about the benefits of the Kursk incursion in regards to Russia's ongoing push toward Pokrovsk, Zelensky claimed that Moscow's advance had slowed down.\nAccording to the crowd-sourced monitoring website DeepState, Russian troops have been advancing towards Pokrovsk throughout the three weeks of the ongoing Kursk operation.\nThe estimated Russian advance in the Pokrovsk sector as of Aug. 6, 2024, when Ukraine launched its Kursk incursion.\n(DeepState/OpenStreet Map)The estimated Russian advance in the Pokrovsk sector as of Aug. 26, 2024.\nRussian troops are not retreating and will continue to push on the embattled eastern sector, Zelensky said.", "location": "POKRovsk", "classification": "security", "score": 0.474742347505667, "event_breakdown": "Russian troops may be advancing in Ukraine, but they are far from being near Pokrovsk. Acording to the crowd-sourced monitorin g website DeepState, the estimated Russian advance in the Pokrovsk sector as of Aug 26, 2024 is well into the Donbass region. Even so, the government in Kyiv is cautioning that Russian troops are still a threat. \"I want to emphasize that the Russian army has not yet retreated from the second line of defense on the Donbass,\" said spokesman Oleg Nikolenko. Ukraine's second line of defense in the region is located in the central and eastern parts of Donetsk and Luhansk regions."}, {"id": "3b2ef768-321e-4e9e-814e-37c786e00837", "title": "Marine dog handler from Omaha who fought at Iwo Jima dies at 106", "date": "2024-08-27 13:30", "url": "https://omaha.com/news/local/marine-dog-handler-from-omaha-who-fought-at-iwo-jima-dies-at-106/article_6860a114-6008-11ef-90f7-3b8142cd229f.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Later Worth became an officer and commanded a team of military dog handlers in the battle of Iwo Jima.\nAfter the war, Worth married and raised two children, and became a civil servant in his native New Jersey.\n“He was a talker, and he didn’t really follow directions,” Barbara Sisson said.\nHe chose an assignment heading the 6th Marine War Dog Patrol at Camp Lejeune, North Carolina.\n“He trained dogs in the military, but he couldn’t train our family dogs,” Barbara said with a laugh.", "location": "Camp Lejeune", "classification": "security", "score": 0.8042465199397351, "event_breakdown": "6th Marine War Dog Patrol at Camp Lejeune, North Carolina"}, {"id": "fa2f1607-30f2-4bae-aef3-ff1a71a902b9", "title": "Families flee after new Israeli evacuation orders in Gaza as ceasefire hopes dim", "date": "2024-08-27 09:45", "url": "https://www.stabroeknews.com/2024/08/27/news/world/families-flee-after-new-israeli-evacuation-orders-in-gaza-as-ceasefire-hopes-dim/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "CAIRO/GAZA (Reuters) – Israel issued new evacuation orders for Deir Al-Balah in the central Gaza Strip late on Sunday, forcing more families to flee, saying its forces intended to act against militant group Hamas and others operating in the area.\nThe Deir Al-Balah municipality says Israeli evacuation orders have so far displaced 250,000 people.\nSeven others were killed in two separate Israeli strikes, five in a car in Khan Younis and two people at a school in Gaza City, medics said.\nLater on Monday, an Israeli strike on a tent on the coast in Gaza City killed six Palestinians and wounded several other people, medics told Reuters.\nThe new orders forced many families and patients to leave Al-Aqsa Hospital, the main medical facility in Deir Al-Balah, where hundreds of thousands of residents and displaced people had taken shelter, for fear of bombardments.", "location": "GAZA", "classification": "security", "score": 0.9409825110356589, "event_breakdown": "Security forces were put on alert as more Gazans evacuated their homes moving to UNRWA schools, which were overcrowded with living conditions worsening. Some streets turned into rivers, telecommunication networks were not coping and rescue services asked the Israelis to pause strikes to evacuate casualties. A powerful Israeli air strike on southern Gaza late Monday night killed more than 25 people, many of them civilians following Israel's decision to target tunnels used by militants to import weapons from Egypt."}]