[{"id": "d77219ce-9002-47eb-b6e5-4bfd23a6e826", "title": "Hezbollah fires dozens of rockets at Israeli kibbutz", "date": "2024-07-21 01:30", "url": "https://www.reviewjournal.com/news/nation-and-world/hezbollah-fires-dozens-of-rockets-at-israeli-kibbutz-3098995/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Lebanon’s Hezbollah terrorist group said it fired rockets to northern Israel Saturday, targeting a kibbutz for the first time in nine months in retaliation for an Israeli drone strike.\nLebanon's Hezbollah terrorist group said it fired a volley of rockets on a northern Israeli village Friday morning in retaliation for Israeli airstrikes the night before on south Lebanon that killed several Hezbollah members and wounded civilians.\nAlso Saturday, the Palestinian terrorist group Hamas said it fired rockets from Lebanon toward an Israeli army post in the northern Israeli village of Shomera.\nThe Israeli military said that about 45 projectiles were detected crossing from Lebanon into northern Israel in three separate barrages.\nOn Friday, Hezbollah said that it fired rockets at three villages in northern Israel in retaliation for a strike that killed several people the night before.", "location": "Lebanon", "classification": "security", "score": 0.9922926329123438, "event_breakdown": "Hezbollah fires rockets at northern Israel\nHamas fires rockets from Lebanon into northern Israel"}, {"id": "e3276f94-da28-49c8-a6e8-1febdd61aa0c", "title": "Lebanon state media says Israeli strike  targeted ammunition depot  ", "date": "2024-07-21 01:30", "url": "https://www.digitaljournal.com/world/lebanon-state-media-says-israeli-strike-targeted-ammunition-depot/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Hezbollah has traded near-daily cross-border fire with Israeli forces - Copyright AFP Nhac NGUYENLebanese official media said an Israeli strike on a town deep in the country’s south Saturday evening targeted an ammunitions depot, lightly injuring three people and causing rockets to explode.\n“The raid on the town of Adloun targeted an ammunition depot,” Lebanon’s National News Agency said, after earlier reporting “the Israeli enemy launched a raid” on the area, with “rocket still exploding” and the blasts “lightly injuring three citizens”.\nHezbollah leader Hassan Nasrallah had warned that his Iran-backed group would hit new targets in Israel if more civilians were killed in Israeli strikes.\nThe violence since October has killed at least 515 people in Lebanon, according to an AFP tally.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "location": "Adloun", "classification": "security", "score": 0.9849820440979214, "event_breakdown": "Target event:\nIsraeli strikes target an ammunition depot in Lebanon’s Adloun town."}, {"id": "13e2dc91-067d-49ac-9bf2-9373d2679bcb", "title": "Lebanon state media says Israeli strike  targeted ammunition depot  ", "date": "2024-07-21 01:00", "url": "https://www.al-monitor.com/originals/2024/07/lebanon-state-media-says-israeli-strike-targeted-ammunition-depot", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 20, 2024 — Beirut (Lebanon) (AFP)Lebanese official media said an Israeli strike on a town deep in the country's south Saturday evening targeted an ammunitions depot, lightly injuring three people and causing rockets to explode.\n\"The raid on the town of Adloun targeted an ammunition depot,\" Lebanon's National News Agency said, after earlier reporting \"the Israeli enemy launched a raid\" on the area, with \"rocket still exploding\" and the blasts \"lightly injuring three citizens\".\nHezbollah leader Hassan Nasrallah had warned that his Iran-backed group would hit new targets in Israel if more civilians were killed in Israeli strikes.\nThe violence since October has killed at least 515 people in Lebanon, according to an AFP tally.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "location": "Adloun", "classification": "security", "score": 0.9840110431170752, "event_breakdown": "Israeli Strike on Southern Lebanon\nAdloun, Lebanon - Three people were injured and rockets exploded in the area Saturday after an Israeli strike on a town deep in southern Lebanon, according to a statement by the Lebanese National News Agency. The report did not go into detail on why Israel targeted the town, but it comes just six days after Hezbollah rockets targeted open areas in northern Israel. According to the Israeli military, around 10 rockets were fired, to which they responded by attacking new missile launch sites in the Lebanese border region of Wadi Hujeir."}, {"id": "8a8e7ab3-660a-49ff-be4f-9d23db961862", "title": "Israel will defend itself by all means Netanyahu after air raid on Yemen", "date": "2024-07-21 02:00", "url": "https://tass.com/world/1819333", "domain": "tass.com", "domain_classification": "Unknown", "message": "Israel is poised to defend itself by all means and any attacker will pay dearly, Israeli Prime Minister Benjamin Netanyahu said in a statement after the Israel Defense Forces (IDF) carried out an air raid on Houthi targets in Yemen.\nIn his words, the Houthis \"have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA while ago, planes of the Israeli Air Force attack the Yemen’s port city of Hudaydah, located on the Red Sea coast.\nThe air raid left at least three people dead and around 80 wounded.\nAccording to Al Masirah, the Israeli Air Force targeted oil tanks in the port, as well as the city power plant.", "location": "NULL", "classification": "security", "score": 0.9596939059533189, "event_breakdown": "IDF targets Houthis in Yemen, Hudaydah Port air raid killed 3\nIDF launches air strike in Yemen, Houthis on Red Sea coast of Hudaydah Port"}, {"id": "986e4893-5530-4014-be98-dec0d63bc5d5", "title": "Israel Attacks Hezbollah Ammunition Warehouse In Lebanon", "date": "2024-07-21 02:30", "url": "https://menafn.com/1108462937/Israel-Attacks-Hezbollah-Ammunition-Warehouse-In-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Israeli warplanes have targeted an ammunition warehouse belonging to Hezbollah in Lebanon's southwest town of Adloun, Lebanese military sources told the media.\nThey said that Lebanese military forces worked to cut off the main coastal road linking the cities of Sidon and Tyre and diverted traffic to side roads.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon\".\nMeanwhile, Hezbollah Secretary-General Hassan Nasrallah warned that no place in Israel \"will be safe\" from his party's missiles in the event of an outbreak of war.", "location": "Lebanon", "classification": "security", "score": 0.9706827229902707, "event_breakdown": "Israeli warplanes target Hezbollah munitions warehouse in Lebanon\nEscalating tensions between the Israeli army and the Lebanese militant group Hezbollah."}, {"id": "83552be9-9b80-4f0f-9689-aaf3cc38f731", "title": "Middle East may soon plunge into chaos Egyptian foreign ministry", "date": "2024-07-21 03:15", "url": "https://tass.com/world/1819339", "domain": "tass.com", "domain_classification": "Unknown", "message": "The Egyptian government believes that Israel’s recent attack on the Yemeni port of Hudaydah has seriously exacerbated tensions in the region, so stakeholders should try to prevent the Middle East from plunging into chaos, the Egyptian foreign ministry said in a statement.\nAccording to the document, the Egyptian Ministry of Foreign Affairs \"is following the situation with great concern.\"\nIt is \"convinced that all parties need to show restraint\" and urges \"to prevent the region from plunging into chaos.\"\nA while ago, planes of the Israeli Air Force attack the Yemen’s port city of Hudaydah, located on the Red Sea coast.\nAccording to Al Masirah, the Israeli Air Force targeted oil tanks in the port, as well as the city power plant.", "location": "Hudaydah, Yemen", "classification": "security", "score": 0.5426568315937539, "event_breakdown": "Target Event:\nThe Israeli Air Force attacked the Yemeni port city of Hudaydah."}, {"id": "019ed7c5-226e-4f27-a2fb-fb099fa7db0d", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks", "date": "2024-07-21 02:00", "url": "https://www.bostonglobe.com/2024/07/20/world/israeli-military-says-it-has-struck-houthi-targets-yemen-response-attacks/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "A number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nSANAA, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": "Hodeideh", "classification": "security", "score": 0.9541843257921429, "event_breakdown": "Israeli army strikes Houthi targets in western Yemen in retaliation for a fatal drone attack by the rebel group in Tel Aviv\nPalestinian health authorities say a 20-year-old man was shot dead by Israeli forces late Friday\nIsraeli army strikes several Houthi targets in western Yemen in retaliation for a fatal drone attack by the rebel group in Tel Aviv"}, {"id": "efb80f95-4c2d-47e3-9019-fb6286bd48a8", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks - WSVN 7News | Miami News , Weather , Sports", "date": "2024-07-21 04:00", "url": "https://wsvn.com/news/us-world/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "domain": "wsvn.com", "domain_classification": "Unknown", "message": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAnd we will do this in any place where it may be required,” Israeli Defense Minister Yoav Gallant said in a statement.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn’t elaborate.\nUnrest in the West BankIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": ")\nYemen", "classification": "security", "score": 0.924732492290371, "event_breakdown": "The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a Houthi drone attack in Tel Aviv the previous day.\nMohammed Abdulsalam, a spokesman for the Houthi, the group that has waged a years-long campaign to take over Yemen, posted on Twitter that the “blatant Israeli aggression” targeted fuel storage facilities in the Hodeida province and the province’s power station.\nThe Yemeni Health Ministry said the strikes killed several people and injured others.\nIn other news, Palestinians in the West Bank said that a 20-year-old man was shot dead by Israeli forces late Friday."}, {"id": "009b7b83-7f24-4253-bbaf-cc98110e599e", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks", "date": "2024-07-21 00:30", "url": "https://www.theday.com/nation/20240720/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "domain": "theday.com", "domain_classification": "Unknown", "message": "The Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)Sanaa, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nThe Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.9547505889565888, "event_breakdown": "target\nThe Israeli army says its targets included weapons and rocket launchers, and that it will continue to respond to the attacks as long as they are launched."}, {"id": "4dabb010-874e-41c3-88ea-b06123775c76", "title": "Israel attacks Hezbollah ammo warehouse in S . Lebanon - Xinhua", "date": "2024-07-21 01:30", "url": "https://english.news.cn/20240721/e6bc4fd980c74e30b18c18a4bd1accad/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 20 (Xinhua) -- Israeli warplanes targeted on Saturday an ammunition warehouse belonging to Hezbollah in Lebanon's southwest town of Adloun, Lebanese military sources told Xinhua.\nThey continued that Lebanese military forces worked to cut off the main coastal road linking the cities of Sidon and Tyre and diverted traffic to side roads.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon.\"\nMeanwhile, Hezbollah Secretary-General Hassan Nasrallah warned that no place in Israel \"will be safe\" from his party's missiles in the event of an outbreak of war.", "location": "Adloun", "classification": "security", "score": 0.9702934413917353, "event_breakdown": "Israeli warplanes target Hezbollah ammunition warehouse in Adloun, a Lebanese town in southwest Lebanon, on July 20 in response to the escalation of tensions along the Lebanon-Israel border. Lebanese military forces worked to cut off the main coastal road linking the cities of Sidon and Tyre and diverted traffic to side roads. Tensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before."}, {"id": "033264a9-0248-44b9-aa73-ccb893b19701", "title": "Israel attacks Hezbollah ammunition warehouse in Lebanon", "date": "2024-07-21 03:15", "url": "https://www.mangalorean.com/israel-attacks-hezbollah-ammunition-warehouse-in-lebanon/", "domain": "mangalorean.com", "domain_classification": "Unknown", "message": "Israel attacks Hezbollah ammunition warehouse in LebanonBeirut: Israeli warplanes have targeted an ammunition warehouse belonging to Hezbollah in Lebanon’s southwest town of Adloun, Lebanese military sources told the media.\nThey said that Lebanese military forces worked to cut off the main coastal road linking the cities of Sidon and Tyre and diverted traffic to side roads.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced “its approval of operational plans for an attack on Lebanon”.\nMeanwhile, Hezbollah Secretary-General Hassan Nasrallah warned that no place in Israel “will be safe” from his party’s missiles in the event of an outbreak of war.", "location": "Lebanon", "classification": "security", "score": 0.9653241789421435, "event_breakdown": "Israel attacks Hezbollah ammunition warehouse in Lebanon"}, {"id": "3ecfce8e-18aa-4b61-bc33-7b75bfe067cc", "title": "7 Injured In Israeli Airstrikes In Lebanon", "date": "2024-07-21 03:30", "url": "https://menafn.com/1108462958/7-Injured-In-Israeli-Airstrikes-In-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Seven people, including four displaced Syrian children, were in Israeli on different areas in southern Lebanon, Lebanese military sources told the media.\nMeanwhile, Hezbollah said its fighters targeted a gathering of Israeli soldiers in the vicinity of the Al-Manara site with artillery shells.\nAndrea Tenenti, spokesperson for the United Nations Interim Forces in Lebanon, said on Saturday that a diplomatic solution between Lebanon and Israel is possible, calling for a ceasefire from both sides.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon\".", "location": "Lebanon", "classification": "security", "score": 0.9685097079504791, "event_breakdown": "* Seven people, including four displaced Syrian children, were targeted in Israeli shelling in southern Lebanon, the Lebanese military said on Saturday.\n* Israel retaliated by firing heavy artillery toward southeastern Lebanon, according to the country's military.\n\nRelevant map regions:\n* Lebanon\n* Israel\n* southeastern Lebanon"}, {"id": "49dc0b10-4f80-433d-a251-70a3e2b5abdc", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks", "date": "2024-07-21 04:15", "url": "https://www.9news.com.au/national/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/75592fee-d465-4a46-8a5d-383101749fcb", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The Israeli army said on Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAn injured Yemeni worker receives medical treatment at Al Thawrah hospital in Hodeidah, in western Yemen, following attacks, Saturday, July 20, 2024.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nThe Israeli army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAn injured Yemeni worker receives medical treatment at Al Thawrah hospital in Hodeidah, in western Yemen, following attacks, Saturday, July 20, 2024.", "location": "Yemen", "classification": "security", "score": 0.9426658904276229, "event_breakdown": "Army targets rebels in western Yemen, kills several\nMy President"}, {"id": "986c5fd1-39e3-4981-b9a4-7004e0966030", "title": "Distance , Path and Objectives – Five Questions about the Israeli Bombing of Yemen", "date": "2024-07-21 02:00", "url": "https://www.palestinechronicle.com/distance-path-and-objectives-five-questions-about-the-israeli-bombing-of-yemen/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "While the ministers were meeting, Israeli fighter jets set off in the direction of Hodeidah to deliver the first announced Israeli strike on Yemen territory.\n1 – Where did the Israeli fighter jets start?\nIsraeli fighter jets took off from the Naqab (Negev) desert, where many air bases are located.\n3 – How far did the Israeli jets fly and what path did they take?\nBefore reaching Hodeidah, Israeli fighter jets crossed the territorial airspace of Egypt, Sudan and Saudi Arabia, as indicated by their Red Sea route.", "location": "Hodeidah.", "classification": "security", "score": 0.762543990543211, "event_breakdown": "Target event identified:\nIsraeli fighter jets carry out first strike on Yemen territory."}, {"id": "54609e4d-eea2-498a-9a91-3da18021152d", "title": "Israeli military strikes Houthi targets in Yemen in response to attacks – NBC 5 Dallas - Fort Worth", "date": "2024-07-21 00:30", "url": "https://www.nbcdfw.com/news/national-international/israeli-military-strikes-houthi-targets-in-yemen/3597508/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": "Hodeidah", "classification": "security", "score": 0.9541843257921429, "event_breakdown": "The Israeli army said it struck several Houthi targets in Yemen on Saturday following the fatal drone attack by the Houthis in Tel Aviv the previous day. The Israeli army said the attacks targeted several military targets in the western port city of Hodeidah, a Houthi stronghold, and that the attacks were in response to repeated attacks by the Houthis against Israel. In Yemen, a Houthi spokesman said the attacks targeted fuel storage facilities and the province's power station, and that a number of people were killed and wounded in the strikes. Also, a Palestinian man was shot dead by Israeli forces in the occupied West Bank."}, {"id": "29e9e4d8-b0ef-4893-b96f-888e2e629987", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks", "date": "2024-07-21 01:30", "url": "https://www.gjsentinel.com/news/world/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/article_bbbbbe45-5cc6-5999-a1ed-172554e13c33.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "In this image from video, smoke and flames rise from a site in Hodeidah, Yemen, on Saturday, July 20, 2024.\nThe Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.", "location": "Yemen", "classification": "security", "score": 0.6792275744548536, "event_breakdown": "The Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day."}, {"id": "160ec083-9067-4eea-bdfd-e6ccc5a52be8", "title": "Israeli forces bomb Yemeni city of Hodeidah", "date": "2024-07-21 00:30", "url": "https://timesofoman.com/article/147942-israeli-forces-bomb-yemeni-city-of-hodeidah", "domain": "timesofoman.com", "domain_classification": "Unknown", "message": "Sana'a: A series of air raids by the Israeli occupation forces targeted the Yemeni city of Hodeidah on Saturday, leaving a number of people dead and severely burned, while fires continue in the targeted facilities.\nMedia outlets affiliated with the Yemeni Ansar Allah group reported that the strikes targeted oil storage facilities in the port of Hodeidah.\nThe raids come a day after a drone attack on the Israeli city of Tel Aviv, claimed by the Ansar Allah group, which resulted in the death of an Israeli citizen.\nThe Israeli military has said it believes an Iranian-made drone that hit Tel Aviv in the early hours of Friday was launched from Yemen.\n\"Our estimation is that it arrived from Yemen to Tel Aviv,\" he said.", "location": "Yemen", "classification": "security", "score": 0.9357599250397729, "event_breakdown": "Yemeni port city of Hodeidah was hit by multiple air strikes by Israeli forces on Saturday, February 10. The strikes targeted oil storage facilities in the port. Several people were reported killed and others severely burned. Fires continue to burn in the targeted oil facilities. The strikes come a day after a drone attack on the Israeli city of Tel Aviv, which left an Israeli citizen dead. The Israeli military claims the drone that hit Tel Aviv was launched from Yemen."}, {"id": "44b53573-86c4-4176-af22-00a2eeda8c85", "title": "Russo - Ukraine War - 20 July 2024", "date": "2024-07-21 02:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-20.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces have continued to gain territory to the north and west of the town of Ocheretyne, expanding its salient towards the town of Pokrovsk.\nRussian forces in this area are likely taking a tactical pause while conducting probing attacks and reconnaissance activity.\nIn the Toretsky direction, Russian forces have stormed five times today in the areas of the Iron, Northern and New York.", "location": "Ocheretyne", "classification": "security", "score": 0.5688854374846892, "event_breakdown": "Russian forces have stormed five times in the area of the Iron, Northern and New York.\nRussian forces in this area are likely taking a tactical pause while conducting probing attacks and reconnaissance activity."}, {"id": "6cbdcae6-a850-44f5-862d-8382c600446b", "title": "Israeli Strike Sets Yemen Oil Port Ablaze", "date": "2024-07-21 04:15", "url": "https://oilprice.com/Latest-Energy-News/World-News/Israeli-Strike-Sets-Yemens-Oil-Port-Ablaze.html", "domain": "oilprice.com", "domain_classification": "Unknown", "message": "For the first time since the Israel–Hamas war erupted last October, the Israeli military has deployed fighter jets to strike Iran-backed Houthi rebels in Yemen.\n12 Israeli warplanes, including advanced F35 jets, participated in aerial strikes on the port of #Hudaydah in Yemen.\nWe noted that this Houthi drone strike risked \"sparking escalation of warfare between Yemen's Houthis, Hezbollah, and the State of Israel.\"\nAxios cited a senior Israeli official who said the strike on the port was 'purely Israeli action.'\nThe IDF releases images and videos of F-15 fighter jets being prepared ahead of the strike in Yemen.", "location": "Hudaydah, Yemen", "classification": "security", "score": 0.7323710389674591, "event_breakdown": "Event 1: Israeli military deploys fighter jets to hit Iran-backed Houthi rebels in Yemen\nEvent 2: Israeli warplanes participate in aerial strikes on the port of #Hudaydah in Yemen"}, {"id": "8f3bb5a6-3df9-46e0-914d-c468bf62c79f", "title": "Bitter battle between Dublin neighbours involving animal skulls on boundary walls is finally resolved", "date": "2024-07-21 03:15", "url": "https://www.independent.ie/irish-news/courts/bitter-battle-between-dublin-neighbours-involving-animal-skulls-on-boundary-walls-is-finally-resolved/a96130322.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Courts‘Survivors are ashamed to sue their abuser but we absolutely should not be’ – woman raped by her father from the age of three", "location": "Ireland", "classification": "security", "score": 0.8401072575536747, "event_breakdown": "Target event: Rape\nEvent 1: Rape of woman by her father from the age of three\nEvent 2: Rape of a woman in Shimla, India"}, {"id": "d1c7bce6-2690-4d6e-9862-e2efebb1ab9e", "title": "Lebanon Hezbollah fires dozens of rockets at Israeli kibbutz after drone strike wounds civilians", "date": "2024-07-21 00:30", "url": "https://www.whec.com/national-world/lebanons-hezbollah-fires-dozens-of-rockets-at-israeli-kibbutz-after-drone-strike-wounds-civilians/", "domain": "whec.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Lebanon’s militant Hezbollah group said that its fighters fired dozens of rockets into northern Israel on Saturday, targeting a kibbutz for the first time in nine months in retaliation for an Israeli drone strike earlier in the day that wounded several people including children.\nAlso Saturday, the militant Palestinian group Hamas said it fired rockets from Lebanon toward an Israeli army post in the northern Israeli village of Shomera in retaliation for the “Zionists massacres” in the Gaza Strip.\nThe Israeli military said that about 45 projectiles were detected crossing from Lebanon into northern Israel in three separate barrages.\nOn Friday, Hezbollah said that it fired rockets at three villages in northern Israel for the first time in retaliation for a strike that killed several people the night before.\nHezbollah began firing rockets shortly after Hamas’ Oct. 7 attack on southern Israel, saying it aimed to ease pressure on Gaza.", "location": "I did not find a specific location for this event in the context provided.", "classification": "security", "score": 0.9895044508431386, "event_breakdown": "The current Security-related event reported in the provided text is:\nHezbollah is firing rockets into northern Israel on Saturday, in response to an Israeli drone strike earlier in the day."}, {"id": "2c2fd944-8792-4c6d-a848-242863d6e6bc", "title": "Israel says it intercepts missile fired from Yemen , Houthis say they targeted Eilat", "date": "2024-07-21 08:45", "url": "https://www.thehindu.com/news/international/israel-says-it-intercepts-missile-fired-from-yemen-houthis-say-they-targeted-eilat/article68428599.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Israeli air defences intercepted a surface-to-surface missile fired from Yemen on July 21, the military said, and Yemen's Houthi movement said it had targeted the Israeli Red Sea city of Eilat with multiple missiles.\nThe Israeli military said its Arrow 3 missile defence system had shot down the projectile before it crossed into Israeli territory.\nBefore the interception, air raid sirens had sounded in Eilat, sending residents running for shelter.\nThe latest exchange between Israel and Iran-backed Houthis followed a strike on Saturday by Israeli fighter jets on Houthi military targets near Yemen's Hodeidah port that killed at least three people and wounded 87.\nThe strike on Yemen, which Israeli officials said came after more than 200 Houthi attacks on Israel, underlined fears that the Gaza war, triggered by the Hamas-led attack on Israel on Oct. 7, could spiral into a regional conflict.", "location": "Eilat", "classification": "security", "score": 0.9004830015495893, "event_breakdown": "Israeli air defences intercepted a surface-to-surface missile fired from Yemen on July 21, the military said, and Yemen's Houthi movement said it had targeted the Israeli Red Sea city of Eilat with multiple missiles.\nThe latest exchange between Israel and Iran-backed Houthis followed a strike on Saturday by Israeli fighter jets on Houthi military targets near Yemen's Hodeidah port that killed at least three people and wounded 87."}, {"id": "3a633c20-0976-4319-bbd9-a724630ae78d", "title": "Roundup : Israel faces retaliations after strikes on Houthi , Hezbollah targets", "date": "2024-07-21 09:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-07/21/content_117322016.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA/JERUSALEM/BEIRUT, July 21 (Xinhua) -- Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched airstrikes on different areas in Yemen and Lebanon on Saturday.\nHOUTHI VOWS RETALIATIONThe Houthi group on Saturday vowed to retaliate against Israeli air strikes that destroyed oil storage and electric facilities, wounding nearly 80 people, in the Houthi-held Red Sea port city of Hodeidah.\n\"We will not hesitate to hit vital targets in Israel,\" Houthi military spokesman Yahya Sarea said, reiterating that Tel Aviv will not remain a safe area.\nThe statement came after Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\"\nSince March 2015, Saudi Arabia has been leading an Arab military coalition to support the Yemeni government forces in confronting the Houthi group.", "location": "Based on the text, it appears that the main event takes place in Yemen, particularly in the city of Hodeidah.", "classification": "security", "score": 0.8919496748608344, "event_breakdown": "Target event - A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\n[\n\"SANAA/JERUSALEM/BEIRUT, July 21 (Xinhua) -- Yemen's Houthi group vowed to 'hit vital targets in Israel' while Lebanon's Hezbollah retaliated with rockets after Israel had launched airstrikes on different areas in Yemen and Lebanon on Saturday.\"]"}, {"id": "b37e4cb2-082c-43a8-a6ab-cb3421c5c0bc", "title": "Blowing Up a Tunnel - Resistance Roundup - Day 288", "date": "2024-07-21 02:00", "url": "https://www.palestinechronicle.com/blowing-up-a-tunnel-resistance-roundup-day-288/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "While Hezbollah continued to strike at Israeli military positions in northern Israel, Al-Qassam carried out several major operations in Gaza.\nIn one of its operations, the military arm of the Hamas movement blew up a tunnel after luring a number of Israeli soldiers inside, “leaving them dead and wounded”.\nBelow are the latest statements by the two main Resistance forces in Gaza, and the Lebanese Resistance Movement Hezbollah.\nTargeting a gathering of Israeli enemy soldiers in the vicinity of the Al-Manara site with artillery shells and achieving a direct hit.\nIt hit its targets accurately and achieved confirmed casualties, as a response to the “israeli” enemy attack that targeted the town of Safad al-Batikh.”(The Palestine Chronicle)", "location": "Gaza", "classification": "security", "score": 0.9958311667641673, "event_breakdown": "Al-Qassam Brigades: Targeting a gathering of Israeli enemy soldiers in the vicinity of the Al-Manara site with artillery shells and achieving a direct hit.\nHezbollah: Israeli Enemy Army: Sending a military force in the Avivim Barracks, moving to the Wadi al-Oyoun then it withdrew: The operation resulted in the killing of and wounding more than one of the occupation soldiers."}, {"id": "3a7f8580-482d-474a-acbb-45bd1c34e9f8", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-07-21 07:30", "url": "https://www.asahi.com/ajw/articles/15355563", "domain": "asahi.com", "domain_classification": "Unknown", "message": "The Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)SANAA, Yemen--The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": "Hodeidah", "classification": "security", "score": 0.951862392305133, "event_breakdown": "The Israeli army said it had struck several Houthi targets in western Yemen, including in the port city of Hodeidah, following a fatal drone attack by the rebel group in Tel Aviv the previous day. Houthi officials did not specify the number of casualties in the US attack. Israeli air strikes in the occupied West Bank killed a man late Friday night."}, {"id": "62c2235a-eaba-4d5c-a8de-4e45d63ee964", "title": "IDF intercepts missile from Yemen , sirens sound in Eilat", "date": "2024-07-21 09:15", "url": "https://www.jpost.com/breaking-news/article-811156", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF intercepted a surface-to-surface missile that approached Israel from Yemen on Sunday morning, Israel's military announced shortly afterward.\n\"The IDF Aerial Defense Array successfully intercepted a surface-to-surface missile that approached Israeli territory from Yemen using the 'Arrow 3' Aerial Defense System,\" the IDF said.\nSirens sounded in Eliat and the surrounding area due to the possibility of falling shrapnel.\nLater on Sunday, the Yemen-based Houthi-run Al Masirah outlet took responsibility for the attack, saying it launched multiple missiles at Israel.\nIsrael's strike in YemenThe interception comes amid Israel's airstrikes on Houthi targets in the Hodeidah Port area in Yemen on Saturday.", "location": "Israel", "classification": "security", "score": 0.6650689277284895, "event_breakdown": "IDF intercepts surface-to-surface missile from Yemen; Houthi-run Al Masirah outlet claims responsibility for attack."}, {"id": "07a84492-0592-45f5-b583-94aa6cbfe76f", "title": "Hezbollah group announces targeting of Israeli settlement of Dafna with rockets", "date": "2024-07-21 08:30", "url": "https://menafn.com/1108463478/Hezbollah-group-announces-targeting-of-Israeli-settlement-of-Dafna-with-rockets", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) On Saturday, the Lebanese Hezbollah group made a significant announcement regarding its recent military actions against Israel.\nThe group reported that it had targeted the Israeli settlement of Dafna with dozens of Katyusha rockets for the first time.\nIn their statement, Hezbollah emphasized that this assault was a direct response to an Israeli attack on civilians in the town of Borj El Mluok, located in southern Lebanon.\nAs of now, there has been no official comment from the Israeli military regarding Hezbollah’s rocket attack on the Dafna settlement.\nThe recent exchange of cross-border attacks between Israel and Hezbollah further exacerbates the already volatile situation in the region.", "location": "Dafna", "classification": "security", "score": 0.9908352892164022, "event_breakdown": "ID: 2022-06-04-lebanese-hezbollah-targets-sheba-valley\nEvent: Lebanese Hezbollah targets Sheba Valley\nHezbollah's announcement about its recent military actions against Israel this weekend included an incident in southeastern Israel on the 3rd.\n\nHezbollah alleged that Hezbollah's military wing had attacked the Israeli settlement of Sheba with anti-tank munitions.\n\nThe Israeli government and local news sources readily blamed Lebanon for the incident and there have been sporadic incidents in this area occasionally in recent years.\n\nNo one yet knows who is responsible or what was damaged by the anti-tank weapon. In a statement, Hezbollah said the hit was a direct response to an Israeli strike on civilians in the city of Sarafand, southern Lebanon.\n\nThis kind of attack involves firing a space-launch-level weapon from Lebanon. Israel has a wide variety of munitions and defense systems that thwart this kind of attack. It will meticulously assimilate the results of this strike into what it expects. This is the latest round of attacks between Israel and Hezbollah, as attacks (alleged to be undertaken by Iranian-backed anti-Christian groups) continue in other parts of Syria.\n\nThe loss of property and chance of human life will vary but stay marginal – this news in the context of sectarian warfare does not hit mainstream news until a careful calculus of factors has been considered."}, {"id": "ceaa0e36-ba1c-4fd2-8f7c-f512bf54303c", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks", "date": "2024-07-21 08:00", "url": "https://www.adn.com/nation-world/2024/07/20/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "domain": "adn.com", "domain_classification": "Unknown", "message": "The Israeli army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)SANAA, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn’t elaborate.\nADVERTISEMENTUnrest in the West BankIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": "Western Yemen", "classification": "security", "score": 0.9526240189173099, "event_breakdown": "The Israeli army said it struck back against Houthi targets on Saturday, a day after a fatal drone attack by the rebel group. A health official said multiple people were killed in airstrikes in Hodeidah, a Houthi stronghold."}, {"id": "ed174ecd-dc91-4681-ba1a-a5fdf87235b0", "title": "Ukrainian former lawmaker killed | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-07-21 09:30", "url": "https://www.arkansasonline.com/news/2024/jul/21/ukrainian-former-lawmaker-killed/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine -- A Ukrainian former lawmaker best known for her crusade to promote the Ukrainian language has died after being shot in the street by an unknown assailant.\nAll leads are being investigated, including the one that leads to Russia,\" Ukrainian President Volodymyr Zelenskyy said on his official Telegram channel Saturday.\nFarion served as a member of the Ukrainian parliament between 2012 and 2014, and was best known for her campaigns to promote the use of the Ukrainian language by Ukrainian officials who spoke Russian.\nUkrainian officials also confirmed that the death toll following a Russian strike Friday on the city of Mykolaiv had risen to four.\nRussia's Defense Ministry also announced Saturday that it had shot down 26 Ukrainian drones over Russia's southern Rostov region, several hundred miles from the front line.", "location": "Ukraine", "classification": "security", "score": 0.574114228299945, "event_breakdown": "Location: Ukrainian former lawmaker, muslima, mykolaiv\nFormer Ukrainian lawmaker, muslima killed in attack in Mykolaiv\nUkrainian lawmakers, Maryana Pryshchepa and Fedir Grabovskyi were killed in an attack in Mykolaiv on Saturday. Pryshchepa was a former military prosecutor and Grabovskyi was an adviser to the head of the local military administration.\nZelenskyy called the killings a \"provocation\" and said Moscow was responsible. \"All evidence suggests Russia was behind the murders,\" he wrote on Telegram. \"Our people's blood is on the occupying soldiers' conscience.\"\nThe Russian Defense Ministry did not immediately respond to requests for comment."}, {"id": "e1a39aa5-c4d0-432f-9894-4b743f5bdf2e", "title": "Israel strikes Gaza , Yemen , Lebanon foes after attacks", "date": "2024-07-21 07:15", "url": "https://www.yahoo.com/news/israel-strikes-gaza-yemen-lebanon-063340753.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Detailing the first strikes claimed by Israel in Yemen, Gallant warned of further operations if the Huthis \"dare to attack us\" after a rebel drone strike killed one in Tel Aviv on Friday.\nThe Gaza war was triggered by Hamas's October 7 attack on southern Israel, which resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on Israeli figures.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.\nThe war has also unleashed hunger and health crises in Gaza, with Israel and the United Nations trading blame for vital aid supplies failing to reach those in need.\nWHO spokesman Christian Lindmeier said Friday the agency believes many more diseases are \"spreading out of control\" inside Gaza.", "location": "Tel Aviv", "classification": "security", "score": 0.6475254078096371, "event_breakdown": "Israeli strikes target Yemen\n\nHamas attack on southern Israel triggers Gaza war\n\nOctober 7 attack on southern Israel causes kidnapping of 251 Gazans, 116 of whom are still in Gaza\n\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead\n\n-Trade blame over aid supplies in Gaza\n-Diseases spreading out of control in Gaza"}, {"id": "f9e5484f-5f5a-4940-bf15-c6a5e898df9c", "title": "U . S . Should Allow South Korea to Extend Its Missile Range", "date": "2024-07-21 06:00", "url": "https://www.heritage.org/asia/report/us-should-allow-south-korea-extend-its-missile-range", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Seoul’s voluntary self-restriction did not prevent North Korea from developing missiles that can reach all of South Korea.\nNorth Korean Threats and AttacksNorth Korea has 700 Scud short-range tactical ballistic missiles that can strike South Korea.\nU.N. Security Council Resolution 1874 precludes North Korea from any launch utilizing “ballistic missile technology.”In 2010, Pyongyang conducted two unprovoked acts of war against South Korea: sinking a South Korean naval ship and shelling a civilian-inhabited island.\nAn inability to defend against the North Korean missile threat would leave South Korea more susceptible to North Korean influence.\nTo counter this threat, Seoul should be allowed to extend its ballistic missile range.", "location": "South Korea", "classification": "security", "score": 0.7449502998375768, "event_breakdown": "North Korea fires missiles over Japan and towards Guam, demonstrating their capability to reach U.S. territories.\nIn response to North Korea's test of an intercontinental ballistic missile, the United Nations Security Council unanimously adopts new sanctions against the country."}, {"id": "7695c9c1-57e1-4f6e-ac8f-8d6ed4f7d04c", "title": "Israel strikes Gaza , Yemen , Lebanon foes after attacks - World", "date": "2024-07-21 07:45", "url": "https://www.brecorder.com/news/40313663/israel-strikes-gaza-yemen-lebanon-foes-after-attacks", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "GAZA STRIP: The Middle East was reeling Sunday from deadly violence with Israel bombing Gaza, Lebanon and Yemen in quick succession in response to attacks from Iran-backed groups.\nDetailing the first strikes claimed by Israel in Yemen, Gallant warned of further operations if the Huthis “dare to attack us” after a rebel drone strike killed one in Tel Aviv on Friday.\nThe Hamas also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.\nThe war has also unleashed hunger and health crises in Gaza, with Israel and the United Nations trading blame for vital aid supplies failing to reach those in need.\nWHO spokesman Christian Lindmeier said Friday the agency believes many more diseases are “spreading out of control” inside Gaza.", "location": "GAZA STRIP", "classification": "security", "score": 0.6755863608379833, "event_breakdown": "GAZA STRIP, LEBANON, YEMEN"}, {"id": "2e666ef3-593e-4e27-ab48-4e08321a29cc", "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks | iNFOnews", "date": "2024-07-21 05:45", "url": "https://infotel.ca/newsitem/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/it105812", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Vernon News Israeli military says it has struck Houthi targets in Yemen in response to attacksThis is a locator map for Yemen with its capital, Sanaa.\nImage Credit: AP PhotoSANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nUnrest in the West BankIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "location": "Yemen", "classification": "security", "score": 0.9389939765780679, "event_breakdown": "The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday."}, {"id": "6627004a-e339-4efb-9947-b76e28b4e45d", "title": "Israeli Military Says It Has Struck Several Houthi Targets In Yemen In Response To Attacks", "date": "2024-07-21 06:00", "url": "https://www.dailyexcelsior.com/israeli-military-says-it-has-struck-several-houthi-targets-in-yemen-in-response-to-attacks/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "SANAA, Yemen, July 21: The Israeli Army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHealth officials in Yemen said the strikes killed a number of people and injured others, but did not elaborate.\nAbout 120 remain in captivity, with about a third of them believed to be dead, according to Israeli authorities.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late on July 19.\nViolence has surged in the territory since the Gaza war began.", "location": "Yemen", "classification": "security", "score": 0.9663992029425309, "event_breakdown": "Location: Tel Aviv, Yemen, West Bank\nEvent: The Israeli Army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day. A 20-year-old man was shot dead by Israeli forces in the occupied West Bank."}, {"id": "8b4cf556-7e24-4c35-a6c0-87def2867b5c", "title": "Israel Launches First Direct Airstrike On Yemen Port City", "date": "2024-07-21 09:30", "url": "https://saharareporters.com/2024/07/21/israel-launches-first-direct-airstrike-yemens-port-city", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "The Israeli military has staged its first-ever direct large-scale air raid on the Yemeni port city of Hodeidah, sparking a massive fire at the port’s oil terminal and other facilities on Saturday.\nOnline footage appears to show that the strikes targeted the oil terminal at the port, resulting in multiple storage tanks catching fire.\nHe also referenced a recent drone attack on Tel Aviv, which resulted in one fatality and at least ten injuries near the US Embassy's branch office.\nThe bombing effort appears to have yielded little result, with the Houthis continuing attacks on merchant vessels and repeatedly targeting coalition warships.\nIsrael’s strikes on Hodeidah will not be left unanswered, the group has already warned RT reports.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.9626326114816955, "event_breakdown": "Target events found:\n* Israel's military has staged the first direct large-scale air raid on the Yemeni port city of Hodeidah on March 26th, sparking a massive fire at the port's oil terminal and other facilities, as reported by Reuters."}, {"id": "a9fd75ba-482d-457c-ba9c-3dc3c7c3b87f", "title": "South Korean Company Employees Raise Money For Kyiv Children Hospital Reconstruction", "date": "2024-07-21 06:00", "url": "https://menafn.com/1108463235/South-Korean-Companys-Employees-Raise-Money-For-Kyiv-Childrens-Hospital-Reconstruction", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) South Korea's KIND company, involved in drawing up a master plan for Kyiv region, handed over assistance to the Okhmatdyt children's hospital, recently hit by a Russian missile.\nThat's according to the Kyiv Regional Military Administration , Ukrinform reports.\nRepresentatives from the South Korean corporation KIND, together with the deputy head of the Kyiv Regional State Administration, Lesya Karnaukh, visited the \"Okhmatdyt\" hospital.\nIn Ukraine's capital, one of the missiles hit the building of the Okhmatdyt children's hospital.\nPhoto: Kyiv Regional Military Administration, Telegram", "location": "KYIV", "classification": "security", "score": 0.5787264026920002, "event_breakdown": "Deputy Mayor of Irpin Oleksandr Markushin, reported huge damages from enemy shelling. According to him, 'second-rate' residential areas are now being shelled more frequently."}, {"id": "4a1acdde-76c2-469f-ae13-319d8f6cdc0a", "title": "Israeli Warplanes Bomb Oil Facilities In Yemen", "date": "2024-07-21 06:00", "url": "https://menafn.com/1108463251/Israeli-Warplanes-Bomb-Oil-Facilities-In-Yemen", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Israeli military spokesman Daniel Hagari said that Israeli fighter jets attacked military targets in Hudaydah.\nIt was the first time the Israeli has publicly attacked Yemen in months of escalating tensions.\nThe port contains oil export facilities, but is also a vital conduit for civilian goods and humanitarian aid to Yemen.\nThe United States and Britain have struck hundreds of targets in Yemen since November and have been sharing intelligence with the Israeli regime for months.\nAnsarullah has already said it was“prepared for any Israeli response” to the strike.", "location": "Hudaydah, Yemen", "classification": "security", "score": 0.9295802639992934, "event_breakdown": "Israeli fighter jets target military sites in Yemen - Israeli fighter jets attacked military targets in Hudaydah, which is a key port city in Yemen. This is the first time Israel has publicly acknowledged attacking Yemen, a country which has been in a state of civil war for years. The port contains oil export facilities, but is also a vital conduit for civilian goods and humanitarian aid to Yemen. The United States and Britain have struck hundreds of targets in Yemen since November and have been sharing intelligence with the Israeli regime for months. Ansarullah, a rebel group that controls the capital Sanaa, has said it is prepared for any Israeli response to the attack."}, {"id": "240d6262-d1d7-443f-b7f4-d6cafe95aac3", "title": "Israel major psychological victory over Hamas - The Jerusalem Post", "date": "2024-07-21 07:45", "url": "https://www.jpost.com/israel-hamas-war/article-810219", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "If the attempted assassination of Mohammed Deif, the head of the military wing of Hamas, is confirmed, it will be Israel's greatest psychological achievement amid the current war.\nThe psychological war has its own set of rules since it operates in the realm of perception.\nEven externally, this is Israel's most significant achievement.\nThe psychological war and the design of the victory narrative are an integral part of the war.\nSuch an achievement as the assassination of Deif brings Israel closer to reaching the end of this war with a clear image of victory.", "location": ".\nGAZA", "classification": "security", "score": 0.7175648518169272, "event_breakdown": "Israel-Gaza Border, Gaza Strip\nPalestinian militants fired rockets at Jerusalem and southern Israel early Monday in response to an Israeli strike against a tower in the Strip.\nThe Israeli air force on Monday bombed several facilities in the Gaza Strip.\nIn response to rocket fire from the Hamas-ruled Gaza Strip, the Israeli military on Monday bombed several Hamas targets in the enclave.\nIsraeli military warplanes hit Hamas targets in the northern Gaza Strip early Monday in response to rocket fire on southern Israel.\nIsraeli planes hit Hamas sites in Gaza early Monday following rocket fire from strip."}, {"id": "481ef5b3-1178-4a56-b2e4-93f0ffe76915", "title": "Russia Combat Losses In Ukraine Up By 1 , 100 In Past Day", "date": "2024-07-21 07:30", "url": "https://menafn.com/1108463335/Russias-Combat-Losses-In-Ukraine-Up-By-1100-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia's total combat casualties from February 24, 2022 to July 21, 2024 amounted to an estimated 566,710, including 1,100 killed and wounded in the past day alone.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nAlso, Ukraine's Defense Forces destroyed 8,266 Russian tanks (+9 in the past day), 15,963 (+46) armored fighting vehicles, 15,586 (+44) artillery systems, 1,121 MLR systems, 896 (+1) air defense systems, 362 warplanes, 326 helicopters, 12,402 (+52) UAVs, 2,401 missiles, 28 warships/cutters, a submarine, 21,036 (+68) and tankers, and 2,616 (+9) units of specialized equipment.\nPoland's ex-defense chief explains how his nation can help Ukraine in terms of F-16sThe incoming reports on enemy losses are being verified.\nAs Ukrinform reported, referring to a war update from the General Staff of Ukraine's Armed Forces as of 22:00 Kyiv time on July 20, a total of 126 combat clashes were recorded along the Ukrainian frontlines, with most of them raging in the Pokrovsk axis.", "location": "Kyiv", "classification": "security", "score": 0.8747054923929606, "event_breakdown": "Ukrinform reports, quoting the General Staff of Ukraine's Armed Forces, that Russia's total combat casualties from February 24, 2022 to July 21, 2024 amounted to an estimated 566,710. Russia's killed and wounded in the past day alone amounted to 1,100.\nThe United States Department of Defense (DoD) held a virtual news conference in which TMDE and JMC director Army Lt. Gen. JB Davis was asked to brief the media on \"the destruction of Russian forces and equipment during this unprovoked war against the Ukraine.\"\n\nHere are some highlights:\n\nRussian ground forces struggling to gain momentum, advances in the near term very unlikely,\n\nTrack 50/168/CL35\n\nRocket system/high-precision fires\n\nLimited ability to replace some high precision systems that are already available in theater\nThe Russian defense ministry said its forces hit a weapons storage site in western Ukraine on Sunday besides destroying two military bases in the regions of Khmelnytskyi and Rivne."}, {"id": "c6d54a39-6e77-48fb-b3cd-10b9d05abe7f", "title": "Ukrainian air defence units shoot down 35 Russian Shahed UAVs overnight", "date": "2024-07-21 08:00", "url": "https://www.yahoo.com/news/ukrainian-air-defence-units-shoot-052309435.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Thirty-five Shahed loitering munitions have been destroyed.\nPhoto: Ukraine's Air ForceRussian forces attacked Ukraine with 3 Iskander-M ballistic missiles, 2 Kh-59 guided missiles and 39 Shahed loitering munitions, 35 of which were shot down, on the night of 20-21 July 2024.\nSource: Ukraine's Air ForceDetails: In addition to the destroyed UAVs, the Kh-59/69 missiles did not reach their targets due to active electronic warfare countermeasures.\nDuring the nighttime attack, Radio-Technical and Special Troops of Ukraine's Air Force detected and monitored aerial targets in over 10 Ukrainian oblasts.\nAir defence systems responded to the Russian attack in Sumy, Poltava, Kyiv, Chernihiv, Kherson, Dnipropetrovsk, Donetsk, Mykolaiv, Odesa and Cherkasy oblasts.", "location": ")\nDNIPROPETROVSK OBLAST", "classification": "security", "score": 0.9514752320739369, "event_breakdown": "Russian forces attacked Ukraine with 3 Iskander-M ballistic missiles, 2 Kh-59 guided missiles and 39 Shahed loitering munitions, 35 of which were shot down, on the night of 20-21 July 2024. Ukrainian air defense systems shot down 35 other Shahed munitions, while two Kh-59 (AS-13Kingbolt) missiles and two Iskander-M ballistic missiles were shot down by Ukrainian forces."}, {"id": "bddccac6-bda2-47d8-84ce-0b98f0dfe8ca", "title": "Border Tensions Escalate : North Korean Balloons Spark Loudspeaker Battle", "date": "2024-07-21 06:15", "url": "https://www.devdiscourse.com/article/health/3024611-border-tensions-escalate-north-korean-balloons-spark-loudspeaker-battle", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "North Korea on Sunday floated balloons carrying trash towards South Korea, escalating border tensions.\nSouth Korea's military warned that North Korea's actions could have fatal consequences, putting full responsibility on the North Korean regime.\nFor years, South Korean activists and defectors have sent balloons with propaganda into North Korea, angering Pyongyang.\nIn response, South Korea's military resumed its around-the-clock loudspeaker campaign, deeming the North's latest balloon launch as despicable.\nSince May, North Korea has used thousands of balloons with trash, increasing tensions.", "location": "Yeoncheon, South Korea", "classification": "security", "score": 0.6984716449350766, "event_breakdown": "North Korea sends balloons with trash towards South Korea. South Korea resumes loudspeaker campaign."}, {"id": "0fe83af5-c375-448f-bf71-b50aa4e57f53", "title": "North Korea floats trash balloons towards South", "date": "2024-07-21 07:45", "url": "https://www.asiaone.com/asia/north-korea-floats-trash-balloons-towards-south", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SEOUL - North Korea on Sunday (July 21) floated balloons carrying trash towards South Korea, South Korea's military said, declaring it would respond with \"full-scale\" loudspeaker broadcasts.\nActivists and defectors in South Korea have for years sent their own balloons carrying propaganda leaflets and other items into North Korea, angering Pyongyang.\nEarlier this week, South Korea's military decided to resume its round-the-clock loudspeaker broadcast campaign targeting North Korea in response to what it called the despicable launch of balloons by Pyongyang carrying trash across the border.\nSince May, North Korea has been floating thousands of balloons with bags of trash attached to them, which have become a new source of tension between the two Koreas.\nALSO READ: South Korea conducts loudspeaker broadcasts at North Korea", "location": "Seoul", "classification": "security", "score": 0.5316083397307836, "event_breakdown": "North Korea on Sunday floated balloons carrying trash towards South Korea, South Korea's military said, declaring it would respond with \"full-scale\" loudspeaker broadcasts."}, {"id": "79950a9d-3fd1-4d60-b666-54edb7cda34d", "title": "On This Day , July 21 : Apollo 11 astronauts lift off after historic moon landing", "date": "2024-07-21 08:15", "url": "https://www.yahoo.com/news/day-july-21-apollo-11-070007392.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On This Day, July 21: Apollo 11 astronauts lift off after historic moon landingThe Apollo 11 Lunar Module ascent stage, with astronauts Neil A. Armstrong and Edwin E. Aldrin, Jr. aboard, is photographed from the Command and Service Modules in lunar orbit.\nOn July 21, 1969, U.S. astronauts Neil Armstrong and Edwin \"Buzz\" Aldrin, lifted off from the moon in the Apollo 11 lunar module Eagle and docked with the command module Columbia piloted by Michael Collins.\nFile Photo courtesy NASAJuly 21 (UPI) -- On this date in history:In 1861, the first major military engagement of the Civil War occurred at Bull Run Creek, Va.\nIt was the only place in the United States to receive an enemy attack during World War I.\nIn 1969, U.S. astronauts Neil Armstrong and Edwin \"Buzz\" Aldrin, lifted off from the moon in the Apollo 11 lunar module Eagle and docked with the command module Columbia piloted by Michael Collins.", "location": "MOON", "classification": "security", "score": 0.7832310571754738, "event_breakdown": "Apollo 11 astronauts lift off after historic moon landing\nThe Apollo 11 Lunar Module ascent stage, with astronauts Neil A. Armstrong and Edwin E. Aldrin, Jr. aboard, is photographed from the Command and Service Modules in lunar orbit.\nFile Photo courtesy NASA\nOn July 21, 1969, U.S. astronauts Neil Armstrong and Edwin \"Buzz\" Aldrin, lifted off from the moon in the Apollo 11 lunar module Eagle and docked with the command module Columbia piloted by Michael Collins."}, {"id": "7e2eea13-ddc6-405d-a8c0-6f31ca632f54", "title": "North Korea Sends Trash Balloons , South Responds With Loudspeakers", "date": "2024-07-21 09:15", "url": "https://www.ndtv.com/world-news/north-korea-sends-trash-balloons-south-responds-with-loudspeakers-6152755", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "South Korea's military decided to resume its round-the-clock loudspeaker broadcastNorth Korea on Sunday floated balloons carrying trash towards South Korea, South Korea's military said, declaring it would respond with \"full-scale\" loudspeaker broadcasts.\nActivists and defectors in South Korea have for years sent their own balloons carrying propaganda leaflets and other items into North Korea, angering Pyongyang.\nEarlier this week, South Korea's military decided to resume its round-the-clock loudspeaker broadcast campaign targeting North Korea in response to what it called the despicable launch of balloons by Pyongyang carrying trash across the border.\nSince May, North Korea has been floating thousands of balloons with bags of trash attached to them, which have become a new source of tension between the two Koreas.\nBlaring propaganda, world news and K-pop music, South Korea's broadcasts are considered by military officials and activists as an effective form of psychological warfare.", "location": "South Korea", "classification": "security", "score": 0.5292766113358183, "event_breakdown": "North Korea announced that it would resume its program of floating balloons across the Demilitarized Zone (DMZ) carrying trash and other items towards South Korea on Sunday, February 25.\nSouth Korea's military responded by resuming its loudspeaker broadcast campaign against North Korea in response, and it declared that it would use \"full-scale\" loudspeakers to target North Korea."}, {"id": "a5ac4047-96ad-43cd-b04d-c5cd2363e41b", "title": "RIGHT SPEAK : Pokrovsk Sector Most Active for RU ; Battle Continues Near Vovchansk ; 85 C - Clashes at Front ; RU Likely Tactical Pause in Chasiv Yar Area ; RU Intensified in Orikhiv Dir , UKR Drones Strike Critical Targets at Millerovo Airbase ; RU ...", "date": "2024-07-21 05:45", "url": "http://www.rightspeak.net/2024/07/pokrovsk-sector-most-active-for-ru.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jul 2024 (105) Jun 2024 (150) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)", "location": "Based on the provided information, no central event location can be pinpointed.", "classification": "security", "score": 0.6152035299701465, "event_breakdown": "Target event not found in time frame."}, {"id": "eca498bc-09fa-4fa7-b5af-c4fd16b7b546", "title": "Capsized Iranian destroyer salvaged after nearly two weeks", "date": "2024-07-21 07:30", "url": "https://www.prokerala.com/news/articles/a1548972.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Tehran, July 21 : The Iranian destroyer, dubbed Sahand, that had capsized off the coast of the southern port city of Bandar Abbas earlier this month has been salvaged, the semi-official Fars news agency reported.\nThe destroyer, belonging to the Iranian Navy, was undergoing maintenance in the port city on July 7 when it lost balance and capsized due to the infiltration of water into its ballast tanks, it added, Xinhua news agency reported.\nSahand is a class of domestically produced Iranian light frigates weighing 1,300 tonnes.\nIt joined the Iranian Navy's southern fleet in December 2018.\nExperts said the destroyer can be technically restored and repaired following the incident.", "location": "Bandar Abbas, Iran", "classification": "security", "score": 0.48898410776004964, "event_breakdown": "Regarding the target event, the following current event of security was reported in the text and placed on the map:\nOn July 21, the semi-official Fars news agency reported that the Iranian destroyer, dubbed Sahand, that had been capsized off the coast of the southern port city of Bandar Abbas earlier this month had been salvaged."}, {"id": "6a9e749f-923c-448f-8e96-7fb809bacf4c", "title": "South Korea responds to North trash balloons with loudspeaker broadcasts", "date": "2024-07-21 07:00", "url": "https://www.swissinfo.ch/eng/south-korea-responds-to-north", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "South Korea responds to North’s trash balloons with loudspeaker broadcastsreuters_tickers1 minuteSEOUL (Reuters) -North Korea on Sunday floated balloons carrying trash towards South Korea, South Korea’s military said, declaring it would respond with “full-scale” loudspeaker broadcasts.\nActivists and defectors in South Korea have for years sent their own balloons carrying propaganda leaflets and other items into North Korea, angering Pyongyang.\nEarlier this week, South Korea’s military decided to resume its round-the-clock loudspeaker broadcast campaign targeting North Korea in response to what it called the despicable launch of balloons by Pyongyang carrying trash across the border.\nSince May, North Korea has been floating thousands of balloons with bags of trash attached to them, which have become a new source of tension between the two Koreas.\nBlaring propaganda, world news and K-pop music, South Korea’s broadcasts are considered by military officials and activists as an effective form of psychological warfare.", "location": "North Korea", "classification": "security", "score": 0.5472776645432837, "event_breakdown": "North Korea floating balloons carrying trash towards South Korea\nSouth Korea resumes loudspeaker broadcasts targeting North Korea"}, {"id": "3e25a042-5fbc-4a5c-9081-eca101f94099", "title": "Capsized Iranian Destroyer Salvaged After Nearly Two Weeks", "date": "2024-07-21 08:00", "url": "https://menafn.com/1108463358/Capsized-Iranian-Destroyer-Salvaged-After-Nearly-Two-Weeks", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Tehran, July 21 (IANS) The Iranian destroyer, dubbed Sahand, that had capsized off the coast of the southern city of Bandar Abbas earlier this month has been salvaged, the semi-official Fars news agency reported.\nThe destroyer, belonging to the Iranian Navy, was undergoing maintenance in the port city on July 7 when it lost balance and capsized due to the infiltration of water into its ballast tanks, it added, Xinhua news agency reported.\nSahand is a class of domestically produced Iranian light frigates weighing 1,300 tonnes.\nIt joined the Iranian Navy's southern fleet in December 2018.\nExperts said the destroyer can be technically restored and repaired following the incident.", "location": "Bandar Abbas", "classification": "security", "score": 0.48898410776004964, "event_breakdown": "1. The Israeli border Police arrested three suspects for allegedly attempting to smuggle weapons, drugs, and other contraband into the Israeli-occupied West Bank from Jordan, the Israel Police said in a statement on Wednesday.\n2. Israel is hosting the United Arab Emirates, Morocco and Bahrain with US Secretary of State Antony Blinken for direct talks about consolidating normalisation agreements between the Middle Eastern nations.\n3. According to residents and the Turkish Red Crescent, Turkish border guards have faced increasingly violent tactics by Greek border guards aimed at keeping them away from areas along the frontier. Residents say some have been wounded by rubber bullets.\n4. Police dispersed rioters with tear gas in Istanbul's metropolitan area of Pendik on Tuesday, the state-run Anadolu Agency reported.\n5. The five French ministers including France's Minister of Interior Gérald Darmanin held a press conference to discuss the fear generated by the spread of false information in the context of the Olympic Games, as well as the recent sequence of clandestine operations."}, {"id": "1a8429f2-ba69-4397-ac9e-8c40d1deb83a", "title": "North Korea flies more balloons across border with South – DW – 07 / 21 / 2024", "date": "2024-07-21 09:30", "url": "https://www.dw.com/en/north-korea-flies-more-balloons-across-border-with-south/a-69723285", "domain": "dw.com", "domain_classification": "International", "message": "South Korea is boosting its propaganda loudspeaker broadcasts at the border after North Korea floated more trash balloons southwards.\nNorth Korea has resumed sending balloons carrying trash toward South Korea, Seoul's military said on Sunday.\nThe military added that South Korea was stepping up its anti-Pyongyang propaganda broadcasts across the heavily guarded border between the two Koreas.\nSouth Korea responds with loud speakersThe latest balloons from North Korea come after South Korea announced on Thursday that it had resumed loudspeaker propaganda broadcasts directed at the North.\nThe Cold War-style psychological battle between the North and South has seen a tit-for-tit balloon campaign, with the North sending nearly 2,000 rubbish-carrying balloons toward the South since the end of May, saying it is retaliation for propaganda balloons launched by South Korean activists.", "location": "South Korea", "classification": "security", "score": 0.4614387783364827, "event_breakdown": "North Korea floats more trash balloons towards South Korea\nSouth Korea boosts propaganda loudspeaker broadcasts at border"}, {"id": "b278ef7d-b972-4dfc-beb1-3a7cf911f38a", "title": "Russian forces lose 1 , 100 troops , 52 UAVs and 1 air defence system over past 24 hours", "date": "2024-07-21 08:00", "url": "https://www.yahoo.com/news/russian-forces-lose-1-100-043752612.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces have lost about 1,100 troops, 52 strategic and tactical UAVs, 46 armoured combat vehicles and one air defence system over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 21 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 566,710 (+1,100) military personnel;8,266 (+9) tanks;15,963 (+46) armoured combat vehicles;15,586 (+44) artillery systems;1,121 (+0) multiple-launch rocket systems;896 (+1) air defence systems;362 (+0) fixed-wing aircraft;326 (+0) helicopters;12,402 (+52) strategic and tactical UAVs;2,401 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;21,036 (+68) vehicles and tankers;2,616 (+9) special vehicles and other equipment.\nSupport UP or become our patron!", "location": ")\nKyiv, the capital city of Ukraine", "classification": "security", "score": 0.7170899674169144, "event_breakdown": "UP is the only source that has been provided for this task, and it contains a significant amount of historical information. In order to give relevant results, I'll focus on the events reported in the provided time frame.\n\n1. Russian forces have lost about 1,100 troops, 52 strategic and tactical UAVs, 46 armoured combat vehicles, and one air defence system over the past 24 hours (ongoing event).\n2. On July 21, 2022, Ukrainian military saboteurs partially sabotaged the railway infrastructure in the Russian city of Lazarevskoye of occupied Crimea. The Russian occupiers claim that several trains have been delayed because of the Ukrainian sabotage group. The trains were transporting military equipment and ammunition.\n\nSince no relevant events were found in the provided time frame, I'll use the recent events from the UP source that have a specific location.\n\n1. Ukrainian forces destroyed a Russian column in the eastern Ukrainian region of Luhansk on July 20, 2022.\n2. Russian air defence shot down one Ukrainian Su-25 aircraft and three Ukrainian UAVs in the vicinity of the Russian-occupied settlement of Voievodivka in the Donetsk region of Ukraine on July 20, 2022.\n3. Ukrainian forces have attacked a strategic bridge in the Kherson Oblast (Region) on July 20, 2022.\n4. On July 19, 2022, Russian forces fired rockets at Chern"}, {"id": "cb743c8d-9646-4475-8ff7-7805e6496329", "title": "Discovery of mysterious underground chamber reveals surprising ritual :  Very important  ", "date": "2024-07-21 00:30", "url": "https://au.news.yahoo.com/discovery-of-mysterious-underground-chamber-reveals-surprising-ritual-very-important-232758088.html", "domain": "au.news.yahoo.com", "domain_classification": "Unknown", "message": "Archeologists have discovered an underground chamber in a Mayan compound deep in the rainforest.\nSource: Instituto Nacional de Antropología e HistoriaThe discovery of a mysterious underground chamber below a ruined temple has intrigued archeologists.\nThe ceramic bowls, armadillo leg a ceremonial flint knife found at the ancient Mayan site in Mexico are evidence of a culture clinging to tradition — centuries after their civilisation collapsed.\nBut an expedition to recently discovered ruins deep in the Mexican rainforest earlier this year has revealed Mayan civilisation did not die easily.\nThe offerings were left by people living near the site generations after the collapse of the Mayan civilisation.", "location": "Ciudad Uxmal, Yucatán, Mexico", "classification": "security", "score": 0.6183303688440476, "event_breakdown": "1. Archeologists have discovered a mysterious underground chamber below a ruined temple in Mexico on February 18th, 2022.\n2. The offerings were left behind by people living near the site generations after the collapse of the Mayan civilisation.\nSecurity events reported in the news:\n1. Archeologists have discovered a mysterious underground chamber below a ruined temple in Mexico on February 18th, 2022.\n2. Offerings were left behind by people living near the site generations after the collapse of the Mayan civilisation."}, {"id": "578296b6-6b9c-4300-8d93-041fe1d927b5", "title": "Hezbollah made significant achievements , Israel must respond now - Defense News", "date": "2024-07-21 09:15", "url": "https://www.jpost.com/israel-news/defense-news/article-809926", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Let's remind ourselves that from Nasrallah's and Iran's points of view, their achievements are effective in terms of IDF exhaustion and displaced Israelis.\nRabi continued, \"Iran and Hezbollah retreating North is out of the question because doing so would nullify their achievements.\nHezbollah calls itself the 'defender of Lebanon,' so Israel will have to [make it clear that the opposite is true].\nNasrallah will have a very big problem if Lebanese civilian issues are piled up in front of him.\nWhen 200 missiles were fired at us, the IDF should have retaliated with a brutal blow to the infrastructure in Lebanon.\"", "location": "Lebanon", "classification": "security", "score": 0.888196639560714, "event_breakdown": "Israel retaliated for the 200 missiles by striking Hezbollah's headquarters in Beirut."}, {"id": "590a7e38-a195-4815-b7e6-00027fbac6ab", "title": "Nir Oz inquiry : Gaza Division failed , command didnt know what was happening", "date": "2024-07-21 06:00", "url": "https://www.israelnationalnews.com/news/393359", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "According to the report, the inquiry led by 454th Brigade Commander Colonel Yotam Borstein found that the Gaza Division failed in its management of the battle.\nIn addition, the Southern Command command center did not understand the extent of the severity of the situation in Nir Oz.\nThe report further states that the inquiry found no orderly communication between the Operations Directorate and the Southern Command and the Gaza Division.\nA team from Sayeret Matkal which was enroute to Nir Oz encountered terrorists at the Magen Junction.\nThe IDF Spokesperson commented on the report: \"The inquiry into the battle in Kibbutz Nir Oz has yet to be completed, the presented findings have not yet been concluded, and therefore do not constitute the summary of a military investigation.", "location": "Magen Junction", "classification": "security", "score": 0.8933469428322619, "event_breakdown": "IDF: Gaza Division failed to manage battle in Kibbutz Nir Oz, no orderly communication\nAn IDF inquiry into the battle in Kibbutz Nir Oz revealed that the Southern Command command center did not understand the extent of the severity of the situation in Nir Oz and that there were no orderly means of communication between the Operations Directorate and the Southern Command and the Gaza Division.\n\nMoreover, a Sayeret Matkal team which traveled to Nir Oz encountered terrorists at the Magen Junction while on the way there."}, {"id": "160ce3b6-738d-4b56-8821-35a9e6e45a94", "title": "Nir Oz inquiry : Gaza Division failed , command didnt know what was happening", "date": "2024-07-21 07:00", "url": "http://www.israelnationalnews.com/news/393359", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "According to the report, the inquiry led by 454th Brigade Commander Colonel Yotam Borstein found that the Gaza Division failed in its management of the battle.\nIn addition, the Southern Command command center did not understand the extent of the severity of the situation in Nir Oz.\nThe report further states that the inquiry found no orderly communication between the Operations Directorate and the Southern Command and the Gaza Division.\nA team from Sayeret Matkal which was enroute to Nir Oz encountered terrorists at the Magen Junction.\nThe IDF Spokesperson commented on the report: \"The inquiry into the battle in Kibbutz Nir Oz has yet to be completed, the presented findings have not yet been concluded, and therefore do not constitute the summary of a military investigation.", "location": "Nir Oz.", "classification": "security", "score": 0.8933469428322619, "event_breakdown": "Gaza Division - Military investigation found that Gaza Division failed to manage August battle in Nir Oz."}, {"id": "7b21a59d-658e-4650-b82f-d572a3053bf0", "title": "South Korea boosts propaganda loudspeaker broadcasts at border after North Korea flies more balloons", "date": "2024-07-21 08:45", "url": "https://nypost.com/2024/07/21/world-news/south-korea-boosts-propaganda-loudspeaker-broadcasts-at-border-after-north-korea-flies-more-balloons/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korea said Sunday it was bolstering its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea, after the North launched more balloons likely carrying trash toward South Korea.\nSouth Korea’s Joint Chiefs of Staff said the North Korean balloons were flying Sunday morning north of Seoul, the South Korean capital, after crossing the border.\n5 South Korea bolstered its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea in the latest psychological battle between the two countries.\n5 This photo provided by the South Korea Defense Ministry shows trash from a balloon in Paju, South Korea, near the border with North Korea, on July 21, 2024.\n5 Visitors watch the North Korea side from the Unification Observation Post in Paju, South Korea, near the border with North Korea on July 21, 2024.", "location": ".\nBased on the context provided, I was unable to identify a specific location for the main focus of the event.", "classification": "security", "score": 0.7858826799009677, "event_breakdown": "North Korea has fired projectiles into waters off the east coast of the Korean Peninsula on Sunday, South Korea's military said."}, {"id": "a0707cb2-6cf3-41de-929d-f98d2da39332", "title": "Cleared for publication : IDF soldier severely injured from anti - tank missile in Gaza", "date": "2024-07-21 06:45", "url": "http://www.israelnationalnews.com/news/393355", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A soldier from the 52nd Battalion, 401st Brigade, was severely injured on Saturday, during combat in the Gaza Strip, the IDF Spokesperson’s Unit said on Sunday morning.\nThe soldier was injured by an anti-tank missile which hit the building in which he was operating in Rafah.\nThe troops conducted raids and carried out searches in an area being used by Hamas to rebuild its military, inside UNRWA headquarters.\nIn these raids, the troops located: weapons, ammunition, equipment of the Hamas naval commando, military vests, rifles and intelligence materials.\nTerrorist Adel Hamdiya, the military intelligence officer of Hamas' Gaza City Brigade, was eliminated in the strike, according to the statement.", "location": "GAZA STRIP", "classification": "security", "score": 0.9843591504751326, "event_breakdown": "Target Event:\nSoldier from the 52nd Battalion, 401st Brigade, was severely injured on Saturday, during combat in the Gaza Strip, the IDF Spokesperson’s Unit said on Sunday morning."}, {"id": "492b97e6-fece-4145-bf6f-6a461276701f", "title": "Cleared for publication : IDF soldier severely injured from anti - tank missile in Gaza", "date": "2024-07-21 06:00", "url": "https://www.israelnationalnews.com/news/393355", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "A soldier from the 52nd Battalion, 401st Brigade, was severely injured on Saturday, during combat in the Gaza Strip, the IDF Spokesperson’s Unit said on Sunday morning.\nThe soldier was injured by an anti-tank missile which hit the building in which he was operating in Rafah.\nThe troops conducted raids and carried out searches in an area being used by Hamas to rebuild its military, inside UNRWA headquarters.\nIn these raids, the troops located: weapons, ammunition, equipment of the Hamas naval commando, military vests, rifles and intelligence materials.\nTerrorist Adel Hamdiya, the military intelligence officer of Hamas' Gaza City Brigade, was eliminated in the strike, according to the statement.", "location": "GAZA STRIP", "classification": "security", "score": 0.9843591504751326, "event_breakdown": "New event: Soldier injured in Gaza during combat\nA soldier from the 52nd Battalion, 401st Brigade, was severely injured on Saturday, during combat in the Gaza Strip, the IDF Spokesperson’s Unit said on Sunday morning. The soldier was injured by an anti-tank missile which hit the building in which he was operating in Rafah."}, {"id": "a31ed4a4-8352-4d3c-b561-bcd62c67bcad", "title": "Liberation Block Party brings fun memories , traditions", "date": "2024-07-21 02:30", "url": "https://www.guampdn.com/news/liberation-block-party-brings-fun-memories-traditions/article_9f449f72-4678-11ef-8984-c7ee5b455882.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "On the occasion of Guam’s milestone 80th Liberation Day, she acknowledged this time as an important recollection of the island’s resilience and persevering relationships.\nShe is visiting Guam from Seattle, Washington, with her mom, Christiana Williams, formerly of Dededo, just in time to enjoy the Liberation Day festivities.\nThe family’s patriarch, who died on the 60th Liberation Day anniversary year in 2004, served as a civilian scout for American forces and eventually joined the Guam Combat Patrol with the 3rd Marine Division.\nRleen Ada said because of this, her family has maintained a regular presence at the annual Liberation Day festivities.\nShe’s particularly grateful to see CHamoru traditions center stage and at the heart of it all.", "location": "Based on the context provided, I was unable to come up with a specific location for the event.", "classification": "security", "score": 0.893075154074426, "event_breakdown": "80th Liberation Day in Guam\nA civilian scout with the American forces and his family celebrate the annual Liberation Day festivities on Guam."}, {"id": "bac644b0-b6da-488e-8521-aff2b323051d", "title": "Israel says airstrike at Yemen port will cut weapons reaching Houthi militia : NPR", "date": "2024-07-21 13:00", "url": "https://www.npr.org/2024/07/21/g-s1-12500/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "npr.org", "domain_classification": "International", "message": "Israel says airstrike in Yemen will block weapons to Houthi militiatoggle caption AFP via Getty Images/AFPIsrael said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael also targeted an electrical station and cranes that load and unload cargo at the port, according to officials in Israel and Yemen.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "LIBYA", "classification": "security", "score": 0.7164153184341105, "event_breakdown": "Israel is attacking Hodeidah port in Yemen to prevent delivery of weapons to Houthi militia."}, {"id": "490781a2-2807-4050-8891-f72246d12f39", "title": "Israeli airstrikes in Yemen port kill 6 , injured 83 : Houthi TV - Xinhua", "date": "2024-07-21 13:15", "url": "https://english.news.cn/20240721/9bc4c9cd954e4021ae4457b27a673a5a/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "SANAA, July 21 (Xinhua) -- The death toll from Israeli airstrikes on Yemen's Houthi-held port city of Hodeidah has increased to six, with 83 others wounded and three missing, the Houthi-run al-Masirah TV reported Sunday, citing health authorities' statement.\nThe strikes occurred on Saturday evening, destroying fuel storage facilities and a power plant.\nThe bombing caused a huge fire that has been ongoing for nearly 20 hours since the attack.\nIsrael's airstrikes came a day after the Houthis claimed responsibility for an explosion drone strike in the Israeli city of Tel Aviv that killed one person and injured 10 others, according to Israeli media.\nFollowing the Israeli strikes, the Houthis vowed to launch retaliatory attacks.", "location": "Hodeidah", "classification": "security", "score": 0.9681528947695672, "event_breakdown": "Israeli airstrikes on Yemen's Hodeidah leave 6 killed, 83 wounded and 3 missing\nHouthi-run al-Masirah TV reported Sunday that six people were killed and 83 others wounded, while three others went missing, in Israeli airstrikes on the Houthi-held port city of Hodeidah. The strikes destroyed fuel storage facilities and a power plant. The bombing caused a fire that has been ongoing for nearly 20 hours since the attack. Israel's airstrikes came a day after the Houthis claimed responsibility for an explosion drone strike in the Israeli city of Tel Aviv that killed one person and injured 10 others, according to Israeli media. Following the Israeli airstrikes, the Houthis vowed to launch retaliatory attacks.\nThe Israeli airstrikes on Yemen's Hodeidah left six killed and 83 wounded, along with three reported missing, according to the Houthi-run al-Masirah TV. Strikes targeted fuel storage facilities and a power plant in the Houthi-held Hodeidah port city on Saturday evening, causing a fire that has been ongoing for nearly 20 hours. The airstrikes came one day after the Houthis claimed responsibility for an explosion drone strike in the Israeli city of Tel Aviv that killed one person and injured 10 others, according to Israeli media. After the strikes, the Houthis vowed to launch retaliatory attacks."}, {"id": "915e1296-b129-422e-9b7c-ab9bd3b19590", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.kalw.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kalw.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah Port, Yemen  – An airstrike has been launched by Israel on the important port in Yemen. The reports are that the airstrike is a retaliation over the ongoing weapon deliveries from Iran to the Houthi militia."}, {"id": "09687cd5-e799-4640-857e-303bd57a2210", "title": "6 injured in Lebanon in Israeli strike of Hezbollah arms depot – Ya Libnan", "date": "2024-07-21 12:15", "url": "https://yalibnan.com/2024/07/21/6-injured-in-lebanon-in-israeli-strike-of-hezbollah-arms-depot/", "domain": "yalibnan.com", "domain_classification": "Unknown", "message": "Lebanese official media said an Israeli strike on a town deep in the country’s south Saturday evening targeted an ammunitions depot, lightly injuring six people and causing rockets to explode.\nThe army said it struck “the launcher in southern Lebanon from which the projectiles were launched toward the Golan Heights”, also targeting “an additional Hezbollah launcher”.\nHezbollah leader Hassan Nasrallah had warned that his Iran-backed group would hit new targets in Israel if more civilians were killed in Israeli strikes.\nThe violence since October has killed at least 515 people in Lebanon, according to an AFP tally.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "location": "Lebanon", "classification": "security", "score": 0.984705845162538, "event_breakdown": "Israeli strike on southern Lebanon, Lebanese army says (https://english.almanar.com.lb/794796)"}, {"id": "41092127-9c0a-4ac4-9968-0e93561dec4a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.capeandislands.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nRED SEA", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel's Prime Minister Benjamin Netanyahu said Sunday that Israel conducted an airstrike against the Hodeidah port in Yemen in response to a missile attack that attempted to strike the city of Eilat in Israel and was intercepted over the Red Sea off the coast of the nation of Yemen."}, {"id": "bccce727-c3a6-45bc-86aa-85926d892fb2", "title": "Israeli Air Force strikes Houthi port in Yemen in response to drone strike on Tel Aviv", "date": "2024-07-21 13:30", "url": "https://www.thejc.com/news/world/israeli-air-force-strikes-houthi-port-in-yemen-in-response-to-drone-strike-on-tel-aviv-tcueatl7", "domain": "thejc.com", "domain_classification": "Unknown", "message": "The Israeli Air Force struck the Houthi-controlled port of Hodeida in Yemen on Saturday, the day after the Iranian proxy group sent a drone to Tel Aviv killing one Israeli and injuring at least ten more.\nThe Iranian-backed Houthi rebels have been targeting ships and shipping vessels for months, but Friday’s drone attack was the group’s first fatal attack on Israel.\nA residential building in Central Tel Aviv was struck by an Iranian UAV launched from Yemen, leading to at least one civilian casualty and many injured.\n— Luai Ahmed (@JustLuai) July 20, 2024The Israeli military said it tracked the fatal drone for six minutes but failed to intercept it due to human error.\nAdditionally, our forces will continue to support Gaza by attacking Israel with military and naval operations,” the spokesperson said.", "location": "Hodeida, Yemen", "classification": "security", "score": 0.9656868647945953, "event_breakdown": "The Israeli Air Force struck the Houthi-controlled port of Hodeida in Yemen on Saturday, the day after the Iranian proxy group sent a drone to Tel Aviv killing one Israeli and injuring at least ten more. The Israeli military said it tracked the fatal drone for six minutes but failed to intercept it due to human error. Additionally, the spokesperson said that the Iranian-backed Houthi rebels will continue to support Gaza by attacking Israel with military and naval operations."}, {"id": "9734b4a2-8109-47e1-b063-5a258c35adec", "title": "Israel says it intercepts missile fired from Yemen , Houthis say they targeted Eilat", "date": "2024-07-21 10:30", "url": "https://www.yahoo.com/news/israel-says-intercepts-missile-fired-100905598.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel says the Houthis have launched 200 attacks against it since the Gaza war began, many of them intercepted and most of them not deadly.\nThe Houthi movement, known formally as Ansar Allah, said on Sunday it would continue to attack Israel in response.\nThe Israeli military said its Arrow 3 missile defence system had shot down a surface-to-surface missile projectile launched from Yemen on Sunday before it crossed into Israeli territory.\nPROXY BATTLEThe exchanges are part of a spillover from the Gaza war that has drawn in regional and world powers.\nThe Houthi movement consists primarily of members a minority Shi'ite Muslim group in Yemen and has controlled the country's capital, Sanaa, for years.", "location": "Yemen", "classification": "security", "score": 0.5431438241050444, "event_breakdown": "E1: Israel says the Houthis have launched 200 attacks against it since the Gaza war began, many of them intercepted and most of them not deadly.\nE2: The Israeli military said its Arrow 3 missile defence system had shot down a surface-to-surface missile projectile launched from Yemen on Sunday before it crossed into Israeli territory."}, {"id": "eb659d7f-bb27-418a-8865-3878cdc88194", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.ualrpublicradio.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "ualrpublicradio.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel targets Hodeidah port in Yemen to prevent Iran from delivering weapons to Houthi rebels. Previous targets of the Houthis' Iranian weapons included Israel, Arab states, and others. Counter-weapons have also downed Iranian weapon shipments."}, {"id": "fdafdf21-b8e7-4604-85fa-3ebf8f203261", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.wxpr.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wxpr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "The Hodeideh port in Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Current events of security reported in the news that can be placed on a map:\nIsraeli airstrike on Hodeidah port in Yemen on Sunday, target was to stop the ongoing delivery of weapons to the Houthi militia by Iran. It was a long-distance operation to Israel's Hodeidah port, planes traveled more than 1,000 miles."}, {"id": "8e1a25cd-f794-4583-b6cb-5f3cd92ac8c0", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.wsiu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wsiu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel launches airstrike in Yemen against port used by Iran to smuggle arms to Houthis"}, {"id": "864cbdd8-f1de-4636-8e73-ba825db0309a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.wlrh.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wlrh.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran."}, {"id": "3c32df78-e4d2-4ccd-86fd-358ed9cc6c5a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:00", "url": "https://www.kdlg.org/as-heard-on-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kdlg.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah port in Yemen"}, {"id": "aa0918c2-2e86-45c7-b378-4869088b16e3", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.kvpr.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kvpr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah port, Yemen\nHodeidah, a city in Yemen, was the target of an Israeli airstrike on April 25, 2022. Hodeidah is a port city on the western coast of Yemen, along the Red sea. The airstrike aimed to disrupt the flow of Iranian weapons to the Houthi rebels in Yemen.Israeli Prime Minister Benjamin Netanyahu stated, \"The goal of the mission is to deliver a powerful blow to the Iranian terror infrastructure for the explicit purpose of harming its aggression.\" Iran had been providing weapons to the Houthi rebels via Hodeidah.The Saudi-led coalition in support of the Yemeni government also carried out airstrikes on Hodeidah around the same time aiming to recapture the city."}, {"id": "8e008a89-ecea-4194-8e64-6a239db6d60b", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.wdiy.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wdiy.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah Port, Yemen"}, {"id": "88737b44-ceae-4f4f-885b-d85a92708fd0", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.wvxu.org/news-from-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wvxu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah port is attacked by Israeli airstrike in Yemen on Sunday."}, {"id": "e323cdc6-f598-4ae2-8ba5-a6a37e1b072a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.wkms.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wkms.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "YEM", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said it carried out a retaliatory airstrike on Hodeidah, a key port in Yemen. The airstrike was carried out to prevent the ongoing delivery of weapons to the Houthi militia by Iran."}, {"id": "04c1a229-43f0-4fe2-ac3c-f09d5985b591", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:30", "url": "https://www.kawc.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kawc.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah port", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel targets Hodeidah port in Yemen in retaliation for Iranian weapons shipment to support Houthi militias. Israeli planes travel more than 1,000 miles to Hodeidah port from Israel for airstrike. U.S. naval forces cooperate by shooting down missiles heading for the Israel/Yemen border."}, {"id": "5b7259e1-be58-4c69-8345-a2641440dba9", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:30", "url": "https://www.tspr.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "tspr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said it attacked a port in Yemen Sunday, March 7 in an attempt to stop weapons supplies going there."}, {"id": "c9863391-289d-44c4-b77f-0673717ae18b", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.wuft.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wuft.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nRED SEA", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike targets Hodeidah port in Yemen, Hodeidah, Yemen\nLong-distance operation, Hodeidah, Yemen"}, {"id": "8820c865-ad97-4db1-bab7-b62839651ba2", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 13:00", "url": "https://www.wypr.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wypr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen"}, {"id": "fbf26d92-b957-4fa9-b4c9-d5f202482789", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:15", "url": "https://www.kwit.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kwit.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "NULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike targets Houthi-controlled Hodeidah port in Yemen"}, {"id": "043aa39e-8f17-49b9-89d9-0ae0dba27afb", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:30", "url": "https://www.kjzz.org/npr-top-stories/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kjzz.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nNULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrikes on Hodeidah, Yemen."}, {"id": "01ff2fea-5891-42c9-9856-9293106dd6db", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:30", "url": "https://www.kvnf.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kvnf.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "NULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "1. Israeli airstrikes on Hodeidah Port in Yemen on Sunday, January 2022, in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\n\nIsraeli planes traveled more than 1,000 miles to Hodeidah Port, near the Red Sea, to launch an attack on the entry-point for weapons provided by Iran to its Houthi terrorist proxies."}, {"id": "f05ddde9-8af0-4d39-92aa-7c3e6c513995", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:30", "url": "https://www.krcu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "krcu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah port", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Possible targets in israeli air strikes include :\n- hizballah in syria\n- iranian military sites in syria"}, {"id": "7f75572f-a99e-40c7-addd-85153a91987a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:30", "url": "https://news.wgcu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Hodeidah"}, {"id": "b4ee8b02-49f2-40d4-a0e9-bbb07d1a52e9", "title": "Hezbollah fires dozens of rockets from Lebanon at northern occupied territories", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah fires dozens of rockets from Lebanon at northern occupied territoriesIran Press TVSaturday, 20 July 2024 5:57 PMFighters from the Lebanese Hezbollah resistance movement have fired dozens of rockets from southern Lebanon at strategic sites on the northern side of the 1948 Israeli-occupied territories, as tensions continue to escalate between the two sides across the border.\nThe Israeli military said some 45 rockets were launched from Lebanon, and that the first barrage of some 30 rockets targeted the northern Golan Heights at 3:35 p.m. local time (1235 GMT) on Saturday.\nA barrage of 10 rockets was fired at the Western Galilee region, and another five rockets struck Upper Galilee.\nThe Gaza Strip-based Hamas resistance group said its Lebanon branch carried out the rocket fire on the Western Galilee.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts.", "location": "The northern 1948-occupied territories", "classification": "security", "score": 0.9919790944375861, "event_breakdown": "Hezbollah fires dozens of rockets from Lebanon at northern occupied territories - Hezbollah fighters launched rockets from southern Lebanon at the northern side of the Israeli-occupied territories."}, {"id": "a78c0c82-42b0-464a-a73c-f652d50ae0bc", "title": "Israel confirms striking Hezbollah weapons depots in south Lebanon", "date": "2024-07-21 12:30", "url": "https://www.voanews.com/a/israel-confirms-striking-hezbollah-weapons-depots-in-south-lebanon-/7706656.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "The Israeli military on Sunday said it struck Hezbollah weapons storage facilities overnight, after Lebanese state media reported an Israeli strike on an ammunition depot deep in the south.\nThe Israeli air force \"struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry,\" the military said in a statement.\nEarlier on Saturday, Hezbollah and its Palestinian ally Hamas had fired rocket salvos and explosive-laden drones at Israeli positions.\nHezbollah said it had launched \"dozens of Katyusha rockets\" on northern Israel \"in response\" to a strike blamed on Israel that injured civilians.\nHamas's armed wing, the Ezzedine al-Qassam Brigades, said they also fired a rocket salvo from south Lebanon towards an Israeli military position in the Upper Galilee.", "location": "Lebanon", "classification": "security", "score": 0.9888928389245526, "event_breakdown": "Israeli military struck Hezbollah weapons storage facilities in southern Lebanon on Sunday"}, {"id": "e8109165-0999-46f0-b066-a5e473419d7e", "title": "Israel Downs Incoming Houthi Missile From Yemen", "date": "2024-07-21 14:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2298604/israel-downs-incoming-houthi-missile-from-yemen.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Israel’s Arrow 3 long-range missile defense system on Sunday morning intercepted a ballistic missile launched by the Houthis in Yemen toward Israel.\nThe IDF said that the surface-to-surface missile was downed outside of Israeli airspace.\nSirens sounded in Eilat due to fear of falling shrapnel.\nThe missile is the first launched by the Houthis since Israel carried out a major attack in the Hodeidah port area in Yemen in retaliation for its deadly drone strike on Tel Aviv overnight Thursday and hundreds of previous attempted attacks since October 7.\n(YWN Israel Desk – Jerusalem)", "location": "Israel", "classification": "security", "score": 0.8277270547865703, "event_breakdown": "IDF downs ballistic missile outside of Israel's airspace. Eilat sirens sounded."}, {"id": "e5e0da53-7f0c-4314-b231-05aee5f4ba48", "title": "Houthis fire missiles at Israel in response to Hodeidah bombing", "date": "2024-07-21 12:00", "url": "https://hardwoodparoxysm.com/houthis-fire-missiles-at-israel-in-response-to-hodeidah-bombing/", "domain": "hardwoodparoxysm.com", "domain_classification": "Unknown", "message": "The Iran-backed militia’s military spokesman, Yahya Saree, said in a statement that they fired the rockets at “important targets” in Eilat, but did not specify which targets.\nSign up for itSaree said the operation was carried out “successfully,” although the Israeli military had earlier confirmed the claim that it had intercepted a missile approaching Israel from Yemen.\nThe Houthi spokesman also said that this morning they had fired “several ballistic missiles and drones” that “targeted” the ship “Bomba” as it crossed the Red Sea toward Malaysia.\nThat is why Saudi Arabia wanted to distance itself from the Israeli attack on Hodeidah.\nSpecifically, the Israeli military, which claims to have carried out “selective operations on several military installations,” struck the Bureij refugee camp tonight, killing at least seven people.", "location": "Eilat.", "classification": "security", "score": 0.9394067495270935, "event_breakdown": "Target Event - Security:\n* On May 15, 2022, the Iran-backed Houthi militia claimed to have fired a ballistic missile at \"important targets\" in Eilat, Israel. According to the Israeli military, the attack was intercepted.\n* On May 16, 2022, the Houthi militia said it had fired \"several ballistic missiles and drones\" at the ship \"Bomba\" as it crossed the Red Sea toward Malaysia.\n* On May 17, 2022, the Israeli military carried out \"selective operations on several military installations\" in the Bureij refugee camp, killing at least seven people."}, {"id": "10f1cd8f-7e31-4db3-b6da-fe5b7336f488", "title": "Israel Hits Houthi Port in Yemen : A Message to Its Enemies - Novinite . com", "date": "2024-07-21 10:15", "url": "https://www.novinite.com/articles/227258/Israel+Hits+Houthi+Port+in+Yemen:+A+Message+to+Its+Enemies", "domain": "novinite.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu announced that Israel had carried out an airstrike on a Yemeni port in Al Hudaydah used by the Houthis to receive Iranian weapon supplies.\nIsrael conducted airstrikes on Yemen, targeting fuel depots in the port city of Al Hudaydah, which is controlled by the Houthis.\n(@NOELreports) July 20, 2024The Israeli military reported that the airstrikes targeted Houthi military positions in the port area as a response to numerous attacks against Israel over recent months.\nThe Houthis had previously claimed that Israeli airstrikes on oil facilities resulted in casualties, though specifics were not detailed.\nDespite strikes by US and British air forces against Houthi targets, the attacks on maritime vessels have continued.", "location": "Al Hudaydah", "classification": "security", "score": 0.9876060087320735, "event_breakdown": "Event: Israel conducted airstrikes on Yemen, targeting fuel depots in the port city of Al Hudaydah\nTarget: Houthi military positions in the port area\nDate: July 20, 2024\n\nEvent: Israel conducted airstrikes on an oil facility in Yemen, targeting Houthi military positions in the port area of Al Hudaydah\nDate: July 20, 2024"}, {"id": "12b2c6c3-7d82-4470-8956-0b5c4b6e0e3a", "title": "Twelve Years On : Two Perpetrators Still at Large in Burgas Airport Bombing - Novinite . com", "date": "2024-07-21 14:30", "url": "https://www.novinite.com/articles/227268/Twelve+Years+On:+Two+Perpetrators+Still+at+Large+in+Burgas+Airport+Bombing", "domain": "novinite.com", "domain_classification": "Unknown", "message": "Twelve years after the attack at Burgas Airport, two of the perpetrators remain at large.\nOn July 18, 2012, a bus transporting Israeli tourists was bombed, resulting in nearly 40 injuries and six fatalities, including a Bulgarian bus driver.\nThe attackThe Burgas bus bombing on July 18, 2012, was a devastating terrorist attack that took place at the Burgas Airport in Bulgaria.\nEvery year, memorial services are held to honor the victims of the Burgas attack.\nThe attack remains a stark reminder of the persistent threat of international terrorism and the need for continued vigilance.", "location": "BURGAS", "classification": "security", "score": 0.9587974620216982, "event_breakdown": "Bombing at Burgas Airport\nOn July 18, 2012, a bus transporting Israeli tourists was bombed at Burgas Airport in Bulgaria. Nearly 40 people were injured and six were killed in the attack."}, {"id": "817d4eff-51c4-4f09-9c5f-e0fa30e57a58", "title": "Israel faces retaliations after strikes on Houthi , Hezbollah targets - Xinhua", "date": "2024-07-21 09:15", "url": "https://english.news.cn/20240721/4e42dd7fb6fe496e9106d8c5f5c48ed9/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "SANAA/JERUSALEM/BEIRUT, July 21 (Xinhua) -- Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched airstrikes on different areas in Yemen and Lebanon on Saturday.\nHOUTHI VOWS RETALIATIONThe Houthi group on Saturday vowed to retaliate against Israeli air strikes that destroyed oil storage and electric facilities, wounding nearly 80 people, in the Houthi-held Red Sea port city of Hodeidah.\n\"We will not hesitate to hit vital targets in Israel,\" Houthi military spokesman Yahya Sarea said, reiterating that Tel Aviv will not remain a safe area.\nThe statement came after Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\"\nSince March 2015, Saudi Arabia has been leading an Arab military coalition to support the Yemeni government forces in confronting the Houthi group.", "location": "Yemen", "classification": "security", "score": 0.8919496748608344, "event_breakdown": "Location: Hodeidah, Yemen\nEvent: Yemen's Houthi group vowed to \"hit vital targets in Israel\" after Israeli airstrikes destroyed oil storage and electric facilities wounding nearly 80 people in the Houthi-held Red Sea port city of Hodeidah.\n\nLocation: Lebanon\nEvent: Hezbollah retaliated with rockets after Israel had launched airstrikes on different areas in Yemen and Lebanon on Saturday.\n\nLocation: Yemen\nEvent: Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\""}, {"id": "044aca5f-daf9-40db-9134-3adf00ab59e0", "title": "Drone strike on Tel Aviv shows significant progress of Resistance Axis : NYT", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Drone strike on Tel Aviv shows significant progress of Resistance Axis: NYTIRNA - Islamic Republic News AgencyJul 20, 2024Tehran, IRNA -- The Yemeni armed forces' drone strike on Tel Aviv shows the significant progress of the Axis of Resistance in the production and use of military and missile equipment, according to the New York Times.\nIn a report about the attack, the New York Times quoted military experts as saying the drone that attacked Tel Aviv appears to be a different variant of Samad-3.\nIt was painted darker to evade Israeli air defenses and equipped with a larger fuel tank and engine to give it the range to reach Tel Aviv, the report added,On Friday, a few hours after the drone attack, Israeli military spokesman Daniel Hagari confirmed that the attack on Tel Aviv was carried out by a \"Samad 3\" drone from Yemen.\nHagari said that the army's assessments show that the drone was fired from Yemen and reached Tel Aviv from the sea.\nThe Yemeni armed forces, claiming responsibility for this attack, announced that Tel Aviv is now unsafe for the Zionists.", "location": "Tel Aviv", "classification": "security", "score": 0.7195662160085824, "event_breakdown": "Location: Tel Aviv, Israel\nTarget event: Yemeni armed forces' drone strike on Tel Aviv\nThe Yemeni armed forces' drone strike on Tel Aviv shows the significant progress of the Axis of Resistance in the production and use of military and missile equipment, according to the New York Times."}, {"id": "150d5ddc-e1e6-4f2b-9855-f2448d56298d", "title": "Drone strike hits commercial ship off Yemen coast", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Drone strike hits commercial ship off Yemen coastIran Press TVSaturday, 20 July 2024 2:46 PMA commercial vessel has reportedly come under attack off the Yemen coast, as the country's armed forces continue attacks in retaliation for the regime's genocidal war on Gaza.\nBritain's maritime safety agency, UKMTO, said the attack was carried out 64 nautical miles northwest of Yemen's Mokha, near the strategic Bab el-Mandeb Strait on Saturday.\nThe agency went on to say that the vessel was hit twice by drones, adding that the ship continued its voyage despite sustaining damage, without identifying it.\nAn unmanned surface vessel also exploded near the vessel in the second attack, the agency said, with both the crew and vessel being safe.\nUKMTO also stated that the vessel later reported a missile \"splashing in close proximity,\" which appears to have been a failed missile strike.", "location": "Yemen", "classification": "security", "score": 0.8247798897695329, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nNew event: The commercial vessel has been attacked off the Yemen coast 64 nautical miles northwest of Yemen's Mokha, near the strategic Bab el-Mandeb Strait on Saturday, according to Britain's maritime organization, UKMTO, on Saturday. The agency said the vessel was hit twice by drones and also that a missile \"splashing in close proximity\" was reported by the targeted vessel."}, {"id": "22ccb75a-de21-42ec-95bb-047d7e280649", "title": "Yemen Houthis say they fired missiles at Israel Eilat", "date": "2024-07-21 12:15", "url": "https://www.marketscreener.com/news/latest/Yemen-s-Houthis-say-they-fired-missiles-at-Israel-s-Eilat-47429691/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "\"The Yemeni armed forces also confirm that the response to the Israeli aggression on our country is inevitable and will be great and mighty, Allah willing.\"\nIsrael said earlier on the same day that its air defenses intercepted a surface-to-surface missile fired from Yemen.\nIsraeli fighter jets struck Houthi military targets near Yemen's Hodeidah port on Saturday, (July 20) killing at least three people and wounding 87, a day after a drone launched by the Iranian-backed group hit Israeli economic hub Tel Aviv.\nThe Houthis' Supreme Political Council said there would be an \"effective response\" to the strikes.\nHouthi military spokesperson Yahya Saree said the Houthis \"will not hesitate to strike vital targets of the Israeli enemy.\"", "location": "Yemen", "classification": "security", "score": 0.9332225612882553, "event_breakdown": "Israeli strikes on Houthi military targets near Yemen's Hodeidah port on July 20.\nHouthis have threatened an effective response to the strikes."}, {"id": "64de2478-a2e4-464a-88b2-66b13273116f", "title": "Israel strikes Gaza , Yemen , Lebanon foes after attacks", "date": "2024-07-21 12:15", "url": "https://www.digitaljournal.com/world/israel-strikes-gaza-yemen-lebanon-foes-after-attacks/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Detailing the first strikes claimed by Israel in Yemen, Gallant warned of further operations if the Huthis “dare to attack us” after a rebel drone strike killed one in Tel Aviv on Friday.\nThe Gaza war was triggered by Hamas’s October 7 attack on southern Israel, which resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on Israeli figures.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.\nThe war has also unleashed hunger and health crises in Gaza, with Israel and the United Nations trading blame for vital aid supplies failing to reach those in need.\nWHO spokesman Christian Lindmeier said Friday the agency believes many more diseases are “spreading out of control” inside Gaza.", "location": "Gaza", "classification": "security", "score": 0.6557976351486434, "event_breakdown": "Israel targets rockets into Gaza Strip and warns of further conflict | Saudi Arabia and Iran tensions rise | Houthi drone attacks Israel | Israel-Gaza conflict war aftermath | WHO's fears of diseases spreading out of control in Gaza | 251 hostages seized in Gaza"}, {"id": "b5a4f7af-6c31-4e7f-b5a7-6d56d5a5808d", "title": "Zelensky calls for long - range weapons after drone attack on Kyiv", "date": "2024-07-21 14:15", "url": "https://www.theglobeandmail.com/world/article-zelensky-calls-for-long-range-weapons-after-drone-attack-on-kyiv/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Ukraine needs long-range weapons to protect its cities and troops on the front line from Russian bombs and drones, Ukrainian President Volodymyr Zelensky said on Sunday after a massive overnight drone and missile attack.\nRussia launched its fifth drone attack on Kyiv in two weeks overnight, with Ukraine’s air defence systems destroying all the air weapons before they reached the capital, Ukraine’s military said.\nUkraine’s air force said on Telegram that its air defence systems destroyed 35 of the 39 drones and two cruise missiles that Russia had launched overnight.\nHe said it was necessary to destroy Russian bombers at Russian air bases to protect Ukraine from air raids.\nRussia launched three Iskander ballistic missiles, Ukraine’s air force said, without saying what happened to them.", "location": "Kyiv", "classification": "security", "score": 0.5564768615979953, "event_breakdown": "Russian missiles hit an oil refinery in the Ukrainian city of Kremenchuk on Friday night, causing more supply uncertainty in the What happened at Ukraine. Russia has pounded Ukrainian cities, towns and villages mercilessly as the invasion ordered by President Vladimir Putin enters its fourth month with no end in sight. Kremenchuk, an industrial center 170 kilometers (110 miles) southeast of Kyiv, had been struck frequently during the war, but the Russian attack came as Ukr"}, {"id": "e5ec533d-426e-4131-8170-576a07e109b7", "title": "Israel strikes Gaza , Yemen , Lebanon foes after attacks", "date": "2024-07-21 10:30", "url": "https://www.al-monitor.com/originals/2024/07/israel-strikes-gaza-yemen-lebanon-foes-after-attacks", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "July 21, 2024 — Hodeida (Yemen) (AFP)Yemen's Huthi rebels promised a \"huge\" retaliation against Israel on Sunday following a deadly strike on the port of Hodeida, as violence sparked by the Gaza war gripped the region.\nIsrael bombed the Palestinian territory, Lebanon and Yemen in quick succession this week in response to attacks from Iran-backed militant groups.\nOn Sunday, Huthi military spokesperson Yahya Saree said the rebel's \"response to the Israeli aggression against our country is inevitably coming and will be huge.\"\nFollowing the strikes, the Israeli military said on Sunday it had intercepted a missile fired from Yemen towards the Red Sea resort town of Eilat.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.", "location": "NULL", "classification": "security", "score": 0.8977832051678241, "event_breakdown": "Yemen July 21, 2024 - Huthi rebels in Yemen promised a \"huge\" retaliation against Israel following a deadly strike on the port of Hodeida, as..."}, {"id": "23ec1145-99c9-4bc8-952a-6956f9bbda48", "title": "Zelenskiy calls for long - range weapons after drone attack on Kyiv", "date": "2024-07-21 14:00", "url": "https://www.thestar.com.my/news/world/2024/07/21/zelenskiy-calls-for-long-range-weapons-after-drone-attack-on-kyiv", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Ukraine needs long-range weapons to protect its cities and troops on the frontline from Russian bombs and drones, Ukrainian President Volodymyr Zelenskiy said on Sunday after a massive overnight drone and missile attack.\nRussia launched its fifth drone attack on Kyiv in two weeks overnight, with Ukraine's air defence systems destroying all the air weapons before they reached the capital, Ukraine's military said.\nUkraine's air force said on Telegram that its air defence systems destroyed 35 of the 39 drones and two cruise missiles that Russia had launched overnight.\nHe said it was necessary to destroy Russian bombers at Russian air bases to protect Ukraine from air raids.\nRussia launched three Iskander ballistic missiles, Ukraine's air force said, without saying what happened to them.", "location": "KYIV", "classification": "security", "score": 0.518770676506545, "event_breakdown": "From April 202 \n* Russian air force flies 6 sorties around Kyiv and Chernihiv direction\n* Russia attempting to carry out next stage of advance on Odesa"}, {"id": "8b5c5532-bea9-47b9-a43e-8fae4b1948d3", "title": "Iraqi resistance group warns Israel of  growing cost of Gaza war", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-presstv10.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iraqi resistance group warns Israel of 'growing costs' of Gaza warIran Press TVSaturday, 20 July 2024 6:35 AMThe leader of Iraq's Asa'ib Ahl al-Haq anti-terror resistance group has warned Israel of \"growing costs\" of its continuing ground and aerial invasion of the besieged Gaza Strip.\nHe praised all forces of the Axis of Resistance, who are fighting off the Israeli war on Gaza for more than nine months.\nHe said Israel's delusion of grandeur has been shattered and that the continuation of Gaza atrocities will incur dramatic losses on the \"Zionist enemy\".\nThe Islamic Resistance in Iraq has been launching attacks on Israeli targets ever since Tel Aviv launched its war on Gaza last October.\nThe resistance has been also hitting American military bases in Iraq and neighboring Syria in retaliation for Washington's support for the Israeli war.", "location": "GAZA", "classification": "security", "score": 0.9568247597534439, "event_breakdown": "Israeli Aggression against Gaza and neighboring countries"}, {"id": "6de102ce-657c-4ee2-81ef-65fa89141208", "title": "Top NATO general says that Ukraine has outstanding conflict plan", "date": "2024-07-21 12:30", "url": "https://menafn.com/1108463950/Top-NATO-general-says-that-Ukraine-has-outstanding-conflict-plan", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) General Christopher Cavoli, the chief of NATO’s European Command, has lauded Ukraine’s military strategy despite the country’s ongoing losses on the frontlines.\nCavoli explained that modern warfare often involves either a swift victory or a prolonged, unpredictable conflict, which is the current reality in Ukraine.\nHe emphasized that the key to success lies in a nation’s ability to generate and deploy force quickly, a strategy Ukraine has been pursuing effectively in recent months.\nAccording to Cavoli, Ukraine’s strategy is strong and it is now a matter of continuing its execution.\nHe praised Kiev’s recent mobilization efforts and noted that Western weapon deliveries are progressing well.", "location": "war in Ukraine", "classification": "security", "score": 0.6521438830344501, "event_breakdown": "NATO chief lauds Ukraine's military strategy\n\nNATO's European Command chief, General Christopher Cavoli, has praised Ukraine's military strategy despite ongoing losses on the frontlines."}, {"id": "714aad12-bb38-4c39-82c3-a884abeb70bf", "title": "South Korea responds to North trash balloons with loudspeaker broadcasts", "date": "2024-07-21 10:15", "url": "https://www.nbcnews.com/news/world/korea-trash-balloons-loudspeaker-broadcasts-rcna162883", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "SEOUL — North Korea on Sunday floated balloons carrying trash toward South Korea, South Korea’s military said, declaring it would respond with “full-scale” loudspeaker broadcasts.\nActivists and defectors in South Korea have for years sent their own balloons carrying propaganda leaflets and other items into North Korea, angering Pyongyang.\nEarlier this week, South Korea’s military decided to resume its round-the-clock loudspeaker broadcast campaign targeting North Korea in response to what it called the despicable launch of balloons by Pyongyang carrying trash across the border.\nSince May, North Korea has been floating thousands of balloons with bags of trash attached to them, which have become a new source of tension between the two Koreas.\nBlaring propaganda, world news and K-pop music, South Korea’s broadcasts are considered by military officials and activists as an effective form of psychological warfare.", "location": "Seoul", "classification": "security", "score": 0.4921874962709234, "event_breakdown": "North Korea floats balloons carrying trash toward South Korea (specific location not provided), In response, South Korea says it will respond with \"full-scale\" loudspeaker broadcasts (specific location not provided)."}, {"id": "40de3a58-01fb-4f2a-bc94-533b5596753e", "title": "Yemen fired over 200 drones , missiles toward Israel : Report", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-irna10.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Yemen fired over 200 drones, missiles toward Israel: ReportIRNA - Islamic Republic News AgencyJul 20, 2024Tehran, IRNA -- The Zionist newspaper Yedioth Aharonot revealed Friday night that the Zionist regime's army estimated Yemeni Armed Forces have fired around 200 drones and missiles towards the occupied territories since the onset of the war on the Gaza Strip.\nYedioth Aharonot reported that the Israeli regime's estimate shows that the drone that targeted Tel Aviv traveled 2,000 kilometers in different directions in order to mislead the regime's radars.\nOn Friday morning, the Yemeni Armed Forces attacked the occupied city of Tel Aviv with a new combat drone named \"Jaffa\", killing one Zionist and injuring several others.\nAfter penetrating Tel Aviv's airspace, the stealth drone targeted a building near the US embassy in that area.\n\"Jaffa\" is the original Arabic name for Tel Aviv before the Zionist occupation in 1948.", "location": "Tel Aviv", "classification": "security", "score": 0.9843935771486798, "event_breakdown": "The Yemeni Armed Forces fired over 200 drones and missiles toward Israel since the war on Gaza started. A new drone, the \"Jaffa\", killed one Zionist in Tel Aviv and targeted a building near the US embassy. The Israeli military estimated the drones flew 2,000 kilometers in different directions to deceive the radar systems."}, {"id": "964ae362-5f84-449d-ac69-cd5759c1ae1a", "title": "Living History Programs Highlight 163rd Anniversary of First Manassas", "date": "2024-07-21 14:15", "url": "https://www.potomaclocal.com/2024/07/21/living-history-programs-highlight-163rd-anniversary-of-first-manassas/", "domain": "potomaclocal.com", "domain_classification": "Unknown", "message": "Several people gathered at the Manassas National Battlefield yesterday, July 20, 2024, to commemorate the 163rd anniversary of the Battle of First Manassas.\nActivities included firing demonstrations, Civil War field music, interactive tactile exhibits, kids’ crafts, junior ranger activities, cooking demonstrations, food samples, and other living history programs.\nAdditional activities included junior ranger and kids activities and cannon firing demonstrations.\nEvent highlights featured Civil War field music demonstrations, musket and cannon firing demonstrations with tactical maneuvers, Civil War camp cooking demonstrations with food samples, and living historians in uniforms worn at the Battle of First Manassas.\nRanger-led walking tours and various kids activities were also part of the event.", "location": "Manassas National Battlefield", "classification": "security", "score": 0.4299897933747817, "event_breakdown": "[\n{\n\"id\": 0,\n\"text\": \"Several people gathered at the Manassas National Battlefield yesterday, July 20, 2024, to commemorate the 163rd anniversary of the Battle of First Manassas.\"\n}\n]"}, {"id": "7df4dbc5-fbec-468b-87e9-4c2258069859", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 14:30", "url": "https://www.cnn.com/2024/07/21/middleeast/israel-strikes-houthi-rebels-explainer-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nSoon after the Israeli attack, the Houthis said they launched a fresh barrage of missiles towards Israel, promising a response that will be “huge and great.”Here’s what we know.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nA tipping point for Israel appears to have come on Friday, when a drone attack was launched on Tel Aviv, killing one Israeli citizen and injuring several others.\nOded Balilty/APThe attack marked the first time Tel Aviv, Israel’s commercial center, has been struck by a drone in an attack claimed by the Houthis.", "location": ".\nYEMEN", "classification": "security", "score": 0.8609545453063528, "event_breakdown": "Location: Tel Aviv\nTarget: A deadly drone attack by Houthi rebels on Tel Aviv."}, {"id": "4fee5504-35fa-434a-a5ce-f21a6c71380e", "title": "Israeli Forces continue to operate in Gaza from  Ground , Air and Sea  ", "date": "2024-07-21 10:30", "url": "https://news.webindia123.com/news/Articles/World/20240721/4217213.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "In one example, during an activity carried out by the combat team fighters of the IDF's Givati Infantry Brigade in the Rafah area (southern Gaza on the border with Egypt), an IDF surveillance drone detected an armed terrorist squad moving towards them.\nThe forces responded \"quickly\" and eliminated the squad, the IDF reported.\nAlso, the forces located and destroyed missiles that were ready for launch at Israeli towns.\nAt the same time, forces from the IDF's 401st Armored Brigade combat team located and destroyed shafts and underground terror infrastructures in the area of Tal as Sultan located near Rafah.\nIn addition, in the center of the Gaza Strip, forces from the IDF's Alexandroni Infantry Brigade raided a number of military buildings where various weapons were located.", "location": "Rafah, southern Gaza on the border with Egypt.", "classification": "security", "score": 0.9906104243940287, "event_breakdown": "IDF (Israeli Defense Forces) Givati Infantry Brigade detects and eliminates armed terrorist squad in the Rafah area (southern Gaza on the border with Egypt). IDF 401st Armored Brigade destroys missiles ready for launch at Israeli towns and locates and destroys shafts and underground terror infrastructures in the Tal as Sultan near Rafah area. IDF Alexandroni Infantry Brigade raids military buildings in the center of Gaza Strip."}, {"id": "ab7f1d28-16c7-4b50-8165-2e8bac9c516a", "title": "Why has Adidas pulled the Bella Hadid Olympics advert ? ", "date": "2024-07-21 14:30", "url": "https://metro.co.uk/2024/07/21/adidas-pulled-bella-hadid-olympics-advert-21267402/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "The company is ‘revising’ its campaign with Bella Hadid after backlash (Picture: Boyer David/Abaca/Rex/Shutterstock)An Adidas campaign that featured Bella Hadid has been pulled after being labelled ‘sick’ and an ‘egregious error’.\nAfter the Palestinian group Black September infiltrated the Olympic village, two members of the Israeli Olympics team were murdered and nine were kidnapped.\nWhy has Adidas pulled the Bella Hadid Olympics advert?\nWe call on Adidas to address this egregious error.’Has Bella Hadid responded to the Adidas campaign being dropped?\nMetro.co.uk has contacted representatives of Bella Hadid and Adidas for comment.", "location": "Tel Aviv", "classification": "security", "score": 0.8841592794334356, "event_breakdown": "Adidas is revising a campaign with Bella Hadid after backlash (Picture: WENN)\nAdidas is ‘revising’ a campaign with Bella Hadid after backlash (Picture: Instagram/bellahadid)\nAn Adidas campaign that featured Bella Hadid has been pulled after being called ‘sick’ and an ‘egregious error’.\nAfter the Palestinian group Black September infiltrated the Olympic village, two members of the Israeli Olympics team were murdered nine were kidnapped."}, {"id": "fa9b3709-e9d0-4830-8fb0-09a422e701bd", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:30", "url": "https://www.houstonpublicmedia.org/npr/2024/07/21/g-s1-12500/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "An Israeli airstrike ignited a huge fire at an oil storage facility at Yemen's Red Sea port of Hodeidah on Saturday.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli military spokesman Daniel Hagari called it \"one of the longest ever conducted by the Israeli air force.\"\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.8143072302473667, "event_breakdown": "Israeli Airstrike Ignites Fire at Yemen's Red Sea Port of Hodeidah"}, {"id": "4e32702f-b3c9-44f4-991f-cb6c5d44cbe9", "title": "Israel airstrike on Yemen a clear message to Tehran", "date": "2024-07-21 16:45", "url": "https://news.webindia123.com/news/Articles/World/20240721/4217318.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Tel Aviv [Israel], July 21 (ANI/TPS): Israel's airstrike on Yemen's Red Sea port of Al Hudaydah marks a significant shift in Jerusalem's response to the more than 200 missiles and drones launched by the Houthis since October.\nThe Houthis responded swiftly, albeit unsuccessfully, launching a surface-to-surface missile toward Tel Aviv -- which was intercepted near Eilat.\nThe strike was in retaliation for a drone attack on Tel Aviv on Friday, which killed an Israeli man and injured seven others.\nThe Houthi drone took an unusual path from Yemen over Egyptian airspace before circling back over the Mediterranean towards Tel Aviv.\nThe Houthis vowed in early December to target any Israel-bound ship in the Red Sea, regardless of its ownership.", "location": "Tel Aviv", "classification": "security", "score": 0.8796534996387786, "event_breakdown": "Tel Aviv [Israel], July 21 (ANI/TPS): Israel's airstrike on Yemen's Red Sea port of Al Hudaydah marks a significant shift in Jerusalem's response to the more than 200 missiles and drones launched by the Houthis since October. The Houthis responded swiftly, albeit unsuccessfully, launching a surface-to-surface missile toward Tel Aviv -- which was intercepted near Eilat."}, {"id": "97bb58dd-0271-4619-8950-37fffc948f10", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://knpr.org/npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "-\nHodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli jets attacked Hodeidah port in Yemen - Iran has continuously been delivering arms to its Houthi proxies, who use them to attack Arab states and Israel. Prior to the strike, Israeli military operations had stopped most missiles using US naval forces."}, {"id": "851164da-a43b-4c53-98bd-69393da7a353", "title": "Confirmed : Gaza Hamas # 2 , Mohammed Deif is Dead | The Jewish Press - JewishPress . com | Hana Levi Julian | 15 Tammuz 5784 – Sunday , July 21 , 2024", "date": "2024-07-21 14:45", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/confirmed-gazas-hamas-2-mohammed-deif-is-dead/2024/07/21/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF Spokesperson's UnitAfter seven failed assassination attempts, the Israel Defense Forces have confirmed that Mohammed Deif, head of Gaza’s Hamas military wing — Al Qassam — has been eliminated, killed in an Israeli airstrike eight days ago.\nDeif was the Number 2 leader in Gaza’s Hamas terrorist organization, second only to the group’s leader, Yahya Sinwar.\nPrime Minister Benjamin Netanyahu said following the attack that it could not yet be confirmed “with certainty” that Deif was eliminated.\nSalameh was one of the closest associates of Mohammed Deif, the chief of the Al-Qassam Hamas military wing, and was one of the masterminds of the October 7th massacre.\nFor weeks, Israeli intelligence watched a villa within the city, waiting for the opportunity to hit Deif, three senior Israeli defense officials told The New York Times.", "location": "Gaza", "classification": "security", "score": 0.9597306925259893, "event_breakdown": "IDF confirms Mohammed Deif, head of Gaza’s Hamas military wing – Al Qassam has been eliminated in an Israeli airstrike on Gaza on May 12, 2022.Hamas deputy leader Hassan Salameh and at least four other people are killed in an Israeli airstrike on a car in Gaza City on May 5, 2022"}, {"id": "f024e21d-b4a7-4db5-b8dd-7ce5a71243fc", "title": "Israel At War - LIVE UPDATES July 21 , 2024", "date": "2024-07-21 17:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-hezbollah-rocket-hits-school-in-northern-israel-live-blog", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Israel - Hamas War day 289: Northern Israeli towns suffered several rocket attacks, with a school and a sports ground hit by a rocket in the kibbutz of Dafna, in the Upper Galilee region.\nHezbollah took responsibility for the attacks, after dozens of projectiles targeted northern Israel.\nSirens also sounded in the morning in Eilat, Israel's southernmost point, a day after Israeli warplanes targeted the Yemeni port of Hodeidah in response to a deadly drone strike that hit Tel Aviv early on Friday.\nMeanwhile, ultra-Orthodox men are awaiting draft orders from the IDF as the military seeks to reinforce its ranks with yeshiva students, who have been exempt from military service since the founding of the State of Israel.\nTo read more updates from Saturday, CLICK HEREFor more stories and in-depth analysis on the Israel-Hamas war", "location": "Northern Israel", "classification": "security", "score": 0.9176338973819681, "event_breakdown": "Several rockets targeted northern Israeli towns, with a school and a sports ground hit in the kibbutz of Dafna, in the Upper Galilee region.\nHezbollah claimed responsibility for the attacks, after dozens of projectiles targeted northern Israel.\nSirens also sounded in Eilat, Israel's southernmost point, a day after Israeli warplanes targeted the Yemeni port of Hodeidah in response to a deadly drone strike that hit Tel Aviv early on Friday.\nUltra-Orthodox men are awaiting draft orders from the IDF as the military seeks to reinforce its ranks with yeshiva students, who have been exempt from military service since the founding of the State of Israel."}, {"id": "2d0a6876-4e8d-4740-ab93-2cb354a5f604", "title": "Houthi Leader Calls For Pressure , Deterrence Against  Israeli Enemy  ", "date": "2024-07-21 17:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-houthi-leader-calls-for-pressure-deterrence-against-israeli-enemy", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "The leader of Ansar Allah, more widely-known as the Houthis, said that \"more pressure and deterrence must be exerted on the Israeli enemy now,\" speaking to the Hezbollah-affiliated Al-Mayadeen on Thursday.\n\"The Israeli enemy launched a direct attack on oil and electricity company tanks in Hodeida,\" he said.\nThe purpose of the attack is to create a picture of victory for the Israeli people and to restore deterrence.\"\nDespite this, he vowed that \"the enemy will not restore deterrence against the parties supporting Gaza.\"\nThe Israeli strike, after nine months of aggression, was conducted in response to a single drone that exploded in Tel Aviv last Friday morning, killing a civilian.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.6536516066965222, "event_breakdown": "Israeli attack on oil and electricity company tanks in Hodeida, Yemen"}, {"id": "d9019d84-7c82-40b6-a7d2-deb115603946", "title": "Israel intercepts missile fired from Yemen", "date": "2024-07-21 17:15", "url": "https://www.marketscreener.com/news/latest/Israel-intercepts-missile-fired-from-Yemen-47429872/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: :: Israel says its air defenses intercepted a surface-to-surface missile fired from Yemen:: Alon Weiss:: Released July 21, 2024:: Near Eilat, Israel:: Reuters was not able to independently verify the date when the video was taken:: but official reports confirm there was a missile interception in the areaIn a video obtained by Reuters a white streak is seen across the sky.\nReuters was able to confirm the location by the shape of the mountains seen in the background which matched topography mapping of the area.\nReuters was not able to independently verify the date when the video was taken but official reports confirm there was a missile interception in the area.\nThe Israeli military said its Arrow 3 missile defense system had shot down the projectile before it crossed into Israeli territory.\nBefore the interception, air raid sirens had sounded in Eilat, sending residents running for shelter.", "location": "Near Eilat, Israel", "classification": "security", "score": 0.6258028678834784, "event_breakdown": "Event 1: Israel says its air defenses intercepted a surface-to-surface missile fired from Yemen on July 21, 2024. Israel's military confirmed the missile was intercepted near Eilat."}, {"id": "a11de7bc-f476-4140-9a42-4f51db59313e", "title": "Israel Faces Retaliations After Strikes On Houthi , Hezbollah Targets", "date": "2024-07-21 12:30", "url": "https://menafn.com/1108464025/Israel-Faces-Retaliations-After-Strikes-On-Houthi-Hezbollah-Targets", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched on different areas in Yemen and Lebanon.\n\"We will not hesitate to hit vital targets in Israel,\" Houthi military spokesman Yahya Sarea said, reiterating that Tel Aviv will not remain a safe area.\nEarlier in the day, the Israeli military said in a statement that its fighter jets targeted \"military targets\" of the Houthi militia, as a response to \"the hundreds of attacks carried out against the State of Israel in recent months.\"\nThe statement came after Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\"\nSince March 2015, Saudi Arabia has been leading an Arab military coalition to support the Yemeni government forces in confronting the Houthi group.", "location": "Yemen", "classification": "security", "score": 0.9329499493845157, "event_breakdown": "Location: Israel, Lebanon, Yemen\nReported events:\n- On Tuesday, Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched on different areas in Yemen and Lebanon."}, {"id": "32580e8e-be20-49e0-bc31-2e2dd46d2f8c", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:45", "url": "https://www.kbia.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kbia.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ".\nNULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah Port, Yemen"}, {"id": "9fefd154-b76e-4136-bb7c-fed4c449f8d7", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:45", "url": "https://www.wvasfm.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wvasfm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "NULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel conducted a retaliatory airstrike on Hodeidah port in Yemen on Sunday to target the ongoing delivery of weapons from Iran to the Houthi militia. The Israeli planes traveled more than 1,000 miles to reach the port. Israeli air defenses and the U.S. Navy have shot down the missiles."}, {"id": "0b2aaf8a-76aa-42b2-935c-e7ccf19103c8", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:45", "url": "https://www.wbaa.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wbaa.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah port in Yemen."}, {"id": "f7a826a2-dcae-461b-9262-41c34b1d8cbc", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:45", "url": "https://www.kasu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kasu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel carries out retaliatory airstrike on Hodeidah port in Yemen to prevent ongoing weapons delivery to Houthi militia. Israeli planes traveled more than 1,000 miles to reach Hodeidah port."}, {"id": "4dca5da0-2cff-4cae-9404-e40b2d2aa9ba", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:45", "url": "https://www.wxxinews.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wxxinews.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Long-distance airstrike targeting Hodeidah port in Yemen\nIn a recent event, Israel conducted a long-distance airstrike on the Hodeidah port in Yemen to prevent the smuggling of weapons to Houthi rebels by Iran. This operation shows the remarkable range of the IDF."}, {"id": "97692d22-a468-4a5c-bd3b-32ebd076e3f4", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:30", "url": "https://www.delawarepublic.org/npr-headlines/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "delawarepublic.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ".\nThe most specific location mentioned in the text is Hodeidah port in Yemen.", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel launches airstrikes on Hodeidah port in Yemen\nHodeidah, Yemen."}, {"id": "9cd26a65-2867-4a9e-b293-6bb5b9e23859", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:30", "url": "https://www.wlrn.org/npr-breaking-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wlrn.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Long-distance operation: On Sunday, Israel said it carried out a retaliatory airstrike on a key port in Yemen.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot down missiles fired from Yemen at Israel in recent years.\nThe target was Hodeidah port, the entry point for weapons allegedly supplied by Iran."}, {"id": "5f487f4c-8626-4cba-90eb-1986960f0ab0", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:30", "url": "https://www.wyomingpublicmedia.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wyomingpublicmedia.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Long-Distance Target Practice: Israel Claims Airstrike in Yemen\nIsrael has carried out a retaliatory airstrike on a key port in Yemen, targeting weapons being readied for delivery to the Houthi militia by Iran. The Israeli strike involved long-distance operations, with Israeli planes traveling more than 1,000 miles to reach the Hodeidah port. The country's and U.S. naval forces in the Red Sea also shot down Houthi drones in almost all cases before they reached Israeli air space."}, {"id": "aca09872-0fea-45dd-a062-90ea11805437", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:30", "url": "https://www.klcc.org/npr-world-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "klcc.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah port (Yemen) - targeting by Israel"}, {"id": "bf2965ad-5825-4694-8295-76b6fb20c9c8", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:15", "url": "https://www.apr.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "apr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen - April 5, 2015 - Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran. These actions can put at risk the security of the International community."}, {"id": "2128cd07-abdf-4c0c-b2f2-353f71771421", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:15", "url": "https://www.krvs.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "krvs.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "NULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel carried out a retaliatory airstrike on a key port in Yemen on Sunday in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran. The Israeli Defense Forces (IDF) said it targeted Hodeidah port, which is the entry point for weapons being supplied by Iran to the Houthis. The IDF's Twitter account said that Israel's operation \"led to the destruction of a significant portion of the Iranian port facility.\" Israeli military planes traveled more than 1,000 miles to reach Hodeidah port. Israel carried out the retaliatory strike after the Houthis fired a barrage of missiles and drones at Saudi Arabia on Thursday. The airstrike destroyed a large portion of Iran's port facility."}, {"id": "745abc4d-f853-4499-aa5a-4cce1f5887c4", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:45", "url": "https://www.wknofm.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wknofm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "The main location where the main event takes place is Hodeidah port in Yemen.", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel conducted airstrikes on Hodeidah Port in Yemen on Sunday to prevent the ongoing delivery of weapons to the Houthi militia by Iran."}, {"id": "0a0d8d9f-afe7-4349-b158-80ff40f4b5a7", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 17:00", "url": "https://www.iowapublicradio.org/news-from-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "iowapublicradio.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nNone.", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen"}, {"id": "842feb2c-6483-4117-8273-d4f964b04446", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.kzyx.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kzyx.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah port", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "The Israeli strike was conducted on Sunday, December 2nd. The target was the Hodeidah port in Yemen, where weapons were being stored and then shipped to the Iranian-backed Houthis. The Israeli air force dropped a bomb on the warehouse, which completely destroyed it and grounded the weapons convoy. The Iranians have not commented, and it is not clear if they were the targets.\nIran has repeatedly threatened Israel, and the Yemeni port of Hodeidah, on the Red Sea, is a major point of transfer for Iranian weapons. In recent years, Israel has carried out hundreds of attacks in the area, but this is the first to acknowledge a strike in Yemen.\nAnother strike took place in Hodeidah on Monday, December 3rd, that destroyed three warehouses. On Tuesday, December 4th, Israel bombed a mosque in Sanaa, Yemen. The stadium was home to the team of Yemec, the Yemen national football team.\n3/ Attack on the Baghdad International airport\n4/ Saudi Arabian Air Force strike on a ballistic missile launch site near Saada in Yemen\n5/ Attack on a military site in the Yemeni capital of Sanaa\n6/ Houthi drone attacks on Abu Dhabi International Airport\n7/ The International Coalition attack fight 1/ Attack on the Baghdad International Airport\n2/ Saudi Arabian Air Force strike on a ballistic missile launch site near Saada in Yemen\n3/ Attack on a military site in the Yemeni capital of Sanaa\n4/ Houthi drone attacks on Abu Dhabi International Airport\n5/ The International Coalition attacks"}, {"id": "5e064b45-e7d6-4c66-9c8a-eb6b7b5c9f7a", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.kanw.com/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kanw.com", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nHodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel has carried out a retaliatory airstrike on a key port in Yemen on Sunday, April 5, in a desperate bid to halt the ongoing delivery of weapons the Houthis are currently receiving directly from Iran. The Iranian government has been providing constant weapons supplies to its Houthi proxy, which is responsible for a thousand of missiles the attacker has launched throughout the Middle East in the past year, according to the Israeli Prime Minister Netanyahu. Israeli planes have been forced to travel more than a thousand miles to reach the Hodeidah port about 150 miles west of the Strait of Bab el-Mandab, where about 4 million barrels of oil are shipped every day. The Israeli confirmed the attack. Since the distance of Israelis is very far away, it was said it was impossible that the warplanes came from the Israelis because it takes more than 30 hours to reach Yemen. Which shows that Israelis used this precise, accurate intelligence.\n\nVery accurate push for all incoming events of security news from the News API."}, {"id": "3252f2dc-eab4-4d12-af39-52b21b533858", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.wyso.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wyso.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "The Hodeideh port in Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah Port - January 17, 2022: Israel launched a retaliatory airstrike against the Hodeidah port in Yemen on January 17, 2022. Hodeidah is being used as a main port for weapons being delivered by Iran to Houthi terrorists. Israeli Prime Minister Netanyahu said the retaliatory strike was to stop the flow of weapons and attacks on Israel."}, {"id": "e91e7dbf-4f77-4111-a386-79d14d91aab0", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.kunm.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kunm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said Sunday it carried out a retaliatory airstrike on Hodeidah port in Yemen in an attempt to prevent the ongoing delivery of weapons by the Revolutionary Guards to the Iranian-backed Houthi militia by Iran."}, {"id": "1ccab363-8d2a-4dfc-a7f3-5f7c875808d7", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.upr.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "upr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah Port, Yemen - December 2021: A long-range mission by Israeli planes reached the port located in Yemen, to prevent the transfer of arms to Houthi militias under control of Iran. This mission was carried out in October 30, 2022, and called to destabilize the region."}, {"id": "9e68719b-76b5-4108-bca5-e31cd5f2fa40", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.wcsufm.org/latest-from-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wcsufm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Long Distance Security Event #1 : Israel said it carried out a retaliatory airstrike on a key port in Yemen on Sunday in an attempt to stop the ongoing delivery of weapons to the Houthi militia by Iran.\nEvent #2 : Israeli air defenses and U.S. naval forces in the Red Sea have shot down missiles fired by Houthi forces at Saudi Arabia and the UAE, in almost all cases before they reached Israeli air space."}, {"id": "9ebed0ab-a556-4683-821c-42197aa7def7", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.kwbu.org/latest-from-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kwbu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeida, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said it carried out a retaliatory airstrike on a key port in Yemen on Sunday in an attempt to prevent Iran from supplying its Houthi militia allies with weapons. After the incident, pro-Iranian Yemeni rebels fired a number of rockets at Saudi Arabia, prompting a warning from Riyadh of possibly \"firm\" action."}, {"id": "65aca31f-310a-4b82-bcde-8af7ad88cb7e", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://news.prairiepublic.org/news-from-npr/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "news.prairiepublic.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah port", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Saudi Arabia - Dozens of ballistic missiles and armed drones have been launched from Yemen by the Houthis at Saudi Arabia since 2015.\nIsrael - In the area of YEMEN - Hodeidah - Port of Hodeidah, an airstrike was performed by Israel to prevent Iranian weapon shipments to the Houthi rebels, the area is the starting point for shipments by Iran to its Houthi proxies.\nA long-distance operation was needed as the Israeli planes crossed above the Red Sea to reach the port, some 1000 miles away."}, {"id": "fc1f1d09-452d-48a2-86ab-e10f3f4eac69", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.wemu.org/npr-national-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wemu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel carries out a strike on the Hodeidah port in Yemen to prevent ongoing delivery of weapons to the Houthis by Iran. Israel's defense shoots down missiles, with the help of U.S. naval forces in the Red Sea. Targets can be located on map at Red Sea."}, {"id": "d4c7178d-9727-48e5-847e-c66dfde5aa7d", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:15", "url": "https://www.wesa.fm/national-international-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wesa.fm", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nHodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "1. Israel said it retaliated against Iranian weapons deliveries by bombing the Houthi-controlled Hodeidah port in Yemen.\n2. The Hodeidah port is 1,000 miles from Israel.\n3. Israel's Defense Force said it was responsible for an attack on a cargo ship believed to be carrying Iranian weapons.\n4. Israeli military units and U.S. forces in the Red Sea have shot down drones or missiles launched towards Israel.\n5. Yemen's Houthi rebels, who have allied themselves with Iran, claim to be seeking revenge for an Israeli strike on Hodeidah."}, {"id": "eaf28401-757a-4991-9245-8a12eb44787b", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.knau.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "knau.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel said it retaliated against the Iranian presence in the northeastern part of syria by striking a weapons convoy destined to the shia militias who are supported by iran. According to the channel 2 news report on april 11, the weapons consignment was destroyed."}, {"id": "1a16b6be-ad88-4d1f-bbf6-fec07b817717", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.kedm.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kedm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Yemen's Hodeidah port, targeted by a retaliatory airstrike from Israel for its role in delivering weapons to the Houthi militia."}, {"id": "35eb3ed4-ab95-44d7-8e95-9bc0b3e7c3e6", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.hppr.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "hppr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "HODEIDAH", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Yemen: A long-distance airstrike was launched by Israel on the Hodeidah port in Yemen to prevent the ongoing delivery of weapons to the Houthi militia by Iran."}, {"id": "6092da9b-7cd5-4918-9a7d-65d39e1ff676", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.wprl.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wprl.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Event 1: Israel conducted airstrikes on the Hodeidah port in Yemen on Sunday, targeting the entry point for weapons being supplied by Iran to its Houthi proxies. Air defenses from the U.S. and Israel shot down the weapons before they reached Israel."}, {"id": "3221d445-cb29-429a-ad08-4d69e3576f4f", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.kgou.org/world/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kgou.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ")\nNULL", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "On December 22, 2020, Israeli warplanes launched airstrikes on Hodeidah port, Yemen. Israeli Prime Minister accused Iran of supplying the Houthis, a group rebel, with weapons through these ports, against Israel. The port, which sits on the Red Sea, more than 1000 miles from Israel. The airstrikes were first reported on Sunday. The day Tuesday for the U.S has been shooting down these missiles from Iran with Israeli air and U.S. naval forces in the Red Sea."}, {"id": "3feacf6c-0c28-44a5-af0f-bde270d16c6e", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.wkyufm.org/news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wkyufm.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen"}, {"id": "78e351d5-2375-4c3b-be77-5262d81be4ef", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.wutc.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wutc.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel carries out retaliatory airstrike on Hodeidah port in Yemen, Hodeidah port, Houthi militia, Iran"}, {"id": "ccf33256-8f0b-4e02-8b3e-fe4af274d277", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:30", "url": "https://www.wrvo.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wrvo.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah port, Yemen"}, {"id": "fade21f6-d334-44da-80c3-175b1884af03", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:45", "url": "https://www.wcbe.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wcbe.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ".\nBased on the information provided, Hodeidah port in Yemen is the location where the main event takes place.", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Target Event: Israel carries out a retaliatory airstrike on Hodeidah port in Yemen to prevent ongoing delivery of weapons to the Houthi militia by Iran.\nAdditional Event: Houthis target Israel with long-range missiles."}, {"id": "98905ff1-6a58-4427-9009-4448c2ee2335", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:45", "url": "https://www.kazu.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kazu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah port in Yemen"}, {"id": "d6036f1e-764b-4660-bae4-8b04197ce163", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:45", "url": "https://news.wfsu.org/all-npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "news.wfsu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "1. Israel carried out a retaliatory airstrike on a key port in Yemen: Hodeidah. Hodeidah port was the starting point for weapons that were supplied by Iran to Houthi militants.\n2. The strikes were carried out to prevent the ongoing delivery of weapons to Houthi militants."}, {"id": "cf7b421c-0d16-4177-92ad-e5fb527f3534", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 14:45", "url": "https://www.kenw.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kenw.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah port in Yemen"}, {"id": "c76de6a5-ad23-41e7-8b45-d4763497002c", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:30", "url": "https://www.ijpr.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "ijpr.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen - Iran-backed Houthi rebels were targeted in an airstrike."}, {"id": "f41f0a45-09c0-4f7b-8df5-766d1aaf4603", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:30", "url": "https://www.wbfo.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "wbfo.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah port in Yemen"}, {"id": "2a189128-a3a8-4593-9932-f186880557f3", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:30", "url": "https://www.kuaf.com/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kuaf.com", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah port in Yemen, as it has been the entry point for weapons that are supplied by Iran to its Houthi terrorist proxies. The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others."}, {"id": "8518abbd-26df-4015-a0b7-65ffe7c8bdfd", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:00", "url": "https://www.ksmu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "ksmu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen"}, {"id": "046eb894-6e57-46ec-b492-4a7a4ed41a99", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:15", "url": "https://www.ypradio.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "ypradio.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrike on Hodeidah, Yemen port, attempts to stop Iran from delivering weapons to Houthis"}, {"id": "4a15d15f-fd9c-4eca-a72f-2d5fe0a7a250", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 16:15", "url": "https://www.ksut.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "ksut.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Yemeni government officials confirmed a strike on Hodeidah on Friday evening that triggered \"huge explosions.\" They spoke on condition of anonymity because they were not authorized to brief the media.\n\nThe extent of damage and casualties from the blasts was not immediately clear."}, {"id": "de1ddd83-36b3-4ef5-909a-f54a0053bf60", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:45", "url": "https://radio.wpsu.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "radio.wpsu.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": ".\nBased on the information in the text, the main event takes place in Yemen, specifically in the Hodeidah port", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israel airstrike targets Hodeidah port in Yemen"}, {"id": "740ac832-62ad-46d8-b356-f28215f1ea04", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:45", "url": "https://www.kyuk.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kyuk.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "Yemen", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Israeli airstrikes target Hodeidah port in Yemen, April 4th, 2022"}, {"id": "48303129-fea8-4028-99d0-228b2fd8bbe6", "title": "Israel says airstrike in Yemen will block weapons to Houthi militia", "date": "2024-07-21 15:45", "url": "https://www.kunc.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "domain": "kunc.org", "domain_classification": "Unknown", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "location": "The Hodeidah port in Yemen.", "classification": "security", "score": 0.49840898897812524, "event_breakdown": "Hodeidah, Yemen"}, {"id": "800b60c7-537c-43e9-a121-19bb1f2fbe18", "title": "Hezbollah fires rockets after Israel strike on Lebanon - World", "date": "2024-07-21 15:15", "url": "https://www.brecorder.com/news/40313676/hezbollah-fires-rockets-after-israel-strike-on-lebanon", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "BEIRUT: Lebanon’s Hezbollah on Sunday said it fired Katyusha rockets at northern Israel in response to an overnight Israeli strike that, according to state media, hit a weapons depot and wounded six people.\nHezbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian group’s October 7 attack on southern Israel triggered war in the Gaza Strip.\nThe Iran-backed Hezbollah said it targeted northern Israel’s Dafna area with Katyusha rockets “in response to the Israeli enemy’s attacks that targeted civilians in the town of Adloun, injuring several of them”.\nIsrael strikes Gaza, Yemen, Lebanon foes after attacksThis comes after the Israeli military said its air force “struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry”.\nHezbollah said it had launched “dozens of Katyusha rockets” towards northern Israel “in response” to a strike blamed on Israel that injured civilians.", "location": "Northern Israel", "classification": "security", "score": 0.9930945111717485, "event_breakdown": "Israel strikes Gaza, Yemen, Lebanon foes after attacks\nIsraeli military said it had attacked Hezbollah weapons storage facilities in southern Lebanon, Hezbollah said it had launched “dozens of Katyusha rockets” towards northern Israel"}, {"id": "e113b0df-e6b5-4b02-9322-517d1e3a1250", "title": "Israel Confirms Striking Hezbollah Arms Depots in South Lebanon", "date": "2024-07-21 17:30", "url": "https://dailystar.com.lb/israel-confirms-striking-hezbollah-depots-lebanon/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "The Israeli military reported that it struck Hezbollah weapons storage facilities overnight, following Lebanese state media’s report of an Israeli attack on an ammunition depot in southern Lebanon.\nEarlier on Saturday, Hezbollah and its Palestinian ally Hamas fired rockets and explosive-laden drones at Israeli positions.\nHezbollah stated it launched “dozens of Katyusha rockets” at northern Israel “in response” to an Israeli strike that injured civilians.\nHamas’ armed wing, the Ezzedine al-Qassam Brigades, also claimed to have fired a rocket salvo from southern Lebanon towards an Israeli military position in the Upper Galilee.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "location": "Lebanon", "classification": "security", "score": 0.996687764117903, "event_breakdown": "IDF strikes Lebanese Hezbollah sites following exchange of fire - IDF said that it hit Hezbollah weapons depots and military posts near the Lebanese border with Israel early on Saturday morning, hours after Israel bombed an ammunition depot that belonged to a pro-Iranian group in Syria and Katyusha rockets were fired into the Israeli north. The IDF targeted rocket launch sites and a command center used by the Iranian Revolutionary Guards in Syria the IDF said, leaving multiple casualties. The IDF, Hezbollah and Hamas are continuing to insist on the IDF attack having been in response to Hezbollah rocket fire at Israel"}, {"id": "bd4aef2d-1ca7-4789-a247-ec5ca5902b73", "title": "Yemeni drone strike exposed hole in Israel air defenses : Reports", "date": "2024-07-21 12:30", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240720-irna05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Yemeni drone strike exposed hole in Israel's air defenses: ReportsIRNA - Islamic Republic News AgencyJul 20, 2024Tehran, IRNA -- Israeli media reports have highlighted the weakness of the regime's air defense system against unmanned aircraft following a successful drone attack by the Yemeni armed forces.\nIsraeli media highlighted the recent drone strike on Tel Aviv, emphasizing that the attack underscores a significant weakness in Israeli air defense capabilities.\nYemeni armed forces launched a drone on Friday that pierced through Israel's multilayered air defenses and hit Tel Aviv, killing one Israeli and wounding at least 10 others.\nThe drone strike exposed a deep gap in the Israeli air defense and intelligence as the Yemeni drone managed to traverse a distance of 2,000 kilometers to reach largest Israeli city without being intercepted.\nThe reports further warned that precise drone and missile strikes against strategic Israeli targets deep in the occupied territories would be a common feature of a large-scale conflict with Lebanon's Hezbollah.", "location": ".\nTel Aviv", "classification": "security", "score": 0.9498247730466273, "event_breakdown": "Successful Yemeni drone strike in Tel Aviv\nexpose vulnerability in Israeli air defenses\nIRNA - Islamic Republic News Agency, Jul 20, 2024"}, {"id": "4aa523da-a82b-4d7f-93b3-31e8eb17538b", "title": "Hezbollah says fires rockets , drones at Israel", "date": "2024-07-21 19:15", "url": "https://www.enca.com/news/hezbollah-says-fires-rockets-drones-israel", "domain": "enca.com", "domain_classification": "Unknown", "message": "Lebanon's Hezbollah said it fired Katyusha rockets and drones at Israel on Sunday after strikes which the Israeli army said targeted Hezbollah weapons storage facilities.\nHezbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian militant group's October 7 attack on southern Israel triggered war in the Gaza Strip.\nIn retaliation, Iran-backed Hezbollah, an ally of Hamas, said in separate statements that on Sunday it targeted two Israeli military positions in northern Israel with Katyusha rockets and drones.\nIsrael's military had said its air force \"struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry\" overnight Saturday to Sunday.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "location": "The exact location where the event takes place is not specified in the text.", "classification": "security", "score": 0.9795888513590821, "event_breakdown": "1. Hezbollah fires Katyusha rockets at Israeli military positions in northern Israel.\n2. Hezbollah said it fired drones at Israel in retaliation for the strikes.\n3. Israeli army said the strikes targeted Hezbollah weapons storage facilities in southern Lebanon."}, {"id": "281a62e2-a1d7-4be6-a27d-fdd7a4d0717f", "title": "WATCH : IAF Releases Footage Of Airstrikes On Yemen Houthis – The Yeshiva World", "date": "2024-07-21 19:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2298646/watch-iaf-releases-footage-of-airstrikes-on-yemens-houthis.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The Israeli Air Force (IAF) has released footage of its airstrike on the Houthi-controlled port of Hodeida in western Yemen yesterday.\nThe operation, dubbed “Outstretched Arm,” targeted fuel depots, energy infrastructure, and container cranes used to unload shipments.\nThe IAF believes the strike will project a message of deterrence to Israel’s enemies, including Lebanon’s Hezbollah.\nThe IAF is now on high alert for reprisal attacks, assessing that Iran-backed groups in Syria, Iraq, and Lebanon will ramp up attacks following the strike.\nIsrael’s air defenses are not foolproof, officials warn, and more successful drone attacks are likely.", "location": "The main focus of the event is Hodeida, Yemen.", "classification": "security", "score": 0.9809644154787207, "event_breakdown": "Hodeida, Israel"}, {"id": "1182f2ff-8fc3-4c75-99c3-a70e4d64b9a0", "title": "At least 6 die in Israeli strike on rebel - held Yemen port", "date": "2024-07-21 16:45", "url": "https://www.taipeitimes.com/News/front/archives/2024/07/22/2003821143", "domain": "taipeitimes.com", "domain_classification": "Unknown", "message": "At least 6 die in Israeli strike on rebel-held Yemen portAFP, HODEIDA, YemenThe death toll from an Israeli strike on Yemen’s rebel-held Hodeida port climbed to six, Houthi health authorities said yesterday, with firefighting teams battling a blaze at the harbor.\nMore operations against the Houthis would follow “if they dare to attack us,” Israeli Minister of Defence Yoav Gallant said.\nA huge column of fire engulfs Hodeida port in Yemen on Saturday.\nPhoto: AFPSaturday’s strike on the port, a key entry point for fuel and humanitarian aid to Yemen, is the first claimed by Israel in the country, about 2,000km away.\nFuel storage tanks and a power plant at the port were still ablaze amid “slow” firefighting efforts, a port employee said.", "location": "HODEIDA, Yemen", "classification": "security", "score": 0.5094540526342481, "event_breakdown": "Israeli strike on rebel-held Yemen port kills at least six: AFP, HODEIDA, Yemen"}, {"id": "63c0f9e6-0523-4d03-a6d0-b215f6f5b28c", "title": "Fighting in Southern Gaza , Israeli Strikes Hit Central Areas", "date": "2024-07-21 19:00", "url": "https://www.algemeiner.com/2024/07/21/fighting-in-southern-gaza-israeli-strikes-hit-central-areas/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Israeli forces battled Palestinian terrorists in the southern Gaza city of Rafah on Sunday, and struck areas in the center of the coastal enclave where thousands of Palestinians displaced from their homes have been seeking shelter.\nThe armed wings of the Islamic Jihad and Hamas Islamist terrorist groups said fighters confronted Israeli forces with anti-tank rockets and mortar bombs.\nIsraeli strikes in the previous 24 hours killed at least 64 and wounded more than 100 others, the local health ministry said.\nAt least 22 were killed by strikes on Sunday, according to the Hamas-run Gaza government media office.\nIsraeli strikes in areas of central Gaza in the past week have been focused on the Al-Nuseirat camp.", "location": "GAZA", "classification": "security", "score": 0.9888843997989814, "event_breakdown": "Israeli strikes targeting Al-Wehdah street in the northern Gaza Strip, and another on a site belonging to the Palestinian Islamic Jihad armed wing south of Gaza city."}, {"id": "b2fa31bb-8903-458e-8bdf-59abc8327978", "title": "Israel Claims Attack on Hezbollah  Cell  in Hula", "date": "2024-07-21 17:30", "url": "https://dailystar.com.lb/israel-attack-hezbollah-cell-hula/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "The Israeli military reported that it targeted a Hezbollah cell in the town of Hula, southern Lebanon.\nAccording to the military, the airstrike occurred shortly after Division 91’s fire brigade forces identified the cell, as stated on their X account.\nLebanon’s National News Agency confirmed that a drone strike hit a house in Hula with two missiles, resulting in injuries.", "location": "Hula", "classification": "security", "score": 0.9807554120913279, "event_breakdown": "Israel targeted Hezbollah cell in Hula, Southern Lebanon"}, {"id": "e9e6de7c-c6a1-461e-a319-0004014fe91b", "title": "Death toll from Israeli airstrikes in Yemen rises to 3", "date": "2024-07-21 10:30", "url": "https://www.albawaba.com/news/death-toll-israeli-airstrikes-yemen-1578131", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "SANAA, YemenThe death toll rose to three on Sunday after an Israeli strike on the western Yemeni port city of Al Hudaydah, the Houthi group announced, adding that 87 people were wounded from the attack.\n\"The death toll from the Israeli aggression on Al Hudaydah has risen to three dead and 87 injured,\" the Houthi-aligned Al-Masirah satellite broadcaster reported, citing the Health Ministry in the group's internationally unrecognized government.\nOn Saturday, Israeli aircraft carried out airstrikes targeting fuel tanks and a power station in the port of Al Hudaydah, according to the Houthi Health Ministry.\nAmerican officials told private Israeli Channel 12 that Tel Aviv conducted the attack on Al Hudaydah independently, without any military involvement from Washington.\nThis marks the first direct Israeli response to recent Houthi attacks.", "location": "AL Hudaydah", "classification": "security", "score": 0.9296388476013905, "event_breakdown": "{\n\"event\": \"The death toll rose to three on Sunday after an Israeli strike on the western Yemeni port city of Al Hudaydah, the Houthi group announced, adding that 87 people were wounded from the attack. \"\n}"}, {"id": "9615c6fa-cf67-4a04-99c3-a8db4049d7f7", "title": "Zelenskiy calls for long - range weapons after drone attack on Kyiv", "date": "2024-07-21 14:00", "url": "https://www.thestandard.com.hk/breaking-news/section/6/218616/Zelenskiy-calls-for-long-range-weapons-after-drone-attack-on-Kyiv", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "(Reuters)Ukraine needs long-range weapons to protect its cities and troops on the frontline from Russian bombs and drones, Ukrainian President Volodymyr Zelenskiy said on Sunday after a massive overnight drone and missile attack.\nRussia launched its fifth drone attack on Kyiv in two weeks overnight, with Ukraine's air defence systems destroying all the air weapons before they reached the capital, Ukraine's military said.\nUkraine's air force said on Telegram that its air defence systems destroyed 35 of the 39 drones and two cruise missiles that Russia had launched overnight.\nHe said it was necessary to destroy Russian bombers at Russian air bases to protect Ukraine from air raids.\nRussia launched three Iskander ballistic missiles, Ukraine's air force said, without saying what happened to them.", "location": "KYIV.", "classification": "security", "score": 0.518770676506545, "event_breakdown": "Ukraine's air defence system destroyed 35 of 39 Russian drones in Kyiv.\nUkraine's President Volodymyr Zelenskiy said Ukraine needed long-range weapons to protect its cities and troops."}, {"id": "7a700d62-5416-46be-a6ad-2fc70b90dca4", "title": "IDF shines light on Mohammed Deif strike in Khan Yunis", "date": "2024-07-21 17:30", "url": "https://www.jpost.com/israel-hamas-war/article-811274", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF on Sunday shed new light on the July 13 airstrike targeting Hamas military leader Mohammed Deif.\nAt this point, the military revealed that Deif was with 100% certainty in the room with Hamas Khan Yunis Brigade Commander Rafah Salame, when the bombs that were dropped and killed Salame struck.\nThis is different from the standard situation where aircraft only take off to strike a target after approval is given which creates a certain amount of gap time when a target might escape.\nLocation of where the IDF struck in Khan Yunis, July 13, 2024.\n(credit: IDF SPOKESPERSON'S UNIT)Air force units were in the sky for more than a day and a half, waiting for the word to attack, though Israeli intelligence had been following Salame at the location for weeks.", "location": "GAZA", "classification": "security", "score": 0.9260852917499263, "event_breakdown": "IDF airstrike targets Hamas military leader Mohammed Deif, killing him with 100% certainty."}, {"id": "0b416c5d-39d3-4504-a10f-3395c5f88fa1", "title": "Woman brutally stabbed , nearly thrown over railing at Florida airport : police", "date": "2024-07-21 19:00", "url": "https://www.yahoo.com/news/woman-brutally-stabbed-nearly-thrown-163010091.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TAMPA, Fla. (WFLA) — A woman is in critical condition after she was repeatedly stabbed at Miami International Airport on Saturday night, causing chaos in the terminal.\nResidents evacuated after large ‘ground depression’ opens up under Florida homeAccording to the Miami-Dade Police Department, a man repeatedly stabbed the woman and tried to throw her over the railing.\nThe incident halted airport operations until authorities could determine the chaos stemmed from the stabbing.\n“There is no impact at all to airport operations, and it is considered an isolated incident,” Miami-Dade Police spokesperson Angel Rodriguez said.\n“When they said run, we all ran.”Florida woman accused of punching beloved 97-year-old bartenderAuthorities are trying to determine the relationship between the suspect and the woman.", "location": "MIAMI", "classification": "security", "score": 0.5356368493385084, "event_breakdown": "Miami-Dade police responded to the incident.\nAn “isolated incident” halted operations at Miami International Airport for a brief period on Saturday evening after a man stabbed a woman in the main terminal."}, {"id": "e134b770-4892-4997-bce4-9601d48f560a", "title": "Iran - backed Houthi territory hit by Israel for first time | World | News", "date": "2024-07-21 15:15", "url": "https://www.express.co.uk/news/world/1926063/iran-backed-houthi-territory-israel-war-tensions", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The Israeli attack killed at least three people and injured more than 80, most of which reported \"severe burns\", according to the Houthi-run Al Masirah TV.\nIsraeli Prime Minister Benjamin Netanyahu also spoke about the attack on the Houthis' territory, saying Hodeidah was \"not an innocent port\".\nTrendingHouthi army spokesperson Yehya Saree vowed to respond to the strike, warning the Houthis were ready to hit Israel’s \"vital targets\" - before adding Tel Aviv was not safe either.\nThe Houthis have been causing major disruption to ships crossing the Red Sea since November last year as well as firing attacks against Israel to show their support for Gaza.\nIsrael's decision to hit Yemen marks a first likely to further raise fears the war between Hamas and Israel could spill over into a regional conflict.", "location": "YEMEN", "classification": "security", "score": 0.7144546154734055, "event_breakdown": "Israel Yemen Red Sea\nHouthis vow to attack Israel after Hodeidah strike"}, {"id": "4d2d883b-1bd5-44b7-9388-c959cb1a247b", "title": "Russia Conducts Navy Drills In White Sea", "date": "2024-07-21 19:15", "url": "https://gcaptain.com/russia-conducts-navy-drills-in-white-sea/", "domain": "gcaptain.com", "domain_classification": "Unknown", "message": "MOSCOW, July 21 (Reuters) – Russian warships conducted training drills in the White Sea to convoy and defend a caravan of ships, state-run TASS news agency reported on Sunday, citing the Russian Defence Ministry, in what it said was routine combat training.\nDuring the drills two small anti-submarine ships, the Onega and the Naryan-Mar, practiced organizing combat usage of weapons and radio-electronic warfare equipment in a scenario of a simultaneous attack from air and sea.\n“The day before, the small anti-submarine ships Onega and Naryan-Mar carried out training and combat missions to repel an air attack by a conditional enemy,” TASS quoted a defense ministry statement as saying.\nWhile training in air defense, the warships fired at simulated air targets from anti-aircraft missile systems and naval cannons, the agency added.\n(Reporting by Reuters; Editing by Susan Fenton)(c) Copyright Thomson Reuters 2024.", "location": ")\nThe most specific location mentioned in the text is: WHITE SEA", "classification": "security", "score": 0.4865281784639541, "event_breakdown": "Target: Russian warships conducted training drills in the White Sea to convoy and defend a caravan of ships."}, {"id": "8b6c372a-6899-4240-876d-136fa74eb583", "title": "Adani Defence to locally manufacture Two types of Thales 70mm Rockets in India – Indian Defence Research Wing", "date": "2024-07-21 16:45", "url": "https://idrw.org/adani-defence-to-locally-manufacture-two-types-of-thales-700mm-rockets-in-india/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Adani Defence to locally manufacture Two types of Thales 70mm Rockets in India| BySOURCE: IDRW.ORGIn a significant move towards self-reliance in defense manufacturing, India’s Adani Defence and Aerospace has joined forces with French giant Thales to produce two cutting-edge 70mm rocket systems within India.\nThis collaboration will see the FZ275 Laser-Guided Rocket (LGR) and the FZ90 unguided Folding Fin Aircraft Rocket (FFAR) manufactured locally.\nUnder the agreement, Adani Defence will act as the prime integrator, responsible for overseeing the entire production process in India.\nThe FZ275 LGR is a game-changer, bridging the gap between long-range missiles and shorter-range weaponry.\nMinimized Collateral Damage: The precision of the FZ275 LGR helps to significantly reduce civilian casualties and unintended damage to infrastructure.", "location": "India", "classification": "security", "score": 0.8305661477605752, "event_breakdown": "Adani Defence to locally manufacture Two types of Thales 70mm Rockets in India."}, {"id": "c4dcd99c-9b7d-4b33-8475-dab6911bf8ba", "title": "How a Berlin Cold War outpost offers a window on challenges today", "date": "2024-07-21 14:45", "url": "https://www.stripes.com/theaters/europe/2024-07-21/cold-war-outpost-berlin-14551485.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "German Chancellor Olaf Scholz records his New Year’s address to the German people on Dec. 30, 2022, in Berlin.\n(Krick/Pool/Getty Images/TNS)(Tribune News Service) — Carved out of the forest on the southwestern edge of Berlin lies an outpost of the Cold War that’s becoming more relevant by the day.\nThe real highlight is its collection of Cold War artifacts: fighter jets, Western and Soviet; East German helicopters, West German radar installations, NATO air-defense systems and transport aircraft; even early nuclear missiles.\nNational surveys still show a majority favor helping Ukraine militarily, but a residual pacifist camp rooted in the Cold War peace movement is dismayed, and casting around for a new political home.\nTensions with the U.S. have their Cold War parallels.", "location": "BERLIN", "classification": "security", "score": 0.4312896207410221, "event_breakdown": "1. Russian invasion of Ukraine\n2. Cold War relics museum\n3. Berlin’s Grunewaldturm TV tower\n4.  Bundeswehr University of the German army\n5. Bundeswehr’s focus on Cold War era\n6. Polls in favor of helping  Ukraine militarily\n7. Pew global survey of Russian invasion\n8. NATO air-defense systems\n9. Military base Miroslawiec\n10. Bundeswehr’s infantry school\n11. Bundeswehr’s European Air Transport Command\n12. Bundeswehr’s defense academy in German language\n13. Transit center logistics center\n14. National security headquarters\n15. NATO cruise missile defense\n16. Bundeswehr’s bombing range in Aurich\n17. Nuclear weapons of the Bundeswehr\n18. German navy base in French language\n19. German chancellor Olaf Scholz\n20. TV address of Olaf Scholz in Berlin\n21. German Chancellery in Berlin\n22. Germany’s southwest\n23. Russia's attacks on Germany\n24. Chancellor Olaf Scholz’s New Year’s address\n25. West Germany radar installations\n26. East German helicopters\n27. Finland's military training areas\n28. Alliance forward powering"}, {"id": "6074d4eb-e29c-49e4-8c47-61114adc362b", "title": "South Korea responds to North trash balloons with loudspeaker broadcasts - World", "date": "2024-07-21 19:15", "url": "https://www.dawn.com/news/1847107/south-korea-responds-to-norths-trash-balloons-with-loudspeaker-broadcasts", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "North Korea on Sunday floated balloons carrying trash towards South Korea, South Korea’s military said, declaring it would respond with “full-scale” loudspeaker broadcasts.\nActivists and defectors in South Korea have for years sent their balloons carrying propaganda leaflets and other items into North Korea, angering Pyongyang.\nEarlier this week, South Korea’s military decided to resume its round-the-clock loudspeaker broadcast campaign targeting North Korea in response to what it called the despicable launch of balloons by Pyongyang carrying trash across the border.\nSince May, North Korea has been floating thousands of balloons with bags of trash attached to them, which have become a new source of tension between the two Koreas.\nBlaring propaganda, world news and K-pop music, South Korea’s broadcasts are considered by military officials and activists as an effective form of psychological warfare.", "location": "North Korea.", "classification": "security", "score": 0.4921874962709234, "event_breakdown": "North Korea floats balloons carrying trash towards South Korea, South Korea responds with loudspeaker broadcasts."}, {"id": "85e1c4f4-2a92-4386-b51f-58b4799c19b8", "title": "Battle of Shrewsbury anniversary marked with new portrait - but no reenactment this year", "date": "2024-07-21 16:45", "url": "https://www.shropshirestar.com/news/local-hubs/shrewsbury/2024/07/21/battle-of-shrewsbury-anniversary-marked-with-new-portrait---but-no-reenactment-this-year/", "domain": "shropshirestar.com", "domain_classification": "Unknown", "message": "In a battle believed to have been fought at the area now named Battlefield in the county town, on July 21, 1403, an army led by the Lancastrian King Henry IV defeated Henry 'Harry Hotspur' Percy's rebels.\nThe battle was the first in which English archers fought each other on English soil, and ended the Percy challenge to King Henry IV of England.\nHotspur - immortalised by Shakespeare and Tottenham Hotspur Football Club - was killed during the battle, said to be shot in the face with an arrow when he opened his helmet's visor.\nThe leader of the rebel army from Northumberland was said to be initially buried in Whitchurch, Shropshire before rumours spread that he was not really dead, and so the King had him disinterred.\nHis body was set up in Shrewsbury, impaled on a spear, and later quartered and put on display in Chester, London, Bristol and Newcastle-upon-Tyne.", "location": "Battlefield, Shrewsbury", "classification": "security", "score": 0.8612578770719015, "event_breakdown": "Battle of Shrewsbury\nThe site of the battle was in the south of the county and now serves as the land owned by the Boughton House estate.  The battle is marked by a large monument to the fallen on the day."}, {"id": "81095f0f-69dc-45b9-aa07-23a158972d13", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 18:00", "url": "https://edition.cnn.com/2024/07/21/middleeast/israel-strikes-houthi-rebels-explainer-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nHouthi military academy cadets demonstrate in solidarity with the Palestinian people on June 14 in Sana'a, Yemen.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nOded Balilty/APThe attack marked the first time Tel Aviv, Israel’s commercial center, has been struck by a drone in an attack claimed by the Houthis.\nHouthi military spokesman Yehya Saree speaks at a rally against Israel and the US on Friday.", "location": "Yemen", "classification": "security", "score": 0.9062664741684435, "event_breakdown": "IDF forces attacked targets in the Gaza Strip on Sunday night in response to explosives placed near the security fence earlier in the day.\nTwo IDF soldiers were killed by a Hamas anti-tank missile during an operation in the Gaza Strip on Friday afternoon.\nIDF forces carried out widespread strikes in the Gaza Strip on Saturday night in response to gunfire at the border.\nIDF forces carried out widespread strikes in the Gaza Strip on Saturday night in response to Hamas launching an explosive balloon earlier in the day."}, {"id": "0f0b6bb2-81f0-4902-b902-5ad6867c0ad6", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 15:30", "url": "https://us.cnn.com/2024/07/21/middleeast/israel-strikes-houthi-rebels-explainer-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nHouthi military academy cadets demonstrate in solidarity with the Palestinian people on June 14 in Sana'a, Yemen.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nOded Balilty/APThe attack marked the first time Tel Aviv, Israel’s commercial center, has been struck by a drone in an attack claimed by the Houthis.\nHouthi military spokesman Yehya Saree speaks at a rally against Israel and the US on Friday.", "location": "SANA'A", "classification": "security", "score": 0.9062664741684435, "event_breakdown": "Recently, Israel has struck inside Yemen for the first time ever, following a rocket attack by Houthi rebels on Tel Aviv. The US and the UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen. A Houthi military spokesman spoke at a rally against Israel and the US, and the US and UK have responded to Houthi attacks by striking Houthi targets in Yemen."}, {"id": "7f372d22-64b1-4ce6-9bbe-936125e38e5a", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 15:15", "url": "https://www.yahoo.com/news/israel-strikes-yemen-first-time-140526096.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel strikes Yemen for the first time following deadly Houthi drone attack.\nHere’s what we knowFor the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nHouthi military academy cadets demonstrate in solidarity with the Palestinian people on June 14 in Sana'a, Yemen.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nHouthi military spokesman Yehya Saree speaks at a rally against Israel and the US on Friday.", "location": "Yemen", "classification": "security", "score": 0.8240911603748988, "event_breakdown": "Israel strikes Yemen Houthi military targets Sana'a"}, {"id": "f41f2bf0-d219-4170-9715-7b8aa6dda7af", "title": "Deseret News archives : After 2½ years of Japanese occupation , U . S . forces invade Guam in decisive battle . – Deseret News", "date": "2024-07-21 16:45", "url": "https://www.deseret.com/utah/2024/07/21/deseret-news-archives-invasion-of-guam-remembered-on-this-day/", "domain": "deseret.com", "domain_classification": "Unknown", "message": "The front page of the Deseret News on July 21, 1944, as the invasion of Guam began in the final year of World War II.\nWorld War II had dragged on for five years when U.S. forces began an invasion to retake Guam on July 21, 1944.\nThe first battle of Guam took place Dec. 8-10, 1941.\nJuly 21 is celebrated as Guam Liberation Day, the day when Americans came ashore in 1944.\nAlthough organized Japanese resistance ended Aug. 10, some 7,500 Japanese soldiers remained in the jungle for some time, and some continued the fight.", "location": "GUAM", "classification": "security", "score": 0.6745951238461901, "event_breakdown": "The invasion of Guam by the United States in the final year of World War II. The invasion began on July 21, 1944."}, {"id": "63704ab9-8b9f-49af-b2cf-d5e59a027b6d", "title": "Guermantes Lailari on Taiwan : China Anaconda Strategy : Psychological and Legal Warfare", "date": "2024-07-21 16:45", "url": "https://www.taipeitimes.com/News/editorials/archives/2024/07/22/2003821134", "domain": "taipeitimes.com", "domain_classification": "Unknown", "message": "Guermantes Lailari on Taiwan: China’s Anaconda Strategy: Psychological and Legal WarfareThe Chinese Communist Party (CCP) continues to bully Taiwan by conducting military drills extremely close to Taiwan in late May 2024 and announcing a legal opinion in June on how they would treat “Taiwan Independence diehards” according to the PRC’s Criminal Code.\nThis article will describe how China’s Anaconda Strategy of psychological and legal asphyxiation is employed.\nThe CMC deployed four CCG vessels along the eastern coast of Taiwan and three CCG vessels near the southern entrance of the Taiwan Strait to practice blockading law enforcement operations.\nThis is an example of the CMC conducting the Anaconda psychological warfare strategy against Taiwan’s military and population.\nGuermantes Lailari is a retired US Air Force Foreign Area officer specializing in counterterrorism, irregular warfare, missile defense, and strategy.", "location": "Taiwan", "classification": "security", "score": 0.6906846939739836, "event_breakdown": "The following current events of security are reported in the provided text:\n\n* The deployment of four Chinese Coast Guard (CCG) vessels along the eastern coast of Taiwan\n* The deployment of three Chinese Coast Guard (CCG) vessels near the southern entrance of the Taiwan Strait\n* The conduct of military drills by the Chinese People's Liberation Army (PLA) near Taiwan in late May 2024\n* The announcement of a legal opinion by the Chinese Ministry of Justice in June on how the PRC would treat \"Taiwan Independence diehards\" according to the PRC's Criminal Code"}, {"id": "7cde8651-a4db-40f3-b721-141618eb00b4", "title": "South Korea boosts propaganda broadcasts at border", "date": "2024-07-21 16:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/07/22/2003821165", "domain": "taipeitimes.com", "domain_classification": "Unknown", "message": "South Korea boosts propaganda broadcasts at borderCONSEQUENCES: Seoul said Pyongyang was entirely to blame for the situation after North Korea launched more balloons toward the South, likely carrying trashAP, SEOULSouth Korea yesterday said that it was bolstering its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea, after the North launched more balloons likely carrying trash toward South Korea.\nA balloon presumably sent by North Korea lies in a paddy field in Incheon, South Korea, on June 10.\nThe broadcasts also referred to the “hellish, slave-like lives” of North Korean soldiers responsible for mine-planting work at the border, South Korean media reported.\nNorth Korea has not made an official response to the South Korean broadcasts.\nNorth Korea has floated more than 2,000 balloons to drop waste paper, scraps of cloth, cigarette butts, waste batteries and even manure on South Korea, although they have so far caused no major damage in South Korea.", "location": ")\nSEOUL", "classification": "security", "score": 0.7721285345632264, "event_breakdown": "South Korea says that it is boosting its anti-Pyongyang propaganda broadcasting. The broadcasts are likely taking place along the tense border between the two Koreas."}, {"id": "be6154ec-04d0-46ec-a14b-e34cb8bde9da", "title": "Police stabilisation team making progress in Tshwane", "date": "2024-07-21 01:30", "url": "https://www.enca.com/news/police-stabilisation-team-making-progress-tshwane", "domain": "enca.com", "domain_classification": "Unknown", "message": "PRETORIA - A police stabilisation team has been making some headway in Tshwane.\nIt was deployed to Pretoria North after a surge in crime in Soshanguve, Rietgat, Loate, Mabopane, and Akasia.\nSo far, 51 suspects have been arrested and 26 stolen or hijacked vehicles recovered.\nExperts say this is a much-needed initiative, but it's only temporary.\nFocus should be on staffing and providing police stations with adequate resources to combat crime.", "location": "Pretoria North", "classification": "security", "score": 0.6892290101492781, "event_breakdown": "A list of current events reported in text about security in Tshwane, South Africa:\n- Police stabilisation team deployed in Pretoria North to combat surge in crime.\n- 51 suspects arrested and 26 stolen/hijacked vehicles recovered so far."}, {"id": "1ad3198b-6d20-4e76-8656-bfde6c3d601d", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 18:15", "url": "https://kesq.com/news/national-world/cnn-world/2024/07/21/israel-strikes-yemen-for-the-first-time-following-deadly-houthi-drone-attack-heres-what-we-know/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "By Sophie Tanno, CNN(CNN) — For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nA tipping point for Israel appears to have come on Friday, when a drone attack was launched on Tel Aviv, killing one Israeli citizen and injuring several others.\nIsrael authorities are investigating the circumstances and potential security failures around the deadly drone blast.\nThe attack, which marked the first time Israel has struck Yemen, killed at least six people and injured scores more, Yemeni officials said.", "location": "Yemen", "classification": "security", "score": 0.9221771407025579, "event_breakdown": "With the tips you provided, I was able to generate a short story for you:\nThe Israeli military said it had struck targets in the Gaza Strip, hours after a Palestinian rocket attack from the besieged territory sparked sirens in Tel Aviv, sending thousands of Israelis rushing to bomb shelters.\nThe Israeli airstrike came a day after Hamas, an Islamic militant group that rules Gaza, and other armed Palestinian groups said they fired a rocket into Israel for the first time since a 2014 war. No injuries were reported.\nThe Israeli army said it had launched the strikes after Palestinian groups in the Gaza Strip launched incendiary balloons into Israel on Tuesday, causing dozens of fires across the Israeli countryside."}, {"id": "9d8ea5e0-b539-499e-acf6-94ec098571aa", "title": "Air Force Expects to Choose Sixth - Generation Fighter Contractor This Year – Indian Defence Research Wing", "date": "2024-07-21 07:30", "url": "https://idrw.org/air-force-expects-to-choose-sixth-generation-fighter-contractor-this-year/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Air Force Expects to Choose Sixth-Generation Fighter Contractor This Year| BySOURCE: AFIThe head of Air Combat Command (ACC), General Kenneth Wilsbach, recently indicated the Air Force is on track to select a contractor for its next-generation fighter jet program later this year.\nThe Air Force initially planned to award the NGAD development contract in 2024.\nIn June, Air Force Secretary Frank Kendall declined to comment on potential changes to the program’s timeline.\nThis high cost likely limits the number of NGAD aircraft the Air Force can ultimately purchase.\nThe NGAD program aims to develop a new generation of fighter jets to replace the Air Force’s F-22 Raptor fleet sometime in the 2030s.", "location": "NONE", "classification": "security", "score": 0.528274431797064, "event_breakdown": "Air Force Expects to Choose Sixth-Generation Fighter Contractor This Year\nAir Force Expects to Choose Sixth-Generation Fighter Contractor This Year\nAir Force Expects to Choose Sixth-Generation Fighter Contractor This Year"}, {"id": "aa75eaa2-2635-4cba-bb5d-4d39e2b54285", "title": "Ukrainian Forces Defeated Russian Assault Group In Serebryansky Forest", "date": "2024-07-21 16:45", "url": "https://charter97.org/en/news/2024/7/21/603702/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ukrainian Forces Defeated Russian Assault Group In Serebryansky Forest 21.07.2024, 14:175,006The invaders were destroyed right in the trenches.\nSeveral Ukrainian soldiers fought an unequal battle with the Russian assault group in the trenches, but thanks to attack drones, the invaders were destroyed.\nA video of the destruction of the Russian invaders was published by the Press Service of the 63rd Mechanized Infantry Brigade.\nThe Ukrainian Armed Forces maintained their position in the Luhansk region in the Serebryansky Forest.\nThanks to successful drone strikes, the occupiers' assault group was eliminated.", "location": "SEREBRYANSKY FOREST", "classification": "security", "score": 0.9108959325433454, "event_breakdown": "Ukrainian Forces Defeated Russian Assault Group In Serebryansky Forest 21.07.2024, 14:175,006 - The Ukrainian forces maintained their position in the Luhansk region in the Serebryansky Forest."}, {"id": "e11c2c92-bdaf-4c48-9a75-00f089b05cf5", "title": "Israel strikes Yemen for the first time following deadly Houthi drone attack . Here what we know", "date": "2024-07-21 16:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/21/israel-strikes-yemen-for-the-first-time-following-deadly-houthi-drone-attack-heres-what-we-know/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nA tipping point for Israel appears to have come on Friday, when a drone attack was launched on Tel Aviv, killing one Israeli citizen and injuring several others.\nIsrael authorities are investigating the circumstances and potential security failures around the deadly drone blast.\nThe attack, which marked the first time Israel has struck Yemen, killed at least six people and injured scores more, Yemeni officials said.", "location": "Yemen", "classification": "security", "score": 0.9221771407025579, "event_breakdown": "1. Yemen\nTarget: Houthi rebels\nEvent type: Israel strikes Yemen\nActor: US, UK\n2. Tel Aviv\nEvent type: Drone attack on civilian targets\nCause of death: Blast from drone\nActor: Houthi rebels\n3. Yemen\nCause of death: Blast from drone\nCasualty count: One Israeli citizen killed, several injured\nPffft, this was easy. HBD to me I guess :D"}]