[{"id": "f9fe288b-924e-4648-a409-3896299517e9", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\"", "location": "Moscow, Russia", "classification": "security", "score": 0.7431922073966853, "event_breakdown": "- Terrorist attacks in Iran and Russia\n- Explosion in Kerman, Iran\n- Shooting incident outside Moscow, Russia"}, {"id": "1ef71dc5-b1a8-4139-b893-a9be1cc52981", "title": "Israel strikes Hamas rocket launchers , tunnel shafts", "date": "2024-04-30 11:30", "url": "https://news.webindia123.com/news/Articles/World/20240430/4192746.html", "message": "Shortly afterwards, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nDuring operational activity in central Gaza, two terrorists were identified advancing toward the troops in the area.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "Gaza", "classification": "security", "score": 0.9755571757962365, "event_breakdown": "- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in the area of northern Gaza.\n- Troops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\n- Two terrorists were identified advancing toward the troops in central Gaza.\n- Fighter jets struck the structure, eliminating the terrorist.\n- Fighter jets struck Hezbollah terrorist infrastructure in Kfarkela and Khiam in southern Lebanon."}, {"id": "84f2f2f6-7bf9-46dd-bae5-f644510e6f98", "title": "Ukraine updates : Russia strikes Odesa for 2nd time this week – DW – 05 / 01 / 2024", "date": "2024-05-01 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-2nd-time-this-week/a-68967110", "message": "Russia has pummeled the vital port city of Odesa, stepping up aerial attacks that have also damaged civilian infrastructure there, according to Ukrainian officials.\nAt least three people were killed and three more injured in a Russian missile strike on the Ukrainian city of Odesa in the early hours of Wednesday morning, local authorities said.\nAs a consequence of the attack, three people were killed and three more wounded,\" wrote Gennadiy Trukhanov, the mayor of the southwestern port city, on Telegram.\nThe attack comes just two days after Russian missiles struck an educational institution in the city, killing five people.\nAccording to Shmyhal, Ukraine had previously earmarked 43.3 billion hryvnia for the purchase of drones this year.", "location": "ODESA", "classification": "security", "score": 0.8820837055918667, "event_breakdown": "1. Russian aerial attacks intensify in Odesa, Ukraine.\n2. Russian missile strike kills three in Odesa.\n3. Educational institution targeted by Russian missiles, killing five.\n4. Ukrainian government allocates funds for drone purchases."}, {"id": "153ecc63-5e0f-4773-a565-60e0416da2a2", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "location": "Mogadishu, Somalia", "classification": "security", "score": 0.5268761109185044, "event_breakdown": "- Six employees of Hormuud Telecom lost their lives in a roadside blast on the outskirts of Mogadishu, Somalia.\n- The attack was described by the government as a deliberate targeting against commercial companies in Somalia.\n- This incident is part of a series of attacks targeting Hormuud Telecom, with previous explosions in Mogadishu and beyond.\n- Hormuud Telecom expressed condolences to the families and friends of the victims.\n- Six employees of Hormuud Telecom killed in roadside blast on the outskirts of Mogadishu, Somalia\n- Government describes attack as deliberate targeting against commercial companies\n- Pattern of targeted violence against Hormuud Telecom with previous explosions in Mogadishu and beyond\n- Hormuud Telecom expresses condolences to families and friends of victims\n- Investigation into the attack ongoing, families and community mourn loss of colleagues"}, {"id": "e483e0d1-3ae2-4d39-9489-ee45de28a601", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9537699385755353, "event_breakdown": "- Israeli airstrike kills 22 people in Rafah, Gaza, including an infant and a toddler\n- Mahmoud Abu Taha holds up baby boy's body, claiming they are being targeted\n- Video shows 10 relatives of the Abu Taha family killed in the same airstrike\n- Some of the deceased were originally displaced from Khan Younis, where they were also victims of a previous Israeli airstrike"}, {"id": "dbb4aaa7-1d81-4e0a-8800-672ee34e92c6", "title": "Sydney church stabbing : Teen alleged terrorism texts , claims he wanted to  kill non believers  ", "date": "2024-04-30 10:30", "url": "https://www.nzherald.co.nz/world/sydney-church-stabbing-teens-alleged-terrorism-texts-claims-he-wanted-to-kill-non-believers/OUECF7DEZNDHHKQVO2BCBQEPDU/", "message": "A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences following the Sydney church stabbing allegedly sent text messages declaring he was “going to kill non-believers” before the attack was carried out by an alleged associate.\nHis alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.", "location": "Sydney", "classification": "security", "score": 0.4260738952908896, "event_breakdown": "- A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was \"going to kill\" in messages about carrying out a plan against non-believers.\n- His alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants."}, {"id": "7e2deaa6-a136-4147-a7e4-69e8af66508b", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA, Ukraine", "classification": "security", "score": 0.47245463261582726, "event_breakdown": "- Location: Odesa, Ukraine\n- Event: Russian missile attack on an educational institution in a popular seafront park\n- Date: Monday\n- Casualties: At least five people killed and 32 injured\n- Description: Roof of the ornate building, a private law academy, all but destroyed after the strike\n- Statement: Odesa Mayor Hennadii Trukhanov witnessed a missile being shot down in front of him\n- Context: Odesa has been a frequent target of Russian missile and drone attacks, particularly on port infrastructure."}, {"id": "1293f580-5d99-4d09-8359-16fa75de1e5b", "title": "Missile attack by Yemen Houthi rebels damages a ship in Red Sea", "date": "2024-05-01 06:15", "url": "https://www.sunstar.com.ph/network/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-red-sea", "message": "JERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, April 29, 2024, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5488933144612118, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- US military shoots down five drones over the Red Sea"}, {"id": "9ddbb18c-4e81-4479-b229-7c131072346b", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5068969617636545, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- US military shoots down five drones over the Red Sea"}, {"id": "1b0673c9-8a48-4538-92fe-160f4cd99eb4", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "RED SEA", "classification": "security", "score": 0.5457119768814919, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down Houthi drone near Bab el-Mandeb Strait\n- U.S. military shoots down five drones over the Red Sea"}, {"id": "01385d9c-189b-48ad-a477-50bde97e12e3", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group.", "location": "Mokha, Yemen", "classification": "security", "score": 0.8422909504198774, "event_breakdown": "- Houthi rebels attack two US destroyers and two vessels in the Red Sea with drone strikes off the coast of Mokha, Yemen\n- The attack caused damage to one of the ships, but the crew is safe and heading to the next port of call\n- The United Kingdom Maritime Trade Operations center issues a warning for vessels to exercise caution in the area"}, {"id": "8ca4b9a0-6123-4804-b538-e106ca96b1d1", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "ODESA", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "1. A day of mourning declared in Odesa, Ukraine after Russian missile strike leaves five dead and 32 injured.\n2. Russia claims to have shot down six U.S.-supplied ATACMS missiles over the past day.\n3. Uncertainty regarding the number of ATACMS missiles provided to Ukraine.\n4. Warning issued about undetonated submunitions scattered after the ATACMS missiles were shot down.\n5. The U.S.-supplied Army Tactical Missile System (ATACMS) used to strike targets in Russian-occupied territory."}, {"id": "1dbfacc3-ae6e-47d3-9848-46540ebec06c", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.46026327135311396, "event_breakdown": "1. Houthi rebels launch missile attack, damaging ship in Red Sea.\n2. Italian frigate intercepts Houthi drone near Bab el-Mandeb Strait.\n3. Decline in shipping through Red Sea and Gulf of Aden due to threat.\n4. US military shoots down five drones over Red Sea."}, {"id": "8fff1acd-c3d7-4217-9d63-e584ad5dfd35", "title": "Three killed as Russia attacks Odesa with ballistic missiles for the second day in a row", "date": "2024-05-01 09:30", "url": "https://www.yahoo.com/news/three-killed-russia-attacks-odesa-081400948.html", "message": "Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30, Odesa Governor Oleh Kiper said.\n\"Three people died in Odesa,” said Presidential Office head, Andriy Yermak, on the morning of May 1.\n“Ballistic missiles hit a large, peaceful city at night.\nResidential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET.\n\"Russia is launching ballistic missiles against us for the second day in a row.”He urged civilians to pay attention to air raid alarms and stay in shelters.", "location": "Odesa", "classification": "security", "score": 0.9820033226101117, "event_breakdown": "- Shattered windows in a residential building after a Russian strike on the evening of April 30 in Odesa\n- Three people killed and three others injured in Odesa after Russian ballistic missile attack on the evening of April 30\n- Residential buildings damaged by ballistic missiles in Odesa on the evening of April 30, causing shattered windows and doors"}, {"id": "e0892a37-e43e-4dd3-bcae-0e6aea9c7f50", "title": "Russian missile kills three in Ukrainian port of Odesa", "date": "2024-05-01 00:45", "url": "https://www.devdiscourse.com/article/law-order/2923457-russian-missile-kills-three-in-ukrainian-port-of-odesa", "message": "A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa early on Wednesday, regional Governor Oleh Kiper said.\nHe said the strike was carried out by a ballistic missile, but provided no further details.\nKiper and Odesa Mayor Hennadii Trukhanov had reported a series of loud explosions.\nOn Monday, a Russian missile struck an educational institution in the city, killing five people.\nOdesa has been a frequent target of Russian forces in the more than two-year-old war, with many attacks aimed at the city's port facilities.", "location": "Odesa", "classification": "security", "score": 0.9427670113474113, "event_breakdown": "- Russian missile attack in Ukrainian port of Odesa killed three people and injured three others\n- Odesa Mayor and regional Governor reported series of loud explosions\n- Russian missile struck an educational institution in Odesa, killing five people"}, {"id": "bc2e1f1f-4031-4d6b-a2de-78594bb524e5", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5358856195628724, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- Italian frigate Virgino Fasan shoots down a Houthi drone near the Bab el-Mandeb Strait\n- U.S. military shoots down five drones in the air over the Red Sea"}, {"id": "61870507-20ea-4f94-9475-bccae9eeec82", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "Odesa", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- A day of mourning declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and injured 32 others.\n- Russia claims to have shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems (ATACMS).\n- Uncertainty surrounding the amount of ATACMS missiles provided to Ukraine.\n- Submunitions from the ATACMS missiles were scattered after being shot down, posing a threat to civilians.\n- The U.S.-provided ATACMS system has been used to strike targets in Russian-occupied territory."}, {"id": "cb487872-b513-4f00-9a60-90ca1355cca9", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-30 14:30", "url": "https://www.egyptindependent.com/my-whole-family-has-perished-22-killed-in-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza CNN —Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAbed Rahim Khatib/Anadolu/Getty ImagesAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah", "classification": "security", "score": 0.8828711026621543, "event_breakdown": "1. Israeli airstrike kills 22 in Rafah, Gaza.\n2. Abu Taha family members targeted in airstrike, 10 killed.\n3. Displaced family members from Khan Younis killed in previous airstrike.\n- Israeli airstrike in Rafah, Gaza kills 22 people, including an infant and a toddler\n- Mahmoud Abu Taha holds up the body of a baby boy, claiming they are being targeted\n- 10 relatives of the Abu Taha family are killed in the airstrike\n- Some of the victims were originally displaced from Khan Younis due to a previous Israeli airstrike\n- Remaining relatives who fled to Rafah for safety are also killed overnight"}, {"id": "6a7f0c13-2e5c-4f8c-a520-8e787d4520e3", "title": "Ukraine war briefing : Russia making gains from slow western aid , says Nato chief", "date": "2024-04-30 01:15", "url": "https://www.theguardian.com/world/2024/apr/30/ukraine-war-briefing-russia-making-gains-from-slow-western-aid-says-nato-chief", "message": "Ukrainian navy spokesperson Dmytro Pletenchuk said the strike was conducted by an Iskander-M ballistic missile with a cluster warhead.\nA Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday, according to local officials.\nUkraine’s allies have accused North Korea of transferring weapons to Russia for use against Ukraine in violation of an arms embargo.\nThe US has accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\nRussia in March vetoed the renewal of sanctions monitoring against North Korea’s nuclear and ballistic missile programmes.", "location": "Kharkiv", "classification": "security", "score": 0.667125687365189, "event_breakdown": "- Russian strike in Kharkiv kills at least two people and injures six\n- Iskander-M ballistic missile with a cluster warhead struck in Ukraine\n- Accusations of North Korea transferring weapons to Russia for use against Ukraine\n- US accuses Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions\n- Russia vetoed renewal of sanctions monitoring against North Korea's nuclear and ballistic missile programmes"}, {"id": "c7d45812-6cd6-4efa-ad73-96998ceddfc1", "title": "Accused teen linked to Sydney bishop stabbing applies for release from custody", "date": "2024-05-01 12:45", "url": "https://abcnews.go.com/International/wireStory/accused-teen-linked-sydney-bishops-stabbing-applies-release-109819306", "message": "A 15-year-old boy who claims to be a friend of the teen accused of stabbing a Sydney bishop recently has applied to be released from custody on bailAccused teen linked to Sydney bishop's stabbing applies for release from custodyBy The Associated PressSYDNEY -- A 15-year-old boy who claimed to be a friend of a teen accused of stabbing a Sydney bishop applied Wednesday to be released from custody on bail on a charge of planning a terrorist attack.\nThe 15-year-old is one of six teens, ages 14 to 17, who were charged in a Sydney court last week with a range of offenses including conspiring to engage in or planning a terrorist act.\nDib tendered a bundle of documents including an affidavit from the boy’s mother, school report cards and a psychological report.\n“A young person with behavioral issues facing a terrorism accusation is not exceptional, it is rather the norm,” Rodger said.\nThe boy had been part of an encrypted chat group titled “Plans” where he talked about targeting Jewish people, Rodger said.", "location": "SYDNEY", "classification": "security", "score": 0.5226544674682438, "event_breakdown": "1. 15-year-old linked to Sydney bishop's stabbing applies for bail on terrorism charge.\n2. Six teens charged in Sydney court for various offenses, including planning a terrorist act.\n3. Documents submitted in bail application include affidavit from boy's mother, school report cards, and psychological report.\n4. Boy's lawyer argues that facing terrorism accusation is not exceptional for a young person with behavioral issues.\n5. Boy participated in encrypted chat group discussing plans to target Jewish people."}, {"id": "1e1b9c5e-f141-4242-b533-33567347def2", "title": "Middle East Totters on the Edge of a Cliff as two Arch enemies Confront Each Other", "date": "2024-04-30 22:00", "url": "https://thenorthlines.com/middle-east-totters-on-the-edge-of-a-cliff-as-two-arch-enemies-confront-each-other/", "message": "Syria movesto the centre stageof conflict betweenIsrael and IranBy James M DorseyMultiple overt and covert wars have pushed the Middle East to the edge of a cliff.\nIncreased tension between Iran and Israel complicates efforts to pull the Middle East back from the abyss.\nWith the two archenemies walking a fine line between waging covert or overt war, escalation between Israel and Iran has the greatest potential to push the Middle East off the cliff.\nThe US and Israeli denials followed a series of tit-for-tat attacks that threatened to suck Israel, Iran, and potentially the United States into an all-out Middle East war.\nThe Gaza war moved Syria centrestage in the covert Israeli-Iranian confrontation.", "location": "Syria", "classification": "security", "score": 0.6322685986811983, "event_breakdown": "- Syria becomes the center stage of conflict between Israel and Iran\n- Multiple overt and covert wars push the Middle East to the edge of a cliff\n- Increased tension between Iran and Israel complicates efforts to stabilize the region\n- Escalation between Israel and Iran poses a significant risk for the Middle East\n- Tit-for-tat attacks threaten to escalate into a larger conflict involving Israel, Iran, and potentially the United States\n- The Gaza war brings Syria to the forefront of the Israeli-Iranian confrontation."}, {"id": "5c3c61db-e93c-4308-b5fe-9ce8d5ad2f7f", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-04-30 21:30", "url": "https://www.yahoo.com/news/five-killed-russian-missile-attack-195300897.html", "message": "At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Five killed and more than 30 injured in missile attack on Odesa, Ukraine\n- Ukrainian authorities believe Russia used Iskander ballistic missile and cluster munitions in the attack\n- Investigation suggests Russian military intended to inflict large number of casualties with cluster munitions\n- Use of cluster munitions prohibited by international treaty\n- Russian officials claim air defenses in Crimea intercepted missile and drone attack by Ukraine"}, {"id": "42c72956-6a66-4ded-aa07-310844057f4e", "title": "Ukraine  Harry Potter castle  goes up in flames as Russian missile attack kills 5", "date": "2024-04-30 22:30", "url": "https://www.cnn.com/2024/04/30/europe/ukraine-harry-potter-castle-missile-attack-intl-latam/", "message": "CNN —At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "1. Russian missile attack kills five in Odesa, Ukraine.\n2. Ukrainian authorities suspect Iskander ballistic missile and cluster munitions used in attack.\n3. Investigation suggests Russian military intentionally used cluster munitions.\n4. Use of cluster munitions prohibited by international treaty.\n5. Russian officials claim successful interception of missile and drone attack by Ukraine in Crimea."}, {"id": "c5921437-4254-4074-856e-0220661ab270", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA", "classification": "security", "score": 0.3885877145857738, "event_breakdown": "1. Russian missile attack targets educational institution in Odesa, Ukraine's Black Sea port.\n2. Attack kills at least five people and injures 32.\n3. Roof of private law academy severely damaged in the strike.\n4. Odesa Mayor expresses shock and dismay over the incident.\n5. Academy's president, Serhiy Kivalov, among the injured.\n6. Odesa has faced previous missile and drone attacks, especially targeting port infrastructure."}, {"id": "73076528-b206-4a85-8384-8126a9b28e13", "title": "Prosecutors say teen charged in Sydney church stabbing plotted attack on Jewish community", "date": "2024-05-01 15:15", "url": "https://www.yahoo.com/news/prosecutors-teen-charged-sydney-church-144856274.html", "message": "Prosecutors in Australia said Wednesday that a 15-year-old boy charged along with other teens in a stabbing at a church in Sydney plotted an attack against the Jewish community.\nPhoto by Bianca De Marchi/EPA-EFEMay 1 (UPI) -- Australian prosecutors argued on Wednesday that a 15-year-old involved in a stabbing at a Sydney court wanted to attack Jewish community members but his attorney said his talk was nothing more than boasting.\nThe revelations came during a hearing where a judge was determining whether to release the youth on bail.\nThe Joint Counter Terrorism Team arrested the boy and others connected to the April 15 stabbing attack on Bishop Mar Mari Emmanuel and three others inside a church at Wakeley in western Sydney.\n\"I want to do it to a bunch of Jews,\" the boy said on a group chat on April 20, according to prosecutors.", "location": "Sydney, Australia", "classification": "security", "score": 0.41653457284023143, "event_breakdown": "- Australian prosecutors reveal 15-year-old boy charged in Sydney stabbing plotted attack against Jewish community\n- Prosecutors argue that the boy wanted to attack Jewish community members during a hearing for his bail release\n- Joint Counter Terrorism Team arrests boy and others connected to April 15 stabbing at a church in Wakeley, western Sydney"}, {"id": "da5d6cb9-165c-4f40-a03e-572627ceeccd", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames - LocalNews8 . com", "date": "2024-04-30 23:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "By Radina Gigova and Olga Voitovych, CNN(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions for the attack\n- Investigation suggests that the Russian military used cluster munitions with the intention of inflicting a large number of casualties\n- The use, transfer, and production of cluster munitions is prohibited by the Convention on Cluster Munitions\n- Russian officials claim their air defenses in Crimea intercepted a major missile and drone attack by Ukraine"}, {"id": "9676d972-c82c-4866-bd78-8d9927a579ba", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-05-01 01:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "1. Russian missile attack kills at least five, injures over 30 in Odesa, Ukraine.\n2. Ukraine alleges Russia used Iskander ballistic missile and cluster munitions in the attack.\n3. Investigation suggests Russian military intentionally used cluster munitions to cause significant casualties.\n4. Use of cluster munitions prohibited by international treaty.\n5. Russian officials claim air defenses intercept major missile and drone attack by Ukraine in Crimea."}, {"id": "451fede8-e370-4456-a363-cf55996a1195", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.", "location": "CAIRO", "classification": "security", "score": 0.3917279483742275, "event_breakdown": "- Hamas delegation leaves Cairo after cease-fire talks\n- Hamas delegation to return to Cairo with written response to cease-fire proposal\n- Blinken presses Hamas to accept new cease-fire proposal"}, {"id": "9c223222-25cc-446e-911e-f21381ebc399", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.thesunchronicle.com/news/nation_world/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_21ecb329-1284-53b0-9574-d499c18dc8a3.html", "message": "Authorities said a missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea in the latest assault in their campaign against shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.7998231551022632, "event_breakdown": "- Missile attack by Yemen's Houthi rebels damages ship in the Red Sea"}, {"id": "e831a620-dce7-4ebe-a94a-0c6ec858b626", "title": "Russian missile attack on Odesa kills 3 , injures 3", "date": "2024-04-30 23:30", "url": "https://www.yahoo.com/news/russian-missile-attack-odesa-kills-223331340.html", "message": "Russian forces attacked the southern port city of Odesa with ballistic missiles the night of April 30, killing three people and wounding three others, regional Governor Oleh Kiper reported.\nThe Air Force announced a series of air raid alerts in Odesa on the night of April 30.\nThe attack came just a day after a Russian missile attack on April 29 killed at least five people and injured 30 others.\nAir Force spokesperson Illia Yevlash said on television that Russia attacked Odesa with three Iskander-M ballistic missiles.\nRead also: Russian strikes overwhelm Ukraine’s overstretched air defense amid Western aid delaysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "ODESA", "classification": "security", "score": 0.9404200723894179, "event_breakdown": "- Russian forces attacked the southern port city of Odesa with ballistic missiles on the night of April 30\n- The attack resulted in three people being killed and three others wounded, according to regional Governor Oleh Kiper\n- The Air Force announced a series of air raid alerts in Odesa on the night of April 30\n- A Russian missile attack on April 29 had killed at least five people and injured 30 others\n- Air Force spokesperson Illia Yevlash stated on television that Russia attacked Odesa with three Iskander-M ballistic missiles"}]