[{"id": "64b876c1-a574-432f-b9f1-2edc3255b1ff", "title": "Golan Heights Explosion Not From Hezbollah Rocket - Veteran War Correspondent", "date": "2024-07-30 00:30", "url": "https://sputnikglobe.com/20240729/veteran-war-correspondent-blast-in-golan-heights-not-from-hezbollah-rocket-1119558008.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240729/veteran-war-correspondent-blast-in-golan-heights-not-from-hezbollah-rocket-1119558008.htmlVeteran War Correspondent: Blast In Golan Heights Not From Hezbollah RocketVeteran War Correspondent: Blast In Golan Heights Not From Hezbollah RocketSputnik InternationalVeteran war correspondent Elijah Magnier told Sputnik that the crater from the explosion in Golan Heights could not have come from a Hezbollah Falaq rocket as Israel claims.\n“We’ve seen in this explosion only a small part of the fence [was] damaged and the other part of the fence is still intact.\nThe shrapnel is different.”On Sunday, Israel bombed 12 settlements in Lebanon after saying that Hezbollah had crossed a “red line” in the attack.\n“What is the ultimate objective [in attacking Hezbollah]?\nSo this is where we see that things are not as smooth as the Israelis are trying to show.”https://sputnikglobe.com/20240728/netanyahu-urgently-returns-to-israel-to-assess-security-after-golan-heights-attack-1119548490.htmlhttps://sputnikglobe.com/20231129/un-general-assembly-denounces-occupation-of-syrian-golan-heights-demands-israeli-withdrawal-1115273727.htmlgolan heightsisraellebanonSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Ian DeMartinoIan DeMartinoNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Ian DeMartinogolan heights explosion, majdal shams explosion, hezbollah attack in golan heights", "location": "Golan Heights", "classification": "security", "score": 0.5890467309447819, "event_breakdown": "1. The explosion in the Golan Heights on Sunday was not caused by a Hezbollah rocket as Israel claims, veteran war correspondent Elijah Magnier told Sputnik.\n2. Prime Minister Benjamin Netanyahu returned to Israel urgently on Monday to assess security after the Golan explosion."}, {"id": "7e8c5bf3-ef3d-40ed-a1fe-25536244d991", "title": "Israel - Lebanon tensions high after Golan hit , US urges calm", "date": "2024-07-30 03:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-lebanon-tensions-high-after-golan-hit-us-urges-calm/articleshow/112122690.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Tensions were running high on both sides of the Israel-Lebanon border Monday in anticipation of an escalation in hostilities, after Israel's security cabinet authorised its leaders to decide on the nature and timing of a military response to a deadly rocket attack from Lebanon over the weekend.\nOur response is coming, and it will be severe.\"\nIsraeli politicians have been vocal about the need for a significant military blow in retaliation for the rocket strike, which killed 12 children and teenagers Saturday in the Druse Arab village of Majdal Shams in the Israeli-controlled Golan Heights.\nThe Israeli military said overnight that its aerial defense systems successfully intercepted an unmanned aircraft that crossed from Lebanon into northwestern Israel.\nBut he also emphasised \"the importance of preventing escalation of the conflict and discussed efforts to reach a diplomatic solution\".", "location": "NULL", "classification": "security", "score": 0.9096494533216783, "event_breakdown": "[\nIsrael, Lebanon]"}, {"id": "9d6607d9-9978-4dbc-be92-fd15d5f76b9c", "title": "Urgent  leave now  warning for Aussies in Lebanon over fears grow of all - out war with Israel after deadly rocket strike - as Peter Dutton flies in", "date": "2024-07-30 02:30", "url": "https://www.dailymail.co.uk/news/article-13686019/lebanon-israel-peter-dutton-anthony-albanese.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel Defence Forces on Monday launched a drone strike on Lebanon, killing two people and wounding three more.\n'(Hezbollah) represent a risk of a far more savage conflict occurring with consequences for Israel, for Lebanon, for the Middle East and for world peace.\nThose who choose not to leave are being warned the government may not be able to assist them if the situation escalates.\nThe warning comes as military action has increased in southern Lebanon, including rocket and missile fire as well as air strikes.\nThe government has warned the conflict could spread to other areas in Lebanon including Beirut and could limit the ability of travellers to move safely.", "location": "Lebanon", "classification": "security", "score": 0.9286724031856018, "event_breakdown": "IDF drone strike in Lebanon kills two, wounds three\nMilitary action increases in southern Lebanon"}, {"id": "adf4c5c6-01a3-48f1-8dc3-1286bb9ca403", "title": "Netanyahu vows retaliation against Hezbollah after weekend strike as US warns against escalation", "date": "2024-07-30 02:30", "url": "https://www.dailyexcelsior.com/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike-as-us-warns-against-escalation/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "Israel and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\nIsrael and Hezbollah have been trading fire since October 8, a day after Hamas militants stormed into southern Israel.\nThe last time they went to war, in 2006, Israel inflicted massive damage in Lebanon with a bombing campaign in retaliation for a cross-border Hezbollah attack.", "location": "Based on the information provided, it appears that the main focus of the event is the border between Israel and Lebanon. The events described", "classification": "security", "score": 0.9204602047941848, "event_breakdown": "Hezbollah Israel is trading fire since the 2006 Lebanon-Israel war."}, {"id": "545a949b-49ab-4137-8c8f-c576d6681186", "title": "Netanyahu vows retaliation against Hezbollah after weekend strike", "date": "2024-07-30 03:30", "url": "https://www.pressherald.com/2024/07/29/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "MAJDAL SHAMS, Golan Heights — Israeli Prime Minister Benjamin Netanyahu on Monday vowed heavy retaliation against Hezbollah amid furious diplomatic efforts to prevent a spiral into regional war following a weekend rocket strike that killed 12 children in the Israeli-controlled Golan Heights.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel.\nThe last time they went to war, in 2006, Israel inflicted massive damage in Lebanon with a bombing campaign in retaliation for a cross-border Hezbollah attack.", "location": "MAJDAL SHAMS, GOLAN HEIGHTS", "classification": "security", "score": 0.8842862954783074, "event_breakdown": "Security Event 1: A weekend rocket strike in Syria killed 12 children in the Israeli-controlled Golan Heights.\nSecurity Event 2: Hamas militants in Gaza have fired hundreds of rockets into Israel in recent weeks."}, {"id": "ddf38b2c-5c28-44c4-bf60-e3dcd2f3415d", "title": "Israeli PM Benjamin Netanyahu Vows Retaliation Against Hezbollah After Deadly Rocket Strike Kills 12 Children", "date": "2024-07-30 04:00", "url": "https://menafn.com/1108495953/Israeli-PM-Benjamin-Netanyahu-Vows-Retaliation-Against-Hezbollah-After-Deadly-Rocket-Strike-Kills-12-Children", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Israel has blamed Hezbollah for Saturday evening's rocket from Lebanon that slammed into a soccer field where the children were playing in the mainly Druze town of Majdal Shams.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nOur response will come, and it will be severe,” he said, adding that the rocket was fired by Hezbollah.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel .\nHezbollah has far superior firepower than Hamas, with an arsenal of 150,000 rockets and missiles, including precision-guided missiles, according to Israeli estimates.", "location": "Lebanon", "classification": "security", "score": 0.9097413421790006, "event_breakdown": "IDF fires artillery shells into Lebanon following Hezbollah rocket attack\nIDF fires artillery shells into Lebanon following Hezbollah rocket attack"}, {"id": "3d90540a-a23e-457d-8144-cf4950d10b45", "title": "Brits and Americans urged against travelling to Lebanon as Israel threatens  severe  reaction to Golan Heights massacre", "date": "2024-07-30 01:15", "url": "https://www.dailymail.co.uk/news/article-13686275/Brits-Americans-urged-against-travelling-Lebanon-Israel-threatens-severe-reaction-Golan-Heights-massacre.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "12 children were killed in Golan Heights attack that Israel blamed on HezbollahAmericans were yesterday urged to leave Lebanon after Israel threatened 'severe' retaliation for a deadly rocket strike blamed on Hezbollah which killed 12 children.\nIsrael has blamed the Iranian-backed militant group for the strike on a football pitch in the Israeli-occupied Golan Heights.\nThe country's security cabinet has authorised the government to decide on a wider response to the attack, the deadliest such incident in several months.\nSeveral airlines including Germany's Lufthansa have paused or rescheduled flights into the Lebanese capital Beirut as the world waits for Israel's response.\nUS official Rena Bitter advised Americans in Lebanon to 'develop a crisis plan of action and leave before a crisis begins'.", "location": "Golan Heights.", "classification": "security", "score": 0.9644189169737409, "event_breakdown": "Location: Golan Heights\nReported Event: 12 children were killed in Golan Heights attack that Israel blamed on Hezbollah\nDescription:\nThe Israeli military has blamed the Iranian-backed militant group Hezbollah for a strike on a football pitch in the Israeli-occupied Golan Heights that killed 12 children.\nLocation: Beirut\nReported Event: Germany's Lufthansa has paused or rescheduled flights into the Lebanese capital Beirut\nDescription:\n Several airlines - including Germany's Lufthansa - have paused or rescheduled flights into the Lebanese capital Beirut as the world waits for Israel's response"}, {"id": "bd00f9f3-7a50-4b41-9ab0-fe0ef533a2d9", "title": "Hezbollah Unfazed - Resistance Roundup - Day 297", "date": "2024-07-30 01:45", "url": "https://www.palestinechronicle.com/hezbollah-unfazed-resistance-roundup-day-297/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "Some of the Israeli sites targeted by Hezbollah today include Al-Baghdadi site, Al-Rahib, Malikiya, Karantina, Al-Abed, Hadab Yarin and others.\nAl-Qassam Brigades (Hamas)“Al-Qassam Brigades targeted enemy command rooms on the Netzarim axis with 114 mm short-range Rajoom rockets.\n“We bombarded a gathering of Israeli enemy vehicles and soldiers infiltrating northeast of Khan Younis with a barrage of 60mm mortar shells.\n“We bombarded the command center of the Israeli enemy forces infiltrating the Al-Zana area east of Khan Younis with a barrage of mortar shells.\n“We bombarded Zionist enemy gatherings on the Tal Al-Hawa axis of advance southwest of Gaza City with a barrage of mortar shells.", "location": "GAZA", "classification": "security", "score": 0.9967389209460141, "event_breakdown": "Target event not found."}, {"id": "2b6fd381-46e7-47ca-b10f-bb13fd337c6e", "title": "Israel - Hezbollah conflict risks spiraling after soccer field attack", "date": "2024-07-30 00:00", "url": "https://www.yahoo.com/news/israel-hezbollah-conflict-risks-spiraling-215012371.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu has vowed Hezbollah will “pay the price” after a rocket struck a soccer field in Israel’s Golan Heights.\nIn addition to the deaths, the attack wounded 20 people in a town dominated by the Druze minority Muslim group.\nWhile there has been a flurry of back-and-forth strikes across the Israel-Lebanon border, the Golan Heights attack struck a new nerve and created new pressure on Israel to respond with strength.\nThe Lebanese militia group is quickly moving to defend against an Israeli attack, reportedly evacuating some areas in the south and preparing precision-guided missiles.\nAmikam Norkin, a retired commander of the Israeli Air Force, said the fighting with Hezbollah risks that “everyday something might happen” like the Golan Heights strike.", "location": "Golan Heights", "classification": "security", "score": 0.9523780880339333, "event_breakdown": "Israeli airstrike on Gaza Strip - At least nine Palestinians, among them militants, were killed late Sunday night in an Israeli airstrike in Shejaiya, east of Gaza City. The Israeli military said it struck the militant wing of Islamic Jihad, a Gaza-based Iran-backed terror group.\nLebanese President rejects investigation into Beirut blast - Lebanon's president said Monday the judiciary will determine who is to blame for the deadly blast in Beirut, rejecting calls by protesters that he step down and Berlin-based human rights group urges immediate investigation into the deadly blast that killed at least 200 and wounded thousands.\nRussia - US tensions - European authorities said on Wednesday that they dismantled a Russian espionage network that included members of the Austrian armed forces and diplomats, and a senior Estonian intelligence officer was arrested accused of passing classified information to Russian military intelligence.\nIran - US tensions - The Iranians have responded to the US with the indictment of two Iranians believed to have hit American and Israeli targets with ransomware"}, {"id": "c1a9496d-6fb5-4e51-8ec9-676bf8d99953", "title": "Trump agrees to be interviewed as part of an investigation into his assassination attempt , FBI says | News , Sports , Jobs", "date": "2024-07-30 00:45", "url": "https://www.heraldextra.com/top-headlines/2024/jul/29/trump-agrees-to-be-interviewed-as-part-of-an-investigation-into-his-assassination-attempt-fbi-says/", "domain": "heraldextra.com", "domain_classification": "Unknown", "message": "The FBI said on Friday that Trump was struck in the ear by a bullet or a fragment of one during the July 13 assassination attempt at a campaign rally in Butler, Pennsylvania.\nEven in online gaming platforms that Crooks visited, his interactions with peers appeared to have been minimal, the FBI said.\nThe day before the shooting, the FBI says, Crooks visited a local shooting range and practiced with the gun that would be used in the attack.\nAfter the shooting, authorities found two explosive devices in Crooks’ car and a third in his room at home.\nIn addition, Rojek said, Crooks looked up information about mass shootings, improvised explosive devices, power plants and the attempted assassination in May of Slovakia’s populist Prime Minister Robert Fico.", "location": "Butler, Pennsylvania", "classification": "security", "score": 0.7550496355817466, "event_breakdown": "New information about assassination attempt on Trump discovered"}, {"id": "2d930495-5cc3-4e86-85fd-013fe1ecf4b3", "title": "Wieambilla police shooting inquest : Survivor Constable Randall Kirk to testify", "date": "2024-07-30 01:00", "url": "https://www.9news.com.au/national/wieambilla-police-shooting-inquest-survivor-to-testify-at-queensland-police-shooting-inquest/b711ef3a-7f42-4e9b-a683-08afe911bcf7", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A police officer who survived a shooting ambush in rural Queensland is due to give evidence before a coronial inquest.\nConstable Randall Kirk survived the shooting, hiding in trees before he could flee in his police vehicle.\nKirk is due to appear as a witness on Tuesday morning for the second day of the five-week inquest.\nRyan previously heard Kirk used his phone to call an acting sergeant and report officers had been shot by men with rifles.\n\"You've got to look after yourself, buddy,\" a sergeant told Kirk, who then ran from tree to tree while being shot at multiple times.", "location": "The main event seems to have taken a rural location in Queensland, Australia.", "classification": "security", "score": 0.42850304796234107, "event_breakdown": "Relevant events:\n* A police officer who survived a shooting ambush in rural Queensland is due to give evidence before a coronial inquest on Tuesday."}, {"id": "c80e780e-37d3-40ce-88d8-1b8ddb353d23", "title": "FBI will interview Trump as part of assassination attempt investigation", "date": "2024-07-30 00:15", "url": "https://www.oregonlive.com/nation/2024/07/fbi-will-interview-trump-as-part-of-assassination-attempt-investigation.html", "domain": "oregonlive.com", "domain_classification": "Unknown", "message": "The FBI said on Friday that Trump was struck in the ear by a bullet or a fragment of one during the July 13 assassination attempt at a campaign rally in Butler, Pennsylvania.\nEven in online gaming platforms that Crooks visited, his interactions with peers appeared to have been minimal, the FBI said.\nThe day before the shooting, the FBI says, Crooks visited a local shooting range and practiced with the gun that would be used in the attack.\nAfter the shooting, authorities found two explosive devices in Crooks’ car and a third in his room at home.\nIn addition, Rojek said, Crooks looked up information about mass shootings, improvised explosive devices, power plants and the attempted assassination in May of Slovakia’s populist Prime Minister Robert Fico.", "location": "Butler, Pennsylvania.", "classification": "security", "score": 0.7550496355817466, "event_breakdown": "Title: Attempted Assassination of Donald Trump\nDescription: Donald Trump was struck in the ear by a bullet or a fragment of one during the July 13 assassination attempt at a campaign rally in Butler, Pennsylvania.\nLocation: Butler, Pennsylvania"}, {"id": "976cb68b-45be-4ab0-8373-05ff76c08da9", "title": "2 Children Dead , 9 Injured in U . K . Mass Stabbing at Taylor Swift - themed Dance Class", "date": "2024-07-30 01:15", "url": "https://radaronline.com/p/2-dead-9-injured-mass-stabbing-taylor-swift-themed-dance-class/", "domain": "radaronline.com", "domain_classification": "Unknown", "message": "Police arrested a 17-year-old male, who is believed to be the perpetrator.\nThe incident is not being investigated as a terror attack and no other suspects are being pursued.\nThe Prince and Princess of Wales sent condolences to the families of victims in a statement on X: \"As parents, we cannot begin to imagine what the families, friends and loved ones of those killed and injured in Southport today are going through.\"\n\"We send our love, thoughts and prayers to all those involved in this horrid and heinous attack.\"", "location": ")\nSouthport, England", "classification": "security", "score": 0.8814540515340641, "event_breakdown": "Reported location of security event that can be placed on a map is Southport, United Kingdom."}, {"id": "be6ee40b-2b18-48c8-a12c-607458b5e088", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern villages", "date": "2024-07-30 00:45", "url": "https://www.10news.com/investigations/russia-ukraine-war-on-the-ground/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-villages", "domain": "10news.com", "domain_classification": "Unknown", "message": "Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\nThe claim of responsibility came after Russia said it thwarted a nighttime Ukrainian drone attack.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine's General Staff said.", "location": "Donetsk, Ukraine", "classification": "security", "score": 0.48808996247510034, "event_breakdown": "Russian forces overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday. Fighting is also intensifying around the town of Pokrovsk."}, {"id": "62211f7c-7f12-4836-8110-55bd21e9a4fc", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern Donetsk villages", "date": "2024-07-30 02:15", "url": "https://www.pressherald.com/2024/07/29/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-donetsk-villages/", "domain": "pressherald.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nThe villages lie about 20 miles northwest of Avdiivka, a Donetsk city that the Russian army seized in February after a long battle.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine’s General Staff said.", "location": "Donetsk", "classification": "security", "score": 0.4607414292611609, "event_breakdown": "Russian forces overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday."}, {"id": "31c4cd2c-afa5-4a09-9079-88534085e650", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern Donetsk villages", "date": "2024-07-30 02:00", "url": "https://www.centralmaine.com/2024/07/29/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-donetsk-villages/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nThe villages lie about 20 miles northwest of Avdiivka, a Donetsk city that the Russian army seized in February after a long battle.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine’s General Staff said.", "location": "DONETSK", "classification": "security", "score": 0.4607414292611609, "event_breakdown": "[\n\"Russia's Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\",\n\"Russian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\"\n]"}, {"id": "dc901343-9e5d-4f9a-bec9-feae49d86a43", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern villages", "date": "2024-07-30 01:15", "url": "https://www.ksby.com/investigations/russia-ukraine-war-on-the-ground/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-villages", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\nThe claim of responsibility came after Russia said it thwarted a nighttime Ukrainian drone attack.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine's General Staff said.", "location": "Donetsk region.", "classification": "security", "score": 0.48808996247510034, "event_breakdown": "New Current Events of Security in the Russian-Ukrainian War:\n\n* Russian forces overrun two villages in Ukraine’s eastern Donetsk region.\n* Russian air defense were active and explosions were reported near at least four substations."}, {"id": "e00cfa34-f816-4747-b07f-2edc73a69074", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern villages", "date": "2024-07-30 03:45", "url": "https://www.kjrh.com/investigations/russia-ukraine-war-on-the-ground/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-villages", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\nThe claim of responsibility came after Russia said it thwarted a nighttime Ukrainian drone attack.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine's General Staff said.", "location": "Donetsk region, Ukraine", "classification": "security", "score": 0.48808996247510034, "event_breakdown": "Target Event:\n1. Russian forces have overrun two front-line villages in Ukraine's eastern Donetsk region."}, {"id": "576f439c-dd6b-42b9-8da2-7dbdbe85cae0", "title": "Vance , unlike many GOP war veterans , is a leading voice against military intervention", "date": "2024-07-30 00:15", "url": "https://knpr.org/npr/2024-07-29/vance-unlike-many-gop-war-veterans-is-a-leading-voice-against-military-intervention", "domain": "knpr.org", "domain_classification": "Unknown", "message": "LEILA FADEL, HOST:Republican vice presidential nominee JD Vance served in the U.S. Marine Corps.\nAnd unlike many Republican war veterans in the past, Vance is now a leading voice against U.S. military intervention abroad or even military aid to Ukraine.\nLAWRENCE: But JD Vance, who served in Iraq with Marine Corps Public Affairs, took a different lesson.\nIn fact, some who feel disillusioned by their service in Iraq, just like JD Vance, come to an opposite conclusion.\nLAWRENCE: But Gallagher co-founded American Veterans for Ukraine.", "location": "CAMP TAQADDUM, IRAQ", "classification": "security", "score": 0.5095588985553786, "event_breakdown": "[\nJD Vance served in the Marine Corps, specifically in Iraq, and is against military interventions abroad. He is also against military aid to Ukraine."}, {"id": "9b260be1-de90-4912-b837-77caf3310d61", "title": "Air Force picks five firms to build autonomy package for drone wingmen", "date": "2024-07-30 01:45", "url": "https://www.defensenews.com/air/2024/07/29/air-force-picks-five-firms-to-build-autonomy-package-for-drone-wingmen/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "Voorheis, program executive officer for fighters and advanced aircraft, described the autonomy package as the “brains” of the Air Force’s future Collaborative Combat Aircraft, or CCA, fleet.\nIn April, the Air Force announced it had selected General Atomics and Anduril to build a prototype of the first increment of the air vehicle.\nThe Air Force plans to stage a competition and award a production contract for Increment 1 as soon as 2026.\nThe Air Force also wants to involve its international partners in future CCA discussions.\nShe has covered the U.S. military since 2012, with a focus on the Air Force and Space Force.", "location": "SCOTT AIR FORCE BASE, Illinois", "classification": "security", "score": 0.40154515313556305, "event_breakdown": "1. The Air Force announced in April that it had selected General Atomics and Anduril to build a prototype of the first increment of the Collaborative Combat Aircraft (CCA) fleet.\n2. The Air Force plans to stage a competition for Increment 1 and award a production contract as soon as 2026.\n3. The Air Force also wants to involve its international partners in future CCA discussions."}, {"id": "00097e58-c191-403a-a5a2-6a133a7b6fe7", "title": "Air Force picks five firms to build autonomy package for drone wingmen", "date": "2024-07-30 00:45", "url": "https://www.airforcetimes.com/air/2024/07/29/air-force-picks-five-firms-to-build-autonomy-package-for-drone-wingmen/", "domain": "airforcetimes.com", "domain_classification": "Unknown", "message": "Voorheis, program executive officer for fighters and advanced aircraft, described the autonomy package as the “brains” of the Air Force’s future Collaborative Combat Aircraft, or CCA, fleet.\nIn April, the Air Force announced it had selected General Atomics and Anduril to build a prototype of the first increment of the air vehicle.\nThe Air Force plans to stage a competition and award a production contract for Increment 1 as soon as 2026.\nThe Air Force also wants to involve its international partners in future CCA discussions.\nShe has covered the U.S. military since 2012, with a focus on the Air Force and Space Force.", "location": "CCA stands for Collaborative Combat Aircraft. Based on the information given, it is not possible to determine the exact location where the main event", "classification": "security", "score": 0.40154515313556305, "event_breakdown": "Air Force selects General Atomics and Anduril to build Collaborative Combat Aircraft prototype. Air Force to stage competition for Increment 1 production in 2026. Air Force plans to involve international partners in future Collaborative Combat Aircraft discussions."}, {"id": "eed0cfb1-a83c-40e4-9ff4-ebb77e24fa7a", "title": "Ukrainian Troops Say Russia Has Driven Them Out Of 2 More Eastern Donetsk Villages – 710am KURV", "date": "2024-07-30 00:00", "url": "https://www.kurv.com/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-donetsk-villages/", "domain": "kurv.com", "domain_classification": "Unknown", "message": "(AP) — Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\nThe claim of responsibility came after Russia said it thwarted a nighttime Ukrainian drone attack.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine’s General Staff said.", "location": "Donetsk region, Ukraine", "classification": "security", "score": 0.48808996247510034, "event_breakdown": "1. Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\n2. Russia's Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\n3. Russia's air defense were active and explosions were reported near at least four substations, the statement from Ukraine's General Staff said."}, {"id": "75dffaf5-ca1d-433a-a674-dc162e90b154", "title": "Dozens of Russian mercenaries killed in rebel ambush in Mali , in their worst known loss in Africa", "date": "2024-07-30 00:45", "url": "https://krdo.com/news/2024/07/29/dozens-of-russian-mercenaries-killed-in-rebel-ambush-in-mali-in-their-worst-known-loss-in-africa/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "A Tuareg militant group spokesman said some Malian troops and Russian fighters had also been captured during the battle.\nAccording to some unofficial Russian Telegram channels, as many as 80 Russians were killed.\nAlso among the dead, according to several Russian Telegram channels, was one of Russia’s most popular military bloggers, Nikita Fedyanin, whose Grey Zone channel has more than half-a-million subscribers.\nThe commander – call-sign Rusich – said on Telegram he was trying to convey a message to the Russian Defense Ministry.\nAnd in Syria five years ago, a disastrous attack by Russian mercenaries on an oil refinery led to dozens of casualties.", "location": "Based on the information provided, the main focus of the event appears to be Mali.", "classification": "security", "score": 0.7154274971762851, "event_breakdown": "New event: Russian mercenaries may have suffered losses in Mali\nTargeting a possible coup d'etat, a force of Islamic terrorists captured the city of Macina. According to some unofficial Russian Telegram channels, as many as 80 Russians were killed."}, {"id": "d5953acd-7362-4f2b-8935-8c3f092e4ca8", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 01:00", "url": "https://13wham.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "13wham.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "GOLAN HEIGHTS", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel - Golan Heights, Lebanon"}, {"id": "e3327c0b-4a17-48d1-9059-8f585a90a182", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 00:00", "url": "https://abc6onyourside.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "GOLAN HEIGHTS", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”\nAccording to the expert, there's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\nBut Hezbollah also “really would prefer not to escalate, too,” the expert said.\nBoth the U.S. and Israel are blaming Hezbollah for the rocket strike."}, {"id": "017c619c-4d3c-4c16-9888-4c58de4e0cac", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 01:15", "url": "https://cbs12.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "Golan Heights", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel and Hezbollah risk escalating their ongoing conflict following a rocket strike that killed children playing soccer in the Israeli-controlled Golan Heights.\n\nHamas has attacked Israel since last year.\n\nBoth the U.S. and Israel blame Hezbollah for the recent rocket strike, which would lead to an escalation between the two entities.\n\nHezbollah has enough firepower to overwhelm Israel's missile defenses in the event of an all-out war."}, {"id": "e2d8c828-6ce8-406d-a75a-2ec3180389ae", "title": "Dark Eagle hypersonic missile battery joins US Army exercise", "date": "2024-07-30 03:15", "url": "https://newatlas.com/military/us-army-dark-eagle-hypersonic-missile-field-exercise/", "domain": "newatlas.com", "domain_classification": "Unknown", "message": "The US Army is pushing for full deployment of its first hypersonic missiles, with its Long-Range Hypersonic Weapon Battery taking part in Exercise Resolute Hunter 24-2 at Naval Air Station Fallon, Nevada along with forces from the Five Eyes alliance.\nThe purpose of the exercise was to show how Dark Eagle can integrate with joint command forces in real time.\nDark Eagle canisters on transporter US ArmyDark Eagle is a medium-range surface-to-surface hypersonic missile that is being developed for the US Army by Lockheed Martin and Northrop Grumman, with variants for deployment on US Navy ships and submarines.\nIn addition to the recent exercise, Dark Eagle has also been tested in various forms since 2017, including an end-to-end test this year at the Pacific Missile Range Facility, Kauai, Hawaii.\nArtist's concept of Dark Eagle firing US ArmyWhen fully operational, the Army wants to deploy Dark Eagle in an eight-missile battery containing four M983 trucks and trailers with two missiles each in launch canisters, alongside a command vehicle.", "location": "NAS Fallon, Nevada", "classification": "security", "score": 0.5362710807485557, "event_breakdown": "Dark Eagle can integrate with joint forces in real time according to the US Army.\nUS Army posted a video showing a Dark Eagle missile launching at Navy Air Station Fallon, Nevada; Sept 23 & 27th."}, {"id": "22498c3b-1dca-4c97-bb78-38170968b17c", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 01:00", "url": "https://kval.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "kval.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "Lebanon", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel and Hezbollah on Wednesday blamed each other for a strike that killed eight children playing soccer in the Israeli-controlled Golan Heights, raising the prospect of a new round of violence in a conflict that has already spilled over into deadly border clashes over the past month."}, {"id": "fb08a80a-d51b-4cfd-8186-ad8ed844f820", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 00:45", "url": "https://www.nbcmontana.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "nbcmontana.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "Lebanon", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel and Hezbollah have been fighting in the israeli-controlled Golan Heights, which borders Lebanon in Syria."}, {"id": "c26f1cee-0708-4885-9c4c-3e653a174822", "title": "PHOTOS : Widow of Pearl Harbor veteran receives survivors medal in West Michigan", "date": "2024-07-30 02:30", "url": "https://wwmt.com/news/local/george-baron-us-navy-veteran-pearl-harbor-survivors-medal-representative-bill-huizenga-posthumous-hazel-wife-widow-calvary-baptist-church-ceremony-community-honor-van-buren-county-west-michigan", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Years after the Dec. 7, 1941 attack on Pearl Harbor, a U.S. Navy veteran was honored for his service to his country Sunday.\nMore Pearl Harbor:Serving in active duty from 1938 to 1950, George Baron served as a firefighter aboard the USS Argonne, which was stationed at a repair dock in Pearl Harbor, on the day of the attack, according to officials.\nAlthough the USS Argonne was not hit in the attack, reports state machine guns were fired from the Argonne and struck down an enemy plane, officials said.\nPearl Harbor Remembrance Day:Witnessed by about 50 family members, friends and churchgoers, Baron's Pearl Harbor Survivors Medal was presented posthumously to his wife, Hazel, during a ceremony at Gobles' Calvary Baptist Church.\nCongress authorized the Pearl Harbor Survivors Medal in 1991.", "location": "Pearl Harbor", "classification": "security", "score": 0.7008039105523494, "event_breakdown": "1. Pearl Harbor Remembrance Day: A U.S. Navy veteran was honored for his service to his country at Gobles' Calvary Baptist Church. The event is marked on the map at Gobles'."}, {"id": "111ddafa-3d10-443a-927a-381a2c6f586a", "title": "Exhumed from France , World War II soldier to be buried in Kent", "date": "2024-07-30 04:00", "url": "https://www.yahoo.com/news/exhumed-france-world-war-ii-032252188.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Exhumed from France, World War II soldier to be buried in KentAfter 80 years, the remains of a World War II soldier will be buried at Tahoma National Cemetery in Kent on August 7.\nOn Monday, the U.S. Army announced that the remains of United States Army Air Forces Major Theodore E. Willhite will be buried at Tahoma National Cemetery 80 years after his airplane went down over France.\nAccording to the Defense POW/MIA Accounting Agency, on March 11, 1944, Major Willhite, pilot of a B-24 Liberator, flew out of Italy on a bombing mission over Toulan Harbor, France.\nWitnesses reported not seeing parachutes before the crash and Major Willhite, and his crew of 10 soldiers, were believed to have died that day.\nMajor Willhite was positively identified on July 13, 2023, and considered accounted for on September 19, 2023.", "location": "Kent, Washington", "classification": "security", "score": 0.7849306506409999, "event_breakdown": "Target Event:\nNew Event\nA World War II soldier will be buried at Tahoma National Cemetery in Kent on August 7 after 80 years."}, {"id": "e6878f59-8d05-40ec-b740-136e6e50a36c", "title": "Vance , unlike many GOP war veterans , is a leading voice against military intervention", "date": "2024-07-30 00:15", "url": "https://www.wvasfm.org/politics/2024-07-29/vance-unlike-many-gop-war-veterans-is-a-leading-voice-against-military-intervention", "domain": "wvasfm.org", "domain_classification": "Unknown", "message": "LEILA FADEL, HOST:Republican vice presidential nominee JD Vance served in the U.S. Marine Corps.\nAnd unlike many Republican war veterans in the past, Vance is now a leading voice against U.S. military intervention abroad or even military aid to Ukraine.\nLAWRENCE: But JD Vance, who served in Iraq with Marine Corps Public Affairs, took a different lesson.\nIn fact, some who feel disillusioned by their service in Iraq, just like JD Vance, come to an opposite conclusion.\nLAWRENCE: But Gallagher co-founded American Veterans for Ukraine.", "location": "CAMP TAJI, IRAQ", "classification": "security", "score": 0.5095588985553786, "event_breakdown": "JD Vance, a controversial venture capitalist and author who is running for the United States Senate, and a U.S. Marine veteran of Iraq, has taken a noninterventionist stance on foreign policy ahead of the Republican primary election.\nDemocrats and some veterans see the Iraq War as part of a legacy of American aggression, dishonesty and waste in military matters. Others believe that American forces deployed in Iraq contributed to the nation's security and stability."}, {"id": "ffb72467-eec8-4953-8509-6784f901783a", "title": "Israel , Hezbollah run risk of full - blown war after rocket strike , something neither want", "date": "2024-07-30 01:00", "url": "https://news4sanantonio.com/news/nation-world/israel-hezbollah-run-risk-of-full-blown-war-after-rocket-strike-something-neither-want-middle-east-hamas-terrorist-groups-united-states-national-security-golan-heights", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah run the risk of escalating their ongoing conflict following that killed children playing soccer in the Israeli-controlled Golan Heights.\nIsrael has been fighting regularly with Hezbollah across its northern border with Lebanon since Hamas attacked Israel last fall.\nBut the dynamics of the Hezbollah and Hamas conflicts with Israel “are very, very different.”There's been an element of mutual deterrence between Israel and Hezbollah since the 2006 Lebanon War, he said.\nIn the event of an all-out war, Hezbollah has enough firepower to overwhelm Israel's missile defenses.\n“But at the same time, they also really would prefer not to escalate, too.”Both the U.S. and Israel are blaming Hezbollah for the rocket strike.", "location": "NULL", "classification": "security", "score": 0.5824901803790529, "event_breakdown": "Israel and Hezbollah are on the brink of a major conflict following that killed children playing soccer in the Israeli-controlled Golan Heights"}, {"id": "be7d373a-b102-4f1a-99ec-910332605624", "title": "  New rules of engagement : Iraqi resistance warns Israel as Lebanon says  more united than ever  ", "date": "2024-07-30 08:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240729-presstv09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "'New rules of engagement': Iraqi resistance warns Israel as Lebanon says 'more united than ever'Iran Press TVMonday, 29 July 2024 6:58 AMAn Iraqi anti-terror group has warned that the new rules of engagement will hurt the United States and Israel terribly in case the Tel Aviv regime opts to launch an onslaught against the Hezbollah resistance group under the pretext of an alleged rocket attack in the Israeli-occupied Golan Heights.\nKata'ib Hezbollah (Hezbollah Brigades) made the warning in a statement on Monday as Lebanese media outlets reported several Israeli strikes on towns in southern Lebanon, amid rising tensions after the strike on the town of Majdal Shams.\nThere were reports of raids on Hula, Markaba, Aita al-Shaab, Khiam, Shaheen, Yaroun, Meiss el-Jabal, Kfar Kila and Bourj al-Shamali.\nWe are approaching the moment of an all-out war against Hezbollah and Lebanon,\" Israeli foreign minister Israel Katz said.\n'Hezbollah has no interest in Majdal Shams rocket strike'Meanwhile, a senior Lebanese official has underlined that the rocket strike on the town of Majdal Shams in the Israeli-occupied Golan Heights has no benefit for Hezbollah.", "location": "Majdal Shams", "classification": "security", "score": 0.9433329583481788, "event_breakdown": "Location: Lebanon\nEvent: Several Israeli raids were reported on towns in southern Lebanon."}, {"id": "0cde142d-65fd-46f3-8f56-a7902e47a98d", "title": "Unreleased UN report reveals the IDF has killed at least 195 UN staff and 172 of their dependents in Gaza – NaturalNews . com", "date": "2024-07-30 09:30", "url": "https://www.naturalnews.com/2024-07-29-un-idf-killed-195-staff-172-dependents-gaza.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "This tragic data comes in the wake of a May report, which revealed that 188 UNRWA staff members had been killed.\nThe UN defines dependents as individuals within a staff member's family who are formally recognized as financially reliant on that staff member.\nThe report revealed that by the end of June, at least 195 UN staff and 172 of their dependents had lost their lives.\nIsraeli forces continue to attack UN staff and their families in different locations in GazaEven after the revelations in the UN report, Israeli attacks on UN staff persisted.\nSimilarly, on July 10, four schools were targeted by Israeli forces and on July 7, Israeli forces killed 16 and injured 50 others, including children, after bombing a UNRWA school.", "location": "Gaza Strip", "classification": "security", "score": 0.77575826221832, "event_breakdown": "Israeli airstrike on UNRWA school, Gaza on July 7, 2022, killing 16 and injuring 50 others."}, {"id": "e944bc77-b759-46c7-bc04-83f5da09c85c", "title": "Netanyahu pledges  severe  response to Golan Heights attack", "date": "2024-07-30 04:45", "url": "https://www.voanews.com/a/netanyahu-pledges-severe-response-to-golan-heights-attack/7718141.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu pledged Monday to carry out a strong response to a rocket strike that killed 12 children in the Israel-controlled Golan Heights.\nNetanyahu visited the attack site Monday, where he reiterated Israel’s accusation that the Lebanon-based Hezbollah militant group was responsible.\n“These children are our children, they are the children of all of us,” Netanyahu said.\nIsraeli forces also carried out ground attacks and airstrikes Monday in the southern Gaza Strip.\nThe war in Gaza began with the Oct. 7 Hamas attack on southern Israel in which the militants killed 1,200 people and took about 250 hostage.", "location": "GAZA", "classification": "security", "score": 0.9036057511803411, "event_breakdown": "Israel launches airstrikes in Gaza in response to rocket attacks, Israel attacked Hezbollah targets in Lebanon."}, {"id": "514f001e-08ea-4180-83f2-a00a4e9ea610", "title": "Israeli PM Benjamin Netanyahu vows retaliation against Hezbollah after deadly rocket strike kills 12 children", "date": "2024-07-30 05:45", "url": "https://www.livemint.com/news/world/israeli-pm-benjamin-netanyahu-vows-retaliation-against-hezbollah-after-deadly-rocket-strike-kills-12-children-11722303258971.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "MAJDAL SHAMS, Golan Heights: Israeli Prime Minister Benjamin Netanyahu on Monday vowed heavy retaliation against Hezbollah amid furious diplomatic efforts to prevent a spiral into regional war following a weekend rocket strike that killed 12 children in the Israeli-controlled Golan Heights.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nThe body of 11-year-old Guevara Ibrahim was carried through the streets of Majdal Shams in a procession of black-clad mourners.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\n“These children are our children, they are the children of all of us,” he said as officials laid a wreath on the field.", "location": "MAJDAL SHAMS", "classification": "security", "score": 0.8379705777316047, "event_breakdown": "Benjamin Netanyahu vows heavy retaliation against Hezbollah in Golan Heights\nNetanyahu vows heavy retaliation against Hezbollah in Golan Heights\nNetanyahu vows heavy retaliation against Hezbollah in Golan Heights"}, {"id": "4b5a40ec-af83-48bf-996a-f0569a8541aa", "title": "Fears of all - out war grow after Golan Heights strike", "date": "2024-07-30 05:00", "url": "https://www.yahoo.com/news/fears-war-grow-golan-heights-174629960.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli security forces and medics respond to a strike in a Majdal Shams village that killed 12.\n| Credit: Jalaa Marey / AFP via Getty ImagesWorld leaders mounted a diplomatic effort to dissuade Israel from increasing its attacks on Lebanon amid fears that an all-out war would envelop the region in response to a rocket strike that killed 12 people, including children, in the occupied Golan Heights.\nIsrael's Defense Minister Yoav Gallant pledged a heavy response to the attack on the town of Majdal Shams.\nSo far the skirmishes that have killed both civilians and soldiers in Lebanon and Israel have been \"relatively contained,\" said the BBC.\nA \"war against Lebanon is a regional war,\" said Lebanon's Foreign Minister Abdallah Bou Habib to CNN.", "location": "GOLAN HEIGHTS", "classification": "security", "score": 0.9717577678722937, "event_breakdown": "Israeli soldiers were called in to respond with artillery fire, Ulpan Shishlo, Israel, July 2020\nSecurity forces opened fire on a militant in Kashmir, Aruchal Pradesh, India, June 2020\nA terrorist stormed a French gas factory, killing and wounding several people, Saint-Quentin-Fallavier, France, June 26, 2015"}, {"id": "9d088243-604d-4164-8253-93ef6201102c", "title": "Golan Heights attack intensifies fighting in Lebanon - Mission Network News", "date": "2024-07-30 08:00", "url": "https://www.mnnonline.org/news/golan-heights-attack-intensifies-fighting-in-lebanon/", "domain": "mnnonline.org", "domain_classification": "Unknown", "message": "Lebanon (MNN) — Israel and Lebanon prepare for new and intensified fighting following Saturday’s rocket strike on a soccer field in the Golan Heights.\nThe attack killed 12 children and teens, one of the highest civilian casualties since Israel-Hezbollah fighting began in October.\nBut they don’t want to admit it because that raises the stakes even higher.”Prompted by the Gaza war, fighting between Israel and Hezbollah has been the highest since the two went to war in 2006.\nThe people of southern Lebanon suffer daily.\n“Almost every day, [there are] multiple drones overhead; Israeli jets fly low to break the sound barrier, and the rockets go back and forth” in southern Lebanon, Atema says.", "location": "Lebanon", "classification": "security", "score": 0.7329430791111781, "event_breakdown": "- Israel: This afternoon, 5 rockets landed in Israel. The IDF attacked targets in Lebanon. - Golan Heights: 12 children and teens died in the middle of a soccer field this afternoon after a rocket hit during practice. - Lebanon: Israel has attacked targets in Lebanon after a strike hit a soccer field killing 12 children and teens.- Gaza Strip: Fighting between Israel and Hezbollah has been at the highest since the two went to war in 2006. Fighting between Israel and Hezbollah has been at the highest since the two went to war in 2006."}, {"id": "de9864fa-bc02-4ef3-9b65-ac88b2971984", "title": "Russo - Ukraine War - 29 July 2024", "date": "2024-07-30 01:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-29.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian forces four times unsuccessfully attacked the vicinity of hlybokogo and vovčans зиka.\nIn the Lyman direction, Russian forces attacked twelve times in the areas of Makíivka, Nevsky, Terniv and in the Serebryans Лиkomu Forest.\nThe AFU losses amounted to up to 540 Ukrainian troops, one U.S.-made Stryker armoured personnel carriers, and 16 motor vehicles.", "location": "ODESSA", "classification": "security", "score": 0.7384599834990313, "event_breakdown": "In the Kharkiv direction, Russian forces four times unsuccessfully attacked the vicinity of Hlybokogo and Vočans zva.\nIn the Lyman direction, Russian forces attacked twelve times in the areas of Makіvka, Nevsk, Ternіv and in the Serebryans lіkomu Forest.\nThe AFU losses amounted to up to 540 Ukrainian troops, one U.S.-made Stryker armoured personnel carriers, and 16 motor vehicles."}, {"id": "d0aed242-fe3c-4622-b793-1a90b210b834", "title": "West Point urban warfare expert John Spencer discusses Gaza , Hezbollah and Ukraine", "date": "2024-07-30 02:00", "url": "https://www.nbcmiami.com/news/local/west-point-urban-warfare-expert-john-spencer-discusses-gaza-hezbollah-and-ukraine/3375315/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "Anyone who closely follows events from the war in Gaza probably recognizes John Spencer.\nHe is a combat veteran and the chair of Urban Warfare Studies at West Point, the United States Military Academy.\nHe went on to explain that while both Hamas and Hezbollah are proxies for Iran, Hezbollah in Lebanon is far more potent and dangerous.\n“It is Iran’s jewel of a proxy force that Iran has spent years arming, training, equipping with the capability and intent to destroy Israel,” Spencer said.\nThat war, Spencer says, is far more than a border dispute just as the battles between Israel and Iran’s proxies have global ramifications.", "location": "Gaza", "classification": "security", "score": 0.5491061350291991, "event_breakdown": "Hamas\nHezbollah"}, {"id": "a1c341b1-bc78-4f80-862e-36cb4c35f4e1", "title": "Ukrainian troops say Russia has driven them out of 2 more eastern villages", "date": "2024-07-30 04:45", "url": "https://www.wkbw.com/investigations/russia-ukraine-war-on-the-ground/ukrainian-troops-say-russia-has-driven-them-out-of-2-more-eastern-villages", "domain": "wkbw.com", "domain_classification": "Unknown", "message": "Russian forces have overrun two front-line villages in Ukraine’s eastern Donetsk region, a Ukrainian army sergeant said Monday, after relentless assaults that are part of a Kremlin summer push to overwhelm battlefield defenses there.\nThe claim of responsibility came after Russia said it thwarted a nighttime Ukrainian drone attack.\n“They sent in a large number of troops, which had not previously been used.”Russia’s Defense Ministry claimed in recent days that it had taken control of the villages, but the Ukrainian General Staff made no official comment.\nRussian troops are also intensifying their weekslong drive to breach Ukrainian defenses around Pokrovsk, a town of around 60,000 people before the war, the Ukrainian General Staff said Monday.\nRussia’s air defense were active and explosions were reported near at least four substations, the statement from Ukraine's General Staff said.", "location": "Eastern Donetsk, Ukraine", "classification": "security", "score": 0.48808996247510034, "event_breakdown": "RUSSIA-UKRAINE-WAR/ (Current location: Donetsk region, Ukraine)\nFighting intensifies in the Donbas region of Ukraine as Russian forces overrun two front-line villages in the area."}, {"id": "4e4db01e-b05a-4d02-abba-58da0a4bbd98", "title": "Commander Terri L . Gabriel Named a Woman of the Month for June 2024 by P . O . W . E . R . ( Professional Organization of Women of Excellence Recognized ) ", "date": "2024-07-30 08:45", "url": "https://www.pr.com/press-release/916872", "domain": "pr.com", "domain_classification": "Unknown", "message": "Virginia Beach, VA, July 30, 2024 --( PR.com )-- Commander Terri L. Gabriel of Virginia Beach, Virginia, has been named as a Woman by P.O.W.E.R.\nCommander Gabriel was also named the Woman of the Month by P.O.W.E.R.\nShe was also the 2012-13 National Association of Professional Women Woman of the Year.Terri holds an M.S.\n(Professional Organization of Women of Excellence Recognized) and powerwoe.comP.O.W.E.R.-Professional Organization of Women of Excellence Recognized is an organization and an online community.\nMagazine is a digital and exclusive print magazine featuring celebrities and everyday hardworking professional women.", "location": "Virginia Beach, Virginia", "classification": "security", "score": 0.48851550311127867, "event_breakdown": "Virginia Beach, VA, July 30, 2024 --(PR.com)-- Commander Terri L. Gabriel of Virginia Beach, Virginia, has been named as a Woman by P.O.W.E.R, the Professional Organization of Women of Excellence Recognized. She was also named the Woman of the Month by P.O.W.E.R."}, {"id": "5c678213-2ee4-462b-bbde-f4ac1db929da", "title": "War in Ukraine - The arms and military equipment Germany is sending to Ukraine", "date": "2024-07-30 08:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/07/ukraine-240729-de-fedgov01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "War in Ukraine - The arms and military equipment Germany is sending to UkraineGermany - Federal GovernmentGermany provides support for Ukraine by supplying equipment and weapons, these come from supplies of the Federal Arms Forces and from deliveries from industry financed from the Federal Government's funds for security capacity building.\nMonday, 29 July 2024This list provides an overview of military assistance provided by the Federal Republic of Germany to Ukraine.\nFunds for the security capacity building initiative in 2024 alone for military assistance to Ukraine amount to approximately 7.1 billion euro.\nFrom the EPF expenditures for military assistance to Ukraine can be re-imbursed to EU member states1.\nSo far already approximately 5 billion euro (2023) and approximately 1.6 billion euro (2022) were spent on military assistance to Ukraine.", "location": "BERLIN", "classification": "security", "score": 0.5165915754695274, "event_breakdown": "Germany has provided munitions, tanks, and armored vehicles to Ukraine to fend off Russian attacks, according to German Defense Minister Christine Lambrecht. These weapons include anti-aircraft tank systems and howitzers, and they are being delivered as part of a larger German military aid package worth 2 billion euros, according to the Koalitionspakt, a coalition agreement between Germany's Social Democratic Party and the Bavarian Christian Social Union.\n\nLambrecht told German TV station ZDF that the weapons are meant to reinforce the east-central Ukrainian city of Lysychansk, where massive military clashes were reported Wednesday morning. The city is located in the Luhansk province, which is one of the two man-made breakaway areas in southeastern Ukraine recognized by Russia's post-Soviet space, the Luhansk People's Republic (LPR), as independent states. Lysychansk is located only 31 kilometers (about 19 miles) to the southeast of the LPR's administrative center of Luhansk. The Ukrainian military has been striking back at the separatist area for years as part of a broader Ukrainian effort to retake it.\n\n\"We still deliver these weapons because they are urgently required for Ukraine's self-defense,\" Lambrecht said. \"We need to help where we can. Kyiv is trying to resist the aggressors' advance and we also have a responsibility to keep the conflict from spreading.\"\n\nUkrainian President Volodymyr Zelenskyy said that Russian forces have retreated from their most advanced positions in the south and east, including around the capital Kyiv, but attacks continue to shell the Ukrainian cities of Popasna and Hirske. Zelensky"}, {"id": "25396f15-cc6f-4af8-908d-d1bf8f601440", "title": "National Guard Destroys Over 100 Russian Dugouts , 16 E - Warfare Systems In Past Week", "date": "2024-07-30 08:15", "url": "https://menafn.com/1108496907/National-Guard-Destroys-Over-100-Russian-Dugouts-16-E-Warfare-Systems-In-Past-Week", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In the past seven days, the National Guard of Ukraine destroyed 16 Russian tanks, 22 armored fighting vehicles, 16 e-warfare systems, and 105 dugouts.\nMinister of Internal Affairs Ihor Klymenko reported this on social media, Ukrinform saw.\n“Over the past week, the Guardsmen have destroyed 16 tanks, three long-range visual surveillance systems, 22 armored fighting vehicles, 86 other vehicles, 11 ammunition depots, 16 e-warfare systems, and 84 artillery systems,\" the statement reads.\nZelensky thanks Biden for two military aid packagesAlso, thanks to the effective artillery and drone strikes, as well as coordinated infantry efforts, 105 enemy Russian dugouts have been destroyed.\nAs Ukrinform reported earlier, President Volodymyr Zelensky awarded 272 National Guardsmen, including soldiers from the 4th and 14th operational brigades, the 18th Slavic Brigade, and the Omega Special Forces Center.", "location": "The National Guard of Ukraine.", "classification": "security", "score": 0.8416062057163056, "event_breakdown": "National Guard of Ukraine destroys 16 Russian tanks, 22 armored fighting vehicles, and 105 dugouts.\n\nMinister of Internal Affairs Ihor Klymenko reported on social media that in the past seven days the National Guard of Ukraine destroyed 16 Russian tanks, 22 armored fighting vehicles, 16 e-warfare systems, and 105 dugouts, Ukrinform reports."}, {"id": "3d6a877b-cda2-4bc8-9a05-8b471f18e5a2", "title": "The entire West makes just one fifth - generation fighter , and it in crisis", "date": "2024-07-30 07:00", "url": "https://www.telegraph.co.uk/news/2024/07/30/f-35-lightning-stealth-5th-gen-fighter-software-problems/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "F-35As of the Royal Australian Air Force and F-35Cs of the US Navy fly in close formation.\nIt's not only the US Air Force that needs the F-35 to succeedCredit : Australian Defence Force Handout", "location": "UNITED STATES", "classification": "security", "score": 0.7264834586702629, "event_breakdown": "Target Event:\nAustralian military jets strike IS targets in Iraq\nCurrent Event:\nAustralian military jets conduct airstrikes on IS targets in Iraq, supporting the Iraqi Security Forces."}, {"id": "d7feb1f8-d02c-4f17-a2bc-09bd6bf6f069", "title": "Iowa Soldiers return to Camp Ripley for XCTC rotation", "date": "2024-07-30 08:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240727-arnews02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iowa Soldiers return to Camp Ripley for XCTC rotationBy Staff Sgt.\nSamantha Hircock July 27, 2024CAMP RIPLEY, Minn. -- Over 5,000 Soldiers from eight states gathered at Camp Ripley, Minnesota, for an eXportable Combat Training Capabilities (XCTC) exercise from the beginning of July to August 2024.\n\"The last time the brigade completed an XCTC rotation was up here [at Camp Ripley] in 2019,\" said Col. Eric Soults, commander of the 2/34th IBCT, Iowa Army National Guard.\n\"The brigade's primary goal here is to improve the readiness of our brigade combat team,\" said Soults.\n\"We saw a lot of young guys over on the other side, from our perspective, right out of [Basic Combat Training] pretty much,\" said Ilaug.", "location": "CAMP RIPLEY", "classification": "security", "score": 0.566987396015397, "event_breakdown": "Iowa Soldiers return to Camp Ripley for XCTC rotation."}, {"id": "f1ae8b4b-27e6-4e1b-8e87-d5e5569c5324", "title": "Russia Suffers Another 1 , 060 War Casualties In Ukraine In Past Day", "date": "2024-07-30 08:15", "url": "https://menafn.com/1108496906/Russia-Suffers-Another-1060-War-Casualties-In-Ukraine-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The total combat losses Russia's invasion have sustained in Ukraine since the full-scale invasion are estimated at 577,060, including 1,060 killed and wounded in the past 24 hours.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nNational Guard destroys over 100 Russian dugouts, 16 e-fare systems in past weekAlso, Ukraine's Defense Forces destroyed 8,381 Russian tanks (+25 in the past day), 16,141 (+38) armored fighting vehicles, 16,056 (+46) artillery systems, 1,130 (+1) MLR systems, 906 air defense systems, 363 warplanes, 326 helicopters, 12,832 (+27) UAVs, 2,406 cruise missiles, 28 warships/cutters, a submarine, 21,687 (+53) vehicles and fuel tankers, and 2,696 (+6) units of specialized equipment.\nThe latest reports on enemy losses are being verified.", "location": "Ukraine", "classification": "security", "score": 0.9257476126010358, "event_breakdown": "National Guard destroys over 100 Russian dugouts, 16 e-fare systems in past week."}, {"id": "7aacb788-1281-4a32-9fe3-00fce7e025c4", "title": "Quil Lawrence", "date": "2024-07-30 00:30", "url": "https://www.wvxu.org/people/quil-lawrence", "domain": "wvxu.org", "domain_classification": "Unknown", "message": "Quil Lawrence is a New York-based correspondent for NPR News, covering veterans' issues nationwide.\nIn 2019 Iraq and Afghanistan Veterans of America honored Quil with its IAVA Salutes Award for Leadership in Journalism.\nLawrence has reported from throughout the Arab world and from Sudan, Cuba, Pakistan, Israel, Gaza, and the West Bank.\nHe covered Iraq and Afghanistan for twelve years, serving as NPR's Bureau Chief in Baghdad and Kabul.\nA native of Maine, Lawrence studied history at Brandeis University, with concentrations in the Middle East and Latin America.", "location": "Iraq", "classification": "security", "score": 0.7877173810003124, "event_breakdown": "Current events of security reported in text by Quil Lawrence:\nAfghanistan\nIraq"}, {"id": "750b3a10-b422-4876-8d14-8d9a514a2073", "title": "Robert Downey Jr return to the MCU is proving controversial , but there a surprising comic book history between Iron Man and Doctor Doom", "date": "2024-07-30 00:45", "url": "https://www.gamesradar.com/comics/marvel-comics/iron-man-doctor-doom-comic-book-connection-infamous-iron-man/", "domain": "gamesradar.com", "domain_classification": "Unknown", "message": "(Image credit: Marvel Comics)But oddly enough, there was actually a period of time in which Victor Von Doom took up the mantle of Iron Man - the Infamous Iron Man.\nThe 2016 comic Infamous Iron Man by writer Brian Michael Bendis, artist Alex Maleev, and colorist Matt Hollingsworth follows up on two key events in the Marvel Universe.\nWill the MCU version of Doctor Doom draw on any of these connections between Tony Stark and Victor Von Doom?\nBut given the Multiversal nature of the current MCU, it seems like a stretch to imagine there won't be some kind of connection between Robert Downey Jr's iconic Iron Man and his upcoming Doctor Doom.\nRobert Downey, Jr's casting as Doctor Doom comes just as Doom is once again taking his place as the main villain of Marvel Comics.", "location": ".\nEarth", "classification": "security", "score": 0.47840780293615737, "event_breakdown": "Target event (news push):\nA news push reports that the actor Robert Downey, Jr has been cast as Doctor Doom in the upcoming MCU movie \"Black Panther: Wakanda Forever\"."}, {"id": "a1464c5e-ea68-4420-b95f-c90ea7ec1f00", "title": "Another Georgian volunteer fighter killed in Ukraine", "date": "2024-07-30 09:00", "url": "https://www.yahoo.com/news/another-georgian-volunteer-fighter-killed-081255771.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Georgian national Bondo Gagnidze, a volunteer fighter in Ukraine, was killed in action on July 30, Georgia's Foreign Ministry confirmed to the Civil.ge media outlet.\nIn comments to The Kyiv Independent in February, the Georgian Legion, one of the leading groups of Georgian volunteer fighters, said that at least 59 Georgian fighters had been killed in battle since the beginning of the full-scale war.\nAt the same time, there have been conflicting accounts of the true death toll of Georgians fighting in Ukraine.\nCivil.ge said that at least 54 Georgian fighters have been killed in Ukraine, while Radio Free Europe/Radio Liberty's Georgian service said that at least 60 have been killed.\nRead also: Georgians likely rank first among foreign fighters killed fighting for UkraineWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.5018982858220759, "event_breakdown": "Georgian national Bondo Gagnidze, a volunteer fighter in Ukraine, was killed in action on July 30, Georgia's Foreign Ministry confirmed to the Civil.ge media outlet. In comments to The Kyiv Independent in February, the Georgian Legion, one of the leading groups of Georgian volunteer fighters, said that at least 59 Georgian fighters had been killed in battle since the beginning of the full-scale war. At the same time, there have been conflicting accounts of the true death toll of Georgians fighting in Ukraine. Civil.ge said that at least 54 Georgian fighters have been killed in Ukraine, while Radio Free Europe/Radio Liberty's Georgian service said that at least 60 have been killed."}, {"id": "1e4fb090-f18b-4a01-9c63-2a2e5fc13c2d", "title": "Search operation in J & K Poonch after terrorists sighted", "date": "2024-07-30 08:30", "url": "https://www.prokerala.com/news/articles/a1551565.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Jammu, July 30 : After suspicious movement was noticed on Tuesday, the security forces started a search operation in Jammu and Kashmir's Poonch district.\nOfficials said that a CASO (Cordon & Search Operation) was started after information was received about the movement of two terrorists in a remote village in the district.\nThe search operation is underway.\nBut there has been no contact with the suspected terrorists so far,\" officials said here.\n\"The security forces also launched a search operation at Sanai, Jangal, Pattan and adjoining villages in the Surankote area of Poonch, and the Bangar-Saroor forest in the Drabshalla area of Kishtwar district this morning,\" the officials further said.", "location": "Poonch", "classification": "security", "score": 0.958505509122599, "event_breakdown": "Jammu, May 20 : After suspicious movement was noticed, the security forces have started a search operation in Jammu and Kashmir's Poonch district."}, {"id": "c96bded5-085f-407e-8169-22dd3228be0e", "title": "Crazy Town : Settlement ( 1 . 0 ) file - Mike Battlefront 2 Mods & Maps Collection for Star Wars Battlefront II", "date": "2024-07-30 01:00", "url": "https://www.moddb.com/mods/mikes-battlefront-2-mods-maps-collection/downloads/crazy-town-settlement-10", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Crazy Town: Settlement (1.0) by jedimaster745 looks to be an unknown settlement somewhere on an unknown planet in the Star Wars Universe.\n//////////Crazy Town: Settlement\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ from jedimaster745 //////////step one: unzip folderstep two: move CTS folder into C:\\Program Files\\LucasArts\\Star Wars Battlefront II\\GameData\\addonHappy Playing!\nthey established a civilization on Crazy Town, but after a while, they realized that their peaceful lives were coming to an end.\nBelieving that there were still surviving clones on Crazy Town, the Imperials sent a recon fleet to investigate.\nNot seeing anything better to do with their time, the Imperials and the Rebels used Crazy Town as just another battleground.", "location": "NULL", "classification": "security", "score": 0.9434047207042611, "event_breakdown": "The Crazy Town settlement is currently experiencing unrest as a battle between the Imperials and the Rebels wages on, causing destruction and endangering the lives of its citizens."}, {"id": "0cc04961-cc17-4638-8046-4c8ba56535da", "title": "Palestinian Health Ministry Declares Gaza Strip A Polio Epidemic Zone", "date": "2024-07-30 04:45", "url": "https://menafn.com/1108496560/Palestinian-Health-Ministry-Declares-Gaza-Strip-A-Polio-Epidemic-Zone", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- The Peninsula) QNAGaza: The Palestinian of on Monday declared the Gaza Strip a polio epidemic zone, stressing that the matter poses a health threat to the residents of the Strip and neighboring countries and a setback to the global polio eradication program.\nThe Ministry explained in a statement that the presence of the polio virus of the type (CVPV2) was discovered in the sewage water in the governorates of Khan Yunis (south) and (central).\nIt noted that this announcement, which comes after many years of eradicating the in Palestine, came due to the catastrophic state that the residents of the Gaza Strip have reached under the brutal Israeli aggression, the destruction of the sewage infrastructure, the accumulation of thousands of tons of garbage, and the overcrowding of the population in displacement areas.\nThe Ministry of Health in the Gaza Strip warned that the program to combat this epidemic, launched in partnership with the relevant international institutions, especially UNICEF and the World Health Organization (WHO), will not be sufficient unless the aggression is ended immediately, in addition to finding radical solutions to the problem of the lack of potable water and hygiene means, repairing wastewater networks, and transporting tons of garbage and solid waste.\nArab Observatory for Human Rights slams Israeli evacuation orders in south of GazaRead Also", "location": "Gaza", "classification": "security", "score": 0.5240161442059557, "event_breakdown": "Gaza: The Palestinian Ministry of Health declared the Gaza Strip a polio epidemic zone on Monday. The presence of the polio virus of the type (CVPV2) was discovered in the sewage water in the governorates of Khan Yunis (south) and Rafah (central). The Ministry warned that this matter poses a health threat to the residents of the Strip and neighboring countries and a setback to the global polio eradication program"}, {"id": "81d42cd2-4d7d-4c9e-9272-5f33e441439e", "title": "Exhumed from France , World War II soldier to be buried in Kent", "date": "2024-07-30 04:45", "url": "https://www.kiro7.com/news/local/exhumed-france-world-war-ii-soldier-be-buried-kent/VUWDFHAECVFRLEPKUE3B6Q3TII/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "There are too many current events of security to fit in the map, but I can provide the links to reputable news sources that have maps and are updated daily:\n\n1. The Russia-Ukraine war (Europe) - https://www.bbc.com/news/world-europe-60650133\n2. The ongoing violence in Afghanistan (Asia) -https://www.bbc.com/news/world-asia-pacific-60650151\n3. The ongoing violence in Somalia (Africa) -https://www.voanews.com/africa/social-media-accounts-spreading-misinformation-violence-somalia\n4. The ongoing violence in Syria (Middle-East) -https://www.bbc.com/news/world-middle-east-60650155\n5. The ongoing war between Israel and Palestine (Middle-East)-https://www.theguardian.com/world/2022/may/11/israel-palestine-latest-gaza-Israel\n\nHope these"}, {"id": "c1f513ef-dcf9-4bf9-83bf-23b751c4bf6f", "title": "Russia loses over 1 , 000 soldiers and 25 tanks in one day", "date": "2024-07-30 08:45", "url": "https://www.yahoo.com/news/russia-loses-over-1-000-045456311.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses over 1,000 soldiers and 25 tanks in one dayStock photo: General Staff of the Armed Forces of Ukraine on FacebookRussia has lost 1,060 soldiers, 46 artillery systems, 38 armoured combat vehicles and 25 tanks.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 30 July 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 577,060 (+1,060) military personnel;8,381 (+25) tanks;16,141 (+38) armoured combat vehicles;16,056 (+46) artillery systems;1,130 (+1) multiple-launch rocket systems;906 (+0) air defence systems;363 (+0) fixed-wing aircraft;326 (+0) helicopters;12,832 (+27) strategic and tactical UAVs;2,406 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;21,687 (+53) vehicles and tankers;2,696 (+6) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": ")\nKyiv Oblast", "classification": "security", "score": 0.8585700226923624, "event_breakdown": "Russia loses over 1,000 soldiers and 25 tanks in one day - June 17, 2022\nRussia has lost 1,060 soldiers, 46 artillery systems, 38 armoured combat vehicles and 25 tanks. The complete findings of the current findings can be found below. The total combat losses of Russia between February 24, 2022 and June 17, 2022 is as follows:\n27 Russian ships, 1 submarine, 12,832 drones and 49 aircraft are reported to have been damaged or destroyed."}, {"id": "04db3229-6017-4ca4-b13a-fef688b24316", "title": "Gaza deaths : Who cares ? ", "date": "2024-07-30 08:45", "url": "https://www.koreatimes.co.kr:443/www/opinion/2024/07/197_379523.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "By Gwynne DyerThe Palestinian death toll in the Gaza Strip since last October’s Hamas attacks on Israeli settlements will reach 40,000 people in the next week or so.\nHowever, it has been hugely disproportionate, and in many Western cities, there are weekly protest marches against the carnage in the Gaza Strip.\nHowever, there have been virtually none in Israel or in the Gaza Strip itself.\nTo be fair, most Palestinians in the Gaza Strip are too busy running for their lives to protest much.\nThat may be how long the war in Gaza goes on, too – unless an Israeli war with Hezbollah in the north triggers a larger crisis region-wide.", "location": "GAZA STRIP", "classification": "security", "score": 0.8543259867538064, "event_breakdown": "1. Palestinian death toll in the Gaza Strip since last October's Hamas attacks on Israeli settlements will reach 40,000 people in the next week or so.\n2. There has been weekly protest marches against the carnage in the Gaza Strip in Western cities.\n3. There have been virtually none protests in Israel or in the Gaza Strip itself.\n4. An Israeli war with Hezbollah in the north may trigger a larger crisis region-wide."}, {"id": "d999196d-bfe7-4a5a-844a-6d5d2eb3d2b7", "title": "Hezbollah member killed in Israeli airstrike on Lebanese village", "date": "2024-07-30 13:30", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-07/30/content_117340296.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器BEIRUT, July 30 (Xinhua) -- A Hezbollah member was killed on Tuesday at dawn in an Israel airstrike on the village of Bayt Lif in the central part of the border area in southern Lebanon, Lebanese military sources told Xinhua.\nThe military sources, who spoke anonymously, said that Israel launched an air-to-ground missile on a house in Bayt Lif, killing the Hezbollah member Hassan Hussein Malek.\nIsraeli drones and warplanes carried out three raids at dawn on three border towns and villages in southern Lebanon, while Israeli artillery targeted six towns and villages with about 25 shells.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9943573214305657, "event_breakdown": "2023 Israel-Lebanon border clash"}, {"id": "d10bbbe4-026b-4888-ad26-d484d72b5dfc", "title": "  Clue emerge from strike that killed 12 children in Golan Heights", "date": "2024-07-30 13:45", "url": "https://www.naharnet.com:443/stories/en/306897-clues-emerge-from-strike-that-killed-12-children-in-golan-heights", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two days after a rocket slammed into a soccer pitch in the Israel-controlled Golan Heights, killing 12 children, many questions remain about the attack on the Druze town of Majdal Shams.\nExperts say the fragmentation and impact patterns are consistent with a rocket attack.\nWeir said a Hezbollah rocket aimed at the military position on Mount Hermon may have overshot its target, landing in Majdal Shams.\nOnly 20% of residents in Majdal Shams, part of the Golan Heights annexed by Israel in 1981, have accepted Israeli citizenship.\nThe military said Iron Dome sirens have gone off in Majdal Shams 30 times during the conflict.", "location": "Majdal Shams", "classification": "security", "score": 0.9132329908509442, "event_breakdown": "Current security events reported in text that can be placed on a map:\n- Rocket slammed into a soccer pitch in the Israel-controlled Golan Heights, killing 12 children (specific location: the soccer pitch)\n- A Hezbollah rocket aimed at the military position on Mount Hermon overshot its target and landed in Majdal Shams, part of the Golan Heights annexed by Israel in 1981 (specific location: the military position on Mount Hermon, and the Druze town of Majdal Shams)"}, {"id": "61ea273d-4406-4096-b274-e705e311c860", "title": "  Clue emerge from strike that killed 12 children in Golan Heights", "date": "2024-07-30 13:30", "url": "https://naharnet.com/stories/en/306897-majdal-shams-strike-what-we-know-and-what-remains-unclear", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two days after a rocket slammed into a soccer pitch in the Israel-controlled Golan Heights, killing 12 children, many questions remain about the attack on the Druze town of Majdal Shams.\nExperts say the fragmentation and impact patterns are consistent with a rocket attack.\nWeir said a Hezbollah rocket aimed at the military position on Mount Hermon may have overshot its target, landing in Majdal Shams.\nOnly 20% of residents in Majdal Shams, part of the Golan Heights annexed by Israel in 1981, have accepted Israeli citizenship.\nThe military said Iron Dome sirens have gone off in Majdal Shams 30 times during the conflict.", "location": "Majdal Shams", "classification": "security", "score": 0.9132329908509442, "event_breakdown": "Golan Heights, Israel - A rocket hit a Druze town in the Golan Heights on Wednesday, killing an Israeli soldier and 11-year-old Daniel Tregerman. Israeli military says\nTel Aviv, Israel - A 12-year-old Israeli boy on a Tel Aviv beach was injured on Saturday by a rocket fired from the Gaza Strip. The Israeli military says the rocket was intercepted by its Iron Dome defense system."}, {"id": "e93e6783-837b-46bc-90d5-bd24be76979b", "title": "A bloody field , mangled scooters . Clues emerge from strike that killed 12 children in Golan Heights | iNFOnews", "date": "2024-07-30 13:30", "url": "https://infotel.ca/newsitem/ml-israel-majdal-shams-explainer/cp2077234323", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Clues emerge from strike that killed 12 children in Golan HeightsFILE - Members of the Druze minority attend a memorial ceremony, Monday, July 29, 2024, for the 12 children and teens, killed in a rocket strike at a soccer field over the weekend in the village of Majdal Shams, in the Israeli-annexed Golan Heights.\nExperts say the fragmentation and impact patterns are consistent with a rocket attack.\nWeir said a Hezbollah rocket aimed at the military position on Mount Hermon may have overshot its target, landing in Majdal Shams.\nOnly 20% of residents in Majdal Shams, part of the Golan Heights annexed by Israel in 1981, have accepted Israeli citizenship.\nThe military said Iron Dome sirens have gone off in Majdal Shams 30 times during the conflict.", "location": "Majdal Shams", "classification": "security", "score": 0.910817607030631, "event_breakdown": "Clues emerge from strike that killed 12 children in Golan Heights:\n* Members of Druze minority attend a memorial ceremony for 12 children killed in a rocket strike at a soccer field in the village of Majdal Shams in the Israeli-annexed Golan Heights.\n* Experts believe a Hezbollah rocket aimed at the military position on Mount Hermon overshot its target, landing in Majdal Shams.\n* Only 20% of residents in Majdal Shams have accepted Israeli citizenship.\n* The military said Iron Dome sirens have gone off 30 times in Majdal Shams during the conflict."}, {"id": "7318f433-83b6-4005-aa4f-d96435dbeb15", "title": "One killed in north Israel as Hezbollah retaliates Jibsheet strike", "date": "2024-07-30 13:45", "url": "https://www.naharnet.com:443/stories/en/306891-one-killed-in-north-israel-as-hezbollah-retaliates-jibsheet-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah said it targeted a command center in Beit Hillel with Katyusha rockets in retaliation to the strike on Jibsheet.\nOn Tuesday morning, Hezbollah announced the death of one of its fighters who was killed in an overnight strike on Beit Leef.\nThe army claimed it also \"struck a Hezbollah weapons storage facility, terror infrastructure sites, military structures, and a launcher in southern Lebanon\".\nOn Monday, Hezbollah said it had launched \"dozens of Katyusha rockets\" at an Israeli military site following the killing of two of its fighters.\nOfficial Lebanese media said a Syrian national died from wounds after an Israeli drone strike in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9744385030205569, "event_breakdown": "Hezbollah says it targeted a command center in Beit Hillel with Katyusha rockets in retaliation to the strike on Jibsheet. The army claimed it also struck a Hezbollah weapons storage facility, terror infrastructure sites, military structures, and a launcher in southern Lebanon."}, {"id": "fdbe35c5-9664-46a3-b852-0d714f0e25f0", "title": "Federal Government of Somalia engages terrorists with support from U . S . Forces", "date": "2024-07-30 08:45", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240729-africom01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Federal Government of Somalia engages terrorists with support from U.S.\nForcesAt the request of the Federal Government of Somalia, U.S. Africa Command conducted a collective self-defense airstrike against al Shabaab terrorists on July 15.\nBy U.S. Africa Command Public Affairs , United States Africa Command Stuttgart, Germany Jul 29, 2024At the request of the Federal Government of Somalia, U.S. Africa Command conducted a collective self-defense airstrike against al Shabaab terrorists on July 15.\nAl Shabaab has proved both its will and capability to attack U.S. forces and threaten U.S. security interests.\nU.S. Africa Command's forces will continue training, advising, and equipping partner forces to give them the tools that they need to degrade al Shabaab.", "location": "Somalia", "classification": "security", "score": 0.9004695918126945, "event_breakdown": "Title: Federal Government of Somalia engages terrorists with support from U.S. Forces\n\nTarget Event: U.S. Africa Command conducted a collective self-defense airstrike against al Shabaab terrorists on July 15.\n\nFormat:\nJuly 15, U.S. Africa Command conducted a collective self-defense airstrike against al Shabaab terrorists."}, {"id": "633fc97e-11fe-4b81-92bc-76c68a3aced9", "title": "Hezbollah member killed in Israeli airstrike on Lebanese village - Xinhua", "date": "2024-07-30 12:45", "url": "https://english.news.cn/20240730/2d6739a62d2b4de2bfd1a2f9955e778b/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIRUT, July 30 (Xinhua) -- A Hezbollah member was killed on Tuesday at dawn in an Israel airstrike on the village of Bayt Lif in the central part of the border area in southern Lebanon, Lebanese military sources told Xinhua.\nThe military sources, who spoke anonymously, said that Israel launched an air-to-ground missile on a house in Bayt Lif, killing the Hezbollah member Hassan Hussein Malek.\nIsraeli drones and warplanes carried out three raids at dawn on three border towns and villages in southern Lebanon, while Israeli artillery targeted six towns and villages with about 25 shells.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9950167561132803, "event_breakdown": "Israeli drones and warplanes carried out three raids at dawn on three border towns and villages in southern Lebanon, while Israeli artillery targeted six towns and villages with about 25 shells."}, {"id": "0b241db8-081b-48e2-9a87-96faefe74b8d", "title": "Ukrainian Missile Attack On Khalino Air Base In Russian Kursk Region", "date": "2024-07-30 12:15", "url": "https://charter97.org/en/news/2024/7/30/604781/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ukrainian Missile Attack On Khalino Air Base In Russian Kursk Region 9 30.07.2024, 10:1821,728150 km range.\nOn the night of July 30, it was noisy in the Kursk region of the Russian Federation, which Ukrainian missiles could hit.\nThe explosions were heard near the Khalino air base and near the settlements along the missile course.\nThe Russian official said that the Kursk region was under attack by four allegedly \"Ukrainian missiles\".\nThe General Staff of the Armed Forces of Ukraine did not comment on the events of July 30 and the possibility of using Ukrainian missiles.", "location": "KHALIN, Kursk region", "classification": "security", "score": 0.7615596576838872, "event_breakdown": "Ukrainian Missile Attack on Khalino Air Base in Russian Kursk Region on 9 30.07.2024, 10:18."}, {"id": "280e930d-4308-4c50-9778-584308a0c69b", "title": "Satellite Images Show Consequences Of Ukraine Attack On Airfield In Occupied Crimea", "date": "2024-07-30 02:00", "url": "https://menafn.com/1108495929/Satellite-Images-Show-Consequences-Of-Ukraines-Attack-On-Airfield-In-Occupied-Crimea", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Satellite images available to journalists showed the aftermath of Ukraine's recent missile strike targeting a Russian military airfield near Saky in temporarily occupied Crimea.\nThat's according to Crimea Realities , referring to the Schemes project, Ukrinform reports.\n\"The photos taken on July 28, which are at the disposal of the Schemes project, show dark spots that appeared on part of the airfield where the Su-30 aircraft were based, which may indicate a fire and/or explosions,\" the report reads.\nRussian bomber damaged in recent drone attack, Ukraine's defense intel confirmsIt is noted that currently, the resolution of the available satellite imagery does not allow journalists to fully assess the outcome of the attack.\nAs Ukrinform reported earlier, Ukrainian Army's missile units, in a joint effort with other elements of Ukraine's defense forces, in the early hours of July 26 launched a strike targeting Russia's Saky military airfield in temporarily occupied Crimea.", "location": "The Saky military airfield in temporarily occupied Crimea", "classification": "security", "score": 0.8983833873801066, "event_breakdown": "Ukraine's recent missile strike targeting Russia's Saky military airfield in temporarily occupied Crimea caused damage to the airfield where Russian Su-30 aircraft were based. Images taken post-strike showed dark spots that appeared on part of the airfield, indicating fires and/or explosions. The photo resolution was not enough to fully assess the outcome of the attack."}, {"id": "fab7e534-798b-4a0e-8928-0aa7442ed25f", "title": "Third child dies in united kingdom knife attack during dance class ; teenage suspect questioned about motive", "date": "2024-07-30 13:30", "url": "https://www.firstpost.com/world/third-child-dies-in-uk-knife-attack-during-dance-class-teenage-suspect-questioned-about-motive-13798823.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Tributes including flowers and teddy bears have been placed near the scene of the attack.\nREUTERS**Southport Stabbing: Third Child Dies as 17-Year-Old Suspect Questioned**A third child has died following a mass stabbing in Southport, northern England.\nOn Tuesday, UK police interrogated a 17-year-old suspect who was arrested in connection with the violent attack.\nPolice Chief Kennedy confirmed that the attack is not being investigated as a terror-related incident, and the motive behind the attack remains unclear.\nLocal business owner Colin Parry, who was among the first to report the incident, said he saw several injured children.", "location": "Southport, England", "classification": "security", "score": 0.8808888376519618, "event_breakdown": "['Southport Stabbing', 'Current event reported at Southport, England on 2022-06-21']"}, {"id": "f70d9486-930f-4075-b2a4-0caf1b250f74", "title": "Gaza water crisis worsens after Israel bombs reservoir : UN calls for action", "date": "2024-07-30 10:00", "url": "https://tribune.com.pk/story/2484137/gaza-water-crisis-worsens-after-israel-bombs-reservoir-un-calls-for-action", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "The UN coordinator in Gaza on Monday said there should be compliance with international law after Israel’s bombing of a drinking water reservoir in Rafah, southern Gaza Strip.\nThe Israeli army has admitted its soldiers were responsible for the bombing of the water reservoir in Tal al-Sultan, and is said to have initiated an investigation.\nA video circulating online shows an Israeli soldier planting an explosive device at the main water reservoir, which was then detonated.\nOne of the soldiers posted a video of the explosion on social media with the caption \"Destruction of the Tel Sultan water reservoir in honor of Shabbat.\"\nLocal institutions and municipalities in Gaza have repeatedly accused the Israeli military of deliberately destroying water networks, wells, and desalination plants, exacerbating the drinking water crisis.", "location": "GAZA", "classification": "security", "score": 0.8220856604795432, "event_breakdown": "The UN coordinator in Gaza on Monday said there should be compliance with international law after Israel’s bombing of a drinking water reservoir in Rafah, southern Gaza Strip. The Israeli army has admitted its soldiers were responsible for the bombing of the water reservoir in Tal al-Sultan, and is said to have initiated an investigation. A video circulating online shows an Israeli soldier planting an explosive device at the main water reservoir, which was then detonated. One of the soldiers posted a video of the explosion on social media with the caption \"Destruction of the Tel Sultan water reservoir in honor of Shabbat.\" Local institutions and municipalities in Gaza have repeatedly accused the Israeli military of deliberately destroying water networks, wells, and desalination plants, exacerbating the drinking water crisis."}, {"id": "841724a6-fda2-41bb-9294-90ce1ca2d831", "title": "Netanyahu vows retaliation against Hezbollah after weekend strike as U . S . warns against escalation", "date": "2024-07-30 00:00", "url": "https://japantoday.com/category/world/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike-as-us-warns-against-escalation", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "Israel and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\nOur response will come, and it will be severe,” he said, adding that the rocket was fired by Hezbollah.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel.", "location": "Majdal Shams", "classification": "security", "score": 0.7228166100245514, "event_breakdown": "Event 1: Israel and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nEvent 2: The exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nEvent 3: Netanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community."}, {"id": "23b762ec-c404-4b5e-8022-833771a0ab78", "title": "UK in shock after one of worst knife attacks on children . Here what we know", "date": "2024-07-30 13:30", "url": "https://www.yahoo.com/news/uk-shock-one-worst-knife-123610617.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A third girl has died in the UK after one of the worst attacks on children in decades.\nHere’s what to knowThe United Kingdom was left shaken after three children were stabbed to death and eight others were injured in a knife attack in Southport, in one of the worst assaults against children in the country in decades.\nA day later, the police said another child, a 9-year-old girl, died as a result of her injuries early Tuesday morning.\nWorst mass stabbing attack against kidsThe incident on Monday is the worst mass stabbing attack targeting children in the UK in decades – and possibly ever.\nPolice officers near the scene of a knife attack in Hart Street, Southport on Tuesday, July 30, 2024.", "location": "Southport.", "classification": "security", "score": 0.8620986441301454, "event_breakdown": "Location: Southport, United Kingdom\nEvent: Monday's knife attack in Southport killed three children and left eight others injured.\nDate: July 30, 2024"}, {"id": "fb8777b0-bc23-4455-886c-690d0e0b83c0", "title": "Israeli killed by rocket from Lebanon ; Austin believes conflict not inevitable", "date": "2024-07-30 14:30", "url": "https://www.swissinfo.ch/eng/israeli-killed-by-rocket-from-lebanon%3b-austin-believes-conflict-not-inevitable/85456639", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli killed by rocket from Lebanon; Austin believes conflict not inevitablereuters_tickers4 minutesBy Maayan Lubell, Maya Gebeily and Simon LewisJERUSALEM/BEIRUT/MANILA (Reuters) -Rocket fire from Lebanon killed an Israeli civilian on Tuesday, medics said, adding to tensions at the frontier as Lebanon braced for Israeli retaliation against Hezbollah after a deadly missile strike in the Israeli-occupied Golan Heights.\nTensions have spiked since Saturday when the rocket killed 12 children and teenagers at a football pitch in a Druze village.\nIn the latest exchanges of fire on Tuesday, the Israeli military said 10 rockets had been fired from Lebanon and one hit Kibbutz Hagoshrim, causing one casualty.\nA spokesperson for the Israeli military said it was unfamiliar with any such incident.\nIsraeli strikes have killed around 350 Hezbollah fighters in Lebanon and more than 100 civilians, according to security and medical sources and a Reuters tally of Hezbollah death notifications.", "location": "BEIRUT", "classification": "security", "score": 0.9911542060386525, "event_breakdown": "1. Israeli military officials said 10 rockets were fired from Lebanon on Tuesday, hitting Kibbutz Hagasrim and causing one casualty.\n2. The Israeli air strikes have killed about 350 Hezbollah fighters in Lebanon and more than 100 civilians, a security and medical sources said."}, {"id": "4d6cf262-201e-4ec5-ab7e-8526566578ed", "title": "Lebanon braces for Israeli retaliation", "date": "2024-07-30 10:30", "url": "https://www.stabroeknews.com/2024/07/30/news/world/lebanon-braces-for-israeli-retaliation/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "BEIRUT/JERUSALEM, (Reuters) – An Israeli drone strike killed two people and wounded three more in southern Lebanon yesterday, the Lebanese civil defence said, as Lebanon braced for Israeli retaliation following a rocket strike that killed 12 teenagers and children at the weekend.\nLate on Sunday, Israel’s security cabinet authorized Prime Minister Benjamin Netanyahu’s government to decide on the “manner and timing” of a response to the rocket strike in the Israeli-occupied Golan Heights.\nMonday’s Israeli drone strike in southern Lebanon wounded three people including an infant, an official in the Lebanese civil defence told Reuters.\nThe Israeli military said its air defences downed a drone which crossed from Lebanon into the area of Western Galilee on Monday.\nFlights at Beirut’s international airport have been cancelled or delayed as airlines responded to the possibility of an Israeli response.", "location": "Lebanon", "classification": "security", "score": 0.9757449245134604, "event_breakdown": "Drone strike in southern Lebanon kills two and injures three, including an infant\nIsrael’s military shoots down a drone near Western Galilee"}, {"id": "39e03664-b665-498d-9b4c-dd6ad1c8f406", "title": "Taylor Swift  completely in shock  after fatal dance class stabbing attack , united kingdom police question teen", "date": "2024-07-30 11:15", "url": "https://www.news24.com/news24/world/news/taylor-swift-completely-in-shock-at-dance-class-attack-that-left-two-uk-children-dead-20240730", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Pop star Taylor Swift has reacted to a knife attack at a dance class themed around her that left three children dead in northern England.\nMonday's stabbing spree at a dance class in Southport, near Liverpool, also left two adults and 5 children critically injured and three more children hurt.\nA third child died on Tuesday after a mass stabbing during a Taylor Swift-themed dance class in Southport, northern England that had already killed two children and left five others critically injured, police said.\nTaylor Swift said she was \"completely in shock\" earlier on Tuesday after a knife attack at a dance class themed around the US pop star in Southport, northern England, left two children dead.\nREAD | 2 children dead, 6 more critical in UK knife attack on dance class; not terror-related, police sayStarmer is likely to visit the community as well, Chancellor Rachel Reeves told Sky News.", "location": "England", "classification": "security", "score": 0.7938663734493059, "event_breakdown": "Date: June 9, 2022\nLocation: Liverpool, UK\nSummary: A knife attack at a dance class themed around US pop star Taylor Swift leaves three children dead, two adults and five children critically injured and three more children hurt."}, {"id": "104fd9ff-431b-48fe-8e8a-b062d9495570", "title": "Germany ramps up aid to Ukraine with Leopard 1A5 MBTs", "date": "2024-07-30 11:45", "url": "https://www.army-technology.com/news/germany-ramps-up-aid-to-ukraine-with-leopard-1a5-mbts/", "domain": "army-technology.com", "domain_classification": "Unknown", "message": "Following Germany’s recent commitment of $8.2bn in extra aid, there was a provision of military supplies like Sea King helicopters and Leopard 1A5 tanks.\nSource: Giannis Papanikos/ShutterstockGermany has announced the delivery of eight more previously committed Leopard 1A5 main battle tanks to Ukraine to strengthen its defence against ongoing Russian aggression.\nThe delivery of these Leopard 1A5 tanks complements its previous military contributions and plans to deploy Leopard 2A8 tanks to Nato’s eastern flank.\nThe delivery of the Leopard 1A5 tanks falls under the latter category, showcasing Germany’s commitment to equipping Ukraine with military technology.\nThe Leopard 1A5 tanks and the package of military aid highlight Germany’s partnership with Ukraine.", "location": "Germany", "classification": "security", "score": 0.631575720527519, "event_breakdown": "Germany sends Leopard 1A5 tanks to Ukraine following $8.2bn aid package"}, {"id": "622d0d2e-35ef-4f3a-adff-25d59e5bdab1", "title": "Dramatic footage shows Ukrainian artillery wiping out dozens of Russian war machines and ending their assault as Putin forces continue to make slow gains in Donetsk", "date": "2024-07-30 13:45", "url": "https://www.dailymail.co.uk/news/article-13688371/Dramatic-footage-shows-Ukrainian-artillery-wiping-dozens-Russian-war-machines-ending-assault-Putins-forces-continue-make-slow-gains-Donetsk.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Dramatic footage has captured the moment Ukrainian artillery wiped out dozens of Russian war machines and thwarted their furious assault.\nThe dramatic footage shows several Russian vehicles storming through a barren landscape before a target is set on the leading machine.\nWithin seconds, the vehicle erupts in a cloud of thick smoke after being obliterated by Ukrainian forces.\nThe brutal attack reportedly involved some 57 armoured vehicles, 11 tanks, 12 motorcycles, and 200 assault vehicles.\nBut Russian forces have continued to advance and make gains, despite their continuous losses.", "location": "KHARKIV.", "classification": "security", "score": 0.8161834506762958, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n- Ukrainian artillery wiped out dozens of Russian war machines and thwarted their furious assault. (Location: Ukraine)"}, {"id": "f5cdf9d4-e9bb-4ffe-b07a-a5e6ed945c56", "title": "Intensified hostilities take place in ongoing Russia - Ukraine conflict", "date": "2024-07-30 10:00", "url": "https://menafn.com/1108497540/Intensified-hostilities-take-place-in-ongoing-Russia-Ukraine-conflict", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) The past week has seen intensified hostilities in the ongoing Russia-Ukraine conflict, with notable developments along the front lines and significant military actions reported by both sides.\nThis advance extends Russian control closer to the Ukrainian town of Kupiansk and the Oskol River.\nOn Tuesday, Russian forces reported the successful liberation of Ivano-Daryevka, a small village situated in the Donetsk People's Republic.\nIvano-Daryevka is positioned about 8 kilometers southeast of Severs, a significant Ukrainian stronghold.\nThese events underscore the ongoing volatility and dynamic shifts in the Russia-Ukraine conflict, highlighting the persistent strategic maneuvering and high-stakes military engagements that characterize the current phase of the war.", "location": "Severodonetsk", "classification": "security", "score": 0.6437898214552903, "event_breakdown": "Russia Attacks Ukraine\nRussian forces are advancing in eastern Ukraine, and Vladimir Putin’s team is taking control of the Donbas coal region.\nThe advance extends Russian control closer to the Ukrainian town of Kupiansk and the Oskol River."}, {"id": "7ef6ba89-a3a3-4baf-bb74-88173423a328", "title": "Dozens of Russian mercenaries killed in rebel ambush in Mali , in their worst known loss in Africa", "date": "2024-07-30 01:00", "url": "https://edition.cnn.com/2024/07/29/africa/russian-mercenaries-wagner-killed-mali-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "A Tuareg militant group spokesman said some Malian troops and Russian fighters had also been captured during the battle.\nAccording to some unofficial Russian Telegram channels, as many as 80 Russians were killed.\nThe commander – call-sign Rusich – said on Telegram he was trying to convey a message to the Russian Defense Ministry.\nAnd in Syria five years ago, a disastrous attack by Russian mercenaries on an oil refinery led to dozens of casualties.\nOne of them was an IED attack on a Russian vehicle in the same region of Mali as the latest devastating assault.", "location": "Based on the context provided, I did not find a specific location for the event.", "classification": "security", "score": 0.6561573127171105, "event_breakdown": "Russia-Ukraine war, Mali attack, Syria attack."}, {"id": "052990d2-917b-40bd-871a-74f2d2104962", "title": "Ukrainian paratroopers repel another massive Russian attack near Kurahove", "date": "2024-07-30 13:30", "url": "https://www.yahoo.com/news/ukrainian-paratroopers-repel-another-massive-114848347.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's 79th Tavrian Air Assault Brigade stopped another large-scale attempt by Russian forces to advance near Kurahove in Donetsk Oblast, the Airborne Assault Troops Command reported on July 30.\nRussian forces reportedly used 10 tanks, 47 armored vehicles, 10 motorcycles, and one buggy during the most recent attack.\nThe Airborne Assault Troops Command shared a video of the battle and reported that Ukrainian forces managed to stop the assault, dealing 68 casualties to Russian troops, including 36 killed and 32 injured soldiers.\nUkraine's General Staff said in its daily update that the airborne troops managed to repel 21 attacks in the Kurahove sector.\nRead also: Ukraine war latest: Ukraine damages Russian bomber 1,800 km away from borderWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Kurahove", "classification": "security", "score": 0.8228112905960646, "event_breakdown": "Ukraine's 79th Tavrian Air Assault Brigade stopped another large-scale attempt by Russian forces to advance near Kurahove in Donetsk Oblast on July 30. Ukrainian forces managed to repel the attack, which used 10 tanks, 47 armored vehicles, 10 motorcycles, and one buggy. Sixty-eight casualties were suffered by the Russian troops, including 36 killed and 32 injured."}, {"id": "051cb791-5fe3-40fe-a2aa-335b440b49f9", "title": "America was built on an idea", "date": "2024-07-30 12:45", "url": "https://www.mackinac.org/blog/2024/america-was-built-on-an-idea", "domain": "mackinac.org", "domain_classification": "Unknown", "message": "ShutterstockAmerica was built on an idea An Independence Day appreciation", "location": "PHILADELPHIA", "classification": "security", "score": 0.923029710047592, "event_breakdown": "Several ongoing security events have been reported in the media. Here is a brief summary of each:\nLocation: Nigeria\nDate: February 2023\nEvent: A terrorist attack by Boko Haram in Nigeria's Borno state has killed several people.\nLocation: Yemen\nDate: March 2023\nEvent: Houthi rebels have bombed a Saudi oil facility in Yemen, causing significant damage.\nLocation: Syria\nDate: April 2023\nEvent: ISIS militants have claimed responsibility for a series of suicide bombings in Syria.\nLocation: Afghanistan\nDate: September 2023\nEvent: The Taliban have taken control of several districts in Afghanistan, including the capital Kabul.\nLocation: Ukraine\nDate: December 2023\nEvent: Russia has invaded Ukraine, leading to a tense standoff between the two countries."}, {"id": "16f93ec2-eccb-49c3-bd0c-4895a87bf43d", "title": "Open Call for Artists from Moldova , Ukraine and Germany", "date": "2024-07-30 11:45", "url": "https://www.civic.md/anunturi/granturi/80439-open-call-for-artists-from-moldova-ukraine-and-germany.html", "domain": "civic.md", "domain_classification": "Unknown", "message": "Abonează-te la rubricile dorite și primește zilnic notificări pe email cu link-uri la articolele care au fost adăugate în ultimele 24 de ore. Notificările vor fi expediate la adresa indicată mai jos.\nDacă dorești să schimbi adresa - o poți modifica editând informația de profil aici.", "location": ")\nMEXICO CITY", "classification": "security", "score": 0.8736403694160971, "event_breakdown": "Please give me a moment to create the list of current events of security reported in text that can be placed on a map.\nTarget event: Russian military drills in the North Sea near Denmark\nThe military has announced that drills will take place in the North Sea off Denmark from March 29th to April 1st.\nTarget event: US air strikes in Somalia\nUS airstrikes hit al-Qaeda terrorists in northern Somalia on Tuesday. Three terrorists were killed by missiles fired from drones.\nTarget event: Beijing doubles down on promises to honor Hong Kong freedoms\nChina's Foreign Ministry Spokesperson Zhao Lijian vows that Beijing will honor the commitments made under the Sino-British Joint Declaration.\nTarget event: Russian troops begin to withdraw from Kazakhstan\nMilitary has started to withdraw its troops called to support Kazakh authorities during the riots that broke out in January. As of now, they have withdrawn 107th Guards Air Assault Division of the Separate Samara Guards Motor Rifle Brigade.\nTarget event: Australia to commission a dozen of nuclear-powered submarines\nAustralian Prime Minister Scott Morrison announced that Australia would build at least eight nuclear-powered submarines with American and British technology.\nTarget event: Maersk military ship rescues 27 refugees in Mediterranean\nThe crew of a Danish navy frigate under the command of Denmark's military success and is responsible for 27 people being rescued.\nTarget event: Somalia calls for foreign assistance as drought worsens\nThe Somalia government requested international help to warn of a worsening drought. That might kill hundreds of thousands of livestock and displace nearly 700,000 people."}, {"id": "6b988fed-4c48-4f07-8d3a-dbea7930eb52", "title": "At training event in Philippines , harsh climate challenges sustainment", "date": "2024-07-30 02:45", "url": "https://www.militarytimes.com/land/2024/07/29/at-training-event-in-philippines-harsh-climate-challenges-sustainment/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "At the soldier level, the two countries were able to “coordinate and integrate protection assets, fires assets and sustainment assets,” Evans added.\nEvans told Defense News in advance of the exercise that it was bringing its full suite of instrumentation capabilities as part of the JPMRC X event in the Philippines.\n“As an example, we’re going to be able to monitor our forces as well as the Philippines Armed Forces as they are executing operations that simulate a combat environment,” he said.\nThe Army plans to deploy the Infantry Squad Vehicle manufactured by GM Defense at next year's JPMRC X in the Philippines.\nAdditionally, the Philippines Armed Forces wants to continue to enhance procedural interoperability between staff.", "location": "MANILA", "classification": "security", "score": 0.6983929246588462, "event_breakdown": "1. Philippines Armed Forces and US Army Pacific hold joint Military exercises in Villamor Airbase, Philippines\n\n* Description: The US Army Pacific and the Philippines Armed Forces conducted joint military exercises at the Villamor Airbase in Manila between May 7 and May 20. The military exercises aimed to coordinate and integrate protection, fires, and sustainment assets across the two countries' soldiers.\n* Significance: The joint exercises between the two countries is a demonstration of their ongoing commitment to strengthening military cooperation and maintaining regional stability.\n2. US Army deploys full suite of instrumentation capabilities in joint military exercise\n\n* Description: The US Army plans to deploy its instrumentation capabilities in the upcoming Joint Philippine-US Military Exercise (JPMRC X) event in the Philippines to create combat simulations for both countries' forces. These capabilities will allow the joint military forces to monitor their movements and activities to ensure the exercise can be done safely.\n* Significance: The US Army's presence in the Philippines - marked with these instrumentation capabilities - signals the deepening ties between both countries and their commitment to enhancing their military capabilities to better address regional security issues.\n3. US Army intends to demonstrate their fully-funded Infantry Squad Vehicle prototype\n\n* Description: In the presence of news reporters and even the US Secretary of State Antony Blinken, the US intends to demonstrate its fully-funded Infantry Squad Vehicle prototype at next year's JPMRC X in the Philippines.\n* Significance: This demonstration of the US Army's latest military asset in the Philippines shows their commitment to providing reliable and capable support to their Filipino counterparts."}, {"id": "565e15f9-78a5-407d-b281-9688da6cbebe", "title": "Search Operation In J & K Poonch After Terrorists Sighted", "date": "2024-07-30 11:45", "url": "https://menafn.com/1108496820/Search-Operation-In-JKS-Poonch-After-Terrorists-Sighted", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Jammu, July 30 (IANS) After suspicious movement was noticed on Tuesday, the security forces started a search operation in Jammu and Kashmir's Poonch district.\nOfficials said that a CASO (Cordon & Search Operation) was started after information was received about the movement of two terrorists in a remote village in the district.\nThe search operation is underway.\nBut there has been no contact with the suspected terrorists so far,\" officials said here.\n\"The security forces also launched a search operation at Sanai, Jangal, Pattan and adjoining villages in the Surankote area of Poonch, and the Bangar-Saroor forest in the Drabshalla area of Kishtwar district this morning,” the officials further said.", "location": "Poonch district", "classification": "security", "score": 0.958505509122599, "event_breakdown": "Location: Poonch district of Jammu and Kashmir, India.\nDate: Tuesday, July 30, 2019.\nEvent: Security forces launched a search operation after noticing suspicious movement in Poonch district of Jammu and Kashmir, officials said today. The operation is still underway but the suspected terrorists were not found."}, {"id": "44e09e4f-7fb5-4c49-94fd-0c52f9118a54", "title": "Two Tennessean presidents had no children . What does JD Vance have to say about them ? ", "date": "2024-07-30 11:15", "url": "https://www.yahoo.com/news/two-tennessean-presidents-had-no-100023241.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Two Tennessean presidents had no children.\nWhat does JD Vance have to say about them?\nTwo others who had no biological children were from Tennessee: Seventh President Andrew Jackson who served from 1829 to 1837 and Eleventh President James K. Polk who served between 1845 and 1849.\nFormer President Andrew JacksonAmong them were Andrew Jackson Jr. who was one Rachel Jackson's nephews whom they raised from infancy.\nA mentee of Jackson, Polk served in the Tennessee General Assembly, Congress and as governor of Tennessee.", "location": "Tennessee", "classification": "security", "score": 0.48435859302781925, "event_breakdown": "Current events happening in security can be found from Axios with a link to news about the event.\n\nExample Event 1:\"Details:An Iranian military drone  stuck in the key choke point in the central region between the Gulf of Oman and the Persian Gulf is raising security tensions in a strategic area for the world's oil industries.\nLocation:Chalbanan\nDate:202206linked article\nEvent 2:\nDetails:\nNASHVILLE, Tenn -- Republican gubernatorial candidate________________________accused Democrat_________________________of being for a women who quote \"wants to castrate\" boys and subjected students to \"racist and ageist Snapchats\" during the pair's only scheduled debate.\nLocation:\nDate:\n\nSecurity Current Events:\n- Military Drone Stuck in Key Chokepoint Raises Tension in"}, {"id": "5b047132-7deb-4cb5-8d2d-0e162dbcc160", "title": "Two Tennessean presidents had no children . What does JD Vance have to say about them ? ", "date": "2024-07-30 11:00", "url": "https://www.yahoo.com/news/two-tennessean-presidents-had-no-100023608.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Two Tennessean presidents had no children.\nWhat does JD Vance have to say about them?\nTwo others who had no biological children were from Tennessee: Seventh President Andrew Jackson who served from 1829 to 1837 and Eleventh President James K. Polk who served between 1845 and 1849.\nFormer President Andrew JacksonAmong them were Andrew Jackson Jr. who was one Rachel Jackson's nephews whom they raised from infancy.\nA mentee of Jackson, Polk served in the Tennessee General Assembly, Congress and as governor of Tennessee.", "location": "Tennessee", "classification": "security", "score": 0.48435859302781925, "event_breakdown": "Target event not found."}, {"id": "68bab1f6-a160-4d51-9fe9-2096cc62f704", "title": "Israel prepares region - wide escalation of war across Middle East with American imperialism support", "date": "2024-07-30 04:45", "url": "https://www.wsws.org/en/articles/2024/07/30/ornu-j30.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "American imperialism’s determination to wage war across the Middle East is rooted in its precipitous economic decline, which has compelled it to engage in over three decades of uninterrupted war.\nThese wars have killed millions across the Middle East, North Africa, and Central Asia and forced millions more to flee their homes.\nThe Middle East is one front for US imperialism in this global conflagration.\nThis is why Netanyahu’s speech defending genocide and advocating war throughout the Middle East won such a rapturous response from the representatives of the American ruling class.\nThe same capitalist contradictions that are propelling the imperialists toward world war are radicalising millions of workers internationally and driving them into struggles with revolutionary implications.", "location": "Middle East", "classification": "security", "score": 0.5943453849336761, "event_breakdown": "US Bombing of Syria\nNetanyahu's Speech Defending Genocide\nUS Embargo on Iran\nUS Bombing of Yemen\nUS Bombing of Iraq\nUS Intervention in Libya"}, {"id": "4e7fe51d-b6dd-47bf-9e24-ae50101ade7d", "title": "Is Venezuela on the Brink of Civil War ? ", "date": "2024-07-30 12:45", "url": "https://townhall.com/tipsheet/mattvespa/2024/07/30/is-venezuela-on-the-brink-of-civil-war-n2642705", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Venezuelan President Nicolas Maduro likely lost the recent elections in his country because no one believes the official result.\nHe was declared the winner after reports of the usual shenanigans, which included police forces barring people from entering polling locations.\nThe State Department voiced its concern about the legitimacy of the results because they were fugazi.\nIf they do not entrench themselves in the commands, we will use everything we have and all my people throughout the Huárico State will begin to launch attacks on the officialsAdvertisementIs Venezuela on the verge of civil war?\nLet’s hope not, but Maduro’s grip on the country appears to be loosening fast.", "location": "Venezuela", "classification": "security", "score": 0.504857268943148, "event_breakdown": "1. Venezuelans barred from voting and subject to attacks by security forces\n2. Venezuelan president Nicolas Maduro declared winner of recent elections\n3. State Department voices concern about legitimacy of election results"}, {"id": "06a2466b-da1a-4855-92cf-1186d059aa8f", "title": "Putin Wagner Group mercenaries got thrashed in the African desert and Ukraine says it helped", "date": "2024-07-30 12:45", "url": "https://www.yahoo.com/news/putins-wagner-group-mercenaries-got-112054904.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedPutin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedUkraine says it aided rebels in Mali to defeat Russian Wagner Group mercenaries.\nUkraine's defense intelligence claimed a role in a recent battle in Africa — where separatist rebels destroyed a detachment of Russian Wagner Group mercenaries fighting overseas.\nThe paper published a photograph of Malian separatist forces holding up a Ukrainian flag, an apparent expression of solidarity with the country.\nThe separatist group that claimed responsibility for the attack is the Permanent Strategic Framework for Peace, Security and Development, or CSP-PSD, the BBC reported.\nThe CSP-PSD opposes Mali's junta, which has been propped up by the Wagner Group for several years.", "location": "Africa", "classification": "security", "score": 0.8116182718462358, "event_breakdown": "Ukrainian defense intelligence claims involvement in a recent battle in Africa where rebels defeated Russian Wagner Group mercenaries in the Malian desert. The photo by Ukraine's defense intelligence shows a detachment of separatist troops in Mali holding a Ukrainian flag."}, {"id": "8b570a54-fbab-435a-aeff-2cb7bc8f5023", "title": "Putin Wagner Group mercenaries got thrashed in the African desert and Ukraine says it helped", "date": "2024-07-30 12:45", "url": "https://www.yahoo.com/news/putins-wagner-group-mercenaries-got-112054111.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedPutin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedUkraine says it aided rebels in Mali to defeat Russian Wagner Group mercenaries.\nUkraine's defense intelligence claimed a role in a recent battle in Africa — where separatist rebels destroyed a detachment of Russian Wagner Group mercenaries fighting overseas.\nThe paper published a photograph of Malian separatist forces holding up a Ukrainian flag, an apparent expression of solidarity with the country.\nThe separatist group that claimed responsibility for the attack is the Permanent Strategic Framework for Peace, Security and Development, or CSP-PSD, the BBC reported.\nThe CSP-PSD opposes Mali's junta, which has been propped up by the Wagner Group for several years.", "location": "Bamako", "classification": "security", "score": 0.8116182718462358, "event_breakdown": "Ukrainian defense intelligence said it destroyed a detachment of Russian Wagner Group mercenaries in the African desert in an operation last month, according to the BBC on Tuesday."}, {"id": "e2cb00a3-b537-4008-8045-d5864bd3c66c", "title": "Explosion in Beirut , Hezbollah commander responsible for killing children targeted", "date": "2024-07-30 18:30", "url": "https://www.israelnationalnews.com/news/393861", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Contradictory reports have emerged as to whether he survived or not, with the most recent reports stating that he was eliminated.\nThe commander was reportedly Hezbollah's second-highest ranking official, Fuad Shukr, who also known as Hajj Mohsin, according to Lebanese reports.\nShukr played a role in the 1983 bombing of the US army barracks in Beirut in which 241 American servicemen were killed.\nA senior Israeli official told Kan News that the Israeli government believes the Shukr was killed in the strike.\nOn Tuesday afternoon, an Israeli man was killed in a Hezbollah rocket attack on the Galilee.", "location": "BEIRUT", "classification": "security", "score": 0.873876900711239, "event_breakdown": "IDF official: Iran is building underground facilities in Syria\nThe head of IDF Operations, Major General Aharon Haliva, said in Lebanese reports that \"Iran is digging underground facilities and tunnels in Syria, where it smuggles precision missiles.\""}, {"id": "bbcf9ad5-3c11-479d-a2d3-acbefd06a3ee", "title": "Israel strikes Beirut suburb , targeting Hezbollah official and killing at least 1 person", "date": "2024-07-30 19:15", "url": "https://www.cbsnews.com/news/lebanon-israel-strikes-hezbollah-commander-beirut-suburb/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Fears of wider war in Middle East after Israel strikes Hezbollah in LebanonIsrael carried out a rare strike on Beirut Tuesday, killing at least one person and raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\n\"Hezbollah crossed a red line,\" Israeli Defense Minister Yoav Gallant posted on the platform X shortly after Tuesday's strike.\nHezbollah's Al-Manar TV said 17 wounded were taken to the private Bahman Hospital, while 14 were taken to Hezbollah's Rasoul Aazam hospital.\nA Hezbollah official and the group's TV station said that an Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe territory's Health Ministry says over 39,300 people have been killed since Hamas' Oct. 7 attack on Israel sparked the war.", "location": "BEIRUT", "classification": "security", "score": 0.8357678792428312, "event_breakdown": "Israel carries out a strike on Beirut, Lebanon, killing at least one person and raising the tensions with the militant group Hezbollah"}, {"id": "16def74b-e3aa-400e-b2e9-b66ec8cb999a", "title": "Israeli airstrike hits Beirut and kills 1 person in escalating tensions with Hezbollah", "date": "2024-07-30 19:15", "url": "https://www.startribune.com/israel-says-it-has-struck-beirut-targeting-commander-accused-in-deaths-of-12-children-and-teens/600387645/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "BEIRUT — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\n\"Hezbollah crossed a red line,'' Israeli Defense Minister Yoav Gallant posted on the platform X shortly after Tuesday's strike.\nA Hezbollah official and the group's TV station said that the Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe strike hit an apartment building near to a hospital, collapsing half of the targeted building and severely damaging one next to it.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT", "classification": "security", "score": 0.96292967480214, "event_breakdown": "Israel carried out a rare strike in Beirut on Tuesday that killed at least one person and wounded others. The airstrike hit an apartment building near a hospital, causing damage."}, {"id": "6810ec06-48f3-43e3-b7f0-a4330d78657c", "title": "Israel says it has struck Beirut – NBC New York", "date": "2024-07-30 19:15", "url": "https://www.nbcnewyork.com/news/national-international/israel-struck-beirut-targeting-commander-accused-deaths-golan/5649675/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Israel has blamed the rocket attack on the Hezbollah militant group, which has denied any role in the Saturday attack.\n“The Israeli enemy has committed a great stupid act in size, timing and circumstances by targeting an entirely civilian area,” Hezbollah official Ali Ammar told Al-Manar TV.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThe last time Israel targeted Beirut was in January, when an airstrike killed a top Hamas official, Saleh Arouri.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.9402360994738423, "event_breakdown": "On August 6, 2022, Israel launched an airstrike on Beirut’s southern suburb of Haret Hreik, damaging several buildings. The attack was blamed on the Hezbollah militant group, which denied any role in the strike."}, {"id": "2c255075-151d-4f98-8835-c43d4ce5653d", "title": "Israeli airstrike hits Beirut and kills 1 person in escalating tensions with Hezbollah", "date": "2024-07-30 19:15", "url": "https://www.tricitynews.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.9859253744724551, "event_breakdown": "Target Events:\n1. Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah."}, {"id": "212521b3-f346-406e-9e86-4db78ea07e3f", "title": "Israeli airstrike hits Beirut and kills 1 person in escalating tensions with Hezbollah", "date": "2024-07-30 19:15", "url": "https://www.prpeak.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.9859253744724551, "event_breakdown": "Israel carries out rare strike on Beirut, Lebanon, killing at least one person and wounding others. The airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings."}, {"id": "15cf5fa3-c4c6-47dd-b2e6-6b3b6c9eb311", "title": "Israeli airstrike hits Beirut and kills 1 person in escalating tensions with Hezbollah", "date": "2024-07-30 19:15", "url": "https://www.richmond-news.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.9859253744724551, "event_breakdown": "Israel launches rare strike on Beirut, killing at least one, wounding others\n\nBrief summary:\nIsrael carried out a rare strike on Beirut, killing at least one, wounding others, and potentially escalating tensions with the Lebanese militant group Hezbollah."}, {"id": "76166465-3ea2-4ace-b1b1-ba4cb896a465", "title": "Israel says it has struck Beirut , targeting the commander accused in deaths of 12 youth in Golan", "date": "2024-07-30 19:15", "url": "https://santamariatimes.com/ap/international/israel-says-it-has-struck-beirut-targeting-the-commander-accused-in-deaths-of-12-youth/article_68a0d584-59e5-56ac-9964-37b19e3bc17d.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Israel says it has struck Beirut, targeting the commander accused in deaths of 12 youth in GolanThe Israeli military says it has carried out a strike on Beirut targeting the militant commander who is accusd of being behind the deaths of 12 children and teens in a rocket attack on the Israeli-controlled Golan Heights over the weekend", "location": "Lebanon", "classification": "security", "score": 0.9493253553259394, "event_breakdown": "Israel says it has struck Beirut, targeting the commander accused in the deaths of 12 Palestinian youth in Golan."}, {"id": "32993b82-55f8-4ad3-8c89-31e457e95bcd", "title": "  Clue emerge from strike that killed 12 children in Golan Heights", "date": "2024-07-30 15:15", "url": "https://www.naharnet.com/stories/en/306897-majdal-shams-strike-what-we-know-and-what-remains-unclear", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two days after a rocket slammed into a soccer pitch in the Israel-controlled Golan Heights, killing 12 children, many questions remain about the attack on the Druze town of Majdal Shams.\nExperts say the fragmentation and impact patterns are consistent with a rocket attack.\nWeir said a Hezbollah rocket aimed at the military position on Mount Hermon may have overshot its target, landing in Majdal Shams.\nOnly 20% of residents in Majdal Shams, part of the Golan Heights annexed by Israel in 1981, have accepted Israeli citizenship.\nThe military said Iron Dome sirens have gone off in Majdal Shams 30 times during the conflict.", "location": "GOLAN HEIGHTS", "classification": "security", "score": 0.9132329908509442, "event_breakdown": "Target event - 20 May 2019\nIn the Golan Heights, Syria, a Hezbollah rocket landed in a Druze town, Majdal Shams. The Israelis assess the work with the Druze community in the border area and the stability of the border since 1974, when the separatist movement fractured."}, {"id": "92524c11-6351-41ed-9886-a5fce66a08c5", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.clydebankpost.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "clydebankpost.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Event 1: Israeli airstrike hit Hezbollah’s stronghold south of Beirut."}, {"id": "6912f1f7-3983-45be-ac45-3745934002fd", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.wiltsglosstandard.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "wiltsglosstandard.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Haret Hreik, Beirut, Lebanon"}, {"id": "8114ea25-cb60-42f3-b769-ca0d33eaded1", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.cravenherald.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "cravenherald.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Airstrike hits Hezbollah stronghold in Beirut, Israel defence minister says"}, {"id": "a30dc234-7048-4ff1-92b6-5e930196cabe", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.warringtonguardian.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "warringtonguardian.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Hezbolla strike in Beirut, Haret Hreik http://www.hurriyet.com.au/world/middle-east/israel-strike-in-beirut-hits-hezbollah-stronghold-20220127-p59qmt.html"}, {"id": "8d4c3a43-5b4b-4870-9954-d5119f5608b1", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.eastlothiancourier.com/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "eastlothiancourier.com", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israeli airstrike in Beirut, Lebanon"}, {"id": "84fc5176-35d3-4bd7-a1fe-0cad8203ecc3", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.surreycomet.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "surreycomet.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Current Events of Security Reported in Text that Can be Placed on a Map:\n[\n{\n\"Location\": \"Haret Hreik, Beirut\",\n\"Description\": \"An airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage. It hit an apartment building next to a hospital, collapsing half of the targeted building. The strike was Israel's first in Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.\"\n}\n]"}, {"id": "1207de75-257b-4c02-a9bd-273541609dab", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.northwichguardian.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "northwichguardian.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israeli airstrike hits Hezbollah’s stronghold south of Beirut, causing damage. This is the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006."}, {"id": "56c87d3d-2626-4ad3-8f90-629eb73676b3", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.dudleynews.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "dudleynews.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israeli airstrike near Beirut, Lebanon"}, {"id": "87a9d646-f885-4137-91fe-0d5a92a9f016", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.somersetcountygazette.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "somersetcountygazette.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israeli Strike on Beirut:\nIsraeli Strike on Beirut, Lebanon."}, {"id": "e5f8f497-525e-44c9-82c0-e4113b71fda3", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.wharfedaleobserver.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "wharfedaleobserver.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Event1: Israeli airstrike hit Hezbollah's stronghold south  Beirut, causing damage.\nEvent2: Israeli airstrike damaged apartment building next to a  hospital in Beirut's southern suburb of Haret Hreik, collapsing half of the targeted building."}, {"id": "5770d4b4-7870-4964-9472-db7b83bb9708", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.whtimes.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "whtimes.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Airstrike on Hezbollah's stronghold south of Beirut, causing damage. Israeli airstrike hit Beirut’s southern suburb of Haret Hreik, damaging several buildings."}, {"id": "89e3834a-7703-4912-8c6a-79865ef43e2f", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:15", "url": "https://www.thisisoxfordshire.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "thisisoxfordshire.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Hezbollah-Israeli Tension"}, {"id": "f18a248e-b964-47ab-8391-a1b9491b673f", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:00", "url": "https://www.eastlondonadvertiser.co.uk/news/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "eastlondonadvertiser.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Event 1: Israeli airstrike hit Beirut's southern suburb of Haret Hreik on Tuesday, causing damage. Event 2: An Israeli airstrike hit an apartment building next to a hospital, causing damage to the building."}, {"id": "9e616ab4-74c4-45c9-8895-5adfe15931a0", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:00", "url": "https://www.keighleynews.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "keighleynews.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "['type', 'date', 'what', 'how', 'where']\n['skirmish', '2022-05-25', 'Hezbollah strike', 'Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage', 'Beirut']"}, {"id": "85e6efbd-dc90-483a-befa-38d73a7fac9f", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:00", "url": "https://www.dunfermlinepress.com/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "dunfermlinepress.com", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israel reportedly targets Beirut, in the first strike since 2006 war between Israel and Hezbolla."}, {"id": "4dec0888-e388-4d22-ba21-ed502b521e26", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:30", "url": "https://www.eveshamjournal.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "eveshamjournal.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "Haret Hreik", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Hezbollha accused Israel of targeting it in Beirut. Israel then denied that saying the explosion was caused by a corruption of badly stored Ammonium nitrate."}, {"id": "b3d2a62a-30bd-4cc2-a26d-1921a62f2138", "title": "Israel targets Hezbollah commander in strike on Beirut suburb", "date": "2024-07-30 19:30", "url": "https://www.dunmowbroadcast.co.uk/news/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "domain": "dunmowbroadcast.co.uk", "domain_classification": "Unknown", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT.", "classification": "security", "score": 0.7316141906818862, "event_breakdown": "Israeli airstrike hits Beirut and damages several buildings, causing damage."}, {"id": "7b57298b-fb7b-4755-b826-1371780496a9", "title": "Explosion hits Beirut suburb as Israel says it carries out strike", "date": "2024-07-30 19:15", "url": "https://www.bbc.com/news/live/cpv3107lv5et", "domain": "bbc.com", "domain_classification": "International", "message": "Question now is whether Hezbollah will launch a retaliationHugo BachegaMiddle East correspondent, in BeirutFor days, Lebanon waited for an Israeli attack.\nThe target was a senior commander, who has been identified by media reports as Fuad Shukr, said to be close to Hassan Nasrallah, the powerful Hezbollah leader.\nIt was the second time Israel targeted Beirut: in January, an attack killed the senior Hamas leader Saleh al-Arouri.\nThe current hostilities started in October, with Hezbollah launching rockets at Israel in support for Palestinians in Gaza a day after the Hamas attacks.\nHezbollah has not yet responded to the strike, which is another example of the extraordinary intelligence the Israeli authorities have about the group.", "location": "BEIRUT", "classification": "security", "score": 0.966168925184923, "event_breakdown": "['Israel attacked Beirut, targeting a senior Hezbollah commander', 'In January, Israel attacked Beirut and killed the senior Hamas leader Saleh al-Arouri']"}, {"id": "d0080ae5-b2c6-47e1-998a-e5a451428e0b", "title": "Israel says it targeted Beirut commander accused in deaths of 12 kids , teens", "date": "2024-07-30 18:30", "url": "https://www.ctvnews.ca/world/israel-says-it-has-struck-beirut-targeting-the-commander-accused-in-deaths-of-12-children-and-teens-1.6983062", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "TEL AVIV, ISRAEL -Israel's military said Tuesday it carried out a strike on Beirut targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-controlled Golan Heights over the weekend.\nA Hezbollah official and the group's TV station said that an Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nLebanon's state-run National News Agency reported that the airstrike in the southern Beirut suburb was carried out with a drone that launched three rockets.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "location": "BEIRUT", "classification": "security", "score": 0.9559919732617428, "event_breakdown": "Israeli airstrike on Beirut\nIsrael's military said Tuesday it carried out a strike on Beirut targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-controlled Golan Heights over the weekend."}, {"id": "74c9646d-fb92-48cd-8fe7-4ae26b6de262", "title": "Israel strikes Lebanese capital Beirut , targeting Hezbollah official", "date": "2024-07-30 19:00", "url": "https://www.livemint.com/news/world/israelhamas-war-latest-israel-strikes-beirut-suburb-targeting-hezbollah-official-11722360787161.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "The Israeli military said on Tuesday it carried out a strike on Lebanese capital Beirut targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-occupied Golan Heights over the weekend.\nIsrael has blamed the rocket attack on the Hezbollah militant group, which has denied any role in the attackA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings but it was not immediately clear if any Hezbollah official was targeted, the Hezbollah official said on condition of anonymity in line with regulations.\nIsraeli Prime Minister Benjamin Netanyahu had vowed heavy retaliation against Hezbollah for Saturday's rocket strike in the Israel-controlled Golan Heights, though Hezbollah has denied any role in the attack.\nIsraeli authorities have generally denied abuses in detention facilities for Palestinians.", "location": "BEIRUT.", "classification": "security", "score": 0.9698599708396665, "event_breakdown": "Israeli military strikes Beirut, targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-occupied Golan Heights over the weekend. The Israeli military has blamed the rocket attack on the Hezbollah militant group.The strike hit Hezbollah's stronghold south of Beirut, causing damage. Hezbollah has denied any role in the attack, but Israeli authorities have vowed to respond."}, {"id": "6fdab8a1-9046-46d8-ba5f-a0746e3ec4ce", "title": "Israeli military says strike in Beirut is retaliation for Golan Heights attack", "date": "2024-07-30 19:15", "url": "https://www.cbc.ca/news/world/israel-beirut-strike-1.7279975", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "An Israeli air strike targeted a senior Hezbollah commander in Beirut's southern suburbs late on Tuesday, in what the Israeli military said was retaliation for a cross-border rocket attack three days before that killed 12 children.\nThe Israeli strike had targeted but failed to kill Hezbollah's operations chief, two security sources told Reuters.\nLebanon's Foreign Minister Abdallah Bou Habib said his government condemned the Israeli strike and planned to file a complaint to the United Nations.\nIn a statement, the Israeli military said it had conducted \"a targeted strike in Beirut on the commander responsible for the murder of the children in Majdal Shams and the killing of numerous additional Israeli civilians.\"\n(Jalaa Marey/AFP/Getty Images)Earlier on Tuesday, more rocket fire from south Lebanon killed a civilian in a kibbutz in northern Israel, medics said.", "location": "BEIRUT.", "classification": "security", "score": 0.9752717464646901, "event_breakdown": "'Israeli air strike in Beirut kills senior Hezbollah commander'"}, {"id": "48fcf465-2dfe-4e51-ba55-55cd5bbc9480", "title": "Israel targets senior Hezbollah commander in strike on Beirut : IDF", "date": "2024-07-30 19:15", "url": "https://6abc.com/israel-targets-senior-hezbollah-commander-in-strike-on-beirut-idf/15122560/", "domain": "6abc.com", "domain_classification": "Unknown", "message": "Israel targets senior Hezbollah commander in strike on Beirut: IDFIsrael has launched a strike on Beirut, the capital city of Lebanon, on Tuesday targeting a senior Hezbollah commander as tensions along Israel's northern border continue to escalate.\n\"The IDF targeted in Beirut the commander responsible for the murder of the children in Majdal Shams and killed many Israeli civilians,\" the Israel Defense Forces told ABC News in a statement.\nIn recent days, Hezbollah has said that any strike in Beirut would be met with a strong response of their own.\nThe U.S. was given advanced notice ahead of Israel's strike in Beirut, according to a U.S. official familiar with matter.\n\"Our support for Israel's security is ironclad, and it's unwavering, especially as it defends itself against Iran backed threats, including threats from Hezbollah,\" Pate told reporters.", "location": "Beirut", "classification": "security", "score": 0.8225026602729014, "event_breakdown": "IDF strikes Beirut targeting commander responsible for killing children in Majdal Shams\nIDF targets Beirut commander responsible for killing children in Majdal Shams"}, {"id": "97663145-1951-46c1-b4a6-913c035fce20", "title": "Israel targets senior Hezbollah commander in strike on Beirut : IDF", "date": "2024-07-30 19:15", "url": "https://abc30.com/israel-targets-senior-hezbollah-commander-in-strike-on-beirut-idf/15122560/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "Israel targets senior Hezbollah commander in strike on Beirut: IDFIsrael has launched a strike on Beirut, the capital city of Lebanon, on Tuesday targeting a senior Hezbollah commander as tensions along Israel's northern border continue to escalate.\n\"The IDF targeted in Beirut the commander responsible for the murder of the children in Majdal Shams and killed many Israeli civilians,\" the Israel Defense Forces told ABC News in a statement.\nIn recent days, Hezbollah has said that any strike in Beirut would be met with a strong response of their own.\nThe U.S. was given advanced notice ahead of Israel's strike in Beirut, according to a U.S. official familiar with matter.\n\"Our support for Israel's security is ironclad, and it's unwavering, especially as it defends itself against Iran backed threats, including threats from Hezbollah,\" Pate told reporters.", "location": "BEIRUT", "classification": "security", "score": 0.8225026602729014, "event_breakdown": "IDF targets commander in Beirut for the killing of children in Majdal Shams"}, {"id": "91269a81-908a-4efd-8ed0-bf6f629249c5", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.wmra.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "wmra.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "Target event: Israeli official whose name is Barzilai\nBEIRUT — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nIt was only the latest in a string of attacks in Lebanon, Syria, and Iraq that have been part of an escalating proxy war between Israel and Iran."}, {"id": "785337a0-f153-44f9-8309-d2367a06943c", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.wuwf.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "wuwf.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT, Lebanon", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "BEIRUT, Lebanon — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area. Lebanon's state media reported that a building collapsed in the southern suburbs after \"an enemy attack.\" Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel."}, {"id": "e6f88ee6-8f9c-46db-a57b-ba1b0fe4037f", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.apr.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "apr.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "Israel strikes Hezbollah commander's car in southern Beirut, wounding several people and sparking a large explosion."}, {"id": "0c673253-d0c3-420c-b2a3-1c69243e5fcd", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.wprl.org/npr-news/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "wprl.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "Here are the relevant events with their locations:\n- A large explosion ripped through the streets of southern Beirut, Lebanon on July 14, 2024.\n- An Israeli official told NPR that the target of the strike was a Hezbollah commander named Fouad Shukr."}, {"id": "e795723e-814b-49fc-9411-444cb2eee199", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://news.prairiepublic.org/news-from-npr/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "news.prairiepublic.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT, Lebanon", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "BEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening. Police closed off the roads and an ambulance wailed its way to the area. state media reported that a building collapsed in the southern suburbs after \"an enemy attack.\" Hezbollah has not commented. The source of the blast was not immediately confirmed.\nAn Israeli official told NPR that the Hezbollah commander who was targeted is named Fouad Shukr. The source of the blast was not immediately confirmed."}, {"id": "1e10322c-89cf-4ce4-b7be-ff2ba57cee34", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.boisestatepublicradio.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "boisestatepublicradio.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "A large explosion ripped through the streets of southern Beirut, close to the location of a recent strike."}, {"id": "6e10257d-04d5-412a-a7f3-eacc2b093675", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://www.wmuk.org/npr-news/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "wmuk.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": ")\nBEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "A large explosion ripped through the streets of southern Beirut on Tuesday, Lebanon's state media reported, after what an initial Israeli official confirmed to NPR as a strike on the home of a Hezbollah commander. No confirmation from Lebanon or Hezbollah yet."}, {"id": "91237f08-2a83-41a1-a716-c47d4ff0bdb5", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:00", "url": "https://www.kwbu.org/latest-from-npr/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "kwbu.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT, Lebanon", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "A large explosion ripped through the streets of southern Beirut on Tuesday evening.The target was in southern Beirut."}, {"id": "acf7f426-82d5-4856-8fb0-fa8814e84afa", "title": "Acting Secret Service boss  cannot defend  unsecured roof", "date": "2024-07-30 19:00", "url": "https://bismarcktribune.com/news/nation-world/government-politics/elections/acting-secret-service-director-says-hes-ashamed-after-the-trump-assassination-attempt/article_4d8519f7-37b9-585a-b907-b954aca51c09.html", "domain": "bismarcktribune.com", "domain_classification": "Unknown", "message": "As a career law enforcement officer and a 25-year Secret Service veteran, I cannot defend why that roof was not better secured,\" he said.\n“Neither the Secret Service counter sniper teams nor members of the former president’s security detail had any knowledge that there was a man on the roof of the building with a firearm,” Rowe said.\nTrump, the 2024 Republican presidential nominee, was struck in the ear by a bullet or a bullet fragment in the assassination attempt, one rallygoer was killed and two others were injured before the gunman was killed by a Secret Service counter-sniper.\nShortly before the shooting, a local officer climbed up to the roof to investigate.\nWe didn’t know that there was this incident going on.”But Rowe's willingness to assign blame to local law enforcement opened him up to harsh criticism from Senate Republicans, who saw him as failing to take sufficient responsibility.", "location": "WASHINGTON D.C.", "classification": "security", "score": 0.7182372281078472, "event_breakdown": "Target Event: \nNorth Freeway crash cleared; road open to traffic\nCrash on North Freeway cleared; all lanes open to traffic after 2-vehicle wreck Friday morning."}, {"id": "7fe5f145-2659-4dcb-9093-e437a2d6a11f", "title": "Israel , Hezbollah exchange fire amid calls for restraint after Golan attack", "date": "2024-07-30 15:30", "url": "https://www.digitaljournal.com/world/israel-hezbollah-exchange-fire-amid-calls-for-restraint-after-golan-attack/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Israeli medics on Tuesday said one civilian, a 30-year-old man, was killed following a rocket attack on the northern kibbutz of HaGoshrim.\n– ‘Constant anxiety’ –Hezbollah has been exchanging near-daily fire with Israel in solidarity with its ally Hamas since war erupted in Gaza in October.\nLebanon has been bracing for major retaliatory strikes following the Golan attack, amid international efforts to defuse tensions.\nScores of Majdal Shams residents had come out to protest Netanyahu’s visit after the burial of the last of the victims of the rocket strike.\nA paramedic from Majdal Shams, Nabih Abu Saleh, told AFP his community was “against any Israeli response”, and asked: “Who will we strike?", "location": "Israel", "classification": "security", "score": 0.8331584064872001, "event_breakdown": "No relevant events were found in the provided text."}, {"id": "0e33bebe-ef02-458b-8998-9236a7ae09a1", "title": "Israel , Hezbollah exchange fire amid calls for restraint after Golan attack", "date": "2024-07-30 17:00", "url": "https://www.al-monitor.com/originals/2024/07/israel-hezbollah-exchange-fire-amid-calls-restraint-after-golan-attack", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "A source close to Hezbollah said senior commander Fuad Shukr was the target but that he \"survived the Israeli strike\".\nThe Hezbollah source said two people were killed in Tuesday's strike.\nMinutes after the explosions rocked Beirut, Israeli Defence Minister Yoav Gallant posted on social media site X that \"Hezbollah crossed the red line\".\nHezbollah backer Iran denounced a \"vicious\" strike, while Russia's foreign ministry said the Israeli attack was a \"gross violation of international law\".\n- Gaza 'decomposed bodies' -Hezbollah has said its attacks on northern Israel are in solidarity with Hamas and the people of Gaza, who have been under siege by Israel since October 7.", "location": "Lebanon", "classification": "security", "score": 0.8540957522787459, "event_breakdown": "Targets: Beirut\nTime Frame: Tuesday\nEvent:\nTwo Palestinians reportedly killed in an Israeli air strike on a military target near the Syrian-Lebanese border on Tuesday night, the source said. \nUpdates to come."}, {"id": "f93bc41b-b555-4437-bbe4-36220908edec", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 19:15", "url": "https://thepublicsradio.org/npr/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights/", "domain": "thepublicsradio.org", "domain_classification": "Unknown", "message": "A view of buildings shows damage after what security sources said was a strike on Beirut’s southern suburbs, on Tuesday.\n(Ahmad Al-Kerdi | Reuters)Israel says its forces carried out a “targeted strike” in the southern suburbs of Lebanon’s capital of Beirut Tuesday in retaliation for a rocket attack that killed 12 children and teens on Saturday in the Israeli-controlled Golan Heights.\nThe Israeli military said in a statement it was targeting a commander of the Iran-backed militia Hezbollah which it blamed for Sunday’s rocket attack.\nA large explosion rocked the southern part of the city, witnesses said, and video from the scene showed a large cloud of smoke rising from the area.\nThe strike came as the international community urged restraint from both sides, fearing that an escalation on the Israel-Lebanon border could spark an all-out war.", "location": "BEIRUT", "classification": "security", "score": 0.923878296994594, "event_breakdown": "The events are listed as follows:\n* A view of buildings shows damage after what security sources said was a strike on Beirut’s southern suburbs, on Tuesday.\n* The Israeli military said said it had carried out a \"targeted strike\" on a commander in a missile attack in the Lebanese capital of Beirut on Tuesday, according to the military."}, {"id": "ddf032d8-54e4-468d-a922-3474b92ce877", "title": "A third girl has died in the united kingdom after one of the worst attacks on children in decades . Here what to know", "date": "2024-07-30 19:15", "url": "https://krdo.com/news/2024/07/30/a-third-girl-has-died-in-the-uk-after-one-of-the-worst-attacks-on-children-in-decades-heres-what-to-know/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Ivana Kottasová, CNN(CNN) — The United Kingdom was left shaken after three children were stabbed to death and eight others were injured in a knife attack in Southport, in one of the worst assaults against children in the country in decades.\nOfficers said the following day that another child, a 9-year-old girl, had died as a result of her injuries.\nPolice named the girls who died in the attack as Alice Dasilva Aguiar, 9, Bebe King, 6, and 7-year-old Elsie Dot Stancombe.\nWorst mass stabbing attack against kidsThe incident on Monday is the worst mass stabbing attack targeting children in the UK in decades – and possibly ever.\nBut children have been targeted in the UK in other types of attacks.", "location": "England", "classification": "security", "score": 0.8394896018598477, "event_breakdown": "Three children were stabbed to death and eight others were injured in a knife attack in Southport, England on Monday."}, {"id": "1959d762-f023-4cc7-af82-5d9d4813cc5a", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 18:30", "url": "https://www.wbfo.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "wbfo.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUIT, Lebanon", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "BEIRUT, Lebanon - A large explosion ripped through the streets of southern Beirut on Jan. 19. Close to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area, according to the news agencies. Lebanon's state media reported that a building collapsed in the southern suburbs after \"an enemy attack.\" Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fawad Shukr. Israel and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after Hamas militants attacked Israel."}, {"id": "e9ae4fb4-4415-488c-b811-0329ebb31c0f", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 18:30", "url": "https://www.ketr.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "ketr.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "Israeli airstrikes were reported in southern Lebanon on Tuesday. The Israeli military said it had struck several targets. The target was a Hezbollah commander. The Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr."}, {"id": "d05cfefe-496e-4a37-8047-8d907db094b0", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 18:30", "url": "https://www.kmuw.org/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "kmuw.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "Event 1: A large explosion ripped through the streets of southern Beirut on Tuesday evening, close to the location of the strike. State media reported that a building collapsed in the southern suburbs following \"an enemy attack.\" Hezbollah has not commented.\nEvent 2: Israel's official told National Public Radio (NPR) the Hezbollah commander who was targeted is named Fouad Shukr. Israel and Hezbollah have been trading fire across their shared border since the Gaza war began on October 7 of last year, after Hamas-led attack on Israel."}, {"id": "7b116ec4-dd17-4309-9d22-550cb0488463", "title": "Israel says it struck Beirut after an attack in Israeli - controlled Golan Heights", "date": "2024-07-30 18:30", "url": "https://www.kunc.org/npr-news/2024-07-30/israel-says-it-struck-beirut-after-an-attack-in-israeli-controlled-golan-heights", "domain": "kunc.org", "domain_classification": "Unknown", "message": "Updated July 30, 2024 at 15:33 PM ETBEIRUT, Lebanon, and TEL AVIV, Israel — A large explosion ripped through the streets of southern Beirut on Tuesday evening.\nClose to the location of Tuesday's strike in Beirut, police closed off the roads and an ambulance wailed its way to the area.\nLebanon's state media reported that a building collapsed in the southern suburbs after “an enemy attack.” Hezbollah has not commented.\nAn Israeli official told NPR the Hezbollah commander who was targeted is named Fouad Shukr.\nIsrael and Hezbollah have been trading fire across their shared border since the Gaza war began on Oct. 7 of last year, after the Hamas-led attack on Israel.", "location": "BEIRUT, Lebanon.", "classification": "security", "score": 0.7599172757605406, "event_breakdown": "A large explosion ripped through the streets of southern Beirut on Tuesday evening. The blast occurred near the location of Tuesday's strike in Beirut, Lebanon, causing damage to buildings and at least one report of injuries. No claim of responsibility has been made."}, {"id": "02ca6f4a-59de-4252-930c-4f1fd7638652", "title": "Israel , Hezbollah exchange fire amid calls for restraint after Golan attack", "date": "2024-07-30 17:00", "url": "https://www.bssnews.net/international/201900", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "JERUSALEM, July 30, 2024 (BSS/AFP) - Israel and Hezbollah exchanged deadlyfire on Tuesday, following a rocket attack from Lebanon on the Golan Heightsthat killed 12 children over the weekend and sent regional tensions soaring.\nDuring a visit Monday to Majdal Shams, Israeli Prime Minister BenjaminNetanyahu vowed a \"severe response\", raising fears yet again that the Gazawar could spill over into a wider regional conflagration, despiteinternational appeals for calm.\n- 'Constant anxiety' -Hezbollah has been exchanging near-daily fire with Israel in solidarity withits ally Hamas since war erupted in Gaza in October.\nScores of Majdal Shams residents had come out to protest Netanyahu's visitafter the burial of the last of the victims of the rocket strike.\nA paramedic from Majdal Shams, Nabih Abu Saleh, told AFP his community was\"against any Israeli response\", and asked: \"Who will we strike?", "location": "Based on the text you provided, the most specific location where the main event takes place is 'Minjdal", "classification": "security", "score": 0.531577381828386, "event_breakdown": "Based on this, the target event is the deadly fire exchange between Israel and Hezbollah on July 30, 2024. This event can be located on the map by placing pins identifying the general locations of where the attack happened, possibly on the border between Israel and Lebanon."}, {"id": "3549787b-b0ff-4bb8-b699-293c432944fc", "title": "Anxiety , resignation in Beirut as residents worry about an Israeli attack", "date": "2024-07-30 19:15", "url": "https://www.aljazeera.com/news/2024/7/30/anxiety-resignation-in-beirut-as-residents-worry-about-an-israeli-attack", "domain": "aljazeera.com", "domain_classification": "International", "message": "People in Lebanese capital fearful of widespread conflict between Israel and Hezbollah following Golan Heights attack.\nWorking on her laptop in a cafe in Hamra, a bustling Beirut neighbourhood, the 27-year-old entrepreneur said she is coping with anxiety in anticipation of a possible large-scale Israeli attack on the city.\nIsrael has blamed the Golan Heights attack on Hezbollah, but the Lebanese armed group has denied responsibility.\nNow, with Israel threatening retribution for the Golan Heights deaths, those fears have exploded.\nIsrael said it had targeted a Hezbollah commander responsible for the Golan Heights attack.", "location": "Beirut", "classification": "security", "score": 0.9789119983512451, "event_breakdown": "Golan Heights\nHamra, Beirut"}, {"id": "6ec5457d-eee8-4ff6-be2d-fb8d9c617d7c", "title": "Dont bomb Beirut : US leads push to rein in Israel response", "date": "2024-07-30 08:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/07/501_379620.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "\"If they avoid civilians and they avoid Beirut and its suburbs, then their attack could be well calculated,\" he said.\nIsraeli officials have said that their country wants to hurt Hezbollah but not drag the region into all-out war.\nThe two Middle Eastern and European diplomats said Israel hadn't made any commitment to avoiding strikes on Beirut, its suburbs or civil infrastructure.\n\"Our support for Israel's security is ironclad and unwavering against all Iran-backed threats, including Hezbollah,\" a spokesperson told Reuters.\nFollowing the Golan attack, Smotrich had issued a strong statement demanding robust action.", "location": "BEIRUT", "classification": "security", "score": 0.474627250543, "event_breakdown": "Israeli army attacks Hezbollah\nHezbollah strikes back on Israeli army"}, {"id": "12dbda0f-a3d0-4729-b060-172293d7ef02", "title": "ByGone Muncie : 1910 terror attacks in Los Angeles have ties to Ebright Street in Muncie", "date": "2024-07-30 10:00", "url": "https://www.yahoo.com/news/bygone-muncie-1910-terror-attacks-090928553.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At precisely 1:07 a.m. Oct. 1, 1910, a massive explosion destroyed the Los Angeles Times Building at the corner of First and Broadway streets.\nThe Los Angeles Times building the morning after the bombing on Oct. 1, 1910.\nA day later, Los Angeles Mayor George Alexander hired private investigator William Burns to catch the perpetrators.\nDetective Burns also suspected that IW was behind the Los Angeles Times’ bombing.\nThey were later treated, cut up and sent to Los Angeles as evidence in the McNamaras’ trial.", "location": "LOS ANGELES", "classification": "security", "score": 0.9153370643798786, "event_breakdown": "Event 1: At precisely 1:07 a.m. on Oct. 1, 1910, a massive explosion destroyed the Los Angeles Times Building at the corner of First and Broadway streets.\nEvent 2: Los Angeles Mayor George Alexander hired private investigator William Burns to catch the perpetrators of the bombing of the Los Angeles Times building on Oct. 1, 1910."}, {"id": "5d930045-9366-4465-abec-0c91f1838292", "title": "Ukraine War : Russia Is  Intensifying  Donbas Offensive and Paying a Hefty Price", "date": "2024-07-30 17:30", "url": "https://nationalinterest.org/blog/buzz/ukraine-war-russia-intensifying-donbas-offensive-and-paying-hefty-price-212097", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The Russian military is intensifying its offensive in the Donbas, making steady advances despite heavy casualties.\nSummary and Key Points: The Russian military is intensifying its offensive in the Donbas, making steady advances despite heavy casualties.\nThe Ukraine War: Russia Steps Up Attacks in DonbasOver the past few weeks, the Russian forces have made some progress.\n“It is likely that Russia will continue to make tactical advances in the coming weeks.\nAs such, Moscow’s casualties both dictate and restrict the way the Russian military fights in Ukraine.", "location": "Donbas", "classification": "security", "score": 0.6385465259467883, "event_breakdown": "The Russian military is intensifying its offensive in the Donbas, making steady advances despite heavy casualties. The assaults come after Russia re-focused its war aims to seize the east."}, {"id": "e0592f47-9b7c-41f0-a573-93fad4048331", "title": "US University August 2024 Holiday List : Institutions will remain closed on these dates , check details here |", "date": "2024-07-30 15:45", "url": "https://timesofindia.indiatimes.com/education/news/us-university-august-2024-holiday-list-institutions-will-remain-closed-on-these-dates-check-details-here/articleshow/112129714.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "US University August 2024 Holiday List:US University August 2024 Holiday List: Days of significanceDateEventTypeSignificance1 AugColorado DayColorado (State specific)Celebrates the anniversary of Colorado's statehood, achieved on August 1, 1876.\n4 AugCoast Guard ObservanceDay of ObservanceHonors the founding of the United States Coast Guard on August 4, 1790.\n16 AugHawaii Statehood DayHawaii (State specific)Celebrates Hawaii's admission to the Union as the 50th state on August 21, 1959.\n26 AugSusan B. Anthony DayMassachusetts (State specific)Honors the birthday of Susan B. Anthony, a key figure in the women's suffrage movement.\n27 AugLyndon Baines Johnson DayTexas (State specific)Honors the birthday of Lyndon B. Johnson, the 36th President of the United States.", "location": "-\nThe location of the main event is Colorado.", "classification": "security", "score": 0.7158325316906927, "event_breakdown": "1. On February 24, 2022, Russia launched an invasion of Ukraine, targeting multiple cities across the country, including the capital, Kyiv. The invasion has resulted in numerous civilian casualties, extensive property damage, and a mass exodus of refugees. The conflict is ongoing, and the international community is closely monitoring the situation.\n2. In the recent months, the ongoing conflict in Ethiopia's Tigray region has resulted in a humanitarian crisis, with millions displaced from their homes and facing famine-like conditions. On February 26, 2022, the Ethiopian government declared a state of emergency, giving security forces sweeping powers to detain suspects and restrict freedom of movement. This comes after a series of clashes between government forces and Tigrayan forces.\n3. On March 2, 2022, a terrorist attack on a military hospital in Kabul, Afghanistan, killed dozens of people and injured dozens more. The attack is believed to have targeted military personnel and civilians. The incident highlights the ongoing security challenges in Afghanistan, as the Taliban have gained control over the country.\n4. On March 7, 2022, an outbreak of violence erupted in Cameroon's English-speaking regions, causing the deaths of at least five people. The unrest is part of an ongoing conflict that erupted in 2016, with separatists fighting for independence from the French-speaking majority. The conflict has led to widespread displacement and reports of human rights abuses.\n5. On March 12, 2022, an armed attack on a bus convoy in Kaduna state, Nigeria, killed at least four people and"}, {"id": "6b9b1b19-1791-45ca-87c7-8e4b74f796ab", "title": "  The ICC role in the lawfare of the Gaza flotilla dispute  by Gregory Rose , Matthijs de Blois et al . ", "date": "2024-07-30 12:30", "url": "https://ro.uow.edu.au/test2021/12315/", "domain": "ro.uow.edu.au", "domain_classification": "Unknown", "message": "The ICC role in the lawfare of the Gaza flotilla disputeAbstractOn May 31, 2010, during the Israeli-imposed naval blockade of Gaza, six vessels tried to break the so-called “siege of Gaza.” The Israeli IDF forces captured the vessels and brought them to the Port of Ashdod.\nThe Prosecutor of the International Criminal Court (ICC) was asked to investigate the incident.\nThe Marmara incident shows the interdependence of national and international government legal institutions, in cases concerning human rights.\nInternational legal instruments including international criminal proceedings are an example.\nOur objective in this chapter is to investigate whether the Marmara flotilla case can be seen as an example of lawfare against Israel.", "location": "GAZA STRIP", "classification": "security", "score": 0.5810973929315555, "event_breakdown": "1. On May 31, 2010, during the Israeli-imposed naval blockade of Gaza, six vessels tried to break the so-called “siege of Gaza”. The Israeli IDF forces captured the vessels and brought them to the Port of Ashdod.\n2. The Prosecutor of the International Criminal Court was asked to investigate the incident.\n3. The Marmara incident shows the interdependence of national and international government legal institutions, in cases concerning human rights.\n4. International legal instruments including international criminal proceedings are an example.\n5. Our objective in this chapter is to investigate whether the Marmara flotilla case can be seen as an example of lawfare against Israel."}, {"id": "04987772-2611-41dc-bd7b-1c32a4cb4f41", "title": "IDF 98th Division Dismantles 100 Kilometers of Gaza Terror Tunnels | The Jewish Press - JewishPress . com | Hana Levi Julian | 25 Tammuz 5784 – Tuesday , July 30 , 2024", "date": "2024-07-30 16:30", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/idfs-98th-division-dismantles-100-kilometers-of-gaza-terror-tunnels/2024/07/30/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF Spokesperson's UnitThe 98th Division of the Israel Defense Forces has dismantled more than 100 kilometers of subterranean Hamas terror tunnels in Gaza since the start of the war on October 7th.\nThe 98th Division recently completed its operations above and below ground in the southern Gaza area of Khan Younis.\nIsrael’s Air Force struck the terrorist Ibrahim Hegazi, responsible for anti-tank missiles in Hamas’ Nuseirat Battalion in central Gaza.\nHegazi planned and directed numerous terror attacks against IDF troops and served as a central source of knowledge on anti-tank missiles for Hamas.\nIsraeli forces are continuing to conduct targeted raids in central Gaza, eliminating terrorists, and dismantling terrorist infrastructure sites.", "location": "Gaza", "classification": "security", "score": 0.978705528628667, "event_breakdown": "Israeli forces are continuing to conduct targeted raids in central Gaza, eliminating terrorists, and dismantling terrorist infrastructure sites. The 98th Division dismantled more than 100 kilometers of subterranean terror tunnels in Gaza since the start of the war on October 7th. The 98th Division recently completed its operations above and below ground in the southern Gaza area of Khan Younis. Israeli forces struck the terrorist Ibrahim Hegazi, responsible for anti-tank missiles in Hamas' Nuseirat Battalion in central Gaza. Hegazi planned and directed numerous terror attacks against IDF troops and served as a central source of knowledge on anti-tank missiles for Hamas."}, {"id": "2b2bd9ce-5013-423e-b745-4aff9d151d34", "title": "Dr . Alon Liel : Erdogan will send Turkish forces if Israel enters Lebanon - Israel News", "date": "2024-07-30 10:00", "url": "https://www.jpost.com/israel-news/article-812481", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "\"He is hinting that he may try to increase military assistance to help the Palestinians in their fight, both Hamas and those fighting in the West Bank,\" Dr. Liel told Gadi Ness.\nIt is unlikely that Erdogan, who is known to act irrationally, would send Turkish soldiers to invade Israel.\nIndirect support of anti-Israel forces\"In my opinion, what he will try to do is strengthen the forces fighting against us either through sending money or smuggling across the Egyptian border.\nDr. Liel also claimed: \"If something significant happens in Lebanon, Erdogan sees any Israeli entry into Lebanon as halfway towards him.\nHe could send forces to Lebanon; he has done this in the past, including sending destroyers and combat ships, to Lebanon's territorial waters.\"", "location": "Israel", "classification": "security", "score": 0.8666035519572601, "event_breakdown": "Indirect support of anti-Israel forces,\nHamas and other forces in the West Bank"}, {"id": "dc4b590f-8173-42ef-ac53-334c62c7b7aa", "title": "Israel restocks $190m mortar munitions amidst continuing conflict", "date": "2024-07-30 19:15", "url": "https://www.army-technology.com/news/israel-restocks-190m-mortar-munitions-amidst-continuing-conflict/", "domain": "army-technology.com", "domain_classification": "Unknown", "message": "Elbit Systems has secured a contract to supply precision-guided mortar munitions to the Israeli Ministry of Defense.\nSource: Elbit SystemsIn a recent development, Elbit Systems Ltd. has been awarded a $190m (NIS710.6m) contract to supply Iron Sting guided mortar munitions to the Israeli Ministry of Defense.\nYehuda (Udi) Vered, General Manager of Elbit Systems Land, defended the contract, emphasising the importance of precision-guided technology in modern warfare.\nElbit Systems’ Iron Sting meets this critical need.”How well do you really know your competitors?\nIn May 2023, Elbit Systems secured a €20m (NIS80m) contract with Montenegro to supply 120mm mortar munitions and train its military personnel.", "location": "Israel", "classification": "security", "score": 0.8779953691475201, "event_breakdown": "Elbit Systems awarded $190m contract to supply precision-guided mortar munitions to Israeli Ministry of Defense.\nBaykan Industrial Zone - How P1, which is south of Akyazi district of Sakarya city close to Istanbul highway, will host the Iron Sting factory."}, {"id": "3a910d1f-d0d1-44a1-aed5-18030c38851c", "title": "Putin Wagner Group mercenaries got thrashed in the African desert and Ukraine says it helped", "date": "2024-07-30 12:15", "url": "https://news.yahoo.com/news/putins-wagner-group-mercenaries-got-112054904.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Putin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedPutin's Wagner Group mercenaries got thrashed in the African desert — and Ukraine says it helpedUkraine says it aided rebels in Mali to defeat Russian Wagner Group mercenaries.\nUkraine's defense intelligence claimed a role in a recent battle in Africa — where separatist rebels destroyed a detachment of Russian Wagner Group mercenaries fighting overseas.\nThe paper published a photograph of Malian separatist forces holding up a Ukrainian flag, an apparent expression of solidarity with the country.\nThe separatist group that claimed responsibility for the attack is the Permanent Strategic Framework for Peace, Security and Development, or CSP-PSD, the BBC reported.\nThe CSP-PSD opposes Mali's junta, which has been propped up by the Wagner Group for several years.", "location": "The location of the event in the question is Mali.", "classification": "security", "score": 0.8116182718462358, "event_breakdown": "Location: Mali\nEvent: Ukrainian separatists allied with Mali destroyed a detachment of Russian Wagner Group mercenaries fighting overseas."}, {"id": "8b455767-ac60-4c7a-879e-e1c73a1e3c5c", "title": "Vance , unlike many GOP war veterans , is a leading voice against military intervention", "date": "2024-07-30 00:15", "url": "https://www.kwbu.org/latest-from-npr/2024-07-29/vance-unlike-many-gop-war-veterans-is-a-leading-voice-against-military-intervention", "domain": "kwbu.org", "domain_classification": "Unknown", "message": "LEILA FADEL, HOST:Republican vice presidential nominee JD Vance served in the U.S. Marine Corps.\nAnd unlike many Republican war veterans in the past, Vance is now a leading voice against U.S. military intervention abroad or even military aid to Ukraine.\nLAWRENCE: But JD Vance, who served in Iraq with Marine Corps Public Affairs, took a different lesson.\nIn fact, some who feel disillusioned by their service in Iraq, just like JD Vance, come to an opposite conclusion.\nLAWRENCE: But Gallagher co-founded American Veterans for Ukraine.", "location": "Iraq", "classification": "security", "score": 0.5095588985553786, "event_breakdown": "Location: Ukraine\nEvent: U.S. Marine veterans advocating for military aid to Ukraine\nDescription: Some U.S. Marine veterans, such as J.D. Vance, who served in Iraq, have come to the opposite conclusion, advocating for more military aid to Ukraine."}]