[{"id": "1938c99f-ce57-4149-94a2-06cc1710d6d4", "title": "Iran Defense Minister : West behind terror attacks in Russia , Iran", "date": "2024-04-29 22:00", "url": "https://www.jpost.com/israel-hamas-war/article-799117", "message": "Iranian Defense Minister Mohammad Reza Ashtiani said that terrorist attacks in Iran and Russia recently \"are the result of the support of Western countries, especially the United States, to terrorist groups,\" the Iranian government's semi-official Mehr News Agency reported last Saturday.\nWhile the article did not reveal which terror groups were being referenced by Ashtiani, both Russia and Iran have been the target of attacks by ISIS in recent months.\nSimilarly, in January, ISIS orchestrated an explosion in Kerman, Iran, which killed close to 100 people.\nSmoke rises above the burning Crocus City Hall concert venue following a reported shooting incident, outside Moscow, Russia, March 22, 2024.\nWhile Israel has not publicly admitted to have orchestrated the strike, an anonymous Israeli official told Reuters that those eliminated had \"been behind many attacks on Israeli and American assets and had plans for additional attacks.\"", "location": "Moscow, Russia", "classification": "security", "score": 0.7431922073966853, "event_breakdown": "- Iranian Defense Minister Mohammad Reza Ashtiani accuses Western countries, especially the United States, of supporting terrorist groups in Iran and Russia\n- ISIS orchestrated an explosion in Kerman, Iran, killing close to 100 people\n- Smoke rises above Crocus City Hall concert venue after a reported shooting incident outside Moscow, Russia\n\n(Note: The events related to the accusations by the Iranian Defense Minister and the ISIS attack in Iran are considered as a single event due to their interconnected nature.)"}, {"id": "4e846701-3517-48b1-bd37-da0f11eecd4a", "title": "Nato chief chides members as Ukraine allies say slow arms deliveries have helped Russia", "date": "2024-04-29 22:15", "url": "https://www.scmp.com/news/world/europe/article/3260842/nato-chief-chides-members-ukraines-allies-say-slow-arms-deliveries-have-helped-russia", "message": "Outgunned, Ukraine’s troops have struggled to fend off Russian advances on the battlefield.\n“Serious delays in support have meant serious consequences on the battlefield” for Ukraine, Nato Secretary General Jens Stoltenberg told a news conference in Kyiv with Ukrainian President Volodymyr Zelensky.\nDrawn-out Ukrainian efforts to mobilise more troops, and the belated building of battlefield fortifications, are other factors undermining Ukraine’s war effort, military analysts say.\nThe Russian military is in a better position at the moment.\n“Russian forces remain unlikely to achieve a deeper operationally significant penetration in the area in the near term,” the Institute for the Study of War said in an assessment Sunday.", "location": "Kyiv", "classification": "world", "score": 0.5866176253955832, "event_breakdown": "- Ukrainian troops struggle to fend off Russian advances on the battlefield\n- Nato Secretary General Jens Stoltenberg expresses concern over delays in support for Ukraine\n- Ukrainian efforts to mobilise more troops and build battlefield fortifications are hampered\n- Russian military is in a better position currently\n- The Institute for the Study of War assesses that Russian forces are unlikely to achieve deeper penetration in the near term"}, {"id": "467c5411-26aa-4c1e-8a20-d4fbdb63c686", "title": "Ukraine updates : Russia strikes Odesa for 2nd time this week – DW – 05 / 01 / 2024", "date": "2024-05-01 02:00", "url": "https://www.dw.com/en/ukraine-updates-russia-strikes-odesa-for-2nd-time-this-week/a-68967110", "message": "Russia has pummeled the vital port city of Odesa, stepping up aerial attacks that have also damaged civilian infrastructure there, according to Ukrainian officials.\nAt least three people were killed and three more injured in a Russian missile strike on the Ukrainian city of Odesa in the early hours of Wednesday morning, local authorities said.\nAs a consequence of the attack, three people were killed and three more wounded,\" wrote Gennadiy Trukhanov, the mayor of the southwestern port city, on Telegram.\nThe attack comes just two days after Russian missiles struck an educational institution in the city, killing five people.\nAccording to Shmyhal, Ukraine had previously earmarked 43.3 billion hryvnia for the purchase of drones this year.", "location": "Odesa, Ukraine.", "classification": "security", "score": 0.8820837055918667, "event_breakdown": "1. Russian missile strike on the Ukrainian city of Odesa\n2. Damage to civilian infrastructure in Odesa due to aerial attacks\n- Russia pummeled the port city of Odesa, increasing aerial attacks and damaging civilian infrastructure\n- Three people were killed and three more injured in a Russian missile strike on Odesa\n- The mayor of Odesa confirmed the casualties on Telegram\n- Russian missiles struck an educational institution in Odesa two days before, killing five people\n- Ukraine had allocated 43.3 billion hryvnia for the purchase of drones this year"}, {"id": "cb2b56bc-a0ce-4689-8dc6-33d8fb150d04", "title": "Israel Strikes Hamas Rocket Launchers , Tunnel Shafts , Hezbollah Infrastructure | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 22 Nisan 5784 – Tuesday , April 30 , 2024", "date": "2024-04-30 09:00", "url": "https://www.jewishpress.com/news/israel/idf/israel-strikes-hamas-rocket-launchers-tunnel-shafts-hezbollah-infrastructure/2024/04/30/", "message": "Photo Credit: IDFIsraeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post and Hamas terror infrastructure in northern and central Gaza, the Israel Defense Forces said on Tuesday morning.\nShortly afterward, fighter jets struck operational tunnel shafts, an anti-tank missile launch post and terror infrastructure in the area of northern Gaza from which the launch was identified.\nTroops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\nFighter jets struck the structure, eliminating the terrorist.\nAlso, fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon.", "location": "Gaza", "classification": "security", "score": 0.9506154745941572, "event_breakdown": "- Israeli fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and Hamas terror infrastructure in northern and central Gaza.\n- Fighter jets struck operational tunnel shafts, an anti-tank missile launch post, and terror infrastructure in the area of northern Gaza from which the launch was identified.\n- Troops identified numerous terrorists at the location from which the launches were fired, and fighter jets struck and eliminated the terrorists.\n- Fighter jets struck the structure, eliminating the terrorist.\n- Fighter jets struck Hezbollah terrorist infrastructure in the areas of Kfarkela and Khiam in southern Lebanon."}, {"id": "c215a7df-3da7-43cc-a68b-e4dad01d8b28", "title": "Somalia : Somali Government Condemns Killing of Hormuud Telecom Workers", "date": "2024-04-29 19:15", "url": "https://allafrica.com/stories/202404290388.html", "message": "Mogadishu, Somalia — In a shocking and tragic turn of events, six employees of Hormuud Telecom, Somalia's largest telecommunications company, lost their lives in a roadside blast on the outskirts of Mogadishu, the country's capital on Sunday afternoon.\nThe government described the attack as a deliberate targeting, which is part of a series of attacks against commercial companies in Somalia.\nThis recent incident follows a pattern of targeted violence against Hormuud Telecom, with previous explosions destroying company branches and vehicles in Mogadishu and beyond.\nTheir loss has been deeply felt by the company and the broader community, with Hormuud Telecom expressing its deepest condolences to the families and friends of the victims.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones.", "location": "Mogadishu, Somalia.", "classification": "security", "score": 0.5268761109185044, "event_breakdown": "- Roadside blast near Mogadishu, Somalia\n- Six employees of Hormuud Telecom killed\n- Attack described as deliberate targeting\n- Part of series of attacks against commercial companies\n- Previous explosions targeted Hormuud Telecom branches and vehicles\n- Loss deeply felt by company and community\n- Hormuud Telecom expresses condolences to victims' families and friends\n- Investigation ongoing"}, {"id": "2ef45c73-5050-4d60-93cc-f3d5afa1ee11", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 22:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza (CNN) — Editor’s Note: Warning: This story has graphic content.\nTwenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.", "location": "Rafah, Gaza.", "classification": "security", "score": 0.9537699385755353, "event_breakdown": "1. Israeli airstrike kills 22 people, including an infant and a toddler, in Rafah, Gaza.\n2. Mahmoud Abu Taha holds up the body of a baby boy, lamenting the targeting of civilians.\n3. Ten members of the Abu Taha family are among those killed, with some previously displaced from Khan Younis due to another airstrike."}, {"id": "8a06ab69-bb7e-4588-8c31-e63cc617c8a3", "title": "Sydney church stabbing : Teen alleged terrorism texts , claims he wanted to  kill non believers  ", "date": "2024-04-30 10:30", "url": "https://www.nzherald.co.nz/world/sydney-church-stabbing-teens-alleged-terrorism-texts-claims-he-wanted-to-kill-non-believers/OUECF7DEZNDHHKQVO2BCBQEPDU/", "message": "A 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.\nA 16-year-old boy charged with terrorism offences following the Sydney church stabbing allegedly sent text messages declaring he was “going to kill non-believers” before the attack was carried out by an alleged associate.\nHis alleged attacker was charged with terrorism offences, while four others, believed to be associates, were arrested following widespread search warrants.\nA 16-year-old boy charged with terrorism offences in connection with the Sydney church stabbing allegedly declared he was “going to kill” in messages about carrying out a plan against non-believers.", "location": "Sydney", "classification": "security", "score": 0.4260738952908896, "event_breakdown": "- Sydney church stabbing\n- Alleged attacker charged with terrorism offences\n- Four associates arrested following search warrants"}, {"id": "06527eb7-3033-4d52-afd0-e912b5d06f3e", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 08:30", "url": "https://www.thestar.com.my/news/world/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraine039s-odesa", "message": "ODESA, Ukraine (Reuters) -A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\n\"In front of my eyes, a missile was shot down, this was just in front of me.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA, Ukraine", "classification": "security", "score": 0.47245463261582726, "event_breakdown": "- A Russian missile attack on an educational institution in Odesa, Ukraine\n- The attack killed at least five people and injured 32\n- The targeted building was a private law academy in a popular seafront park\n- The attack caused extensive damage to the roof of the building\n- Odesa Mayor Hennadii Trukhanov expressed shock at the incident\n- Odesa has been experiencing frequent Russian missile and drone attacks, especially targeting port infrastructure"}, {"id": "e87f2bad-2580-477a-9105-23b383881747", "title": "Missile attack by Yemen Houthi rebels damages a ship in Red Sea", "date": "2024-05-01 06:15", "url": "https://www.sunstar.com.ph/network/missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-red-sea", "message": "JERUSALEM -- A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, April 29, 2024, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Bab el-Mandeb Strait", "classification": "security", "score": 0.5488933144612118, "event_breakdown": "- Missile attack by Yemen's Houthi rebels in the Red Sea on a ship (April 29, 2024)\n- Italian frigate Virgino Fasan shooting down a Houthi drone near Bab el-Mandeb Strait (April 29, 2024)\n- US military shooting down five drones over the Red Sea (April 28, 2024)"}, {"id": "a95b7c08-d8a8-4c4c-a97c-5ca9acd1d7f4", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 07:00", "url": "https://www.theweek.in/wire-updates/international/2024/04/30/fgn15-mideast-tensions.html", "message": "Jerusalem, Apr 30 (AP) A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5068969617636545, "event_breakdown": "1. Missile attack by Yemen's Houthi rebels damages ship in the Red Sea.\n   Location: Red Sea\n2. Italian frigate Virgino Fasan shoots down Houthi drone near the Bab el-Mandeb Strait.\n   Location: Near Bab el-Mandeb Strait\n3. US military shoots down five drones over the Red Sea.\n   Location: Red Sea"}, {"id": "1de6c548-f4f6-4aba-9070-3246a3620df7", "title": "Wakeley church stabbing : Teens allegedly discussed bombs , guns in group chats", "date": "2024-04-30 07:30", "url": "https://www.brisbanetimes.com.au/national/nsw/we-re-gonna-kill-teens-allegedly-discussed-bombs-guns-in-groups-chats-20240430-p5fnrv.html", "message": "A group of teenagers discussed carrying out a terrorism attack and a desire to kill before they were arrested in anti-terrorism raids last Wednesday, a court has heard.\nThe conversations took place in group chats after the alleged stabbing of Bishop Mar Mari Emmanuel during a live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15.\nThe father of a teenager accused of stabbing a priest in a Wakeley church leaves Parramatta Children’s Court.\nCredit: Janie BarrettNine days later, anti-terrorism police raided a dozen south-west suburbs and have arrested six young people, including a 16-year-old boy, who was charged with conspiring to prepare or plan for a terrorist act.\nThat 16-year-old has been in custody since his arrest a week ago and was refused bail at Parramatta Local Court on Tuesday by Magistrate Janet Wahlquist.", "location": "Wakeley", "classification": "world", "score": 0.4096534934535242, "event_breakdown": "1. Group of teenagers discuss carrying out terrorism attack and desire to kill in group chats\n2. Alleged stabbing of Bishop Mar Mari Emmanuel during live-streamed service at Christ the Good Shepherd Church in Wakeley on April 15\n3. Father of teenager accused of stabbing a priest leaves Parramatta Children’s Court\n4. Anti-terrorism police raid a dozen south-west suburbs and arrest six young people, including a 16-year-old boy charged with conspiring to prepare or plan for a terrorist act\n5. 16-year-old suspect remains in custody since arrest and is refused bail at Parramatta Local Court by Magistrate Janet Wahlquist"}, {"id": "e4bab925-c0f2-462f-a021-1bf47d50ea04", "title": "World News : Russian missile hits educational institution , kills five in Ukraine Odesa", "date": "2024-04-30 12:45", "url": "http://www.gdnonline.com/Details/1311004", "message": "ODESA, Ukraine - A Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don't know what else to say,\" Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy's president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "ODESA, Ukraine", "classification": "world", "score": 0.451879256815849, "event_breakdown": "- Russian missile attack on an educational institution in Odesa, Ukraine\n- Attack killed at least five people and injured 32\n- The targeted building was a private law academy\n- The academy's president, Serhiy Kivalov, was among the injured\n- Odesa Mayor Hennadii Trukhanov expressed shock at the attack\n- Odesa has been a frequent target of Russian missile and drone attacks on port infrastructure"}, {"id": "010c5eb0-2c0b-45b6-ad5e-42ba832a4309", "title": "Likely missile attack by Yemen Houthi rebels targets a ship in the Red Sea", "date": "2024-04-29 15:00", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-container-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5457119768814919, "event_breakdown": "- Missile attack by Yemen's Houthi rebels in the Red Sea damaging a ship\n- Italian frigate Virgino Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "369983bd-2459-4318-90c9-7a93a0be6095", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-29 17:15", "url": "https://www.startribune.com/likely-missile-attack-by-yemens-houthi-rebels-targets-a-ship-in-the-red-sea/600362372/", "message": "JERUSALEM — A missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n''The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.''\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5457119768814919, "event_breakdown": "- Missile attack by Yemen's Houthi rebels on a ship in the Red Sea (Monday)\n- Italian frigate Virgino Fasan shooting down a Houthi drone near Bab el-Mandeb Strait (Monday)\n- US military shooting down five drones over the Red Sea (Sunday)"}, {"id": "8358c509-e2d4-456c-aecb-54b07d27453b", "title": "Houthi rebels attack two US destroyers in Red Sea with devastating drone strike | World | News", "date": "2024-04-29 23:00", "url": "https://www.express.co.uk/news/world/1893826/houthi-rebel-attack-us-destroyer-red-sea-war", "message": "Houthi rebels in Yemen have attacked two US destroyers and two vessels in the Red Sea with drone strikes.\nMonday's attack happened off the coast of Mokha, Yemen, the British military’s United Kingdom Maritime Trade Operations center said.\nThe ship sustained damage in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nThe agency urged vessels to exercise caution in the area.\n“Vessel and crew are reported safe.”The Houthis did not immediately acknowledge any attack, though suspicion fell on the group.", "location": "Mokha, Yemen", "classification": "security", "score": 0.8422909504198774, "event_breakdown": "- Houthi rebels attack two US destroyers and two vessels in the Red Sea with drone strikes\n- Attack occurs off the coast of Mokha, Yemen\n- UKMTO confirms the ship sustained damage in the attack but the crew is safe\n- UKMTO urges vessels to exercise caution in the area"}, {"id": "f88ec86f-2e05-40c7-80db-02081f9e0345", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:30", "url": "https://www.nbcconnecticut.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/3278469/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "ODESA", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- A day of mourning declared in Odesa after a Russian missile strike kills five and injures 32\n- Russia claims to have shot down six U.S.-supplied ATACMS missiles\n- Uncertain number of ATACMS missiles given to Ukraine\n- Warning issued for undetonated submunitions scattered after ATACMS missiles shot down\n- ATACMS used to strike targets in Russian-occupied territory"}, {"id": "7dca4ec4-e902-4b0c-8fb1-5e93409379be", "title": "Missile attack by Yemen Houthi rebels damages a ship in the Red Sea | World News", "date": "2024-04-30 08:30", "url": "https://indianexpress.com/article/world/missile-attack-yemen-houthi-rebels-damage-ship-red-sea-9298509/", "message": "A missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against shipping in the crucial maritime route.\nThe ship was damaged in the attack, the UKMTO said, though its crew was safe and heading to its next port of call.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the US military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.46026327135311396, "event_breakdown": "-  Missile attack by Yemen's Houthi rebels damages a ship in the Red Sea\n- UKMTO confirms the ship was damaged in the attack but crew is safe and heading to the next port\n- Italian frigate Virgino Fasan shoots down a Houthi drone near Bab el-Mandeb Strait\n- Shipping in the Red Sea and Gulf of Aden declines due to the threat\n- US military shoots down five drones over the Red Sea"}, {"id": "21860b05-a693-43fa-b5f8-df9ce9be3bd2", "title": "Three killed as Russia attacks Odesa with ballistic missiles for the second day in a row", "date": "2024-05-01 09:30", "url": "https://www.yahoo.com/news/three-killed-russia-attacks-odesa-081400948.html", "message": "Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30, Odesa Governor Oleh Kiper said.\n\"Three people died in Odesa,” said Presidential Office head, Andriy Yermak, on the morning of May 1.\n“Ballistic missiles hit a large, peaceful city at night.\nResidential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered, Odesa Mayor Hennadyi Trukhanov reported at 2:45 a.m. EET.\n\"Russia is launching ballistic missiles against us for the second day in a row.”He urged civilians to pay attention to air raid alarms and stay in shelters.", "location": "Odesa", "classification": "security", "score": 0.9820033226101117, "event_breakdown": "- Shattered widows in one of the residential buildings after Russian strike late in the evening on April 30\n- Three people were killed and three others injured after Russia attacked Odesa with ballistic missiles on the evening of April 30\n- Residential buildings were damaged as a result of the enemy's night attack - windows and doors were shattered"}, {"id": "0a4b0608-9ebe-402c-8c7c-02a09d0988c1", "title": "Russian missile kills three in Ukrainian port of Odesa", "date": "2024-05-01 00:45", "url": "https://www.devdiscourse.com/article/law-order/2923457-russian-missile-kills-three-in-ukrainian-port-of-odesa", "message": "A Russian missile attack killed three people and injured three others in the Ukrainian port of Odesa early on Wednesday, regional Governor Oleh Kiper said.\nHe said the strike was carried out by a ballistic missile, but provided no further details.\nKiper and Odesa Mayor Hennadii Trukhanov had reported a series of loud explosions.\nOn Monday, a Russian missile struck an educational institution in the city, killing five people.\nOdesa has been a frequent target of Russian forces in the more than two-year-old war, with many attacks aimed at the city's port facilities.", "location": "ODESA", "classification": "security", "score": 0.9427670113474113, "event_breakdown": "- Russian missile attack kills three and injures three in Odesa, Ukraine (Wednesday)\n- Previous Russian missile strike on an educational institution in Odesa kills five people (Monday)"}, {"id": "40c8e489-9e7b-4439-89d1-9df06e81c9d1", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.foxnews.com/world/likely-missile-attack-yemens-houthi-rebels-damages-ship-red-sea", "message": "A suspected missile attack by Yemen's Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defense Ministry said its frigate Virgino Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\n\"The frigate Fasan and the protected merchant vessel are continuing their southward route as planned to exit the Red Sea.\"\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Red Sea", "classification": "security", "score": 0.5358856195628724, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damaging a ship in the Red Sea\n- Italian frigate Virgino Fasan shooting down a Houthi drone near the Bab el-Mandeb Strait\n- Decline in shipping through the Red Sea and Gulf of Aden due to the threat\n- U.S. military shooting down five drones in the air over the Red Sea"}, {"id": "70519a93-782c-4e31-81f7-e268d1561d0e", "title": "Likely missile attack by Yemen Houthi rebels damages a ship in the Red Sea", "date": "2024-04-30 02:00", "url": "https://www.nola.com/ap/business/likely-missile-attack-by-yemens-houthi-rebels-damages-a-ship-in-the-red-sea/article_428d0b4e-4be8-5026-992d-ae8f7ea21c23.html", "message": "Likely missile attack by Yemen's Houthi rebels damages a ship in the Red SeaA suspected missile attack by Yemen’s Houthi rebels targeted a ship in the Red Sea, the latest assault in their campaign against international shipping in the crucial maritime route", "location": "Red Sea", "classification": "security", "score": 0.9414326694106652, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels targeting a ship in the Red Sea"}, {"id": "117097a7-0de3-4730-b534-8fb245d6b1c8", "title": "Ukraine war live updates : Odesa reels from deadly missile attack ; 98 - year - old walks miles under fire to escape advancing Russians", "date": "2024-04-30 08:15", "url": "https://www.nbcnewyork.com/news/business/money-report/ukraine-war-live-updates-odesa-mourns-after-deadly-missile-attack-98-year-old-walks-miles-under-fire-to-escape-advancing-russians/5366762/", "message": "A day of mourning has been declared in the Ukrainian port city of Odesa after a Russian missile strike killed five people and left 32 other injured.\n— Sam MeredithRussia says it shot down U.S.-supplied ATACMS missilesRussia said it shot down six U.S.-supplied long-range missiles, known as Army Tactical Missile Systems, or ATACMS, over the past day.\nIt's uncertain how many ATACMS missiles Ukraine was given.\n\"After the ATACMS missiles were shot down, the undetonated submunitions scattered,\" he said, warning civilians not to touch or approach any unspent submunitions.\nThe U.S.-provided Army Tactical Missile System, known as ATACMS, has since been used to strikes targets in Russian-occupied territory.", "location": "ODESA", "classification": "security", "score": 0.8955169745647708, "event_breakdown": "- Russian missile strike kills five and injures 32 in Odesa, Ukraine.\n- Russia claims to have shot down six U.S.-supplied ATACMS missiles."}, {"id": "145d37b8-d143-47c2-910d-80d481a8bbef", "title": "  My whole family has perished : 22 killed in Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-30 14:30", "url": "https://www.egyptindependent.com/my-whole-family-has-perished-22-killed-in-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Rafah, Gaza CNN —Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAbed Rahim Khatib/Anadolu/Getty ImagesAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8828711026621543, "event_breakdown": "- Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza.\n- Mahmoud Abu Taha lifts the baby boy's body to the camera, crying out that they are targeting innocent civilians.\n- Another member of the Abu Taha family reveals that 10 relatives were killed in the airstrike.\n- Some of the deceased relatives had previously been displaced from Khan Younis due to another Israeli airstrike.\n- The remaining family members who fled Khan Younis for safety in Rafah have now been killed in the overnight airstrike."}, {"id": "d92e6fe1-c0a8-4b49-9405-908d6d17ed70", "title": "Who is Lebanon Jamaa Islamiya , latest to parade weapons against Israel ? ", "date": "2024-04-29 15:30", "url": "https://www.al-monitor.com/originals/2024/04/who-lebanons-jamaa-islamiya-latest-parade-weapons-against-israel", "message": "Members of al-Jamaa al-Islamiya held a funeral procession Sunday in the town of Bebnine for two of the group's fighters.\nDozens of masked and armed men were seen walking the town's streets, brandishing their weapons and firing in the air.\nAl-Jamaa al-Islamiya is a Sunni Islamist political group founded in 1964 as the Lebanese branch of the Muslim Brotherhood.\nIbrahim Mneime, another independent lawmaker, said al-Jamaa al-Islamiya bears responsibility for the “military demonstration” and the fall of the wounded in Akkar.\nThe Israeli military told Agence France Presse that 20 rockets were launched toward Israel from Lebanon and that most of the projectiles were intercepted.", "location": "Bebnine", "classification": "security", "score": 0.9917194677910949, "event_breakdown": "- Members of al-Jamaa al-Islamiya held a funeral procession in Bebnine for two fighters.\n- Dozens of masked and armed men were seen in the streets of Bebnine, brandishing weapons and firing in the air.\n- Al-Jamaa al-Islamiya is a Sunni Islamist political group founded in 1964 as the Lebanese branch of the Muslim Brotherhood.\n- Ibrahim Mneime stated that al-Jamaa al-Islamiya is responsible for the military demonstration and casualties in Akkar.\n- The Israeli military reported that 20 rockets were launched from Lebanon towards Israel, with most of them intercepted."}, {"id": "f4c3a2aa-418f-411b-afb9-e72a9a8aeb73", "title": "Ukraine war briefing : Russia making gains from slow western aid , says Nato chief", "date": "2024-04-30 01:15", "url": "https://www.theguardian.com/world/2024/apr/30/ukraine-war-briefing-russia-making-gains-from-slow-western-aid-says-nato-chief", "message": "Ukrainian navy spokesperson Dmytro Pletenchuk said the strike was conducted by an Iskander-M ballistic missile with a cluster warhead.\nA Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday, according to local officials.\nUkraine’s allies have accused North Korea of transferring weapons to Russia for use against Ukraine in violation of an arms embargo.\nThe US has accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions.\nRussia in March vetoed the renewal of sanctions monitoring against North Korea’s nuclear and ballistic missile programmes.", "location": "Kharkiv", "classification": "security", "score": 0.667125687365189, "event_breakdown": "- A Russian strike killed at least two people and injured six more in the north-eastern Ukrainian city of Kharkiv on Tuesday\n- Ukraine navy spokesperson stated that the strike was carried out by an Iskander-M ballistic missile with a cluster warhead\n- Ukraine's allies accused North Korea of transferring weapons to Russia for use against Ukraine, violating an arms embargo\n- The US accused Russia of launching North Korean-supplied ballistic missiles against Ukraine on at least nine occasions\n- In March, Russia vetoed the renewal of sanctions monitoring against North Korea's nuclear and ballistic missile programs"}, {"id": "80715aa6-a53c-43ad-bc62-11db192e3804", "title": "  My whole family has perished : 20 dead after Israeli airstrike on Rafah , hospital staff say", "date": "2024-04-29 17:00", "url": "https://abc17news.com/news/national-world/cnn-world/2024/04/29/my-whole-family-has-perished-20-dead-after-israeli-airstrike-on-rafah-hospital-staff-say/", "message": "Twenty-two people, including at least one infant and a toddler, have been killed in an Israeli airstrike over Rafah, Gaza, overnight into Monday, according to hospital officials.\nLifting the baby boy’s body to the camera, Mahmoud Abu Taha cries out, “this is who they are targeting.\nAnother member of the Abu Taha family says in the video that 10 of his relatives were killed in the airstrike.\nSome of his relatives were originally displaced from Khan Younis, where several of them were killed in a previous Israeli airstrike.\nThe remaining few who had fled Khan Younis for the safety of Rafah have now been killed overnight in Rafah, he says.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8657975260247653, "event_breakdown": "- Israeli airstrike over Rafah, Gaza results in the death of 22 people, including an infant and a toddler\n- Mahmoud Abu Taha displays the body of a baby boy, lamenting the targeting of civilians\n- A member of the Abu Taha family reports that 10 relatives were killed in the airstrike\n- The affected relatives had previously been displaced from Khan Younis due to a previous Israeli airstrike\n- The remaining few who fled Khan Younis for the safety of Rafah have now been killed in the overnight airstrike"}, {"id": "32b29b15-e707-45dd-a946-2c9365a53b87", "title": "Joining Forces Against Terrorism : Japan New Law Commits More ThanWords to U . S . Effort", "date": "2024-04-29 23:00", "url": "https://www.heritage.org/homeland-security/report/joining-forces-against-terrorism-japans-new-law-commits-more-thanwords-us", "message": "By moving beyond the country's prior policy of non-involvement, the law will allow Japan's self-defense forces (SDF) to support the efforts of the U.S. forces in Afghanistan.\nFor Japan, this new approach means the Diet must amend the laws governing the self-defense forces and the Maritime Safety Agency.\nTherefore, the Administration should support Japan through active diplomacy around the Asia-Pacific region and through its own \"proactive\" public diplomacy program.\nFinally, when Japan's self-defense forces do deploy, they should be fully integrated into the defense architecture in regions where the war on terrorism is being waged.\nBy passing the anti-terrorism law, permitting Japan's self-defense forces to deploy to the Persian Gulf, the Diet has greatly aided Prime Minister Koizumi's effort to develop a new consensus in Japan on collective self-defense.", "location": "Persian Gulf", "classification": "world", "score": 0.5358802420418237, "event_breakdown": "- The law allows Japan's self-defense forces (SDF) to support U.S. forces in Afghanistan.\n- Japan's Diet must amend laws governing the SDF and Maritime Safety Agency due to the new approach.\n- The Administration should offer support to Japan through active diplomacy in the Asia-Pacific region and a \"proactive\" public diplomacy program.\n- Japan's self-defense forces should be fully integrated into defense architecture in regions where the war on terrorism is ongoing.\n- The passing of the anti-terrorism law enables Japan's SDF to deploy to the Persian Gulf, aiding Prime Minister Koizumi's effort to establish a new consensus on collective self-defense in Japan."}, {"id": "b3a9d2c0-5d39-4fc4-a72e-d532d0e31110", "title": "Russian Strike On Odesa Hits  Harry Potter Castle , 5 Killed", "date": "2024-04-30 14:15", "url": "https://www.rferl.org/a/ukraine-russia-harry-potter-castle/32927804.html", "message": "The demonstration was the latest in a series of mass protests over the past two weeks against the legislation put forward by the ruling Georgian Dream party.\nThe demonstration came a day after Georgian Dream staged a large counterdemonstration outside the parliament building in support of the bill, ferrying in people from all over the country.\nWATCH: Thousands of Georgians demonstrated in rival pro- and anti-government rallies as parliament resumed discussions of the so-called \"foreign agents\" bill.\nIn a statement announcing the fresh protest, some 20 NGOs said that \"by adopting the Russian law,\" Ivanishvili and Georgian Dream \"are planning repression against the people...election-rigging, censorship, and a Soviet-style totalitarian regime.\"\nGeorgian Dream introduced the legislation last year but was forced to withdraw it following mass protests.", "location": "Tbilisi, Georgia.", "classification": "world", "score": 0.41391076257311776, "event_breakdown": "- Mass protests against legislation by ruling Georgian Dream party\n- Large counterdemonstration in support of the bill by Georgian Dream\n- Rival pro- and anti-government rallies during parliament discussions of the \"foreign agents\" bill\n- Announcement of fresh protest by 20 NGOs against adoption of the Russian law by Georgian Dream\n- Georgian Dream's introduction of legislation, withdrawal following mass protests"}, {"id": "6041aeca-43de-40ca-8518-2eb034e90743", "title": "Middle East Totters on the Edge of a Cliff as two Arch enemies Confront Each Other", "date": "2024-04-30 22:00", "url": "https://thenorthlines.com/middle-east-totters-on-the-edge-of-a-cliff-as-two-arch-enemies-confront-each-other/", "message": "Syria movesto the centre stageof conflict betweenIsrael and IranBy James M DorseyMultiple overt and covert wars have pushed the Middle East to the edge of a cliff.\nIncreased tension between Iran and Israel complicates efforts to pull the Middle East back from the abyss.\nWith the two archenemies walking a fine line between waging covert or overt war, escalation between Israel and Iran has the greatest potential to push the Middle East off the cliff.\nThe US and Israeli denials followed a series of tit-for-tat attacks that threatened to suck Israel, Iran, and potentially the United States into an all-out Middle East war.\nThe Gaza war moved Syria centrestage in the covert Israeli-Iranian confrontation.", "location": "Syria", "classification": "security", "score": 0.6322685986811983, "event_breakdown": "- Increased tension between Iran and Israel\n- Syria moves to the centre stage of conflict between Israel and Iran\n- Multiple overt and covert wars pushing the Middle East to the edge of a cliff\n- Escalation between Israel and Iran with potential to push the Middle East off the cliff\n- Tit-for-tat attacks threatening to involve Israel, Iran, and potentially the United States in a war\n- Gaza war moving Syria to the forefront of the covert Israeli-Iranian confrontation"}, {"id": "a7964321-5a51-4069-aa0d-a4e23013152e", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-04-30 21:30", "url": "https://www.yahoo.com/news/five-killed-russian-missile-attack-195300897.html", "message": "At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- At least five people were killed and more than 30 injured in a Russian missile attack on Odesa, Ukraine\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack on Odesa\n- Ukrainian authorities suspect that Russia used cluster munitions with the intention of causing a large number of casualties\n- The use, transfer, and production of cluster munitions is prohibited by the Convention on Cluster Munitions\n- Russian officials claim that air defenses in Crimea intercepted a major missile and drone attack by Ukraine"}, {"id": "a84d96be-0453-47e2-9903-b6ad9bc0267b", "title": "Ukraine  Harry Potter castle  goes up in flames as Russian missile attack kills 5", "date": "2024-04-30 22:30", "url": "https://www.cnn.com/2024/04/30/europe/ukraine-harry-potter-castle-missile-attack-intl-latam/", "message": "CNN —At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "Odesa", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack on Odesa results in five killed and over 30 injured\n- Ukrainian authorities suspect use of Iskander ballistic missile and cluster munitions by Russia in the attack\n- Investigation suggests Russian military intentionally used cluster munitions to cause significant casualties\n- Convention on Cluster Munitions prohibits the use, transfer, and production of cluster munitions internationally\n- Russian officials claim successful interception of major missile and drone attack by Ukraine in Crimea"}, {"id": "b8d65bca-5f32-4418-b428-3d23e3cc02e1", "title": "Portuguese - Flagged Ship Is Hit Far in Arabian Sea , Raising Concerns over Houthi Rebel Capabilities", "date": "2024-04-30 23:00", "url": "https://www.military.com/daily-news/2024/04/30/portuguese-flagged-ship-hit-far-arabian-sea-raising-concerns-over-houthi-rebel-capabilities.html", "message": "JERUSALEM — A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nGen. Yahya Saree, a military spokesman for Yemen's Houthi rebels, claimed the attack on the Orion early Tuesday.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.", "location": "Arabian Sea", "classification": "security", "score": 0.8782016362926929, "event_breakdown": "- Portuguese-flagged container ship attacked by a drone in the Arabian Sea, near Yemen's shoreline.\n- Yemen's Houthi rebels claim responsibility for the attack on the MSC Orion."}, {"id": "58b77582-f5f2-460b-ba3d-0750949b7478", "title": "Suspected missile attack by Yemen Houthi rebels damages ship in the Red Sea : authorities", "date": "2024-04-29 19:45", "url": "https://www.theglobeandmail.com/world/article-suspected-missile-attack-by-yemens-houthi-rebels-damages-ship-in-the/", "message": "Open this photo in gallery: Yemen's capital Sana'a is seen on a map.The Associated PressA suspected missile attack by Yemen’s Houthi rebels damaged a ship in the Red Sea on Monday, authorities said, the latest assault in their campaign against international shipping in the crucial maritime route.\nMeanwhile Monday, the Italian Defence Ministry said its frigate Virginio Fasan shot down a Houthi drone that morning near the Bab el-Mandeb Strait between the Red Sea and the Gulf of Aden.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led air strike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nEarly Sunday morning, the U.S. military shot down five drones in the air over the Red Sea, its Central Command said.", "location": "Sana'a", "classification": "security", "score": 0.5616577975065878, "event_breakdown": "- Suspected missile attack by Yemen's Houthi rebels damages a ship in the Red Sea (Monday)\n- Italian frigate Virginio Fasan shoots down a Houthi drone near Bab el-Mandeb Strait (Monday)\n- US military shoots down five drones over the Red Sea (Sunday)"}, {"id": "566d7edf-a8a7-47f3-9180-55961d74656a", "title": "Portuguese - flagged ship is hit far in Arabian Sea , raising concerns over Houthi rebel capabilities", "date": "2024-04-30 19:30", "url": "https://www.clickorlando.com/news/2024/04/30/portuguese-flagged-ship-is-hit-far-in-arabian-sea-raising-concerns-over-houthi-rebel-capabilities/", "message": "JERUSALEM – A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses “that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,” the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "far reaches of the Arabian Sea", "classification": "security", "score": 0.8698369200247517, "event_breakdown": "- Portuguese-flagged container ship attacked by a drone in the Arabian Sea\n- Claim by Yemen's Houthi rebels of assaulting the ship\n- MSC Orion linked to London-based Zodiac Maritime, part of Eyal Ofer’s Zodiac Group\n- Joint Maritime Information Center assesses attack as targeting due to perceived Israeli affiliation\n- Rebels release footage of drone attack on Malta-flagged, Greece-owned bulk carrier"}, {"id": "d6c5fb3e-0ac4-45c8-ba05-d574cbadd7ee", "title": "Hamas alleges rocket barrage from Lebanon into northern Israel", "date": "2024-04-29 16:00", "url": "https://dailystar.com.lb/hamas-rocket-barrage-lebanon-northern-israel/", "message": "On Monday, the Ezzedine al-Qassam Brigades, the military wing of Hamas, launched a series of rockets from southern Lebanon targeting a northern Israeli military command center.\nIn response, the Israeli military reported intercepting most of the approximately 20 rockets launched from Lebanon and conducted strikes on the launch sites.\nFollowing the rocket barrage, an Israeli drone struck the town of Aita al-Shaab in southern Lebanon.\nEarlier in the year, a U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut, a Hezbollah stronghold.\nIn March, another Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre, while a Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley.", "location": "southern Lebanon", "classification": "security", "score": 0.997549179367563, "event_breakdown": "- Ezzedine al-Qassam Brigades launched rockets from southern Lebanon targeting an Israeli military command center\n- Israeli military intercepted most of the rockets launched from Lebanon and conducted strikes on the launch sites\n- Israeli drone struck the town of Aita al-Shaab in southern Lebanon\n- U.S.-reported Israeli strike in January killed Hamas’ deputy leader Saleh al-Arouri and six militants in south Beirut\n- Israeli strike killed a Hamas operative near the Rashidiyeh Palestinian refugee camp in Tyre\n- Hamas official narrowly escaped a drone strike near Souairi in the Bekaa Valley"}, {"id": "757d43ec-c9de-47cf-8da2-6d90f7506e40", "title": "Russian missile hits educational institution , kills five in Ukraine Odesa – The Times Of Earth", "date": "2024-04-30 09:45", "url": "https://www.timesofearth.com/2024/04/30/russian-missile-hits-educational-institution-kills-five-in-ukraines-odesa/", "message": "By Iryna Nazarchuk ReutersA Russian missile attack on an educational institution in a popular seafront park in the Ukrainian Black Sea port of Odesa on Monday killed at least five people and injured 32, local officials said.\nReuters Television footage showed the roof of the ornate building, a private law academy, all but destroyed after the strike.\nI don’t know what else to say,” Odesa Mayor Hennadii Trukhanov said in a video posted on Telegram.\nPublic broadcaster Suspilne said the academy’s president, a prominent former member of parliament, Serhiy Kivalov, was among the injured.\nOdesa has been a frequent target of Russian missile and drone attacks, particular port infrastructure.", "location": "Odesa", "classification": "security", "score": 0.3885877145857738, "event_breakdown": "- Russian missile attack on an educational institution in Odesa, Ukraine\n- Attack killed at least five people and injured 32\n- The targeted building was a private law academy\n- President of the academy, Serhiy Kivalov, was among the injured\n- Odesa has been a frequent target of Russian missile and drone attacks, particularly port infrastructure"}, {"id": "60cf3fd8-b7d5-4fde-9a0f-49befe0758d3", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames - LocalNews8 . com", "date": "2024-04-30 23:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "By Radina Gigova and Olga Voitovych, CNN(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack kills five and injures over 30 in Odesa, Ukraine.\n- Ukraine accuses Russia of using Iskander ballistic missile and cluster munitions in the attack.\n- Russia claims its air defenses in Crimea intercepted a major missile and drone attack by Ukraine."}, {"id": "75d8955d-d1db-4a12-bec7-daa56cf53969", "title": "Ship attacked by drone in Arabian Sea , Houthi rebels take responsibility", "date": "2024-05-01 02:15", "url": "https://www.foxnews.com/world/portuguese-flagged-ship-targeted-arabian-sea-drone-assault-houthi-rebels-claim-responsibility", "message": "A Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea, corresponding with a claim by Yemen's Houthi rebels that they assaulted the ship there, authorities said Tuesday.\nThe MSC Orion has been associated with London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\nThe Joint Maritime Information Center assesses \"that MSC Orion was likely targeted due to (its) perceived Israeli affiliation,\" the center said in a report.\nThose are close to Yemen's shoreline — unlike the site of the MSC Orion attack.\nOn Tuesday, the rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier, the day before.", "location": "Arabian Sea", "classification": "security", "score": 0.838042406233834, "event_breakdown": "- A Portuguese-flagged container ship was attacked by a drone in the far reaches of the Arabian Sea\n- Yemen's Houthi rebels claimed responsibility for the assault on the ship\n- The MSC Orion is associated with London-based Zodiac Maritime, part of Israeli billionaire Eyal Ofer’s Zodiac Group\n- The Joint Maritime Information Center believes that the MSC Orion was targeted due to its perceived Israeli affiliation\n- The rebels released footage of their drone attack on the Cyclades, a Malta-flagged, Greece-owned bulk carrier"}, {"id": "358d2c19-0bab-413b-9d38-6040afb46ce6", "title": "Five killed in Russian missile attack as Ukraine  Harry Potter castle  goes up in flames", "date": "2024-05-01 01:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/04/30/five-killed-in-russian-missile-attack-as-ukraines-harry-potter-castle-goes-up-in-flames/", "message": "(CNN) — At least five people were killed and more than 30 injured in a Russian missile attack on the Black Sea port city of Odesa on Monday, Ukrainian authorities say.\nUkrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions to carry out the attack.\nHe added that “the investigation has grounds to believe” the Russian military used cluster munitions with the intention of inflicting large number of casualties.\nThe use, transfer, and production of cluster munitions is prohibited by an international treaty known as the Convention on Cluster Munitions.\nRussia claims interceptMeanwhile, Russian officials say air defenses in Crimea succeeded in intercepting a major missile and drone attack by Ukraine.", "location": "ODESA", "classification": "security", "score": 0.5477120167395922, "event_breakdown": "- Russian missile attack kills at least five and injures more than 30 in Odesa, Ukraine.\n- Ukrainian authorities believe Russia used an Iskander ballistic missile and cluster munitions in the attack.\n- Russia claims its air defenses in Crimea intercepted a major missile and drone attack by Ukraine."}, {"id": "614c5cfa-6074-4f6c-b184-e67aad3c85d1", "title": "The Latest | Hamas officials leave Cairo after talks with Egypt officials over cease - fire proposal – The Durango Herald", "date": "2024-04-30 10:30", "url": "https://www.durangoherald.com/articles/the-latest-hamas-officials-leave-cairo-after-talks-with-egypt-officials-over-cease-fire-proposal/", "message": "×Officials from Hamas have left Cairo after talks with Egyptian officials on a new proposal for a cease-fire in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.\nCurrently:— Ahead of visit to Israel, Blinken presses Hamas to accept the new cease-fire proposal.\nHAMAS DELEGATION LEAVES CAIRO AFTER CEASE-FIRE TALKSCAIRO — Officials from Hamas have left Cairo after talks with Egyptian officials on a new cease-fire proposal in Gaza, Egypt’s state-owned Al-Qahera News satellite channel said Tuesday.\nThe channel, which has close ties with Egyptian security agencies, said a Hamas delegation will return to Cairo with a written response to the cease-fire proposal, without saying when.", "location": "CAIRO", "classification": "security", "score": 0.3917279483742275, "event_breakdown": "- Hamas officials hold talks with Egyptian officials in Cairo on a new cease-fire proposal for Gaza\n- Hamas delegation leaves Cairo after the discussions\n- Blinken urges Hamas to accept the new cease-fire proposal before visiting Israel"}, {"id": "c983a942-adaf-4a05-bf5a-20a2759df352", "title": "Sydney teenager charged after counter - terrorism raids texted  were going to kill , court hears | Australia news", "date": "2024-04-30 10:15", "url": "https://www.theguardian.com/australia-news/2024/apr/30/sydney-teenager-charged-after-counter-terrorism-raids-texted-were-going-to-kill-court-hears-ntwnfb", "message": "A 16-year-old Sydney boy charged with terrorism offences has been denied bail over fears for community safety after a court heard he messaged another young person “we’re going to kill”.\nSix teenagers were charged after counter-terrorism raids in Sydney last week, with two of them appearing in the children’s court at Parramatta on Tuesday.\n“We were planning big stuff bro, it’s conspiracy for a terrorist attack I think,” the court heard he wrote in a text message.\nThe court heard the 16-year-old’s parents, who were present for the hearing, wrote an affidavit describing an “excellent son” who was a good student.\nThe material allegedly included a video of an assault with the Islamic State symbol watermarked over the video.", "location": "Sydney", "classification": "entertainment", "score": 0.41021048371286883, "event_breakdown": "- A 16-year-old Sydney boy charged with terrorism offences denied bail\n- Six teenagers charged after counter-terrorism raids in Sydney\n- Two teenagers appearing in children’s court at Parramatta\n- Text message evidence of planning for a terrorist attack presented in court\n- 16-year-old’s parents described him as an \"excellent son\" and a good student\n- Material allegedly included a video of an assault with the Islamic State symbol watermarked"}]