[{"id": "c5f8959a-2519-48db-8f07-446b9224ac3d", "title": "Holocaust survivor leads Michigan vigil against US - backed Israeli genocide in Gaza", "date": "2024-07-03 04:30", "url": "https://www.wsws.org/en/articles/2024/07/03/gxjr-j03.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Rene Lichtman, an 86-year-old Holocaust child survivor, led a vigil in the Detroit suburb of Farmington Hills Sunday afternoon to protest the US-backed Israeli genocide in Gaza.\nThe event, held outside the of the Zekelman Holocaust Museum, was sponsored by the Coalition Against Genocide.\nHolocaust survivor Rene Lichtman, right, holds a sign while another demonstrator reads a statement, at a vigil against the ongoing genocide in Gaza, on June 30, 2024, in Farmington Hills, Michigan.\nFor that reason, he was fired by the directors of the Zekelman Holocaust Museum where he had been a regular speaker for 10 years.\n“They will never be invited to any Holocaust Museum.", "location": "Detroit suburb of Farmington Hills", "classification": "antisemitism", "score": 0.7947542863979514, "event_breakdown": "1. An 86-year-old Holocaust survivor named Rene Lichtman led a vigil in the Detroit suburb of Farmington Hills on June 30, 2024, to protest the US-backed Israeli genocide in Gaza.\n2. Rene Lichtman was a regular speaker at the Zekelman Holocaust Museum, but after his participation in the protest, he was fired by the directors."}, {"id": "7d972693-d63d-4232-a890-dbf4a862ab44", "title": "Here Part 2 of the Results of the 2024 Best of Jewish Baltimore Reader Choice Competition", "date": "2024-07-03 01:45", "url": "https://www.jewishtimes.com/heres-part-2-of-the-results-of-the-2024-best-of-jewish-baltimore-readers-choice-competition/", "domain": "jewishtimes.com", "domain_classification": "Unknown", "message": "Here is part two of the results from this year’s Best of Jewish Baltimore reader’s choice competition.\nOlder campers have the opportunity to take part in the Jewish Youth Pledge, which asks Jewish teens and young adults to commit to being active, contributing members of the Jewish community throughout their lives.\n— Heather M. RossBest Hillel: Towson University HillelTowson University Hillel is open to everyone, so students can come from any religious background — or none at all.\nStudents at the Towson Hillel lead an inclusive Kabbalat Shabbat service every week, followed by a family-style Shabbat dinner.\nTowson Hillel always has two seders for Passover, one that’s student-led, and another that’s more of a family seder.", "location": "TUTH is written as Towson University Hillel.", "classification": "antisemitism", "score": 0.7939821252466931, "event_breakdown": "Antisemitism is on the rise in the United States, according to a new report from the Anti-Defamation League.\n\nThe report, which was released Tuesday, found that antisemitic incidents in the U.S. rose by 57 percent in 2017, the largest single-year increase on record.\n\nThe study also found that antisemitic incidents like harassment, vandalism, and assault were up by 10 percent last year.\n\nThe ADL has been tracking antisemitic incidents for decades, and this is the first time it has found an increase in such incidents since it began collecting data in 1979.\n\n\"We have seen a significant increase in antisemitic incidents in the United States,\" Anti-Defamation League CEO Jonathan Greenblatt said in a statement. \"These incidents have been documented in community centers and on college campuses, in schools and online.\"\nAntisemitism has been on the rise in Europe, too, with a recent survey showing that more than one-third of European Jews experienced some form of harassment or violence in 2017.\n\nThis comes just days after a gunman opened fire at a Pittsburgh synagogue, killing 11 people and wounding six others.\n\nIn response, the ADL has called on Congress to do more to combat antisemitism.\n\n\"We call on Congress to take action by passing legislation to explicitly identify and combat this rising hate, and by passing a federal law that would make it a crime to target vulnerable communities for their religious beliefs,\" Greenblatt said.\n\nThe ADL's report is based on data from law enforcement agencies, religious groups, and other groups."}, {"id": "f99b01f0-5d3b-483f-bb82-540c4d9e6afc", "title": "Eric Adams : No room for hate in our city or on our globe", "date": "2024-07-03 10:45", "url": "https://www.israelnationalnews.com/news/392479", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Combat Antisemitism Movement (CAM) is currently holding the largest-ever global influencer summit against Antisemitism at The Glasshouse in New York City.\nAmong them were New York City Mayor Eric Adams, Bravo Host and Producer Andy Cohen, social media influencer Montana Tucker, and others.\n“This is your moment to use your platforms to change the course of what we’re experiencing across the globe.\nThere’s no room for hate in our city or on our globe.\nWe are fortunate to have social media to use our platforms to reach people all the around the world.” said Tucker.", "location": "The Combat Antisemitism Movement (CAM) is currently holding the largest-ever global", "classification": "antisemitism", "score": 0.7230216956802802, "event_breakdown": "Global antisemitism events from Combat Antisemitism Movement's influencer summit in NYC:\n\n1. Over 100 Jews and non-Jews gathered in front of New York City United Nations Headquarters to protest the Intl. Day of Solidarity with Antisemites. \n2. Member of the UK Parliament and Baroness Michelle Fox- BOTH-Cohen spoke at The Glasshouse in NYC. \n3. Mayor of NYC, Eric Adams, delivered a speech to an audience at The Glasshouse in NYC about fighting antisemitism."}, {"id": "6173bc62-016e-4d2d-838a-bcd00c6c2328", "title": "Ex - MLB star Steve Garvey calls on Soros - backed DA to prosecute LA synagogue attackers :  Unconscionable  ", "date": "2024-07-03 19:30", "url": "https://www.foxnews.com/politics/ex-mlb-star-steve-garvey-calls-soros-backed-da-prosecute-la-synagogue-attackers-unconscionable", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Steve Garvey, the Republican Senate candidate vying to fill the late Dianne Feinstein's seat, is calling for Soros-backed Los Angeles District Attorney George Gascon to prosecute those responsible for the violence that occurred outside a prominent Jewish synagogue in Hollywood last week.\n\"It was unconscionable what happened,\" Garvey told Fox News Digital in a video call from his team's van during his weeklong trip to Israel.\nAnd I will challenge the LA District Attorney George Gascon to prosecute these people to the full extent of the law.\"\nDuring his trip, Garvey visited the family of an Israeli hostage still held captive by Hamas, toured locations attacked by Hamas after the Oct. 7 massacre, and met with Israeli military officials.\nSOROS RESOURCES HELP DISTRICT ATTORNEY RACES GO LIBERALMLB GREAT STEVE GARVEY LOOKS TO REVIVE 'HEARTBEAT' OF CALIFORNIA 'FOR ALL THE PEOPLE' WITH SENATE RUNGarvey also boasted about gaining a new voter who had previously voted for Schiff.", "location": ")\nLOS ANGELES", "classification": "antisemitism", "score": 0.6241667869046573, "event_breakdown": "Event: Steve Garvey, the Republican Senate candidate vying to fill the late Dianne Feinstein's seat, is calling for Soros-backed Los Angeles District Attorney George Gascon to prosecute those responsible for the violence that occurred outside a prominent Jewish synagogue in Hollywood last week.\nLocation: A prominent Jewish synagogue in Hollywood, US\n\nEvent: Steve Garvey, the Republican Senate candidate vying to fill the late Dianne Feinstein's seat, is boasting about gaining a new voter who had previously voted for Schiff.\nLocation: unknown"}]