[{"id": "ed2bafb6-07f5-47d5-9383-be5f035a97c7", "title": "Hezbollah Says Its Intensified Attacks Show Israel That All - out War Would Be Costly", "date": "2024-06-15 05:15", "url": "https://www.news18.com/world/hezbollah-says-its-intensified-attacks-show-israel-that-all-out-war-would-be-costly-8932938.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Lebanese militant group Hezbollah says its intensified attacks along Israel’s northern border this week demonstrate to Israeli leaders that an all-out war would be costly, senior official Sheikh Ali Daamoush said in a sermon during Friday prayers.\nCross-border attacks by Israel and Hezbollah have been taking place almost daily since the war in Gaza began in October.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.\nThe cease-fire proposal announced by Biden includes those provisions, but Hamas has expressed wariness whether Israel will implement the terms.", "location": "GAZA", "classification": "security", "score": 0.7286442506739896, "event_breakdown": "Hamas -  Israel's land border with Lebanon - Hezbollah"}, {"id": "0243d605-bcb7-49a1-8680-ade2cdf162b5", "title": "Hamas says top official killed in explosion south of Beirut", "date": "2024-06-15 03:30", "url": "http://www.myanmarmuslim.net/news/20240615846f599097.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An explosion in Beirut on Tuesday killed Saleh Arouri, a top official with the Palestinian militant group Hamas and three others, officials with Hamas and the Lebanese group Hezbollah have confirmed.\nHamas official Bassem Naim confirmed to The Associated Press that Arouri was killed in the blast.\nA Hezbollah official speaking on condition of anonymity in line with regulations also said Arouri was killed.\nThe explosion shook Musharafieh, one of the Lebanese capital’s southern suburbs, which are a stronghold of the militant Hezbollah group, an ally of Hamas.\nArriving in Beirut, Arouri made few public appearances but helped to pull Hamas closer to Hezbollah’s orbit.", "location": "BEIRUT", "classification": "security", "score": 0.9697903243618624, "event_breakdown": "[\n\"An explosion in Beirut on Tuesday killed Saleh Arouri, a top official with the Palestinian militant group Hamas and three others, officials with Hamas and the Lebanese group Hezbollah have confirmed.\",\n\"Arouri was killed in the blast.\"\n]"}, {"id": "c3c4b675-bf40-44cb-9762-4a7881465435", "title": "US launches wave of strikes on Houthi rebel targets in Yemen", "date": "2024-06-15 09:15", "url": "https://www.euronews.com/2024/06/15/us-launches-wave-of-strikes-on-houthi-rebel-targets-in-yemen", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels in retaliation to a series of missile strikes in the Arabian and Red Seas.\nThe US military's Central Command said they destroyed seven radar sites.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThis week, two cruise missiles launched by Houthi rebels set a bulk cargo carrier ablaze in the Gulf of Aden.\nThe strike hit the Ukrainian-owned and Polish-operated bulk cargo carrier the M/V Verbena and severely wounded a civilian mariner.", "location": ".\nNULL", "classification": "security", "score": 0.9885818078699857, "event_breakdown": "US military targets Houthi rebel radar sites in Yemen in retaliation to a series of missile strikes in the Arabian and Red Seas."}, {"id": "332557b6-b94a-4588-a94b-78d2c1f86a8a", "title": "Israel shoots down hundreds of drones and missiles launched by Iran", "date": "2024-06-15 04:45", "url": "http://www.myanmarmuslim.net/news/20240615134d599857.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israel's military spokesperson, Rear Admiral Daniel Hagari, said Iran launched dozens of ground-to-ground missiles at Israel, most of them intercepted outside Israeli borders.\nThe Iranian salvo of more than 300 drones and missiles caused light damage to one Israeli military facility, Hagari said.\nDemonstrators gathered in front of the British Embassy in Tehran after Iran launched a drone and missile attack on Israel.\nUnited Nations Secretary-General Antonio Guterres condemned Iran's attack, saying he was \"deeply alarmed about the very real danger of a devastating region-wide escalation.\"\nThe US military knocked down dozens of drones and missiles bound for Israel, three U.S. officials said.", "location": "Israel", "classification": "security", "score": 0.921147211047227, "event_breakdown": "Israel's military spokesperson, Rear Admiral Daniel Hagari, said Iran launched dozens of ground-to-ground missiles at Israel, most of them intercepted outside Israeli borders. The Iranian salvo of more than 300 drones and missiles caused light damage to one Israeli military facility, Hagari said. Demonstrators gathered in front of the British Embassy in Tehran after Iran launched a drone and missile attack on Israel. United Nations Secretary-General Antonio Guterres condemned Iran's attack, saying he was \"deeply alarmed about the very real danger of a devastating region-wide escalation.\" The US military knocked down dozens of drones and missiles bound for Israel, three U.S. officials said. Israel, Iran, Tehran, Britain, The UN, US."}, {"id": "63c4b6f2-82a6-42a1-8f88-96d2fb198094", "title": "Houthis strike Greek - owned vessel in Red Sea , 22 Filipino crew members evacuated , one missing", "date": "2024-06-15 07:15", "url": "https://www.firstpost.com/world/houthis-strike-greek-owned-vessel-in-red-sea-22-filipino-members-evacuated-one-missing-13782704.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileThe crew of a Greek-owned vessel had to be evacuated after it was damaged in an attack by Yemen’s militant group Houthi in the Red Sea.\nOne of the crew members from Tutor, the Liberia-flagged coal carrier, remains missing.\nAdvertisementThe Iran-backed group Houthis have claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden, over the past days.\nThe Tutor had 22 crew members onboard and most of them were Filipinos.\nIn March, the Rubymar bulk carrier, carrying thousands of tonnes of fertiliser, sank in the Red Sea after its hull was damaged in a Houthi missile strike.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.95448645420096, "event_breakdown": "Target event - Houthis firing missiles in the Red Sea off the coast of Yemen at vessels, specifically at Liberian-flagged coal carrier Tutor and a vast array of other types of ships."}, {"id": "81bb1a67-b51c-4710-8316-7680f5df97d3", "title": "  Revolutionary Guards killed  in airstrike on Iran consulate in Damascus", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615995c598996.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An Israeli airstrike that demolished Iran’s consulate in Syria killed two Iranian generals and five officers, Syrian and Iranian officials said on Monday.\nThe attack in Syria killed General Ali Reza Zahdi, who led the elite Quds Force in Lebanon and Syria until 2016, according to Iran’s Revolutionary Guard.\nAn Israeli airstrike in a Damascus neighbourhood in December killed a longtime adviser of the Iranian paramilitary Revolutionary Guard in Syria, Seyed Razi Mousavi.\nA similar strike on a building in Damascus in January killed at least five Iranian advisers.\nLast week, airstrikes over the strategic eastern Syrian province of Deir el-Zour near the Iraqi border killed an Iranian adviser.", "location": "Damascus", "classification": "security", "score": 0.9686545631894279, "event_breakdown": "1. An Israeli airstrike that demolished Iran’s consulate in Syria killed two Iranian generals and five officers, Syrian and Iranian officials said on Monday.\n2. The attack in Syria killed General Ali Reza Zahdi, who led the elite Quds Force in Lebanon and Syria until 2016, according to Iran’s Revolutionary Guard.\n3. An Israeli airstrike in a Damascus neighbourhood in December killed a longtime adviser of the Iranian paramilitary Revolutionary Guard in Syria, Seyed Razi Mousavi.\n4. A similar strike on a building in Damascus in January killed at least five Iranian advisers.\n5. Last week, airstrikes over the strategic eastern Syrian province of Deir el-Zour near the Iraqi border killed an Iranian adviser."}, {"id": "725c1e05-c9f1-4dc0-8341-e064242fd0a1", "title": "Paramedics among the 16 killed by Israeli airstrikes in Lebanon", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615811a599180.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli airstrikes killed nine people in southern Lebanon late on Wednesday, including paramedics who were preparing to respond to the first strike, the state-run National News Agency said.\nIt said the rockets were in response to the deadly strike on the paramedics centre.\nHezbollah’s Islamic health society said two of its paramedics were killed in Teir Harfa while the Islamic Risala scout association, also a paramedic group, said one of its members was killed in the strike on Naqoura.\nIsrael said the earlier strike in Hebbariye killed a member of the Sunni al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nThe Israeli military said the attacker fled the scene following Thursday’s shooting and that forces were conducting searches.", "location": "Based on the text, the main focus of the event appears to be Lebanon.", "classification": "security", "score": 0.930330743845548, "event_breakdown": "Israeli airstrikes killed nine people in southern Lebanon late on Wednesday, including paramedics who were preparing to respond to the first strike, the state-run National News Agency said. It said the rockets were in response to the deadly strike on the paramedics center."}, {"id": "8c460dba-a6aa-4003-b6af-5e649ac2d5cb", "title": "US  strikes Yemen - Pro Bet Hub", "date": "2024-06-15 05:15", "url": "http://www.myanmarmuslim.net/news/20240615277c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The strike came as the Iranian-backed Houthis claimed responsibility for a missile attack against the Malta-flagged bulk carrier Zografia, also on Tuesday, in the Red Sea.\nThe attacks, US-led retaliatory strikes and the raid have all raised tensions across the Middle East, which also saw Iran conduct ballistic missile strikes in Iraq and Syria.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nHMS Diamond firing Sea Viper missiles in the Red Sea (Ship’s crew/MoD/Crown Copyright/PA)The US navy ultimately sank the ship carrying the weapons after deeming it unsafe, Central Command said.\nSince November, the Houthis have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas.", "location": "The focus is on the Red Sea.", "classification": "security", "score": 0.688611809857289, "event_breakdown": "US-led retaliatory strikes and the raid on a Houthi arms smuggling operation in the Red Sea."}, {"id": "4e63890b-5b14-45fe-9d53-e6dd97123d8b", "title": "Two More Hostages Killed In Israeli Bombing In Rafah : Palestinian Death Toll Has Risen To 37 , 266", "date": "2024-06-15 02:00", "url": "https://menafn.com/1108334209/Two-More-Hostages-Killed-In-Israeli-Bombing-In-Rafah-Palestinian-Death-Toll-Has-Risen-To-37266", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) GAZA, Jun 15 (NNN-WAFA) – The Al-Qassam Brigades, announced yesterday that, two more Israeli hostages were killed, in Israeli bombing in Rafah city, in the southern Gaza Strip.\nIn a released on Telegram, Al-Qassam Brigades said, the two hostages were killed in an airstrike“a few days ago.”There has been no immediate response from the Zionist army, regarding these developments.\nOn Jun 8, Al-Qassam Brigades said, the Zionist killed several hostages, during its operation to release only four hostages, in the central Gaza Strip.\nAs of yesterday, the Palestinian death toll from the ongoing Palestinian-Israeli conflict has risen to 37,266, with 85,102 others wounded, Hamas-run health authorities said, in a press statement.\nThe Zionist Defence Forces said in a statement yesterday that, it was continuing its operations across the Gaza Strip.– NNN-WAFA", "location": "GAZA", "classification": "security", "score": 0.9770451483889554, "event_breakdown": "Al-Qassam Brigades, The Al-Qassam Brigades said that, two more Israeli hostages were killed, in Israeli bombing in Rafah city, in the southern Gaza Strip."}, {"id": "165c958f-3923-4861-a9d4-6edb5fdc36a3", "title": "Russia Fires Volley Of Missiles At Ukraine , Including Feared Kinzhal", "date": "2024-06-15 04:45", "url": "https://menafn.com/1108334204/Russia-Fires-Volley-Of-Missiles-At-Ukraine-Including-Feared-Kinzhal", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Moscow/Kiev, June 15 (IANS/DPA) The Ukrainian Air Force has reported that Russia launched several on Ukraine using various missiles, including Kinzhal hypersonic missiles.\nThe modern Kinzhal missiles are feared because they are difficult to intercept with current defence systems due to their high speed and explosive power.\nPublic broadcaster Suspilne reported, citing residents, that multiple explosions were heard early Friday in the western Ukrainian region of Khmelnytskyi.\nEarlier in the night, Russia launched a combined airstrike on Ukraine using cruise missiles, rockets, and combat drones.\nThe Ukrainian Air Force said that at least two Kinzhal missiles were used in the assault.", "location": "KHMELNYTSKYI.", "classification": "security", "score": 0.4956872086150547, "event_breakdown": "Target event: Several Russian missiles (Kinzhal hypersonic missiles and cruise missiles) were fired at Ukraine on Friday morning, including into the western region of Khmelnytskyi.\nRussia fired several missiles into western Ukraine on Friday morning, including into the western region of Khmelnytskyi, according to the Ukrainian Air Force. At least two Kinzhal hypersonic missiles were launched, the Air Force said, while Russia also used cruise missiles, rockets, and combat drones. Three explosions were reported in the towns of Starokostiantyniv, Khmelnytskyi, and Chernihiv."}, {"id": "7a3fde27-b1a8-4611-9a87-5125a9f21ce1", "title": "US destroyer shoots down missile and drones launched by Yemen Houthi rebels", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615480b599517.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A US destroyer shot down drones and a missile in the Red Sea launched towards it by Yemen’s Houthi rebels, officials said.\nThe Houthi attack involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war.\nSmoke poured out of one container aboard the vessel, which also showed scorch marks from the impact of a Houthi missile.\nThe Houthis have been hailing ships over the radio in the Red Sea and the Gulf of Aden as well since launching their attacks.", "location": "The most relevant location to this event is 'Red Sea'.", "classification": "security", "score": 0.5369578428732131, "event_breakdown": "US destroyer shoots down drones and Houthi missiles in the Red Sea"}, {"id": "256927b9-2c57-475a-9f2f-579f50dd297a", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nSeparately, the US and Britain announced that they were imposing a new round of sanctions on Iran.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries.", "location": "Isfahan", "classification": "security", "score": 0.6696223111750752, "event_breakdown": "1. Air defense batteries fired in several provinces over reports of drones being in the air, state television reported. 2. Nuclear facilities in Isfahan are \"fully safe\" after air defence batteries fired in the area, state television reported. 3. The US and Britain also announced new sanctions against Iran."}, {"id": "e865124c-dfd5-470b-9b1a-5e48d74fe453", "title": "Yemen Houthi rebels fire missile at US warship in Red Sea", "date": "2024-06-15 00:00", "url": "http://www.myanmarmuslim.net/news/20240615133b599810.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A US fighter jet has shot down a cruise missile fired towards an American destroyer in the Red Sea by Yemen’s Houthi rebels, officials said.\nThe missile came from near Hodeida, a Red Sea port city long held by the Houthis, the US said.\nShipping through the Red Sea has slowed over the attacks.\nThe Americans and the United Kingdom did not acknowledge conducting any strike – suggesting the blast may have been from a misfiring Houthi missile.\nSince November, the rebels have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas.", "location": "The location of the event is the Red Sea.", "classification": "security", "score": 0.7763966615817007, "event_breakdown": "An American warship in the Red Sea has shot down a missile fired by Yemen's Houthi rebels on Sunday, January 23. The United States’ destroyer USS Anderson was the target, in the vicinity of Hodeida to which it is regularly targeted by insurgents."}, {"id": "320df46a-06e1-45c7-9098-09fa27268028", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas", "date": "2024-06-15 03:15", "url": "https://www.siasat.com/2-hostages-killed-in-israeli-bombing-in-rafah-hamas-3045146/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Gaza: Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in an Israeli bombing in Rafah city in the southern Gaza Strip.\nAl-Qassam Brigades said the two hostages were killed in an airstrike “a few days ago”, Xinhua news agency reported, citing a video released on Telegram.\nAlso Read Palestine’s first Olympian Majed Abu Maraheel dies in GazaThere has been no immediate response from the Israeli army regarding these developments.\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on October 7, 2023, during which about 1,200 people were killed and around 250 taken hostage.", "location": "Gaza", "classification": "security", "score": 0.9846725986681897, "event_breakdown": "Killed two Israeli hostages in an Israeli bombing in Rafah city in the southern Gaza Strip."}, {"id": "a18ebacc-d018-402c-9d0c-8bce8411ba2d", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:15", "url": "https://finance.yahoo.com/news/us-military-targets-houthi-radar-044138487.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "The United Arab Emirates.", "classification": "security", "score": 0.8148409213197316, "event_breakdown": "US Strikes Target Yemen's Houthi Rebels in Red Sea"}, {"id": "331de71a-8df9-4f08-add0-0570e82f389e", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://apnews.com/article/yemen-houthi-israel-hamas-red-sea-shipping-ab6fee82e73170b7e2edbab90ed6c14c", "domain": "apnews.com", "domain_classification": "International", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "The United Arab Emirates.", "classification": "security", "score": 0.8343479147099812, "event_breakdown": "Location: Yemen\nUS destroys Houthi radar sites in Yemen\nThe US military has unleashed a wave of attacks on radar sites operated by Yemen’s Houthi rebels"}, {"id": "34c483ae-8d52-4542-8360-5983b2742793", "title": "Russia and Ukraine exchange hundreds of prisoners of war", "date": "2024-06-15 03:30", "url": "http://www.myanmarmuslim.net/news/20240615866a599077.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia and Ukraine on Wednesday exchanged hundreds of prisoners of war in the biggest single release of captives since Russia’s full-scale invasion in February 2022.\nUkrainian authorities said that 230 Ukrainian prisoners of war returned home in the first exchange in almost five months.\nUkraine’s human rights ombudsman, Dmytro Lubinets, said it was the 49th prisoner exchange during the war.\nRescuers carry a wounded person after shelling in Belgorod (Russia Emergency Situations Ministry telegram channel via AP)Some of the Ukrainians had been held since 2022.\nA building damaged by shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said Ukraine fired two Tochka-U missiles and seven rockets at the region late on Tuesday, then launched six Tochka-U missiles and six Vilkha rockets on Wednesday morning.", "location": "Based on the text, there is no specific location listed for the event.", "classification": "security", "score": 0.40030953069602054, "event_breakdown": "Russia and Ukraine exchanged prisoners of war on Wednesday in the biggest single release of captives since Russia’s full-scale invasion of Ukraine in February 2022. Some of the Ukrainians had been held since 2022.\nThe attack took place in the southern Belgorod region in Russia. Ukraine’s human rights ombudsman said the Ukrainian forces fired seven rockets at the region late on Tuesday, and Russian forces launched six Tochka-U missiles and nine Vilkha rockets on Wednesday morning."}, {"id": "b6343669-7f33-464f-8843-7106abc1115e", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://www.news-gazette.com/news/nation-world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_65c89ae3-3681-566c-8435-e89a2f6a9ef5.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor", "location": "Yemen", "classification": "security", "score": 0.9635536225200994, "event_breakdown": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing"}, {"id": "47dbd67d-b6bd-495e-9974-77ad76942599", "title": "Seven Lebanese and an Israeli killed in exchange of fire along border", "date": "2024-06-15 06:45", "url": "http://www.myanmarmuslim.net/news/20240615884a599107.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "An Israeli air strike on a paramedics centre linked to a Lebanese Sunni Muslim group in south Lebanon has killed seven of its members, officials said.\nThe air strike after midnight on Tuesday hit an office of the Islamic Emergency and Relief Corps, according to the Lebanese Ambulance Association.\nThe Israeli air strike was linked to a Lebanese Sunni Muslim group (AP)The paramedics association listed the names of seven volunteers who were killed in the strike.\nThe Israeli military said it struck a military building in Hebbariye and killed a member of Lebanon’s Sunni Muslim al-Jamaa al-Islamiya, or the Islamic Group, and several other militants.\nAround 30 rockets were launched from Lebanon toward northern Israel, according to the Israeli military.", "location": "Lebanon", "classification": "security", "score": 0.9906065517991421, "event_breakdown": "Israeli air strikes hit Lebanon on Wednesday morning following rocket strikes launched on Israel from Lebanon"}, {"id": "4c40aa8a-5c3f-4d2f-ae86-1dfedd2e09b5", "title": "U . S . military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 08:00", "url": "https://www.thehindu.com/news/international/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article68292544.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "RED SEA CORRIDOR", "classification": "security", "score": 0.7773739178477623, "event_breakdown": "Here is the list of events related to security that can be placed on a map:\n\n* The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor\n* One merchant sailor went missing following an earlier Houthi strike on a ship"}, {"id": "385ce3a5-7b73-491d-821a-4cba58196b5f", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:00", "url": "https://www.whec.com/national-world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "The focus of this event is the United States.", "classification": "security", "score": 0.8343479147099812, "event_breakdown": "Yemen, Red Sea, United States"}, {"id": "f1a1a298-f230-4757-9620-764b1ee522bd", "title": "Undercover Oakland cops say they witnessed a pimp beating a woman with a gun on International Boulevard , then get away after police chase", "date": "2024-06-15 00:00", "url": "https://www.mercurynews.com/2024/06/14/undercover-oakland-cops-say-they-witnessed-a-pimp-beating-a-woman-with-a-gun-on-international-boulevard-then-get-away-after-police-chase/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "Clarence “C-Money” Brown III, 29, was charged with assault with a deadly weapon, pandering and being a felon in possession of a firearm.\nHe is being held at Santa Rita Jail in Dublin without bail, with a preliminary hearing set to start on Tuesday.\nOn the night of May 30, undercover Oakland police officers were doing surveillance when they reportedly witnessed Brown striking a woman with a pistol and holding the gun to her head.\nThe officers said in court records that they gave chase but the woman — later identified by police as 34-year-old Brittany Rivera — sped away and escaped.\nWhen Rivera showed up to an Oakland courthouse to watch Brown’s arraignment on June 5, she was also arrested, and later charged with accessory after the fact.", "location": "Oakland, California", "classification": "security", "score": 0.5548444804828505, "event_breakdown": "Security Event 1: Clarence Brown III charged with assault with a deadly weapon, pandering, and being a felon in possession of a firearm.\nSecurity Event 2: Brittany Rivera charged with accessory after the fact."}, {"id": "59b72888-9372-48bd-82db-86717f52a322", "title": "Ship targeted by missile fire in the Red Sea", "date": "2024-06-15 02:30", "url": "http://www.myanmarmuslim.net/news/20240615936f599056.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Missile fire apparently targeted a ship off Yemen in the Red Sea on Friday.\nThe vessel’s captain reported an explosion near the ship in the Red Sea off the Yemeni city of Mocha, the British military’s United Kingdom Maritime Trade Organisation (UKMTO) centre said.\nIt did not immediately identify the vessel targeted.\nSince November, the rebels have repeatedly targeted ships in the Red Sea over Israel’s offensive in Gaza.\nIt described hitting three mobile anti-ship cruise missiles in Houthi-controlled territory that “were prepared to launch against ships in the Red Sea”.", "location": "Mocha, Yemen", "classification": "security", "score": 0.6873553444037489, "event_breakdown": "Security event in the Red Sea, Yemen:\nOn Friday, 21 January 2022, a missile apparently targeted a ship off Yemen in the Red Sea."}, {"id": "09978af6-9539-42e1-b421-44bc93d9d0fb", "title": "Ship targeted by missile fire in the Red Sea - Precision Bet Tips", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615091c599906.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Missile fire apparently targeted a ship off Yemen in the Red Sea on Friday.\nThe vessel’s captain reported an explosion near the ship in the Red Sea off the Yemeni city of Mocha, the British military’s United Kingdom Maritime Trade Organisation (UKMTO) centre said.\nIt did not immediately identify the vessel targeted.\nSince November, the rebels have repeatedly targeted ships in the Red Sea over Israel’s offensive in Gaza.\nIt described hitting three mobile anti-ship cruise missiles in Houthi-controlled territory that “were prepared to launch against ships in the Red Sea”.", "location": "Mocha, Yemen", "classification": "security", "score": 0.6873553444037489, "event_breakdown": "Event 1: Missile fire reportedly targeted a ship off Yemen in the Red Sea on Friday."}, {"id": "2fedf006-06c7-4645-a458-d88e01c4cfc4", "title": "Undercover Oakland cops say they witnessed a pimp beating a woman with a gun on International Boulevard , then get away after police chase", "date": "2024-06-15 00:00", "url": "https://www.eastbaytimes.com/2024/06/14/undercover-oakland-cops-say-they-witnessed-a-pimp-beating-a-woman-with-a-gun-on-international-boulevard-then-get-away-after-police-chase/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Clarence “C-Money” Brown III, 29, was charged with assault with a deadly weapon, pandering and being a felon in possession of a firearm.\nHe is being held at Santa Rita Jail in Dublin without bail, with a preliminary hearing set to start on Tuesday.\nOn the night of May 30, undercover Oakland police officers were doing surveillance when they reportedly witnessed Brown striking a woman with a pistol and holding the gun to her head.\nThe officers said in court records that they gave chase but the woman — later identified by police as 34-year-old Brittany Rivera — sped away and escaped.\nWhen Rivera showed up to an Oakland courthouse to watch Brown’s arraignment on June 5, she was also arrested, and later charged with accessory after the fact.", "location": "Oakland", "classification": "security", "score": 0.5548444804828505, "event_breakdown": "Security Event: C-Money Brown charged with assault with a deadly weapon\nEvent Location:\nBay Area, California\nEvent Date:\nMay 30, 2023"}, {"id": "2b741e92-4640-48d9-89f3-e10130057bb5", "title": "Ukraine pummels Russia air force in  precision  strike | World | News", "date": "2024-06-15 07:15", "url": "https://www.express.co.uk/news/world/1911515/ukraine-russia-ukraine-vladimir-putin-volodymyr-zelensky", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin has reportedly lost two more SU-34 fighter-bombersUkraine has hit a Russian military airfield with precision weapons, an insider has said, as part of “a sustained campaign to degrade the Russian Air Force”.\nThey added: \"The targets were struck to degrade Russia's ability to conduct airstrikes on [the northeastern region of] Kharkiv.\n\"This strike will impede Russia's ability to conduct such strikes in the future and allow UAF [Ukrainian armed forces] troops to push back RGF with a reduced threat of air attack.\"\nHe explained: “For too long, Ukraine has had to fight the invading Russians with one hand tied behind its back.\n“One of only six which can fire Russia’s own ‘wonder weapon’ – a hypersonic missile – the strike was a powerful sign of Kyiv’s increasing power.\"", "location": "The location provided is not a city or a country, and it is not possible to determine a specific location based on the given", "classification": "security", "score": 0.6324955030914451, "event_breakdown": "New message from the General Staff of the Armed Forces of Ukraine for the morning on May 17th.\n\"On the Kharkiv front, the Air Force worked alongside Ukrainian soldiers to fight Russian troops.\"\nBased on the provided text, the only relevant event that can be placed on map is:\nUkrainian soldiers worked alongside the Air Force to fight Russian troops on the Kharkiv front."}, {"id": "2bdd0fda-9b49-45ff-9f45-39dead8375d5", "title": "Israeli strikes kill multiple civilians at shelters in Gaza combat zone", "date": "2024-06-15 02:30", "url": "http://www.myanmarmuslim.net/news/2024061522c599923.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli military strikes have killed multiple civilians at a UN shelter and hospital in the Gaza Strip’s main combat zone.\nLarge columns of smoke rose from Gaza as Israel’s military said it had encircled Gaza City, the target of its offensive to crush Hamas.\nPalestinians comfort a crying man after he lost relatives under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians strike the concrete while looking for survivors under the rubble of a destroyed house following an Israeli airstrike in Gaza City on Saturday.\nPalestinians inspect the damage of a house destroyed by an Israeli airstrike in Gaza City on Saturday.", "location": "GAZA CITY", "classification": "security", "score": 0.9641139729975198, "event_breakdown": "The Israeli military launched strikes on a UN shelter and hospital in Gaza City, killing multiple civilians. The Israeli offensive is targeting Gaza City with the intention of crushing Hamas."}, {"id": "bcb7deff-0617-462c-a5c4-600e963f74d6", "title": "Iranian commander renews vow to avenge Syria strike that killed two generals", "date": "2024-06-15 09:15", "url": "http://www.myanmarmuslim.net/news/20240615186e599812.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A top military commander on Saturday renewed Iran’s promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two Iranian generals.\nGeneral Mohammad Bagheri, Iran’s joint chief of staff, told mourners gathered for the funeral of general Mohammad Reza Zahdi that Iran will decide when and how to stage an “operation” to take revenge.\nGen Zahdi was the highest ranking commander killed in Monday’s attack.\nIn all, 12 people were killed in the strike – seven Iranian Revolutionary Guard members, four Syrians and a Hezbollah militia member.\nTensions have flared against the backdrop of the six-month-old Israel-Hamas war in Gaza, and raised renewed fears of a broader regional conflict.", "location": "Syria", "classification": "security", "score": 0.812192630993987, "event_breakdown": "Israel airstrike on Iranian consulate in Syria."}, {"id": "73673cab-459b-4956-a30c-96e25a99e420", "title": "Man who randomly stabbed Mexican tourist at Tim Hortons back living in Vancouver - BC", "date": "2024-06-15 00:15", "url": "https://globalnews.ca/news/10567969/vancouver-police-warning-david-morin/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailThe man who randomly stabbed a Mexican tourist in a Vancouver Tim Hortons two years ago has been released from prison and is back living in the city.\nVancouver police“He was convicted of an extremely violent, unprovoked assault,” Vancouver police Sgt.\n2:04 Suspect in downtown Vancouver coffee shop stabbing known to policeThe 25-year-old victim was waiting in line when a man approached him from behind and “repeatedly stabbed him” in the back, Vancouver police said at the time.\nMorin has faced numerous charges dating back to 2012, including assault, assault with a weapon, assault causing bodily harm, sexual assault, uttering threats and unlawful confinement.\nStory continues below advertisement0:40 Man critically injured in downtown Vancouver coffee shop stabbingMorin has been ordered to live in a Vancouver halfway house, and Addison said he has been released under numerous conditions.", "location": "Vancouver", "classification": "security", "score": 0.7709363230114025, "event_breakdown": "1. Random stabbing of Mexican tourists in Vancouver Tim Hortons: A man randomly stabbed a Mexican tourist in a Vancouver Tim Hortons two years ago. The man, who was convicted of the assault, was recently released from prison and is back living in the city.\n2. Downtown Vancouver coffee shop stabbing: A man was critically injured after being stabbed in downtown Vancouver. The attacker is familiar to police."}, {"id": "908b7ef3-d9f2-4ddd-92ab-4ccab8049479", "title": "Man with  far - right tie arrested for knife attacks on two children in Finland", "date": "2024-06-15 03:15", "url": "https://www.yahoo.com/news/man-far-ties-arrested-knife-180059605.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Man with 'far-right ties' arrested for knife attacks on two children in FinlandMan with 'far-right ties' arrested for knife attacks on two children in FinlandA man suspected of stabbing and seriously wounding a 12-year-old in Finland has been arrested on Thursday.\nFinnish public broadcaster Yle reported that intelligence officials have identified the 33-year-old suspect as having ties to far-right extremism.\n\"A man born in 1990 is suspected of having stabbed the 12-year-old victim from behind several times.\nAfter that he tried to go after a minor who was in the company of the other victim of stabbing,\" the police statement said.\n\"Far-right violence is a real threat in Finland.", "location": ".\nFinland", "classification": "security", "score": 0.958476160472245, "event_breakdown": "Man with 'far-right ties' arrested for knife attacks on two children in Finland (at Finland)"}, {"id": "30a87b25-729e-423b-83c1-9d68f53bd604", "title": "Greek - owned coal carrier attacked by Yemeni Houthi militants in Red Sea , search for missing sailor continues", "date": "2024-06-15 06:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/greek-owned-coal-carrier-attacked-by-yemeni-houthi-militants-in-red-sea-search-for-missing-sailor-continues/articleshow/111014182.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: The crew of the Greek-owned coal carrier , Tutor, was evacuated after an attack by Yemeni Houthi militants caused significant damage to the vessel, leaving it adrift in the Red Sea , according to reports from the United Kingdom Maritime Trade Operations (UKMTO) and the Philippine migrant workers minister.Hans Leo Cacdac, the Philippines ' migrant workers minister, said on Saturday that efforts are underway to locate one missing sailor and initiate salvage operations for the Liberia-flagged ship.\nThe incident is part of a troubling pattern, marking the third Houthi attack on a ship crewed by Filipino sailors in the past year.\nPrevious attacks resulted in the deaths of two Filipino seafarers and the capture of 17 others, government data shows.The Houthi militants, aligned with Iran, have claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden.\nThese assaults are part of a broader campaign by the Houthis, who have targeted ships in the Red Sea, Bab al-Mandab Strait, and the Gulf of Aden since November, citing solidarity with Palestinians in the Gaza conflict.\nThe missing sailor is believed to be trapped in the engine room, according to maritime sources and the Philippine migrant workers ministry.Cacdac mentioned that Tutor, carrying 80,000 tonnes of coal, is stable and can be safely towed.", "location": "RED SEA", "classification": "security", "score": 0.8066580338594039, "event_breakdown": "Tutor, a Greek-owned coal carrier, was attacked by a Houthi militant and was left adrift in the Red Sea. The attack caused significant damage to the ship, and efforts are underway to locate the one missing sailor. This is the third Houthi attack on a ship crewed by Filipino sailors in the past year, and officials are warning of a troubling pattern. Houthi militants have claimed responsibility for the missile strike on Tutor and a vessel named Verbena. The Yemeni militants are targeting ships in the Red Sea, Bab al-Mandab Strait, and the Gulf of Aden in response to events in the ongoing Gaza conflict."}, {"id": "ca590ddc-4201-48a5-a2f1-92554410ef7c", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas - People Daily Online", "date": "2024-06-15 02:30", "url": "http://en.people.cn/n3/2024/0615/c90000-20181651.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "2 hostages killed in Israeli bombing in Rafah: HamasXinhua) 09:50, June 15, 2024Smoke rises in Rafah city in the southern Gaza Strip, May 28, 2024.\n(Photo by Khaled Omar/Xinhua)GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nSmoke rises following Israeli strikes in the southern Gaza Strip city of Rafah, on May 14, 2024.", "location": "GAZA", "classification": "security", "score": 0.9940699484642396, "event_breakdown": "Security forces quell protest against Ethiopian prime minister in Somali capital\nMOGADISHU, Somalia -- Somali security forces on Sunday quelled a protest in the capital Mogadishu where demonstrators had called for the removal of Ethiopia's Prime Minister Abiy Ahmed over the ongoing conflict in the neighboring region of Tigray.\n\"Authorities used live ammunition, including sniper fire, to disperse protesters in the capital.\nSmoke rises in Rafah city in the southern Gaza Strip, May 28, 2024.\nIsraeli air strikes kill two hostages in Rafah."}, {"id": "5b12a7b9-8769-4303-941e-3c07609fe6d4", "title": "Iran accuses US of giving Israel  green light  for consulate attack", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615024e599967.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran’s foreign minister on Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nNasrallah said Gen Zahedi’s first involvement was until 2002, overseeing Israel’s withdrawal from southern Lebanon, and helping Hezbollah scale up.\nGen Zahedi’s final stint began in 2020 and ended when he was killed.\nHezbollah militants and Israeli troops have clashed along the tense Lebanon-Israel border since October 8, the day after the Hamas attack on southern Israel.", "location": "Beirut", "classification": "security", "score": 0.9613968020124223, "event_breakdown": "On May 13, 2018, Israel bombed a weapons base near the town of al-Qutayfah in Syria. The Syrian government said the strikes killed nine people, including several non-Syrians. The Israeli military said the base was being used by the Iranian Revolutionary Guards’ Quds force to store large quantities of weapons.\nThe attack came a week after Israel said it had shot down an Iranian drone launched from Syria. Israel has carried out dozens of airstrikes in Syria in recent years.\nOn January 20, 2015, the Islamic State captured a gas field near the town of Tadmor, Syria. The militants are believed to have been armed with anti-tank missiles and machineguns.\nThe group claims to have taken control of at least 10 other oil and gas fields in the past 12 months."}, {"id": "ae630222-e86c-4ce3-8759-751061595e12", "title": "South Korean and US troops will begin major exercises next week", "date": "2024-06-15 01:15", "url": "http://www.myanmarmuslim.net/news/20240615146d599846.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korean and US troops will begin their expanded annual military drills next week in response to North Korea’s evolving nuclear threats, the two countries said.\nWhile it is unlikely for North Korea to launch full-blown attacks against South Korea and the US, observers say the North could still stage limited provocations along the tense border with South Korea.\nMr Lee, the South Korean military spokesperson, said that the upcoming South Korea-US drills would involve training to detect and shoot down North Korean cruise missiles.\nThey expect North Korea to ramp up its testing activities and other provocations this year as both the US and South Korea head into major elections.\nThe Pentagon said Mr Austin reaffirmed the ironclad US extended deterrence commitment to the defence of South Korea.", "location": "South Korea", "classification": "security", "score": 0.45280475654765184, "event_breakdown": "North Korean nuclear testing, heightened nuclear threats from North Korea, South Korea-US military drills involving training to detect and shoot down North Korean cruise missiles."}, {"id": "f7600c57-4a2f-456b-814d-a70e7cb59d76", "title": "US and South Korea fly warplanes in interception drill after North missile tests", "date": "2024-06-15 03:00", "url": "http://www.myanmarmuslim.net/news/20240615128c599869.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korea and the United States have flown advanced stealth fighters in a joint missile-interception drill over the Korean Peninsula, South Korea’s Air Force said.\nThe drill was an apparent response to a spate of weapons tests this year by rival North Korea.\nNorth Korea has conducted six rounds of missile tests so far this year, most of them reportedly involving cruise missiles that typically fly at a low altitude to overcome opponents’ missile defences.\nSouth Korea and the US have responded by expanding their military exercises and trilateral training involving Japan.\nSouth Korean Air Force F-35A fighter jets prepare to take off from a South Korean Air Force base in Cheongju, South Korea (South Korea Defence Ministry via AP)This year, North Korea is expected to step up its testing activities and belligerent rhetoric as both the US and South Korea head into elections.", "location": "SEOUL", "classification": "security", "score": 0.5985138306438714, "event_breakdown": "US and South Korea fly advanced stealth fighters in joint drill over the Korean Peninsula"}, {"id": "1a4fc816-d562-4f64-8262-3547ae31f5d6", "title": "Crisis on the Red Sea : Yemeni Militant Attacks Disrupt Global Shipping", "date": "2024-06-15 00:30", "url": "https://www.devdiscourse.com/article/headlines/2983560-crisis-on-the-red-sea-yemeni-militants-attacks-disrupt-global-shipping", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Iran-aligned Houthis claimed responsibility for the missile strike on Tutor and another vessel, Verbena, in the Gulf of Aden, over the past days.\nTheir attacks also damaged two other ships in the last week, \"marking a significant increase in effectiveness,\" British security firm Ambrey said.\nThey have sunk one ship, seized another vessel and killed three seafarers in separate attacks.\nThe Houthis' air and sea campaign has disrupted global shipping, causing delays and costs to cascade through supply chains.\n\"We demand that all involved parties cease their deliberate and targeted attacks on innocent seafarers with immediate effect,\" it said.", "location": ".\nGULF OF ADEN", "classification": "security", "score": 0.8048245409086924, "event_breakdown": "Iran-aligned Houthis launch missile strike on Global Patriot in Red Sea\n\nSecurity forces in Puntland kill 8 al Shabaab members\n\nHostage situation at Catholic church in South Africa\n\nAt least 50 dead in protests against military dictatorship in Myanmar\n\nBulgaria bus bombing kills 6 Israeli tourists\n\nSuicide bombing at marketplace in Nigeria\n\nThe events reported on the map are:\nGlobal Patriot - Houthis launch missile strike on vessel in Red Sea\nAustralia - Security forces in Puntland kill 8 al Shabaab members\nSouth Africa - Hostage situation at Catholic church\nMyanmar - At least 50 dead in protests against military dictatorship\nBulgaria - Bulgaria bus bombing kills 6 Israeli tourists\nNigeria - Suicide bombing at marketplace"}, {"id": "ef2404d2-c40a-4dbd-ba0f-b11065aedc14", "title": "Islamic Resistance in Iraq  behind strike that killed three US troops in Jordan  ", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615568d599375.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The United States has attributed the drone attack that killed three US service members in Jordan to the Islamic Resistance in Iraq, an umbrella group of Iran-backed militias, as US president Joe Biden weighs his response options to the strike.\nNational Security Council spokesperson John Kirby said the US believes the attack was planned, resourced and facilitated by the Islamic Resistance in Iraq, an umbrella group that includes the militant group Kataib Hizbullah.\nAny additional American strikes could further inflame a region already stirred by Israel’s ongoing war on Hamas in the Gaza Strip.\nSome observers fear a new round of strikes targeting Iran could tip the region into a wider war.\nBut Iran’s government has taken note of the US threats of retaliation for the attack on the base in Jordan.", "location": "Jordan", "classification": "security", "score": 0.7866681781741995, "event_breakdown": "Security Event 1: Drone Attack on US Military Base in Jordan\nUnited States president Joe Biden has dismissed the possibility of negotiating with Iran. “Terrorists should know that we will come to them wherever they are,” he said.\nSecurity Event 2: New Round of US Strikes Targeting Iran\nThe US has accused Iran of orchestrating a drone attack on American forces in Jordan."}, {"id": "8d89e1a4-d3b5-43dc-a2ca-a376e054e236", "title": "Man Charged in Fatal Stabbing in Costa Mesa", "date": "2024-06-15 00:15", "url": "https://mynewsla.com/crime/2024/06/14/man-charged-in-fatal-stabbing-in-costa-mesa/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A 25-year-old man was charged Friday with a fatal stabbing in Costa Mesa.\nIsrael Antonio Valencia, 25, was charged with murder with a sentencing enhancement for the personal use of a deadly weapon.\nAnother suspect arrested in the case — 18-year-old Christopher Mathew Pena — was not charged along with Valencia.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive, according to Roxi Fyad of the Costa Mesa Police Department.", "location": "Costa Mesa", "classification": "security", "score": 0.71393903515482, "event_breakdown": "Location: Costa Mesa, California\nEvent: Fatal Stabbing\nCosta Mesa Police have charged Israel Antonio Valencia, 25, with murder for the stabbing death of 19-year-old victim. The victim was found dead on a street near the Balboa Peninsula on Tuesday. A second suspect, Christopher Mathew Pena, 18, was not charged along with Valencia. The two suspects are believed to be involved in a gang fight. The attack is considered to be gang retaliation."}, {"id": "f0580523-a8c6-4241-9151-410fe423cd8e", "title": "25 - Year - Old Man Charged with Murder", "date": "2024-06-15 00:15", "url": "https://mynewsla.com/crime/2024/06/14/man-charged-in-fatal-stabbing-in-costa-mesa-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A 25-year-old man was charged Friday with a fatal stabbing in Costa Mesa.\nIsrael Antonio Valencia, 25, was charged with murder with a sentencing enhancement for the personal use of a deadly weapon.\nAnother suspect arrested in the case — 18-year-old Christopher Mathew Pena — was not charged along with Valencia.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive, according to Roxi Fyad of the Costa Mesa Police Department.", "location": "Costa Mesa", "classification": "security", "score": 0.71393903515482, "event_breakdown": "Three armed men are at large after a jewelry store robbery in Warsaw, Poland. A shootout ensued as police attempted to stop the getaway car. The suspects escaped, and it is unclear how much jewelry they got away with. The robbery occurred at around 3 p.m. on Tuesday(The Guardian)"}, {"id": "1fd2d167-7dae-4ffb-ac3f-e08cfa9e5517", "title": "Israel accused of strike on Iranian consulate in Syria", "date": "2024-06-15 03:15", "url": "http://www.myanmarmuslim.net/news/20240615910e599081.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran and one of its key proxies vowed to respond to a strike, widely attributed to Israel, that demolished Iran’s consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.\nMonday’s strike in Damascus signalled an escalation because it struck an Iranian diplomatic mission.\nThe US National Security Council said the United States played no role in the strike in Damascus and did not know of it ahead of time.\nIt comes as IRNA said Iran holds the United States, Israel’s closest ally, responsible for the strike (AP Photo/Vahid Salemi)Houthi rebels have also been launching long-range missiles toward Israel.\nIRNA said Iran holds the United States, Israel’s closest ally, responsible for the strike.", "location": "Damascus", "classification": "security", "score": 0.6134399535216358, "event_breakdown": "Iran vowed to respond to a strike, widely attributed to Israel, that demolished Iran’s consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.\nThe US National Security Council said the United States played no role in the strike in Damascus and did not know of it ahead of time.\nSunni Islamist rebels in Yemen have been firing long-range missiles toward Saudi Arabia.\nHouthi rebels in Yemen have also been launching long-range missiles toward Saudi Arabia."}, {"id": "3ddf73f1-2209-4473-8c0a-c4278893ba3f", "title": "US launches airstrikes in Iraq and Syria in retaliation for drone attack", "date": "2024-06-15 09:15", "url": "http://www.myanmarmuslim.net/news/2024061529f599914.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“This afternoon, at my direction, US military forces struck targets at facilities in Iraq and Syria that the IRGC and affiliated militia use to attack US forces,” Mr Biden said in a statement.\nStrikes in Iraq and SyriaAt 4:00 p.m. (EST) Feb. 02, U.S. Central Command (CENTCOM) forces conducted airstrikes in Iraq and Syria against Iran’s Islamic Revolutionary Guards Corps (IRGC) Quds Force and affiliated militia groups.\nIran has denied it was behind the Jordan attack.\nThe last attack was on January 29 at at al-Asad airbase in Iraq, and there were no injuries or damage.\nTower 22 houses about 350 US troops and sits near the demilitarised zone on the border between Jordan and Syria.", "location": "SULAIMANIYAH, IRAQ", "classification": "security", "score": 0.9524026432711649, "event_breakdown": "* U.S. strikes Iran-backed militia sites in Iraq and Syria\n* U.S. conducts airstrikes against Iran's Islamic Revolutionary Guards Corps (IRGC) Quds Force and affiliated militia groups."}, {"id": "9873caef-3ae2-460a-b3ae-697c41bb15b0", "title": "17 killed as Russian missiles slam into Ukrainian city", "date": "2024-06-15 03:15", "url": "http://www.myanmarmuslim.net/news/20240615202e599789.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Three Russian missiles slammed into a central area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-storey apartment building and killing at least 17 people, local officials said.\nUkrainian President Volodymyr Zelensky has pleaded with Western countries to provide his country with more air defence systems.\nAlso, unconfirmed reports said a Ukrainian missile struck an airfield in occupied Crimea.\nNeither Russian nor Ukrainian officials confirmed the strike, but local authorities temporarily closed a road where the airfield is located.\nUkrainian drone developers have been extending the weapons’ range and earlier this month struck a target some 745 miles (1,200km) east of Ukraine.", "location": "Chernihiv", "classification": "security", "score": 0.5512557129404588, "event_breakdown": "Target Event: Russian missiles slammed into a central area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-storey apartment building and killing at least 17 people."}, {"id": "06ae8dce-790a-459c-97ba-7d5dd1ac43d7", "title": "Russian attack on Sumy Oblast kills 1 , injures 7", "date": "2024-06-15 03:15", "url": "https://www.yahoo.com/news/russian-attack-sumy-oblast-kills-013650807.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked eight communities in Sumy Oblast on June 14, killing one civilian and injuring seven, the Sumy Oblast Military Administration reported.\nIn Shostka, a missile attack killed one person and injured four others.\nStrikes against Sumy Oblast have become increasingly destructive in recent months.\nA Russian rocket attack on May 29 on Krasnopillia killed two civilians and injured three others.\nSumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts.", "location": "Shostka", "classification": "security", "score": 0.9936497959641192, "event_breakdown": "Russian forces attacked eight communities in Sumy Oblast on June 14, killing one civilian and injuring seven, the Sumy Oblast Military Administration reported. In Shostka, a missile attack killed one person and injured four others. Strikes against Sumy Oblast have become increasingly destructive in recent months. A Russian rocket attack on May 29 on Krasnopillia killed two civilians and injured three others. Sumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts."}, {"id": "206f6ec5-88b9-48c4-963c-bff86e89fc21", "title": "Russia claims drone attack in Rostov Oblast", "date": "2024-06-15 06:00", "url": "https://www.yahoo.com/news/russia-claims-drone-attack-rostov-030500416.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians have reported a drone attack in Rostov Oblast and that air defence systems have been responding near the town of Kamensk-Shakhtinsky.\nSource: Rostov Oblast Governor Vasily Golubev; ASTRA Telegram channelQuote from Golubev: \"Air defence forces downed several UAVs near Kamensk-Shakhtinsky at around 04:00.\nDetails: Russians are posting the moment a drone was flying over the town of Kamensk-Shakhtinsky in Rostov Oblast on social media.\nOne of the largest chemical plants in southern Russia, the federal business Kombinat Kamensky, is located in Kamensk-Shakhtinsky.\nThe documents indicate that the Kamensk-Shakhtinsky plant is the place where composite fuel for the missile engines of this type and testing facilities are located.", "location": "Kamensk-Shakhtinsky", "classification": "security", "score": 0.8857852970374627, "event_breakdown": "Drone attack reported in Rostov Oblast, Russia; several UAVs downed near Kamensk-Shakhtinsky (coordinates: 48.5326, 38.8121)."}, {"id": "3722173e-c8f1-46ad-9139-ed6fa2d6cd5b", "title": "Houthi Attack Leaves Philippine Crew Stranded in Red Sea", "date": "2024-06-15 03:30", "url": "https://www.devdiscourse.com/article/business/2982812-houthi-attack-leaves-philippine-crew-stranded-in-red-sea", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "The crew of a Greek-owned vessel Tutor that was damaged in an attack by Yemeni Houthi militants in the Red Sea should be rescued within the day although one sailor is still missing, the Philippines said on Friday.\nThe Iran-aligned Houthi militants have taken responsibility for the boat and missile attack on the Tutor.\nThe 22 crew members on board are mostly Filipino, Hans Cacdac, the Philippines Department of Migrant Workers Secretary, told a press conference in Manila.\nThe missing crew member was suspected to be trapped in the engine room, maritime sources said.\nThe rest of the crew were \"safe and sound\" and had adequate food supplies, Cacdac said, citing the captain.", "location": "RED SEA", "classification": "security", "score": 0.7703852430055665, "event_breakdown": "[\n{\n\"Event\": \"Afghanistan: At least 15 members of the Hazara ethnic minority were massacred in the Gizab district of Uruzgan province, where the Taliban have been active for years. This massacre lasted from 31 July to 4 August. The Hazaras were reportedly beaten and finally killed by the Taliban.\"\n},\n{\n\"Event\": \"The crew of the Tutor, a Greek-owned vessel, was rescued days after a missile and boat attack in the Red Sea. On 31 July, Ethiopia accused the Sudanese army of carrying out a drone attack on its forces, their allies and Eritrean troops, in the Tigray region.\"\n},\n{\n\"Event\": \"Pressure applied by the Oromo Liberation Army (OLA) on its rival Amhara militias in the Gimbi district of Ethiopia's western region of Benishangul-Gumaz on 20 July caused the recurrence of ethnic strife between the Oromo and Amhara communities.\"\n}\n]"}, {"id": "ca8ec96f-2296-4131-8231-45d62dab1cb3", "title": "Houthi rebels unveil solid - Sure Win Bet", "date": "2024-06-15 07:45", "url": "http://www.myanmarmuslim.net/news/20240615599d599400.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have unveiled a new solid-fuel missile that resembles aspects of one earlier displayed by Iran that Tehran said could fly at hypersonic speeds.\nThe rebels fired the new Palestine missile, complete with a warhead painted like a Palestinian checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nIran unveiled the missile last year and claimed it could reach Mach 15th — 15 times the speed of sound.\nHypersonic weapons, which fly at speeds higher than Mach 5, could pose crucial challenges to missile defence systems because of their speed and manoeuvrability.\nBallistic weapons fly on a trajectory in which anti-missile systems like the US-made Patriot can anticipate their path and intercept them.", "location": "ISRAEL", "classification": "security", "score": 0.41917918481005595, "event_breakdown": "Target event - Houthi rebels fired a new Palestine missile at the Gulf of Aqaba port in Israel."}, {"id": "a36497a7-df7e-42ba-889e-9eed537a6ba9", "title": "Crew abandon ship  attacked by Yemen Houthi rebels  ", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615400e599597.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The crew of a commercial ship struck in a suspected attack by Yemen’s Houthi rebels have abandoned the vessel in the Gulf of Aden.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war in Gaza.\nHouthi supporters attend a rally against the US-led strikes on Yemen and Israel’s war in Gaza (Osamah Abdulrahman/AP)Despite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9431920174469803, "event_breakdown": "Event 1: A commercial ship, True Confidence, was allegedly attacked by Yemen's Houthi rebels in the Gulf of Aden on January 2, 2021.\nEvent 2: A ship named Carney was targeted by the Houthi rebels on October 2, 2020. It was reported in the US Central Command, who stated that the incident involved bomb-carrying drones and one anti-ship ballistic missile."}, {"id": "39568d03-874c-41eb-ac3a-21ca2f6b81c8", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:45", "url": "https://santamariatimes.com/news/world/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/article_4b109eed-a1f6-5e3d-93f3-79bdc6d2ca2b.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingThe United States military has unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor", "location": "Yemen", "classification": "security", "score": 0.9635536225200994, "event_breakdown": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing"}, {"id": "19aa6f02-e7ad-4131-97ea-cd023b7f8279", "title": "US military targets Houthi radar sites in Yemen after a ... ", "date": "2024-06-15 06:45", "url": "https://accesswdun.com/article/2024/6/1248028", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": ")\nRED SEA CORRIDOR", "classification": "security", "score": 0.8148409213197316, "event_breakdown": "U.S. strikes destroyed seven Houthi rebel radars in territory they control in Yemen's Red Sea port city of Hodeidah on July 25. The strikes were in response to continued Houthi attacks on merchant shipping in the Red Sea."}, {"id": "fb23f771-fb62-42d2-b159-aa18056da30a", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:45", "url": "https://toronto.citynews.ca/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military’s Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "The United Arab Emirates.", "classification": "security", "score": 0.8343479147099812, "event_breakdown": "The U.S. has the military launched a series of attacks targeting radar sites in Yemen operated by Houthi rebels who have been attacking the shipping industry using ballistic missiles."}, {"id": "6683c2f6-22c4-46e9-bcf2-a5087322b731", "title": "Two dead after Israeli missiles  hit residential area  in Syria", "date": "2024-06-15 01:15", "url": "http://www.myanmarmuslim.net/news/20240615016a599976.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli air strikes hit a neighbourhood in the Syrian capital on Wednesday morning, killing two people and causing material damage, Syria’s state TV said.\nSyrian state TV reported that several missiles hit the western neighbourhood of Kfar Sousseh but did not elaborate or say who were the people killed.\nThe pro-government Sham FM radio station said the strike hit a building near an Iranian school.\nSana, the state news agency, quoted an unnamed military official as saying that the missiles were fired from the direction of Syria’s Israeli-occupied Golan Heights and hit a building, killing two civilians and wounding another.\nLast month, an Israeli strike on the Syrian capital’s western neighbourhood of Mazzeh destroyed a building used by the Iranian paramilitary Revolutionary Guard, killing at least five Iranians.", "location": "Kfar Sousseh", "classification": "security", "score": 0.9729889473114838, "event_breakdown": "Israeli air strikes hit a neighbourhood in the Syrian capital on Wednesday morning, killing two people and causing material damage, Syria's state TV said.\nSana, the state news agency, quoted an unnamed military official as saying that the missiles were fired from the direction of Syria's Israeli-occupied Golan Heights and hit a building, killing two civilians and wounding another."}, {"id": "97211723-f2d3-4219-9d8b-8f4baf1de38e", "title": "The Latest | US is removing aid pier from Gaza coast again due to weather , officials say", "date": "2024-06-15 03:15", "url": "https://www.ktsa.com/the-latest-us-is-removing-aid-pier-from-gaza-coast-again-due-to-weather-officials-say/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "Israel launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nAfter the Oct. 7 Hamas that triggered the war in Gaza, Smotrich froze the tax revenue transfers.\nUS-built aid pier will be removed from Gaza coast again due to weather, officials sayWASHINGTON — The U.S.-built aid pier will be detached from Gaza’s coast for a second time due to rough seas, two U.S. officials said Friday, raising further questions about the viability of the sea route.\nU.S. officials say the group has also looted and set fire to trucks carrying aid through the West Bank toward Jordan.\nThe Oct. 7 Hamas attack on Israel killed that sparked the war killed some 1,200 people — mostly civilians — and militants abducted about 250.", "location": "GAZA", "classification": "security", "score": 0.8677966864321227, "event_breakdown": "Israel-Hamas conflict\nHamas militants abducted about 250 Israelis and killed about 1,200 people — mostly civilians — during the Oct. 7 Hamas attack on Israel that triggered the war."}, {"id": "4eb49fdd-0430-4abb-b649-38413b2194ff", "title": "Russia wears down Ukrainian defences with missile and drone attacks", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615814d599177.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence systems intercepted 26 out of 28 Shahed drones, Ukraine’s air force said.\nRussian forces also launched five missiles overnight, it said.\nRescue workers clear the rubble of destroyed houses after a Russian drone attack in Zaporizhzhia (AP Photo/Andriy Andriyenko)The attacks also aim to weaken Ukrainian morale and act as retribution for Ukrainian long-range strikes on Russian soil.\nHe said it was “sheer nonsense” to think that Russia could attack a Nato member country after the Ukraine war.\nThe Black Sea city of Odesa repelled three missile and drone attacks, officials said.", "location": "ODESSA", "classification": "security", "score": 0.4235489607790607, "event_breakdown": "Ukraine rebuffed Russian attacks on Friday as the two sides waged a battle for air supremacy over the eastern Donbas region that is only expected to intensify in the coming months.\n1. A building in the northern city of Chernihiv sustained damage following a Russian airstrike.2. Russian planes attacked near the village of Yasnohorodka near Kyiv. Three houses in Yasnohorodka were destroyed, according to theUkrainian State Emergency Service.\nUkraine’s military warned of intensification of Russia’s offensive in eastern Ukraine.\nThe Russian army is concentrating its efforts on breaking through the villages around Donetsk to tie the Ukrainian forces up in these areas for as long as possible. The Ukrainian army is trying to hold back the Russian army’s advance.\nAustralia, Portugal and the European Union have condemned China’s claim on Taiwan.\nAustralian Foreign Minister Julie Bishop said China’s claim on Taiwan was no different from Russia’s claim on Ukraine.\nShe said Australia would continue to support Taiwan’s independence.\nThe Australian government issued a statement saying it “strongly opposes” China’s claim on Taiwan.\nThis headline from The Canberra Times incorrectly overlooks China's claim that Taiwan is part of China.\nChina and Taiwan have been separate countries for centuries, and Chinese president Xi Jinping has said his country wants to reunite with the nation.\nArticle:\nAustralia has taken a clear public stance in support of Taiwan, joining a list of countries including the US and Japan who have supported Taiwan.\nBut crucially there has been no direct involvement in the conflict"}, {"id": "04763228-c2ad-44a8-9ea3-7f4be5ed8655", "title": "Cuba Does Not Approve of US Submarine Presence - Deputy Foreign Minister", "date": "2024-06-15 06:00", "url": "https://sputnikglobe.com/20240615/cuba-does-not-approve-of-us-submarines-presence---deputy-foreign-minister-1118968881.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240615/cuba-does-not-approve-of-us-submarines-presence---deputy-foreign-minister-1118968881.htmlCuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterCuba Does Not Approve of US Submarine's Presence - Deputy Foreign MinisterSputnik InternationalThe Cuban government was notified of the USS fast attack submarine Helena visiting the US naval base in Cuba's Guantanamo, but Havana does not approve of such visits, Cuban Deputy Foreign Minister Carlos Fernandez de Cossio said.\n2024-06-15T05:44+00002024-06-15T05:44+00002024-06-15T05:45+0000americasuscubaguantanamo bayhavanaguantanamosubmarinehttps://cdn1.img.sputnikglobe.com/img/07e6/08/0b/1099495217_0:0:2000:1125_1920x0_80_0_0_04a7eba3693142b900066507d93f305b.jpg\"We were aware of their presence because, in accordance with the procedures that we have followed for years, the United States informed us in advance.\nThe deployment followed the Russian naval force's arrival in Cuba for naval exercises.\nUS officials previously noted that the Russian naval deployment to Cuba does not pose a threat to the United States.\nhttps://sputnikglobe.com/20240614/russian-ships-arrive-in-cuba-in-latest-blow-to-us-hegemony-1118939506.htmlamericascubahavanaguantanamoSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Sputnik Internationalus submarine, cuban government, us naval base, cuban deputy foreign minister carlos fernandez de cossio", "location": "Guantanamo", "classification": "security", "score": 0.6259344102067504, "event_breakdown": "Russia's fleet arrive in cuba\nUS troops visits guantananmo bay\nThe presence of US troops in Cuba is not approved by the Cuban government"}, {"id": "8e59cba5-80b2-4541-be18-d5a8ec167c0f", "title": "At least 95 killed in twin blasts at ceremony honouring Iranian general", "date": "2024-06-15 05:00", "url": "http://www.myanmarmuslim.net/news/20240615977a598966.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Two explosions minutes apart at a commemoration in Iran for a prominent general who died in a US drone strike in 2020 killed at least 95 people and injured more than 211 others on Wednesday.\nThe blasts came as the Middle East remains on edge over Israel’s war on Hamas in the Gaza Strip.\nWhile Israel has carried out attacks in Iran over its nuclear programme, it has conducted targeted assassinations, not mass-casualty bombings.\nThe blasts struck an event marking the the fourth anniversary of the killing of General Qassem Soleimani, the head of the Revolutionary Guard’s elite Quds Force, in a US drone strike in Iraq in January 2020.\nUltimately, a drone strike launched by the Trump administration killed the general, part of escalating incidents that followed America’s 2018 unilateral withdrawal from Tehran’s nuclear deal with world powers.", "location": "BAGHDAD", "classification": "security", "score": 0.8406651439409171, "event_breakdown": "Target Event - A commemoration event in Iran for General Qassem Soleimani was bombed causing 95+ casualties."}, {"id": "9f8c9570-ad9d-4a8a-a5f5-3064d4171d94", "title": "Israel signals change in tactics as it withdraws some troops from Gaza", "date": "2024-06-15 04:15", "url": "http://www.myanmarmuslim.net/news/20240615833d599110.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "But Israel has come under growing international pressure to scale back an offensive that has led to the deaths of nearly 22,000 Palestinians.\nIn its announcement, the army said that five brigades, or several thousand troops, would be taken out of Gaza in the coming weeks.\nThe Israeli military says 173 soldiers have died since it launched its ground operation.\nCombat was also reported in urban refugee camps in central Gaza, where Israel expanded its offensive last week.\nThe Israeli military said an airstrike killed Adel Mismah, a regional commander of Hamas’ elite Nukhba forces, in Deir al-Balah.", "location": "Gaza", "classification": "security", "score": 0.7794594550361438, "event_breakdown": "Israel has come under growing international pressure to scale back an offensive that has led to the deaths of nearly 22,000 Palestinians in Gaza. The Israeli military says that five brigades, or several thousand troops, will be taken out of Gaza in the coming weeks. The Israeli military also says that a strike killed Adel Mismah, a regional commander of Hamas' elite Nukhba forces, in Deir al-Balah."}, {"id": "9400aedc-8f0b-40f3-9fd9-f2374d0d2cad", "title": "IDF unit specializing in removing drone threats in Gaza revealed", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/israel-hamas-war/article-806280", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Spectrum Warfare teams operate covertly to disrupt a range of threats encountered by the IDF on the ground.\nStaff-Sergeant Y., Sergeant A., and Corporal Y. recently completed a two-week mission in Gaza, returning with three captured drones.\nInfluential role in IDF ground forcesSpectrum Warfare teams fully integrate into ground forces, such as taking on advisory roles.\nSoldiers consult us before launching,\" notes Sergeant Major A. IDF soldiers from the 'Spectrum Warfare' unit.\n(credit: IDF SPOKESPERSON UNIT)Numerous teams are actively engaged in Gaza, shielding active troops from diverse drone threats and mitigating friendly fire risks during drone interceptions.", "location": "Gaza", "classification": "security", "score": 0.8928369646259798, "event_breakdown": "IDF soldiers from the 'Spectrum Warfare' unit recently completed a two-week mission in Gaza, returning with three captured drones."}, {"id": "b38ee1d0-698a-4a59-a413-78b35ba8ccd7", "title": "North Korea building roads , walls inside Demilitarized Zone : Yonhap", "date": "2024-06-15 09:00", "url": "https://www.yahoo.com/news/north-korea-building-roads-walls-080532517.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A North Korean flag is seen at the propaganda village of Gijungdong, North Korea (Jung Yeon-je)North Korea's military has been building roads and walls inside the Demilitarized Zone that separates it from the South, the Yonhap news agency reported Saturday.\nThe report follows an incident last week when South Korean forces fired warning shots after North Korean soldiers briefly crossed the MDL.\nWhen asked about the report, the South Korean military said in a statement that it was \"closely tracking and monitoring the activities of the North Korean military\", and that \"further analysis is required\".\nNorth Korea strictly controls the flow of information inside its borders, and is extremely sensitive about its people gaining access to South Korean content, especially pop culture.\nIt has previously threatened artillery strikes against the South Korean loudspeakers -- a psychological warfare tactic that dates back to the 1950-53 Korean War.", "location": "North Korea", "classification": "security", "score": 0.8217804612778812, "event_breakdown": "North Korea's military building roads and walls in the Demilitarized Zone (DMZ) that separates it from South."}, {"id": "e7052fef-aa44-4301-88fc-86c8dd61be2f", "title": "Israel - Hamas War Day 253 : What is happening in Gaza ? ", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-15/live-updates-806289", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Smoke rises after an Israeli strike as Israeli forces launch a ground and air operation in the eastern part of Rafah, in the southern Gaza Strip May 7, 2024.\n(photo credit: REUTERS/Hatem Khaled)The IDF engaged in extensive activity in the southern Gazan city of Rafah on Saturday morning.\nFierce fighting is reported.\nSafa, a Hamas-affiliated news outlet based in Gaza, reported that Israeli artillery and helicopters fired in the area of the Saudi neighborhood west of Rafah.\nAccording to the Gazan news source, clashes and explosions were heard in the city's western area.", "location": "RAFAH", "classification": "security", "score": 0.9659130301109177, "event_breakdown": "IDF engaged in extensive activity in the southern Gazan city of Rafah on Saturday morning. Fierce fighting is reported.\nIDF engaged in extensive activity in the southern Gazan city of Rafah on Saturday morning. Fierce fighting is reported.\nSafa, a Hamas-affiliated news outlet based in Gaza, reported that Israeli artillery and helicopters fired in the area of the Saudi neighborhood west of Rafah.\nAccording to the Gazan news source, clashes and explosions were heard in the city's western area."}, {"id": "4fb82858-8abf-4b8f-a7df-7e3f66932951", "title": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front", "date": "2024-06-15 04:45", "url": "https://www.yahoo.com/news/ukraine-employs-flexible-defense-while-040040672.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the frontA Ukrainian soldier from the 57th Brigade waits for an order for his artillery vehicle to open fire on Russian positions at the front line in Ukraine’s Kharkiv region, Sunday, May 19, 2024.\nBy ceding some territory, Ukraine has been able to fight from better defended positions, according to interviews with senior Ukrainian military leaders, soldiers and officers in the field, and analysts.\nBy making painful choices to pull back to better-defended positions, Ukrainian troops are able to fight more efficiently and save personnel, military officials said.\nThe strategy stands in contrast to the nine-month-long battle for the salt-mining city of Bakhmut, where Ukrainian troops suffered heavy casualties in an ultimately futile attempt to not cede ground.\nRussia now has about 650,000 troops in Ukraine, which is nearly five times the 140,000 it had there two years ago.", "location": "KHARKIV REGION, Ukraine", "classification": "security", "score": 0.5614390192774448, "event_breakdown": "Ukraine employs a flexible defense while waiting for new Western ammo to get to the front\nA news push that reports an event that is happening in the current time frame and belongs to to the category security, not past event\nUkraine employs a flexible defense while waiting for new Western ammo to get to the front"}, {"id": "d8de1480-8913-46fd-93aa-56c565141bc7", "title": "MoD of Russia Reports for June 8th thru June 14th , 2024 … – Windows to Russia", "date": "2024-06-15 06:00", "url": "https://windowstorussia.com/mod-of-russia-reports-for-june-8th-thru-june-14th-2024.html", "domain": "windowstorussia.com", "domain_classification": "Unknown", "message": "The units of the Sever Group of Forces continued to move deep into the enemy defence during combat actions.\nThe AFU losses were up to 3,405 Ukrainian troops, four armoured fighting vehicles, 32 motor vehicles, 30 field artillery guns, including seven U.S.-made M777 howitzers.\nThe AFU losses were up to 3,785 Ukrainian troops, 11 armoured fighting vehicles, 48 motor vehicles, and 39 field artillery guns, 14 of which were Western-made.\nThe AFU losses were up to 965 Ukrainian troops, two tanks, six armoured fighting vehicles, 29 motor vehicles, two Czech-made Vampire MLRS combat vehicles, and 12 field artillery guns.\nThe AFU losses were up to 555 Ukrainian troops, 37 motor vehicles, and 26 field artillery guns, seven of which were foreign-made.", "location": "MOSCOW, RUSSIA", "classification": "security", "score": 0.890836017488286, "event_breakdown": "The Sever Group of Forces moved deep into the enemy defence during combat actions in the Severodonetsk, Donetsk, and Zaporizhzhia regions."}, {"id": "7518185c-ef9a-4380-99a4-c090f2485735", "title": "Germany sets aside unease over its military to celebrate first Veteran Day", "date": "2024-06-15 04:30", "url": "https://www.cnn.com/2024/06/15/europe/germany-first-veterans-day-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Germany is marking its first Veterans’ Day since World War Two on Saturday, a once unthinkable move that sets aside long-standing unease over the honoring of its soldiers.\n“We on the left reject this Veterans’ Day,” he told CNN in a statement.\nThe commemorations, modeled on Armed Forces Day in the UK and Veterans Day in the US, will honor all Germans who have worn military uniform – not only those wounded or killed in combat.\nBut the biggest spur to creating a Veterans’ Day has been Ukraine.\nHe played a prominent role in forming the new Veterans’ Day bill.", "location": "Berlin, Germany", "classification": "security", "score": 0.5387525693768949, "event_breakdown": "In this Saturday's election in Poland, voters will directly choose the next head of state for the next five years.\nPresident Andrzej Duda faces a stiff challenge from his Warsaw mayoral candidate Rafal Trzaskowski, who is running on a centrist platform.\nTrzaskowski was elected mayor of Poland's capital city in the fall of 2018, beating the PiS incumbent who moved into the national government as the country's defense minister.\nHere are five key moments you should know about the two candidates:\n1. Law and Justice v. Trzaskowski\nThe Trzaskowski-PiS battle traces its roots back three years.\nTrzaskowski beat a PiS rival in his race for mayor on a promise to rid some of PiS's most controversial policies, especially around education.\nPoland's President Andrzej Duda was elected with the support of the conservative Law and Justice (PiS) party in 2015 — five years later, Duda is battling Warsaw's mayor, Rafal Trzaskowski, who's running on a centrist platform in 2020\nDuda has backed restrictions around the independence of state media, the government's interference in courts and a tightening of abortion laws during his previous five year term...\nTrzaskowski says he will do away with MOST-like parties\nTrzaskowski is a man of few words and, until recently, tended to be evasive."}, {"id": "12d1fc4a-8f89-4b50-9a48-821ae2e8cadc", "title": "US Navy facing  most sustained combat since WWII  in Red Sea", "date": "2024-06-15 00:00", "url": "https://www.fox35orlando.com/news/navy-red-sea-combat", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "The U.S. Navy is engaged in intense combat with Iran-backed Houthi rebels from Yemen the Associated Press reported on Friday.\nThis conflict, which has been overshadowed by the Israel-Hamas war, is the most significant sea battle the Navy has faced since World War II.\nThe Navy has faced similar periods of combat during the 1980s Tanker Wars, but the current conflict is more sustained.\nWho are the Houthi rebels and why are they attacking the US?\nThe Houthi rebels, also known as Ansar Allah, are a Zaydi Shiite group from Yemen.", "location": "The U.S. Navy is engaged in intense combat with Iran-backed Houthi rebels from Yemen.", "classification": "security", "score": 0.7217360062737849, "event_breakdown": "US Navy engages in intense combat with Iran-backed Houthi rebels from Yemen.\nUS Navy engages in intense combat with Iran-backed Houthi rebels in Yemen."}, {"id": "27cc3bcd-54ff-4a0b-91db-818128366384", "title": "Heated auction in Maiden Gully ends with nanna house selling | Bendigo Advertiser", "date": "2024-06-15 07:45", "url": "https://www.bendigoadvertiser.com.au/story/8663670/heated-auction-in-maiden-gully-ends-with-nannas-house-selling/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"She was just happy for me to do whatever I needed to do [with the property],\" Chloe said moments after a drawn out auction battle between at least three bidders had finished.", "location": "SYDNEY", "classification": "security", "score": 0.787671416039108, "event_breakdown": "Chloe's property auction battle ends with her winning the property."}, {"id": "9e17dab2-7538-4a6f-8f45-06633779f188", "title": "Germany sets aside unease over its military to celebrate first Veteran Day - LocalNews8 . com", "date": "2024-06-15 09:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/14/germany-sets-aside-unease-over-its-military-to-celebrate-first-veterans-day/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Nadine Schmidt and Sophie Tanno, CNN(CNN) — Germany is marking its first Veterans’ Day since World War Two on Saturday, a once unthinkable move that sets aside long-standing unease over the honoring of its soldiers.\n“We on the left reject this Veterans’ Day,” he told CNN in a statement.\nThe commemorations, modeled on Armed Forces Day in the UK and Veterans Day in the US, will honor all Germans who have worn military uniform – not only those wounded or killed in combat.\nBut the biggest spur to creating a Veterans’ Day has been Ukraine.\nHe played a prominent role in forming the new Veterans’ Day bill.", "location": "BERLIN, GERMANY", "classification": "security", "score": 0.5387525693768949, "event_breakdown": "The current events of security reported in text that can be placed on a map are:\n- A military parade marking the 77th anniversary of Germany’s surrender to the Allies in World War II took place in Germany on Saturday.\n- Ukraine’s decision to mark the occasion by conducting military drills near the border with the Russian-backed separatist regions in eastern Ukraine also sparked protests outside Russian embassies in several European countries, including Berlin, where anti-war activists clashed with police."}, {"id": "59a1677d-2516-443b-9230-46b6ea51a780", "title": "Russia has carried out 38 airstrikes and deployed 490 kamikaze UAVs in the past 24 hours – Ukraine General Staff", "date": "2024-06-15 00:15", "url": "https://www.yahoo.com/news/russia-carried-38-airstrikes-deployed-202802023.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia has carried out 38 airstrikes and deployed 490 kamikaze UAVs in the past 24 hours – Ukraine's General StaffThroughout the day on 14 June, the Russian forces launched six missile attacks on Ukrainian territory, totalling seventeen missiles.\nThere were 81 combat clashes recorded at the front.\nThe Russian invaders continue to be most active in the area of Novooleksandrivka, Sokol and Novopokrovsk.\nThe situation is difficult, but the Defence Forces have everything under control.\nThere were 20 combat clashes that occurred on the right of the Kurakhiv front.", "location": "Southern part of the Kurakhiv front", "classification": "security", "score": 0.8097511553065951, "event_breakdown": "Russia carried out 38 airstrikes and deployed 490 kamikaze UAVs in Ukraine in the past 24 hours. There were six missile attacks on Ukrainian territory, totalling seventeen missiles."}, {"id": "9b687ff5-d128-4724-883d-ff23798a105d", "title": "Israeli Media : 8 soldiers killed in armored vehicle explosion in Rafah", "date": "2024-06-15 13:15", "url": "https://www.albawaba.com/news/israeli-media-8-soldiers-killed-armored-1572663", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - Eight soldiers were killed after an anti-tank missile destroyed a Namer armored personnel carrier early Saturday morning in Rafah, southern Gaza Strip, according to \"Hadashot BeZman\".\nAl-Aqsa TV said that Israeli troops upped their artillery and air strikes on Rafah to cover victims' exit.\nThe Qassam Brigades reported heavy fighting with Israeli soldiers in Tel Sultan since Friday morning.\nOne of the 8 was Waseem Mahmoud who was burned to death in the explosion that targeted a Namer military vehicle in Rafah, this morning.\nThe \"Jerusalem Post\" reported that hundreds of Israeli troops returning from Gaza had PTSD.", "location": "GAZA", "classification": "security", "score": 0.9894621097172288, "event_breakdown": "Eight soldiers were killed after an anti-tank missile destroyed a Namer armored personnel carrier early Saturday morning in Rafah, southern Gaza Strip."}, {"id": "cca2a31b-6cd3-4b6c-a9eb-1acaefbd0ee3", "title": "Global leader of ISIS targeted and possibly killed in U . S . airstrike", "date": "2024-06-15 12:30", "url": "https://www.nbcnews.com/politics/national-security/global-leader-isis-mumin-targeted-possibly-killed-us-airstrike-rcna157300", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "The U.S. military targeted the global leader of ISIS in an airstrike in Somalia late last month but cannot confirm whether he was killed, three U.S. officials say.\nU.S. Africa Command released a statement on May 31 saying it had conducted an airstrike against ISIS militants in a remote area 81 km (50 miles) southeast of Bosaso, Somalia, and killed three militants.\nNational Counterterrorism CenterThree U.S. officials now say Mumin was the target of that operation, even though they do not have confirmation of his death.\nA senior defense official says ISIS in Somalia is relatively small, with only 100 to 200 total fighters, all located in northern Somalia.\nThe previous two global chiefs of ISIS, including its best-known leader, Abu Bakr al-Baghdadi, had killed themselves when they were cornered during U.S. military raids.", "location": "Somalia.", "classification": "security", "score": 0.7168547460997343, "event_breakdown": "target event - The U.S. conducted a counterterrorism airstrike against the leader of ISIS in Somalia last month\nadditional events -\nThe U.S. conducted a counterterrorism airstrike against ISIS militants in Somalia on May 31. - BOSASO"}, {"id": "4f38c20d-ea15-47cd-8cc8-79cc5dafb122", "title": "Iran fires at apparent Israeli attack drones near air base and nuclear site", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/20240615258d599733.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iranian air defences have been activated after an apparent Israeli drone attack on a major air base near the central city of Isfahan.\nNo Iranian official directly acknowledged the possibility that Israel had attacked, and the Israeli military did not respond to a request for comment.\nIsfahan also is home to sites associated with Iran’s nuclear programme, including its underground Natanz enrichment site, which has been repeatedly targeted by suspected Israeli sabotage attacks.\nThe United Nations’ nuclear watchdog, the International Atomic Energy Agency (IAEA), also said “there is no damage to Iran’s nuclear sites” after the incident.\nIAEA can confirm that there is no damage to #Iran’s nuclear sites.", "location": "Isfahan", "classification": "security", "score": 0.9588848130998975, "event_breakdown": "Target event - Israeli drone attack on Iranian air base near the city of Isfahan."}, {"id": "c6e4826f-f7b9-4f93-bec7-f51404471f16", "title": "Hezbollah keeps up pressure on Israel days after commander death", "date": "2024-06-15 13:45", "url": "https://www.yahoo.com/news/hezbollah-keeps-pressure-israel-days-130208923.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Senior Hezbollah commander Taleb Abdallah was killed in an Israeli strike in the village of Jouaiyya on Tuesday, alongside three comrades, a source close to the group had told AFP.\nIsrael and Hezbollah, a Hamas ally, have traded near-daily cross-border fire since the Palestinian militant group's October 7 attack on Israel which triggered war in the Gaza Strip.\nThe Israeli army had confirmed it carried out the strike targeting Abdallah, describing him as \"one of Hezbollah's most senior commanders in southern Lebanon\".\nA source close to Hezbollah and rescuers affiliated with the group said a non-Lebanese man was killed in Aitarun, without providing further details.\nA Lebanese military source said Abdallah was the \"most important\" Hezbollah commander to have been killed since the start of the war.", "location": "Jouaiyya", "classification": "security", "score": 0.9566396561917058, "event_breakdown": "n Israeli strike targeted and killed Taleb Abdallah, the most senior Hezbollah commander in southern Lebanon, in Jouaiyya village on Tuesday. An Israeli army confirmed it carried out the strike targeting Taleb Abdallah in Jouaiyya village on Tuesday."}, {"id": "6c1e9380-8243-43eb-884e-0f35e601ede0", "title": "2 hostages killed in Israeli bombing in Rafah : Hamas", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240615-pdo01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "2 hostages killed in Israeli bombing in Rafah: HamasPeople's Daily Online(Xinhua) 09:50, June 15, 2024GAZA, June 14 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, announced on Friday that two Israeli hostages were killed in Israeli bombing in Rafah city in the southern Gaza Strip.\nIn a video released on Telegram, Al-Qassam Brigades said the two hostages were killed in an airstrike \"a few days ago.\"\nOn June 8, Al-Qassam Brigades said the Israeli army killed several hostages during its operation to release four hostages in the central Gaza Strip.\nThe Israel Defense Forces said in a statement on Friday that it continued its operations across the Gaza Strip.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate against a Hamas rampage through the southern Israeli border on Oct. 7, 2023, during which about 1,200 people were killed and around 250 taken hostage.", "location": "GAZA", "classification": "security", "score": 0.9802561041808415, "event_breakdown": "1. Hostages killed in Israeli bombing in Rafah city, southern Gaza Strip.\n\nRelevant event found:\n1. Hostages killed in Israeli bombing in Rafah city, southern Gaza Strip."}, {"id": "c1191e16-1509-45ae-8778-deb5702c561c", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 05:15", "url": "https://www.startribune.com/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/600373737/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n''These radars allow the Houthis to target maritime vessels and endanger commercial shipping,'' Central Command said in a statement.\n''The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,'' Central Command said.\nThe missing sailor is Filipino, according to the state-run Philippine News Agency, which cited Migrant Workers Secretary Hans Leo Cacdac.", "location": "The focus of this event is on the Red Sea, specifically in the commercial shipping corridor.", "classification": "security", "score": 0.6645472483671285, "event_breakdown": "```\nUS launches strikes on Houthi rebel radar sites in Yemen\n\nA U.S. aircraft carrier and guided-missile destroyer launched airstrikes on radar sites operated by the Iran-aligned Houthi rebels in Yemen on Friday, just days after the rebels attacked a Saudi warship with a missile.The strikes took out seven Houthi-controlled radars, which are used to “target maritime vessels and endanger commercial shipping,” according to the U.S. military."}, {"id": "7e755652-11ce-4d7f-89de-457d5e6634d9", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:15", "url": "https://www.clickondetroit.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.", "location": "RED SEA", "classification": "security", "score": 0.5276987724474559, "event_breakdown": "Following are the current events that can be placed on an interactive map:\n1. A U.S.-led coalition targeted radar sites operated by Yemen's Houthi rebels.\n2. Japan plans to release a bunker oil captured by Myanmar fishing boat.\n3. Fifteen Los Angeles police officers accused of falsifying information logged during traffic stops.\n4. Typhoon Chaba prompts U.S. sailor\ne warning."}, {"id": "af806b1b-2a13-4e30-88f4-bd0839dc9842", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 06:00", "url": "https://www.news4jax.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.", "location": "RED SEA", "classification": "security", "score": 0.5276987724474559, "event_breakdown": "The following current events of security were reported in the given time frame in text, and can be marked on a map:\n* On Tuesday, June 11, a fighter jet landed on the USS Dwight D. Eisenhower in the Red Sea. (Other details of the event are not mentioned in the document.)\n* On Saturday, June 15, the U.S. armed forces launched a series of attacks on radar sites operated by the Yemen-based Houthi rebels. According to the statement by Central Command, seven radars were successfully destroyed within Houthi territory, as retaliation for repeated attacks targeting ships in the Red Sea area."}, {"id": "2f81e3a5-cafe-475e-b564-aef6c63b9209", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:00", "url": "https://www.wsls.com/news/world/2024/06/15/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "A fighter jet lands on the USS Dwight D. Eisenhower, also known as \"IKE,\" in the Red Sea on Tuesday, June 11, 2024.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\n(AP Photo/Bernat Armangue)DUBAI – The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nRecommended VideosU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.", "location": ".\nRED SEA", "classification": "security", "score": 0.5276987724474559, "event_breakdown": "U.S. Launches Strikes Targeting Yemen's Houthi Rebels"}, {"id": "90b4b455-4416-44eb-8007-50c9dfefe0e2", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:45", "url": "https://isp.netscape.com/news/world/story/0001/20240615/ab6fee82e73170b7e2edbab90ed6c14c", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missingDUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\nIt did not elaborate on how the sites were destroyed and did not immediately respond to questions from The Associated Press.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": ")\nThe main focus of the events is Yemen.", "classification": "security", "score": 0.8190545866603048, "event_breakdown": "US military targets Houthi radar sites in Yemen after merchant sailor goes missing."}, {"id": "7b247b98-d327-449f-b561-ef19856f853d", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 10:15", "url": "https://www.pressdemocrat.com/article/trending/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goe/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — The United States military unleashed a wave of attacks targeting radar sites operated by Yemen's Houthi rebels over their assaults on shipping in the crucial Red Sea corridor, authorities said Saturday, after one merchant sailor went missing following an earlier Houthi strike on a ship.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": ".\nYEMENI", "classification": "security", "score": 0.8148409213197316, "event_breakdown": "U.S. military bases and operations in Africa\nU.S. military's base in Yemen's Aden\nPersian Gulf and nearby waters, including Strait of Hormuz and the vicinity of Ma\nU.S. troops in Somalia\nU.S. military strikes that target radar sites in Houthi-controlled territory in Yemen following Houthi attacks on shipping in the Red Sea corridor."}, {"id": "a64e3a33-ad73-49e4-8096-50d2b695465a", "title": "US military targets Houthi radar sites in Yemen after a merchant sailor goes missing", "date": "2024-06-15 09:45", "url": "https://www.durangoherald.com/articles/us-military-targets-houthi-radar-sites-in-yemen-after-a-merchant-sailor-goes-missing/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "×DUBAI, United Arab Emirates (AP) — The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one merchant sailor went missing and the vessel he was on caught fire in the latest Houthi strike on shipping in the crucial Red Sea corridor, authorities said Saturday.\nU.S. strikes destroyed seven radars within Houthi-controlled territory, the military's Central Command said.\n“These radars allow the Houthis to target maritime vessels and endanger commercial shipping,” Central Command said in a statement.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not acknowledge the strikes, nor any military losses.\n“The crew abandoned ship and were rescued by USS Philippine Sea and partner forces,” Central Command said.", "location": "The U.S. military unleashed a wave of attacks targeting radar sites operated by Yemen’s Houthi rebels after one", "classification": "security", "score": 0.8219400455381743, "event_breakdown": "U.S. strikes [target=Yemen radar sites] in Yemen"}, {"id": "02a0cff4-6a90-41d1-a763-1eadca981102", "title": "Navy facing its most intense combat since World War II | Nation and World", "date": "2024-06-15 03:30", "url": "https://www.reviewjournal.com/news/nation-and-world/us-navy-faces-its-most-intense-combat-since-world-war-ii-3069321/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "The U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.\nThe U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II.", "location": "The focus is on The U.S.-led campaign, not on a specific location or event.", "classification": "security", "score": 0.4733295880138946, "event_breakdown": "* The U.S.-led campaign against Iran-backed Houthi rebels has turned into the most intense running sea battle the Navy has faced since World War II, in Yemen's Red Sea."}, {"id": "01d56462-6b6d-4ba6-b668-a6308d3f60d5", "title": "Yemen Houthi rebels claim downing of US Reaper drone", "date": "2024-06-15 11:15", "url": "http://www.myanmarmuslim.net/news/20240615431c599560.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have claimed to have shot down another of the US military’s MQ-9 Reaper drones, airing footage of parts that corresponded to known pieces of the unmanned aircraft.\nThe Houthis described the downing as happening on Thursday over their stronghold in the country’s Saada province.\nThe war began after Hamas-led militants attacked Israel on October 7th, killing 1,200 people and taking some 250 others hostage.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a US-led airstrike campaign in Yemen.\nHowever, the rebels have renewed their attacks in the last week.", "location": "Saada, Yemen", "classification": "security", "score": 0.9575490272340945, "event_breakdown": "Houthi rebels claimed to have shot down another US MQ-9 Reaper drone over the rebel stronghold in the country's Saada province."}, {"id": "8316a9c0-65f4-4818-b982-a07e6b1296bf", "title": "Russia fires volley of missiles at Ukraine , including feared Kinzhal", "date": "2024-06-15 09:15", "url": "https://www.mangalorean.com/russia-fires-volley-of-missiles-at-ukraine-including-feared-kinzhal/", "domain": "mangalorean.com", "domain_classification": "Unknown", "message": "Russia fires volley of missiles at Ukraine, including feared KinzhalMoscow/Kiev: The Ukrainian Air Force has reported that Russia launched several attacks on Ukraine using various missiles, including Kinzhal hypersonic missiles.\nThe modern Kinzhal missiles are feared because they are difficult to intercept with current defence systems due to their high speed and explosive power.\nPublic broadcaster Suspilne reported, citing residents, that multiple explosions were heard early Friday in the western Ukrainian region of Khmelnytskyi.\nEarlier in the night, Russia launched a combined airstrike on Ukraine using cruise missiles, rockets, and combat drones.\nThe Ukrainian Air Force said that at least two Kinzhal missiles were used in the assault.", "location": "Ukraine", "classification": "security", "score": 0.5644935089131825, "event_breakdown": "Russia fires volley of missiles at Ukraine, including Kinzhal - Russia has launched multiple attacks on Ukraine using several missiles, including Kinzhal hypersonic missiles. The Ukrainian Air Force claims that at least two Kinzhal missiles were fired in the assault."}, {"id": "030a95d5-a9da-4a11-97cf-8f84f0fbf695", "title": "Russia launches drone strikes on Ukraine in retaliation for Belgorod attack", "date": "2024-06-15 14:00", "url": "http://www.myanmarmuslim.net/news/20240615894a599049.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russia launched a fresh drone assault on Ukraine on Saturday night, after promising that strikes on the Russian border city of Belgorod earlier in the day “would not go unpunished”.\nTwenty-eight people were injured in an attack on the eastern city of Kharkiv, regional governor Oleh Syniehubov said on Sunday.\nIn the Kyiv region that surrounds the capital, a Russian drone attack caused a fire to break out at a critical infrastructure facility, local officials said.\nFirefighters extinguish burning cars after shelling in Belgorod, Russia (Russia Emergency Situations Ministry Telegram channel/AP)Russia’s Defence Ministry said it identified the ammunition used in the strike as Czech-made Vampire rockets and Olkha missiles fitted with cluster-munition warheads.\nIn comments carried by Russian state media, Mr Nebenzya claimed Ukraine had launched “a deliberate act of terrorism directed against civilians”.", "location": "Ukraine", "classification": "security", "score": 0.478201302602433, "event_breakdown": "Russia launched a fresh drone assault on Ukraine, targeting the eastern city of Kharkiv, Kyiv region and the Russian border city of Belgorod. The eastern city of Kharkiv saw 28 people injured while Kyiv region reported a fire break out at a critical infrastructure facility due to a Russian drone attack."}, {"id": "af13c2f0-0a51-4ba1-94a8-df7711e12024", "title": "Battenfeld : Michelle Wu boasts of a safe Boston hours before Seaport shooting of high school graduate", "date": "2024-06-15 11:30", "url": "https://www.bostonherald.com/2024/06/15/battenfeld-michelle-wu-boasts-of-a-safe-boston-hours-before-seaport-shooting-of-high-school-graduate/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Mayor Michelle Wu boasted about how safe the city is just hours before a shooting of a newly-graduated Boston high school student in broad daylight in the Seaport and a violent beating and stabbing on Boston Common.\nIn a Boston Globe interview, Wu talked about how impressed leaders from other cities are with Boston’s safety.\nOn Thursday night, a group of people reportedly trying to intervene in a road rage incident were stabbed and beaten on Boston Common.\nViolent crime incidents lead to a perception that Boston is a crime zone.\nDoes anyone feel safe walking across Boston Common or deserted Downtown Crossing?", "location": "BOSTON COMMON", "classification": "security", "score": 0.7061965400750901, "event_breakdown": "A shooting of a newly-graduated Boston high school student in broad daylight in Seaport\nA violent beating and stabbing on Boston Common"}, {"id": "2828f2d7-6c97-4893-abeb-7416c95e1c8b", "title": "US and South Korea fly warplanes in interception drill after North missile tests", "date": "2024-06-15 02:45", "url": "http://www.myanmarmuslim.net/news/20240615054e599938.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "South Korea and the United States have flown advanced stealth fighters in a joint missile-interception drill over the Korean Peninsula, South Korea’s Air Force said.\nThe drill was an apparent response to a spate of weapons tests this year by rival North Korea.\nNorth Korea has conducted six rounds of missile tests so far this year, most of them reportedly involving cruise missiles that typically fly at a low altitude to overcome opponents’ missile defences.\nSouth Korea and the US have responded by expanding their military exercises and trilateral training involving Japan.\nSouth Korean Air Force F-35A fighter jets prepare to take off from a South Korean Air Force base in Cheongju, South Korea (South Korea Defence Ministry via AP)This year, North Korea is expected to step up its testing activities and belligerent rhetoric as both the US and South Korea head into elections.", "location": "South Korea", "classification": "security", "score": 0.5985138306438714, "event_breakdown": "North Korea carries out a cruise missile test on Sunday, June 5, off the west coast.\nThe United States and South Korea conduct a joint flyover on Tuesday, June 7, in an \"apparent response\" to the tests.\nNorth Korea is expected to step up its missile testing and ramp up its provocations in the coming weeks, including a seventh set of ballistic missile tests."}, {"id": "57cc27ef-e5f1-4edb-9de2-33d868a4c294", "title": "Xi visits Serbia on 25th anniversary of Nato bombing of Chinese embassy", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/2024061536f599955.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Chinese leader Xi Jinping’s visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during Nato’s air war over Kosovo.\nUS jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7 1999, setting it ablaze and killing three Chinese nationals.\nThe US at the time apologised and said the embassy bombing was a mistake that happened due to faulty intelligence.\nMr Xi will arrive from France and proceed from Serbia to Hungary as part of his first European tour in five years.\nHe is expected to visit the site of the former embassy on the anniversary date and pay his respects to the bombing victims.", "location": ".\nSERBIA", "classification": "security", "score": 0.6977182208773482, "event_breakdown": "US jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7 1999, setting it ablaze and killing three Chinese nationals. This terrorist attack has been condemned by the Chinese government as deliberate targeting of a legal institution of a member state of the United Nations."}, {"id": "a5175e73-17d3-4e41-8a1f-7da29c73dac7", "title": "Three commercial ships and US warship involved in Houthi attack in Red Sea", "date": "2024-06-15 12:15", "url": "http://www.myanmarmuslim.net/news/20240615207b599737.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ballistic missiles fired by Yemen’s Houthi rebels struck three commercial ships in the Red Sea, the US military said on Sunday.\n“These attacks represent a direct threat to international commerce and maritime security,” the US military’s Central Command said in a statement.\nShortly afterward, the Carney shot down a drone headed its way, although it is not clear if the destroyer was the target, Central Command said.\nWhile responding to its distress call, the Carney shot down another incoming drone.\nThe attack began around 9.15am local time (0615 GMT) in Houthi-controlled Sanaa, Yemen’s capital, Central Command said.", "location": "Sanaa, Yemen", "classification": "security", "score": 0.8153750408935225, "event_breakdown": "Location: Red Sea\nReported event: Ballistic missiles fired by Yemen's Houthi rebels struck three commercial ships in the Red Sea, the US military said on Sunday."}, {"id": "004b1c1d-374f-4f38-8d84-bbbca808b1a2", "title": "Russo - Ukraine War - 14 June 2024", "date": "2024-06-15 02:45", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-14.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nDuring the day, Russian forces launched six missile strikes on the territory of Ukraine with the use of 17 missiles.\nRussian forces tried to improve the tactical position in the areas of the settlements of Petropavlivka, Sinkivka and Pishnny.\nRussian air defence facilities have shot down one MiG-29 fighter jet and two Mi-8 helicopters of the Ukrainian Air Force.\nIn addition, Su-27 and Su-25 aircraft of the Ukrainian Air Force have been destroyed at airfields of departure.", "location": "Ukraine", "classification": "security", "score": 0.6496256662293112, "event_breakdown": "Russian forces attacked Ukraine with six missile strikes, launching 17 missiles in total during the day. Missile strikes were reported on the territory of Ukraine in the cities of Petrólivka, Vsinkivka and Píshnivka, targeting Ukrainian air force and airfields. Ukrainian forces reported shooting down one MiG-29 fighter jet and two Mi-8 helicopters."}, {"id": "14832767-bfd6-484e-a330-38450219d5a8", "title": "Defense Forces Repel Eight Attacks In South Overnight", "date": "2024-06-15 10:15", "url": "https://menafn.com/1108337142/Defense-Forces-Repel-Eight-Attacks-In-South-Overnight", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Over the past day, Ukrainian defenders repelled seven enemy in the Orikhiv direction and one on the left of the Dnipro River in the Kherson region.\nThe Southern Defense Forces of Ukraine reported this on Telegram , Ukrinform reports.\nOn the left bank of the Kherson region, Russian retreated to their original positions with losses.\nThe defense forces continue to take comprehensive measures to hold their positions.\nOver the past day, 213 reconnaissance drones were recorded flying in the operational area of the Southern Defense Forces.", "location": "ORHIIV", "classification": "security", "score": 0.920969708298567, "event_breakdown": "Current event of security reported on the map:\nThe Ukrainian Defence Forces repell seven Russian attacks in the Orikhiv direction, and one in Russian-occupied Kherson."}, {"id": "2df9d6f6-cc74-47cd-8d5a-eb2f42c32d7c", "title": "Iran supreme leader hints that Tehran hit little in massive attack on Israel", "date": "2024-06-15 10:15", "url": "http://www.myanmarmuslim.net/news/20240615398c599593.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Iran’s supreme leader has dismissed any discussion of whether Tehran’s unprecedented drone-and-missile attack on Israel hit anything there, a tacit acknowledgment that, despite launching a massive assault, few projectiles actually made it to their targets.\n“The main issue is the emergence of the Iranian nation and Iranian military’s will in an important international arena.\nThis is what matters.”Iran launched hundreds of drones, ballistic missiles and cruise missiles which sought to overwhelm Israel’s air defences in the April 13 attack – the first on Israel by a foreign power since Iraqi dictator Saddam Hussein launched Scud missiles at Israel in the 1991 Gulf War.\nHowever, Israeli air defences and fighter jets, backed by the US, the UK and neighbouring Jordan, shot down the vast majority of the incoming fire.\nIran’s attack came in response to a suspected Israeli strike on April 1 targeting a consular building next to the Iranian Embassy in Damascus, Syria, which killed two Guard generals and others.", "location": "SYRIA", "classification": "security", "score": 0.9238495957027764, "event_breakdown": "Location: Israel\nReported on: 20 April\nSupreme leader dismisses discussion of whether Tehran’s unprecedented drone and missile attack on Israel hit anything."}, {"id": "3c8159a4-fc1a-4843-a520-a6a8d8d97664", "title": "Crew abandon ship  attacked by Yemen Houthi rebels  ", "date": "2024-06-15 12:30", "url": "http://www.myanmarmuslim.net/news/20240615324a599668.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The crew of a commercial ship struck in a suspected attack by Yemen’s Houthi rebels have abandoned the vessel in the Gulf of Aden.\nSince November, the rebels have repeatedly targeted ships in the Red Sea and surrounding waters over the Israel-Hamas war in Gaza.\nHouthi supporters attend a rally against the US-led strikes on Yemen and Israel’s war in Gaza (Osamah Abdulrahman/AP)Despite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.", "location": "The Gulf of Aden", "classification": "security", "score": 0.9431920174469803, "event_breakdown": "Location: Gulf of Aden\nHouthi rebels in Yemen attacked a commercial ship, the True Confidence, in the Gulf of Aden. The attack involved bomb-carrying drones."}, {"id": "7f43c807-87eb-40eb-84e2-dedcace80d1e", "title": "Israeli airbase comes under drone attack by Iraq Islamic Resistance forces", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-presstv08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli airbase comes under drone attack by Iraq's Islamic Resistance forcesIran Press TVFriday, 14 June 2024 6:12 AMAn airbase in the northern part of the Israeli-occupied territories has come under a drone strike by Iraqi anti-terror resistance groups.\nThe Islamic Resistance in Iraq, an umbrella group of anti-terror fighters, claimed responsibility for the aerial attack on Ramat David Airbase, located 20 kilometers (12.4 miles) southeast of Haifa, in a statement published on its Telegram channel on Friday morning.\nThe coalition noted that it will continue to target and destroy important installations across the occupied lands.\nThe development came two days after fighters from Iraqi anti-terror resistance groups carried out an operation against a \"vital\" target in the Port of Eilat.\nThe Islamic Resistance in Iraq has been launching several attacks on Israeli targets ever since the occupying regime started its genocidal war on Gaza in early October.", "location": "Ramat David Airbase", "classification": "security", "score": 0.9760021655816004, "event_breakdown": "Israeli airbase comes under drone attack by Iraq's Islamic Resistance forces - An airbase in the northern part of the Israeli-occupied territories has come under a drone strike by Iraqi anti-terror resistance groups."}, {"id": "dc106bae-186f-4388-932a-7acfb2f2daac", "title": "Gaza bombed as fallout brings surging tensions to Lebanon , Yemen", "date": "2024-06-15 12:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/gaza-bombed-as-fallout-brings-surging-tensions-to-lebanon-yemen/articleshow/111019980.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Ceasefire plan'Close to impossible'US sanctionsIsrael bombed and shelled Gaza on Saturday, witnesses and first responders said, with fallout from the war bringing a resurgence of tensions to the Lebanon border and Yemen.In the ninth month of war between Palestinian Hamas militants and Israeli forces, the Civil Defence agency in Gaza City, in the territory's north, reported 10 bodies recovered from Israeli strikes on three separate homes.In Rafah, in Gaza's far south near Egypt, witnesses reported clashes between militants and Israeli troops in the city's west, and artillery fire towards a refugee camp in the city centre.\nAFPTV images showed streets largely deserted.The United Nations says about one million people have been displaced from Rafah since early May, when Israel began ground operations in pursuit of Hamas militants.Israel's military has also been operating in central Gaza, where on Friday at a hospital in Deir al-Balah city a middle-aged man wept over the body of a younger man.\nBlood soaked through a white cloth around his neck.The war began after Hamas's unprecedented October 7 attack on southern Israel, which resulted in the deaths of 1,194 people, mostly civilians, according to an tally based on Israeli official figures.The militants also seized 251 hostages.\n\"Individuals from Tzav 9 have repeatedly sought to thwart the delivery of humanitarian aid to Gaza, including by blockading roads, sometimes violently,\" the US State Department said.\n\"They also have damaged aid trucks and dumped life-saving humanitarian aid onto the road.", "location": "GAZA CITY", "classification": "security", "score": 0.8568141915355226, "event_breakdown": "Ceasefire plan 'Close to impossible'\nUS sanctions\nIsrael bombed and shelled Gaza on Saturday, witnesses and first responders said, with fallout from the war bringing a resurgence of tensions to the Lebanon border and Yemen.\nIn the ninth month of war between Palestinian Hamas militants and Israeli forces, the Civil Defence agency in Gaza City, in the territory's north, reported 10 bodies recovered from Israeli strikes on three separate homes.\nIn Rafah, in Gaza's far south near Egypt, witnesses reported clashes between militants and Israeli troops in the city's west, and artillery fire towards a refugee camp in the city centre.\nAFPTV images showed streets largely deserted.\nThe United Nations says about one million people have been displaced from Rafah since early May, when Israel began ground operations in pursuit of Hamas militants.\nIsrael's military has also been operating in central Gaza, where on Friday at a hospital in Deir al-Balah city a middle-aged man wept over the body of a younger man.\nBlood soaked through a white cloth around his neck.\nThe war began after Hamas's unprecedented October 7 attack on southern Israel, which resulted in the deaths of 1,194 people, mostly civilians, according to an tally based on Israeli official figures.\nThe militants also seized 251 hostages.\n\"Individuals from Tzav 9 have repeatedly sought to thwart the delivery of humanitarian aid to Gaza, including by blockading roads, sometimes violently,\" the US State Department said."}, {"id": "d34418d5-2d55-4ea9-b85a-d014c59c9681", "title": "Gaza awaits aid as Israel tells troops to  be ready  for ground invasion", "date": "2024-06-15 06:15", "url": "http://www.myanmarmuslim.net/news/20240615248b599746.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "President Joe Biden and other US officials have already said that US intelligence officials believed the explosion was not caused by an Israeli air strike.\nThe Israeli military has relentlessly attacked Gaza in retaliation for a devastating Hamas rampage in southern Israel almost two weeks ago.\nEven after Israel told Palestinians to evacuate the north of Gaza and flee south, strikes extended across the territory, heightening fears among the territory’s two million people that nowhere was safe.\nPalestinian militants fired rockets into Israel on Thursday from Gaza and Lebanon, and tensions flared in the Israeli-occupied West Bank.\nRockets are fired from the Gaza Strip towards Israel over destroyed buildings following Israeli air strikes on Gaza City, central Gaza Strip (Mohammed Dahman/AP)A UN flag will be raised on both sides of the crossing as a sign of protection against air strikes, they said.", "location": "GAZA", "classification": "security", "score": 0.8867010284746482, "event_breakdown": "Israeli air strikes on Gaza Strip\nPalestinian militants fired rockets from Gaza into Israel"}, {"id": "1e03b2f3-5aec-49a1-8c4b-05a247d0c91c", "title": "White Supremacist Charged with Planning Mass Shooting at Bad Bunny Concert to Spark Race War", "date": "2024-06-15 01:15", "url": "https://ohnotheydidnt.livejournal.com/128615972.html", "domain": "ohnotheydidnt.livejournal.com", "domain_classification": "Unknown", "message": "The federal government reveals that a mass shooter targeted a Bad Bunny concert in Atlanta.\nThe FBI arrested Prieto last month after months of surveillance, following a tip-off from an informant who claimed Prieto endorsed the idea of a mass shooting targeting Black people, Jews, and Muslims.\nAccording to authorities, Prieto aimed to stage a mass shooting at a Bad Bunny concert in Atlanta to incite a race war ahead of this year’s presidential election.\nPrieto allegedly recruited the informant and an undercover FBI agent to assist in the attack, planning to leave Confederate flags at the scene.\nThe FBI arrested Prieto on May 14, the date of the first Bad Bunny concert, during which he admitted to discussing attack plans but denied intending to carry them out.", "location": "ATLANTA", "classification": "security", "score": 0.5875454940619137, "event_breakdown": "Mass Shooting Target Bad Bunny Concert"}, {"id": "f89644ff-6e53-44e5-af4d-25e9c6d1b966", "title": "RSF Darfur commander killed in El Fasher", "date": "2024-06-15 10:45", "url": "https://www.radiotamazuj.org/en/news/article/rsf-darfur-commander-killed-in-el-fasher", "domain": "radiotamazuj.org", "domain_classification": "Unknown", "message": "A senior commander for the paramilitary Rapid Support Forces (RSF) has been killed during a battle around El Fasher, the capital of North Darfur State, the Sudanese Armed Forces (SAF) said Friday.\nAli Yagoub Gibril, who was under U.S. sanctions, was killed during fierce fighting between his forces and the joint forces south of the city.\nMini Minawi, governor of the Darfur region, wrote a post on X (formerly Twitter): “Farewell, commander of the El Fasher inferno.”There was no immediate comment from the RSF.\nWar erupted in Sudan in April last year between the Sudanese army and the paramilitary Rapid Support Forces (RSF).\nOn Thursday, the United Nations Security Council adopted a resolution demanding that the Rapid Support Forces (RSF) halt its siege of El-Fasher.", "location": "El Fasher", "classification": "security", "score": 0.5961675513099699, "event_breakdown": "OK. Here is the list:\nAli Yagoub Gibril, senior commander for the paramilitary Rapid Support Forces (RSF), was killed during a battle around El Fasher, the capital of North Darfur State, the Sudanese Armed Forces (SAF) said Friday."}, {"id": "f482989e-2d33-4973-84b5-c01419b8cc42", "title": "  Far too many  Palestinians have died during Israel operations in Gaza – Blinken", "date": "2024-06-15 12:45", "url": "http://www.myanmarmuslim.net/news/20240615709b599286.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US secretary of state Antony Blinken says “far too many” Palestinians have died and more needs to be done to save lives and get aid where it is most needed.\nMr Blinken said in New Delhi on Friday that the US “appreciates” Israel’s steps to minimise civilian casualties but that is not enough.\nSmoke rises following an Israeli airstrike in the Gaza Strip (AP Photo/Leo Correa)The number of Palestinians killed in the war has risen to more than 11,000, including more than 4,400 children, the Hamas-run Health Ministry in Gaza said on Friday.\nIn the occupied West Bank, more than 160 Palestinians have been killed in the violence and Israeli raids.\nMore than 1,400 people in Israel have been killed, most of them in the Hamas attack, and about 240 hostages were taken from Israel into Gaza by the militant group.", "location": "GAZA", "classification": "security", "score": 0.7942824137964601, "event_breakdown": "US secretary of state Antony Blinken says \"far too many\" Palestinians have died and more needs to be done to save lives and get aid where it is most needed.\nMr Blinken said in New Delhi on Friday that the US \"appreciates\" Israel's steps to minimise civilian casualties but that is not enough.\nIn the occupied West Bank, more than 160 Palestinians have been killed in the violence and Israeli raids.\nMore than 1,400 people in Israel have been killed, most of them in the Hamas attack, and about 240 hostages were taken from Israel into Gaza by the militant group."}, {"id": "34146470-3246-45e2-bdbe-e85410898690", "title": "Sudan : A Senior RSF Commander Killed in North Darfur", "date": "2024-06-15 01:15", "url": "https://allafrica.com/stories/202406140782.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "The commander of Rapid Support Operations in the Darfur region of western Sudan, General Ali Yaqoub Jibril, was killed in battles that took place between his forces and the army and joint forces today, Friday, near the city of El Fasher.\nYacoub had led the Rapid Support Forces (RSF) operations in Darfur, including the siege of El Fasher City in North Darfur State, for over a month.\nEyewitnesses said that the army and joint forces chased the RSF outside El Fasher after they were able to repel a massive attack on the city.\nThe joint forces of the armed groups allied to the army since April claimed they were \"able to eliminate more than 1,000 RSF soldiers\" in today's battle.\nClashes have been taking place for days in large areas in North Darfur, including the Amber Valley area in North Darfur State.", "location": "Darfur", "classification": "security", "score": 0.946898149248041, "event_breakdown": "reported that the commander of Rapid Support Operations in the Darfur region of western Sudan, General Ali Yaqoub Jibril, was killed in battles that took place between the Rapid Support Forces (RSF) and the army and joint forces today, Friday, near the city of El Fasher.\n\nAli Yaqub had led the RSF operations in Darfur, including the attack on El Fasher in April, for over a month.\n\nClashes have been happening for days in large areas in North Darfur, including the Amber Valley area. According to local newspapers in El Fasher, the joint forces of armed groups allied to the army since April claimed they were able to eliminate more than 1,000 RSF soldiers in today's battle."}, {"id": "3301e268-a1c4-41e6-9409-2e25218ad4b4", "title": "Heated auction in Maiden Gully ends with nanna house selling | Bendigo Advertiser", "date": "2024-06-15 07:45", "url": "https://www.bendigoadvertiser.com.au/story/8663670/heated-auction-in-maiden-gully-ends-with-nannas-house-selling/?cs=3355", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"She was just happy for me to do whatever I needed to do [with the property],\" Chloe said moments after a drawn out auction battle between at least three bidders had finished.", "location": "SYDNEY", "classification": "security", "score": 0.787671416039108, "event_breakdown": "Chloe's statement suggests that she was describing a recent event that she could have witnessed herself, but it doesn't provide enough information to identify any specific current events of security. The statement doesn't include any location information or references to specific events, so I can't provide any current event reports based on this text."}, {"id": "492e6b1a-c5fd-4c1d-bda5-450b775a29c6", "title": "Secretary of Defense Lloyd J . Austin III Press Conference Following NATO Ministers of Defense Meeting in Brussels , Belgium", "date": "2024-06-15 09:45", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240614-dod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "June 14, 2024TranscriptSecretary of Defense Lloyd J. Austin III Press Conference Following NATO Ministers of Defense Meeting in Brussels, BelgiumSecretary of Defense Lloyd J. Austin IIISTAFF: Well, good afternoon, ladies and gentlemen.\nIt is my pleasure to introduce Secretary of Defense Lloyd Austin, III.\nAnd finally, we reaffirmed yesterday in the NATO Ukraine Council our enduring commitment to a free and sovereign Ukraine.\nQ: Mr. Secretary, as you mentioned, since Russia's full scale invasion of Ukraine, NATO has expanded to include two new member states.\nAnd I see -- I think NATO brings tremendous value to those efforts.", "location": "BRUSSELS, BELGIUM", "classification": "security", "score": 0.5468227886180455, "event_breakdown": "Target Event: Russia's invasion of Ukraine\nReported on: June 14, 2024\nReported by: Secretary of Defense Lloyd J. Austin III\nLocation: Brussels, Belgium"}, {"id": "0e0d8132-ebed-47ab-97a1-cbcc25efafef", "title": "Sympathy must come before ideology during war - The Jerusalem Post", "date": "2024-06-15 10:15", "url": "https://www.jpost.com/opinion/article-806078", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "By adding extra prohibitions, the nazir tilts the system toward excessive abstinence, threatening to upset our divinely ordained religious equilibrium.\nIf we don’t finish this just and moral war, these maniacs will regroup, re-entrench themselves, and recover their capacity to attack us.\nThe clock is ticking, and each day that passes subjects the hostages to extra suffering and decreasing their chance of survival.\nMany are pondering the larger questions surrounding the war: How is this war a struggle over the image of God in our world?\nFamilies of hostages, families of fallen soldiers, displaced families, people traumatized by being caught in the Oct. 7 attack – these groups are the primary victims of our national trauma.", "location": "Iraq", "classification": "security", "score": 0.7589579515235001, "event_breakdown": "Oct. 7 attack - date\nJerusalem - location\nTerror attack - What happened\nIsrael - affected nation"}, {"id": "ac04f8cf-9e00-421b-ac06-30c1e99611e2", "title": "3rd annual racial healing event to take place next weekend", "date": "2024-06-15 14:15", "url": "https://www.dailypress.com/2024/06/15/3rd-annual-racial-healing-event-to-take-place-next-weekend/", "domain": "dailypress.com", "domain_classification": "Unknown", "message": "WILLIAMSBURG — Two people who claim family connections to Confederate Gen. Robert E. Lee will speak at the third annual Journey to Racial Healing ceremony next weekend.\nRobert W. Lee IV, a North Carolina pastor who describes himself as a collateral descendant of Robert E. Lee, according to a news release.\nThe ceremony’s other speaker is Tonia Cansler Merideth, who is a descendant of Gen. Lee’s great-great-grandmother, Judith Armistead.\n“The Journey to Racial Healing Ceremony is an opportunity for the community to meet people who are healing from family ties to slavery,” said Laura Hill, executive director of the Virginia Racial Healing Institute.\nThe event will include refreshments and an opportunity to view the Juneteenth Commemorative Art exhibit on display at the Stryker Center.", "location": "Based on the text, I couldn't find a specific location for the main event.", "classification": "security", "score": 0.42966015017012094, "event_breakdown": "WILLIAMSBURG — Two people who claim family connections to Confederate Gen. Robert E. Lee will speak at the third annual Journey to Racial Healing ceremony next weekend.\nThe event will include refreshments and an opportunity to view the Juneteenth Commemorative Art exhibit on display at the Stryker Center.The event was reported in the news release located here."}, {"id": "46fdee70-aefc-4827-91f0-5270316ab2a2", "title": "Some animals from a Gaza zoo are now displaced along with their owner", "date": "2024-06-15 12:30", "url": "https://health.wusf.usf.edu/npr-health/2024-06-15/some-animals-from-a-gaza-zoo-are-now-displaced-along-with-their-owner", "domain": "health.wusf.usf.edu", "domain_classification": "Unknown", "message": "Fathi Jumaa, 60, owner of the Rafah Zoo, drove dozens of caged animals with him on his escape to Khan Younis, another city in Gaza already pummeled in the war.\nAt the time, Four Paws had dubbed his facility “the zoo of sorrows.”“He was not able to run the zoo,” Khalil says.\nIt paid the zoo owner for costs he had incurred while caring for the animals, and the owner signed an agreement not to reopen the Rafah Zoo, Khalil says.\nIn a statement to NPR, the military denied zoo animals had been treated by military veterinarians or had harmed soldiers in Gaza.\n“We share what we have to keep them alive.”Anas Baba reported from Khan Younis, Gaza Strip.", "location": "Gaza", "classification": "security", "score": 0.6181493180169024, "event_breakdown": "Event 1: Israeli military treating zoo animals in Gaza Strip\nThe Israeli military has been treating zoo animals in the Gaza Strip, according to a statement from the zoo owners."}]