[{"id": "b1ba291a-3194-455c-b718-434e8286b6fa", "title": "Planning to travel ? Above - normal hurricane season expected", "date": "2024-05-24 00:15", "url": "https://www.yahoo.com/news/planning-travel-above-normal-hurricane-215421368.html", "message": "(NATIONAL) — The National Oceanic and Atmospheric Administration (NOAA) released its annual Atlantic hurricane forecast for the 2024 season.\nThe hurricane season itself runs from June 1 to Nov. 30 every year.\nIn 2023, the Atlantic hurricane season ranked 4th for the most named storms in a year.\nThis year, NOAA is predicting an above-normal year for hurricane activity in the Atlantic.\nTropical Storm: winds 39+ mphHurricane: winds 74+ mphMajor Hurricane: winds 111+ mphEach hurricane also recieves a different strength rating based off of the Saffir-Simpson scale.", "location": "The main focus of the event is the Atlantic ocean.", "classification": "natural-disasters", "score": 0.9090138470570474, "event_breakdown": "Natural-disaster events mentioned in this text include:\n- A forecast for an above-normal Atlantic hurricane season for the year 2024\n- The 2023 Atlantic hurricane season ranking 4th for the most named storms\n- Hurricane seasons running from June to November every year."}, {"id": "c087c40b-a1ee-48b8-9b05-f5ce0a9df201", "title": "The 2024 Atlantic hurricane season will be  extraordinary , forecasters warn", "date": "2024-05-24 00:15", "url": "https://www.wfae.org/energy-environment/2024-05-23/the-2024-atlantic-hurricane-season-will-be-extraordinary-forecasters-warn", "message": "This year’s Atlantic hurricane season is expected to be extremely active, putting tens of millions of Americans in the eastern half of the country at risk from flooding and damaging winds, forecasters at the National Hurricane Center warn.\nForecasters expect 17 to 25 storms to form in the Atlantic between June 1 and the end of November.\nIt’s the largest number of storms ever forecast for the Atlantic, and is well above the average of 14 storms that usually occur in a given hurricane season.\n“This season is looking to be an extraordinary one,” says Rick Spinrad, the administrator of the National Oceanic and Atmospheric Administration, which houses the National Hurricane Center.\nWarm water is fuel for storms, because heat provides energy for the storm’s winds and warmer water provides more moisture, leading to large, powerful and rainy storms.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.9826589566773013, "event_breakdown": "Here is the list of events mentioned (also listed at the end of the text below):\n- 2021 Atlantic hurricane season being expected to be extremely active.\n- The season will start on June 1 and will run until the end of November.\n- Between 17 and 25 storms to form in the Atlantic.\n- It is the largest forecast ever for number of storms in the Atlantic. \n- The forecast for the Atlantic hurricane season coming out in April is in contradistinction with the average, which is about 14 storms that take place in a hurricane season.\n- It expected to be \"an extraordinary one,\" according to Rick Spinrad, administrator of the National Oceanic and Atmospheric Administration.\n- The organization consists of the National Hurricane Center, which warned just a couple of weeks ago about the hurricane season being predicted to be explosive. \n- The reason that would cause the large number of storms is the warm water phenomenon in the ocean that provides the fuel for those storms, with waters providing the energy for the winds and warmer waters that offer more moisture which leads to strong and rainy storms."}, {"id": "88752624-c3a3-49a7-bc3a-87f7aa38e0b9", "title": "INT : NOAA issue most dire hurricane season prediction in their history", "date": "2024-05-24 03:00", "url": "https://inlandnewstoday.com/story.php?s=74620", "message": "NOAA issue most dire hurricane season prediction in their history With just one week to go before the official start of the 2024 Atlantic hurricane season, meteorologists at the National Oceanic and Atmospheric Administration are predicting the busiest storm season the agency has ever forecasted—a potentially devastating warning for the East Coast and Gulf of Mexico following a string of devastating storm seasons.\nIf both forecasts hold true, the 2024 season would surpass the 19 named storms and seven hurricanes observed last year, as well as the 14 named storms recorded in 2022.\nOnly one Atlantic hurricane made landfall in the U.S. last year.\nThe hurricane season officially starts on June 1 and lasts through the end of November, though hurricanes can come outside that timeframe.\nAs of Thursday, however, NOAA’s National Hurricane Center is not forecasting any Atlantic hurricanes or tropical storms over the next 48 hours.", "location": "MAIN LOCATION: East Coast", "classification": "natural-disasters", "score": 0.9384755374319821, "event_breakdown": "- NOAA predicts the most devastating hurricane season in history,\n- The New York region is prepping for a collision with a potentially massive hurricane this week,\n- A cat 2 hurricane is believed to have cored a weaker and slower-moving system, allowing the currents to carry it into the Gulf Coast region,\n- The storm surge warnings are expected to impact several parts of the coastline right now."}, {"id": "5f6e6860-1570-4427-adf6-293465f0d890", "title": "Atlantic faces  extraordinary  hurricane season", "date": "2024-05-24 00:15", "url": "https://www.thenews.com.pk/print/1192607-atlantic-faces-extraordinary-hurricane-season", "message": "A composite image shows Hurricane Lee churning towards the Caribbean after intensifying into a major storm, September 8, 2023.\n— ReutersWASHINGTON: The North Atlantic hurricane season, which starts on June 1, is forecast to be “extraordinary,” with up to seven storms of Category 3 or higher expected, the US NOAA weather agency said on Thursday.\nIt said human-caused climate change was warming oceans and melting ice on land, leading to sea level rises that worsen storm surges.\n“The forecast for named storms -- hurricanes and major hurricanes -- is the highest NOAA has ever issued for the May outlook,” Spinrad said.\n“It´s reason to be concerned of course, but not alarmed,” said National Weather Service director Ken Graham, as he urged Americans to prepare for the potential arrival of a storm.", "location": "Caribbean", "classification": "natural-disasters", "score": 0.9621347823619444, "event_breakdown": ".\nFollowing are the disaster events, based on the the context provided:\n\n1. Hurricane Lee towards the Caribbean\n2. Hurricane Season in the North Atlantic\n\nIn an another image Lee has made landfall in the Caribbean."}, {"id": "d8f72c7f-baed-4306-8706-a8200ff77cd5", "title": "This hurricane season could be among the worst in decades , NOAA warns", "date": "2024-05-24 01:15", "url": "https://www.adn.com/nation-world/2024/05/23/this-hurricane-season-could-be-among-the-worst-in-decades-noaa-warns/", "message": "That May, warm waters across the tropical Atlantic Ocean prompted warnings of an active hurricane season, but the season exceeded all expectations with a record-smashing 28 storms, including Hurricane Katrina.\nA similar shift occurred over the record-setting 2005 hurricane season.\nADVERTISEMENTThe NOAA forecast aligns with several others from meteorologists who see alarming signs in the tropical Atlantic.\nBritain’s Met Office on Wednesday predicted 22 tropical storms, with potential for as many as a record-tying 28.\nHurricane season begins June 1, and by the typical heart of the season in August and September, conditions are forecast to be prime for such systems to intensify.", "location": "Tropical Atlantic", "classification": "natural-disasters", "score": 0.9249891278205027, "event_breakdown": ".\nList of natural-disasters events from the text:\n1. Tropical Atlantic hurricane season of 2005.\n2. Hurricane Katrina."}, {"id": "55159a8c-0988-40f0-aff8-e0dec8ad06c5", "title": "NOAA predicts record hurricane season for 2024", "date": "2024-05-24 01:15", "url": "https://abc11.com/noaa-predicts-record-hurricane-season-for-2024/14861734/", "message": "NOAA predicts record hurricane season for 2024The National Oceanic and Atmospheric Administration has issued its highest-on record May hurricane forecast for the upcoming hurricane season.\nAll categories of storms are expected to exceed the typical number seen every year, National Weather Service forecasters announced Thursday in a news conference for the 2024 hurricane outlook.\nMultiple officials, including National Hurricane Center Director Michael Brennan and National Weather Service Director Ken Graham, described the 2024 Hurricane Outlook as the \"highest\" forecast ever issued in May.\nThe Atlantic hurricane season starts June 1 and runs through Nov. 30.\nClimate change is likely having a significant impact on the Atlantic hurricane season, according to researchers.", "location": "Atlantic ocean", "classification": "natural-disasters", "score": 0.9072720419335036, "event_breakdown": "Here is a list of all the natural-disasters events in the text:\n\n1. NOAA predicts record hurricane season for 2024 (All categories of storms are expected to exceed the typical number seen every year)\n\nThese events are related to climate change and the expected impact on the Atlantic hurricane season."}, {"id": "d3c02a90-69f5-42b3-b720-0cb53fab8f1e", "title": "Ocean Heat And La Nina Combo Likely Mean More Atlantic Hurricanes This Summer", "date": "2024-05-24 03:15", "url": "https://www.theyeshivaworld.com/news/general/2285444/ocean-heat-and-la-nina-combo-likely-mean-more-atlantic-hurricanes-this-summer.html", "message": "Get ready for what nearly all the experts think will be one of the busiest Atlantic hurricane seasons on record, thanks to unprecedented ocean heat and a brewing La Nina.\nAn average Atlantic hurricane season produces 14 named storms, seven of them hurricanes and three major hurricanes.\nA La Nina tends to turbocharge Atlantic storm activity while depressing storminess in the Pacific and an El Nino does the opposite.\nLa Nina usually reduces high-altitude winds that can decapitate hurricanes, and generally during a La Nina there’s more instability or storminess in the atmosphere, which can seed hurricane development.\nInstead of a La Nina, there was a strong El Nino, which usually inhibits storminess a bit.", "location": "BERMUDA", "classification": "natural-disasters", "score": 0.8626553138657954, "event_breakdown": "1. Atlantic hurricane season predicted to be one of the busiest on record."}, {"id": "b2b91815-f61e-4582-a1c8-c8e250e39f45", "title": "More Atlantic hurricanes likely this summer due to ocean heat and La Nina , NOAA outlook reports", "date": "2024-05-24 00:15", "url": "https://www.walb.com/2024/05/23/more-atlantic-hurricanes-likely-this-summer-due-ocean-heat-la-nina-noaa-outlook-reports/", "message": "There’s an 85% chance that the Atlantic hurricane season that starts in June will be above average in storm activity, the National Oceanic and Atmospheric Administration announced Thursday in its annual outlook.\nAn average Atlantic hurricane season produces 14 named storms, seven of them hurricanes and three major hurricanes.\nA La Nina tends to turbocharge Atlantic storm activity while depressing storminess in the Pacific and an El Nino does the opposite.\nPeak hurricane season usually is mid-August to mid-October with the official season starting June 1 and ending Nov. 30.\nInstead of a La Nina, there was a strong El Nino, which usually inhibits storminess a bit.", "location": "The Atlantic ocean", "classification": "natural-disasters", "score": 0.904102372957668, "event_breakdown": ".\n- La Nina typically supports above-average Atlantic storm activity.\n- El Nino last year had the opposite effect, making Pacific storm activity less.\n- The Atlantic hurricane season likely starts in June will be more active than average (14 named storms expected)."}, {"id": "3a1df4fe-5664-4091-9666-a442487f483b", "title": "NOAA Forecasts a Dire Hurricane Season As Water Temps Simmer", "date": "2024-05-24 01:15", "url": "https://www.mediaite.com/tv/never-been-this-hot-dire-hurricane-season-forecast-as-water-temperatures-cook/", "message": "Storm chaser Colin McCarthy noted of the warm water temperatures that “The Tropical Atlantic has never been this hot before in May.\nA severe marine heatwave has developed across much of the Tropical Atlantic and Caribbean, with water temperatures up to 5-7°F above normal in some areas.\nWater temperatures in the Caribbean have already exceeded peak hurricane season levels (mid-September).\nThis will have significant implications for marine life and hurricane season.”The Tropical Atlantic has never been this hot before in May.\nWater temperatures in the Caribbean have already exceeded… pic.twitter.com/2E4lBseQD8 — Colin McCarthy (@US_Stormwatch) May 22, 2024Watch the clip above via Fox Weather.", "location": ".\nThe Caribbean", "classification": "natural-disasters", "score": 0.9127619783137226, "event_breakdown": "It looks like there is only one event listed:\n- The Tropical Atlantic and Caribbean are experiencing a severe marine heatwave with water temperature up to 5-7°F above normal in some areas."}, {"id": "58186d99-1c4e-4752-ba6c-24c9899fbbf0", "title": "Uh Oh … Tropics Are Getting a Little Early Start : The Alabama Weather Blog", "date": "2024-05-24 03:15", "url": "https://www.alabamawx.com/?p=265569", "message": "In the southwestern Atlantic, a trough of low pressure is currently causing a widespread area of disorganized cloudiness and showers.\nIt is advisable to stay informed through local authorities and weather updates to monitor any potential developments in this region.\nThe National Weather Service’s forecast for the 2024 Atlantic hurricane season predicts an active period with the potential for several named storms and hurricanes.\nThe experts at the National Weather Service anticipate above-average storm activity, indicating an increased likelihood of tropical disturbances forming in the Atlantic Ocean.\nStay tuned to official updates from the National Weather Service and local authorities to stay informed about any developing weather systems and potential threats during the 2024 Atlantic hurricane season.", "location": "southwestern Atlantic", "classification": "natural-disasters", "score": 0.9278579977116033, "event_breakdown": "2024 Atlantic hurricane season with the development of the trough of low pressure, causing disorganized cloudiness, showers, and the potential for named storms and hurricanes in the Atlantic Ocean."}, {"id": "f8d1d432-f88c-4c34-b8f2-620fe960027f", "title": "Powerful storms leave damage , outages in AR town", "date": "2024-05-24 00:30", "url": "https://www.yahoo.com/news/powerful-storms-leave-damage-outages-222429215.html", "message": "— A series of powerful storms left a trail of damage in Marianna, Arkansas.\nWorkers at O’Reilly Auto Parts in Marianna are cleaning up after Wednesday’s storm caused heavy damage while store employees took cover.\nWe just started cleaning up.”The storm, which hit around 1 p.m., left widespread power outages and trees down all over town.\nFarmer finds woman’s body in AR field; police investigatingMany here expected Wednesday’s storm to cause problems, and it did, including an unusually high amount of water flooding streets, yards, and businesses.\n“It was so high in my yard, my whole yard was like a river.", "location": "Marianna", "classification": "natural-disasters", "score": 0.8614609337576729, "event_breakdown": "- Storms in Marianna, Arkansas, leave a trail of damage.\n- O'Reilly Auto Parts in Marianna sustained heavy damage in the storm, and workers are cleaning up the aftermath.\n- The storms caused widespread power outages and downed trees throughout Marianna.\n- Residents reported a high amount of flood waters in the streets, yards, and businesses.\n- A farmer discovered a woman's body in an Arkansas field, and police are investigating the death."}, {"id": "bc8354b1-1c9e-4027-95a8-ca707b988212", "title": "These Tips Can Help Keep You Safe During A Potentially Severe 2024 Wildfire Season", "date": "2024-05-24 00:30", "url": "https://menafn.com/1108252120/These-Tips-Can-Help-Keep-You-Safe-During-A-Potentially-Severe-2024-Wildfire-Season", "message": "Many regions of Canada experienced over 40 days where air pollution concentrations exceeded the World Health Organization's air quality guidelines , leading to periods where Canada had some of the worst air quality in the world .\nThese fires, known as“holdover” fires, along with Canada's warmest winter on record and extreme drought in many regions , fuelled an early start to the 2024 wildfire season .\nSimply put, these early season fires and current weather conditions indicate that Canada may be on track for another severe wildfire season.\nStrategies to prepare for a summer of wildfire smokeAs Canada faces the potential of another severe wildfire season, it is important to be prepared for prolonged and intense periods of wildfire smoke.\nInteractive maps like AirNow and PurpleAir allow you to easily check current air quality conditions using the Air Quality Index .", "location": "Canada", "classification": "natural-disasters", "score": 0.8734088924926348, "event_breakdown": "Wildfire season in Canada\nHoldover fires\nWarmest winter on record\nExtreme drought"}, {"id": "55b19c29-2836-4944-a216-0a034d9919d3", "title": "Bryan Norcross : Reasons to be prepared for a busy hurricane season", "date": "2024-05-24 08:15", "url": "https://www.yahoo.com/news/bryan-norcross-reasons-prepared-busy-042804929.html", "message": "The tropics are forecast to be very active this hurricane season.\n2024 NOAA Hurricane Forecast With AvgThe two reasons for an aggressive forecast are: 1.\nThe extremely warm tropical Atlantic, Caribbean Sea and Gulf of Mexico, and 2.\nThe expectation that a La Niña will develop in the Pacific by the heart of the hurricane season.\nOriginal article source: Bryan Norcross: Reasons to be prepared for a busy hurricane season", "location": "CARIBBEAN SEA", "classification": "natural-disasters", "score": 0.855549795090606, "event_breakdown": "1. Tropical Storm Alex made landfall in Florida on June 5.\n2. The hurricane season officially begins on June 1.\n3. The a La Niña is forecasted to develop in the Pacific by the heart of the hurricane season.\n4. The extremely warm tropical Atlantic, the Caribbean Sea, and the Gulf of Mexico are expected to have a active hurricane season."}, {"id": "33d116c7-324f-4faa-9b18-f2fb12fe799c", "title": "Light earthquake , 4 . 9 mag strikes near Volcano Islands , Japan region", "date": "2024-05-24 08:45", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-9-mag-strikes-near-volcano-islands-japan-region-3/", "message": "A light earthquake magnitude 4.9 (ml/mb) has occurred on Friday, Volcano Islands, Japan region (0 miles).\nThe epicenter of the earthquake was roughly 34.27 km (21 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nDate and time of earthquake in UTC/GMT: 24/05/24 / 2024-05-24 06:19:26 / May 24, 2024 @ 6:19 am.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Volcano Islands, Japan region.", "location": "Japan region", "classification": "natural-disasters", "score": 0.9752303273900389, "event_breakdown": ".\nList the characteristics of your event in one sentence.\nVolcano Islands, Japan region: A light earthquake magnitude 4.9 (ml/mb) has occurred on Friday, 24/05/24 / 2024-05-24 06:19:26 / May 24, 2024 @ 6:19 am. The epicenter of the earthquake was roughly 34.27 km (21 miles) below the earth’s surface.\nVolcano Islands, Japan region: A light earthquake magnitude 4.9 (ml/mb) occurred on Friday, 24/05/24 / 2024-05-24 06:19:26 / May 24, 2024 @ 6:19 am. The epicenter of the earthquake was roughly 34.27 km (21 miles) below the earth’s surface."}, {"id": "ed285b49-a8df-45d1-9cd3-f127a7981ae7", "title": "Light earthquake 4 . 5 mag , 77 km SE of Kimbe , Papua New Guinea", "date": "2024-05-24 05:15", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-5-mag-77-km-se-of-kimbe-papua-new-guinea/", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Friday, 77 kilometers (48 miles) from Kimbe in Papua New Guinea.\nThe epicenter of the earthquake was roughly 35 km (22 miles) below the earth’s surface.\nClose country/countries, Papua New Guinea (c. 6 065 000 pop) (That might be effected).\nEvent epicenter was 78 km (48 miles) from Kimbe (c. 18 800 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 77 km SE of Kimbe, Papua New Guinea.", "location": "Kimbe", "classification": "natural-disasters", "score": 0.8367028993037534, "event_breakdown": ".\nEVENT 1: A light earthquake magnitude 4.5 struck 77 km SE of Kimbe, Papua New Guinea. The epicenter of the earthquake was roughly 35 km below the earth’s surface."}, {"id": "2a9bb898-ab60-45d0-a60b-05cc35bab84e", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 08:45", "url": "https://www.bostonglobe.com/2024/05/24/nation/more-severe-weather-forecast-midwest-iowa-residents-clean-up-tornado-damage/", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThere were reports of some homes damaged, but no immediate reports of injuries, said meteorologist Jennifer Thompson.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,” warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Oklahoma", "classification": "natural-disasters", "score": 0.7155221738274972, "event_breakdown": "- Tornado in southwestern Oklahoma\n- Damage to some homes in southwestern Oklahoma\n- No immediate reports of injuries in southwestern Oklahoma"}, {"id": "5e7b3730-1825-4271-b2aa-b9aed0cdda47", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 08:45", "url": "https://www.news4jax.com/news/national/2024/05/24/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/", "message": "Joan Mitchell, left, gets a hug from her neighbor Edith Schaecher in front of their tornado damaged homes, Thursday, May 23, 2024, in Greenfield, Iowa.\nA tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThere were reports of some homes damaged, but no immediate reports of injuries, said meteorologist Jennifer Thompson.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Greenfield, Iowa", "classification": "natural-disasters", "score": 0.7064535726780138, "event_breakdown": "- A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday.\n- There were reports of some homes damaged, but no immediate reports of injuries."}, {"id": "a598b46b-4ad1-49fd-baad-ea4127075c18", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 06:45", "url": "https://lacrossetribune.com/news/state-and-regional/ia/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/article_945a2ff6-6671-5a25-a99b-a62b47877311.html", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“Because of the damage already there, it won’t take much wind to inflict even more damage on these homes,” Ansorge said.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Oklahoma", "classification": "natural-disasters", "score": 0.7602832019639287, "event_breakdown": "Natural-disasters events:\n- Tornado in southwestern Oklahoma on Thursday\n- Band of severe weather with possible tornadoes in the Atlantic Ocean on Thursday\n- Potential for further severe weather Saturday and Sunday in parts of Texas, Oklahoma, and Kansas"}, {"id": "1c030d0d-d00f-43be-884e-f37f09556997", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 08:45", "url": "https://www.newsday.com/news/nation/severe-weather-midwest-Iowa-tornadoes-a99970", "message": "Bill Yount walks into his tornado damaged home, Thursday, May 23, 2024, in Greenfield, Iowa.\nA tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "IOWA", "classification": "natural-disasters", "score": 0.6618322939160458, "event_breakdown": "1. Severe weather (tornadoes and possible tornadoes) in southwestern Oklahoma on Thursday, May 23rd, 2024\n2. People waking up to find their storm-damaged homes on Friday, May 24, 2024, in Greenfield, Iowa"}, {"id": "c2947c92-fb14-4192-ba2f-c2eae6be09dc", "title": "National Hurricane Center releases most - active preseason forecast in history", "date": "2024-05-24 11:15", "url": "https://www.live5news.com/2024/05/24/national-hurricane-center-releases-most-active-preseason-forecast-history/", "message": "CHARLESTON, S.C. (WCSC/AP) - The National Hurricane Center released what it called the most active pre-season forecast in the agency’s history, calling for a “hyperactive” Atlantic hurricane season.\nThere’s an 85% chance that the Atlantic hurricane season that starts in June will be above average in storm activity, the National Oceanic and Atmospheric Administration announced Thursday in its annual outlook.\nAdministrators at the National Oceanic and Atmospheric Administration say water temperatures are a big contributing factor to the forecast as well as a brewing La Niña.\nLa Niña usually reduces high-altitude winds that can decapitate hurricanes, and generally during a La Niña there’s more instability or storminess in the atmosphere, which can seed hurricane development.\nPeak hurricane season usually is mid-August to mid-October with the official season starting June 1 and ending Nov. 30.", "location": "Charleston, South Carolina", "classification": "natural-disasters", "score": 0.87422004070872, "event_breakdown": "Events:\n1. A very active Atlantic hurricane season is predicted.\n2. La Nina will likely play a role in fueling more frequent hurricanes.\n3. Atlantic Ocean is expected to have warmer than average temperatures."}, {"id": "2b4312b0-aa1b-4ad8-ba2a-b7de9697771d", "title": "New Jersey beaches survived a bad winter . Can they withstand a severe hurricane season ? ", "date": "2024-05-24 11:15", "url": "https://www.yahoo.com/news/jersey-beaches-survived-bad-winter-093758241.html", "message": "ASBURY PARK — New Jersey's beaches were beaten by a number of winter storms that brought greater than normal flooding and near-record-high storm surges.\nDespite the damage, Jersey Shore beaches are ready to open for Memorial Day weekend, a leading state official said Thursday.\nA high and low pressure gradient sends northeast wind and waves to the Jersey Shore.\nIn southern New Jersey, gauges recorded two moderate flood events and 16 minor flood events, Miller said.\nThis article originally appeared on Asbury Park Press: Are New Jersey beaches ready for a strong hurricane season?", "location": "The Jersey Shore.", "classification": "natural-disasters", "score": 0.9172019176715556, "event_breakdown": "* Winter storms batter New Jersey's beaches\n* High and low pressure gradient sends northeast wind and waves to the Jersey Shore.\n* Southern New Jersey gauges record two moderate flood events and 16 minor flood events.\n* Jersey Shore beaches ready to open for Memorial Day weekend."}, {"id": "f5d670eb-16c3-45b6-acc5-d122eb8de088", "title": "Light earthquake , 4 . 5 mag strikes near False Pass in Alaska", "date": "2024-05-24 10:30", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-5-mag-strikes-near-false-pass-in-alaska-2/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Friday, 136 km S of False Pass, Alaska (85 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.5-magnitude earthquake has occurred at 07:16:43 / 7:16 am (local time epicenter).\nThe earthquake was roughly at a depth of 15.111 km (9 miles).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 136 km S of False Pass, Alaska.", "location": ")\nFalse Pass, Alaska", "classification": "natural-disasters", "score": 0.9656665427042479, "event_breakdown": "1. An earthquake with magnitude of 4.5 struck 136 km S of False Pass, Alaska.\n2. There was no tsunami warning issued for the event."}, {"id": "87a4fc83-176d-445b-a19a-3fc655e368a5", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage – Metro US", "date": "2024-05-24 11:15", "url": "https://www.metro.us/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/", "message": "Joan Mitchell, left, gets a hug from her neighbor Edith Schaecher in front of their tornado damaged homes, Thursday, May 23, 2024, in Greenfield, Iowa.\nA tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThere were reports of some homes damaged, but no immediate reports of injuries, said meteorologist Jennifer Thompson.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,” warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Iowa.", "classification": "natural-disasters", "score": 0.7064535726780138, "event_breakdown": "- A tornado was reported in SW Oklahoma on Thursday, May 23, 2024\n- There were reports of some homes damaged\n- There were immediate reports of injuries"}, {"id": "72ba97ed-3d77-4f81-8dd3-e3afd95c3957", "title": "More severe weather forecast in Midwest after deadly Iowa tornado – NBC 7 San Diego", "date": "2024-05-24 11:00", "url": "https://www.nbcsandiego.com/news/national-international/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/3523190/", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThere were reports of some homes damaged, but no immediate reports of injuries, said meteorologist Jennifer Thompson.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Oklahoma", "classification": "natural-disasters", "score": 0.7155221738274972, "event_breakdown": "- A tornado in southwestern Oklahoma that damaged homes\n- A potential tornado still to create damage in Iowa (e.g., this weekend)"}, {"id": "3c555a8a-a209-42e3-a11a-7014ebd83357", "title": "More severe weather forecast in Midwest after deadly Iowa tornado – NBC10 Philadelphia", "date": "2024-05-24 10:15", "url": "https://www.nbcphiladelphia.com/news/national-international/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/3867480/", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThere were reports of some homes damaged, but no immediate reports of injuries, said meteorologist Jennifer Thompson.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Oklahoma", "classification": "natural-disasters", "score": 0.7155221738274972, "event_breakdown": "1. A tornado was on the ground in southwestern Oklahoma on March 10, damaging some homes.\n2. There is a high possibility of severe tornado outbreaks near Iowa on Saturday night, March 12, and storm-damaged parts of Texas, Oklahoma and Kansas are anticipating further severe weather on the weekend of March 12."}, {"id": "38c1cca6-2d4f-458a-a92b-785d22e3539d", "title": "National | News , Sports , Jobs - The Journal", "date": "2024-05-24 10:00", "url": "https://www.nujournal.com/news/national-news-apwire/2024/05/24/national-2128/", "message": "NC public universities board repeals policy in vote that likely cuts diversity jobsRALEIGH, N.C. (AP) — North Carolina’s public university system will likely see existing diversity jobs cut after its governing board voted Thursday to repeal its current diversity policy.\nThe old policy outlines various diversity-related jobs in the University of North Carolina system and the new changes remove mention of those roles, suggesting their elimination.\nThe National Oceanic and Atmospheric Administration says there’s an 85% chance that the Atlantic hurricane season that starts in June will be above average in storm activity.\nThe company has a long history of clashes with major artists and their fans, including Taylor Swift and Bruce Springsteen.\nGeneral Sherman passes health check but world’s largest trees face climate threatsSEQUOIA NATIONAL PARK, California (AP) — Researchers climbed the world’s largest tree to inspect for bark beetles and descended the giant sequoia with good news this week.", "location": "CALIFORNIA", "classification": "natural-disasters", "score": 0.4149408620521776, "event_breakdown": "- National Oceanic and Atmospheric Administration (NOAA) predicts an 85% chance of above average storm activity for the upcoming Atlantic hurricane season in June\n- The University of North Carolina governing board repealed its policy on diversity jobs in its university system, likely leading to the elimination of existing diversity jobs"}, {"id": "91ef3383-9561-4690-bf67-fcc2d8c407d4", "title": "Manor woman claims neighboring developer is damaging her property with storm water", "date": "2024-05-24 14:15", "url": "https://www.yahoo.com/news/manor-woman-claims-neighboring-developer-122300494.html", "message": "After a storm with heavy rainfall, she went to her property to find large amounts of standing water on her property.\nThe storm water was released all at once and the pond emptied onto Swier’s property.\nThe next month, the TCEQ closed the investigation after DNT Construction submitted documentation of its dewatering practices and the agency found it sufficient to resolve the issue.\nThe most recent example of storm water flooding her land was on May 16, almost four months after the TCEQ said the violation had been resolved.\nWe did not hear back from DNT Construction, but will update this story once we receive a response.", "location": "Odessa, Texas", "classification": "natural-disasters", "score": 0.7349186865031833, "event_breakdown": "Based on the text provided, here are the natural-disaster events listed:\n- Storm with heavy rainfall\n- Large amounts of standing water on Swier's property"}, {"id": "3ac5e119-1355-4997-b250-882c40710193", "title": "At least 4 people have died and 35 are injured in a tornado that swept through Iowa", "date": "2024-05-24 00:15", "url": "https://www.wfae.org/united-states-world/2024-05-23/at-least-4-people-have-died-and-35-are-injured-in-a-tornado-that-swept-through-iowa", "message": "At least four people have died, and at least 35 have been injured after a tornado swept through Iowa.\nThe central and northern parts of Iowa first received about 2 to 4 inches of rain Tuesday, causing flash flooding.\nFlood advisories are active in the area until Friday, the weather service said.\nOne to 3 inches of rain are forecasted in that area, according to the weather service.\nThe National Weather Service is encouraging people not to toss lit cigarettes on the ground, engage in activities with open flames, drive on a flat tire or park their vehicles in dry grass.", "location": "IOWA", "classification": "natural-disasters", "score": 0.8389871673100012, "event_breakdown": "Tornado, flooding, fire"}, {"id": "bc588306-dcd3-4b7a-b5e4-83cdd97496ca", "title": "Orlando weather : Hot , hot , hot Memorial Day weekend on tap across Central Florida", "date": "2024-05-24 14:45", "url": "https://www.fox35orlando.com/weather/orlando-weather-hot-hot-hot-memorial-day-weekend-tap-across-central-florida", "message": "It's Memorial Day weekend – and we're on track for a near-record heat weekend with very low rain chances through the middle of next week.\nIn fact, the high pressure system inducing this heat wave stays put stubbornly through next week with mid-to-upper 90s remaining across our region.\nThis will limit our typical afternoon storm chances to less than 30% in most cases next week.\nAt worst, a tropical system may try to come together in the Caribbean, focusing all that rain into a concentrated area.\nIf that happens, our overall rain chances would likely diminish unless said potential system was to track into Florida.", "location": "FLORIDA", "classification": "natural-disasters", "score": 0.5051600029700455, "event_breakdown": "List of natural-disaster events:\n- Heat wave\n- High pressure system\n- Tropical system\n- Rain chances"}, {"id": "5f9442ae-345d-4276-b10d-f3769f2377a7", "title": "2005 Vs 2024 Hurricane Seasons : Bad News for Louisiana and Texas", "date": "2024-05-24 18:30", "url": "https://999ktdy.com/ixp/36/p/2005-versus-2024-hurricane-season-more-bad-news-for-louisiana-and-texas/", "message": "Lafayette, LA (KPEL News) - The majority of Louisiana residents, and even Americans, remember the hurricane season of 2005.\nRight now, the water in the Atlantic Basin and especially in the Gulf of Mexico are warmer going into hurricane season 2024 than they were in 2005.\nThey explain, in their writeup about hurricane season, why warm water in this particular area is concerning.\nRead More: NOAA Releases 'Severe' 2024 Hurricane Season Forecast for LA, TXPreparation and planning is key.\nNo one has a crystal ball or knows if Louisiana or Texas will take a hit this year.", "location": "Louisiana", "classification": "natural-disasters", "score": 0.8779337378616943, "event_breakdown": "Based on text provided, here are a list of the natural-disasters events:\n\n1. Hurricane season 2005: The hurricane season of 2005 was a very active Atlantic hurricane season, featuring 28 named storms, 15 hurricanes, and 7 major hurricanes. This was one of the most active Atlantic hurricane seasons on record at that time.\n2. Hurricane season 2024: It is currently unknown what the hurricane season of 2024 will be like. However, the National Oceanic and Atmospheric Administration (NOAA) has released a 'Severe' 2024 hurricane season forecast for Louisiana and Texas."}, {"id": "fb315cf1-85fc-444a-a3e6-93d916c08561", "title": "Torrential rains alleviate drought but cause wastewater discharges", "date": "2024-05-24 16:00", "url": "https://www.thegazette.com/weather/torrential-rains-alleviate-drought-but-cause-wastewater-discharges/", "message": "As of this week, there is no ‘severe’ drought in Iowa, first time since March 2022Cows move uphill as storm clouds roll into Anamosa on Tuesday.\nIn a Thursday report, all “severe” drought in the northeast part of the state was downgraded to “moderate,” the lowest drought classification.\nThe last time there was no severe drought in Iowa was March 2022.\n(U.S. Drought Monitor)Heavy rain leads to wastewater bypassesAbout 40 cities reported wastewater bypasses from their collection systems that day, according to the Iowa Department of Natural Resources.\nAverage rainfall so far in May totals more than 6 inches, according to Iowa State University data.", "location": "IOWA", "classification": "natural-disasters", "score": 0.8200731767158612, "event_breakdown": "Severe drought in Iowa, heavy rain and wastewater bypasses, and the May rainfall in Iowa."}, {"id": "8a30f316-3aa5-4a04-86bf-b0faca57cea1", "title": "Light earthquake , 4 . 4 mag was detected near Kuqa in China", "date": "2024-05-24 15:45", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-4-mag-was-detected-near-kuqa-in-china-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Thursday, 26 kilometers (16 miles) from Kuqa in China.\nExact time and date of earthquake 23/05/24 / 2024-05-23 17:38:25 / May 23, 2024 @ 5:38 pm UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 26 km W of Kuqa, China.", "location": "can’t be determined.)\nChina", "classification": "natural-disasters", "score": 0.9512562697496887, "event_breakdown": ", even before describing each event in detail\nHelp"}, {"id": "eeab00d6-4496-4bc6-ba65-445ed0ef672e", "title": "Moderate earthquake 5 . 1 mag , 150 km NE of Kavieng , Papua New Guinea", "date": "2024-05-24 17:30", "url": "https://www.earthquakenewstoday.com/2024/05/24/moderate-earthquake-5-1-mag-150-km-ne-of-kavieng-papua-new-guinea/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) strikes 150 km NE of Kavieng, Papua New Guinea (93 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us6000n0s9.\nId of event: us6000n0s9.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 150 km NE of Kavieng, Papua New Guinea.", "location": ")\nPapua New Guinea (state: New Ireland).", "classification": "natural-disasters", "score": 0.9558842512007788, "event_breakdown": "natural-disasters events listed in the text:\n1. Moderate earthquake magnitude 5.1 strikes 150 km NE of Kavieng, Papua New Guinea."}, {"id": "65198425-4f51-42a8-b5be-aa45901a2f08", "title": "Light earthquake : M4 . 4 quake has struck near Hualien City in Taiwan", "date": "2024-05-24 19:15", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-m4-4-quake-has-struck-near-hualien-city-in-taiwan-8/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Friday, 23 kilometers (14 miles) from Hualien City in Taiwan.\nThe earthquake occurred at a depth of 19.82 km (12 miles).\nThe 4.4-magnitude earthquake has occurred at 17:06:37 / 5:06 pm (local time epicenter).\nEpicenter of the earthquake was 24 km (15 miles) from Hualian (c. 350 500 pop), 66 km (41 miles) from Yilan (c. 94 200 pop), 79 km (49 miles) from Puli (c. 86 400 pop), 91 km (57 miles) from Daxi (c. 84 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 23 km NNE of Hualien City, Taiwan.", "location": "Hualien City", "classification": "natural-disasters", "score": 0.7610472231845933, "event_breakdown": ".\nEarthquake with magnitude 4.4 occurs 23 kilometers from Hualien City In Taiwan at 17:06:37."}, {"id": "5d194e55-95cb-4d0e-8a13-3888824780bc", "title": "Light earthquake 4 mag , 2 km ENE of Melissa , Italy", "date": "2024-05-24 19:15", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-mag-2-km-ene-of-melissa-italy/", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Friday, 2 kilometers (1 miles) from Melissa in Italy.\nIds that are associated to the earthquake: us6000n0sz.\nEarthquake epicenter was 62 km (39 miles) from Catanzaro (c. 79 000 pop), 75 km (47 miles) from Lamezia Terme (c. 70 500 pop), 69 km (43 miles) from Cosenza (c. 63 900 pop), 76 km (47 miles) from Nicastro-Sambiase (c. 55 700 pop), 27 km (17 miles) from Crotone (c. 48 700 pop), 48 km (30 miles) from Rossano Stazione (c. 23 800 pop).\nClose country/countries that might be effected, Italy (c. 60 340 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 2 km ENE of Melissa, Italy.", "location": ")\nThe place where the event takes place the most is Melissa in Italy", "classification": "natural-disasters", "score": 0.6543273347836, "event_breakdown": ".\n1. On Friday, 2 kilometers (1 miles) from Melissa in Italy, a light earthquake with a magnitude of 4 (ml/mb) was detected.\n2. The earthquake epicenter was 62 kilometers (39 miles) from Catanzaro (c. 79 000 pop), 75 kilometers (47 miles) from Lamezia Terme (c. 70 500 pop), 69 kilometers (43 miles) from Cosenza (c. 63 900 pop), 76 kilometers (47 miles) from Nicastro-Sambiase (c. 55 700 pop), 27 kilometers (17 miles) from Crotone (c. 48 700 pop), and 48 kilometers (30 miles) from Rossano Stazione (c. 23 800 pop).\n3. The earthquake was located near Italy and could be felt in Catanzaro, Lamezia Terme, Cosenza, Nicastro-Sambiase, Crotone, and Rossano Stazione."}, {"id": "ddf56c4f-c25f-443c-80cd-430071c00d8d", "title": "Minor earthquake , 3 . 95 mag was detected near La Romana in Dominican Republic", "date": "2024-05-24 19:15", "url": "https://www.earthquakenewstoday.com/2024/05/24/minor-earthquake-3-95-mag-was-detected-near-la-romana-in-dominican-republic/", "message": "A minor earthquake with magnitude 3.95 (ml/mb) was detected on Friday, 3 kilometers (2 miles) from La Romana in Dominican Republic.\nThe earthquake occurred at a depth of 161 km (100 miles).\nCountry/countries that might be effected, Dominican Republic (c. 9 824 000 pop).\nEvery year there are an estimated 130,000 minor earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 3 km SE of La Romana, Dominican Republic.", "location": ".\nLa Romana in Dominican Republic", "classification": "natural-disasters", "score": 0.7694877458826734, "event_breakdown": ".\n* A minor earthquake with magnitude 3.95 (ml/mb) was detected on Friday 3 kilometers (2 miles) from La Romana in Dominican Republic.\n* The earthquake occurred at a depth of 161 km (100 miles)."}, {"id": "20b98951-1328-403d-9c1f-085b52cd39a7", "title": "Light earthquake 4 . 6 mag , 27 km NNE of Hualien City , Taiwan", "date": "2024-05-24 19:15", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-6-mag-27-km-nne-of-hualien-city-taiwan/", "message": "A light earthquake magnitude 4.6 (ml/mb) has struck on Friday, 27 kilometers (17 miles) from Hualien City in Taiwan.\nExact location of event, longitude 121.7162 East, latitude 24.1994 North, depth = 33.329 km.\nThe earthquake occurred at a depth of 33.329 km (21 miles) below the earth’s surface.\nThe epicenter was 96 km (60 miles) from Taipei (c. 7 871 900 pop), 94 km (58 miles) from Banqiao (c. 543 300 pop), 98 km (61 miles) from Taoyuan City (c. 402 000 pop), 27 km (17 miles) from Hualian (c. 350 500 pop), 62 km (39 miles) from Yilan (c. 94 200 pop), 80 km (50 miles) from Puli (c. 86 400 pop), 87 km (54 miles) from Daxi (c. 84 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 27 km NNE of Hualien City, Taiwan.", "location": "Hualien City", "classification": "natural-disasters", "score": 0.5660221475355386, "event_breakdown": "null"}, {"id": "6fd9ac29-3953-413c-a362-31bc0c253f7c", "title": "NOAA Forecasts Busy Hurricane Season - The Waterways Journal", "date": "2024-05-24 17:00", "url": "https://www.waterwaysjournal.net/2024/05/24/noaa-forecasts-busy-hurricane-season/", "message": "With a week to go before the June 1 start of the 2024 Atlantic hurricane season, the National Oceanic and Atmospheric Administration (NOAA) has released its outlook for tropical activity in the basin.\nUnsurprisingly, the agency is predicting above-normal hurricane activity for the 2024 Atlantic hurricane season, which officially runs from June 1 through November 30.\nPresenting its hurricane season outlook in a series of ranges, NOAA is forecasting a total of 17 to 25 named storms (those with winds of 39 mph.\nIn contrast, an average hurricane season has about 14 named storms, seven hurricanes and three major hurricanes.\nAs an example, he pointed to the 2023 season, the fourth most active hurricane season on record.", "location": "Based on the text provided, I was not able to find a specific location for the main event to take place.", "classification": "natural-disasters", "score": 0.8560863297737226, "event_breakdown": "- 2024 Atlantic Hurricane Season Forecasted to be Above-Normal (With an expected range of 17 to 25 named storms)\n- 2023 Atlantic Hurricane Season was the fourth most active hurricane season on record, with 21 named storms"}, {"id": "a8d83859-8275-4d79-bb45-d0501963e1e6", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 18:30", "url": "https://komonews.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "North America", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The natural-disasters events in the text are:\n1. Global records of heat since 1880 (heatwaves or sea temperature)\n2. Named storms:\n- The NOAA predicts 25 named storms for 2024\n- An average Atlantic hurricane season has 14 named storms, but in 2023 it was 20\n3. Forecasts for the next hurricane season"}, {"id": "d77d7025-3cb1-4e28-a20f-3ef1e4935bfb", "title": "Major hurricane season predicted : What to know about insurance", "date": "2024-05-24 10:45", "url": "https://ctmirror.org/2024/05/24/ct-hurricane-season-insurance-deductible/", "message": "“The forecast for named storms, hurricanes and major hurricanes is the highest NOAA has ever issued for the May outlook,” Spinrad said.\nAnd what’s known as a “hurricane deductible,” once a rarity, is now close to ubiquitous.\nIf rain from that same storm or hurricane floods and wrecks your ground floor, homeowners insurance will not cover it.\nThe benefit of a hurricane deductible is that the overall cost of the insurance policy stays lower.\nA hurricane warning, which is part of a hurricane deductible trigger, is more severe than a hurricane watch.", "location": "United States", "classification": "natural-disasters", "score": 0.9601413381686764, "event_breakdown": "1. Named Storms\n2. Hurricanes\n3. Major Hurricanes\n4. Hurricanes causing flooding"}, {"id": "6f31c461-ec64-45f5-95eb-09bcbe80e6b3", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 18:30", "url": "https://wwmt.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "NOAA predicted 18-21 named storms for 2023, and 14", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "List of natural-disasters events in the text:\n- Global warming may cause summer to be hotter than usual.\n- More named storms than in an average season.\n- A pre-season forecast predicts 25 named storms, the most ever.\n- There were also 20 named storm in 2023, making it the fourth most active season."}, {"id": "96e602e4-4224-4921-bbf9-2278024b6de0", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 18:30", "url": "https://turnto10.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "NOAA (National Oceanic and Atmospheric Administration) predicts that the Atlantic could see an average of 14", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The natural-disasters events mentioned in the text are:\n\n1. Forecast for up to 25 named storms for 2024 Atlantic hurricane season\n2.  NOAA predicted that this summer could rival last summer, which was Earth’s hottest since global records started in 1880."}, {"id": "b4d2fde4-dd93-4bd0-b76b-f47a4d371272", "title": "Our Severe Weather Threat Continues ( 05 . 24 . 24 ) ", "date": "2024-05-24 18:00", "url": "https://www.newschannel5.com/weather/our-severe-weather-threat-continues-05-24-24", "message": "Day 3 - Unsettled Conditions ContinueToday: Scattered Showers & Storms - some strong/severe | 83Tonight: Isolated StormsDAY TIMING: SUNDAY AFTERNOON - MONDAY EARLY MORNING THREATS/IMPACTS: Damaging Wind, Tornadoes, Hail, Heavy Downpours, Flash FloodingMemorial Day weekend marks the unofficial start to summer.\nUnfortunately, we will need to have backup plans in place as storm chances are forecasted throughout the weekendSunday into Monday are the biggest concerns for strong to severe storms.\nAll of the NewsChannel 5 coverage areas is under a risk for severe weather.\nAs of now, the biggest risk for Sunday into Memorial Day are wind, tornadoes, flash flooding, and hail.\nAgain, much can change between now and then so it is important to stay up-to-date with the forecast as we head into the long weekend.", "location": "Tennessee", "classification": "natural-disasters", "score": 0.9212066906028534, "event_breakdown": "Based on the text provided, the natural-disasters events mentioned in the Day 3 - Unsettled Conditions Continue weather forecast are as follows:\n\n- Damaging Wind\n- Tornadoes\n- Hail\n- Heavy Downpours (associated with potential Flash Flooding)"}, {"id": "f74ed193-92a4-40c4-bf0a-27aae85fac6b", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 19:15", "url": "https://newschannel20.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "Atlantic ocean", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "A list of natural-disaster events mentioned in the text are as follows:\n\n1. Earth's hottest summer\n2. Record number of tropical cyclones\n3. 20 named storms in 2023"}, {"id": "e9c7563a-fbb2-4f9a-ba36-b2d3d1bcfeb9", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 19:15", "url": "https://fox17.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "Atlantic ocean", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The Atlantic hurricane season, , which has had the highest pre-season outlook ever recorded by the NOAA, with between 17 and 25 named storms of winds of 39 MPH or higher. This prediction came on the heels of a hectic 2023 Atlantic hurricane season."}, {"id": "0313903a-8505-4e6d-ac92-3139ac1dc436", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 18:30", "url": "https://www.bangordailynews.com/2024/05/24/nation/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,” warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“Because of the damage already there, it won’t take much wind to inflict even more damage on these homes,” Ansorge said.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "OKLAHOMA", "classification": "natural-disasters", "score": 0.7602832019639287, "event_breakdown": ".\n- A tornado in southwestern Oklahoma on Thursday\n- A long term weather forecast for Iowa on Friday that forecasts people sleeping during severe weather\n- Potential more severe weather in Texas, Oklahoma, and Kansas this weekend"}, {"id": "4f1b1532-e98f-43c0-b131-4b30d16305aa", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 18:00", "url": "https://www.columbian.com/news/2024/may/24/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/", "message": "GREENFIELD, Iowa (AP) — Storms downed trees and power lines in Iowa early Friday, days after a destructive tornado ripped apart more than 100 homes in one small town, took the lives of four residents and injured at least 35 more.\nThe storms brought the threat of large hail and damaging winds with the possibility of embedded tornadoes in the region.\nMore than 50,000 customers were in the dark in Iowa on Friday morning, according to poweroutage.us.\nNews outlets reported downed power lines and outages and damage to some structures in the area.\nAlong a mile-long path of the tornado in Greenfield, Iowa, on Thursday there was a deafening clamor of heavy equipment scooping up the splintered homes, smashed vehicles and shredded trees.", "location": "Greenfield", "classification": "natural-disasters", "score": 0.7663554810177929, "event_breakdown": "- Iowa tornadoes (Dec 15, 2021), destroyed homes (Greenfield)\n- threat of tornadoes in Iowa (Dec 17, 2021), power of wind\n- large hail and damaging winds, Iowa (Dec 17, 2021), possibilities grow\n- magnetic fields of electricity in USA (Dec 17, 2021), machines can work uninterrupted in an electrified environment"}, {"id": "b175b7b1-11c9-4921-9004-04bfbdf2c282", "title": "First Alert Weather : Strong to severe storms possible through Sunday", "date": "2024-05-24 04:00", "url": "https://www.wsmv.com/2024/05/23/first-alert-weather-strong-severe-storms-possible-through-sunday/", "message": "NASHVILLE, Tenn. (WSMV) -First Alert Weather Days are now in effect for each day through Sunday due to the risk of strong to severe thunderstorms.\nDownload the WSMV 4 First Alert Weather app for iPhone or Android.\nA First Alert Weather Day is now also in effect for Saturday.\nA First Alert Weather Day is in effect on Sunday.\nA big round of strong-to-severe thunderstorms will be possible with damaging wind, large hail, localized flooding, and isolated tornadoes all possible.", "location": "NASHVILLE, TENNESSEE", "classification": "natural-disasters", "score": 0.4845540716546389, "event_breakdown": "- Strong to severe thunderstorms\n- Tornadoes\n- Large hail\n- Flooding"}, {"id": "8b666da8-882b-4548-9465-cb0a387d0d09", "title": "Hurricane Season 2024 : Tips for starting a storm supply list", "date": "2024-05-24 17:30", "url": "https://www.yahoo.com/news/hurricane-season-2024-tips-starting-141416522.html", "message": "The Atlantic hurricane season runs from June 1 through Nov. 30 with the peak of the season on Sept. 10.\nAn overheated Atlantic Ocean and a rising La Niña have forecasters predicting a highly active hurricane season, one that could rival one of the busiest years on record.\nThe key to getting through storm season is being prepared.\nWater: Enough for 1 gallon of drinking water per person/per day, for one-week minimum.\nThis article originally appeared on Palm Beach Post: Prepare supply list for hurricane season 2024 in Palm Beach County", "location": "Palm Beach County", "classification": "natural-disasters", "score": 0.8253050103349461, "event_breakdown": "Atlantic Hurricane Season\nHeatwave\nLa Niña"}, {"id": "908867df-e768-4e61-8b2c-de4847711dd8", "title": "NOAA predicts record hurricane season for 2024", "date": "2024-05-24 00:15", "url": "https://www.mycentralnebraska.com/syndicated-article/?id=1565683", "message": "(NEW YORK) — The National Oceanic and Atmospheric Administration has issued its highest-on record May hurricane forecast for the upcoming hurricane season.\nAll categories of storms are expected to exceed the typical number seen every year, National Weather Service forecasters announced Thursday in a news conference for the 2024 hurricane outlook.\nMultiple officials, including National Hurricane Center Director Michael Brennan and National Weather Service Director Ken Graham, described the 2024 Hurricane Outlook as the “highest” forecast ever issued in May.\nThe Atlantic hurricane season starts June 1 and runs through Nov. 30.\nClimate change is likely having a significant impact on the Atlantic hurricane season, according to researchers.", "location": "NEW ORLEANS", "classification": "natural-disasters", "score": 0.9007726526700941, "event_breakdown": ".\nHere is a list of the corresponding natural disasters:\n- Record May hurricane forecasts.\n- All categories of storms exceeding the typical number seen every year.\n- A higher-than-normal Central Florida fire threat through the 4th of July holiday. \n- Arms of Texas rapp country to see freezing rain, sleet, and snowfall."}, {"id": "b1cef0bc-b70d-462b-9d91-f1e3352f8c74", "title": "Jersey Shore water quality  excellent , extreme summer heat expected", "date": "2024-05-24 03:15", "url": "https://whyy.org/articles/state-of-the-shore-2024-new-jersey-water-quality-extreme-heat/", "message": "From the Poconos to the Jersey Shore to the mouth of the Delaware Bay, what do you want to know about climate change?\n“Our water quality along our coastal communities is excellent and ready for our visitors,” said New Jersey Commissioner of Environmental Protection Shawn LaTourette.\nBut LaTourette also raised warnings about the impact of climate change on public health.\n“And we expect more extreme heat to exacerbate health conditions.”LaTourette said the state is working on an extreme heat action plan as climate change is bringing more flooding and high temperatures to the Garden State.\nNew Jersey Sea Grant Consortium publishes the annual report.", "location": "NEW JERSEY", "classification": "natural-disasters", "score": 0.593605082562833, "event_breakdown": "* Extreme heat and flooding\n* Coastal erosion"}, {"id": "1e1c93e7-4bbf-412d-b5eb-af7ca4e27722", "title": "Cyclone Remal to make landfall in West Bengal , Bangladesh on May 26 : IMD", "date": "2024-05-24 12:00", "url": "https://www.thehindu.com/news/national/west-bengal/cyclone-remal-to-make-landfall-in-west-bengal-bangladesh-on-may-26-imd/article68211101.ece", "message": "Cyclonic storm “Remal”, originating in the central Bay of Bengal, is expected to escalate into a severe cyclonic storm by May 25 and according to the latest input of the Indian Meteorological Department (IMD), it is very likely to cross Bangladesh and adjoining West Bengal coasts between Sagar Island and Khepupara around May 26 midnight as a severe cyclonic storm.\nThe Indian Coast Guard said on May 24 that the cyclone is likely to make landfall at North/North-West Bay of Bengal near West Bengal Coast on the night of May 26 and the situation is being actively monitored and comprehensive preemptive measures to ensure minimal loss of life and property at sea have been initiated.\n@IndiaCoastGuard is closely monitoring Cyclonic Storm #Remal formed over the #BayofBengal, expected to intensify into a Severe Cyclonic Storm by 25 May.\n“It is very likely to continue to move northeastwards and intensify further into a cyclonic storm over east central Bay of Bengal by May 25 morning.\nAccording to a study by the Council on Energy, Environment, and Water (CEEW), West Bengal has a high adaptive capacity against cyclones because of cyclone multi-hazard Early Warning Systems (EWS), which is made available under the National Cyclone Risk Mitigation Project (NCRMP) Phase II.", "location": "-\nWest Bengal", "classification": "natural-disasters", "score": 0.9020318988656105, "event_breakdown": "1. Indian Meteorological Department (IMD) informed that it is expected that cyclonic storm “Remal” will cross Bangladesh and West Bengal coast between Swargadwar of Sagar Island and Khepupara Estuary in East Medinipur district in the night of May 26 as a very severe cyclonic storm.\n2. The Indian Coast Guard informed that comprehensive preemptive measures have been initiated to ensure minimal loss of property or life at sea due to cyclonic storm, which is likely to cross the North / NordWest Bay of Bengal near West Bengal coast on the May 26 night.\n3. The Indian Meteorological Department (IMD) informed that it is expected that cyclonic storm “Remal” will cross Bangladesh and West Bengal coast between Swargadwar of Sagar Island and Khepupara Estuary in East Medinipur district in the night of May 26 as a very severe cyclonic storm."}, {"id": "acac4f57-55d6-4aa1-82e6-9f69a85b9c97", "title": "Temple mall closes temporarily after severe damage from storms", "date": "2024-05-24 03:00", "url": "https://www.kwtx.com/2024/05/24/temple-mall-closes-temporarily-after-severe-damage-storms/", "message": "TEMPLE, Texas (KWTX) - The Temple Mall got hit by strong winds and rain Wednesday night and is now closed as they deal with structural and electrical damage.\nAccording to mall management, part of the roof flew off during the storm and knocked a hole through one of the roof’s skylights.\nOne business owner who was at the mall during this said the rain and wind were coming down hard, leaving debris everywhere and flooding parts of the mall.\nThe mall was open at the time, but thankfully there were no injuries as shoppers were moved into hallways and back rooms immediately.\nMonica Britten, the general manager for the Temple Mall, was there when the storm hit.", "location": "TEMPLE, Texas.", "classification": "natural-disasters", "score": 0.7797986363837077, "event_breakdown": ".\n-Calm weather before the storm\n-Roof blows off in Temple Mall\n-Several businesses face structural damage\n-Hole formed in the roof, creating extensive damage to the inside of the mall"}, {"id": "7c0a97cb-443f-4148-a4b8-2bfe4c433b33", "title": "6 FIRST ALERT WEATHER DAY : A Severe Thunderstorm Watch has been issued ahead of overnight storm chances", "date": "2024-05-24 03:00", "url": "https://www.wowt.com/2024/05/24/6-first-alert-weather-day-severe-thunderstorm-watch-has-been-issued-ahead-overnight-storm-chances/", "message": "(WOWT) - Thursday is a 6 First Alert Weather Day ahead of an overnight risk for strong storms.\nA SEVERE THUNDERSTORM WATCH has been issued for portions of the viewing area, including the Omaha Metro, until 4AM Friday.\n2AM Friday (wowt)6AM Friday (wowt)Damaging straight line wind is the main threat with this line but a couple of quick spin up tornadoes are possible too.\nRain potential (wowt)Flood Watch (wowt)This line should easily be gone by the time you wake up and start your Friday.\nThe greatest severe weather threat should stay south of the area with this round.", "location": "OMAHA", "classification": "natural-disasters", "score": 0.5817351178107045, "event_breakdown": "format\nTornado, damaging straight line wind"}, {"id": "760bc39e-4309-4b6d-96b4-d37108dc9c27", "title": "Where and when to expect 23C as Met Office gives weather update", "date": "2024-05-24 10:45", "url": "https://www.somersetlive.co.uk/news/uk-world-news/expect-23c-met-office-gives-9303451", "message": "Storm conditions are expected to ease over the bank holiday weekend with some areas seeing highs of 23C, the Met Office has said.\nIt comes after flooding hit parts of the north of England this week, with Carlisle in Cumbria seeing 88mm of rain in 48 hours.\nMet Office meteorologist Amy Bokota said conditions will improve over the bank holiday, with some areas seeing highs of 23C on Saturday.\nThe north west of England and the southern parts of Wales could see thunderstorms.\nThe best weather will be in the very far south west of the UK and southern England.", "location": "LONDON", "classification": "natural-disasters", "score": 0.7504551913606133, "event_breakdown": "Natural-disasters events:\n- Flooding hit parts of the north of England this week\n- Carlisle in Cumbria seeing 88mm of rain in 48 hours\n- Storm conditions are expected to ease over the bank holiday weekend"}, {"id": "2ac048a3-4c3a-4353-92e9-84836b2ab172", "title": "Extreme weather . A lack of lifesaving vaccines . Africa cholera crisis is worse than ever", "date": "2024-05-24 07:15", "url": "https://www.yakimaherald.com/news/nation_and_world/world/extreme-weather-a-lack-of-lifesaving-vaccines-africas-cholera-crisis-is-worse-than-ever/article_e76fcb5b-f809-5048-a2a7-b7718e4f2067.html", "message": "Extreme weather.\nA lack of lifesaving vaccines.\nAfrica's cholera crisis is worse than everExtreme weather events have hit parts of Africa relentlessly in the last three years, with tropical storms, floods and drought causing crises of hunger and displacement", "location": "Africa", "classification": "natural-disasters", "score": 0.961367911855166, "event_breakdown": "Here are the natural-disaster events mentioned in the text:\n\n-Tropical storms\n-Floods\n-Drought\n-Hunger crises\n-Kiribati\n-Displacement crises"}, {"id": "e44f2a41-ca59-4b91-ab4b-cf31cac14f5f", "title": "Stormy conditions expected to ease over bank holiday weekend", "date": "2024-05-24 09:15", "url": "https://www.shropshirestar.com/news/uk-news/2024/05/24/stormy-conditions-expected-to-ease-over-bank-holiday-weekend/", "message": "Storm conditions are expected to ease over the bank holiday weekend with some areas seeing highs of 23C, the Met Office has said.\nMet Office meteorologist Amy Bokota said conditions will improve over the bank holiday, with some areas seeing highs of 23C on Saturday.\nThe best will be 22-23C across the south of England and London.”Saturday evening is expected to bring some showers in southern Wales, the South West and Cornwall.\nThe north west of England and the southern parts of Wales could see thunderstorms.\n“The best weather will be in the very far south west of the UK and southern England.", "location": "LONDON", "classification": "natural-disasters", "score": 0.4207492020619505, "event_breakdown": "List 1\n------\n\n* Storm conditions are expected to ease over the bank holiday weekend in the UK, with some areas seeing highs of 23C.\n\n* The Met Office stated that conditions will improve over the bank holiday.\n\n* Southern England will have the best weather, with temperatures reaching 22-23C.\n\n* Saturday evening could bring showers in some places.\n\n\nList 2\n--------\n\n* Storm conditions are expected to ease over the bank holiday weekend in the UK, with some areas seeing highs of 23C.\n\n* The Met Office stated that conditions will improve over the bank holiday.\n\n* Southern England will have the best weather, with temperatures reaching 22-23C.\n\n* Saturday evening could bring showers in some places.\n\n\nList 3\n--------\n\n* Saturday evening could bring thunderstorms in the North West of England and South West of Wales, according to the Met Office."}, {"id": "8cd89ab4-8b07-4ab2-a9b0-6ceffe8e09f6", "title": "Chicago Memorial Day forecast mixes severe storm threats , sunshine – NBC Chicago", "date": "2024-05-24 04:00", "url": "https://www.nbcchicago.com/weather/rain-storms-could-impact-chicago-areas-memorial-day-forecast/3445648/", "message": "The Chicago area will see some sunshine during the Memorial Day weekend, but there could also be plenty of rain in the forecast that could impact your plans.\nMultiple threats of severe weather will emerge over the course of the weekend, starting with Friday afternoon across the region.\nFridayA threat of severe weather will enter the forecast on Friday, with the SPC forecasting a “slight” chance of damaging storms during the day.\nSundayThe chance of rain will return in a big way on Sunday, with showers and thunderstorms likely for most of the day.\nA chance for severe weather will once again enter the forecast, with threats of heavy rain, gusty winds and hail all possible.", "location": "CHICAGO", "classification": "natural-disasters", "score": 0.9029245249861222, "event_breakdown": "1. thunderstorms\n2. heavy rain\n3. damaging storms\n4. gusty winds\n5. hail"}, {"id": "f12cabf2-df87-413d-b783-a317d0dfff60", "title": "Climate change and rapid urbanization worsened the impact of East African rains , scientists say", "date": "2024-05-24 03:15", "url": "https://www.clickondetroit.com/news/world/2024/05/24/climate-change-and-rapid-urbanization-worsened-the-impact-of-east-african-rains-scientists-say/", "message": "The impact of the calamitous rains that struck East Africa from March to May was intensified by a mix of climate change and rapid growth of urban areas, an international team of climate scientists said in a study.\n(AP Photo/Brian Ongoro, File)NAIROBI – The impact of the calamitous rains that struck East Africa from March to May was intensified by a mix of climate change and rapid growth of urban areas, an international team of climate scientists said in a study published Friday.\nIt found that climate change had made the devastating rains twice as likely and 5% more intense.\nEast Africa also suffered flooding during the “short rains” of October to December 2023 and before that, it endured a three-year drought.\nWWA scientists found that both events were worsened by climate change.", "location": ")\nNAIROBI", "classification": "natural-disasters", "score": 0.5397612991786873, "event_breakdown": ".\n1. East Africa suffered devastating rains from March to May 2022.\n2. East Africa also suffered flooding during the \"short rains\" of October to December 2023.\n3. East Africa endured a three-year drought before that of 2019-2021."}, {"id": "9d960d8b-18ce-42ac-bd23-59562c96519a", "title": "Louisville weather : Severe weather possible Memorial Day weekend", "date": "2024-05-24 18:30", "url": "https://www.yahoo.com/news/louisville-weather-severe-weather-possible-164332930.html", "message": "Dec. 31, 2018The National Weather Service of Louisville is predicting severe weather Sunday, which could impact Jack Harlow's first Gazebo Festival and Memorial Day weekend activities.\n#kywx #inwx pic.twitter.com/V442qs2UKo — NWS Louisville (@NWSLouisville) May 24, 2024Memorial Day weekend weather in LouisvilleHere's what we know about the weather over the holiday weekend as of Friday afternoon.\nLouisville weather forecast for SundaySunday will be partly sunny with a high near 87.\nMemorial Day weather in LouisvilleMemorial Day will be mostly sunny with a high near 82.\nHere's everything to know about Jack Harlow's two-day music festivalThis article originally appeared on Louisville Courier Journal: Louisville forecast: Severe weather possible Memorial Day weekend", "location": "Louisville", "classification": "natural-disasters", "score": 0.5441113594472627, "event_breakdown": "Severe weather in the Louisville area on Sunday and mostly sunny conditions on Memorial Day"}, {"id": "098bea22-feed-4cf4-9fb6-1f0e19693515", "title": "Storm threat and heat over Memorial Day Weekend – NBC 5 Dallas - Fort Worth", "date": "2024-05-24 12:00", "url": "https://www.nbcdfw.com/weather/weather-connection/severe-storm-threat-and-high-heat-over-memorial-day-weekend/3549797/", "message": "Unseasonably warm and humid weather is in the forecast for the Memorial Day holiday weekend in North Texas.\nThe highest severe weather threat on Saturday will be across Oklahoma but a few severe storms may even move into parts of our area.\nIf you have outdoor plans or plan to be on area lakes stay weather aware.\nA cold front will take a slight edge off the heat on Monday, Memorial Day.\nThe morning hours will be comfortable with temperatures in the 70s, but it will heat up quickly in the afternoon to 90 degrees.", "location": "North Texas", "classification": "natural-disasters", "score": 0.7309863302783939, "event_breakdown": "Despite widespread drought across the country (most of the US was drisally-dry in early 2022) associated with La Niña, the combination of warm, humid, and unstable air will support several potential severe-weather events across the central Texas prarie on Monday. While the rain totals are not expected to be any significant, the National Weather Service issued a Level 2 (Slight) risk of severe weather for the Dallas area within hours. While a few isolated tornadoes and hail storms aren't expected to be rare, heavy rainfall could be the result, with higher ground-preemtion in the region, in addition to high winds and isolated hail reports of golf ball-sized and larger.\nAbnormally warm and humid weather was expected in North Texas throughout the Memorial Day weekend\nA severe weather threat exceeding expectations today was high over Oklahoma with potential for a few storms moving into areas further east on Saturday\nArea lakes and watch for a great memorial day (Monday will be significantly hotter with temperatures reaching 90 degrees)\nAcross the US, high fire risks have been issued with numerous red flag warnings as conditions are perfect for large fires to spread rapidly"}, {"id": "b9944140-8dda-48ba-b50a-33e76efe05be", "title": "Prepare Now Texas , Summer To Be Worse Than Previously Predicted", "date": "2024-05-24 03:15", "url": "https://kfox95.com/ixp/517/p/texas-summer-prediction-2024/", "message": "There are a lot of weather events occurring simultaneously in Texas, and perhaps the biggest one to be observing is our transition from El Nino to La Nina for the upcoming summer months.\nWhat will Texas temperatures be like for summer 2024?\nHow much rain should we expect this summer in Texas?\nRead Related: Texas Power Prices Grow Over 1,000% Due To Extreme May HeatNow, our electric bills may be another story.\nNot Your Usual Texas Get Aways Perfect to Beat Texas Heat Gallery Credit: Youtube/TSMDo Not Leave These 16 Items in Your Car in the East Texas Heat The heat in East Texas is no joke.", "location": "Texas", "classification": "natural-disasters", "score": 0.6982085418981062, "event_breakdown": ".\nThe events listed in the text are:\n1. Upcoming transition from El Nino to La Nina in Texas.\n2. Observation of the transition during the summer periods.\n3. How much rain is expected to occur.\n4. A potential danger of high electricity bills."}, {"id": "ed0f4682-2f9e-47a6-84b8-5dc78e13b84c", "title": "  Incredible  funding provided for new flood barriers in Dyserth", "date": "2024-05-24 14:30", "url": "https://www.rhyljournal.co.uk/news/24343275.incredible-funding-provided-new-flood-barriers-dyserth/", "message": "Denbighshire County Council said it is “in the early stages” of acquiring the barriers, which will aim to enhance protection from flooding to residents in Dyserth.\nThe village was particularly badly affected by Storm Babet in October 2023, with The New Inn pub having to temporarily close and incurring thousands of pounds’ worth of damage.\nThere seems to be a real push from them since Storm Babet to support us in this.\nFlooding in Dyserth (Image: Submitted)“Having the flood barriers is such a large part of being able to keep that water under control, so it will really help those vulnerable properties keep it at bay.\nA Denbighshire County Council spokesperson said: “The council are in contact with the local flood action group in Dyserth, and are in the early stages of acquiring flood barriers which can be set up in various locations to help manage flood risks.”", "location": "Dyserth", "classification": "natural-disasters", "score": 0.9007360048566111, "event_breakdown": "Flooding in Dyserth (October 2023)"}, {"id": "79fdb7b9-227a-4e3d-b038-9ebf6ebf17fe", "title": "Already Tracking a Disturbance Pre - Hurricane Season", "date": "2024-05-24 04:15", "url": "https://www.mysuncoast.com/2024/05/23/already-tracking-disturbance-pre-hurricane-season/", "message": "SARASOTA, Fla. (WWSB) - Hurricane season kicks off in just over a week, but we are already tracking a disturbance off the east coast of Cuba.\nIt will likely develop into a low pressure system over the weekend.\nFriday will be slightly cooler than Thursday, with high temperatures hitting the upper 80s near the coast and reaching the 90s throughout the inland counties.\nDew points remain in the low 70s, bringing the feels-like temperatures to 98 near coastal cities and in the triple digits inland.\nThe ultraviolet index will be in the very high category throughout the weekend, so skin protection and keeping hydrated is recommended.", "location": "Florida", "classification": "natural-disasters", "score": 0.6859155029139503, "event_breakdown": "Natural Disasters in the text:\n- Possible Development off East Coast of Cuba\n- Heatwave in Central Florida and the East Coast of the US"}, {"id": "5204445f-ce0d-4ba2-a9e8-47748520c2d0", "title": "Rio de Janeiro bay reforestation shows mangrove power to mitigate climate disasters – Winnipeg Free Press", "date": "2024-05-24 18:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/05/24/rio-de-janeiro-bay-reforestation-shows-mangroves-power-to-mitigate-climate-disasters", "message": "RIO DE JANEIRO (AP) — At the rear of Rio de Janeiro’s polluted Guanabara Bay, thousands of mangroves rise as tall as 13 feet (about 4 meters) from a previously deforested area.\nA fisherman manages fishing nets in Guanabara Bay near a recovered mangrove forest, in the Guapimirim environmental protection area on Guanabara Bay, Rio de Janeiro state, Brazil, Wednesday, May 22, 2024.\nBut we never had so much knowledge, so much technology and resources to recover our environment.”A lack of mangroves wasn’t the cause of flooding around Rio Grande do Sul’s capital, Porto Alegre, that sits beside a lagoon.\nIn Rio, it shows two large areas in the back of its bay — one of which includes the Guapirimim protected area — will be underwater by 2050.\nEnvironmentalists say the loss of natural vegetation due to agriculture and cattle ranching in Rio Grande do Sul state amplified the flooding.", "location": "RIO DE JANEIRO", "classification": "natural-disasters", "score": 0.4442815958185739, "event_breakdown": "The natural-disasters events described are:\n\n- Mangrove deforestaion in Rio's Guanabara Bay.\n- The construction near Rio's Guapimirim environmental protection area by fishermen.\n- The nearby town of Guapirimim in Rio de Janeiro's Guapimirim Bay will be underwater by 2050, according to the National Oceanic and Atmospheric Administration (NOAA)."}, {"id": "1e29ddd7-2735-496e-9ad3-4f0cb9c795a9", "title": "UN weather agency anticipates highly active hurricane season | World News", "date": "2024-05-24 14:30", "url": "https://indianexpress.com/article/world/un-weather-agency-anticipates-highly-active-hurricane-season-9349876/", "message": "The World Meteorological Organization on Friday said it expected a highly active hurricane season and stressed that early warnings were needed to save lives.\n\"High ocean heat content and the anticipated development of La Nina event are expected to fuel a very, very, very active hurricane season this year,\" Clare Nullis, WMO spokesperson, told a briefing in Geneva.\n\"It only takes one landfalling hurricane to set back years and years of socio-economic development.\"\nThe Atlantic hurricane season, which lasts from June to November, has recorded above average activity for eight consecutive years, WMO said.\nBetween 1970 and 2021, tropical cyclones -- which include hurricanes -- were the leading cause of reported human and economic losses worldwide, according to WMO.", "location": "Geneva, Switzerland", "classification": "natural-disasters", "score": 0.6974010948688981, "event_breakdown": "title\n1. Atlantic hurricane season\n2. tropical cyclones (HURRICANES)"}, {"id": "d51415c3-8b3b-494b-8ee5-e7e6a50ff76e", "title": "Earthquake rocks New Jersey : USGS", "date": "2024-05-24 12:00", "url": "https://www.yahoo.com/news/earthquake-rocks-jersey-usgs-092918794.html", "message": "GLADSTONE, N.J. (PIX11) – A 2.9-magnitude earthquake struck New Jersey early Friday morning, according to the United States Geological Survey.\nThe earthquake happened at 3:50 a.m. about 4.3 miles away from Gladstone, which is close to where at least two other quakes have hit, the USGS said.\nCan a major earthquake hit New York City?\nA 2.1-magnitude earthquake recently hit upstate New York, according to the USGS.\nAftershocks can be felt days and weeks after the initial large earthquake event, according to the USGS.", "location": "GLADSTONE, NEW JERSEY", "classification": "natural-disasters", "score": 0.7253729483617272, "event_breakdown": "2.1-magnitude earthquake hits upstate New York\n2.9-magnitude earthquake strikes New Jersey"}, {"id": "4531f5f9-da92-45e1-82a7-695d2cebdb67", "title": "Minor 2 . 9 earthquake rattles parts of northern New Jersey : USGS", "date": "2024-05-24 14:15", "url": "https://www.fox29.com/news/minor-2-9-earthquake-rattles-parts-northern-new-jersey-usgs", "message": "articleA minor earthquake rattled parts of northern New Jersey on Friday morning in the same area that's become something of a hot bed for tectonic activity.\nThe USGS said the earthquake struck Gladstone, New Jersey – the same town that experienced an aftershock following a 4.8 magnitude earthquake in April.\nThe minor earthquake was felt around 4 a.m. throughout northern New Jersey counties, including Somerset, Morris and Hunterdon.\nEarlier this month, the USGS reported a 2.6 magnitude earthquake in Gladstone.\nThe northern counties of New Jersey have recently become somewhat of a hot bed for minor earthquakes and aftershocks.", "location": "GLADSTONE", "classification": "natural-disasters", "score": 0.740909781319747, "event_breakdown": "Minor earthquake rattles northern New Jersey\nGladstone, New Jersey experiences a minor earthquake this month\nGladstone, New Jersey experiences a minor earthquake in April\nMinor earthquake felt in northern New Jersey counties"}, {"id": "6142215a-a5bd-4578-b907-7e177d6c6dd5", "title": "NOAA predicts busy Atlantic hurricane season", "date": "2024-05-24 04:30", "url": "https://bnonews.com/index.php/2024/05/noaa-predicts-busy-atlantic-hurricane-season/", "message": "Forecasters at the National Weather Service are predicting a busy Atlantic hurricane season this year amid near-record warm ocean temperatures and the development of La Nina conditions in the Pacific.\nUp to 25 named storms are expected.\nThe annual forecast, released just a week before the start of the 2024 Atlantic hurricane season, shows an 85% chance of an above-normal season, a 10% chance of a near-normal season and a 5% chance of a below-normal season.\nThe Atlantic hurricane season runs from June 1 through November 30, with peak activity between August and October.\nAn average season, based on data since 1981, produces fourteen named storms, with seven becoming hurricanes and three major hurricanes.", "location": "There is no specific location mentioned in the text.", "classification": "natural-disasters", "score": 0.8006975919079838, "event_breakdown": "Atlantic hurricane season which runs from June 1st to November 30th.\nTropical Storm Dolly which made landfall in Texas as a Category 2 hurricane."}, {"id": "40b1d64a-9489-4909-9fcd-e4064e57857f", "title": "Memorial Day Weekend forecast to bring severe weather , tornadoes and record highs", "date": "2024-05-24 10:45", "url": "https://abcnews.go.com/US/memorial-day-weekend-forecast-bring-severe-weather-tornadoes/story?id=110528770", "message": "It's been a very active week for severe storms and tornadoes -- and more rough weather is in the forecast for Memorial Day weekend.\nOn Friday, as people hit the road and head to the airport for Memorial Day weekend, more severe weather is in the forecast from Austin, Texas, to Chicago.\nSevere weather threat for Friday.\nABC NewsOn Memorial Day, the Northeast will face heavy rain and thunderstorms.\nMonday could be the hottest Memorial Day on record for San Antonio, Houston, New Orleans and Miami.", "location": "The focus of Memorial Day weather will be the northeast United States, from Texas to Chicago.", "classification": "natural-disasters", "score": 0.7118642150518174, "event_breakdown": ".\n1. Severe storms and tornadoes\n2. Heavy rain and thunderstorms\n3. Heat waves"}, {"id": "a90affa2-397d-4c03-a9ef-ebbf85ed30c4", "title": "Light earthquake 4 . 6 mag , southeast Indian Ridge", "date": "2024-05-24 22:45", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-6-mag-southeast-indian-ridge-10/", "message": "A light earthquake with magnitude 4.6 (ml/mb) was detected on Friday, southeast Indian Ridge (0 miles).\nExact location of earthquake, 99.0365° East, -48.1357° South, depth 10 km.\nIds that are associated to the earthquake: us6000n0nh.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: southeast Indian Ridge.", "location": "southeast Indian Ridge", "classification": "natural-disasters", "score": 0.8498105885899417, "event_breakdown": ".\nSoutheast Indian Ridge Earthquake (July 3, 2020) - A Magnitude 4.6 earthquake occurred on July 3, 2020, with the epicenter located approximately 10 kilometers (6 miles) beneath the surface in southeast Indian Ridge. The exact coordinates of the epicenter are 99.0365° East and -48.1357° South. The earthquake had a reported depth of 10 kilometers (6 miles)."}, {"id": "4376972f-350f-40ed-bea7-1128b4ed656a", "title": "Hurricane forecast points to a dangerous 2024 Atlantic season", "date": "2024-05-24 20:30", "url": "https://www.preventionweb.net/news/hurricane-forecast-points-dangerous-2024-atlantic-season-la-nina-and-persistently-warm-ocean", "message": "The 2024 Atlantic hurricane season starts on June 1, and forecasters are predicting an exceptionally active season.\nForecasters and climatologists look for two main clues when assessing the risks from upcoming Atlantic hurricane seasons: a warm tropical Atlantic Ocean and a cool tropical eastern Pacific Ocean.\nWarm Atlantic water can fuel hurricanesDuring the summer, the Atlantic Ocean warms up, resulting in generally favorable conditions for hurricanes to form.\nThis ocean tag team controls hurricane activityThe Atlantic and eastern Pacific ocean temperatures together control Atlantic hurricane activity.\nThe record 2020 hurricane season had the influence of both La Niña and high Atlantic ocean temperatures, and that's what forecasters expect to see in 2024.", "location": "The Atlantic Ocean.", "classification": "natural-disasters", "score": 0.8514803913962082, "event_breakdown": "2023 Atlantic hurricane season, 2024 Atlantic hurricane season, La Niña, strong hurricanes, record hurricane season."}, {"id": "82a24a80-61bd-4f94-ba24-e74fc6cc0a09", "title": "Light earthquake , 4 . 3 mag was detected near Attu Station in Alaska", "date": "2024-05-24 21:00", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-3-mag-was-detected-near-attu-station-in-alaska-3/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Friday, 90 km SSE of Attu Station, Alaska (56 miles).\nDate and time of earthquake in UTC/GMT: 24/05/24 / 2024-05-24 18:59:37 / May 24, 2024 @ 6:59 pm.\nEvent ids that are associated to the earthquake: us6000n0t9.\nId of event: us6000n0t9.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 90 km SSE of Attu Station, Alaska.", "location": "Attu Station, Alaska", "classification": "natural-disasters", "score": 0.8210606961638909, "event_breakdown": ".\nEarthquakes 4.0 to 5.0 are often felt, but only causes minor damage. In the past 24 hours, there have been one, in the last 10 days seven, in the past 30 days thirty-three and in the last 365 days fifty-four earthquakes of magnitude 3.0 or greater that have been detected in the same area. There are an estimated 13,000 light earthquakes in the world each year."}, {"id": "f1f0fa1e-5136-4b92-8d56-545ca5ed9924", "title": "Light earthquake : M4 . 5 quake has struck near northern Mid - Atlantic Ridge", "date": "2024-05-24 22:45", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-m4-5-quake-has-struck-near-northern-mid-atlantic-ridge-9/", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Saturday, northern Mid-Atlantic Ridge (0 miles).\nId of earthquake: us6000n0q1.\nExact location of earthquake, longitude -27.3563 West, latitude 46.4463 North, depth = 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: northern Mid-Atlantic Ridge.", "location": "northern Mid-Atlantic Ridge", "classification": "natural-disasters", "score": 0.9735615774364169, "event_breakdown": "null"}, {"id": "a63c4889-e672-4594-8dfc-0c74c9fb0c04", "title": "Light earthquake , 4 . 4 mag was detected near La Tirana in Chile", "date": "2024-05-24 21:00", "url": "https://www.earthquakenewstoday.com/2024/05/24/light-earthquake-4-4-mag-was-detected-near-la-tirana-in-chile/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 58 kilometers (36 miles) from La Tirana in Chile on Sunday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 50.266 km (31 miles) below the earth’s surface.\nEpicenter of the earthquake was 66 km (41 miles) from Iquique (c. 227 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 58 km S of La Tirana, Chile.", "location": "Iquique", "classification": "natural-disasters", "score": 0.9756407108392613, "event_breakdown": ".\n- A light earthquake magnitude 4.4 (ml/mb) struck 58 km S of La Tirana in Chile on Sunday\n- Epicenter of the earthquake was 66 km (41 miles) from Iquique\n- The earthquake occurred at a depth of 50.266 km (31 miles) below the earth’s surface"}, {"id": "165b65e6-b526-427c-b14b-b9b0faec0aac", "title": "SunLive - The need to prepare for megathrust earthquake", "date": "2024-05-24 20:15", "url": "https://www.sunlive.co.nz/news/343799-the-need-to-prepare-for-megathrust-earthquake.html", "message": "Whakatāne needs to prepare for a megathrust earthquake and resulting tsunami similar in size and strength to the 2011 Japan event, local GNS researcher Dr Mawera Karetai says.\nShe has planned a series of workshops with GNS seismologists for next month as she feels most people in town are “woefully ill-prepared” for an earthquake.\n“When we have a magnitude 9 earthquake the roading network will fail completely.\nWe have to prepare for infrastructure damage, liquefaction, fountaining fresh water from broken pipes and raw sewage,” she says.\nThe first of these, Earthquake Day, is intended for community leaders from organisations such as councils, schools, police and healthcare agencies.", "location": "Tauranga", "classification": "natural-disasters", "score": 0.9116938011610051, "event_breakdown": "Earthquake\nTsunami"}, {"id": "1f2d0aec-2f59-4954-a499-79877c787006", "title": "Early season disturbance shows little chance of developing", "date": "2024-05-24 21:15", "url": "https://wpde.com/weather/abc-15-weather-authority-blog/2024-hurricane-season-disturbance-bahamas-subtropical-cyclone-no-threat-named-storms-myrtle-beach-florence-south-carolina", "message": "Hurricane Season 2024 is a week away and a disturbance near the Bahamas shows a low chance of developing into a subtropical cyclone.\nThe good news is that the chance will stay low as wind shear is expected to disrupt chances of developing.\nEven if it were to develop, this system would be an ocean storm with threats only to maritime interests.\nThis early outlook shouldn't come as much of a surprise considering Hurricane Season is almost here.\nMay is the most active \"out-of-season\" month for tropical development in the Atlantic.", "location": "The Bahamas", "classification": "natural-disasters", "score": 0.9215070515337231, "event_breakdown": "1. Disturbance near the Bahamas shows a low chance of developing into a subtropical cyclone\n2. Wind shear is expected to disrupt chances of developing in the system near the Bahamas\n3. Ocean storm with threats only to maritime interests."}, {"id": "443bdcf0-392f-4cad-a2d0-30d8c789e363", "title": "Generator companies see increase in demand for hurricane season", "date": "2024-05-24 21:30", "url": "https://www.wafb.com/2024/05/24/generator-companies-see-increase-demand-hurricane-season/", "message": "(WAFB) - Predictions released Thursday by the National Oceanic and Atmospheric administration outline the busiest forecasted hurricane season in all 25 years that the group began issuing annual outlooks.\nHurricane season is less than one week away, and some people are scrambling to get ready.\nHe’s installing a backup generator at his house before another storm can knock out the power.\nHe says his company has seen an uptick in installations leading up to this hurricane season.\n“When hurricane season gets upon us, the demand always seems to go up and these recent thunderstorms have increased the demand for folks wanting to get generators,” Devile said.", "location": "Baton Rouge, Louisiana", "classification": "natural-disasters", "score": 0.7205411585708099, "event_breakdown": ".\n- Installing a backup generator at home\n- Hurricane season"}, {"id": "bf3567a3-62a1-43d6-a5cc-2a75d2093c10", "title": "Wildfire crews having to dig deep to contain Fort Nelson wildfires", "date": "2024-05-24 23:00", "url": "https://www.myprincegeorgenow.com/198205/featured/wildfire-crews-having-to-dig-deep-to-contain-fort-nelson-wildfires/", "message": "Drought conditions continue to be the major headline as fire crews battle the Parker Lake and Patry Creek wildfires surrounding the Fort Nelson area.\nCurrently, 158 firefighters, six danger-tree specialists, 21 helicopters, one fixed-wing aircraft along with an incident management team have been deployed up to this point.\nNorth Peace Complex Fire Information Officer, Dave MacKinnon told Vista Radio it’s been a challenge to say the least.\nIt’s the hand we are dealt.”- Advertisement -“Crews are focused on extinguishing fire along Highway 97 and the north flank of the Parker Lake wildfire in order to prevent any further growth towards Fort Nelson or the Alaska Highway.\nThe Parker Lake wildfire remains at 12,348 hectares while Patry Creek is 74,344 hectares.", "location": "The main location where the event is focused on the Parker Lake wildfire and Patry Creek wildfires.", "classification": "natural-disasters", "score": 0.41037202802389844, "event_breakdown": "Natural disasters events are:\nParker lake wildfire \nPatry Creek wildfire"}, {"id": "d0fb84d9-5c7a-4c1d-a78c-6eba8b6732f9", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 21:00", "url": "https://www.wcyb.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "NOAA- Atlantic Ocean", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "Based on the text you provided, here are the natural-disaster events listed in chronological order:\n\n1. Last year (2023) was the fourth most active season on record with 20 named storms.\n2. NOAA's latest prediction for the 2024 Atlantic hurricane season is that the season could become the busiest on record, with up to 25 named storms forming.\n\nThese events are related to tropical cyclones in the Atlantic ocean. Hurricanes and typhoons are both types of tropical cyclones. If you want to know the difference between a hurricane and a typhoon, you can read a more detailed article here."}, {"id": "1393744d-e439-4395-8c31-6b8cfdefbeee", "title": "Extreme weather . A lack of lifesaving vaccines . Africa cholera crisis is worse than ever", "date": "2024-05-24 08:15", "url": "https://www.news-gazette.com/news/nation-world/extreme-weather-a-lack-of-lifesaving-vaccines-africas-cholera-crisis-is-worse-than-ever/article_1fe112b1-2e9d-597f-bafd-105a0f2379ab.html", "message": "Champaign, IL (61820)TodayThunderstorms early, then partly cloudy after midnight.\nA few storms may be severe.\nWinds WSW at 10 to 15 mph.\nChance of rain 100%..TonightThunderstorms early, then partly cloudy after midnight.\nWinds WSW at 10 to 15 mph.", "location": "Champaign, IL", "classification": "natural-disasters", "score": 0.827990640650416, "event_breakdown": "The natural-disaster events mentioned in the text are:\n\n1. Thunderstorms\n2. Severe storms\n3. Winds"}, {"id": "8a5700d8-4003-45a0-a648-5d86c68c3cb6", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 20:30", "url": "https://news4sanantonio.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "Based on the provided information, there were no specific details concerning the location of the main event.", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "Below are the natural-disasters events from the text:\n\n- Earth's hottest summer since global records started in 1880\n- Storms\n- Named storms\n- Major hurricanes"}, {"id": "e8efc83d-c0c0-4996-b1b0-1a17d754c2fc", "title": "Friday storm not likely to worsen Cedar River flooding , but rain Sunday may raise crest prediction", "date": "2024-05-24 20:15", "url": "https://www.thegazette.com/weather/fridays-storm-not-likely-to-worsen-cedar-river-flooding-but-rain-sunday-may-raise-crest-prediction/", "message": "The Cedar River at Cedar Rapids is expected to crest at 13.3 feet early Sunday, the NWS reported Thursday.\nBut the city of Cedar Rapids is preparing for a potential 15-foot crest — three feet above minor flood stage.\nCedar River affecting Cedar County: The river is expected to rise above flood stage of 12 feet, cresting at 13.3 feet early Sunday morning.\nCedar River near Conesville: The river is expected to rise above flood stage of 13 feet, cresting at 14.7 feet early Monday morning.\nThe increased outflow has temporarily closed the Iowa River Trail at the Highway 6 underpass, located just south of Riverfront Crossings Park.", "location": "CEDAR RAPIDS", "classification": "natural-disasters", "score": 0.7119361498248565, "event_breakdown": "Natural-disasters events:\n1. Potential 15-foot crest of the Cedar River near Cedar Rapids:\nEvent: Increased outflow temporarily closed the Iowa River Trail at the Highway 6 underpass."}, {"id": "96a13919-c28e-4551-81e9-7742488523c1", "title": "Quad - Cities tornado warning , severe weather updates", "date": "2024-05-24 14:45", "url": "https://qctimes.com/news/local/weather/quad-cities-weather-severe-thunderstorms-tornado-warnings/article_7098d6ea-19cb-11ef-9876-c7115b6f95e2.html", "message": "4:15 p.m. updateThe Quad-Cities and portions of Illinois and Iowa are under a severe thunderstorm watch until 9 p.m., according to NWS QC.\n8:35 a.m. updateThe tornado warning for the Quad-Cities metro area has expired, though the warning remains in effect for areas to the east.\nThere is a tornado warning for the area east from there, including Geneseo, Atkinson and Hooppole, away from the Quad-Cities metro.\n7:45 a.m. updateAnother round of storms is making its way through Eastern Iowa Friday morning, with most of the Quad-Cities area under a severe thunderstorm warning through 8:30 a.m.\nPhotos: Quad-Cities area storm May 21, 2024", "location": "The Quad-Cities area", "classification": "natural-disasters", "score": 0.7003628564266667, "event_breakdown": ".\n1. A severe thunderstorm watch was issued for the Quad-Cities area and portions of Illinois and Iowa on May 21, 2024 at 4:15 p.m.\n2. A tornado warning was in effect for the Quad-Cities metro area on May 21, 2024 at 7:45 a.m.\n3. A severe thunderstorm warning was in effect for the Quad-Cities area on May 21, 2024 at 8:30 a.m."}, {"id": "63d08091-033c-4db5-8ac0-bcd19b4b61c7", "title": "In Brazil , mangrove reforestation proves crucial in fight against climate risks", "date": "2024-05-24 22:45", "url": "https://www.foxnews.com/world/brazil-mangrove-reforestation-proves-crucial-fight-climate-risks", "message": "Brazil’s southern state of Rio Grande do Sul is still reeling from a devastating flood earlier this month that wreaked havoc and took lives, with waters far from subsiding to normal levels.\nThe reforestation in Rio's bay improved the cleanliness of water that's a breeding ground for marine species.\nA lack of mangroves wasn’t the cause of flooding around Rio Grande do Sul's capital, Porto Alegre, that sits beside a lagoon.\nThe coastal risk map created by Climate Central, a nonprofit science research group, forecasts areas west and north of Porto Alegre will be underwater by 2100.\nEnvironmentalists say the loss of natural vegetation due to agriculture and cattle ranching in Rio Grande do Sul state amplified the flooding.", "location": "Rio Grande do Sul", "classification": "natural-disasters", "score": 0.9146461441876562, "event_breakdown": "Flooding in southwestern Brazil. Rio Grande do Sul state is still reeling from a devastating flood earlier this month that wreaked more havoc than a normal flood in the state's capital, Porto Alegre. The reforestation in Rio's bay improved the cleanliness of water that's a breeding ground for marine species. A lack of mangroves wasn't the cause of flooding around Porto Alegre, that sits beside a lagoon. The coastal risk map forecasts areas west and north of Porto Alegre will be underwater by 2100. The loss of natural vegetation amplified the flooding in Rio Grande do Sul state due to agriculture and cattle ranching."}, {"id": "d6c0d279-0d2a-46ca-957b-9e9908b9a0fc", "title": "Rio de Janeiro bay reforestation shows mangrove power to mitigate climate disasters", "date": "2024-05-24 21:00", "url": "https://abcnews.go.com/International/wireStory/rio-de-janeiro-bay-reforestation-shows-mangroves-power-110543182", "message": "Brazil’s southern state of Rio Grande do Sul is still reeling from a devastating flood earlier this month that wreaked havoc and took lives, with waters far from subsiding to normal levels.\nMangroves slow sea water's advance into riverbeds during storm surges by soaking it up, and protects the land by stabilizing soil that otherwise could be washed away.\nThe reforestation in Rio's bay improved the cleanliness of water that's a breeding ground for marine species.\nIn Rio, it shows two large areas in the back of its bay — one of which includes the Guapirimim protected area — will be underwater by 2050.\nEnvironmentalists say the loss of natural vegetation due to agriculture and cattle ranching in Rio Grande do Sul state amplified the flooding.", "location": "Brazil", "classification": "natural-disasters", "score": 0.8553929055076329, "event_breakdown": "-Brazil Floods\n-Municipal Guarapiranga Park with more than a 100 trees\n-Galera and Maringa rivers overflow\n-Taião waterway with intense flood water\n-Vice-Governor Luiz Henrique Has passed a law requiring replanting of some areas of vegetation\n-The reforestation in Rio's bay improved the cleanliness of water that's a breeding ground for marine species\n-The loss of natural vegetation due to agriculture and cattle ranching in Rio Grande do Sul state amplified the flooding"}, {"id": "accff346-457e-4514-921d-cf548ff0445d", "title": "NOAA predicts  above - normal  hurricanes over Atlantic this year | Bangalore News", "date": "2024-05-24 22:45", "url": "https://indianexpress.com/article/cities/bangalore/noaa-predicts-above-normal-hurricanes-over-atlantic-this-yr-9350660/", "message": "The National Oceanic and Atmospheric Administration (NOAA) has warned of above normal hurricane activity during June and November this year.\n“There is an 85% chance of an above-normal hurricane season,” NOAA said Thursday.\nThis comes ahead of the onset of the La Nina conditions over the central and equatorial Pacific Ocean, which is expected later this year.\nMultiple global weather models, including India’s, have suggested cooler-than-average sea surface temperatures — indicating La Nina conditions — to emerge by August this year.", "location": "pacific ocean", "classification": "natural-disasters", "score": 0.6509106788287767, "event_breakdown": "1. The National Oceanic and Atmospheric Administration (NOAA) has predicted above normal hurricane season in June and November.\n2. 85% chances of above normal hurricane season is also predicted by NOAA.\n3. La Nina conditions are expected to emerge this year, later in the year.\n4. Various global weather models like India's have suggested cooler-than-average sea temperatures by the time August arrives."}, {"id": "d770e5b0-64d8-4dd9-9f3c-79d1830ab71c", "title": "Memorial Day Weekend forecast to bring severe weather , tornadoes and record highs", "date": "2024-05-24 11:15", "url": "https://abc7ny.com/memorial-day-weekend-forecast-to-bring-severe-weather-tornadoes-an/14864943/", "message": "Memorial Day weekend weather: Tornadoes, record temps in forecastIt's been a very active week for severe storms and tornadoes -- and more rough weather is in the forecast for Memorial Day weekend.\nOn Friday, as people hit the road and head to the airport for Memorial Day weekend, more severe weather is in the forecast from Austin, Texas, to Chicago.\nOn Saturday, Kansas and Oklahoma could see strong tornadoes, severe wind gusts and large hail.\nOn Memorial Day, the Northeast will face heavy rain and thunderstorms.\nMonday could be the hottest Memorial Day on record for San Antonio, Houston, New Orleans and Miami.", "location": "Kansas", "classification": "natural-disasters", "score": 0.7191147344462443, "event_breakdown": "Here are the natural-disasters events in the text:\n- Severe storms and tornadoes\n- Strong tornadoes\n- Large hail\n- Heavy rain\n- Thunderstorms"}, {"id": "54f97a17-7cb0-4e84-aecf-806d89032a9f", "title": "Memorial Day Weekend forecast to bring severe weather , tornadoes and record highs", "date": "2024-05-24 11:30", "url": "https://abc30.com/memorial-day-weekend-forecast-to-bring-severe-weather-tornadoes-an/14864943/", "message": "Memorial Day weekend weather: Tornadoes, record temps in forecastIt's been a very active week for severe storms and tornadoes -- and more rough weather is in the forecast for Memorial Day weekend.\nOn Friday, as people hit the road and head to the airport for Memorial Day weekend, more severe weather is in the forecast from Austin, Texas, to Chicago.\nOn Saturday, Kansas and Oklahoma could see strong tornadoes, severe wind gusts and large hail.\nOn Memorial Day, the Northeast will face heavy rain and thunderstorms.\nMonday could be the hottest Memorial Day on record for San Antonio, Houston, New Orleans and Miami.", "location": "TEXAS", "classification": "natural-disasters", "score": 0.7191147344462443, "event_breakdown": "Severe storms, tornadoes, record temperatures and heavy rain."}, {"id": "273728ea-0b64-404d-a6cc-410bb6269e50", "title": "Unstable air mass to bring rainy conditions to Prince George", "date": "2024-05-24 23:00", "url": "https://www.myprincegeorgenow.com/198203/news/unstable-air-mass-to-bring-rainy-conditions-to-prince-george/", "message": "Six consecutive days of rain look to be on the horizon for Prince George.\nAccording to Environment Canada, the showery activity is expected to begin today (Friday) and is not expected to wrap up until Wednesday.\nMeteorologist, Brian Proctor told MyPGNow.com an unstable front is bringing the rain along with it.\n“A fairly unsettled and fairly unstable air mass is lingering across portions of Western Canada.\nThe unfortunate thing is we have this long-standing moisture deficit through much of the fire centre at this point.", "location": "Prince George", "classification": "natural-disasters", "score": 0.4631150622422936, "event_breakdown": "1. Prince George is expected to have six consecutive days of rain, according to Environment Canada.\n2. The rainy period will start on Friday and will end on Wednesday.\n3. A frontal instability will spread rains over Western Canada and Prince George.\n4. The wildfires in Colorado are generating a significant risk for mudslides.\n5. The wildfire perimeter is mapped and traced by a combination of manual and digital methods.\n6. A combination of manual and digital mapping methods will help identify areas susceptible to mudslides.\n7. Meteorologist, Brian Proctor, stated an unstable air mass is currently moving over.\n8. The rain is expected to spell relief for the wildfires that have been affecting western Canada for months.\n9. The standing moisture deficit is something that means there will be some challenging days ahead in terms of water resource management.\n10. This bad weather batch is headed towards Wellington county as of the posting of this article.\n11. The bad ugly came in behind a brought up a cool front from the gulf of Alaska on Tuesday.\n12. There are strong winds and rain in the forecast along with thunderstorms gusting above 100km/h."}, {"id": "06a14980-32cb-4923-b14a-d477e9e7f99c", "title": "Extreme Hurricane Season Could Trigger  Carrier Revenge  ", "date": "2024-05-24 17:45", "url": "https://www.benzinga.com/news/24/05/39008890/extreme-hurricane-season-could-trigger-carrier-revenge", "message": "In fact, if the economy continues to grow, freight market volumes will do so as well.\nOn average, a hurricane season usually has 14 named storms and three Category 3 or greater storms.\nWhether the hurricane season lives up to NOAA's forecast or ends on a whimper, one thing is certain: at some point, the freight market pendulum will swing against shippers and when it does trucking firms will inflict carrier revenge.\nIn many ways, Carrier's revenge is more vicious than shipper's revenge in the sense that price is easier for shippers to deal with than having freight left on their docks and factories disrupted.\nThe post Extreme hurricane season could trigger ‘carrier revenge' appeared first on FreightWaves.", "location": "Wilmington, North Carolina", "classification": "natural-disasters", "score": 0.7918288566629507, "event_breakdown": "1. The hurricane season\n2. Named storms' number\n3. Category 3 or greater storms' number"}, {"id": "9a309c97-0e5d-4278-8017-3cf18fd26caa", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 18:30", "url": "https://ktvl.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "The Atlantic Ocean.", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The events related to natural-disasters mentioned in the text are:\n\n1. Earth's hottest summer since 1880.\n2. Prediction of 25 named storms for 2024 by NOAA, which is the highest the agency has ever predicted in a pre-season outlook.\n3. Forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\n4. Naming of 20 named storms in 2023, which was the fourth most active season on record."}, {"id": "05a0da53-02b7-414a-aa6d-145f2093132a", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 18:30", "url": "https://abc7amarillo.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "Based on the context provided, it was not possible to determine a specific location for the event described.", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The events related to natural disasters in the text are:\n- Record warmer temperatures globally\n- Prediction of 25 named storms for 2024 hurricane season\n- Climate change driving increasingly active and destructive hurricane seasons potentially rivaling 2021 and 2023"}, {"id": "4229be39-75da-4c70-861a-974214b11b3f", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 19:45", "url": "https://newschannel9.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "NOAA's predictions indicate that Atlantic hurricane season, which is from June 1 to", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "Natural-disasters events as listed in the text:\n1. Earth's hottest summer\n2. 25 named storms in 2024\n3. Named storm in 2023 active season\n4. 14 named storms"}, {"id": "dc3931f1-f5d1-419d-9faf-ad4d510b6c41", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 21:00", "url": "https://fox42kptm.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "NOAA predicts as many as 25 named storms for the Atlantic Ocean.", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "1. NOAA predicts up to 25 named storms in 2024, breaking the previous record of pre-season outlook predictions.\n2. Last summer being Earth's hottest on record since 1880.\n3. 2023 being the fourth most active season on record for named storms, with 20.\n4. On average, the Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes."}, {"id": "664ef5f5-ca2c-4c57-9c94-27bdd07e0d0f", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 21:00", "url": "https://siouxlandnews.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": ")\nthe Atlantic Ocean", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "Here is a list of natural-disaster events mentioned in the text:\n\n1. 2021 heatwave\n2. Pre-season outlook for 2024 hurricanes\n3. 2023 hurricanes\n4. NOAA weather record for 1880\n5. Active hurricane seasons\n6. 2022 heat waves risk\n7. 2023 hurricane season\n8. Named storms occurring in 2023"}, {"id": "f663253d-fddf-4111-b2be-292e7808c2e5", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 19:15", "url": "https://fox23maine.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "The Atlantic ocean.", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "The following is a summary of the natural-disasters events mentioned in the text:\n\n- Record-breaking heat in Summer 2023\n- Record number of named storms predicted by NOAA in 2024 Atlantic hurricane season\n- Between 17 and 25 total named storms with winds of 39 MPH or higher predicted for 2024 Atlantic hurricane season.\n- 20 named storms in 2023, which was the fourth most active season on record."}, {"id": "63f6fed5-b06b-4087-84e0-43740d102778", "title": "Fact Check Team : Feeling the heat ? This summer could break records", "date": "2024-05-24 20:45", "url": "https://okcfox.com/news/nation-world/feeling-the-heat-this-summer-could-break-records-solstice-warm-temperatures-record-national-oceanic-atmospheric-administration-noaa-climate-predictions-hurricanes-storms-weather-tropical", "message": "This summer could rival last summer, which was Earth’s hottest since global records started back in 1880, .\nNOAA predicts as many as 25 named storms for 2024, which is the the agency has ever predicted in a pre-season outlook.\nSpecifically, experts forecast between 17 and 25 total named storms with winds of 39 MPH or higher.\nFor context, there were 20 named storms in 2023, which was the fourth most active season on record.\n, an average Atlantic hurricane season has 14 named storms, seven hurricanes and three major hurricanes.", "location": "Atlantic ocean", "classification": "natural-disasters", "score": 0.5818825562482287, "event_breakdown": "Natural-disasters events from the text:\n- Record heat across Earth in 2023\n- Record number of named storms forecast for 2024 season"}, {"id": "fc8ff98b-5bec-4a60-8730-b3b10d9e101b", "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage", "date": "2024-05-24 10:45", "url": "https://muscatinejournal.com/news/state-and-regional/iowa/more-severe-weather-forecast-in-midwest-as-iowa-residents-clean-up-tornado-damage/article_8021a534-8703-5c97-bbc5-246e759b7063.html", "message": "A tornado was on the ground in southwestern Oklahoma for nearly an hour on Thursday evening, the National Weather Service said.\nThe weather service will have to investigate to determine how powerful the tornado was and for what distance it was on the ground, she said.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“Because of the damage already there, it won’t take much wind to inflict even more damage on these homes,” Ansorge said.\n“It’s just a bad deal all the way around.”More severe weather also could arrive Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "OKLAHOMA", "classification": "natural-disasters", "score": 0.7602832019639287, "event_breakdown": "Tornado\nSevere weather\nTornado damage"}, {"id": "94c647ac-4ba8-410f-b713-454f458aa754", "title": "Earthquake rumbles through New Jersey early Friday morning", "date": "2024-05-24 13:15", "url": "https://nj1015.com/tewksbury-earthquake-report/", "message": "⭕ The earthquake had an epicenter in Tewksbury, according to the USGS⭕ There have been over 160 aftershocks since the April 4 earthquake⭕ There are no reports of any damageA small earthquake that shook New Jersey early Friday morning is another aftershock of the April 4 earthquake.\nThe U.S. Geological Survey reported a magnitude 2.9 earthquake centered west southwest of Gladstone around 3:50 a.m. Friday.\nIt appears to have an epicenter along Flint Hill Road in Tewksbury.\nThe USGS received over 800 reports from individuals feeling the earthquake as of 11:30 a.m. Friday.\nUPDATED: Memorial Day Parades in New Jersey 2024 (alphabetical) New Jersey remembers those who made the ultimate sacrifice on Memorial Day with parades, solemn services, reenactments and fairs.", "location": "TEWKESBURY", "classification": "natural-disasters", "score": 0.5468866555408807, "event_breakdown": "1) A small earthquake shook New Jersey on April 8, 2024, which was reported as a magnitude 2.9 earthquake, centered West-Southwest of Gladstone at 3:50 AM.\n2) The earthquake had a reported epicenter along Flint Hill Road in Tewksbury.\n3) The U.S. Geological Survey received over 800 reports from individuals feeling the earthquake as of 11:30 AM on Friday the 8th."}, {"id": "2cca1483-8f8a-4f04-8837-32081331dac1", "title": "Clouds & showers for Memorial Day weekend", "date": "2024-05-24 03:15", "url": "https://www.alaskasnewssource.com/2024/05/24/clouds-showers-memorial-day-weekend/", "message": "ANCHORAGE, Alaska (KTUU) - A circulating area of low pressure will slowly move out of the Bering Sea and head toward the Gulf of Alaska as we move through Friday.\nThis storm will be the weather driver over the weekend, with another low rotating into the western Aleutian Chain by Sunday.\nScattered showers will be a factor through much of the rest of the weekend over the region.\nFlood watches continue for snowmelt flooding on the Yukon River at Fort Yukon, the Porcupine River, and again on the Yukon River downstream of Mountain Village down to the Yukon Delta coast.\nThursday’s hot spot went to Fort Yukon at 62 degrees.", "location": "Anchorage, Alaska", "classification": "natural-disasters", "score": 0.9323282927883783, "event_breakdown": "1. A circulating area of low pressure moving from Bering Sea to Gulf of Alaska\n2. Another low rotating into the western Aleutian Chain\n3. Flood watches for snowmelt flooding on Yukon River\n4. Flood watch on Porcupine River\n5. Flood watch on Yukon River downstream of Mountain Village to Yukon Delta coast"}, {"id": "ccc471f6-e339-4927-a675-fe64e662f8b7", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 01:15", "url": "https://www.lbc.co.uk/world-news/351401c0c0a446a18334b4884eab8649/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "GREENFIELD", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "Those are the following events:\n- Tornado in Iowa\n- Tornado in Texas, Oklahoma, and Kansas"}, {"id": "3a0e5f13-c93e-4460-9a44-5ec408586539", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 03:45", "url": "https://www.edp24.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "Iowa.", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "Here is a list:\n1. The Greenfield tornado - An EF-3 tornado that obliterated homes, power plants, and wind turbines that affects the south of Midwest United States.\n2. Late Wednesday and Thursday flashpoint for tornadoes inside and outside the USA."}, {"id": "b2e6a2ea-6339-4a1d-910f-28313b5ecbc4", "title": "NOAA predicts above - normal 2024 Atlantic Hurricane Season : See their prediction", "date": "2024-05-24 05:00", "url": "https://www.wogx.com/news/2024-noaa-atlantic-hurricane-season-prediction", "message": "NOAA has released its seasonal hurricane outlook for the Atlantic basin, and due to warm waters and a diminishing El Niño, the agency believes the year could be ferocious.\nIt's the greatest number of hurricanes predicted by NOAA in its annual May forecast, surpassing the forecast of 14-23 storms in 2010.\n2024 ATLANTIC HURRICANE SEASON GUIDE: HERE’S WHAT TO KNOW ABOUT THIS YEAR’S STORMSContinued record warm water temperatures across the Atlantic, with a neutral or even a La Niña climate pattern in place are expected to lead to high counts of cyclones.\nBut meteorologists stress that no matter whether the hurricane season is predicted to be busy or quiet, being prepared is imperative.\nIf you get impacted, it will be the worst hurricane season you have been through.\"", "location": "Atlantic ocean", "classification": "natural-disasters", "score": 0.9096593229899869, "event_breakdown": ".\nAtlantic hurricane season 2024\n1. Record warm water temperatures in the Atlantic...\n2. Neutral into a La Niña climate pattern...\n3. High counts of cyclones in the Atlantic...\n4. Be prepared for the hurricane season 2024."}, {"id": "5e6f9048-4012-4f24-b0c3-36dd220540ba", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 01:15", "url": "https://www.theargus.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "IOWA.", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "Here is a map of tornado reports across the Midwestern United States Wednesday (source/weather.com)\n1. Greenfield, Iowa\n2. New Richmond, Wisconsin\n3. Marshville, Wisconsin\n4. Evansville, Indiana\n5. Poplar Bluff, Missouri\n6. Collinwood, Tennessee\n7. Baldwyn, Mississippi\n8. Woolsey, GA,\n9. Galway, NY\n10. Columbiana, Ohio\n11. Hardyston, New Jersey\n12. Lake City, South Carolina\n13. Buford, GA\n14. St. Peter, Minnesota"}, {"id": "325156a1-ad79-4c92-b6f6-57b2d9e81393", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 03:00", "url": "https://www.echo-news.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "Iowa", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "Iowa experienced 4 tornados on Tuesday alone."}, {"id": "4c142c4d-9402-4e87-bdfb-2f4f61c77f3d", "title": "More bad weather could hit Iowa , where 3 powerful tornadoes caused millions in damage", "date": "2024-05-24 04:00", "url": "https://timesofindia.indiatimes.com/world/us/more-bad-weather-could-hit-iowa-where-3-powerful-tornadoes-caused-millions-in-damage/articleshow/110379345.cms", "message": "\"Still more severe weather was moving across the Midwest.\nTornado warnings were issued Thursday evening for southwestern Oklahoma and in central Texas.This latest band of severe weather - including possible tornadoes - will hit Iowa \"when people are sleeping,\" warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n\"Because of the damage already there, it won't take much wind to inflict even more damage on these homes,\" Ansorge said.\n\"More severe weather also could hit Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.\nMonica Zamarron, 46, died in the crash Tuesday afternoon, officials said.Reynolds has requested an expedited presidential disaster declaration for those Iowa counties that sustained significant damage.", "location": "Iowa", "classification": "natural-disasters", "score": 0.9043850883318727, "event_breakdown": "1. Tornadoes in Oklahoma and central Texas\n2. Storm damage in Texas, Oklahoma and Kansas\n3. Fatal crash in Texas"}, {"id": "8e64758f-2b68-499a-bf30-293d2ba636d9", "title": "Tracking an active holiday weekend with several storm chances", "date": "2024-05-24 00:30", "url": "https://wishtv.com/weather/weather-blog/tracking-an-active-holiday-weekend-with-several-storm-chances/", "message": "Tracking an active holiday weekend with several storm chancesINDIANAPOLIS (WISH) — It was a mostly tolerable Thursday for us other than some showers and storms that skirted through areas south of interstate 70 this morning and into mid-afternoon.\nWe’re continuing to fine tune details on what will be an active Indy 500 weekend including potential for severe weather at times.\nThis late Friday round we’ll watch from the west is why we have a Slight Risk (level 2/5) of severe weather across a good chunk of Indiana.\n8-Day Forecast: Race day on Sunday is still shaping up to be quite active with on and off showers/storms.\nRain and storm chances will carry into Memorial Day on Monday.", "location": ")\nINDIANAPOLIS", "classification": "natural-disasters", "score": 0.924076518852588, "event_breakdown": "Based on the text you provided, here's the list of natural-disaster events mentioned in the text:\n\n1. Early morning showers and storms on Thursday, south of interstate 70.\n2. An active Indy 500 weekend with potential for severe weather.\n3. Potential for severe weather Friday evening, coming from west.\n4. Potential for severe weather on Sunday during the race.\n5. On and off showers and storms on Sunday during the race.\n6. Rain and storm chances continuing into Memorial Day on Monday."}, {"id": "30beb09d-9f14-46a1-b755-eb87d8e349ac", "title": "Warming Climate Intensifies Flash Droughts Worldwide", "date": "2024-05-24 10:00", "url": "https://www.wateronline.com/doc/warming-climate-intensifies-flash-droughts-worldwide-0001", "message": "Sudden, severe dry spells known as flash droughts are rising in intensity around the world, with a notable exception in mountainous Central Asia, where flash drought extent is shrinking, according to new research.\nFlash droughts arrive suddenly, within weeks, hitting communities that are often not prepared and causing lasting impact.\nLand cover is also important to flash drought vulnerability.\nSavanna and grasslands are more susceptible to flash droughts than other ecotypes, particularly in humid and semi-humid climates, the study found.\nIn Central Asian watersheds, centered on high mountains, including the Himalaya Karakoram, Tianshan and Hindu Kush, flash drought extent shrank over the study period, bucking the worldwide trend.", "location": "The main location where the flash droughts occur is Central Asia. The flash drought extent in Central Asia", "classification": "natural-disasters", "score": 0.6632325392128671, "event_breakdown": "Flash droughts."}, {"id": "02816b07-5bcf-4890-80fa-2b9d921ab198", "title": "Heavy rains return to southern Brazil , flooding even higher ground in Porto Alegre", "date": "2024-05-24 03:00", "url": "https://www.voanews.com/a/heavy-rains-return-to-southern-brazil-flooding-even-higher-ground-in-porto-alegre/7625112.html", "message": "Heavy rains once again pounded parts of Brazil's southernmost state on Thursday, ruining days-long cleanup efforts and flooding areas that had previously been untouched in Rio Grande do Sul's capital city of Porto Alegre.\nBut the skies opened on Thursday morning, dumping heavy rains and flooding areas of Porto Alegre all over again.\nThe flooding Thursday also hit areas of Porto Alegre, including the south, which had previously gone unscathed.\nEarlier this week, the city of Porto Alegre had asked residents to leave their trash out on the sidewalk to be thrown away.\nPorto Alegre Mayor Sebastiao Melo told reporters the city was not surprised by the downpour, but that it was \"excessively heavy.\"", "location": "Porto Alegre", "classification": "natural-disasters", "score": 0.5252275511604629, "event_breakdown": "Heavy rains once again pounded parts of Brazil's southernmost state on Thursday, ruining days-long cleanup efforts and flooding areas that had previously been untouched in Rio Grande do Sul's capital city of Porto Alegre.\n\nHeavy rains.\nFloods.\nFloodwaters hit areas of Porto Alegre, including the south, which had previously gone unscathed."}, {"id": "77fc1a3e-307b-490f-b841-99f7c05dd8c4", "title": "Drought conditions have eased , but Calgarians still asked to  make every drop count  ", "date": "2024-05-24 21:30", "url": "https://globalnews.ca/news/10523296/eased-drought-conditions-calgary-water-use/", "message": "As of Friday morning Environment Canada said 50.9 millimetres of precipitation had fallen so far this month at Calgary International Airport.\nThat includes 42.1 mm of rain and 8.8 mm of snow and is just short of the average precipitation for May.\nIn a normal year, the airport weather station records 56.8 of precipitation in May, including 46.1 mm of rain and 11.9 mm of snow.\nHowever, with showers and the possibility of thundershowers in the forecast throughout the weekend there’s a strong chance Calgary will approach or exceed the normal precipitation levels this month.\nEnvironment Canada says in a normal year the Calgary airport weather station records 56.8 of precipitation for the month of May.", "location": "Calgary International Airport", "classification": "natural-disasters", "score": 0.4713075966046001, "event_breakdown": "Natural-disaster event list:\n1. Heavy precipitation in Calgary in May 2023."}, {"id": "f52c35cf-86f6-4d76-aca0-f9835da9efa2", "title": "More bad weather could hit Iowa , where 3 powerful tornadoes caused millions in damage", "date": "2024-05-24 03:00", "url": "https://www.wowt.com/2024/05/23/more-bad-weather-could-hit-iowa-where-3-powerful-tornadoes-caused-millions-damage/", "message": "More than 202 homes were destroyed by a series of tornadoes that raked the state on Tuesday, Iowa Gov.\nStorms spun up fierce tornados in Iowa Tuesday that took down several 250-foot wind turbines and caused extensive damage in at least one rural town.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping,” warned National Weather Service meteorologist Andrew Ansorge of Des Moines.\n“Because of the damage already there, it won’t take much wind to inflict even more damage on these homes,” Ansorge said.\n“It’s just a bad deal all the way around.”More severe weather also could hit Saturday and Sunday in storm-damaged parts of Texas, Oklahoma and Kansas.", "location": "Iowa", "classification": "natural-disasters", "score": 0.8423487134012516, "event_breakdown": "Here is the list of natural disasters mentioned in the text:\n- Tornado in Iowa on March 5, 2019\n- Another severe weather event occurring in storm-damaged parts of Texas, Oklahoma and Kansas on March 14-15"}, {"id": "c8ea2045-910b-44ed-a9e3-26346aa08fef", "title": "NJ earthquake shakes Gladstone this morning – NBC10 Philadelphia", "date": "2024-05-24 14:00", "url": "https://www.nbcphiladelphia.com/news/national-international/earthquake-nj-gladstone/3867577/", "message": "Yet another earthquake was recorded in New Jersey overnight, not far from the location where the U.S. Geological Survey reported two other quakes in recent weeks -- and a rare magnitude 4.8 quake in early April.\nThis time, it was a 2.9 magnitude, USGS says, recorded about 4 miles west-southwest of Gladstone in Somerset County.\nThe same area saw a 2.9 magnitude earthquake days earlier.\nIt follows dozens of aftershocks following that relatively \"big\" 4.8 magnitude earthquake that rattled more than 40 million people on the East Coast shortly before the solar eclipse.\nThe New Jersey magnitude 4.8 earthquake was felt from hundreds of miles away, with some in the tri-state feeling the Earth move under their feet for the first time ever.", "location": "GLADSTONE, SOMERSET COUNTY", "classification": "natural-disasters", "score": 0.9195969182092223, "event_breakdown": "Here is the complete text about the events:\n2.9 magnitude earthquake just east of Gladstone (Somerset County), New Jersey"}, {"id": "7f1e761b-9711-447f-bc62-68af48de4e7e", "title": "Brazil flood crisis deepens as heavy rains pound southern state", "date": "2024-05-24 04:30", "url": "https://www.firstpost.com/world/brazils-flood-crisis-deepens-as-heavy-rains-pound-southern-state-13774436.html", "message": "ReutersHeavy rains once again pounded parts of Brazil’s southernmost state on Thursday, ruining days-long clean-up efforts and flooding areas which had previously been untouched in Rio Grande do Sul’s capital city of Porto Alegre.\nAdvertisementBut the skies opened once more on Thursday morning, dumping heavy rains and flooding areas of Porto Alegre all over again.\nThe flooding on Thursday also hit areas of Porto Alegre, such as in the south, which had previously gone unscathed.\nEarlier this week, the city of Porto Alegre had asked residents to leave their trash out on the sidewalk to be thrown away.\nPorto Alegre Mayor Sebastiao Melo told reporters the city was not surprised by the downpour, but that it was “excessively heavy.”AdvertisementResidents, however, complained about the lack of warning.", "location": "Porto Alegre", "classification": "natural-disasters", "score": 0.5496175312875048, "event_breakdown": "Heavy rains once again pounded parts of Brazil’s southernmost state on Thursday, flooding areas which had previously been untouched in Rio Grande do Sul’s capital city of Porto Alegre."}, {"id": "09d13dfb-24fd-49e2-a1f1-bd8d48507ec9", "title": "Severe storm in Coleman shatters windows and brings community together", "date": "2024-05-24 00:15", "url": "https://www.ktxs.com/news/local/severe-storm-in-coleman-shatters-windows-and-brings-community-together", "message": "Severe storms swept through Coleman yesterday afternoon.\nHeavy rainfall caused multiple streets to be blocked off due to flooding, and residents say hail showered Coleman for approximately 30 minutes.\nMartin Quinonez says he was at work when the storm struck, but his wife and kids were home.\nMy wife’s whole family was here to tarp and cardboard everything.”Busted windows and shattered home structures are a common sight in Coleman due to the severe storm that struck around 3 p.m. on Wednesday.\nQuinonez says the storm may have caused many people to panic but it also brought out the community’s kindness.", "location": ")\nColeman, Texas", "classification": "natural-disasters", "score": 0.8852409749404953, "event_breakdown": "Severe Storms in Coleman:\n- Heavy rainfall\n- Flooding\n- Hail storms\n- Broken windows\n- Shattered homes"}, {"id": "c08c24d5-2305-4c10-b55c-d6e8d9aa9c5f", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 04:15", "url": "https://www.thenorthernecho.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "IOWA", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "1. On Tuesday, Feb. 12, 2024, Iowa experienced its third EF-4 tornado of 2024.\n2. Iowa was hit with severe weather on Tuesday night into Wednesday afternoon, including possible tornadoes.\n3. On Saturday morning, Feb. 16, 2024, a severe storm hit Griswold, Iowa, and relentless weather continued to hammer much of the midwestern United States.\n4. Greenfield, Iowa, experienced an EF-3 tornado.\n5. A new record was set for the longest streak of severe storms in Oklahoma, with the most widespread wind damage and major hail."}, {"id": "51a46374-32bf-43c8-b8fd-b021598ade4c", "title": "Heavy rains return to southern Brazil , flooding even higher ground in Porto Alegre", "date": "2024-05-24 01:15", "url": "https://www.yahoo.com/news/heavy-rains-return-southern-brazil-005137734.html", "message": "By Debora ElyPORTO ALEGRE, Brazil (Reuters) - Heavy rains once again pounded parts of Brazil's southernmost state on Thursday, ruining days-long clean-up efforts and flooding areas which had previously been untouched in Rio Grande do Sul's capital city of Porto Alegre.\nBut the skies opened once more on Thursday morning, dumping heavy rains and flooding areas of Porto Alegre all over again.\nThe flooding on Thursday also hit areas of Porto Alegre, such as in the south, which had previously gone unscathed.\nPorto Alegre Mayor Sebastiao Melo told reporters the city was not surprised by the downpour, but that it was \"excessively heavy.\"\n(Report by Debora Ely in Porto Alegre; Additional reporting by Diego Vara; Writing by Andre Romani; Editing by Kylie Madry and Michael Perry)", "location": "PORTO ALEGRE", "classification": "natural-disasters", "score": 0.5534710353213809, "event_breakdown": "Rains in Brazil's southernmost state of Rio Grande do Sul, flooding in the city of Porto Alegre."}, {"id": "372e2f58-cae4-4395-8fe1-b9f4077bccf8", "title": "  Heat dome  leads to sweltering temperatures in Mexico , Central America and US South", "date": "2024-05-24 00:15", "url": "https://upnorthlive.com/news/nation-world/heat-dome-leads-to-sweltering-temperatures-in-mexico-central-america-and-us-south", "message": "The high temperatures are stretching across the Gulf of Mexico into parts of the United States including Texas and Florida.\nMiami International Airport recorded a daily high of 96 degrees Fahrenheit (35.6 degrees Celsius) on May 19.\nThat surpassed the temperatures of 86 to 88 degrees (about 30 degrees Celsius) Miami normally sees this time of year.\nTemperatures along the Rio Grande were expected to rise up to 111 degrees Fahrenheit (43.9 degrees Celsius) and 95 degrees Fahrenheit (35 degrees Celsius) in the Davis and Chinati mountains.\nExperts say the heat event raises concerns about ocean water temperatures and their influence on the upcoming Atlantic hurricane season.", "location": "MIAMI", "classification": "natural-disasters", "score": 0.5650450629687563, "event_breakdown": "High-Temperature Event\nHeatwave"}, {"id": "bb85cf56-040c-4e94-b0bf-36c805c97362", "title": "  Heat dome  leads to sweltering temperatures in Mexico , Central America and US South – Daily Press", "date": "2024-05-24 00:15", "url": "https://www.dailypress.com/2024/05/23/heat-dome-leads-to-sweltering-temperatures-in-mexico-central-america-and-us-south/", "message": "The high temperatures are stretching across the Gulf of Mexico into parts of the United States including Texas and Florida.\nMiami International Airport recorded a daily high of 96 degrees Fahrenheit (35.6 degrees Celsius) on May 19.\nThat surpassed the temperatures of 86 to 88 degrees (about 30 degrees Celsius) Miami normally sees this time of year.\nTemperatures along the Rio Grande were expected to rise up to 111 degrees Fahrenheit (43.9 degrees Celsius) and 95 degrees Fahrenheit (35 degrees Celsius) in the Davis and Chinati mountains.\nExperts say the heat event raises concerns about ocean water temperatures and their influence on the upcoming Atlantic hurricane season.", "location": "MIAMI.", "classification": "natural-disasters", "score": 0.5650450629687563, "event_breakdown": "High temperatures stretching across the United States."}, {"id": "bcef326b-6e16-4376-b1b0-3524ff2c9e90", "title": "2 . 9 magnitude N . J . earthquake reportedly felt on Staten Island", "date": "2024-05-24 20:15", "url": "https://www.silive.com/news/2024/05/29-magnitude-nj-earthquake-felt-on-staten-island.html", "message": "STATEN ISLAND, N.Y. — An early morning 2.9 magnitude N.J. earthquake was reportedly felt on Staten Island.\nThe tremor took place around 3.7 miles west-southwest of Gladstone, N.J., around 3:50 a.m. Friday, according to the U.S. Geological Survey (USGS).\nWhile no damage has been reported from the incident, light shaking was felt as far as the North Shore of Staten Island, as noted by the USGS “Did You Feel It” page.\nIn the wake of the initial 4.8 magnitude earthquake back on April 5, there have been at least 160 aftershocks, with the majority falling below a 2.0 magnitude, as reported by NJ.com.\nIn the moments following the first quake, officials warned of the potential for aftershocks in the weeks to come.", "location": "N.J.", "classification": "natural-disasters", "score": 0.7486501799573647, "event_breakdown": "1. A 2.9 magnitude N.J. Earthquake was reportedly felt in the early morning on Staten Island on Friday .\n2. No damage has been reported from the quake, but light shaking was felt as far as the North Shore of Staten Island .\n3. There have been at least 160 aftershocks after the initial 4.8 magnitude earthquake ."}, {"id": "ec60f410-90d7-43b8-9bdc-0bc952d4f606", "title": "Flower farm north of Lincoln grapples with wild spring weather", "date": "2024-05-24 03:00", "url": "https://www.1011now.com/2024/05/24/flower-farm-north-lincoln-grapples-with-wild-spring-weather/", "message": "In some cases, it’s been too much rain, and for some farmers, it’s made life a little easier.\nAt this time last year, 86 percent of the state was in some form of drought compared to only six percent today, according to the Drought Monitor.\nFor Sara Rippe, owner of SR Pumpkin and Flower Farm just north of Lincoln, she has experienced various challenges that come with the weather.\nUNL Climatologist, Brian Fuchs says the moisture conditions started prior to this spring.\nClick here to subscribe to our 10/11 NOW daily digest and breaking news alerts delivered straight to your email inbox.", "location": "Lincoln", "classification": "natural-disasters", "score": 0.6341534665066078, "event_breakdown": "Here are the natural-disasters events in the text:\n- Excessive rain\n- Drought"}, {"id": "0911f438-6c73-4d64-9277-1b90b4dc8cec", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 03:00", "url": "https://www.eveningnews24.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "IOWA", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "1. Caseyville Tornado\n2. Greenfield Tornado (EF-3)\n3. Erick-Stateline / Quapaw-Ottawa Tornado\n4. Dave Hall-Rockport Tornado\n5. Treynor / Dawson Tornado\n6. Saturday May 23, 2023"}, {"id": "ee74ab7a-7b18-4ed7-8626-6a1d5b5a550f", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 03:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/05/24/more-bad-weather-could-hit-iowa-where-three-tornadoes-caused-millions-in-damage/", "message": "The winds pulled entire homes away, he said: “About every house on the block, just foundations left.”Still, more severe weather was moving across the Midwest.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "The main event takes place in Iowa.", "classification": "natural-disasters", "score": 0.7302733224451983, "event_breakdown": "Possible tornadoes (Iowa), Tornado, High winds"}, {"id": "f9a8ccb0-374b-4c8d-9831-2313828314cf", "title": "More bad weather could hit Iowa , where three tornadoes caused millions in damage", "date": "2024-05-24 01:15", "url": "https://www.oxfordmail.co.uk/news/national/24342555.bad-weather-hit-iowa-three-tornadoes-caused-millions-damage/", "message": "Joan Mitchell, left, talks with her neighbour Edith Schaecher in front of their tornado damaged homes in Greenfield, Iowa (Charlie Neibergall/AP)Most were in and around Greenfield.\nThis latest band of severe weather — including possible tornadoes — will hit Iowa “when people are sleeping”, warned NWS meteorologist Andrew Ansorge of Des Moines.\n“It’s just a bad deal all the way around.”More severe weather could also hit on Saturdays and Sundays in storm-damaged parts of Texas, Oklahoma, and Kansas.\nThe Greenfield tornado set a new grim record as it obliterated homes and crumpled massive power-producing wind turbines outside the city.\nThe Greenfield tornado, initially rated an EF-3, was identified on Thursday as the third EF-4 tornado of 2024.", "location": "Iowa.", "classification": "natural-disasters", "score": 0.5653498255240614, "event_breakdown": "Here's the relevant part of the text:\n- The Greenfield tornado\n- Storm damage in Texas, Oklahoma, and Kansas"}]