[{"id": "b996b05e-0688-499c-92aa-ad0c1ee6dae1", "title": "Biden : Israel will get  everything it need to fight Hamas ; Gaza war is  not genocide  ", "date": "2024-05-21 03:15", "url": "https://www.jta.org/2024/05/20/politics/biden-israel-will-get-everything-it-needs-to-fight-hamas-gaza-war-is-not-genocide", "message": "“I’ll always ensure that Israel has everything it needs to defend itself against Hamas, and all its enemies,” Biden told a White House reception on Monday marking Jewish American Heritage Month.\nBiden said he was concerned about Israel’s conduct of the war and its preparedness to protect civilians.\nJakes Sullivan, the national security adviser, this week visited Israel, and reports the Biden administration and the Netanyahu government shared from his meetings conveyed agreement on most issues.\n“We stand with Israel to take out [Hamas leader Yahya] Sinwar and the rest of the butchers of Hamas,” he said.\nPolin urged those attending to help keep the 128 hostages still believed to be in Gaza front of the American mind.", "location": "Israel", "classification": "antisemitism", "score": 0.7785426925067427, "event_breakdown": "Antisemitism events in the text:\n\n- Biden says Israel has a right to defend itself and to support its citizens.\n- A top Biden administration official warns Israel of “significant risk” the longer they must wait for ceasefire to end military operation.\n- President Biden demands a longer and stronger ceasefire with Hamas. \n- Brzezinski says Biden cannot allow himself look like he is taking a pass."}, {"id": "b9345005-6de0-4282-989d-66a23b129871", "title": "Drexel threatens to clear encampment as arrests linked to Israel - Hamas war protests exceed 3 , 000", "date": "2024-05-21 03:15", "url": "https://www.bostonglobe.com/2024/05/20/nation/drexel-threatens-clear-encampment-arrests-linked-israel-hamas-war-protests-exceed-3000/", "message": "Classes at Drexel were held virtually on Monday as police kept watch over the demonstration on the school’s Korman Quad.\nDrexel University in Philadelphia threatened to clear an encampment of pro-Palestinian protesters on Monday as arrests linked to campus demonstrations against the Israel-Hamas war surpassed the 3,000 mark nationwide.\nTensions over the war have been high on campuses since the fall but demonstrations spread quickly following an April 18 police crackdown on an encampment at Columbia University.\nCampuses have been calmer recently, with fewer arrests, as students leave for summer break.\nHe previously threatened disciplinary action against Drexel students participating in the protest.", "location": "PHILADELPHIA", "classification": "antisemitism", "score": 0.5144300726573657, "event_breakdown": "* Pro-Palestinian protesters set up camp at Drexel University in Philadelphia, Pennsylvania\n* University threatens disciplinary action against students participating in the protest"}, {"id": "1b1899f6-7218-40ec-84a0-66d508e81654", "title": "Arrests surpass 3 , 000 as Drexel University cracks down on pro - Palestinian protesters", "date": "2024-05-21 04:00", "url": "https://timesofindia.indiatimes.com/world/us/arrests-surpass-3000-as-drexel-university-cracks-down-on-pro-palestinian-protesters/articleshow/110287626.cms", "message": "Drexel University in Philadelphia threatened to clear an encampment of pro-Palestinian protesters on Monday as arrests linked to campus demonstrations against the Israel-Hamas war surpassed the 3,000 mark nationwide.Drexel President John Fry said the encampment had disrupted campus life and \"cannot be allowed to remain in place.\"\nFry called on protesters to leave immediately but said in a statement Monday night that he had authorized \"all necessary steps to clear the encampment safely.\"\nCampuses have been calmer recently, with fewer arrests, as students leave for summer break.\nYale said in a prepared statement that \"a number of graduating students chose to peacefully walk out during the ceremony.\nUniversity staff helped guide these individuals to an area outside the event space, and the ceremony continued as scheduled.", "location": "PHILADELPHIA", "classification": "antisemitism", "score": 0.7481073465442644, "event_breakdown": "Antisemitism events in the text:\n\n* Drexel threatening to clear encampment of pro-Palestinian protesters\n* Arrests surpassing 3,000 nationwide linked to campus demonstrations against the Israel-Hamas war"}]