[{"id": "b4eaf515-1e38-48f1-ba4b-5fae92b05259", "title": "Israel used US - made bomb in deadly Rafah strike , experts say", "date": "2024-05-30 03:45", "url": "https://www.stripes.com/theaters/middle_east/2024-05-29/israel-us-made-bomb-rafah-14023186.html", "message": "MUST CREDIT: Alam Sadeq (Alam Sadeq)Four weapons experts said the Israeli military used a U.S.-made precision bomb in a strike that killed at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post.\nThe findings do not contradict Israel’s assertion that it used a small munition, weapons experts said.\nSecretary of State Antony Blinken said Wednesday that the United States couldn’t confirm what weapons were used or how they were used in the strike.\nIsrael said the attack on the encampment in Rafah was a \"targeted\" strike against two Hamas militants and employed \"the smallest munition\" Israeli fighter jets can use.\nAn Israeli military spokesman reached Wednesday said he could not comment further on the munition used or what measures were taken to prevent civilian casualties.", "location": "GAZA", "classification": "security", "score": 0.7458575222809743, "event_breakdown": "The Israeli military used a U.S.-made precision bomb to kill at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post."}, {"id": "11002ea1-ea83-4618-b4ae-e1d82395fa0f", "title": "Syria reports young girl killed 10 other people hurt in alleged", "date": "2024-05-30 02:30", "url": "https://muslimnews.co.uk/news/syria/syria-reports-young-girl-killed-10-other-people-hurt-in-alleged/", "message": "Syria’s defense ministry said an Israeli airstrike Syria reports on Wednesday killed a girl and wounded 10 civilians.\nbvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvsA war monitor said a parallel strike in the same region killed three pro-Hezbollah Syrian fighters.\nThe alleged Israeli strikes targeted “at least one military site… in the eastern countryside of Homs, causing plumes of smoke to rise,” it added.\nIt said a second strike on central Syria killed three Syrian fighters working with Lebanon’s Hezbollah group.\nAccording to Syria reports, the strike was the 42nd apparent Israeli attack on Syria since the beginning of the year.", "location": "Homs countryside", "classification": "security", "score": 0.8937192537243501, "event_breakdown": "Israeli airstrike kills girl, wounds 10 civilians in Homs, Syria\nAt least three pro-Hezbollah Syrian fighters were killed in an alleged Israeli attack on Homs, Syria"}, {"id": "114ff4b5-98ae-46e5-abc3-d02a171c3393", "title": "Woman pleads guilty to stabbing , killing cousin in 2021 in York County", "date": "2024-05-30 01:15", "url": "https://www.yahoo.com/news/woman-pleads-guilty-stabbing-killing-222058569.html", "message": "Woman pleads guilty to stabbing, killing cousin in 2021 in York CountyYORK COUNTY, Pa. (WHTM) — A woman accused of stabbing and killing a relative in York County years ago pleaded guilty Tuesday.\nNinoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed.\nYork County babysitter claimed girl ‘seduced me’ during rape investigation, police sayJoselito Pagan-Ocasio, 36, was found dead at his home at the 300 block of E. King Street in York City.\nFirst responders were dispatched for a fatality that was originally reported from a shooting but turned out to be from a stabbing.\nAn autopsy found Pagan-Ocasio died from a stab wound to the chest and the manner was ruled a homicide.", "location": "York City", "classification": "security", "score": 0.6171078221343911, "event_breakdown": "Ninoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed. The crime scene is located at the 300 block of E. King Street in York City."}, {"id": "0b1e5fa8-633f-4f11-af6f-6d3f88d50423", "title": "Chicago police shooting : Family says stabbing suspect Tracey Watson fatally shot in South Austin was defending himself from attack", "date": "2024-05-30 07:00", "url": "https://abc7chicago.com/post/south-austin-chicago-police-fatal-shooting-family-speaks-out/14889006/", "message": "Police say Tracey Watson was stabbing another man before officers ordered him to drop his weaponFamily claims man fatally shot by Chicago police in South Austin was defending himself from attackRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nChicago police say the suspect, Tracey Watson, attempted to stab a man on the street around 11 p.m. in the 300-block of South Cicero Avenue in South Austin.", "location": "CHICAGO", "classification": "security", "score": 0.9212977709487788, "event_breakdown": "Target event: A news push that reports an event that is happening in the current time frame and belongs to to the category security and that has a location of Chicago\nCurrent security events in Chicago:\nChicago police say a man was shot by officers Monday night in the 300-block of South Cicero Avenue in South Austin. According to a news release, an officer in an unmarked police car tried to pull over a Ford car for a traffic violation around 11:10 p.m. The other driver then began firing shots at the officers, police said. The officers returned fire, striking the man and driving him to a hospital where he was pronounced dead at around 11:50 p.m., the release stated."}, {"id": "b9ad0b06-7ce2-46ba-940c-6666ba84db44", "title": "Street battles , Israeli strikes rock Gaza Rafah", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815140-Street-battles,-Israeli-strikes-rock-Gaza%5C", "message": "Street battles, Israeli strikes rock Gaza's RafahWorld World Street battles, Israeli strikes rock Gaza's RafahStreet fighting and Israeli bombardment rocked Gaza's far-southern Rafah on Wednesday.\nBut fighting again flared in Rafah, where an AFP reporter said street battles raged and an Israeli helicopter fired guns and missiles at targets in the city centre.\nIn the north, Israeli military vehicles unleashed intense gunfire east of Gaza City, an AFP reporter said, while residents reported air strikes on parts of Jabalia.\nUN SECURITY COUNCILNearly eight months into the deadliest Gaza war, Israel has faced ever louder opposition, as well as cases before two Netherlands-based international courts.\nTurkish President Recep Tayyip Erdogan meanwhile hit out at the United Nations after the latest deadly Israeli strikes in Rafah.", "location": "GAZA", "classification": "security", "score": 0.7805639327275631, "event_breakdown": "Hamas-Israel fighting flares as Palestinian teen killed by Israeli gunfireClashes between Israeli forces and Palestinian militants have intensified in recent days culminating in the death of a 13-year-old Palestinian boy in the West Bank.\nIn retaliation for the boy's death, Hamas fired rockets into Israel, causing no damage.\nBut the escalations were far from over. Israel Defense Forces spokesperson Lieutenant Colonel Peter Lerner said the military had bombed a second target in the Gaza Strip.\n\"We have been attacked by rockets from Hamas. Our response is an attack on a second target in the Gaza Strip,\" Lerner said.\nIsrael first bombed a Hamas target inside the Gaza Strip. Then Israel Defense Forces (IDF) also targeted some Palestinian militants it said had been firing rockets into Israel. And the IDF warned Gaza militants not to retaliate for the attack."}, {"id": "f0323e9a-319a-4fdd-8a76-e4348610d087", "title": "Israel Launches Airstrikes Deep Into Syria - Reports Of Civilians Dead & Wounded", "date": "2024-05-30 01:30", "url": "https://www.zerohedge.com/geopolitical/israel-launches-airstrikes-deep-syria-reports-civilians-dead-wounded", "message": "Israel's military on Wednesday launched a fresh attack on targets deep inside Syria, which reportedly left civilian casualties, according to state media.\nSyrian government sources said the Israeli strike killed a girl and wounded ten civilians.\n\"Syrian air defense intercepts enemy targets in the skies of the city of Homs,\" the official SANA news agency also reported.\nIsrael was also part of this covert campaign, which saw the anti-Assad axis arm, train, and fund various al-Qaeda and jihadist groups.\nIn the initial days and weeks after Oct.7, Syria had lobbed several rockets toward the Israeli-occupied Golan Heights, which left no casualties.", "location": "Homs, Syria", "classification": "security", "score": 0.9722490989051554, "event_breakdown": "Israel strikes Syria in response to rocket fire in the Golan Heights, reportedly killing a girl and wounding ten civilians."}, {"id": "86e7c6d1-090a-483a-9c7d-e47cedb8ba84", "title": "Russia Ukraine war live : Putin - backed think tank says Kremlin should consider nuclear blast to warn West", "date": "2024-05-30 06:00", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-news-putin-nuclear-war-latest-b2553638.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package.\nIt comes as Russia fired more than 50 missiles and drones into Ukraine overnight, the Ukrainian Air Forces have claimed.\nMykola Oleschuk, commander of the air force, said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details.\nHe said they had shot down seven missiles and 32 drones.", "location": "Ukraine", "classification": "security", "score": 0.5842924600621292, "event_breakdown": "Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package."}, {"id": "314108ca-01b6-44f3-a1fc-4edb4847fcb3", "title": "North Korea Flies Trash And Manure Balloons Into South As It Doubles Down On Satellite Ambitions", "date": "2024-05-30 03:15", "url": "https://www.theyeshivaworld.com/news/general/2286787/north-korea-flies-trash-and-manure-balloons-into-south-as-it-doubles-down-on-satellite-ambitions.html", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the text, it is not possible to determine a specific location for the main event.", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea fires short-range missiles toward East Sea\nSouth Korea on Sunday detected North Korea firing suspected short-range missiles twice into the sea off its east coast.\nSouth Korea’s Joint Chiefs of Staff said in a statement that the North fired two projectiles believed to be short-range ballistic missiles from North Pyongan Province early Sunday.\nThe Japanese military also said it detected the launch of what appeared to be a ballistic missile by North Korea on Sunday morning."}, {"id": "c16410dd-2ba3-40fa-8d2b-db871c0871cb", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:15", "url": "https://www.10news.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "South Korea", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea sending rubbish and spy satellites into South Korea, Russia"}, {"id": "c7d4fc89-aa5b-437f-8422-73b99d28458a", "title": "Missile attacks damage a ship in the Red Sea off Yemen coast near previous Houthi rebel assaults - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 01:30", "url": "https://www.newdelhitimes.com/missile-attacks-damage-a-ship-in-the-red-sea-off-yemens-coast-near-previous-houthi-rebel-assaults/", "message": "Missile attacks twice damaged a Marshall Islands-flagged, Greek-owned ship Tuesday in the Red Sea off the coast of Yemen, with a private security firm saying radio traffic suggested the vessel took on water after being struck.\nThe vessel reported being headed to Fujairah in the United Arab Emirates.\nCentral Command separately said it destroyed five Houthi drones over the Red Sea amid the attacks.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA.", "classification": "security", "score": 0.7007360866747084, "event_breakdown": "Target event - A Greek ship was attacked and damaged by Houthi drones in the Red Sea off the coast of Yemen."}, {"id": "39134889-faeb-4076-b091-add7dfce3c8b", "title": "Street battles , Israeli strikes rock Rafah - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836545/street-battles-israeli-strikes-rock-rafah", "message": "RAFAH: Street fighting and Israeli bombardment rocked Rafah in the Gaza Strip on Wednesday, residents and officials said, a day after Israeli tanks rolled into the centre of the city near the Egyptian border.\nIsrael’s National Security Adviser Tzachi Hanegbi said on Wednesday the war could go on until the year’s end.\nFighting has again flared in Rafah, where an AFP reporter said an Israeli helicopter fired guns and missiles at targets in the city centre.\nThe spirit of the United Nations is dead in Gaza,” Erdogan told lawmakers from his AKP party.\nThe Turkish leader also hit out at fellow Muslim-majority countries for failing to take common action over the Israeli strike.", "location": "RAFAH", "classification": "security", "score": 0.5149734493054064, "event_breakdown": "Security event 1: Street fighting and Israeli bombardment rocked Rafah on Wednesday.\nSecurity event 2: Israeli forces rolled into Rafah near the Egyptian border.\nSecurity event 3: Israeli helicopter fired guns and missiles at targets in Rafah on Wednesday."}, {"id": "de3f26db-7f58-4ede-b6e7-2eac324b8fbb", "title": "  All Eyes on Rafah : 44 Million Instagram Users , Global Celebrities Share AI Image To Draw Focus On Gaza Crisis", "date": "2024-05-30 06:00", "url": "https://www.news18.com/world/all-eyes-on-rafah-44-million-instagram-users-global-celebrities-share-ai-image-to-draw-focus-on-gaza-crisis-8909611.html", "message": "More than 44 million Instagram users have shared an AI-generated image with the caption “All eyes on Rafah” as of Thursday morning, according to a count by Instagram.\nThe area located near the Egyptian border Rafah has recently been subjected to bombing by Israeli forces.\nThe international community has criticised Israel for the deaths because Rafah was previously a humanitarian zone for civilians.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael’s retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory’s health ministry.", "location": "like full stop\nGAZA", "classification": "security", "score": 0.47841359431306485, "event_breakdown": "Target event: New international Israeli offensive in the Gaza Strip\nNew international Israeli offensive in the Gaza Strip: Israel has recently bombed the Rafah area near the Egyptian border, killing at least 36,171 people in Gaza, according to the Hamas-run territory's health ministry."}, {"id": "8a309b8a-8128-4fbc-a087-0272f4e4f00f", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 04:00", "url": "http://www.china.org.cn/world/2024-05/30/content_117223023.htm", "message": "视频播放位置 下载安装Flash播放器Houthi group said it shot down an MQ-9 Reaper drone on Wednesday over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months.\"\nHe added that \"we will continue to develop our military defense capabilities to counter the U.S.- British coalition aggression against our country.\"\n\"We will also continue to support the Palestine people against the Israeli aggression until the conflict and blockade stop,\" the spokesman stressed.\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone.", "location": "Yemen", "classification": "security", "score": 0.41426789790734747, "event_breakdown": "Target event - Houthi group said they shot down an MQ-9 Reaper drone over Yemen's central Marib."}, {"id": "d5889b98-a2ef-423b-aaf0-9dee4082f8e3", "title": "Man Pleads Guilty , Sentenced to 14 Years for DHS Hotel Stabbing", "date": "2024-05-30 04:00", "url": "https://mynewsla.com/crime/2024/05/29/man-pleads-guilty-sentenced-to-14-years-for-dhs-hotel-stabbing/", "message": "A man pleaded guilty Wednesday to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison.\nAnthony Rene Ayala, 30, pleaded guilty before Judge Jason Stone at the Larson Justice Center in Indio to assault causing great bodily injury and first-degree burglary, according to Riverside County District Attorney’s office spokesman John Hall.\nTwo other men charged in the case, 30-year-old Jose Luis Garcia and 32-year-old Moises Mazariegos, previously pleaded guilty to the same charges.\nThe stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department.\nAyala has two robbery convictions, Garcia has convictions for burglary and attempted robbery, and Reynaga and Mazariegos have convictions for burglary and robbery.", "location": "Desert Hot Springs, California", "classification": "security", "score": 0.5017162583572974, "event_breakdown": "Target Event:\nA man pleaded guilty to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison. The stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department."}, {"id": "8cf686ca-3db6-4303-a137-2d4ce2f6d95c", "title": "Israel used U . S .- made bombs to kill dozens of civilians in Rafah , weapons experts reveal , after blast sparked international outcry", "date": "2024-05-30 06:45", "url": "https://www.dailymail.co.uk/news/article-13474831/Israel-used-bombs-kill-dozens-civilians-Rafah.html", "message": "The U.S. had been pushing for leaders in the Israeli military to use GBU-39 bombs more often because they are more precise and better suited to urban environments than larger bombs.\nEarlier this month, President Biden said the United States was pausing a delivery of the larger 2000-pound bombs that Israel often uses.\n'The strike was conducted using two munitions with small warheads suited for this targeted strike,' Rear Adm. Daniel Hagari, the Israeli military spokesman, said.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.", "location": "Gaza", "classification": "security", "score": 0.7413583526990494, "event_breakdown": "Militants in the Hamas-controlled Gaza Strip fired a rocket into Israel for the first time in over a month on Monday, drawing retaliatory airstrikes and threats of further violence from the Israel Defense Forces.\nThe rocket landed in a civilian area of southern Israel, causing no injuries. The IDF responded with airstrikes on three Hamas targets in Gaza, including a military compound and a weapons manufacturing facility.\nThe rocket attack came just hours after the Israeli military announced that it was taking over the Rafah border crossing on the Gaza-Egypt border, a move which it said was aimed at preventing the smuggling of weapons into the Strip."}, {"id": "3f51a8a9-1146-4d9e-99b7-a5999697a853", "title": "Day 237 of genocide : Dozens of civilians killed , others injured | World", "date": "2024-05-30 09:30", "url": "https://en.ammonnews.net/article/72958", "message": "Home WorldDay 237 of genocide: Dozens of civilians killed, others injuredAmmon News - At least seven civilians were killed and others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens’ homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire.", "location": "GAZA CITY", "classification": "security", "score": 0.9989904892587697, "event_breakdown": "At least seven civilians were killed and seven others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens' homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire."}, {"id": "dbf1fb9a-5bb7-4391-b434-81a1e92ed3e2", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 06:00", "url": "https://www.newdelhitimes.com/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions/", "message": "It advised civilians not to touch the objects flown from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nNorth Korea hasn’t commented on when it would be ready to attempt a satellite launch again, which some experts say could take months.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the context provided, I was unable to find a specific event that took place on one particular location.", "classification": "security", "score": 0.5626074291890387, "event_breakdown": "North Korea plans to conduct a missile test in the next week or two, U.S. and South Korean officials said, a move that would violate a United Nations prohibition on the country's use of ballistic technology."}, {"id": "5b6c7edd-dc34-4eec-8d80-692db193c381", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:00", "url": "https://www.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.", "location": "GAZA", "classification": "security", "score": 0.4522691607972171, "event_breakdown": "Gaza"}, {"id": "d5c47d82-d579-4874-a4d2-1d02cac727ad", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.", "location": "GAZA", "classification": "security", "score": 0.4522691607972171, "event_breakdown": "Israeli security official Tzachi Hanegbi declared 2024 is \"defined as a year of combat\" concerning Israel's war against Hamas on Wednesday, ending speculation that the Gaza offensive would be the war's final stage."}, {"id": "993d9514-9a35-499b-96ef-05fed9562d50", "title": "Russia - Ukraine war : List of key events , day 825", "date": "2024-05-30 03:15", "url": "https://www.aljazeera.com/news/2024/5/30/russia-ukraine-war-list-of-key-events-day-825", "message": "Ukraine’s air force said its defence systems destroyed seven Russia-launched missiles and 32 drones overnight.\nThe commander said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details.", "location": "Kyiv", "classification": "security", "score": 0.7650046963206805, "event_breakdown": "* Seven missiles were destroyed by the Ukraine Air Force, though their location was not specified.\n* Ukraine said its air defense systems destroyed 32 drones overnight, without providing a location."}, {"id": "43ef0a1c-b1a7-4675-8baa-13a1ece11bae", "title": "N . J . police union calls for  real consequence for rowdy teens on boardwalk", "date": "2024-05-30 02:15", "url": "https://www.pennlive.com/crime/2024/05/nj-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n“We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest.", "location": "Ocean City, Maryland", "classification": "security", "score": 0.885389261340814, "event_breakdown": "Ocean City: Stabbing of 15-year-old boy on Memorial Day weekend\nSeaside Heights: Brief panic on the boardwalk due to false report of shooting"}, {"id": "ca6f057e-a53d-4ae2-a99a-1c248eb28569", "title": "Syria says Israeli strike kills girl , wounds 10 civilians", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815135-Syria-says-Israeli-strike-kills-girl,-wounds-10-civilians", "message": "Syria says Israeli strike kills girl, wounds 10 civiliansWorld World Syria says Israeli strike kills girl, wounds 10 civiliansIsraeli air strike targeted a central site and a residential building in Baniyas city.\nThe Britain-based Observatory also said the Israeli strike on central Syria killed three Syrian fighters working with Lebanon's Iran-backed Hezbollah group and two other non-Syrian fighters working for the same movement.\nEarlier on Wednesday, state media said air defences intercepted Israeli \"targets\" over central Syria.\nThe Observatory said the Israeli strikes targeted \"at least one military site... in the eastern countryside of Homs, causing plumes of smoke to rise\".\nOn Saturday, an Israeli drone strike in central Syria, near the border with Lebanon, killed two Hezbollah fighters, the Observatory had said.", "location": "NULL", "classification": "security", "score": 0.8727517258030179, "event_breakdown": "Israeli air strike targeted a central site and a residential building in Baniyas on Wednesday, the local governor told state media."}, {"id": "97c79d8b-9ea8-4348-9b96-40ce6fbf04cd", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after Jersey Shore boardwalk unrest – NBC New York", "date": "2024-05-30 04:00", "url": "https://www.nbcnewyork.com/news/local/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-jersey-shore-boardwalk-unrest/5458273/", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest.", "location": "Ocean City, Maryland", "classification": "security", "score": 0.885389261340814, "event_breakdown": "Ocean City, NJ and Seaside Heights, NJ"}, {"id": "9135fc94-d27d-43fb-ab0c-0795b2108373", "title": "NJ police union calls for  real consequence after Jersey Shore boardwalk unrest", "date": "2024-05-30 01:45", "url": "https://www.fox5ny.com/news/new-jersey-police-union-calls-real-consequences-drunk-rowdy-teens-after-boardwalk-unrest", "message": "Peter Andreyev, president of the New Jersey State Policemens' Benevolent Association, issued a statement calling for changes in laws and procedures governing how police interact with disorderly teens and young adults.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We wholeheartedly support the city of Wildwood Police Department in protecting this community from these nuisance crowds on our boardwalk and in the city.\"", "location": "New Jersey", "classification": "security", "score": 0.701849505328394, "event_breakdown": "Seaside Heights, New Jersey - Brief panic on the boardwalk after a false report of shooting."}, {"id": "d7e5c5c5-4b5b-41fa-b1f4-b1c1367c0c97", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:45", "url": "https://www.dnaindia.com/world/report-israel-warns-war-in-gaza-may-extend-seven-more-months-3091201", "message": "Israel warns war in Gaza may extend seven more monthsInitially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\nIn response, Israel launched a devastating offensive in Gaza, claiming the lives of over 36,000 people, according to Palestinian officials.\nThe strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported.", "location": "GAZA STRIP", "classification": "security", "score": 0.7870015635588141, "event_breakdown": "Gaza"}, {"id": "ec409e6c-eb04-4817-933b-2f1b2562453c", "title": "Pakistan : Terrorists torch girl  middle school in North Waziristan", "date": "2024-05-30 06:30", "url": "https://news.webindia123.com/news/Articles/Asia/20240530/4201651.html", "message": "Some unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan destroying furniture, computers and books, police said on Wednesday, Dawn reported.\nAbrar, a member of Shakhimar Welfare Organisation, told Dawn the school was constructed by an organisation along with Pakistan Army''s 7th Division in 2020.\nOn May 9, terrorists set fire to a girls'' private school in the Shawa area of South Waziristan.\nSimilarly, on May 17, unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan.\nAround 500 girls were enrolled in the two schools, Government Girls Middle School Noor Jannat and Government Girls Middle School Yunus Kot which were targeted by the attackers around midnight.", "location": "North Waziristan", "classification": "security", "score": 0.9591702484625455, "event_breakdown": "Event 1: Unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan.\nEvent 2: Unidentified terrorists set on fire a girls'' private school in the Shawa area of South Waziristan.\nEvent 3: Unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan."}, {"id": "8057069c-c71b-4dda-ade6-43f96a47c766", "title": "Israel undermines goals by harming civilians in Gaza , US tells UN - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836543/israel-undermines-goals-by-harming-civilians-in-gaza-us-tells-un", "message": "“The continued pattern of significant civilian harm resulting from incidents like Sunday’s airstrikes undermines Israel’s strategic goals in Gaza,” deputy US Ambassador to the UN Robert Wood told the 15-member council.\nAn airstrike on Sunday set off a blaze in a tent camp in Rafah in southern Gaza, killing at least 45 people.\nIsrael — a US ally — said it had targeted Hamas militants and had not intended to harm civilians.\nOn Wednesday, Wood told reporters that Washington was reviewing it, but UN action was unlikely to be helpful or change the situation on the ground.\nHamas chooses to exploit the civilians of Gaza as human shields,” he told the council.", "location": "Gaza", "classification": "security", "score": 0.5696576536229144, "event_breakdown": "Airstrikes in Israel\nA news push reports that Israel has told the UN it killed 45 people in an airstrike in Gaza on Sunday, after weeks of heightened violence in the city."}, {"id": "db93b4af-c978-4a99-b3fe-375df8bfe693", "title": "London shooting : Four wounded , including child , in Hackney | united kingdom | News", "date": "2024-05-30 03:00", "url": "https://www.express.co.uk/news/uk/1905183/london-shooting-hackney-four-wounded-child", "message": "Police were called following an incident in London.\nThree adults and a child have suffered serious injuries following a shooting near to a restaurant in Hackney, London.\nA major police operation was launched following an incident on Kingsland High Street, Dalston just after 9.20pm on Wednesday.\nThe Metropolitan Police confirmed all four had suffered \"gunshot injuries\" and were rushed to an east London hospital.\nOfficers have not yet arrested anyone in connection with the attack.", "location": "LONDON", "classification": "security", "score": 0.876266618803576, "event_breakdown": "Target event:\nA shooting incident in Hackney, London is causing the police concern."}, {"id": "a405ecab-ecfd-44bb-820f-96e6fee3e997", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 09:30", "url": "https://www.digitaljournal.com/world/rafah-battles-intensify-as-israel-takes-over-gaza-egypt-border-strip/article", "message": "The Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken “operational control” of the narrow border area, where he said troops had “discovered around 20 tunnels”.\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nThe United States has been among the countries urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nThe New York Times and CNN, citing weapons experts and analysis of video from the scene of the weekend Rafah strike, reported that the bomb believed to have started the fatal fire was a US-made GBU-39 guided munition.", "location": "GAZA STRIP", "classification": "security", "score": 0.8054172495107347, "event_breakdown": "Israel launches attack into Rafah, reports discovering 20 tunnels\nIsrael launches attack into Rafah, reports discovering 20 tunnels."}, {"id": "722b141c-4e8f-41d7-b762-9ff8a6f14b8f", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:00", "url": "https://www.koaa.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "itself\nNorth Korea", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "North Korea fires missiles into the sea, South Korea says - North Korea fired several short-range anti-ship cruise missiles off its east coast on Thursday, Seoul's military said, the latest in a series of military drills the North has staged in recent weeks in a show of force amid ongoing annual South Korea-U.S. military drills.  The missiles were fired from a coastal location up"}, {"id": "a8cd0cdd-106d-4cbf-8f9a-d4b5a5a7eaa8", "title": "  Dozens killed in fresh Israeli attacks on Rafah  Says Palestinian medics", "date": "2024-05-30 08:45", "url": "https://www.sentinelassam.com/more-news/international/dozens-killed-in-fresh-israeli-attacks-on-rafah-says-palestinian-medics", "message": "Gaza: Palestinian medics have said dozens of people have died in fresh Israeli attacks on the southern Gaza city of Rafah on Tuesday, two days after 45 people were reportedly killed in an airstrike which sparked international condemnation.\nThe Israeli military said it was investigating reports of an attack on a shelter for displaced persons in western Rafah.\nEarlier on Tuesday, a spokesman for the Hamas-run health authority in Gaza said a further 18 people were killed overnight in separate Israeli attacks in Rafah.\nEyewitness reports from Rafah on Tuesday suggested the Israeli army has advanced into the city centre.\n(IANS)Also Read: Gaza: ‘All Eyes on Rafah’ Campaign Gains Momentum Amidst Israeli Offensive In RafaAlso Watch:", "location": "Gaza", "classification": "security", "score": 0.9009047901237012, "event_breakdown": "Gaza: Fresh Israeli Attacks in Rafah Claim Dozens of Lives."}, {"id": "b31bb78e-7b5c-4341-9f09-50d3d818e9cc", "title": "HYD : Two IDF Soldiers Murdered In Terror Attack Near Shechem – The Yeshiva World", "date": "2024-05-30 08:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2286929/hyd-three-idf-soldiers-killed-in-gaza.html", "message": "The IDF released for publication on Thursday morning that two IDF soldiers were killed in the ramming attack near Shechem on Wednesday evening and a third soldier was killed in battle in the northern Gaza Strip on Wednesday.\nThe ramming attack occurred at an IDF checkpoint near Shechem.\nAs IDF soldiers were checking cars, the terrorist sped to the front of the line and rammed into two soldiers.\nAccording to a preliminary investigation, the ramming attack occurred in seconds and the soldiers had no time to respond by opening fire.\nThe soldier who fell in battle in northern Gaza on Wednesday was identified as Staff Sgt.", "location": "GAZA", "classification": "security", "score": 0.9753319283323145, "event_breakdown": "IDF soldiers were attacked with an explosive device while they were patrolling the Gaza border. Additionally, three security forces were injured in a separate clash between Israeli soldiers and Hamas operatives near Khan Younis."}, {"id": "137067d9-ad90-4cff-b1bc-fe81810b0796", "title": "MW3 and Warzone : How to Unlock the JAK Harbinger Kit", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499833/article/mw3-and-warzone-how-to-unlock-the-jak-harbinger-kit/", "message": "Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4.\nWeekly challenges have been reset, meaning more Conversion Kits will roll out, with the first being the JAK Harbinger Kit for the M4.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?", "location": "The main event for this text is located in Call of Duty: Warzone.", "classification": "security", "score": 0.43625640781063774, "event_breakdown": "Target event - Conversion Kit in the infinite Ward\nCurrently, the Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4. Weekly challenges have reset, meaning more Conversion Kits will roll out. The first being the JAK Harbinger Kit for the M4."}, {"id": "ad9ccc42-8584-44c0-bb6b-0e7d3866772f", "title": "Sudan : How El Fasher Went From Darfur Safe Haven to All - Out War", "date": "2024-05-30 05:30", "url": "https://allafrica.com/stories/202405300066.html", "message": "UN officials have called the situation in El Fasher \"Hell on Earth\" and are warning that genocide crimes may be committed.\nDaily interviews that I am doing with friends and human rights monitors in El Fasher suggest that neither claim is an understatement.\nThe battle for El Fasher - home to as many as two million people - started last month but had long been telegraphed.\nLocal volunteers from the Shaqra Emergency Response Room prepare food for displaced people camped just outside of El Fasher.\nThe camp is on the outskirts of El Fasher and is located close to conflict front lines.", "location": "El Fasher", "classification": "security", "score": 0.6138517515179124, "event_breakdown": "Location: El Fasher, Sudan\nDate: 2022-05-25\nVolunteers from the Shaqra Emergency Response Room in El Fasher are providing food for displaced people camped just outside of the city. The camp is located close to conflict front lines."}, {"id": "d5211026-5af5-44e9-a2e5-c2ad1d63d8bb", "title": "IDF Announces Death Of Two Soldiers In West Bank Car Ramming Attack , One In Gaza Fighting", "date": "2024-05-30 09:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-announces-death-of-two-soldiers-in-west-bank-one-in-gaza", "message": "Eliya Hilel, 20 from Tel Zion, and Staff Sergeant Diego Shvisha Harsaj, 20 from Tel Aviv, were severely injured in a car-ramming attack near Shechem.\nYedidya Azugi, 20 from the settlement of Revava, fell in a battle in the north of the Gaza Strip.\nThe death toll in the Gaza Strip since the start of the ground offensive now stands at 287.\nIDF spokespersonSergeant Yedidia Azugi, 21, from the settlement of Revava, a fighter in the 101st Battalion, Paratroopers Brigade, fell in battle in the north of the Gaza Strip.\nThe entire Revava settlement is in deep mourning.", "location": "Gaza Strip", "classification": "security", "score": 0.9859905291150356, "event_breakdown": "Relevant events:\nCar-ramming attack near Shechem: Two Israeli soldiers severely injured.\nBattle in the north of the Gaza Strip: One IDF soldier fell."}, {"id": "0e95cee5-0845-450a-b025-1f5752d08ff3", "title": "Deaths of 3 more soldiers : 2 killed in West Bank car - ramming attack , 1 fell in battle", "date": "2024-05-30 07:15", "url": "https://www.ynetnews.com/article/b17hg5h4c", "message": "The IDF spokesman announced on Thursday morning the deaths of three IDF soldiers.\nYedidya Azugi, 21, from Revava, of the Paratrooper Brigade’s 101st Battalion, was killed in battle in the northern Gaza Strip.\nSince October 7, 642 IDF soldiers have been killed, including 291 in Gaza ground operation.\n1 View gallery Staff Sgt.\nAzugi, who fell in the northern Gaza Strip, lived in the West Bank settlement of Revava.", "location": "Gaza", "classification": "security", "score": 0.9687908981354951, "event_breakdown": "IDF soldiers killed in Gaza ground operation, as number of fatalities rises to 684"}, {"id": "9476f69d-b2e9-4b14-8334-bddf7e872c8e", "title": "S Korea accuses North of sending balloons with excrement across border", "date": "2024-05-30 02:30", "url": "https://japantoday.com/category/world/s.korea-accuses-north-of-sending-balloons-with-excrement-across-border", "message": "Yonhap via REUTERS/File photoBy Jack KimSouth Korea accused North Korea on Wednesday of sending a large number of balloons across their heavily fortified border to drop objects including trash and excrement, calling the act base and dangerous.\nPhotographs released by the South Korean military showed inflated balloons with plastic bags tethered to them.\nBalloons have regularly been sent the other way by South Korean activists, often led by North Korean defectors.\nNorth Korea also attempted to jam GPS signals in South Korea on early Wednesday morning, although no damage was reported, the Donga Ilbo newspaper said, citing multiple unnamed government sources.\nThe two Koreas' large militaries face off across the military border and North Korea routinely threatens to annihilate its neighbor.", "location": "NULL", "classification": "security", "score": 0.5232638979013924, "event_breakdown": "North Korea is accused of sending a large number of balloons across its heavily fortified border with South Korea to drop objects including trash and excrement. South Korea called the act base and dangerous.\nNorth Korea also attempted to jam GPS signals in South Korea on Wednesday morning although no damage was reported, the Donga Ilbo newspaper said."}, {"id": "f4e9078f-6adc-462f-8dd8-dbd9f547a274", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 10:30", "url": "https://www.newsday.com/news/nation/Andy-Negra-World-War-II-DDay-s81979", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nHe recalled being on the road with the 6th Armored Division, part of a push to retake the French port city of Brest, when his column was strafed by five German planes.", "location": "FRANCE", "classification": "security", "score": 0.749105803113076, "event_breakdown": "Target: Fort Slocum, New York\nNews Push: 1943\nLocation: Brest, France"}, {"id": "4597658f-49aa-4695-92ed-54c21d37b62e", "title": "Splatoon 3 update announced ( version 8 . 0 . 0 ), patch notes", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/splatoon-3-update-announced-version-8-0-0-patch-notes/", "message": "Splatoon 3 is gearing up for its next big update, which will be version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um’ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode.", "location": "From the text, I was unable to determine a specific location where the main event takes place.", "classification": "security", "score": 0.46699336619345716, "event_breakdown": "It looks like there were no current events of security reported in text that can be placed on a map within the specified time frame."}, {"id": "91425bb6-9f65-4bed-afb4-56dfcbd2b190", "title": "New Zealand Defence Force disposes of World War II - era mortar bomb in Whanganui", "date": "2024-05-30 00:00", "url": "https://www.nzherald.co.nz/whanganui-chronicle/news/new-zealand-defence-force-disposes-of-world-war-ii-era-mortar-bomb-in-whanganui/B2YCZ6TRTRFP5BNPCVAPXZHMOA/", "message": "Kyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyKyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyA three-inch drill mortar bomb found by the New Zealand Defence Force (NZDF) on Landguard Rd in Whanganui came from Word War II-era training exercises.\n“The mortar was replaced by the L16 81mm mortar in the 1960s but was likely used in training until the mid-1980s.\n“Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there.", "location": "Landguard Bluff", "classification": "security", "score": 0.9001838888399193, "event_breakdown": "Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there."}, {"id": "d2510744-37c6-414b-ba1d-beab24e76fe8", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Winnipeg Free Press", "date": "2024-05-30 04:45", "url": "https://www.winnipegfreepress.com/world/2024/05/29/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nWorld War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.", "location": "FRANCE", "classification": "security", "score": 0.49976999006243855, "event_breakdown": "Andy Negra, 96, recalled the time he was drafted into the U.S. Army in 1944 during World War II. He was assigned to the 128th Armored Field Artillery Battalion of the 6th Armored Division. \n\n\"I was 18 years old,\" said Negra, now a resident of Helen, Ga. \"I didn't know what exactly war was all about.\"\n\nIn October 1943, Negra was among several draftees who boarded a train in New York City bound for Camp Fannin, Texas, the starting point for basic training. The 128th AFA Battalion was part of the 6th AD, a formation of mechanized infantry, tank and artillery units known for their effectiveness during World War II.\n\nNegra's unit was equipped with 155mm self-propelled assault guns, known as \"armored guns.\" Equipped with a .50-caliber machine gun and directed by a five-man crew, these were much like the tanks that accompanied them.\n\n\"We'd go from point A to point B, depending on where we were,\" Negra said during a March 31 interview at the Unicoi State Park and Lodge in Helen. \"We were mainly there to support the infantry on their advances, so basically we were like assault artillery.\"\n\nPart of the 6th AD, the 128th AFA Battalion was stationed near Paris and fought in the Battle of the Bulge. Negra's unit was among those ordered to relieve the 101st Airborne Division, which was surrounded in the Belgian city of Bastogne. Negra said the 6th AD headed north toward Belgium"}, {"id": "a7fb5309-30c2-4cab-aa36-dc189d3b62b7", "title": "Splatoon 3 Receives A Fresh New Update ( Version 8 . 0 . 0 ), Here Are The Full Patch Notes", "date": "2024-05-30 04:15", "url": "https://www.nintendolife.com/news/2024/05/splatoon-3-receives-a-fresh-new-update-version-8-0-0-here-are-the-full-patch-notes", "message": "Nintendo has announced its next major update for Splatoon 3, bumping the Switch title up to Version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um'ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode.", "location": "Barnacle & Dime", "classification": "security", "score": 0.5362490398288282, "event_breakdown": "Target event - Taliban ambushed a military convoy in eastern Afghanistan, killing 10 soldiers. It was an ambush.\nTaliban ambushed a military convoy in eastern Afghanistan, killing 10 soldiers."}, {"id": "dd8663e8-8fe2-47d1-a862-3252cd26243e", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:15", "url": "https://www.ksat.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "GA", "classification": "security", "score": 0.4609318985558995, "event_breakdown": "Current events of security reported in text:\n\n* World War II veteran Andy Negra sits in his home in Helen, GA, on April 10, 2024."}, {"id": "cfb1645c-f263-4750-a35a-34436c3c9091", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:00", "url": "https://www.local10.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "GA", "classification": "security", "score": 0.4609318985558995, "event_breakdown": "So far, the list is empty"}, {"id": "3776f840-cc29-4de6-a5b4-a07dfb24b2fa", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Metro US", "date": "2024-05-30 08:45", "url": "https://www.metro.us/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "Georgia, United States", "classification": "security", "score": 0.5582464399488836, "event_breakdown": "Target event: World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024."}, {"id": "ab992843-5db9-428a-8627-5121eb4df0c3", "title": "Dominican Republic : The Coup That Became a War", "date": "2024-05-30 09:45", "url": "https://time.com/archive/6833716/dominican-republic-the-coup-that-became-a-war/", "message": "Twice before, General Wessin y Wessin, 40, had relied on his planes and tank-equipped supporting troops to settle political disputes in the Dominican Republic.\nAnd for help this time, he called on the U.S. Said Wessin y Wessin: “We saved the country by only a hair.\nMost often it was in the person of Wessin y Wessin.\nIn 1962, Wessin y Wessin helped stop the Armed Forces Secretary from overthrowing the seven-man civilian Council of State that administered the country after Trujillo.\nHe called Wessin y Wessin, who immediately agreed.", "location": "SANTO DOMINGO", "classification": "security", "score": 0.5632753419390925, "event_breakdown": "1962 Dominican Civil War\nWessin y Wessin stopped the Armed Forces Secretary from overthrowing the Dominican Republic's civilian Council of State."}, {"id": "02aedb6f-f9fd-4b3b-9e32-f739df3289b2", "title": "Cleared for publication : Two soldiers murdered in attack near Shechem", "date": "2024-05-30 03:45", "url": "https://www.israelnationalnews.com/news/390786", "message": "The IDF Spokesperson's Unit on Thursday morning cleared for publication that two soldiers were murdered in the ramming attack near Shechem (Nablus) on Wednesday evening: Staff sergeant Eliya Hilel, 20, from Tel Zion, and Staff sergeant Diego Shvisha Harsaj, 20, from Tel Aviv.\nIn addition, the IDF confirmed that Staff sergeant Yedidya Azugi , 21, from Revava, fell in battle in the northern Gaza Strip.\nA soldier from the 101st Battalion of the Paratroopers Brigade was seriously injured in the battle in which Azugi fell.\nIn addition, two soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip.\nAll the soldiers were evacuated to hospital for medical treatment and their families were notified.", "location": "Gaza Strip", "classification": "security", "score": 0.9607285910133382, "event_breakdown": "IDF: 2 soldiers murdered in the ramming attack near Shechem (Nablus) Wednesday evening\nIDF: Staff sergeant Yedidya Azugi, 21, from Revava, fell in battle in the northern Gaza Strip\nTwo soldiers from the 101st Battalion of the Paratroopers Brigade were seriously injured in the battle in which Azugi fell.\nTwo soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip."}, {"id": "b481fe6a-6718-410e-bb5b-1a3fc845804d", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:15", "url": "https://www.wfmz.com/news/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_9829ce9e-f750-5f23-bbf3-940c28dbb2a6.html", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)", "location": "GA, USA", "classification": "security", "score": 0.5108491598481895, "event_breakdown": "Andy Negra, a World War II veteran, shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division at his home in Helen, Ga. on April 10, 2024. (AP Photo/Sharon Johnson)"}, {"id": "d2687874-201d-49fc-b1c7-abffba3b8885", "title": "Israel says offensive in Gaza could last for seven months", "date": "2024-05-30 00:00", "url": "https://www.pasadenastarnews.com/2024/05/29/israel-says-offensive-in-gaza-could-last-for-seven-months/", "message": "Israel says the corridor is awash in tunnels that have funneled weapons and other goods for Hamas — despite a yearslong blockade imposed by Israel and Egypt.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.\nEgypt has repeatedly expressed concerns that the Israeli offensive could push Palestinians across the border — a scenario Egypt says is unacceptable.\nThe Israeli military official said Israel has also taken “tactical control” of Tel al-Sultan, a neighborhood on Rafah’s northwest edge.", "location": "GAZA", "classification": "security", "score": 0.7168096309389312, "event_breakdown": "Israel has taken over the Rafah border crossing, the only crossing between Gaza and Egypt, as well as Tel al-Sultan, a neighborhood on Rafah's northwest edge."}, {"id": "de212b0a-937f-4ccb-8794-839f3f369b70", "title": "Child killed in Israeli airstrike in northwest Syria", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/syria/2024/syria-240529-irna01.htm", "message": "Child killed in Israeli airstrike in northwest SyriaIRNA - Islamic Republic News AgencyMay 29, 2024Tehran, IRNA -- A Israeli airstrike has killed a child and injured at least ten more civilians in the city of Baniyas, northwest Syria.\nAccording to Syria's SANA news agency, the airstrike took place on Wednesday evening, targeting a residential building in Baniyas, a Mediterranean coastal city in Tartous Governorate.\nEarlier on Wednesday, Syrian media reported another Israeli airstrike, which they said targeted the western city of Homs.\nOnly material damage was caused, the media outlets said.\nThe Israeli regime has in the past several years continued airstrikes on different parts of Syria, especially the capital Damascus, despite repeated protests by the Syrian government at the UN.", "location": "Baniyas", "classification": "security", "score": 0.8834105651540716, "event_breakdown": "Events in Tartous Governorate in Syria and Homs in Syria."}, {"id": "2003172e-a5bd-494a-be44-27b541cc9997", "title": "Israel Claims Control of Strategic Philadelphi Corridor Between Gaza , Egypt", "date": "2024-05-30 10:45", "url": "https://www2.cbn.com/news/israel/israel-claims-control-strategic-philadelphi-corridor-between-gaza-egypt", "message": "JERUSALEM, Israel – In a major breakthrough, Israel announced that it has gained control over the strategic Philadelphi Corridor, cutting off the Gaza-to-Egypt terror tunnels.\nHamas turned the Philadelphi route into a central Hamas hotbed of terror.\nWe have now gained operational control over the Philadelphi route in Rafah.\"\nInstead, Israel claims the corridor served as Hamas' lifeline, through which the terror group regularly smuggled weapons.\nLet's get the hostages home, let's beat Hamas, let's make sure Lebanon knows not to try or do anything.\"", "location": "GAZA", "classification": "security", "score": 0.7844287721652675, "event_breakdown": "JERUSALEM, Israel - Prime Minister Naftali Bennett has held a call with Russian President Vladimir Putin to discuss ways to accelerate brokering a deal between Russia and Ukraine.\nIn a written statement, the Prime Minister's Office claimed that the Bennett-Putin call allowed for an effective continuation of talks between Russia and Ukraine.\nThey discussed the diplomatic efforts being made to bring an end to the violence and their belief that negotiation was the only way to end the war.\nThey also addressed living conditions for Jewish populations in proximity to the Gaza Strip and the best way to ensure the safety of local IDF troops."}, {"id": "f9faba9c-deea-4bc4-80e4-553e2541e96a", "title": "IDF intercepts cruise missile likely fired from Iraq", "date": "2024-05-30 14:00", "url": "https://www.ynetnews.com/article/b1emxjiva", "message": "This is not the first time that militias in Iraq have targeted Israel;they have claimed responsibility for several launchings of rockets, missiles and UAVs since October 7.", "location": "Babil Governorate, Iraq", "classification": "security", "score": 0.9791883907196904, "event_breakdown": "* On October 7, 2021, the Islamic State in Iraq and the Levant (ISIL) claimed responsibility for launching 10 Katyusha rockets at the al-Tanak oilfield (Berlin, Iraq).\n* On January 4, 2022, the Islamic Resistance in Iraq - Mujahedin-e Khalq claimed responsibility for launching 30 Grad rockets at the U.S. Embassy (Baghdad, Iraq).\n* On February 4, 2022, the Islamic State of Iraq and the Levant (ISIL) claimed responsibility for launching 16 Katyusha rockets at the Iranian consulate in Basra (Iraq).\n* On February 6, 2022, the Islamic Resistance in Iraq - Mujahedin-e Khalq claimed responsibility for launching 10 Grad rockets at the U.S.-led coalition forces in Erbil (Iraq)."}, {"id": "23d3a004-89c9-4679-b35c-a808d5350054", "title": "  Some New US Missiles , You Cant Hear Them : Russians In Panic After Fly - Ins In Donetsk - Belarusian News", "date": "2024-05-30 14:00", "url": "https://charter97.org/en/news/2024/5/30/596973/", "message": "‘Some New US Missiles, You Can't Hear Them’: Russians In Panic After Fly-Ins In Donetsk 7 30.05.2024, 8:5015,838Z-war correspondents are at a loss.\nA successful strike by the AFU against a Russian Armed Forces base in occupied Donetsk has caused panic in Z-channels.\nThe Russians assure that the missiles that flew at the Russian military in Donetsk were allegedly completely silent.\n‘The strike on Kyiv district of Donetsk was carried out today by some new US missiles, the sound of the fly-in was not heard.\nIt is noteworthy that propagandists are silent about what was the target of the Ukrainian strike.", "location": "Donetsk Oblast, Ukraine", "classification": "security", "score": 0.6271601629177629, "event_breakdown": "Some New US Missiles, You Can't Hear Them: Russians In Panic After Fly-Ins In Donetsk - 7.30.2024\nZ-war correspondents are at a loss.\nSuccessful strike by AFU against Russian military in occupied Donetsk causes panic in Z-channels.\nRussians assert that US missiles flew by Russians in Donetsk today. They were completely quiet, and they could not see a fly-in."}, {"id": "f1441c61-0e55-4a57-9743-a37594175125", "title": "Operation Iron Swords", "date": "2024-05-30 00:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-29.htm", "message": "Operation Iron Swords - Day 236 - 29 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nGaza war unit tracker @2023gazawar reported : \" Today the 98th Division left the Gaza Strip and ended the Jabaliya Raid.\nThe statement added that the second operation targeted the ship (MOREA) and the third operation targeted the ship (Sealady).\nTasnim reported that inspired by Iran, the Yemeni military forces have obtained the technology to manufacture anti-ship ballistic missiles.\nThese challenges are compounded by collapsed negotiations due to Israeli obstinacy and its military operation in Rafah.", "location": "Based on the information provided, it is not possible to determine a specific location for the event.", "classification": "security", "score": 0.6355481467236264, "event_breakdown": "Some of these events cannot be placed on a map because they are either not specific enough, or they refer to general trends rather than specific events. For instance, while Houthis (who control Yemen's capital Sanaa and most of its other major cities) have fired missiles at Saudi cities, including Riyadh, there is no specific event to report here."}, {"id": "cf473d29-9634-4ae1-af45-fbfad72d3836", "title": "One killed after hand grenade explodes during Japan SDF training", "date": "2024-05-30 10:45", "url": "https://www.prokerala.com/news/articles/a1535422.html", "message": "Tokyo, May 30 : A member of Japan's Self-Defense Forces (SDF) on Thursday died over a hand grenade explosion during a training session in Yamanashi Prefecture, immediately west of Tokyo, according to local media reports.\nThe accident took place around 8.45 a.m. local time at the Ground Self-Defense Force (GSDF)'s training ground Kitafuji Exercise Area, where a 29-year-old male soldier taking part in the training was hit by shrapnel from a hand grenade thrown by another SDF member, reports Xinhua news agency.\nIn recent years, the SDF has had frequent reports of training casualties.\nA shooting incident at a GSDF shooting range in Gifu Prefecture killed an SDF member and injured two others in June last year.\nTwo Maritime SDF helicopters in April collided and crashed during a night-time anti-submarine drill, killing one and leaving seven others missing.", "location": "Yamanashi Prefecture", "classification": "security", "score": 0.9686128042274756, "event_breakdown": "Event 1: A member of Japan's Self-Defense Forces (SDF) died on May 30, 2019 due to a hand grenade explosion during a training session in Yamanashi Prefecture, immediately west of Tokyo."}, {"id": "1e5638f3-5b29-4be6-8832-e030516d91f2", "title": "Rafah massacre : Resistance says US statements prompt Israel to kill more Gazans", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-presstv08.htm", "message": "Rafah massacre: Resistance says US statements prompt Israel to kill more GazansIran Press TVWednesday, 29 May 2024 11:16 AMThe Palestinian resistance groups have condemned the recent statements made by the White House spokesman regarding Rafah carnage, saying the remarks prompt the Israeli regime to continue its aggression and acts of genocide in Gaza.\nMeanwhile, Israel has intensified its attacks on Rafah despite international condemnation.\nIsraeli forces targeted a tent camp in a designated \"safe zone\" west of Rafah and killed at least 21 people.\nThe invading forces pushed through Rafah on Wednesday as tanks were reported rolling into the centre of the city.\nGaza's Health Ministry said that at least 36,171 Palestinians have been killed and 81,420 wounded in Israeli attacks since October 7.", "location": "GAZA", "classification": "security", "score": 0.8442804176446161, "event_breakdown": "The Rafah massacre is the reported killing of at least 21 Palestinians by Israeli forces, including a reported 16 in a tent camp in the city. The killing took place despite international condemnation for Israel's escalation of violence in Rafah."}, {"id": "85920a7e-e89d-45aa-b328-c4a1e37127ff", "title": "N . Korea salvo might be part of sales pitch , South says", "date": "2024-05-30 11:15", "url": "https://www.illawarramercury.com.au/story/8646193/nkorea-salvo-might-be-part-of-sales-pitch-south-says/?cs=7484", "message": "The launches were the latest in a series of tests in 2024 by North Korea involving what analysts call \"theatre strike missiles\", or shorter-range weapons designed to hit targets within a region, as opposed to long-range missiles that might hit enemy cities on other continents.", "location": ")\nPYONGYANG", "classification": "security", "score": 0.7071506819710978, "event_breakdown": "North Korea tested a series of Theatre Strike Missiles on 2024-05-25 and 2024-05-26."}, {"id": "74b4fd4e-e705-4a30-a743-706a90e34d22", "title": "Did Israel offer Iran a  compromise in Gaza  to avoid retaliation to embassy attack ? ", "date": "2024-05-30 13:15", "url": "https://www.theweek.in/news/world/2024/05/30/did-israel-offer-iran-a-compromise-in-gaza-to-avoid-retaliation-to-embassy-attack.html", "message": "Israel sent a message to Iran via Egypt that it was willing to compromise in Gaza if Tehran avoided a reaction to the attack on its embassy in Syria, according to Iran's semi-official media Tasnim news agency.\n\"Israel sent messages through Egypt's foreign minister that it will compromise in the war in Gaza to avoid Iran's retaliation\", Hajizadeh said, adding that Iran’s attack \"destroyed\" targeted Israeli military bases.\nIsrael's attack on the Iranian Embassy in Damascus, Syria, had pushed West Asia to the edge after Iran retaliated by sending explosive drones and missiles to Israel, its first direct attack on Israeli territory.\nHouthis get 'Ghadr'Tasnim said in another report that Tehran’s sea-launched ballistic missile 'Ghadr' has been made available to Yemen’s Houthis.\nInitially, after the attack, the Laax had listed its destination as Fujairah in the United Arab Emirates.", "location": "Gaza", "classification": "security", "score": 0.9091930730303398, "event_breakdown": "On May 19, 2022, Israel sent a message to Iran via Egypt that it was willing to compromise in the Gaza war if Tehran avoided a reaction to the Israeli attack on its embassy in Syria. Iran responded by sending explosive drones and missiles to Israel, the first direct attack on its territory. \nOn May 22, 2022, it was reported that Tehran's sea-launched ballistic missile Ghodar was made available to Yemen's Houthis."}, {"id": "f4f23391-b000-42fb-8d06-0ee43e80af55", "title": "Israeli official expects war with Hamas to last until year end", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-voa01.htm", "message": "Israeli official expects war with Hamas to last until year's endBy VOA News May 29, 2024A top Israeli official said Wednesday that he expected Israel's war against Hamas in the Gaza Strip to last through the end of the year, amid continued calls for a cease-fire.\n\"We may have another seven months of fighting to consolidate our success and achieve what we have defined as the destruction of Hamas' power and military capabilities,\" national security adviser Tzachi Hanegbi told Israeli public radio.\nRafah violenceThe Israeli military said Wednesday that three of its soldiers were killed in the southern Gaza city of Rafah, where residents reported fresh Israeli attacks and Hamas said it fired rockets at the Israel Defense Forces, or IDF.\nIsraeli Prime Minister Benjamin Netanyahu has repeatedly said Israel needs to carry out the Rafah offensive to achieve its goal of ensuring Hamas cannot operate in Gaza and threaten Israel in the future.\nThe Israel-Hamas war was triggered by the October 7 Hamas terror attack on Israel that killed 1,200 people, according to Israeli officials, and led to the capture of about 250 hostages.", "location": ".\nGAZA", "classification": "security", "score": 0.7304518290160565, "event_breakdown": "Israeli official: Expect war with Hamas to last through year's end\nThree IDF soldiers killed in Gaza city of Rafah\nThree IDF soldiers killed in Rafah, Gaza"}, {"id": "c99690c2-e924-4e58-9bc0-8178738b37d1", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 12:30", "url": "https://www.scmp.com/news/world/middle-east/article/3264749/rafah-battles-intensify-israel-takes-over-gaza-egypt-border-strip-cut-smuggling-tunnels", "message": "The Israeli military launched its incursion into Rafah in early May, despite international objections over the fate of Palestinian civilians sheltering there.\nRafah residents reported intense artillery shelling and gunfire on Thursday in Gaza’s far-southern city after Israel said it had seized a strategic corridor on the Palestinian territory’s border with Egypt.\nIsraeli soldiers during military operations in a border area in the southern Gaza Strip.\nPalestinians fleeing with their belongings ride atop their vehicle in Rafah in the southern Gaza Strip.\nThe United States has been among those nations urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.", "location": "GAZA", "classification": "security", "score": 0.977131280508628, "event_breakdown": "Israeli airstrikes hit Gaza in response to rocket fire\nIsraeli troops enter Rafah in southern Gaza\nIsraeli forces attack in Lebanon in response to cross-border fire"}, {"id": "ec1ba005-cb34-46a6-bc85-3754047b7658", "title": "Russian Air Defense Downs Ukrainian Drone , 7 Grad Rockets Over Belgorod Region", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240529-sputnik05.htm", "message": "Russian Air Defense Downs Ukrainian Drone, 7 Grad Rockets Over Belgorod RegionSputnik News20240529MOSCOW (Sputnik) - Russian air defense systems destroyed a Ukrainian unmanned aerial vehicle (UAV) and seven Grad multiple rocket launcher system (MLRS) shells over the Belgorod Region, the Russian Defense Ministry said on Wednesday.\n\"Air defense systems on duty destroyed one UAV and seven Grad MLRS rockets over the territory of the Belgorod Region,\" the ministry said.\nThe ministry added that an attempted terrorist attack by Kiev regime \"against facilities on the territory of Russia was foiled.\"\nThe Russian air defense also destroyed a drone over Russia's Krasnodar Territory, the regional governor, Veniamin Kondratyev, said.\nA UAV was destroyed by air defense forces over [the city of] Armavir,\" Kondratyev said on Telegram.", "location": "Belgorod Region", "classification": "security", "score": 0.8411651163571767, "event_breakdown": "Location: Belgorod Region, Russia\nTarget: Russian air defense systems destroyed a Ukrainian unmanned aerial vehicle (UAV) and seven Grad multiple rocket launcher system (MLRS) shells over the Belgorod Region."}, {"id": "448af431-416a-4b86-ae40-b809a964e5d7", "title": "AGM - 88 HARM Missile : Designed to Destroy Radar in a China or Russia War", "date": "2024-05-30 12:00", "url": "https://nationalinterest.org/blog/buzz/agm-88-harm-missile-designed-destroy-radar-china-or-russia-war-210817", "message": "-As adversaries like China rapidly modernize their military capabilities, the AGM-88 HARM becomes increasingly crucial for maintaining a tactical advantage, particularly in the Indo-Pacific region.\n-Its deployment on various aircraft ensures that U.S. forces can effectively counter advanced air defense threats and establish air superiority.\nAGM-88 HARM: America's Answer to Advanced Air Defense Systems\"In 2024, air power remains probably the most important aspect of modern, large-scale warfare.\nAGM-88 HARM: Radar, Here I ComeThe AGM-88 High-Speed Anti-Radiation Missile (HARM) is an air-to-ground munition designed to take out enemy air defenses.\nWhat makes the AGM-88 HARM particularly useful is its ability to detect, attack, and destroy a target with minimum interaction by the aircrew.", "location": "PACIFIC OCEAN", "classification": "security", "score": 0.664394975364186, "event_breakdown": "* In the Pacific Ocean, the U.S. Navy deployed the AGM-88 HARM missile on the USS Theodore Roosevelt aircraft carrier as part of ongoing military drills in the region.\n* In Malaysia, the Royal Malaysian Air Force (RMAF) announced that it will be acquiring the AGM-88 HARM missile to enhance its air defense capabilities.\n* In the Middle East, the U.S. Navy deployed the AGM-88 HARM missile on the USS Nimitz aircraft carrier as part of ongoing military drills in the region."}, {"id": "9d4b16aa-19dd-4768-810f-2b1a2dc8b7a0", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 10:45", "url": "https://www.al-monitor.com/originals/2024/05/rafah-battles-intensify-israel-takes-over-gaza-egypt-border-strip", "message": "May 30, 2024 — Rafah (Palestinian Territories) (AFP)Rafah residents reported intense artillery shelling and gunfire Thursday in Gaza's far-southern city after Israel said it had seized a strategic corridor on the Palestinian territory's border with Egypt.\nThe Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nA steady stream of civilians have fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts.\nThe United States has been among those nations urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nHowever, the White House said Tuesday that so far it had not seen Israel cross President Joe Biden's \"red lines\".", "location": "GAZA", "classification": "security", "score": 0.42048789909345696, "event_breakdown": "Rafah residents reported intense artillery shelling and gunfire in the city's southern edge after Israel said it had seized a strategic corridor on the Palestinian territory's border with Egypt."}, {"id": "0846cbda-5196-42af-ae45-120f4558410e", "title": "Live updates : Israel - Hamas war in Gaza , Rafah offensive draws global outcry", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-30-24/", "message": "The Israeli military says it has established “operational control” over the Philadelphi Corridor, a 14-kilometer (8.7-mile) buffer zone on the Egypt-Gaza border.\n“In the last few days, Israel established operational control over the Philadelphi Corridor,” Israel Defense Forces (IDF) spokesperson Daniel Hagari said at a press briefing on Wednesday.\nThe official said the 20 tunnels crossed into Egypt, some of which are new, and Egypt has been informed.\nHagari said this route was used to transfer weapons and that the Israeli military found and destroyed weapons there.\nOn Monday, an Egyptian security personnel was killed on the border with Gaza in a shooting that involved Egyptian and Israeli soldiers.", "location": "GAZA", "classification": "security", "score": 0.8347414743600231, "event_breakdown": "IDF establishes control over Philadelphi Corridor on Egypt-Gaza border"}, {"id": "089cf086-b2ef-4c97-9cf0-ee42898569a4", "title": "Hezbollah targets Israeli army position in northern occupied Palestine", "date": "2024-05-30 13:15", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240529-irna03.htm", "message": "Hezbollah targets Israeli army position in northern occupied PalestineIRNA - Islamic Republic News AgencyMay 29, 2024Tehran, IRNA -- Lebanon's Hezbollah has once again targeted the gathering of the Zionist military in northern occupied Palestine.\nIn a statement on Wednesday, Hezbollah's war media confirmed the attack, which targeted the northern area of occupied Palestine.\nAccording to this statement, after monitoring the movements of the Zionist forces in ​​Beyaz Belida, Hezbollah fighters targeted them with artillery shells.\nLebanon's Hezbollah targeted another Zionist army base in northern occupied Palestine with a guided missile on Tuesday.\nHezbollah announced on Tuesday that it had targeted and damaged the Ramiya military base in northern occupied Palestine near the Lebanese border.", "location": "northern occupied Palestine", "classification": "security", "score": 0.9583043042848126, "event_breakdown": "Hezbollah targets Israeli army position in northern occupied Palestine"}, {"id": "0b373313-9d6e-462d-bd67-1a4153633682", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 13:00", "url": "https://uk.news.yahoo.com/israeli-airstrike-rafah-kills-12-123550696.html", "message": "Palestinians inspect the damages after Israeli forces withdrew from a part of Jabalia refugee camp, in the northern Gaza StripBy Dan WilliamsJERUSALEM (Reuters) - Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nGaza medical sources said the 12 Palestinians, whom it said were civilians, had been killed and an unspecified number of others wounded in an Israeli airstrike as they tried to recover the body of a civilian in the centre of Rafah.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of the densely populated enclave, the medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood.", "location": "GAZA", "classification": "security", "score": 0.9715688289455205, "event_breakdown": "Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of densely populated enclave, the medics said, adding that the residents had taken cover at a nearby school."}, {"id": "e30811ef-59f9-4c30-8b76-28cc4cc72817", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after boardwalk unrest", "date": "2024-05-30 01:00", "url": "https://buffalonews.com/news/national/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest/article_b76a465d-d1ae-5e09-ac64-ca22a1d681dc.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest.", "location": "Ocean City, Maryland", "classification": "security", "score": 0.885389261340814, "event_breakdown": "Ocean City, Maryland: 15-year-old boy stabbed, numerous fights and disturbances on the boardwalk.\nSeaside Heights, New Jersey: False report of shooting on the boardwalk."}, {"id": "d174a5cc-187e-4726-b0d0-c43dda902a25", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 14:00", "url": "https://www.swissinfo.ch/eng/israeli-airstrike-on-rafah-kills-12-palestinians%2c-gaza-medics-say/79125594", "message": "Israeli airstrike on Rafah kills 12 Palestinians, Gaza medics sayreuters_tickers5 minutesBy Dan WilliamsJERUSALEM (Reuters) – Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nGaza medical sources said the 12 Palestinians, whom it said were civilians, had been killed and an unspecified number of others wounded in an Israeli airstrike as they tried to recover the body of a civilian in the centre of Rafah.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of the densely populated enclave, the medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood.", "location": "GAZA", "classification": "security", "score": 0.9643111741947561, "event_breakdown": "Israeli airstrike on Rafah kills 12 Palestinians, Gaza medics say\nIsraeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said."}, {"id": "0a000956-f02c-4f21-a678-69b5be1bdad0", "title": "Rio Grande City man pleads guilty in grandfather stabbing death", "date": "2024-05-30 03:15", "url": "https://www.krgv.com/news/rio-grande-city-man-pleads-guilty-in-grandfather-s-stabbing-death/", "message": "A 31-year-old Rio Grande City man faces a 40-year prison sentence after pleading guilty in connection with the stabbing death of his grandfather, according to Starr County District Attorney Gocha Ramirez.\nREAD MORE: Rio Grande City man accused in stabbing death of grandfatherOfficers responding to the scene found 81-year-old Joseph Seale dead inside the residence.\nAccording to Rio Grande City Police Chief Noe Castillo, Villalon stabbed Seale following an argument.\nVillalon pleaded guilty to the murder charge on Wednesday as part of a plea agreement, Ramirez said.\nThe defendant has agreed to plead guilty to the murder charge, with the State recommending a 40-year prison sentence.\"", "location": "Rio Grande City, Texas", "classification": "security", "score": 0.7348042054794577, "event_breakdown": "Event 1: Rio Grande City man charged with stabbing grandfather to death\nA 31-year-old Rio Grande City man pled guilty in connection with the stabbing death of his grandfather and is facing a 40-year prison sentence."}, {"id": "8aad09a4-1ee2-4b90-8688-37d499f4667f", "title": "Highland Park shooting suspect Robert Crimo III appears in court as 2nd anniversary of attack approaches", "date": "2024-05-30 02:45", "url": "https://abc7chicago.com/post/highland-park-shooting-suspect-robert-crimo-iii-appears/14888455/", "message": "Highland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nHighland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches.\nRobert Crimo III is accused of killing seven people and wounding dozens at the parade on July 4, 2022.", "location": "Highland Park", "classification": "security", "score": 0.6887481572680328, "event_breakdown": "Highland Park shooting suspect Robert Crimo III appeared in court Wednesday, as the 2nd anniversary of the attack approaches."}, {"id": "4bda8ed2-06d1-4f9a-92dc-d14b0aca152d", "title": "Israeli Efforts to Weaken the Palestinian Authority Could Shatter the Limited Calm in the West Bank - Israel News", "date": "2024-05-30 03:45", "url": "https://www.haaretz.com/israel-news/2024-05-30/ty-article/.premium/israeli-efforts-to-weaken-the-pa-could-shatter-the-limited-calm-in-the-west-bank/0000018f-c5fe-d801-a3ef-fdfea0810000", "message": "Two Israelis were seriously injured Wednesday night at the southern entrance to Nablus when they were hit by a Palestinian vehicle.\nThe army believes that it was a ramming attack and began a manhunt for the driver.\nHowever, over the course of nearly eight months of war in the Gaza Strip, the West Bank has been relegated to a secondary front.\nThe Israel Defense Forces has deployed many reserve units there and has undertaken major operations in the Jenin, Nablus and Tulkarm areas.\nThere have been lots of shooting attacks and hundreds of Palestinians have been killed in clashes with troops, and it seems the West Bank has remained just short of the boiling point.", "location": "Nablus", "classification": "security", "score": 0.990852209417637, "event_breakdown": "IDF amping up West Bank operations 'in the name of security' IDF amping up West Bank operations 'in the name of security'\nThe IDF has amped up West Bank operations 'in the name of security' - pushing into the Palestinian territories and levying heavy taxes."}, {"id": "5adeb627-868f-45d6-b3c5-82558a444185", "title": "Ship attacked by Yemen Houthi rebels was full of grain bound for Iran , the group main benefactor", "date": "2024-05-30 13:00", "url": "https://indianexpress.com/article/world/ship-attacked-yemen-houthi-rebels-grain-iran-groups-benefactor-9361665/", "message": "A Greek-owned, Marshall Islands-flagged bulk carrier that came under attack by Yemen's Houthi rebels earlier this week had a cargo of grain bound for Iran, the group's main benefactor, authorities said Thursday.\nHowever, as shipping through that artery has dropped during the months of attacks, the rebels have struck vessels associated with Iran, as well as Tehran's economic lifelines of China and Russia.\nInitially after the attack, the Laax had listed its destination as Fujairah in the United Arab Emirates.\nTuesday's attack saw five missiles hit the Laax during the hourslong assault, the private security firm LSS-SAPU told The Associated Press.\nThe war began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.", "location": "Israel", "classification": "security", "score": 0.6299459803854589, "event_breakdown": "Event 1: A Greek-owned, Marshall Islands-flagged bulk carrier that came under attack by Yemen's Houthi rebels earlier this week had a cargo of grain bound for Iran."}, {"id": "f634edd3-cbea-4195-9114-8d578a86fa8d", "title": "Gaza war may last till end of 2024 , warns Israel amid Rafah offensive", "date": "2024-05-30 11:45", "url": "https://article.wn.com/view/2024/05/30/Gaza_war_may_last_till_end_of_2024_warns_Israel_amid_Rafah_o/", "message": "An Israeli official cautioned Wednesday that the war with Hamas may last till the end of 2024 as military operations against Hamas continue, reported CNN.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\n\"We are now in the fifth... read full story\"We are now in the fifth month of 2024, which means we expect another seven months of fighting to deepen our achievements and achieve our goal of destroying the military and governmental capabilities of Hamas and Islamic Jihad,\"", "location": "Israel", "classification": "security", "score": 0.7338206084464286, "event_breakdown": "The Israeli official cautioned that the war against Hamas may last till the end of 2024 as military operations continue."}, {"id": "f4d5902e-6019-43d2-8a03-8cfdbdfc452f", "title": "Bangkok Post - Forces drill for border skirmish", "date": "2024-05-30 11:45", "url": "https://www.bangkokpost.com/thailand/general/2802399/forces-drill-for-border-skirmish", "message": "Army and air force teams gather in Sukhothai for live-fire exercisesA joint air force-army drill got under way in Sukhothai province on Thursday.\n(Photo supplied/Wassana Nanuam)A joint air force-army drill was under way in Sukhothai province on Thursday to harmonise ground force and air support in a simulated war to deal with a border conflict.\nThe drill, based on a strategy involving combined ground and air force operations, has been implemented in phases since November.\nThe ground forces included 30 Stingray light tanks, 16 M113 armoured personnel carriers, Scorpion light tanks, six 105-millimetre artillery pieces, six 120mm grenade launchers, as well as 600 soldierss.\nThere was no communication error between the ground and air forces during this exercise, he said.", "location": "Sukhothai", "classification": "security", "score": 0.529843321438522, "event_breakdown": "['Army and air force teams gather in Sukhothai for live-fire exercises.']"}, {"id": "b528622c-2644-4707-9c01-82d75e17e4d7", "title": "  Furiosa : A Mad Max  saga review : Representation in Hollywood", "date": "2024-05-30 14:30", "url": "https://www.dailysabah.com/arts/furiosa-a-mad-max-saga-review-representation-in-hollywood/news", "message": "With \"Furiosa: A Mad Max Saga,\" the turn has come for greater representation in one of the traditionally most macho and all-male franchises – that of Mad Max.\nIt explores the back story of Imperator Furiosa, one of the two lead characters in the 2015 Mad Max spinoff \"Mad Max: Fury Road.\"\nThis image released by Warner Bros. Pictures shows a scene from \"Furiosa: A Mad Max Saga.\"\nWith women’s roles defined in this way in the desert world, the converse is that men are expected to be warriors.\nThis image released by Warner Bros. Pictures shows Anya Taylor-Joy in a scene from \"Furiosa: A Mad Max Saga.\"", "location": "The events of \"Furiosa: A Mad Max Saga\" likely take place in the", "classification": "security", "score": 0.5332684789343429, "event_breakdown": "Furiosa: A New Movie to Celebrate Mad Max's First Female Lead"}, {"id": "bc17f10d-fb08-4f96-9983-37051006bb02", "title": "Wichita U . S . Army Veteran built bridges during Vietnam", "date": "2024-05-30 03:15", "url": "https://www.yahoo.com/news/wichita-u-army-veteran-built-010000923.html", "message": "WICHITA, Kan. (KSNW) — Vernon Brooks was drafted while he was attending high school at Sedgwick.\nLike, we done construction of bridges like rope bridges, cable bridges, and log bridges to get our men and supplies across in our training and under fire,” said Brooks.\nHe trained and worked on building different kinds of bridges at the Army base for his entire two-year enlistment.\nU.S. Army Iraq War Veteran struggles with nightmares and PTSD“Well, if you love the country, it’s the thing to do.\nIf you want to nominate a veteran for our Veteran Salute, email KSN reporter Jason Lamb at jason.lamb@ksn.com.", "location": "Wichita, Kansas", "classification": "security", "score": 0.4412554449854541, "event_breakdown": "The target event is a news push reporting a bridge being built by the U.S. Army. However, it does not specify the location where this event is happening, so it is not possible to map the event."}, {"id": "6bc4b5ba-e355-492c-b122-5244a62f9b1b", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 04:45", "url": "https://www.yahoo.com/news/100-vet-says-greatest-generation-041238567.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world'World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "Helen, Georgia", "classification": "security", "score": 0.436671937850195, "event_breakdown": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024. He shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n“At 100 years old, History hasn’t passed him by yet.” – NJ.COM\nHe remembers when the Germans surrendered in May of 1945. ANDY NEGRA\nSERVICE: April 6, 2017:\nArmy’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”\nIt was 1943, and Andrew “Andy” Negra Jr. had just finished high school."}, {"id": "7fd99a03-80ae-4aea-83e9-ec0c9ffcb408", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 07:45", "url": "https://www.news4jax.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.", "location": "GA", "classification": "security", "score": 0.4609318985558995, "event_breakdown": "EVENT: World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024 and shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division."}, {"id": "109cf45e-5413-4f97-b08a-06a020fc2b2f", "title": "Is North Korea Is  TPing  South Korea ? | The River 103 . 7", "date": "2024-05-30 13:00", "url": "https://www.river1037.com/2024/05/30/is-north-korea-is-tping-south-korea/", "message": "North Korea is now TPing its neighbor, South Korea.\nSouth Korea has been noticing hundreds of balloons flying across the border, not the high-altitude balloons that China was sending over here, just massive helium balloons, carrying bags of garbage.\nThe contents are being analyzed by the South Korean government, but it doesn’t sound like there’s a secret code to solve.\nNorth Korea ADMITS they’re doing this, as a, “tit for tat action.” Yes, they used that phrase.\nNorth Korean officials say they’re tired of South Korean activists sending “propaganda leaflets, food, medicine, radios, and USB sticks containing South Korean news and TV dramas” over to them the same way, with balloons.", "location": "South Korea.", "classification": "security", "score": 0.576686752282687, "event_breakdown": "North Korea / South Korea border\nOn March 5, North Korean officials admitted that they trash have been flying balloons over south Korea. The text attest that the balloons are not be sent to ddress the covid crisis."}, {"id": "ba327618-8f9f-466f-b2eb-5adb71f5a1e9", "title": "Another Big Lie About Israel Just Spread Like Wildfire", "date": "2024-05-30 19:15", "url": "https://townhall.com/tipsheet/katiepavlich/2024/05/30/another-big-lie-about-israel-just-spread-like-wildfire-n2639730", "message": "Over the weekend the Israeli Defense Forces issued a precision strike on two Hamas leaders in the southern Gaza city of Rafah.\nAdvertisementFor days this claim continued after a botched translation of remarks made by Israeli Prime Minister Benjamin Netanyahu.\nThe fire occurred because Hamas, in typical fashion, stored munitions next to the humanitarian tents.\nReporter: What is the administration going to do whether it was a tragic mistake or deliberate?\nThey should know better and wait...but they never learn.https://t.co/XUCEijlmK9 — Lahav Harkov 🎗️ (@LahavHarkov) May 28, 2024", "location": "GAZA", "classification": "security", "score": 0.8216201002828587, "event_breakdown": "IDF precision strike on two Hamas leaders in Rafah, Gaza"}, {"id": "574ec54d-66f6-4b43-86b9-a1f516e9fbb2", "title": "Syrian President Bashar Assad Visits Iran To Express Condolences Over Death Of Raisi", "date": "2024-05-30 14:45", "url": "https://www.outlookindia.com/international/syrian-president-bashar-assad-visits-iran-to-express-condolences-over-death-of-raisi", "message": "Assad's trip also comes with the backdrop of the Israel-Hamas war roiling the region.\nIran-backed Hamas led the Oct. 7 attack that started the conflict and the militant Hezbollah group in Lebanon, also supported by Tehran, has fired rockets at Israel.\nLast month, Iran launched an unprecedented drone-and-missile attack on Israel.", "location": "LEBANON", "classification": "security", "score": 0.8659289927154007, "event_breakdown": "Israel-Hamas war, Palestinian territories"}, {"id": "2e8fcde8-e78a-42cc-bf56-6346fbf9696a", "title": "Police : Stabbing at WeGo bus station sends victim to hospital , suspect in custody", "date": "2024-05-30 13:30", "url": "https://fox17.com/news/local/2024-nashville-tennessee-police-stabbing-at-wego-bus-station-sends-victim-to-hospital-suspect-in-custody-edgehill-middle-tn", "message": "One person is in custody and another is injured after a stabbing at a WeGo bus stop in the Edgehill community.\nALSO READ |Police say the suspect, now identified as Jacob Boswell, is in custody at this time.\nThe stabbing occurred at the bus stop at 12th Avenue South and Edgehill Avenue.\nOn May 16, a for allegedly shooting teen outside a WeGo bus station.\nALSO SEE |WeGo Public Transit's that the shooting and stabbing being such close proximity is unusual because the system carries about 30,000 riders each day.", "location": "Nashville, Tennessee", "classification": "security", "score": 0.9175605238495557, "event_breakdown": "One in custody, another injured in Nashville stabbing at WeGo bus stop"}, {"id": "6a8a443d-899e-40ee-9908-1347e5815927", "title": "US Intel says North Korean missile debris identified in Russian attack on Kharkiv : report", "date": "2024-05-30 18:00", "url": "https://www.yahoo.com/news/us-intel-says-north-korean-152437545.html", "message": "Analysis of Russian ballistic missiles has confirmed North Korean-produced debris throughout Ukraine, according to an unclassified report released by the Defense Intelligence Agency (DIA).\nRussia and North Korea continue to deny any arms deal has occurred, as it would violate an arms embargo on North Korea.\nNORTH KOREAN ROCKET CARRYING MILITARY SATELLITE EXPLODES AFTER LAUNCH, CRASHES INTO SEAPresident Vladimir Putin shakes hands with North Korean leader Kim Jong Un during their meeting in Russia on Sept. 13, 2023.\nThe first shipments of North Korean weapons reportedly arrived in November 2022, with the mercenary Wagner forces taking the supplies.\nOriginal article source: US Intel says North Korean missile debris identified in Russian attack on Kharkiv: report", "location": "KHARKIV", "classification": "security", "score": 0.6097349314503903, "event_breakdown": "US Intel says North Korean missile debris identified in Russian attack on Kharkiv: report"}, {"id": "db5f9d66-5c96-424d-a79a-5ccc5efd8642", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-30 19:15", "url": "https://abcnews.go.com/US/wireStory/israel-smaller-weapons-hamas-avoid-deaths-gaza-tent-110686917", "message": "They said the bombs used were likely U.S.-made.\nEven the smallest jet-launched munition may be too big when civilians are near because of how they explode and can send fragments far, defense experts said.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they're smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.", "location": "GAZA", "classification": "security", "score": 0.8858555874527768, "event_breakdown": "Based on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made GBU-39 small-diameter bombs.\n\nIsrael used U.S.-made GBU-39 small-diameter bombs in Gaza\n\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby."}, {"id": "b99ea9cf-3ade-46b5-9c23-e419afb8a5f9", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-30 19:00", "url": "https://www.ksat.com/news/politics/2024/05/30/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaza-tent-fire-experts-say/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they're smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said.", "location": "GAZA CITY", "classification": "security", "score": 0.8726527701366897, "event_breakdown": "Target Event:\nThe Israeli army launched a series of air raids in the Gaza Strip on Tuesday, in response to rocket attacks fired from the Hamas-ruled Palestinian territory. The defense experts said the bombs used were likely U.S.-made GBU-39 small-diameter bombs."}, {"id": "7dfa9ca8-b195-4849-b01b-41bfa6bf5038", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-30 19:15", "url": "https://www.kob.com/news/us-and-world-news/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaza-tent-fire-experts-say/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said.", "location": "GAZA", "classification": "security", "score": 0.8726527701366897, "event_breakdown": "Event 1: Based on satellite images and photos, two defense experts said the bombs used were likely US-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nEvent 2: Though they're smaller than many other weapons the US has provided to Israel, these bombs can still create a wide swath of damage.\nEvent 3: The defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nEvent 4: The Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said."}, {"id": "d980e06b-d21f-4456-a0da-b4db625e98b4", "title": "US Intel says North Korean missile debris identified in Russian attack on Kharkiv : report", "date": "2024-05-30 16:30", "url": "https://www.foxnews.com/world/us-intel-says-north-korean-missile-debris-identified-russian-attack-kharkiv-report", "message": "Analysis of Russian ballistic missiles has confirmed North Korean-produced debris throughout Ukraine, according to an unclassified report released by the Defense Intelligence Agency (DIA).\nThe report demonstrates how the relationship between North Korea and Russia continues to evolve and strengthen as it seeks to improve public understanding of this vital national security issue.\nRussia and North Korea continue to deny any arms deal has occurred, as it would violate an arms embargo on North Korea.\nThe first shipments of North Korean weapons reportedly arrived in November 2022, with the mercenary Wagner forces taking the supplies.\nIn return, Russia in March this year vetoed the renewal of a U.N. committee panel that investigates North Korean violations of Security Council resolutions.", "location": "North Korea", "classification": "security", "score": 0.5744714033336046, "event_breakdown": "Target Event: String of North Korean weapons shipments sent from an unnamed port on March 19th\nNorth Korean-made 40-round box cartridges were found throughout Ukraine\nEvidence suggests that North Korean military equipment has reached and been deployed in Ukraine. In March 2022, the representative of the Main Intelligence Directorate of the Ministry of Internal Affairs of Ukraine stated that Russian mercenaries, such as Wagner, transported military equipment from North Korea. The destroyer  of Battalion Wagner \"Tambov\" carried military equipment in waters near Japan. The ship subsequently moved to the war zone in the east of Ukraine on March 19."}, {"id": "edfa78b3-f476-4e95-a15e-b7b73fda81fe", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say – Winnipeg Free Press", "date": "2024-05-30 18:30", "url": "https://www.winnipegfreepress.com/world/2024/05/30/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaza-tent-fire-experts-say", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said.", "location": "SYRIA", "classification": "security", "score": 0.8726527701366897, "event_breakdown": "Israel's bombing of the Gaza Strip\nThe Israeli military bombed the Gaza Strip early Saturday, targeting Hamas positions in response to incendiaries launched into Israel from the coastal territory the previous night, according to the Israel Defense Forces.\nThere were no immediate reports of injuries in either Israel or the Gaza Strip.\nThe Israeli strikes, which were the first under the new government of Naftali Bennett, came after incendiaries launched from Gaza on Friday night caused brush fires in Israeli fields along the frontier.\nGaza’s Hamas leader, Yehya Sinwar, told the Arab television channel Al-Jazeera on Saturday that there was “no end in sight” to the conflict."}, {"id": "e04c7e06-5dd3-4ac9-b0ec-883ef0490f20", "title": "Nikki Haley writes  finish them  on IDF shells during Israel visit", "date": "2024-05-30 03:30", "url": "https://www.nzherald.co.nz/world/nikki-haley-writes-finish-them-on-idf-shells-during-israel-visit/KOINBXCXXRAY3PSFUFE3DLOC5Y/", "message": "Former U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APFormer U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APNikki Haley wrote “finish them!” on the side of a fresh Israeli artillery shell during a visit to Israel.\nOn Tuesday, she visited an artillery post on the country’s northern border and wrote on a shell: “Finish them!\nDon’t let anybody make you feel wrong because Israel is not wrong in this,” Haley said in a press conference on Monday.", "location": "Israel", "classification": "security", "score": 0.5447887930017986, "event_breakdown": "Former U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nOn Tuesday, she visited an artillery post on the country’s northern border and said: “Finish them! Don’t let anybody make you feel wrong because Israel is not wrong in this,” Haley said in a press conference on Monday."}, {"id": "7ca53bf8-9d4f-4f65-874b-0beb5b902996", "title": "Machete attack in Times Square McDonald ", "date": "2024-05-30 19:30", "url": "https://www.thetimes.co.uk/article/machete-attack-in-times-square-mcdonalds-8ssks6fkc", "message": "A man has been stabbed in both legs with a machete at a McDonald’s in New York’s Times Square, according to police.\nThree suspects are being sought in connection with the attack, the New York Police Department said.\nThe stabbing occurred inside a McDonald’s on the corner of West 45th St and Broadway, an area of Midtown Manhattan popular with tourists.\nThe victim was taken to Bellevue Hospital with non-life-threatening injuries.\nPolice are canvassing the area for CCTV of the attack.", "location": "New York", "classification": "security", "score": 0.9563607772514382, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nPolice have launched a manhunt for the suspect who stabbed a 26-year-old man in both legs with a machete inside McDonald's in Times Square, New York City. The victim was sent to Bellevue Hospital with non-life threatening injuries. Three men are suspected of involvement in the attack, which happened at the intersection of West 45th Street and Broadway."}, {"id": "98b0ebf4-8e48-4a13-ab17-ee91f6ba473f", "title": "Man guilty of fatal shooting less than year after being cleared over knife death", "date": "2024-05-30 18:15", "url": "https://www.kentonline.co.uk/news/national/man-guilty-of-fatal-shooting-less-than-year-after-being-cleared-over-knife-death-118979/", "message": "A man has been found guilty of a fatal shooting less than a year after being cleared of another killing.\nIn 2022, the 22-year-old was cleared over the fatal stabbing of 17-year-old Denardo Samuels-Brooks following an Old Bailey trial.\nLess than a year later, Mr Miller was fatally shot with a shotgun at close range in Mitcham, south London.\nThe prosecution claimed the killing was motivated by revenge in retribution for the stabbing of a man in south London last April 3.\nThey travelled across south London towards the area where their friend was stabbed, jurors were told.", "location": "Mitcham", "classification": "security", "score": 0.6744534738505757, "event_breakdown": "Mitcham, London"}, {"id": "e152c3b6-119b-4ab0-a9ff-e97d6661c482", "title": "Man Stabbed With A Machete In Times Square | News Radio 690 KTSM", "date": "2024-05-30 19:30", "url": "https://ktsmradio.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS.", "location": "Times Square", "classification": "security", "score": 0.47515654604441215, "event_breakdown": "Three men allegedly involved in a brutal machete attack in New York City's (NYC) Times Square on May 30, 2019, were detained by authorities. Officials said that a man was stabbed in the legs outside a McDonald's just after 10 a.m. and was taken to the hospital in stable condition. Officials said they believe the attack was the result of a turf dispute between people selling items in the area. Anyone with information about the attack is asked to contact Crime Stoppers."}, {"id": "1abb49ae-0649-435f-9720-739605780f2d", "title": "7 - year - old girl critically wounded in Iranian missile attack regains consciousness", "date": "2024-05-30 18:00", "url": "https://www.israelnationalnews.com/news/390825", "message": "Amina al-Hassouni, the seven-year-old girl who was critically wounded in Iran's massive missile and drone attack on Israel over a month ago, has regained consciousness, Kan 11 reported.\nAmina was the only Israeli casualty in the attack on the night of April 13.\nShe was critically wounded when shrapnel from an intercepted ballistic missile struck her family's home.\nIran fired about 350 attack drones and missiles at Israel in its massive attack on the Jewish state, including at 30 cruise missiles and 120 ballistic missiles.\nNearly all of the Iranian projectiles failed or were intercepted, though debris from one intercepted ballistic missile caused Amina's injuries.", "location": "ISRAEL", "classification": "security", "score": 0.9640875291541063, "event_breakdown": "Amina al-Hassouni, the seven-year-old girl who was critically wounded in Iran's massive missile and drone attack on Israel over a month ago, has regained consciousness, according to Kan. She had been injured by shrapnel."}, {"id": "e6ede0ce-ba94-460f-bd82-fe4bb443dacf", "title": "Israel presses with raids into Rafah", "date": "2024-05-30 19:15", "url": "https://www.thedailystar.net/news/world/middle-east/news/israel-presses-raids-rafah-3623211", "message": "Israeli military spokesman Rear Admiral Daniel Hagari announced that Israel had taken \"operational control\" of the narrow border area, where he said troops had \"discovered around 20 tunnels\".\n\"Israel is using these allegations to justify continuing the operation on the Palestinian city of Rafah and prolonging the offensive for political purposes,\" a high-level Egyptian source was quoted as saying by state-linked Al-Qahera News.\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nA steady stream of civilians fled Rafah, transporting their belongings on their shoulders, in cars or on donkey-drawn carts.\nThe Palestinian Red Crescent reported late Wednesday that two of its paramedics \"were killed as a result of the Israeli occupation's direct bombing\" of an ambulance near Rafah.", "location": "GAZA", "classification": "security", "score": 0.9397956561942776, "event_breakdown": "Israeli troops have taken 'operational control' of the narrow border area, discovering around 20 tunnels. The border area has not been identified.\nTwo paramedics were reported killed as a result of Israeli occupation of an ambulance near Rafah. Rafah is a city in the southern part of Gaza."}, {"id": "47c96d7e-5a53-4c0a-bdf8-d90a3b0b9ac3", "title": "Israeli airstrikes hammer 50 Hamas facilities across Gaza", "date": "2024-05-30 19:15", "url": "https://www.devdiscourse.com/article/international/2955920-israeli-airstrikes-hammer-50-hamas-facilities-across-gaza", "message": "Tel Aviv [Israel], May 30 (ANI/TPS): Israeli airstrikes across Gaza hammered Hamas, hitting more than 50 terror facilities in the last day, the Israel Defence Forces said on Thursday.\nIn the Rafah area, a three-man Hamas squad firing at Israeli soldiers was eliminated in an airstrike.\nMeanwhile, troops in the area uncovered large quantities of weapons, including anti-tank missile launch posts, tunnel shafts, a weapons storage facility, and explosives.\nHamas is holding our hostages in a living hell across our border in Gaza, including in Rafah.\nIsraeli forces located weapons, including AK-47s and ammunition.", "location": "Rafah", "classification": "security", "score": 0.9369068933438333, "event_breakdown": "Tel Aviv [Israel], May 30 (ANI/TPS): Israeli airstrikes across Gaza hammered Hamas, hitting more than 50 terror facilities in the last day. In the Rafah area, a three-man Hamas squad firing at Israeli soldiers was eliminated in an airstrike. In the Rafah area, troops located weapons, including anti-tank missile launch post and AK-47s."}, {"id": "363968cf-1935-4b4f-aa51-32f514bba98f", "title": "BAP president Khalid Magsi escapes assassination attempt", "date": "2024-05-30 14:45", "url": "https://tribune.com.pk/story/2469030/bap-president-khalid-magsi-escapes-assassination-attempt", "message": "Levies sources say armed assailants opened fire on BAP president Khalid Hussain Magsi's convoy, but security personnel and guards responded swiftly, forcing the attackers to flee.\nPHOTO: FILEKhalid Hussain Magsi, President of the Balochistan Awami Party (BAP) and a member of the National Assembly, narrowly escaped an assassination attempt in the Notal area of Nasirabad district, according to levies officials.\nArmed assailants opened fire on Magsi's convoy, but security personnel and guards responded swiftly, forcing the attackers to flee.\nIn November, BAP elected Magsi as its president, replacing Mir Abdul Qudoos Bizenjo.\nSenator Nasibullah Bazai, senior vice president of the party, administered the oath to the newly elected president.", "location": "Notal area of Nasirabad district", "classification": "security", "score": 0.9815422224093686, "event_breakdown": "Khalid Hussain Magsi, president of the Balochistan Awami Party (BAP), escapes assassination attempt at Notal area of Nasirabad district in Balochistan. As of current reporting, there were no additional events to report."}, {"id": "9b276289-c449-4cdf-84b0-c14e1b828dc9", "title": "Ukraine hit a total of 4 Russian patrol boats in occupied Crimea overnight , military intelligence says", "date": "2024-05-30 16:30", "url": "https://www.yahoo.com/news/ukraine-hit-total-4-russian-153837834.html", "message": "Ukrainian Magura 5V naval drones damaged two more Russian patrol boats in occupied Crimea, bringing the total number of vessels struck in the overnight attack on May 30 to four, Ukraine's military intelligence (HUR) said.\nEarlier on May 30, the agency first reported that two patrol boats of the KS-701 Tunets (Tuna) model were destroyed in the attack.\nIn order to thwart the attack, Russian forces scrambled their aircraft 32 times, including Su-27/30/35 and MiG-29 jets, Be-12 and An-26 aircraft, and Ka-27/29 and Mi-8 helicopters, the statement read.\nMagura drones destroyed the Russian Sergey Kotov patrol ship on March 5, and the Ropucha-class landing ship Caesar Kunikov was sunk by drones on Feb. 14.\nRead also: These are the most important Russian ships destroyed by UkraineWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Crimea", "classification": "security", "score": 0.7665663783577158, "event_breakdown": "Magura drones damaged two more Russian patrol boats in occupied Crimea, bringing the total number of vessels struck in an overnight attack on May 30 to four, Ukraine's military intelligence (HUR) says. Earlier on May 30, the agency first reported two patrol boats of the KS-701 Tunets (Tuna) model were destroyed in the attack. Russian forces scrambled their aircraft 32 times, including Su-27/30/35 and MiG-29 jets, Be-12 and An-26 aircraft, and Ka-27/29 and Mi-8 helicopters to thwart the attack, the statement read. Magura drones previously destroyed the Russian Sergey Kotov patrol ship on March 5, and the Ropucha-class landing ship Caesar Kunikov was sunk by drones on Feb. 14."}, {"id": "2260e72f-b4b6-4342-b93e-fa1b2983e4c5", "title": "Unprotected : Troops Spent Decades Elbow - Deep in Dangerous Chemicals to Keep Nuclear Missiles Working", "date": "2024-05-30 17:00", "url": "https://www.military.com/daily-news/2024/05/30/unprotected-troops-spent-decades-elbow-deep-dangerous-chemicals-keep-nuclear-missiles-working.html", "message": "In these dated facilities, service members have come in contact with carcinogens such as polychlorinated biphenyls, or PCBs; lead paint; asbestos; and tainted water.\nWarren Air Force Base, works on a component on Jan. 17, 2024.\nBut former and current missile maintainers believe the culture and high tempo of keeping the missiles on alert forces many of them to take risks, even though they're aware of them.\nMost of them are scattered throughout the Midwest and western states ranging from Ellsworth Air Force Base, South Dakota; Davis-Monthan Air Force Base, Arizona; Whiteman Air Force Base, Missouri; McConnell Air Force Base, Kansas; Little Rock Air Force Base, Arkansas; and Grand Forks in North Dakota.\nCurrent Air Force leaders such as Schantz say missile maintainers should know they're taking on an inherently dangerous job.", "location": "Warren Air Force Base", "classification": "security", "score": 0.6724676988403576, "event_breakdown": "Warren Air Force Base, Wyoming - Warren Air Force Base was chosen for Wedgies initial training for the Air Force Space Integration Workforce.\nEllsworth Air Force Base, South Dakota - Ellsworth Cavaliers Dining Facility (DFA) renovations.\nDavis-Monthan Air Force Base, Arizona - The 612th Air Base Squadron personnel at Davis-Monthan Air Force Base implemented a zero-based budget approach to make easy program investment decisions.\nWhiteman Air Force Base, Missouri - Whiteman Air Force Base supports the mission in today's Air Force, it can be seen that America is still needed.\nMcConnell Air Force Base, Kansas - McConnell Air Force Base based Air Force Reserve Command KC-46A Pegasus maintainers based at McConnell Air Force Base supported the aircraft's global readiness and mission by pushing sorties on time.\nLittle Rock Air Force Base, Arkansas - The 19th Airlift Wing from Little Rock Air Force Base loaded three C-130Js for overseas missions.\nGrand Forks Air Force Base, North Dakota - Grand Forks Air Force Base will host Octobers Walk To Remember, an activity to honor fallen service members."}, {"id": "93a36ff4-b4f2-472f-821f-33a79eabbf23", "title": "Ukraine army head says Russia augmenting its troops in critical Kharkiv region", "date": "2024-05-30 14:45", "url": "https://www.local10.com/news/world/2024/05/30/ukraine-army-head-says-russia-augmenting-its-troops-in-critical-kharkiv-region/", "message": "Ukrainian servicemen search a target with a US Stinger air defence missile launcher on the front line in Zaporizhzhia region, Ukraine, Tuesday, May 28, 2024.\nUkraine's GUR military intelligence operation said that sea drones destroyed two Russian KS-701 patrol boats in the Black Sea off the Russia-annexed Crimean Peninsula.\nIn Kharkiv, Ukraine's second-largest city, seven people were wounded and a municipal services building caught fire in the attacks, regional Gov.\nOne person was wounded by a drone explosion in Russia's Belgorod region, which borders Kharkiv and comes under daily attack from the Ukrainian side.\nRussian missiles and bombs also have pummeled Ukrainian military positions and civilian areas, including the power grid.", "location": "Ukraine", "classification": "security", "score": 0.9191084678273482, "event_breakdown": "Kharkiv - Seven people were injured and a building was damaged in a drone attack that injured seven people.\nRussia-Ukraine border - One person was wounded by a drone explosion in Russia's Belgorod region, which shares a border with Ukraine and suffers daily attacks from Ukraine.\nRussia-Ukraine border - Russian missiles and bombs have been pummeling Ukrainian military positions, civilian areas, and power grids,"}, {"id": "2ce74b5c-6022-448a-a125-6a16ce26ae6e", "title": "Ukraine army head says Russia augmenting its troops in critical Kharkiv region", "date": "2024-05-30 16:30", "url": "https://www.news4jax.com/news/world/2024/05/30/ukraine-army-head-says-russia-augmenting-its-troops-in-critical-kharkiv-region/", "message": "Ukrainian servicemen search a target with a US Stinger air defence missile launcher on the front line in Zaporizhzhia region, Ukraine, Tuesday, May 28, 2024.\nUkraine's GUR military intelligence operation said that sea drones destroyed two Russian KS-701 patrol boats in the Black Sea off the Russia-annexed Crimean Peninsula.\nIn Kharkiv, Ukraine's second-largest city, seven people were wounded and a municipal services building caught fire in the attacks, regional Gov.\nOne person was wounded by a drone explosion in Russia's Belgorod region, which borders Kharkiv and comes under daily attack from the Ukrainian side.\nRussian missiles and bombs also have pummeled Ukrainian military positions and civilian areas, including the power grid.", "location": "Kharkiv", "classification": "security", "score": 0.9191084678273482, "event_breakdown": "1. Ukrainian servicemen search a target with a US Stinger air defence missile launcher on the front line in Zaporizhzhia region, Ukraine, Tuesday, May 28, 2024."}, {"id": "32d1cdff-4456-4d82-abbf-a93a88eded56", "title": "Escalation in Kharkiv : Russia Advances and US Aid Delays", "date": "2024-05-30 19:00", "url": "https://www.devdiscourse.com/article/politics/2955869-escalation-in-kharkiv-russias-advances-and-us-aid-delays", "message": "The air force said that the overnight attacks included eight S-300 ballistic missiles, 11 cruise missiles and 32 Shahed drones.\nIn Kharkiv, Ukraine's second-largest city, seven people were wounded and a municipal services building caught fire in the attacks, regional Gov.\nOne person was wounded by a drone explosion in Russia's Belgorod region, which borders Kharkiv and comes under daily attack from the Ukrainian side.\nA lengthy delay in US military aid and Western Europe's inadequate military production has slowed crucial deliveries to the battlefield for Ukraine, and Russia has exploited the delays to make advances in the Kharkiv region.\nRussian missiles and bombs also have pummelled Ukrainian military positions and civilian areas, including the power grid.", "location": "Kharkiv", "classification": "security", "score": 0.9731046278235107, "event_breakdown": "Eight S-300 ballistic missiles, 11 cruise missiles and 32 Shahed drones were launched in attacks across Ukraine, including in Kharkiv, where seven civilians were wounded and the municipal services building caught fire."}, {"id": "0f7a5896-4106-443a-9052-f2cd75979d3c", "title": "Ukraine army chief says Russia is augmenting its troops presence in the Kharkiv region", "date": "2024-05-30 18:30", "url": "https://www.pressherald.com/2024/05/30/ukraines-army-chief-says-russia-is-augmenting-its-troops-presence-in-the-kharkiv-region/", "message": "KYIV, Ukraine — Russia conducted an array of aerial attacks on Ukraine with cruise missiles, drones and ballistic missiles, Ukraine’s air force said Thursday, while the chief of the army said Russia is increasing its troop concentration in the Kharkiv region where Moscow’s forces have made significant advances in a spring offensive.\nUkraine’s GUR military intelligence operation said that sea drones destroyed two Russian KS-701 patrol boats in the Black Sea off the Russia-annexed Crimean Peninsula.\nThe air force said that the overnight attacks included eight S-300 ballistic missiles, 11 cruise missiles and 32 Shahed drones.\nIn Kharkiv, Ukraine’s second-largest city, seven people were wounded and a municipal services building caught fire in the attacks, regional Gov.\nRussian missiles and bombs also have pummeled Ukrainian military positions and civilian areas, including the power grid.", "location": "Kharkiv", "classification": "security", "score": 0.845448122436063, "event_breakdown": "Based on the text provided, I was able to find the following current events of security in Ukraine:\n\n1. Russia conducts several aerial attacks on Ukraine, including launching S-300 ballistic missiles, cruise missiles, and Shahed drones, targeting various locations such as Kyiv, Cherkasy, and Dnipro.\n2. Russian forces increase their troop concentration in the Kharkiv region, where they have made significant territorial gains in their latest offensive.\n3. Two Russian KS-701 patrol boats were destroyed by Ukrainian sea drones in the Black Sea off the Russia-annexed Crimean Peninsula.\n\nNote: It's important to note that the situation in Ukraine is rapidly evolving and events can change rapidly."}, {"id": "df0c2ac3-650f-4e89-abfc-b5f15f3f5f45", "title": "Aid Workers Describe Inferno , Bodies  Burned Beyond Recognition  In Rafah", "date": "2024-05-30 16:30", "url": "https://www.yahoo.com/news/aid-workers-describe-inferno-bodies-152403359.html", "message": "In recent months, more than a million Palestinians, including 600,000 children, were pushed by Israel into makeshift shelters in the so-called “safe zone” in Southern Gaza.\nBut on Sunday, and again on Tuesday, Israel conducted airstrikes in and around Rafah where internally-displaced Palestinians were sheltering, sparking a blaze that engulfed multiple tents.\nHundreds of thousands of Palestinians who came to Rafah to escape Israel’s bombing campaign are now fleeing as it has become clear it is not the “safe zone” that was promised.\n“A safe zone has two obligations,” says Elder.\nPeople are going to put their tents or their plastic sheeting on rubble.”Many are in Al-Mawasi, an IDF-designated humanitarian zone west of Rafah.", "location": "GAZA", "classification": "security", "score": 0.4437603185575817, "event_breakdown": "1. Israel conducted airstrikes in and around Rafah where internally-displaced Palestinians were sheltering, sparking a blaze that engulfed multiple tents.\n2. Hundreds of thousands of Palestinians who came to Rafah to escape Israel’s bombing campaign are now fleeing as it has become clear it is not the safe zone that was promised."}, {"id": "8443d60a-0338-4eab-ae29-5c30b24b3077", "title": "2 stabbed in Dunkirk , victims and suspect hospitalized", "date": "2024-05-30 16:30", "url": "https://www.yahoo.com/news/2-stabbed-dunkirk-victims-suspect-134702881.html", "message": "BUFFALO, N.Y. (WIVB) — Police said they have a suspect after two people were stabbed in Dunkirk early Thursday morning.\nOfficers responded around 3:30 a.m. to an apartment on Lake Shore Drive West for a report of a stabbing.\nThe suspect, along with the two stabbing victims, were all hospitalized for non-life-threatening injuries.\nPolice are waiting to release more information on possible charges until after the suspect is released from the hospital.\nLatest Local NewsEvan Anstey is an Associated Press Award, JANY Award and Emmy-nominated digital producer who has been part of the News 4 team since 2015.", "location": "BUFFALO, NEW YORK", "classification": "security", "score": 0.7850059223791166, "event_breakdown": "The following current events of security have been reported with locations:\n- Two people were stabbed in Dunkirk, New York on Thursday, June 2, 2022.\n- Police have a suspect in custody.\n- The suspect and two victims are in the hospital with non-life-threatening injuries.\n- Police are waiting for the victims to recover to release the possible charges."}, {"id": "069d0782-2059-4799-8332-ca85a737f142", "title": "2 men arrested in stabbing attack in Cherry Valley", "date": "2024-05-30 19:30", "url": "https://www.wifr.com/2024/05/30/2-men-arrested-stabbing-attack-cherry-valley/", "message": "CHERRY VALLEY, Ill. (WIFR) - Two men are arrested in connection with a stabbing attack on May 20 in Cherry Valley.\nKyle H. Condon, 25, of Rockford and Steven D. Mendez, 24, of Chicago, each face charges of aggravated battery causing great bodily harm and aggravated battery use of a deadly weapon.\n2 men arrested in stabbing attack in Cherry Valley (WIFR)Around 3:30 a.m., officers were called to 1800 block of Millbrook Lane for a report of a stabbing.\nPolice say they found two people hurt, with one person stabbed nine times.\nThe Winnebago County Sheriff’s Department conducted an investigation and arrested the two suspects.", "location": "Cherry Valley.", "classification": "security", "score": 0.8980115989248606, "event_breakdown": "Target event:\nTwo men are arrested in connection with a stabbing attack on May 20 in Cherry Valley."}, {"id": "e6872fbf-104f-4f5f-bfcd-04ef1cd1fa63", "title": "World - KSYL - AM", "date": "2024-05-30 17:30", "url": "https://ksyl.com/world/ccd003c569398428705f1044393fcae4", "message": "(Photo by Eyad BABA / AFP) (Photo by EYAD BABA/AFP via Getty Images)(RAFAH, GAZA) -- Sumaya Samir Al-Tot, a mother-of-one in Rafah, Gaza, said she has been displaced 17 times.\nShe said her mother, father and sister have all been killed in the conflict so far that began on Oct. 7, 2023.\nUNRWA, the U.N. agency responsible for Palestinian refugees, had effectively stopped working in Rafah, according to Salah al-Faram, who also fled Rafah with his children in tow.\nThe situation is bad here.”“I haven't slept for two days, the bombing is violent, although we are in Rafah,” he said.\n“I send a message to the whole world, to Hamas, and [Hamas leader] Sinwar to stop this war, because we are tired,” she said.", "location": "GAZA", "classification": "security", "score": 0.6505561126116928, "event_breakdown": "Security events reported in text:\n1. Rafah, Gaza is experiencing violent bombing.\n2. UNRWA, the U.N. agency responsible for Palestinian refugees, has effectively stopped working in Rafah."}, {"id": "5fb730fd-a443-4d05-a6c2-b6f7a9091c25", "title": "  Stop this war : Message from mother , displaced 18 times , who is fleeing the fighting again - WEIS", "date": "2024-05-30 18:00", "url": "https://weisradio.com/2024/05/30/stop-this-war-message-from-mother-displaced-18-times-who-is-fleeing-the-fighting-again/", "message": "(Photo by Eyad BABA / AFP) (Photo by EYAD BABA/AFP via Getty Images)(RAFAH, GAZA) — Sumaya Samir Al-Tot, a mother-of-one in Rafah, Gaza, said she has been displaced 17 times.\nShe said her mother, father and sister have all been killed in the conflict so far that began on Oct. 7, 2023.\nUNRWA, the U.N. agency responsible for Palestinian refugees, had effectively stopped working in Rafah, according to Salah al-Faram, who also fled Rafah with his children in tow.\n“There is no aid, and we are not working because of the war,” he said.\n“I send a message to the whole world, to Hamas, and [Hamas leader] Sinwar to stop this war, because we are tired,” she said.", "location": "GAZA", "classification": "security", "score": 0.4970269021897904, "event_breakdown": "RAFAH, GAZA. The Sumaya Samir Al-Tot, a mother-of-one in Gaza's Rafah, reported that she and her family have been displaced 17 times due to the ongoing conflict in the region. She also mentioned that her mother, father and sister have all been killed in the current conflict that began on Oct. 7, 2023. UNRWA, the U.N. agency responsible for Palestinian refugees, has also effectively stopped working in Rafah due to the ongoing war. Several families, including Salah al-Faram who fled with his children, are bracing for survival."}, {"id": "0342cd20-aacb-4d58-a0e8-42410fc048f9", "title": "ABC World - WOND", "date": "2024-05-30 19:00", "url": "https://wondradio.com/abc-world/da7a5f2ef721dd5f31f04db3d03add79", "message": "(Photo by Eyad BABA / AFP) (Photo by EYAD BABA/AFP via Getty Images)(RAFAH, GAZA) -- Sumaya Samir Al-Tot, a mother-of-one in Rafah, Gaza, said she has been displaced 17 times.\nTwo weapons experts who reviewed photos and video of fragments at the site told ABC News that the munitions used in the strike appear to have been made by a U.S. company.\nUNRWA, the U.N. agency responsible for Palestinian refugees, had effectively stopped working in Rafah, according to Salah al-Faram, who also fled Rafah with his children in tow.\n“I send a message to the whole world, to Hamas, and [Hamas leader] Sinwar to stop this war, because we are tired,” she said.\n“Children cannot sleep at night.”Copyright © 2024, ABC Audio.", "location": "GAZA", "classification": "security", "score": 0.4679545586435843, "event_breakdown": "Security forces at RAFAH, Gaza apprehended a group of armed Palestinians on Monday night. The armed men, who were traveling in a fishing boat off the coast of Rafah, are believed to have ties to Hamas, the Islamist organization that runs Gaza. The security operation was carried out in coordination with the Egyptian army."}, {"id": "d6266df4-2d16-45d1-aae3-e1523daf8c92", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 18:00", "url": "https://www.stripes.com/theaters/middle_east/2024-05-30/israel-airstrike-rafah-kills-12-gaza-14028657.html", "message": "(Mahmoud Issa/REUTERS)JERUSALEM — Israeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nGaza medical sources said the 12 Palestinians, whom it said were civilians, had been killed and an unspecified number of others wounded in an Israeli airstrike as they tried to recover the body of a civilian in the centre of Rafah.\nAnother Palestinian civilian was killed in an airstrike on Al-Shati refugee camp west of Gaza City in the north of the densely populated enclave, the medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood.", "location": "GAZA", "classification": "security", "score": 0.9626655432771122, "event_breakdown": "Israeli forces killed more than 12 Palestinians in a dawn airstrike at Rafah in southern Gaza."}, {"id": "df4b3638-d609-43dd-a013-f70c12ffa527", "title": "The Marine New Kamikaze Drone Will Take to the Skies With a Twist", "date": "2024-05-30 19:15", "url": "https://www.popularmechanics.com/military/weapons/a60898491/rogue-1-drone-marines/", "message": "This kind of drone is popularly dubbed a kamikaze, or suicide, drone.\nuVision Tube-launched Hero-30 loitering munition, with range exceeding 9 miles, 1.1-pound warhead, and 40 minutes endurance.\nMeanwhile, the Army is initially testing the larger anti-tank capable Switchblade-600 for its own organic loitering munition program called LASSO.\nBy contrast, Shepherd Media estimates the beefier Hero-120 loitering munitions being adopted by the Marines have a flyaway unit cost of $150,00, for example.\nBy contrast, Western loitering munitions are designed to be easy for soldiers to adopt with limited training thanks to automatic attack features.", "location": "USA", "classification": "security", "score": 0.9383696937779843, "event_breakdown": "Target event - Ukraine conflict\nThe Ukrainians have received another shipment of kamikaze drones, also known as loitering munitions or suicide drones, but appear to be running low on the more powerful anti-tank version.\n\nAt the beginning of the month, the Pentagon disclosed the the delivery of the Biden administration's $800 million military aid package to Ukraine, which included Switchblade-600 loitering munitions. The U.S. has also pledged an additional $500 million for military assistance.\n\nThe Ukrainians have posted several social media images of their successes using Switchblades around Kharkiv, firing them from the backs of pickup trucks. On Sunday, the Pentagon hinted at possible future use of the larger loitering munitions, by announcing a quick-reaction fund set aside by the Defense Department that allows the military to acquire large, nonstandard munitions."}, {"id": "07c1b71e-7e38-44e2-affb-7931a1f5b220", "title": "Russian Jamming Grounds US Weapons in Ukraine : Kyiv Scrambles for Solutions", "date": "2024-05-30 15:15", "url": "https://sofrep.com/news/us-weapons-grounded-ukraine/", "message": "However, according to leaked Ukrainian assessments, Russian jamming has severely hampered their effectiveness.\nRussia’s electronic warfare (EW) capabilities are significantly disrupting the guidance systems of US-supplied weapons, throwing a wrench into Ukraine’s defense strategy.\nHowever, according to leaked Ukrainian assessments, Russian jamming has severely hampered their effectiveness.\nUrgent pleas have been directed towards the Pentagon, requesting upgraded versions of these weapons that can withstand Russian jamming.\nThe coming months will be crucial in determining whether Ukraine can develop effective countermeasures to neutralize Russian jamming and regain the upper hand.", "location": "KYIV, UKRAINE", "classification": "security", "score": 0.5572223297375833, "event_breakdown": "{\n  \"reports\": [\n    {\n      \"title\": \"Russia jamming US-supplied weapons in Ukraine: reports\",\n      \"description\": \"Ukrainian assessments indicate that Russia's electronic warfare capabilities are significantly impacting defense strategy in the country.\",\n      \"date\": \"May 15, 2023\",\n      \"source\": \"The Kyiv Independent\",\n      \"targets\": [\n        {\n          \"name\": \"Russia\",\n          \"description\": \"Russia is accused of utilizing electronic jamming to disrupt US-supplied weapons in Ukraine.\",\n          \"link\": \"https://www.kyivindependent.com/ukraine-russia-war/russia-accused-of-jamming-ukraine\"\n        },\n        {\n          \"name\": \"Ukraine\",\n          \"description\": \"The country suffering from Russian jamming\",\n          \"link\": \"https://www.kyivindependent.com/2022/05/15/russia-jamming-ukraine\"\n        },\n        {\n          \"name\": \"The Pentagon\",\n          \"description\": \"Target addressed in the plea for updated"}, {"id": "49341c6b-28ce-4909-bfdc-80162d81bc64", "title": "North Korea Trash Rains Down onto South Korea , Balloon by Balloon . Here What it Means", "date": "2024-05-30 17:15", "url": "https://www.newsmax.com/world/globaltalk/trash-north-korea-south-balloons-tensions/2024/05/30/id/1166812/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "South Korea", "classification": "security", "score": 0.6223119081642159, "event_breakdown": "North Korea has sent around 260 balloons containing flyers and trash to South Korea, which were confirmed on Wednesday by North Korean leader Kim Jong Un's powerful sister. The campaign is intended as a protest against the South Korean government's hardline policy."}, {"id": "2ece473a-3c85-4c22-9074-e0ac80a2c975", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 16:15", "url": "https://www.clickondetroit.com/news/world/2024/05/30/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nRecommended VideosExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "North Korea", "classification": "security", "score": 0.6153232153254473, "event_breakdown": "North Korea confirmed Wednesday that they sent balloons to South Korea."}, {"id": "4f195732-8e17-495c-852a-70e5e79e9e16", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 16:30", "url": "https://www.news4jax.com/news/world/2024/05/30/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nRecommended VideosExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "Seoul, South Korea", "classification": "security", "score": 0.6153232153254473, "event_breakdown": "North Korea sent hundreds of balloons attached to trash sacks southwards towards South Korea on Wednesday, according to a statement from Kim Jong Un's powerful sister, Kim Yo Jong, aimed at marking the first anniversary of her brother's election."}, {"id": "b9177b43-586f-4100-8ab9-4593666a510b", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 18:30", "url": "https://abc6onyourside.com/news/nation-world/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means-kim-jong-un-manure-cigarette-butts-scraps-of-cloth-trash-tied-to-the-balloons", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "South Korea", "classification": "security", "score": 0.5876228489643636, "event_breakdown": "North Korea has sent 260 balloons across South Korea, confirmed by a powerful sibling of Kim Jong Un. her motive for the campaign is up for speculation."}, {"id": "4271e142-4794-4bb3-b8b8-8416eef18cf4", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 16:15", "url": "https://www.wsls.com/news/world/2024/05/30/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nRecommended VideosExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "South Korea", "classification": "security", "score": 0.6153232153254473, "event_breakdown": "Location: South Korea\nEvent: North Korean balloons flown across the border have caused a stir in the media. These balloons are believed to be part of a campaign from Kim Jong Un's powerful sister to stoke division within South Korea and create tension with North Korea's government."}, {"id": "0d55cafc-182f-4ad2-848b-f789e96f016c", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 18:00", "url": "https://turnto10.com/news/nation-world/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means-kim-jong-un-manure-cigarette-butts-scraps-of-cloth-trash-tied-to-the-balloons", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "North Korea", "classification": "security", "score": 0.5876228489643636, "event_breakdown": "Balloons sent from North Korea found in multiple locations across South Korea.\nThe powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks with messages critical of South Korea's president."}, {"id": "e3ca9777-dde9-4443-b811-5bf3f66bd461", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 18:00", "url": "https://wsbt.com/news/nation-world/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means-kim-jong-un-manure-cigarette-butts-scraps-of-cloth-trash-tied-to-the-balloons", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "North Korea", "classification": "security", "score": 0.5876228489643636, "event_breakdown": "North Korean Balloons Confirmed - North Korea has infuriated South Korea by flying balloons filled with trash across the border. \nNorth Korean Regime - The leader's sister confirmed it was the North Korean regime behind the trash-ridden balloons. \nNorth Korean Defectors - Outside experts often turn to North Korean defectors for sources and information."}, {"id": "5803b15c-0a5d-4047-907a-4ee661e4c00e", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 18:00", "url": "https://news3lv.com/news/nation-world/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means-kim-jong-un-manure-cigarette-butts-scraps-of-cloth-trash-tied-to-the-balloons", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "North Korea", "classification": "security", "score": 0.5876228489643636, "event_breakdown": "Balloons sent from North Korea carrying anti-government propaganda have been found across South Korea."}, {"id": "3c3f747e-edc8-42e1-84aa-540b278fe5f8", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 17:45", "url": "https://fox11online.com/news/nation-world/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means-kim-jong-un-manure-cigarette-butts-scraps-of-cloth-trash-tied-to-the-balloons", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "Seoul, South Korea", "classification": "security", "score": 0.5876228489643636, "event_breakdown": "North Korea has admitted sending helium balloons and attached trash sacks over South Korea. That's according to an unnamed South Korean government official in Seoul, who spoke on the condition of anonymity to provide the information.\nThe helium balloons were spotted in the night sky over Seoul on Tuesday. A search party sent out by South Korean soldiers found paper and other tokens attached, but no explosives or other suspicious items.\nThe North Korean government has long threatened to send balloons filled with dangerous items over the border with the aim of burning down bridges and cutting off passage between South and North Korea."}, {"id": "d624215a-9e7a-4b34-b12a-b350f6689aa3", "title": "North Korea trash rains down onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-30 18:00", "url": "https://www.durangoherald.com/articles/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.", "location": "South Korea", "classification": "security", "score": 0.6223119081642159, "event_breakdown": "North Korea is flying paper hot air balloons from its territory into South Korea. Hundreds of contraptions like these have been flown into the south in the last two days.\nThese balloons are supposed to make civilians question the way South Korea is handling its relationship with the north, including its conservative government's hardline policies.\nThe aggressive actions are thought to make civilians speak out against the government's actions."}, {"id": "4c588aa6-58fd-4326-a9cd-75f7edf9b3d9", "title": "A Lesson on Dissent from Vietnam War Protester Who Joined US Military -- And Faced Execution", "date": "2024-05-30 16:00", "url": "https://www.military.com/daily-news/2024/05/30/lesson-dissent-vietnam-war-protester-who-joined-us-military-and-faced-execution.html", "message": "All of these competing factors came to a boil one day when I was listening to a professor rant and rave against the Vietnam War.\nHe joined the Green Berets, the Army’s elite special forces, and I went into the Army Security Agency.\nSecrets and truthsThe Army Security Agency was a top secret unit within the Army.\nThe school was the nation’s first to have a Black studies department.\nAs a professor of critical race studies, I welcome the chance to fight once again.", "location": "Oakland", "classification": "security", "score": 0.8798742499193638, "event_breakdown": "A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nThe event that can be placed on a map is:\nA professor of critical race studies is fighting once again."}, {"id": "8d2a9951-faf1-4029-aa35-56d42c9f36a3", "title": "Donetsk Oblast Novooleksandrivka suffers most combat actions so far on 30 May – General Staff", "date": "2024-05-30 16:30", "url": "https://www.yahoo.com/news/donetsk-oblasts-novooleksandrivka-suffers-most-133011956.html", "message": "Since the beginning of the day the number of combat clashes in the combat zone has risen to 49.\nThe fighting is also ongoing near the settlements of Yevhenivka and Umanske.\nDetails: The General Staff reports that two combat clashes have occurred on the Kharkiv front.\nUkrainian troops are repelling Russian attacks and keeping the situation under control, the General Staff says.\nOn the Kramatorsk front, the number of combat clashes has increased to six.", "location": "The main focus of the event is the Ukrainian combat zone.", "classification": "security", "score": 0.831059628979393, "event_breakdown": "Security Event 1: 49 Combat Clashes reported on in Kharkiv, Ukraine.\nSecurity Event 2: Russian Attacks Repelled in Kharkiv, Ukraine.\nSecurity Event 3: Ukrainian Troops Repel Russian Attacks and keep the situation under control in Kharkiv, Ukraine.\nSecurity Event 4: Two combat clashes on the Kharkiv front, Ukraine.\nSecurity Event 5: Fighting ongoing near Yevhenivka and Umanske.\nSecurity Event 6: Combat clashes increased on the Kramatorsk front."}, {"id": "d06fc3d0-d186-4b99-9fc8-0dd5c1b61168", "title": "War on Gaza : Israeli jets kill two paramedics in Rafah after  deliberately  bombing ambulance", "date": "2024-05-30 15:00", "url": "https://www.middleeasteye.net/news/war-gaza-israeli-jets-kill-two-paramedics-rafah-after-deliberately-bombing-ambulance", "message": "Israeli forces bombed an ambulance in Rafah, killing two Palestinian paramedics on a rescue mission, according to the Palestine Red Crescent Society (PRCS).\n“The Israeli occupation forces deliberately bombed the ambulance vehicle despite it bearing the internationally protected Red Crescent emblem,” PRCS said on social media platform X.\nTubasi and Hassouna were killed in western Rafah, an area not previously marked by Israeli forces as part of combat zones in the southern city.\nIsraeli air strikes on Sunday at a displacement camp in northwestern Rafah killed 45 Palestinians, prompting international outrage.\nTwo days later, Israeli forces struck a group of tents in a humanitarian zone in western Rafah again, killing at least 21 people.", "location": "RAFAH.", "classification": "security", "score": 0.983856203694526, "event_breakdown": "Israeli forces bombed an ambulance in Rafah, killing two Palestinian paramedics, according to the Palestine Red Crescent Society (PRCS). The incident occurred on Monday, August 19, 2019. Israeli forces targeted a group of tents in a humanitarian zone in western Rafah on Wednesday, August 21, 2019, killing 21 people."}, {"id": "d58d22dd-e15d-4bc5-b7b3-6715d6ce043a", "title": "Israeli airstrike on Rafah kills 12 Palestinians , Gaza medics say", "date": "2024-05-30 16:30", "url": "https://tribune.com.pk/story/2469029/israeli-airstrike-on-rafah-kills-12-palestinians-gaza-medics-say", "message": "Palestinians inspect the damages after Israeli forces raid in Jabalia refugee camp in the northern Gaza Strip, May 30, 2024.\nPHOTO: REUTERSIsraeli forces killed at least 12 Palestinians in a dawn airstrike on Rafah in southern Gaza on Thursday and fighting raged in several other areas of the coastal enclave, Gaza medics said.\nIsraeli forces say they are trying to root out Hamas fighters and rescue hostages being held there, and the ICJ also called for the release of hostages held in Gaza by Hamas.\nPalestinians check damage in the central vegetable market after an Israeli raid in Ramallah in the Israeli-occupied West Bank May 30,2024.\nThe Gaza war has also stoked violence in the Israeli-occupied West Bank, another territory where Palestinians seek statehood.", "location": "GAZA", "classification": "security", "score": 0.9774062190941204, "event_breakdown": "1. Israelis and Palestinians have been fighting since Monday, with the most intense Israeli air strikes on the Gaza Strip since a 2014 war, and local media reports say Israel is considering evacuating its diplomatic missions in Jordan and Egypt.\nPalestinians inspect damage in the central vegetable market after an Israeli raid in Ramallah in the Israeli-occupied West Bank, May 30, 2024.\nPalestinians inspect the damages after Israeli forces raid in Jabalia refugee camp in the northern Gaza Strip, May 30, 2024.\nsource:\nhttps://www.arabnews.com/node/2022681"}]