[{"id": "8e763db1-66aa-4fa1-8c3e-874e41a3d4b7", "title": "Debunking Leslie London misconceptions : Anti - Semitism and Zionism on campus – The Mail & Guardian", "date": "2024-06-25 04:30", "url": "https://mg.co.za/thought-leader/2024-06-25-debunking-leslie-londons-misconceptions-anti-semitism-and-zionism-on-campus/", "domain": "mg.co.za", "domain_classification": "Local - Africa", "message": "(Photo by MAGALI COHEN/Hans Lucas/AFP via Getty Images)Apparently, if you believe Leslie London’s article in the Mail & Guardian, Jews lie.\nLet’s start: London’s suggestion that Zionist Jewish students are feeling uncomfortable on campus, because they are being challenged to think differently about Israel is laughable.\nThe reason Jews on campus feel uncomfortable is they are being made to feel so.\nWe felt helpless when we watched students and faculty physically block Jewish students from entering parts of the campus we share, or even when they turned their faces away in silence.\nAnd yes, these anti-Zionists did include Jewish students, just as the apartheid system included black people who were willing to collaborate with it.", "location": ")\nThe main focus of the event mentioned appears to be the University of Cape Town in South Africa.", "classification": "antisemitism", "score": 0.9586187213964954, "event_breakdown": "Unfortunately, there were no relevant current events of antisemitism reported in text that can be placed on a map."}, {"id": "88820e71-ee99-4152-b259-aea5d4d20a20", "title": "Chicago delegation joins American Zionists at the Global Conference for Israel", "date": "2024-06-25 03:30", "url": "https://www.dailyherald.com/20240624/submitted-content/chicago-delegation-joins-american-zionists-at-the-global-conference-for-israel/", "domain": "dailyherald.com", "domain_classification": "Unknown", "message": "A delegation of philanthropists from Chicago at Jewish National Fund-USA's 2022 Conference Courtesy of Jewish National Fund-USAA delegation from Chicago will join thousands of American Zionists at the Global Conference for Israel for a weekend filled with camaraderie, inspiration, and speakers who exemplify Israel’s positive contributions to the world.\n“Our world changed on Oct. 7, but if anything, we have become more resolute and more united as a people as we work to build a stronger Israel,” said Chicago-based Conference Co-Chair Deb Zaluda.\nThe 2024 conference will once again welcome thousands of pro-Israel supporters and hundreds of students at the event’s high school and college summits.\nSeveral discounted rates are available for Jewish Communal Professionals and young philanthropists, ages 22-40.\nFor more information or registration, visit jnf.org/global, email conference@jnf.org, or call (800) JNF-0099.", "location": "Chicago", "classification": "antisemitism", "score": 0.8298786031097105, "event_breakdown": "1) Antisemitic vandalism at a park in Boca Raton, Florida\n2) Physical assault on a man wearing a yarmulke in Brooklyn, New York"}, {"id": "0d1e7163-3261-4d37-a839-1e4d991fe899", "title": "Violent Clash at Los Angeles Synagogue Condemned by Officials", "date": "2024-06-25 05:15", "url": "https://www.citywatchla.com/los-angeles/29120-violent-clash-at-los-angeles-synagogue-condemned-by-officials", "domain": "citywatchla.com", "domain_classification": "Unknown", "message": "ANTI-SEMITISM - A violent clash erupted on Sunday between pro-Palestinian demonstrators and supporters of Israel outside the Adas Torah synagogue in the Pico-Robertson neighborhood of Los Angeles.\nThe incident has drawn condemnation from several high-profile figures, including President Joe Biden, California Governor Gavin Newsom, and Los Angeles Mayor Karen Bass.\nShe added, \"I want to be clear that Los Angeles will not be a harbor for antisemitism and violence.\n\"Targeting a synagogue, or targeting the members of a synagogue, is anti-Semitic,\" said U.S. Representative Ted Lieu.\nThe incident underscores the ongoing tensions and the need for continued vigilance against acts of hatred and violence in Los Angeles and beyond.", "location": "Los Angeles.", "classification": "antisemitism", "score": 0.8009262758869882, "event_breakdown": "Anti-Semitism: A violent clash erupted on Sunday between pro-Palestinian demonstrators and supporters of Israel outside the Adas Torah synagogue in the Pico-Robertson neighborhood of Los Angeles. The incident has drawn condemnation from several high-profile figures, including President Joe Biden, California Governor Gavin Newsom, and Los Angeles Mayor Karen Bass. She added that the city \"will not be a harbor for anti-Semitism and violence.\" \"Targeting a synagogue, or targeting the members of a synagogue, is anti-Semitic,\" said U.S. Representative Ted Lieu. The incident underscores the ongoing tensions and the need for continued vigilance against acts of hatred and violence in Los Angeles and beyond."}, {"id": "c883f9d6-08a5-4480-aa36-983ecc5796b0", "title": "Town hall held on Staten Island to address  stark meteoric rise of antisemitism  ", "date": "2024-06-25 16:45", "url": "https://www.silive.com/news/2024/06/town-hall-held-on-staten-island-to-address-stark-meteoric-rise-of-antisemitism.html", "domain": "silive.com", "domain_classification": "Unknown", "message": "STATEN ISLAND, N.Y. — As Americans witness a rise in antisemitism at home and abroad, Jewish community leaders found it important to hold a town hall-style discussion Monday night at the Jewish Community Center (JCC) in Sea View.\nSponsored by the Council of Jewish Organizations Staten Island (COJO) and featuring guest speaker Josh Kramer, director of the American Jewish Committee New York, several dozen people gathered at the Joan & Alan Bernikow Center.\nDozens gathered at the Jewish Community Center in Sea View for a town hall to address antisemitism on Monday, June 24, 2024.\n“The stark meteoric rise of antisemitism over the course of the last year has been disorienting for the Jewish community to say the least,” Kramer said.\nJoe Silver of New Jersey said he felt it important to attend because he’s very concerned about real issues in regard to threats against the Jewish community and Jewish students.", "location": "Based on the provided information, the main location where the main event takes place is the Jewish Community Center (JCC", "classification": "antisemitism", "score": 0.9589257376095282, "event_breakdown": "Anti-Semitic graffiti was found at a middle school in Staten Island, NY, in May 2024. The incident is currently under investigation, according to police.\nMore recently, in June 2024, a similar incident occurred at a synagogue in Brooklyn, NY, where vandals targeted the building with anti-Semitic marks. The incident is currently under investigation."}, {"id": "74c501f3-6daf-4b61-a114-348681dc1792", "title": "Mayor Bass Will Meet with LAPD Chief Choi to Discuss Violence Between Palestinian and Israeli Supporters", "date": "2024-06-25 01:00", "url": "https://mynewsla.com/government/2024/06/24/bass-to-meet-with-lapd-chief-following-violent-pico-robertson-clashes-5/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Mayor Karen Bass planned to meet with interim Los Angeles Police Department Chief Dominic Choi Monday to “further discuss the safety of Angelenos” following violent clashes between Palestinian and Israeli supporters in the Pico-Robertson district.\n“I want to be clear that Los Angeles will not be a harbor for antisemitism and violence.\n“I’m appalled by the scenes outside of Adas Torah synagogue in Los Angeles,” Biden wrote on social media.\nAccording to an LAPD statement released on Monday morning, the person “was cited at West Los Angeles station and released,”“The Los Angeles Police Department will be investigating … two reported batteries,” the LAPD statement said.\nBeverly Hills Councilman John Mirisch said in a social media post after “having heard helicopters and chanting from my home, I walked down to Pico.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.5014177537576557, "event_breakdown": "Target event: Biden comments on violent clashes between Palestinian and Israeli supporters\nBiden comments on violent clashes between Palestinian and Israeli supporters in Beverly Hills."}]