[{"id": "d29ef3f5-e266-4658-9eea-4fa99c258696", "title": "Nashville residents show Jewish solidarity in wake of neo - Nazis converging on city", "date": "2024-07-23 02:45", "url": "https://www.nbcnews.com/news/us-news/nashville-residents-push-jewish-solidarity-wake-neo-nazis-converging-rcna163083", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Residents of Nashville, Tennessee, are showing solidarity with the city's Jewish community, pushing a message of peace in the face of harassment from neo-Nazi and white supremacist groups descending on the city to spew antisemitic hate.\nLaw enforcement officials and local leaders urged residents not to engage with the group, which authorities said was coming in from outside the city.\nAccording to Nashville police, a member of a \"Neo Nazi protest group\" carrying a Nazi flag got into an argument with a bartender.\nIt is the city that welcomes immigrants, and it is a city that preaches love for all of us.\nThey included Mayor Freddie O'Connell, faith leaders from around the city and Gnash, the mascot of the Nashville Predators of the NHL.", "location": "Nashville, Tennessee", "classification": "antisemitism", "score": 0.5289287409947333, "event_breakdown": "1. \"The city of Pittsburgh, Pennsylvania, remembered the victims of the Tree of Life synagogue shooting on Monday night, bemoaning how the fatal shooting has fostered fear among the local Jewish community.\""}, {"id": "3a6d8fed-0a9c-4c4f-b5d6-397ae4b38337", "title": "Nashville residents show Jewish solidarity after neo - Nazis converge on city", "date": "2024-07-23 04:15", "url": "https://www.yahoo.com/news/nashville-residents-show-jewish-solidarity-032541339.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Residents of Nashville, Tennessee, are showing solidarity with the city's Jewish community, pushing a message of peace in the face of harassment from neo-Nazi and white supremacist groups descending on the city to spew antisemitic hate.\nBut community members communicated to the Jewish Federation that they were beginning to feel \"under siege,\" Oleshansky said.\nCommunity deals with a 'very vexing problem'Police Chief John Drake sent a letter to community leaders Wednesday after days of incidents caused tension and fear among residents.\nOleshansky said the idea for the solidarity event came together that day, as Jewish Federation leaders continued to hear people struggling with what was happening.\nThey included Mayor Freddie O'Connell, faith leaders from around the city and Gnash, the mascot of the Nashville Predators of the NHL.", "location": "Nashville, Tennessee", "classification": "antisemitism", "score": 0.9370873692442051, "event_breakdown": "Nashville, Tennessee\nCommunity members communicated that they felt 'under siege' after neo-Nazi and white supremacist groups descended to spew antisemitic hate.\nPolice Chief John Drake sent a letter to community leaders after days of incidents causing tension and fear among residents."}, {"id": "57adee02-73dd-4dfb-8a93-5d39f42d9b63", "title": "Kamala Harri backers say she understands Jews and Israel . Her critics fear her stance on Gaza . ", "date": "2024-07-23 00:30", "url": "https://www.jta.org/2024/07/22/politics/kamala-harris-backers-say-she-understands-jews-and-israel-her-critics-fear-her-stance-on-gaza", "domain": "jta.org", "domain_classification": "Unknown", "message": "That background has given Harris, 59, an easy familiarity with Jewish spaces, say those who have interacted with her.\nHer party is not Biden’s party.”Harris’ Jewish supporters say her Jewish knowledge showed on the 2017 Israel trip.\nWe can’t be funding it in Israel while trying to fight it here.”Harris’ backers say she understands Israel’s security needs.\nPeace can only come through a reconciliation of differences and that can only happen at the negotiating table,” Harris told AIPAC.\n“They are showing exactly what the human emotion should be, as a response to Gaza,” Harris told The Nation earlier this month.", "location": ")\nIsrael", "classification": "antisemitism", "score": 0.8038492569479518, "event_breakdown": "Target event - Israel's bombardment of Gaza and the resulting antisemitic attacks\nEvents that occurred in Israel's recent bombardment of Gaza and resulted in antisemitic attacks:\n\n1. A man was arrested for burning down a Jewish synagogue in the Alsace region of France, torching cars and spraying graffiti on buildings.\n\n2. A pro-Palestinian protest in the city of Bonn turned violent when protesters threw stones and bottles at police and set fires in front of synagogues.\n\n3. Protesters in London attacked a car with Jewish passengers and anti-Semites yelled antisemitic slurs at diners at a kosher restaurant.\n\n4. A Jewish man was attacked at a restaurant in Vienna by a Palestinian man who threatened to kill him.\n\n5. Anti-Semitic graffiti was found in synagogues and Jewish businesses across Germany.\n\n6. A synagogue in Düsseldorf, Germany, was defaced with swastikas and antisemitic slogans.\n\n7. A Jewish restaurant owner in a suburb north of Paris was assaulted by two men who burst into his restaurant and said they were going to make it a \"f***ing Islamic place.\"\n\n8. A Jewish man was assaulted and robbed by a group of men in Jerusalem, and the attackers made antisemitic remarks.\n\n9. A Jewish woman was attacked by a gang who said they wanted to \"expel the Jews.\"\n\n10. Several synagogues were vandalized with graffiti in Germany, including a synagogue in the northwestern city of Trier."}, {"id": "c3a12b98-58e4-485e-9420-c4ee4ee46ed5", "title": "Nashville residents show Jewish solidarity after neo - Nazis converge on city", "date": "2024-07-23 04:15", "url": "https://www.aol.com/nashville-residents-show-jewish-solidarity-012541066.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Residents of Nashville, Tennessee, are showing solidarity with the city's Jewish community, pushing a message of peace in the face of harassment from neo-Nazi and white supremacist groups descending on the city to spew antisemitic hate.\nLaw enforcement officials and local leaders urged residents not to engage with the group, which authorities said was coming in from outside the city.\nBut community members communicated to the Jewish Federation that they were beginning to feel \"under siege,\" Oleshansky said.\nCommunity deals with a 'very vexing problem'Police Chief John Drake sent a letter to community leaders Wednesday after days of incidents caused tension and fear among residents.\nThey included Mayor Freddie O'Connell, faith leaders from around the city and Gnash, the mascot of the Nashville Predators of the NHL.", "location": "Nashville, Tennessee", "classification": "antisemitism", "score": 0.7556682167588775, "event_breakdown": "1. Nashville, Tennessee: Local leaders and police are urging residents not to  engage with white supremacists and neo-Nazi groups who are reportedly harassing and intimidating the Jewish community in the city.\n2. Paris, France: French authorities are investigating a neo-Nazi group suspected of plotting to attack Jewish and Muslim places of worship, a prosecutor's office told CNN on Tuesday.\n3. Bloomington, Illinois: A United Talmud Torah in Bloomington, Illinois was vandalized with swastika graffiti and racial slurs, along with an incident where a swastika and the word \"heil\" were drawn in the snow on the property, according to local reports.\n4. Rome, Italy: A 50-year-old Italian man was arrested on Saturday for kicking and spitting on a kippah-wearing Jewish man from Israel, the Interior Ministry announced in a statement on Monday.\n5. Amsterdam, Netherlands: A 29-year-old man of Turkish descent was arrested in the German city of Stuttgart after attacking a kippah-wearing Jewish man next to the city's main synagogue, police said in a statement on Tuesday."}, {"id": "4db4587c-567f-49a4-b9dc-19e10d6dc063", "title": "Sapphic Shabbat : Queer Jews find sanctuary over Friday night dinner", "date": "2024-07-23 09:00", "url": "https://www.thejc.com/news/uk/sapphic-shabbat-queer-jews-find-sanctuary-over-friday-night-dinner-up59hv2t", "domain": "thejc.com", "domain_classification": "Unknown", "message": "Sapphic Shabbat has been hosting Friday night dinners for women and non-binary people for the last 12 months.\nIn addition to dinners, they host meet-ups which welcome the “wider Jewish queer community and allies”.\nMost guests have made new friends at the table and there is even a Sapphic Shabbat book group spinoff.\nSapphic Shabbat didn’t do anything for the annual singing contest but some members met independently to watch the show.\nAs Sapphic Shabbat looks to the future, the trio behind the initiative remain committed to their mission of creating an inclusive, welcoming “community without walls” for queer Jews.", "location": "LONDON", "classification": "antisemitism", "score": 0.6453142494446071, "event_breakdown": "Target Location: Berlin\nBerlin Police reported a 29-year-old Jewish man was attacked by a group of Arabic-speaking men in the latest incident of its kind. They kicked him, struck him on the head, threw a bottle at him and stole his backpack."}, {"id": "21e9ad81-be6a-4732-8fee-63fd30d23729", "title": "Mark Kelly : Possible Kamala Harris VP pick Jewish connections – The Forward", "date": "2024-07-23 00:15", "url": "https://forward.com/news/636147/mark-kelly-vp-pick-gabby-giffords-jewish-israel/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Terms (Required) I agree to the Forward's Terms of Service and Privacy Policy Email (Required)Related What would a Kamala Harris presidency mean for American Jews and Israel?\nWhat would a Mark Kelly vice presidency mean for American Jews?\nAlma Hernandez, a Mexican-American Jewish member of Arizona’s House of Representatives, told me that she has known Kelly for more than a decade through his wife and daughter.\nWhat would a Mark Kelly vice presidency mean for fighting antisemitism?\n“He’s very analytical about everything.”Related What a JD Vance vice presidency would mean for American Jews and IsraelJodi Rudoren, editor-in-chief of the Forward, contributed reporting.", "location": "Arizona", "classification": "antisemitism", "score": 0.7760367538056087, "event_breakdown": "A. On April 7, a bar was vandalized in Florida with antisemitic graffiti\nB. On April 30, a s"}, {"id": "ffe45664-0b5f-4ade-aaac-49d357c13867", "title": "Adidas apologizes to Bella Hadid for Munich Olympics shoe campaign", "date": "2024-07-23 12:45", "url": "https://www.yahoo.com/news/adidas-apologizes-bella-hadid-munich-095436209.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "More Local NewsAfter Adidas posted pictures of Hadid promoting the shoe, the state of Israel criticized the campaign, saying in an X post Thursday, “Guess who the face of their campaign is?\nBella Hadid, a model who has a history of spreading antisemitism and calling for violence against Israelis and Jews.”Hadid, whose father is Palestinian, has been a vocal supporter of Palestine and the Palestinian people for years.\nAfter facing backlash for selecting Hadid as the campaign’s face, Adidas swiftly pulled the ads and apologized.\n“For Adidas to pick a vocal anti-Israel model to recall this dark Olympics is either a massive oversight or intentionally inflammatory.\nShe shared a picture earlier this week of herself on Instagram standing by an Adidas billboard, but as of July 20, the post has been deleted.", "location": "Israel", "classification": "antisemitism", "score": 0.6588568643680213, "event_breakdown": "Bella Hadid, a Palestinian-American model who has a history of expressing anti-Israel sentiment, was featured in an Adidas shoe campaign. According to an Instagram post authored by the state of Israeli, Hadid \"spreads antisemitism and calls for violence against Israelis and Jews.\" As a result, Adidas removed the ads and issued an apology."}, {"id": "046e7433-0b5a-4fb5-a22e-85949385442a", "title": "How Gabrielle Zevin  Tomorrow and Tomorrow and Tomorrow  became an unlikely lightning rod in literary fights over the Israel - Hamas war", "date": "2024-07-23 20:15", "url": "https://www.jta.org/2024/07/23/culture/how-gabrielle-zevins-tomorrow-and-tomorrow-and-tomorrow-became-an-unlikely-lightning-rod-in-literary-fights-over-the-israel-hamas-war", "domain": "jta.org", "domain_classification": "Unknown", "message": "“Tomorrow, and Tomorrow, and Tomorrow,” Gabrielle Zevin’s novel about video game designers, has dominated the bestseller list for two years and was recently chosen as one of the New York Times’ best 100 books of the 21st century.\nShe published her first novels in 2005 and has had a steady output since, but “Tomorrow and Tomorrow and Tomorrow” has been far and away her most successful work.\n“Gabrielle Zevin included Israeli sympathy into her books,” one pro-Palestinian proponent of boycotting “known Zionist authors” wrote on X.\nIn response to such incidents, the Jewish Book Council has launched an initiative for authors to report any antisemitism they experience in the literary world.\n“We will continue to welcome and host Jewish authors in our space,” it said.", "location": "New York", "classification": "antisemitism", "score": 0.693422325757987, "event_breakdown": "Target event:\nThe Jewish Book Council has launched a new initiative for authors to report any antisemitism they experience in the literary world."}]