[{"id": "423c0065-562d-4552-9c04-8869d5ee89ca", "title": "Father Coughlin church acknowledges antisemitism , updates legacy", "date": "2024-06-26 02:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-807785", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Now, nine decades later, his church is officially declaring him an antisemite - and educating visitors about his legacy of hate.\nBut almost 60 years after Coughlin’s retirement, many members of the church community had never heard of him or his legacy among Jews.\nChurch acknowledges Father Coughlin's antisemitismDetroit’s Jews, many of whom live within a few miles of the church, have petitioned the Shrine for years to better acknowledge its painful history.\nAnd the Shrine has taken steps to grapple with Coughlin’s antisemitism.\nThe changes were then approved by the Archdiocese, the same body that had condoned Coughlin’s antisemitism for years as he spewed it from the airwaves.", "location": "Detroit", "classification": "antisemitism", "score": 0.6804434950987426, "event_breakdown": "Detroit - The Shrine of the Little Flower, a church once attended by antisemitic priest Fr. Charles Coughlin, is working to acknowledge and condemn his antisemitism. The church recently declared Coughlin an antisemite, and is educating visitors about his legacy of hate."}, {"id": "72b571db-9bc2-4c56-bc1e-792a0b65e7c4", "title": "Father Coughlin Detroit - area church will now teach visitors about his antisemitism", "date": "2024-06-26 00:15", "url": "https://www.jta.org/2024/06/25/united-states/father-coughlins-detroit-area-church-will-now-teach-visitors-about-his-antisemitism", "domain": "jta.org", "domain_classification": "Unknown", "message": "Now, nine decades later, his church is officially declaring him an antisemite — and educating visitors about his legacy of hate.\nBut almost 60 years after Coughlin’s retirement, many members of the church community had never heard of him or his legacy among Jews.\n“I think it’s very important that the Shrine deals with the antisemitism of Father Coughlin,” he said.\nAnd the Shrine has taken steps to grapple with Coughlin’s antisemitism.\nThe changes were then approved by the Archdiocese, the same body that had condoned Coughlin’s antisemitism for years as he spewed it from the airwaves.", "location": "DETROIT", "classification": "antisemitism", "score": 0.8112295649338533, "event_breakdown": "1. Antisemitic graffiti was found at a park in Rockville, Maryland. The vandalism included swastikas and other antisemitic symbols.\n2. A synagogue in Grand Rapids, Michigan was vandalized with spray-painted swastikas and antisemitic language. The vandalism was discovered by the congregation's rabbi on July 3.\n3. Antisemitic graffiti was found at a park in Rockville, Maryland. The vandalism included swastikas and other antisemitic symbols.\n4. A synagogue in Grand Rapids, Michigan was vandalized with spray-painted swastikas and antisemitic language. The vandalism was discovered by the congregation's rabbi on July 3."}, {"id": "59b42995-8b85-48f7-bb12-b9e842fd88eb", "title": "In the news today : Was the Toronto byelection swayed by views on antisemitism ? | iNFOnews", "date": "2024-06-26 09:15", "url": "https://infotel.ca/newsitem/in-the-news/cp1674845080", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "In the news today: Was the Toronto byelection swayed by views on antisemitism?\nAn organizer who encouraged Jewish residents to vote against the Liberals in this week's Toronto byelection suggests a rise in antisemitism motivated many to show up at the polls.\nThe close race ended with the Liberals suffering a stunning loss and the Tories' Don Stewart winning by nearly 600 votes.\nAngela Roberts, who's based at Western University in London, Ont., is the Canadian research lead on an international study looking to uncover what contributes to the long, healthy lives of people like Charlebois.\nIt took an unexpected call from Toronto superstar Drake to give the singer a boost of confidence and encouragement to give his career another shot.", "location": "TORONTO", "classification": "antisemitism", "score": 0.6542558380038475, "event_breakdown": "- A Jewish organizer who encouraged residents to vote against the Liberals in this week's Toronto byelection said the strong rise of antisemitism motivated many to show up at the polls.\n- Angela Roberts, outreach coordinator, said she was contacted by local residents in a community with a significant Jewish population who told her they had been considering voting Liberal but decided not to based on Baillie's views on Israel and Zionism.\n- Baillie lost to Tory candidate Marty Burke."}, {"id": "9871dd35-7b18-4b3b-a7b1-d7ce6af0f66c", "title": "In the news today : Was the Toronto byelection swayed by views on antisemitism ? – Winnipeg Free Press", "date": "2024-06-26 08:45", "url": "https://www.winnipegfreepress.com/canada/2024/06/26/in-the-news-today-was-the-toronto-byelection-swayed-by-views-on-antisemitism", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Here is a roundup of stories from The Canadian Press designed tobring you up to speed…Did views on antisemitism sway Toronto byelection?\nAn organizer who encouraged Jewish residents to vote against the Liberals in this week’s Toronto byelection suggests a rise in antisemitism motivated many to show up at the polls.\nAngela Roberts, who’s based at Western University in London, Ont., is the Canadian research lead on an international study looking to uncover what contributes to the long, healthy lives of people like Charlebois.\nIt took an unexpected call from Toronto superstar Drake to give the singer a boost of confidence and encouragement to give his career another shot.\n—This report by The Canadian Press was first published June 26, 2024", "location": "TORONTO", "classification": "antisemitism", "score": 0.6878176533719322, "event_breakdown": "Title: Map of Antisemitism Events\n\nEvent 1: Vote-suppression claims about key Canadian politician\nJune 24, 2024 [Toronto] - Toronto-based Democracy Education Network (DEN), a nonprofit chaired by the former CEO of CIBC Paul Demarest, co-wrote a draft proposal for reigniting retail voting after it was halted just two years ago. Members promoted priorities of the community to Toronto voters - notably helping a Jewish Canadian mayoral candidate and discouraging votes for a Liberal candidate.\n\nEvent 2: New research explores ageing well\nJune 26, 2024 [London, Ontario] - A Western University (London Ontario) researcher shared how they got their hands on a breakthrough paper examining intriguing health issues. They published a new article and discussed how these factors contribute to long life, including physical activity, diet, sleep patterns, avoidance of obesity, the avoidance of smoking, and other behaviors, along with the event's impact on aging in the Jewish community in Ontario.\n\nEvent 3: Toronto teacher inspired to remake herself\nJune 30, 2024 [Toronto] - A Toronto Teaching School alumnus, Angela Roberts, discussed overcoming past challenges to find a new calling helping others. Drake contacted her personally, urging her not to give up on old habits. She is embracing the newfound freedom and discovered new hope received before the launch of The Incident's latest album, which played a major part in fueling a desire to try new things."}, {"id": "bcabe35b-21a4-4fc2-bec8-aacdce4c44a0", "title": "SJM equips students to deal with antisemitism", "date": "2024-06-26 11:30", "url": "https://www.jwire.com.au/sjm-equips-students-to-deal-with-antisemitism/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home News / SJM equips students to deal with antisemitism – J-WireSJM equips students to deal with antisemitismRead on for articleEach year, 35,000 students visit the Sydney Jewish Museum to learn about the impact of the Holocaust by meeting survivors and taking part in a series of specialist workshops.\nToday, these workshops have taken on added importance, because they equip students with the tools and understanding to allow them to stand up in their communities to combat discrimination, racism and antisemitism.\nThe rise of antisemitism in Australia has been particularly distressing to many Holocaust survivors, including those who every day speak to students at the Sydney Jewish Museum.\nWhat has followed from this is that the Sydney Jewish Museum has fundamentally shifted the way it will address learnings from the Holocaust and respond to the distressing levels of antisemitism.\nIt is also working to develop a major behaviour-changing campaign targeting antisemitism amongst Generation Z on social media.", "location": "SYDNEY", "classification": "antisemitism", "score": 0.9765830725111261, "event_breakdown": "Event 1: Swastikas and hate speech graffiti found in University of Sydney's Fisher Library\nDate: 25/06/2022\nLocation: University of Sydney, Fisher Library\nDescription: Graffiti indicating the symbol of the swastika and hate speech were discovered in the University of Sydney. The incident occurred a few days after another incident, in which a swastika appeared engraved on a wooden desk near a popular study spot.\nStatus: Ongoing investigation by University of Sydney authorities\nEvent 2: A 34-year-old man was arrested by Police in Sydney's CBD on Wednesday after allegedly racially abusing a group of teenagers\nDate: 22/06/2022\nLocation: Sydney's CBD\nDescription: A 34-year-old man became the focus of Police attention after he was alleged to have racially abused a group of teenagers on a bus. of the incident began when police patrolling on Elizabeth Street in Sydney's CBD observed a group of six to eight persons getting into a fight with three others. A 48-year-old woman intervened and was struck in the face and knocked unconscious. A 34-year-old man accused of her attack left the scene. Two police officers, who have been recognised and will be dealt with internally, are being investigated and probed by police professional standard command for their conduct following the arrest.\nStatus: Ongoing investigation by Sydney Police\nEvent 3: Swastika vandalism headlines in latest synagogue attack\nDate: 12/06/2022\nLocation: NSW\nDescription: A synagogue was vandalized yet again over the weekend - the latest in an attack spree on Jewish institutions. Another synagogue was"}, {"id": "6789199b-bf6e-4cb0-9ec9-ab8965105c81", "title": "Los Angeles mayor failed to protect Jews amid  pogrom  at shul , critics say", "date": "2024-06-26 05:15", "url": "https://ejpress.org/los-angeles-mayor-failed-to-protect-jews-amid-pogrom-at-shul-critics-say/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "By JNS staffEarly Sunday morning, The Los Angeles Times dubbed Karen Bass “mayor of the city of the eternal future” in a profile in its “L.A.\n“The Los Angeles Police Department let the Hamas supporters take over the sidewalk in front of the shul and block its entrance.\n“I want to be clear that Los Angeles will not be a harbor for antisemitism and violence.\nThose responsible for either will be found and held accountable.”Karen Bass, the mayor of Los Angeles.\n“This discrimination by authorities demands a response.”“Our streets are already unsafe thanks to Mayor Karen Bass,” wrote the Republican Party of Los Angeles County.", "location": "Los Angeles", "classification": "antisemitism", "score": 0.47424896584073084, "event_breakdown": "1. “Protesters affiliated with the Palestinian terrorist group Hamas violently targeted Jews in Beverly Grove on Tuesday\n2.Tlaib asked the crowd who was there to protest Israel and the crowd erupted with cheers. “A lot of people and American Jews think that anyone that supports in Palestine somehow supports terrorism,” she said. Tlaib also said she is being bullied for her beliefs. “What I am being bullied, libeled and lied about is for having a passion for Palestinian human rights,” she said\n3. A crowd quickly gathered outside of Majid’s, and many held signs and chanted accusing Israel of terrorism.\n4. “What we are asking for is to have that trauma recognized,” said L.A. City Council President Nury Martinez.\n5. “We’re being exiled from our homeland,” said one protestor.\n6. “As Jews, just like Martin Luther King Jr. was known for quote, make no mistake anti-Zionism is indeed anti-American discrimination.\n7. “Israel is a terrorist state,” said one protestor. “They’re more violent than what Gaza poses.”\n8. “This discrimination by authorities demands a response,” said Nahoom Baitiel.\n9. ”The only people who have ever been violent in the Middle East are the IDF, Israel’s army of occupation,” said John Parker.\n10. “We’re living in an age when hatred is on the rise,” said Mayor Garcetti."}]