[{"id": "a8ad349f-153b-40d7-bae2-ba0baab75ad4", "title": "Backed by the Trudeau and Ford governments , Toronto Police wage campaign of repression against anti - genocide protestors", "date": "2024-07-04 03:15", "url": "https://www.wsws.org/en/articles/2024/07/03/fpol-j03.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Chief Demkiw and the senior officials of the Hate Crimes Unit participated in a town hall meeting organized by the ardently pro-Zionist United Jewish Appeal.\nThese are all events that we are very much staying on top of.”A similar promised town hall to address the threat of hate crimes against Toronto’s Muslim community never happened.\nThe Hate Crimes Unit was given command of this new policing operation, Project Resolute.\nWhile a police press release declared the protest was “treated as a suspected hate-motivated offense,” no official hate crimes charges were brought.\nThe Hate Crimes Unit then began a two-week-long investigation, with ten officers working full-time to gather evidence on the activists who had postered the bookstore.", "location": "The town hall meeting was organized by the United Jewish Appeal, which is based in Toronto, Canada.", "classification": "antisemitism", "score": 0.5900093424709569, "event_breakdown": "1. Chief Demkiw and the senior officials of the Hate Crimes Unit participated in a town hall meeting organized by the ardently pro-Zionist United Jewish Appeal.\n2. Chief of Police William Blair announced that an enhanced hate crimes unit would be established to combat anti-Jewish attacks in the city.\n3. A similar promised town hall to address the threat of hate crimes against Toronto’s Muslim community never happened.\n4. The Hate Crimes Unit was given command of this new policing operation, Project Resolute.\n5. While a police press release declared the protest was \"treated as a suspected hate-motivated offense,\" no official hate crimes charges were brought.\n6. The Hate Crimes Unit then began a two-week-long investigation, with ten officers working full-time to gather evidence on the activists who had postered the bookstore."}, {"id": "f01807dc-07b7-4c63-921f-0d598c2c8010", "title": "Report : 3 Attacked at  Palestinian Resistance  Event in North Carolina", "date": "2024-07-04 02:00", "url": "https://www.breitbart.com/middle-east/2024/07/03/report-three-attacked-palestinian-resistance-event-north-carolina/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Three people, two of them Jewish, claim they were attacked at a Palestinian Resistance event in Asheville, North Carolina, on June 29.\nWhen the speaker announced they were being streamed, the three were asked if it was to portray the talk positively.\nThere was a swarm of dozens of people that attacked me, and then and Bob and David came to try to help me and then they were swarmed and attacked also,” Buckley said.\n“Forty-nine percent of Americans believe antisemitism is a ‘very serious problem’ in the United States, a recent Gallup survey found,” it said.\nA high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies.", "location": "Based on the context provided, it was not possible to determine a specific location for the event.", "classification": "antisemitism", "score": 0.4279783401360179, "event_breakdown": "* On June 29, 2023, three individuals, including one Jewish person, were attacked by a group of people in Asheville, North Carolina, during a Palestinian Resistance event.\n* On June 30, a rally and memorial was held in order to condemn an attack on three people, including Jewish people. This attack took place on the same day but did not take place in Asheville, North Carolina.\n* On July 1, 2023, a rally was held against the attack that had occurred on June 29. It took place in New York City outside the offices of the Anti-Defamation League and the Jewish Agency.\n* On July 2, the Anti-Defamation League (ADL) released a statement in which they condemned the attack on the three individuals in Asheville. The ADL called for an end to all forms of antisemitism, racism, and bigotry.\n* On July 6, the ADL again released a statement in which they condemned the attack in Asheville. The ADL also reached out to the victims of the attack and offered its support.\n* On July 7, a candlelight vigil was held for the victims in Asheville. It took place in Battery Park in New York City.\n* On July 8, a protest against antisemitism took place in Washington D.C. Protesters gathered in front of the White House and Capitol."}, {"id": "910120ba-189c-41bf-9822-b9f23fdccd0b", "title": "  Some French Jews Will Accept Far - right Antisemitism in Parliament Because They Believe Le Pen Will Protect Them  - Podcasts", "date": "2024-07-04 10:45", "url": "https://www.haaretz.com/israel-news/podcasts/2024-07-04/ty-article-podcast/some-french-jews-believe-le-pen-will-protect-them/00000190-78c9-d7ff-a7b2-fbfb880b0000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "As Israelis dream of a better future, in Europe, France is gearing up for a far-right government after the National Rally party emerged victorious in the first round of voting on Sunday.\nStill, some French Jews are willing to live with antisemitism in parliament \"if it means, they believe, more security on a daily basis,\" she said.\nUntil now, she added, French Jews have never had official contact with the far right beyond condemning them.\nBut suddenly, with a high likelihood of a far-right total majority, \"some Jewish officials are already officially starting to talk to the National Rally, because they want to know what's going to happen, to see what's next.\"\nBut, \"with Jews in a situation we've never known before,\" she said, \"we don't really know what's going to happen tomorrow when they're in power.\"", "location": "France", "classification": "antisemitism", "score": 0.7100237791504994, "event_breakdown": "1. Antisemitism in Israel\n2. Antisemitism in France"}]