[{"id": "d6af9e74-a751-48b4-bac1-00ca958fd10d", "title": "EU conference vows to combat rising antisemitism - The Jerusalem Post", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-801522", "message": "(credit: Vatican Media/­Handout via REUTERS)After launching the conference on May 6, Bergé repeated her government's commitments to fight \"the scourge of antisemitism everywhere.\"\nI think Britain is trying to fight antisemitism very hard and we are implementing programs from other countries.\n\"Organizations are working together to create an effective reporting system that others can learn from that will create a more effective way to fight antisemitism.\nAs a former EU security chief, I can say that I think antisemitism is a threat to European security.\"\nI think we should also look into combating and providing intelligence on hate crimes such as antisemitism so that countries can fight the phenomenon.", "location": ".\nFrance", "classification": "antisemitism", "score": 0.7322616558236936, "event_breakdown": ".\nList of antisemitism events:\n- Bergé repeated her government's commitments to fight \"the scourge of antisemitism\"\n- Bergé launched the conference \"Fighting Antisemitism Throughout Europe\""}, {"id": "a25a40d3-4b5d-4f88-bfbc-15f4e2862ec4", "title": "Holocaust education in Iowa schools should paint the full picture", "date": "2024-05-17 00:15", "url": "https://www.bleedingheartland.com/2024/05/16/holocaust-education-in-iowa-schools-should-paint-the-full-picture/", "message": "Governor Kim Reynolds came to Beit Shalom, the home of the Quad Cities Jewish community, on May 15 to sign House File 2545, a bill containing controversial new social studies curriculum requirements.\nBecause the bill requires Iowa schools to teach Holocaust education, following the model of Illinois, which has required it for several years.\nThough members of the Quad Cities Jewish community are divided about the policies of the governor and the Republican-controlled legislature, we do stand united on the issue of Holocaust education in our schools.\nFor most of the members of the Jewish community, Holocaust education is not only important as a reminder of the horrors of the past and as a memorial to the martyrs of the Holocaust, but also as a much needed safeguard for the future.\nIt is our deepest hope that when our Iowa schools teach about the Holocaust, they will paint a full picture of that dreadful chapter in world history.", "location": "BEIT SHALOM", "classification": "antisemitism", "score": 0.9392632209847793, "event_breakdown": "1. Republican governor Kim Reynolds came to the community Beit Shalom in Quad Cities on May 15th to sign House File 2545, a bill that contains new social studies curriculum requirements.\n2. Since the bill requires schools in Iowa to teach Holocaust education, following the model of Illinois, which has required it for several years, members of the Quad Cities community as many are divided about the policies of the governor and the Republican-controlled legislature do stand united on the mandatory Holocaust education in local schools.\n3. Holocaust education is not only important as a reminder of the horrors of the past and as a memorial to the martyrs of the Holocaust but also as a much needed safeguard for the future yet Nazi events like helping sad Jews sanctuary to Cuba, Nueva Orleans and Veracruz bypassed and aren’t being taught but ignored and not censored by Low, the governor.\n4. When the local schools in Iowa teach about the Holocaust, they will paint a full picture of that dreadful chapter of world history."}, {"id": "e5795d55-def0-4480-833e-14cc122ec26b", "title": "Four pro - Palestine students , one pro - Israel protest in Kalama", "date": "2024-05-17 03:15", "url": "https://tdn.com/news/local/education/four-pro-palestine-students-one-pro-israel-protest-in-kalama/article_ac30e3e6-6882-11ee-aeaa-17623ab536e9.html", "message": "Four students from Kalama High School participated in a walk out protest near the end of the school day Wednesday in support of Palestine.\nThe brief protest was planned to be pro-Palestine, but one student also attended to support Israel and the U.S., and two Kalama residents unaffiliated with the school brought their children to hold American and Israeli flags after seeing the demonstrators.\nThe students gathered a few minutes outside of school property at an intersection on Elm Street, where they displayed signs urging for a ceasefire.\nSenior Diego Luna joined the protest to support Israel and the U.S., and said he wanted to show his pride in America and make sure people were aware of deaths happening on both sides.\nHe displayed American and Israeli flags and held a sign given to him by the other students that read \"this is not antisemitism.\"", "location": "Kalama High School", "classification": "antisemitism", "score": 0.6846611350797867, "event_breakdown": ".\n* Pro-Palestine students protested in KHS's school grounds.\n* Diego Luna protested for Israel and the U.S.\n* Two Kalama residents held American and Israeli flags.\n* People showed signs urging for a ceasefire."}, {"id": "ac861d0a-d253-4db9-9919-c483ee788fde", "title": "The Graduation Issue 2024 : 2023 - 24 Year in Review", "date": "2024-05-17 04:45", "url": "https://www.thedp.com/article/2024/05/penn-graduation-issue-2024-years-23-24", "message": "Concerns about antisemitism on campus — and the University’s response — intensified after Hamas’ Oct. 7 attack on Israel.\nDozens of major donors pulled their funding in protest of University leadership, including Wharton Board of Advisors Chair Marc Rowan, 1987 College graduate Jon Huntsman Jr., and 1965 Wharton graduate Ronald Lauder.\nShortly after, the U.S. Department of Education announced an investigation into Penn over alleged antisemitism on campus.\nOn Dec. 5, Magill testified before Congress alongside the presidents of Harvard University and the Massachusetts Institute of Technology about antisemitism on college campuses.\nStudent dissent and activismThroughout the year, Penn students organized for various causes and leveraged criticism at University leadership.", "location": ")\nWashington, DC", "classification": "antisemitism", "score": 0.9713641417619383, "event_breakdown": "* Dozens of major donors pull their funding in protest of University leadership\n* The U.S. Department of Education announces an investigation into Penn over alleged antisemitism on campus\n* Magill testifies before Congress about antisemitism on college campuses"}, {"id": "3af48bf0-fe37-436b-bc21-6ecc4f49eb4f", "title": "Harvard didnt act on campus antisemitism says congressional report", "date": "2024-05-17 12:00", "url": "https://www.thejc.com/news/usa/harvard-didnt-act-on-campus-antisemitism-says-congressional-report-hdr3eqjr", "message": "Kestenbaum testified before the House Judiciary Committee on Wednesday as part of its investigation into campus antisemitism.\nKestenbaum told JNS that the complaint reminds him of his experience participating in Black Lives Matter marches.\nHarvard’s leaders and its Antisemitism Advisory Group “concluded that many of the antisemitic incidents could be addressed simply by enforcing existing non-discrimination and anti-bullying policies,” the report found.\n“The committee’s report proves that former president Gay and Harvard’s leadership propped up the university’s Antisemitism Advisory Group all for show,” she said.\n“That’s what’s happening at Harvard all the time,” Covit told JNS.", "location": "Harvard", "classification": "antisemitism", "score": 0.9250148649233944, "event_breakdown": "1. Kestenbaum testified before the House Judiciary Committee on Wednesday as part of its investigation into campus antisemitism.\n2. Kestenbaum told JNS that the complaint reminds him of his experience participating in Black Lives Matter marches.\n3. Harvard’s leaders and its Antisemitism Advisory Group “concluded that many of the antisemitic incidents could be addressed simply by enforcing existing non-discrimination and anti-bullying policies,” the report found.\n4. “The committee’s report proves that former president Gay and Harvard’s leadership propped up the university’s Antisemitism Advisory Group all for show,” she said.\n5. “That’s what’s happening at Harvard all the time,” Covit told JNS."}, {"id": "dc141977-1c61-431a-a481-a09b6e7e1708", "title": "Campus Reform the # 1 Source for College News", "date": "2024-05-17 12:45", "url": "https://www.campusreform.org/article/marschall-shameful-northwestern-president-must-cowardly-ineptitude-congressional-hearing-/25474", "message": "The House Committee on Education and the Workforce has justifiably summoned Northwestern University President Michael Schill to testify May 23 on “shocking concessions to the unlawful antisemitic encampments” the institution enabled last semester.\nNorthwestern is one of the worst examples of administrative negligence in protecting Jewish students.\nI recently sat down with Jewish alumni and students from Northwestern University to hear about their latest experiences.\nHis failure to keep Jewish students safe on campus last fall motivated me to submit a Title VI complaint against Northwestern.\nThe House Committee’s hearings reinforce the fact that protecting Jewish students - or any other minority - is not a political issue.", "location": "Evanston, Illinois", "classification": "antisemitism", "score": 0.9199147079743731, "event_breakdown": "* Failure to Keep Jewish Students Safe on Campus last fall\n* Submitted a Title VI Complaint Against Northwestern"}, {"id": "ebf012da-88ae-4838-afd4-21282aa57671", "title": "Shapiro order on  scandalou conduct amid Gaza protests raises alarm", "date": "2024-05-17 17:30", "url": "https://www.wesa.fm/politics-government/2024-05-17/shapiro-state-employees-israel-palestine-gaza-protests-executive-order-free-speech", "message": "Josh Shapiro has quietly revised his administration’s code of conduct to bar state employees from engaging in “scandalous or disgraceful” behavior — actions that could lead to discipline or termination, Spotlight PA has learned.\nAs protests against Israel’s war in Gaza — where the Palestinian death toll now tops 35,000 — have escalated, Shapiro has argued some demonstrations have crossed a line into bigotry.\nWitold J. Walczak, legal director of the ACLU of Pennsylvania, said the vagueness of Shapiro’s amended order could violate free speech protections enshrined in the U.S. Constitution.\n“Free speech is a value.\nFree speech doesn't give you the right to harass people.", "location": "United States", "classification": "antisemitism", "score": 0.4269612936433082, "event_breakdown": ".\n* Protests against war in Gaza led to antisemitism accusations.\n* Josh Shapiro revised code of conduct to bar State employees from engaging in “scandalous or disgraceful” behavior.\n*, Witold J. Walczak, legal director of the ACLU, argued vague order could violate free speech protections."}, {"id": "c64b8d33-fa5b-4778-bf59-8d44ad401b7f", "title": "How students are brainwashed to hate Israel", "date": "2024-05-17 18:30", "url": "https://www.heritagefl.com/story/2024/05/17/news/how-students-are-brainwashed-to-hate-israel/19945.html", "message": "Since students don’t know what they don’t know, they are vulnerable to propaganda and manipulation by faculty with a political agenda.\nBy doing so, Jentleson presents the Middle East he wants students to see.\nRather than blame Hamas for the current war, Kurtzer attacked Israeli intelligence failures and American support for Israel.\nA visiting scholar at the “Palestine Program” at Harvard spewed anti-Israel propaganda by imposing a false narrative of the “nakba” on students and calling Israel an apartheid state.\nWhen Students Supporting Israel and others held an event calling for the return of hostages taken by Hamas, their voices were drowned out.", "location": ".\nBased on the text provided, I was not able to pinpoint a specific location for the events described in the question.", "classification": "antisemitism", "score": 0.7348151063952324, "event_breakdown": "Harvard Palestine Program - anti-Israel propaganda event\nEvent calling for the return of hostages taken by Hamas - disrupted (by Palestine scholars)\nVisiting scholar from the Palestine Program at Harvard attends event that calls for the return of hostages taken by Hamas - Disrupted by other attendees"}, {"id": "db313d82-178c-4637-a9a5-b7e6146bb3d1", "title": "More On Those  Outside Agitator – In Saner Thought", "date": "2024-05-17 18:30", "url": "https://lobotero.com/2024/05/17/more-on-those-outside-agitators/", "message": "I recently wrote a post about the accusation of those ‘outside agitators’ that conservatives and their lackeys keep trying to convince the nation exist.\nFor those that could not spare the time before maybe you can find a bit here…..Groups have been watching these protest besides the media and people looking to start shit with lies….all that violence that is being blamed on ‘outside agitators’ is almost non-existent….that’s right dimwits….these are not violent….\nI think we may have identified those ‘outside agitators’ (sarcasm in case you missed it)VFP members were present at the initial rally of about 200 people at Metropolitan State University of Denver, Auraria Campus, in Colorado on April 25 (photo above right).\nThe veterans came to support the students who are camping out there.\nIn a letter to the Treasury Department, the members of Congress requested documents on the organizations while smearing them as antisemitic and pro-Hamas.", "location": "and without putting\nDenver, Colorado", "classification": "antisemitism", "score": 0.6380796054779379, "event_breakdown": "1. In a letter to the Treasury Department, members of Congress requested documents on the organizations while smearing them as antisemitic and pro-Hamas.\n\n2. The veterans came to support the students who are camping out at Metropolitan State University of Denver, Auraria Campus, in Colorado on April 25.\n\n3. Members of VFP (Veterans for Peace)  were present at the initial rally of about 200 people at Metropolitan State University of Denver, Auraria Campus, in Colorado on April 25."}, {"id": "070c1b99-d059-4e4a-8c86-6ee4f5a679e4", "title": "Oxford students invite terrorist sympathisers as  special guests  ", "date": "2024-05-17 16:45", "url": "https://www.thejc.com/news/uk/oxford-students-invite-terrorist-supporters-as-special-guests-hk2kc86o", "message": "A pro-Palestine group at Oxford University invited a Hamas sympathiser and terror-supporting doctor to speak at a press conference and rally on campus yesterday.\nBritish-Palestinian plastic surgeon Ghassan Abu Sittah is scheduled to speak before protesters at Oxford University on 16 May, 2024, despite having expressed pro-Hamas sentiment.\nThey said their client had been asked to speak at Al-Yamani’s memorial by his widow and his distress reflected his personal friendship with him.\nUntil our demands are met.”A representative from Oxford University told the JC that the event had “nothing to do with the university” and took place on the street outside a university building.\nThe situation keeps escalating and there is a very alarming lack of action by the university administration.”", "location": "OXFORD", "classification": "antisemitism", "score": 0.48375791257917194, "event_breakdown": ".\n1. Pro-Palestine group at Oxford University invites a Hamas sympathiser and terror-supporting doctor to speak at a press conference and rally on campus.\n2. British-Palestinian plastic surgeon Ghassan Abu Sittah is scheduled to speak before protesters at Oxford University on 16 May 2024.\n3. Oxford University informed that the event had \"nothing to do with the university\"."}]