[{"id": "3a215334-da97-44a2-abc8-0b2418898af7", "title": "Al - Bureij battalion Salah Jamil Muhammad Emad eliminated by Israel", "date": "2024-05-05 12:00", "url": "https://www.jpost.com/israel-hamas-war/article-799901", "message": "In the attack, several other terrorists who were with him in the terrorist infrastructure of the organization were eliminated.\nIDF airstrike targets Hamas terrorist infrastructure.\nAt the same time, Gaza Division soldiers attacked a Hamas launching area, which contained rockets that were ready to be launched to Israel's south, with artillery fire.\nIn the past day, fighter jets and aircraft of the Air Force attacked additional terror targets in Gaza, including military buildings, terrorist infrastructures, and weapons warehouses.\nAir Force aircraft directed by the Gaza Division killed three Hamas terrorists in the Jabaliya area, including a deputy company commander and two other terrorists from the organization.", "location": "Gaza", "classification": "security", "score": 0.9963829105454725, "event_breakdown": ""}, {"id": "1c107e48-e026-44f7-b694-93eb309a0d4f", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809715-Israel-attacks-Rafah-after-Hamas-claims-responsibility-for-deadly-rocket", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackWorld World Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it also struck a \"military structure\"Follow on Published On: Mon, 06 May 2024 08:44:32 PKTCAIRO (Reuters) – Three Israeli soldiers were killed in a rocket attack claimed by Hamas, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas's armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.", "location": "Rafah", "classification": "security", "score": 0.9941729451630361, "event_breakdown": "- Hamas claims responsibility for deadly rocket attack near Rafah\n- Israeli airstrike hits a house in Rafah, killing three people\n- Israeli military confirms counter-strike, targeting launcher and military structure\n- Israeli air strike kills nine Palestinians, including a baby, in another house in Rafah"}, {"id": "4acbbfb8-2498-432b-98d6-b5350d6823c4", "title": "19 killed in Rafah as Israel retaliates to deadly Hamas rocket attack", "date": "2024-05-06 04:00", "url": "https://www.firstpost.com/world/19-killed-in-rafah-as-israel-retaliates-to-deadly-hamas-rocket-attack-13767464.html", "message": "ReutersThree Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nThe war began after Hamas stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Rafah", "classification": "security", "score": 0.9922319617356419, "event_breakdown": "1. Three Israeli soldiers were killed in a rocket attack near the southern Gaza Strip city of Rafah.\n2. At least 19 people were killed by Israeli fire in Rafah, according to Palestinian health officials.\n3. Hamas's armed wing claimed responsibility for an attack on the Kerem Shalom crossing into Gaza that killed three Israeli soldiers.\n4. An Israeli airstrike hit a house in Rafah, killing three people and injuring several others.\n5. Another Israeli air strike in Rafah killed nine Palestinians, including a baby, according to Gaza health officials.\n6. The war between Israel and Hamas began after a cross-border raid by Hamas on October 7th, resulting in casualties and hostages."}, {"id": "3a4dec25-1f01-483c-988b-8ef18f3fbc1d", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 04:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374065.html", "message": "The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".", "location": "Rafah", "classification": "security", "score": 0.9942941143000886, "event_breakdown": "- Attack on Kerem Shalom crossing into Gaza\n- Israeli airstrike on house in Rafah"}, {"id": "8c5fc118-8693-47fd-bcf5-32c2bf73a39c", "title": "IDF orders Palestinians to evacuate eastern Rafah ahead of planned offensive", "date": "2024-05-06 09:00", "url": "https://www.firstpost.com/world/idf-rafah-israel-hamas-war13767512-13767512.html", "message": "ReutersThe Israeli Defense Forces (IDF) on Monday began calling on Palestinians in eastern Rafah to evacuate as Israel moves a step closer to expanding its attack in southern Gaza city.\nAccording to a report by the Times of Israel, Palestinian civilians are being ordered to move to an expanded humanitarian zone in the al-Mawasi and Khan Younis areas.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing but did not confirm where it fired them from.\n“We are observing worrying signs that Hamas does not intend to reach an agreement with us,” Gallant said.\n“This means strong military action in Rafah will begin in the very near future, and in the rest of the Strip.”AdvertisementWith inputs from Reuters", "location": "Rafah", "classification": "security", "score": 0.9711334095028176, "event_breakdown": "1. The Israeli Defense Forces (IDF) call on Palestinians in eastern Rafah to evacuate as Israel prepares to expand its attack in southern Gaza city.\n2. Palestinian civilians are ordered to move to an expanded humanitarian zone in the al-Mawasi and Khan Younis areas.\n3. Hamas' armed wing fires rockets at an Israeli army base near the crossing, but the location is not confirmed.\n4. There are worrying signs that Hamas does not intend to reach an agreement with Israel.\n5. Strong military action in Rafah and the rest of the Strip is expected to begin in the near future."}, {"id": "a3c245fe-9771-4506-9460-0bd12afd71d5", "title": "Hamas armed wing claims responsibility for deadly attack on Israel - Gaza crossing", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/hamas-armed-wing-claims-responsibility-for-deadly-attack-on-israel-gaza-crossing/", "message": "CAIRO (Reuters) – The armed wing of Palestinian Islamist group Hamas claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nHamas media quoted a source close to the group as saying the commercial crossing was not the target.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”.", "location": "Rafah", "classification": "security", "score": 0.9942941143000886, "event_breakdown": "- Hamas claims responsibility for attack on Kerem Shalom crossing into Gaza\n- Hamas fires rockets at Israeli army base near the crossing\n- Israeli airstrike hits house in Rafah, killing three and wounding several"}, {"id": "e04e07a3-2da3-4df3-abb2-475d0930989f", "title": "Australian police kill 16 - year - old boy after stabbing with  hallmark of terrorism", "date": "2024-05-05 09:30", "url": "https://nypost.com/2024/05/05/world-news/australian-police-kill-16-year-old-boy-after-stabbing-with-hallmarks-of-terrorism/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in the state capital Perth, regarding the attacker.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nAPThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.5376789944108437, "event_breakdown": "1. A stabbing incident occurred in the suburb of Willetton, Perth, Western Australia, where a boy stabbed a man, leading to the police shooting the boy dead.\n2. Authorities in Western Australia stated that the incident had \"hallmarks\" of terrorism, although it was not officially declared a terrorist act.\n3. Western Australia Premier Roger Cook addressed the incident during a televised press conference in Perth, emphasizing that the attacker acted alone.\n4. Days prior to the Willetton incident, a stabbing spree in the Sydney beachside suburb of Bondi resulted in six fatalities."}, {"id": "e69020bd-534d-4497-a363-f0643eb1b37c", "title": "Responsible for Israel - Gaza border crossing attack , says Hamas", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/responsible-for-israel-gaza-border-crossing-attack-says-hamas", "message": "Hamas' armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\".\nIn response to Hamas' attack, more than 34,600 Palestinians have been killed, 29 of them in the past 24 hours, and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry.\nThe war began after a Hamas attack on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "", "classification": "security", "score": 0.9877265777573967, "event_breakdown": "1. Hamas' armed wing fires rockets at an Israeli army base.\n2. Israeli airstrike hits a house in Rafah, resulting in three deaths and several injuries.\n3. Israeli military confirms counter-strike on the launcher and nearby \"military structure.\"\n4. More than 34,600 Palestinians have been killed and over 77,000 wounded in Israel's assault, in response to Hamas' attack.\n5. The war began after a Hamas attack on October 7, resulting in 1,200 deaths and 252 hostages taken according to Israeli tallies."}, {"id": "c146531c-47e5-4764-b1b4-0b33857c348f", "title": "Hamas armed wing says responsible for Israel - Gaza border crossing attack", "date": "2024-05-05 19:45", "url": "https://www.swissinfo.ch/eng/hamas-armed-wing-says-responsible-for-israel-gaza-border-crossing-attack/76969385", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack3 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Three Israeli soldiers were killed in a rocket attack claimed by Hamas armed wing, near the southern Gaza Strip city of Rafah, where Palestinian health officials said at least 19 people were killed by Israeli fire on Sunday.\nHamas’s armed wing claimed responsibility on Sunday for an attack on the Kerem Shalom crossing into Gaza that Israel said killed three of its soldiers.\nHamas’ armed wing said it fired rockets at an Israeli army base by the crossing, but did not confirm where it fired them from.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.", "location": "Rafah", "classification": "security", "score": 0.9982178355996476, "event_breakdown": "- Three Israeli soldiers killed in a rocket attack near Rafah, southern Gaza Strip\n- Hamas claims responsibility for the rocket attack\n- At least 19 people killed by Israeli fire in Rafah\n- Hamas fires rockets at an Israeli army base near the Kerem Shalom crossing into Gaza\n- Israeli airstrike hits a house in Rafah, killing three people and injuring others\n- Israeli air strike kills nine Palestinians, including a baby, in another house in Rafah"}, {"id": "b1ee9971-6237-463b-90e0-357bf1db7dd9", "title": "Australian police shoot dead  radicalised  teenager after knife attack in Perth", "date": "2024-05-05 05:00", "url": "https://www.scmp.com/news/asia/australasia/article/3261462/australian-police-shoot-dead-radicalised-teenager-after-knife-attack-perth", "message": "The teenager “rushed” at police who responded by shooting him twice with tasers before firing a single fatal shot, they said.\nWestern Australian police shot and killed a “radicalised” 16-year-old boy with a knife who stabbed a man in a Perth car park, police and the state premier said on Sunday.\nPolice body camera images showed the teenager refused officers’ demands that he put down the knife, the police chief said.\n03:14 Authorities rule out terrorism in deadly Sydney knife attack Authorities rule out terrorism in deadly Sydney knife attackPolice believe the teenager sent “relevant messages” to some members of the Muslim community who immediately called police, he said, without giving details of the messages.\nTwo days after the mall attack an Assyrian Christian bishop was brutally stabbed during a live streamed service in western Sydney.", "location": "Perth, Western Australia", "classification": "security", "score": 0.8303601596936979, "event_breakdown": "- Western Australian police shoot and kill a \"radicalised\" 16-year-old boy with a knife in a Perth car park\n- Police respond by shooting the teenager with tasers before firing a single fatal shot\n- Police body camera images show the teenager refusing to put down the knife\n- Authorities rule out terrorism in deadly Sydney knife attack\n- Police believe the teenager sent \"relevant messages\" to members of the Muslim community who called the police\n- Assyrian Christian bishop brutally stabbed during a live streamed service in western Sydney"}, {"id": "8de7113d-d68f-4aae-9659-4f038ffa36ab", "title": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack", "date": "2024-05-06 07:45", "url": "https://kathmandupost.com/world/2024/05/06/israel-attacks-rafah-after-hamas-claims-responsibility-for-deadly-rocket-attack", "message": "Israel attacks Rafah after Hamas claims responsibility for deadly rocket attackThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby “military structure”.\nMourners react near to the bodies of Palestinians killed in an Israeli strike, at Abu Yousef al-Najjar hospital in Rafah, May 5, 2024.", "location": "The main location where the main event takes place is Rafah.", "classification": "security", "score": 0.9936042470976927, "event_breakdown": "- Israel attacks Rafah after Hamas claims responsibility for deadly rocket attack\n- Mourners react near to the bodies of Palestinians killed in an Israeli strike at Abu Yousef al-Najjar hospital in Rafah"}, {"id": "75ebf0bf-8ecd-4c27-ab7a-3d6eaf977ba8", "title": "Hezbollah rocket barrage wounds two in Kiryat Shmona", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/breaking-news/article-799905", "message": "At least two people were lightly wounded after Hezbollah fired a barrage of several dozen rockets toward Kiryat Shmona on Sunday.\nThe Ziv Medical Center received two patients who were wounded by shock waves from the rocket fire.\nHezbollah took responsibility for the rocket fire, saying it launched dozens of Katyusha and Falaq rockets toward Kiryat Shmona in response to an earlier Israeli airstrike on Meiss El Jabal in southern Lebanon.\nA MDA ambulance hit by rocket shrapnel in Kiryat Shmona.\nNorthern residents issue demands to governmentOrganizations representing residents of northern Israel issued a joint statement on Sunday, expressing concerns about a ceasefire agreement reportedly being discussed between Hezbollah and Israel.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9834609917262499, "event_breakdown": "- Two people lightly wounded after Hezbollah fired rockets toward Kiryat Shmona.\n- Ziv Medical Center received two patients wounded by shock waves from the rocket fire.\n- Hezbollah claimed responsibility, launching Katyusha and Falaq rockets toward Kiryat Shmona in response to an Israeli airstrike on Meiss El Jabal.\n- MDA ambulance hit by rocket shrapnel in Kiryat Shmona.\n- Northern residents issue demands to government, expressing concerns about a ceasefire agreement reportedly being discussed between Hezbollah and Israel."}, {"id": "dc666ddb-c9ba-406b-972f-76fe164cd4e7", "title": "Police in Australia shoot boy dead after stabbing with  hallmark of terrorism", "date": "2024-05-05 07:30", "url": "https://www.yahoo.com/news/police-australia-shoot-boy-dead-062748293.html", "message": "The car park in Perth where the stabbing and shooting occurred - Australian Broadcasting Corporation vi APPolice in Western Australia have shot dead a boy after he stabbed a man in Perth, in an attack authorities said indicated terrorism.\nThe apparently random attack, in the car park of a hardware store in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\nState Police Commissioner Col Blanch said when police were called to the car park, the youth lunged at officers with the knife and was shot.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised press conference in Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton, Perth", "classification": "security", "score": 0.9039307365082059, "event_breakdown": ""}, {"id": "06a1613c-981a-43dc-9b71-16bff1e2e458", "title": "Australian police shoot 16 - year - old boy dead after stabbing", "date": "2024-05-05 05:00", "url": "https://www.theglobeandmail.com/world/article-australian-police-shoot-16-year-old-boy-dead-after-stabbing/", "message": "Australian police said on Sunday they had shot dead a boy after he stabbed a man in Western Australia’s capital Perth, in an attack authorities said indicated terrorism.\nThere were signs the 16-year-old, armed with a kitchen knife, had been radicalized online, state authorities said, adding they received calls from concerned members of the local Muslim community before the attack, which occurred late on Saturday night.\nThe attack, in the suburb of Willetton, had “hallmarks” of terrorism but was yet to be declared a terrorist act, police said.\n“At this stage it appears that he acted solely and alone,” Western Australia Premier Roger Cook told a televised news conference in the state capital Perth, regarding the attacker.\nThe attack on the bishop came only days after a stabbing spree killed six in the Sydney beachside suburb of Bondi.", "location": "Willetton", "classification": "security", "score": 0.42508576033814766, "event_breakdown": "- A boy was shot dead by Australian police after he stabbed a man in Perth, Western Australia\n- The 16-year-old attacker, armed with a kitchen knife, showed signs of being radicalized online\n- Concerned members of the local Muslim community had contacted authorities before the attack\n- The attack occurred in the suburb of Willetton and had \"hallmarks\" of terrorism\n- The attacker acted solely and alone according to Western Australia Premier Roger Cook\n- A stabbing spree in the Sydney beachside suburb of Bondi killed six people, only days before the attack in Perth"}, {"id": "a8f19109-ad75-4cad-a695-e6ddb3471e70", "title": "Dogs start eating bodies of the dead in the streets of Rafah", "date": "2024-05-06 07:45", "url": "https://www.dailymail.co.uk/news/article-13386339/Dogs-start-eating-bodies-dead-streets-Rafah-Israel-begins-evacuation-city-offensive-imminent-latest-breakdown-peace-talks-Hamas.html", "message": "Animals have reportedly started eating the bodies of the dead in the street of Rafah, as Israel begins its evacuation of the city to prepare for an offensive against the last-remaining city in the Gaza Strip.\nDogs have been seen dragging corpses from the graves of people buried in Gaza, according to Palestinian civilians who spoke to the BBC.\nThe Israeli military this morning told Palestinians to evacuate eastern Rafah, amid an expected military offensive that aims to wipe out any remaining Hamas fighters in the region.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing on Saturday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields.", "location": "Rafah", "classification": "security", "score": 0.9822783184977119, "event_breakdown": "- animals eating bodies of the dead in the streets of Rafah, Gaza\n- dogs dragging corpses from graves in Gaza\n- Israeli military telling Palestinians to evacuate eastern Rafah\n- rockets launched from southern Gaza towards Kerem Shalom crossing, killing soldiers and injuring others\n- dispute over the target of the rockets launched from Gaza and use of civilians as human shields by Hamas"}, {"id": "a5856d9a-fbd1-4590-8828-f61e8db78c5e", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 07:45", "url": "https://www.stabroeknews.com/2024/05/06/news/world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/", "message": "AMMAN (Reuters) – An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired “tens” of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "KIRYAT SHMONA", "classification": "security", "score": 0.9914293181201302, "event_breakdown": "null"}, {"id": "3aec41ca-6f7e-41dc-ba52-4420968efd69", "title": "4 Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-06 04:45", "url": "https://www.asiaone.com/world/4-lebanese-civilians-killed-israeli-strike-border-village", "message": "AMMAN — An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday (May 5), civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9914890314874649, "event_breakdown": "- Israeli airstrike kills four members of a family in a border village in southern Lebanon\n- Hezbollah fires Katyusha rockets at the Israeli town of Kiryat Shmona in retaliation\n- More than 250 Hezbollah members and 75 civilians killed in Israeli strikes on Lebanon\n- Missile fire from Lebanon kills around a dozen Israeli troops and several civilians\n- Hamas militants conduct a cross-border raid from the Gaza Strip, resulting in the death of 1,200 people and the taking of 252 hostages"}, {"id": "6f9895ec-ba9a-4421-bd7c-f10f49274165", "title": "Israel nuclear doctrine after Iran aggression", "date": "2024-05-05 06:30", "url": "https://www.israelnationalnews.com/news/389415", "message": "Any continuing Israeli posture of deliberate nuclear ambiguity could cause terrorist-mentoring Iran to overestimate the first-strike vulnerabilities of Israel's nuclear forces.\nBut if relevant Israeli doctrine were made more obvious to Tehran - that is, if rendered more consistently plain that Israel's nuclear assets met payload and delivery system objectives - Israel's nuclear forces could more reliably serve their existential security functions.\nAny continued ambiguity over Israel’s nuclear posture could create the erroneous impression of a state that is unwilling to retaliate.\nThere are persuasive connections between a selectively disclosed Israeli nuclear doctrine and Iranian perceptions of Israeli nuclear deterrence.\nAnother concerns the relationship between greater policy “openness” and the perceived capacity of Israel's nuclear forces to penetrate Iran’s active defenses.", "location": "Israel", "classification": "security", "score": 0.7840000511491192, "event_breakdown": "- Continuing Israeli posture of deliberate nuclear ambiguity could cause Iran to overestimate first-strike vulnerabilities\n- Relevant Israeli doctrine made more obvious could enhance nuclear security functions\n- Continued ambiguity over Israel’s nuclear posture could create impressions of unwillingness to retaliate\n- Persuasive connections between disclosed Israeli nuclear doctrine and Iranian perceptions of deterrence\n- Relationship between policy “openness” and perceived capacity of Israel's nuclear forces to penetrate Iran’s defenses"}, {"id": "a4c6570f-0aa6-44b7-93ec-94a24c849313", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 15:30", "url": "https://www.hurriyetdailynews.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike-193163", "message": "Hezbollah launches rockets at Israel after deadly south Lebanon strikeBEIRUTA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nHezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".", "location": "", "classification": "security", "score": 0.9857130395007375, "event_breakdown": ""}, {"id": "a19193c4-0a59-4552-a823-2dc71ea4ff2f", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 12:45", "url": "https://economictimes.indiatimes.com/news/defence/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/articleshow/109859718.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas 's unprecedented October attack on southern Israel sparked the war in Gaza.Fighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.Lebanon's state-run National News Agency said the strike in Mais al-Jabal killed \"four people from a single family\", updating an earlier reported toll of three dead in the raid it said was carried out by Israeli aircraft.It identified them as a man, a woman and their children aged 12 and 21, and said two other people were wounded.A Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".Mais al-Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.Hezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".The Lebanese movement has repeatedly declared that only a ceasefire in Gaza will put an end to its attacks on Israel, which it says are in support of Gazans and its ally Hamas.Both the United States and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.In Lebanon, at least 390 people have been killed in nearly seven months of cross-border violence, mostly militants but also more than 70 civilians, according to an AFP tally.Israel says 11 soldiers and nine civilians have been killed on its side of the border.Tens of thousands of people have been displaced on both sides.", "location": "Mais al-Jabal", "classification": "security", "score": 0.9336051552163522, "event_breakdown": "- Israeli strike on southern village in Lebanon kills several people from the same family\n- Hezbollah announces rocket fire in retaliation\n- Exchange of regular cross-border fire between Israel and Lebanon's Hezbollah group\n- Intensified fighting with Israel striking deeper into Lebanese territory and Hezbollah stepping up missile and drone attacks on military positions in northern Israel\n- Strike in Mais al-Jabal kills \"four people from a single family\"\n- Hezbollah fires \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel in response to the Israeli strike\n- Diplomatic efforts by the United States and France to calm tensions on the Lebanese-Israeli border\n- Casualties on both sides: at least 390 people killed in Lebanon, mostly militants and more than 70 civilians, while Israel reports 11 soldiers and nine civilians killed"}, {"id": "6d5d6815-2604-4030-b177-d8a0f38ca38e", "title": "Four Lebanese civilians killed in Israeli strike on border village", "date": "2024-05-05 18:30", "url": "https://gazette.com/news/us-world/four-lebanese-civilians-killed-in-israeli-strike-on-border-village/article_7ef7063d-e5d5-5751-aad5-8ce8d8841378.html", "message": "AMMAN (Reuters) -An Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon on Sunday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nHamas militants from the Gaza Strip stunned Israel with a cross-border raid on Oct. 7 in which 1,200 people were killed and 252 hostages taken, according to Israeli tallies.", "location": "", "classification": "security", "score": 0.9914293181201302, "event_breakdown": "- Israeli airstrike kills four members of a family in southern Lebanon\n- Hezbollah fires rockets at Israeli town of Kiryat Shmona in retaliation\n- More than 250 Hezbollah members and 75 civilians killed in Israeli strikes on Lebanon\n- Missile fire from Lebanon kills around a dozen Israeli troops and several civilians\n- Hamas militants conduct cross-border raid from Gaza Strip, killing 1,200 people and taking 252 hostages"}, {"id": "fe3f9067-329d-4394-b529-bac47347f348", "title": "Border Crossing Where Humanitarian Aid Enters Gaza Has Been Blown Up . Guess Who Taking Credit . ", "date": "2024-05-06 18:30", "url": "https://townhall.com/tipsheet/spencerbrown/2024/05/06/hamas-blew-up-the-entry-point-for-humanitarian-aid-headed-to-gaza-n2638654", "message": "Hamas terrorists claimed credit for a rocket attack on Sunday targeting the Kerem Shalom border crossing between Israel and Gaza near the Egyptian border, the main entry point for humanitarian aid headed into the enclave.\nThey fell during a Hamas rocket attack on Kerem Shalom earlier today.\n\"Yes, they’re bombing their own lifeline of food and aid,\" he said of the rocket attack.\nYet again, however, it is Hamas terrorists who are preventing aid from making it to those who need it.\nThe IDF released footage of Hamas rocket launches at the Kerem Shalom Crossing, which is used for trucks to carry aid into Gaza.", "location": "", "classification": "security", "score": 0.9307361974172657, "event_breakdown": "- Hamas terrorists claimed credit for a rocket attack targeting the Kerem Shalom border crossing between Israel and Gaza near the Egyptian border\n- The rocket attack fell during a Hamas rocket attack on Kerem Shalom\n- IDF released footage of Hamas rocket launches at the Kerem Shalom Crossing"}, {"id": "db341e3a-17a8-49a0-8835-1f25c915fd7c", "title": "Israeli army tells Palestinians to evacuate parts of Rafah ahead of an expected assault", "date": "2024-05-06 10:15", "url": "https://www.armenpress.am/eng/news/1136385.html", "message": "The Israeli army has told Palestinians to begin evacuating eastern Rafah, according to an Israeli Defense Force statement on Monday, signaling that a ground invasion is imminent.\nShortly after the Hamas attack, an Israeli airstrike hit a house in Rafah killing three people and wounding several others, Palestinian medics said.\nThe Israeli military confirmed the counter-strike, saying it struck the launcher from which the Hamas projectiles were fired, as well as a nearby \"military structure\", Reuters adds.\nJust before midnight, an Israeli air strike killed nine Palestinians, including a baby, in another house in Rafah, Gaza health officials said.\nMore than 34,600 Palestinians have been killed and more than 77,000 have been wounded in Israel's assault, according to Gaza's health ministry.", "location": "Rafah", "classification": "security", "score": 0.970686388466988, "event_breakdown": "- Israeli army instructs Palestinians to evacuate eastern Rafah\n- Israeli airstrike hits house in Rafah, killing three people and wounding several others\n- Israeli military confirms counter-strike, hitting launcher and \"military structure\"\n- Israeli air strike kills nine Palestinians, including a baby, in another house in Rafah"}, {"id": "73fc28d2-8e5a-4225-8d96-b3c503972d34", "title": "Hezbollah launches rockets at Israel after deadly south Lebanon strike", "date": "2024-05-05 18:00", "url": "https://www.khaleejtimes.com/world/mena/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike", "message": "A soldier looks at a burning car at the site of a rocket that was fired towards Israel from Lebanon in Kiryat Shmona.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nMais Al Jabal municipality chief Abdelmoneim Shukair had earlier told AFP that three people were killed, saying they were a couple and their son.\nIt later said it fired dozens more Katyusha rockets at Israeli troops and vehicles across the border \"as part of the response\" to the Mais Al Jabal strike.", "location": "", "classification": "security", "score": 0.9890561852040681, "event_breakdown": "- Rocket fired towards Israel from Lebanon in Kiryat Shmona\n- Exchange of regular cross-border fire between Israel and Lebanon's Iran-backed Hezbollah group\n- Strike in Mais Al Jabal, Lebanon, resulting in the death of four civilians\n- Mais Al Jabal municipality chief confirming the death of three people, a couple and their son\n- Firing of dozens of Katyusha rockets at Israeli troops and vehicles across the border in response to the Mais Al Jabal strike"}, {"id": "186d4cb4-fd85-4693-adcb-054925a17232", "title": "Four Lebanese killed in Israeli airstrike", "date": "2024-05-05 19:45", "url": "https://www.thedailystar.net/news/world/news/four-lebanese-killed-israeli-airstrike-3603006", "message": "Hezbollah launches retaliatory strikesAn Israeli airstrike killed four members of a family in a house in a border village in southern Lebanon yesterday, civil defence and security sources said.\nIn a statement, Hezbollah said it fired \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona, a northern town close to the Lebanese border, in retaliation.\nMore than 250 Hezbollah members and 75 civilians have been killed in Israeli strikes on Lebanon since October, security sources there say.\nIn Israel, missile fire coming from Lebanon has killed around a dozen troops and several civilians, Israeli sources say.\nBoth the US and France have made diplomatic efforts to calm tensions on the Lebanese-Israeli border.", "location": "", "classification": "security", "score": 0.9925230836851295, "event_breakdown": "- Israeli airstrike killed four members of a family in a border village in southern Lebanon\n- Hezbollah retaliates by launching \"tens\" of Katyusha rockets at the Israeli town of Kiryat Shmona\n- More than 325 people killed in Israeli strikes on Lebanon (Hezbollah members and civilians)\n- Around a dozen Israeli troops and several civilians killed by missile fire from Lebanon\n- Diplomatic efforts by the US and France to calm tensions on the Lebanese-Israeli border"}, {"id": "282b3e4c-de6e-4645-b45c-ea4c083e8c94", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 01:15", "url": "https://www.thehindu.com/news/international/hezbollah-attacks-israel-after-deadly-south-lebanon-strike/article68143616.ece", "message": "Fighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "Mais al-Jabal", "classification": "security", "score": 0.9512679360047135, "event_breakdown": "The events reported in the text are as follows:\n\n- Fighting intensifies between Hamas ally Hezbollah and Israel.\n- Israeli military strikes deeper into Lebanese territory.\n- Strike in Mais al-Jabal, Lebanon, reportedly kills four civilians from a single family.\n- Lebanese security source confirms the civilian casualties.\n- Israeli fighter jets target Hezbollah military structures and terrorist infrastructure in southern Lebanon.\n- Hezbollah insists on a ceasefire in Gaza to halt its attacks on Israel, claiming support for Gazans and Hamas."}, {"id": "cc2ca4a0-95fc-4331-b75a-c9998f652bc3", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 19:00", "url": "https://www.al-monitor.com/originals/2024/05/hezbollah-attacks-israel-after-deadly-south-lebanon-strike", "message": "May 5, 2024 — Beirut (AFP)Official media in Lebanon said an Israeli strike Sunday on a southern village killed four family members, with Hezbollah announcing retaliatory attacks, in the latest cross-border violence since the Gaza war erupted.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "southern village", "classification": "security", "score": 0.9554528278151891, "event_breakdown": "- Israeli strike in a southern village in Lebanon kills four family members\n- Hezbollah announces retaliatory attacks following the Israeli strike\n- Fighting intensifies in recent weeks between Hezbollah and the Israeli military\n- Lebanese security source confirms the strike killed four civilians\n- Israeli fighter jets strike Hezbollah military structures and terrorist infrastructure in southern Lebanon"}, {"id": "54c2a3c4-c348-41f0-8e5d-03835449b128", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-05 22:00", "url": "https://www.bssnews.net/international/187330", "message": "Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nLebanon's state-run National News Agency (NNA) said Sunday's strike in Mais al-Jabal killed \"four people from a single family\", reporting that the raid was carried out by Israeli aircraft.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.", "location": "", "classification": "security", "score": 0.9859178568794482, "event_breakdown": "- Regular cross-border fire between Israel and Iran-backed Hezbollah group\n- October 7 attack by Hamas on southern Israel sparking war in Gaza Strip\n- Fighting intensifying in recent weeks\n- Hezbollah stepping up attacks on northern Israel\n- Israeli military striking deeper into Lebanese territory\n- Strike in Mais al-Jabal killing four people from a single family, carried out by Israeli aircraft\n- Lebanese security source confirming the strike killed four civilians\n- Fighter jets striking Hezbollah military structures and terrorist infrastructure in several areas of southern Lebanon"}, {"id": "55ec9328-873b-4620-a054-8f127f58a91f", "title": "Police shoot dead  radicalised  teenager after he stabbed man", "date": "2024-05-05 08:30", "url": "https://www.lbc.co.uk/world-news/82ff8645e2d8492a995683330ae7da66/", "message": "A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth.\nThe teenager attacked the man and then rushed at police officers before he was shot, Western Australian premier Roger Cook told reporters on Sunday.\n“I don’t want to say he has been radicalised or is radicalised because I think that forms part of the investigation,” he said.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” Mr Wadood added.\nIn November 2018, a Somalia-born Muslim stabbed three pedestrians in downtown Melbourne, killing one, before police shot him dead.", "location": "", "classification": "security", "score": 0.6087608391025592, "event_breakdown": "Here is a list of the events in the provided text:\n\n- In Perth, Australia, a 16-year-old boy armed with a knife stabbed a man.\n- Police shot dead the teenager after he rushed at officers following the stabbing.\n- Western Australian premier Roger Cook commented on the incident, noting that the cause of the attack was under investigation.\n- A local Muslim community member, Mr. Wadood, mentioned that the community had previously alerted police about the individual.\n- In November 2018, in downtown Melbourne, a Somalia-born Muslim stabbed three pedestrians, killing one, before police shot him dead."}, {"id": "4ca3bbac-c824-4e18-894b-4966c5b7da81", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 19:45", "url": "https://www.yahoo.com/news/israeli-strike-kills-4-civilians-185339652.html", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9959154188551282, "event_breakdown": "The events reported in the text are as follows:\n\n- Israeli airstrike in Mays al Jabal, south Lebanon, kills four civilians and wounds several others.\n- Israeli military targets Hezbollah military infrastructure in Mays al Jabal and other parts of southern Lebanon.\n- More than 350 people, mostly Hezbollah fighters and allied groups, killed in Israeli strikes in Lebanon.\n- Israeli casualties include at least 10 civilians and 12 soldiers from strikes originating in Lebanon."}, {"id": "72152695-5c4a-4388-b200-2c1d17d3c947", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:45", "url": "https://abcnews.go.com/International/wireStory/israeli-strike-kills-4-civilians-southern-lebanon-state-109941999", "message": "Lebanese state media and the town’s municipality report that an Israeli airstrike in the town of Mays al Jabal in south Lebanon has killed four civilians and wounded several othersBEIRUT -- An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nHezbollah on Sunday said it conducted at least 10 attacks targeting Israeli military positions and surveillance gear near the tense Lebanon-Israel border, while the Israeli military said it identified some 40 missiles that crossed into Israeli territory but did not cause any casualties.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9949173576989059, "event_breakdown": "The events reported in the text are as follows:\n\n- Israeli airstrike in the town of Mays al Jabal, south Lebanon, kills four civilians and wounds several others.\n- Hezbollah conducts at least 10 attacks targeting Israeli military positions and surveillance gear near the Lebanon-Israel border.\n- Israeli military reports 40 missiles crossing into Israeli territory from Lebanon without causing casualties.\n- Israeli military targets Hezbollah military infrastructure in other parts of southern Lebanon.\n- Strikes from Lebanon into Israel result in the deaths of at least 10 civilians and 12 soldiers."}, {"id": "8f2b9564-df13-430a-93c4-097b76144aed", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says", "date": "2024-05-05 21:00", "url": "https://www.startribune.com/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says/600363862/", "message": "BEIRUT — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9959154188551282, "event_breakdown": "1. Israeli airstrike in Mays al Jabal, south Lebanon resulting in the death of four civilians and injuries to several others.\n2. Israeli military targeting of military infrastructure in the southern Lebanese town belonging to Hezbollah.\n3. Israeli military targeting of Hezbollah military infrastructure in other parts of southern Lebanon.\n4. More than 350 people killed in Lebanon as a result of Israeli strikes, including fighters from Hezbollah and allied groups, as well as over 50 civilians.\n5. Strikes from Lebanon into Israel resulting in the death of at least 10 civilians and 12 soldiers."}, {"id": "3d4939d9-dd1c-4fbf-9f2f-4614049c956e", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says – Winnipeg Free Press", "date": "2024-05-05 19:15", "url": "https://www.winnipegfreepress.com/world/2024/05/05/israeli-strike-kills-4-civilians-in-southern-lebanon-state-media-says", "message": "BEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town’s municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9961035009131601, "event_breakdown": "- Israeli airstrike in Mays al Jabal, south Lebanon\n- Four civilians killed and several others wounded\n- Targeted military infrastructure belonging to Hezbollah\n- Israeli strikes on Hezbollah military infrastructure in other parts of southern Lebanon\n- Total death toll in Lebanon exceeds 350, including fighters and civilians\n- Strikes from Lebanon have killed at least 10 civilians and 12 soldiers in Israel."}, {"id": "b81a59f1-b15a-419f-aa12-b398c1753617", "title": "Israeli strike kills 4 civilians in southern Lebanon , state media says | iNFOnews", "date": "2024-05-05 19:30", "url": "https://infotel.ca/newsitem/ml-lebanon-israel/cp2009476227", "message": "Israeli strike kills 4 civilians in southern Lebanon, state media saysBEIRUT (AP) — An Israeli airstrike Sunday in the town of Mays al Jabal in south Lebanon killed four civilians and wounded several others, Lebanese state media and the town's municipality reported.\nThe Israeli military said its jet targeted military infrastructure in the southern Lebanese town belonging to Hezbollah, which has clashed with Israeli troops since Oct. 8.\nThe Israeli military also reported it targeted what it said was Hezbollah military infrastructure in other parts of southern Lebanon.\nIsraeli strikes have killed more than 350 people in Lebanon, most of them fighters with Hezbollah and allied groups but also including more than 50 civilians.\nIn Israel, strikes from Lebanon have killed at least 10 civilians and 12 soldiers.", "location": "Mays al Jabal", "classification": "security", "score": 0.9944163732244403, "event_breakdown": "The events reported in the text are as follows:\n\n- Israeli airstrike in Mays al Jabal, south Lebanon, kills four civilians and wounds several others.\n- Israeli military targets Hezbollah military infrastructure in Mays al Jabal and other parts of southern Lebanon.\n- Israeli strikes in Lebanon result in the deaths of more than 350 people, mostly Hezbollah fighters and allied groups, including over 50 civilians.\n- Strikes from Lebanon into Israel lead to the deaths of at least 10 civilians and 12 soldiers."}, {"id": "a82ec3f5-21d9-47d9-8dbf-297c41cfa710", "title": "Israeli airstrike that killed seven health workers in Lebanon used US munition , analysis reveals", "date": "2024-05-06 05:00", "url": "https://www.theguardian.com/world/article/2024/may/06/israel-airstrike-lebanon-us-weapons-international-law", "message": "Five days after the attack on healthcare workers in Lebanon, Israel killed another seven aid workers employed by the World Central Kitchen in Gaza.\nAn Israeli military spokesperson said that the airstrike in al-Habariyeh killed a “prominent terrorist belonging to Jamaa Islamiya”.\nView image in fullscreen Workers inspect the site of the Israeli airstrike in al-Habariyeh.\nView image in fullscreen Shrapnel from the Israeli airstrike is displayed along with medical equipment at the rescue workers’ funeral in Beirut, Lebanon.\nSince 7 October, Israel has killed 16 medical workers in Lebanon, including 10 in a single day at the end of March.", "location": "al-Habariyeh", "classification": "security", "score": 0.9836709984866446, "event_breakdown": "The events reported in the text are as follows:\n\n- Israeli airstrike in al-Habariyeh, Gaza, kills seven aid workers employed by the World Central Kitchen.\n- Israeli military spokesperson states that the airstrike targeted a \"prominent terrorist belonging to Jamaa Islamiya\".\n- Israel has killed a total of 16 medical workers in Lebanon since October 7, including 10 in a single day at the end of March."}, {"id": "50aae7c4-7b1e-427d-a26c-c9ec203013ff", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 04:00", "url": "https://www.siasat.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah-3021023/", "message": "Tel Aviv: The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nDefence Minister Yoav Gallant and Minister without portfolio, Benny Gantz will be participating in the war cabinet to be held later in the day.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo.", "location": "Rafah", "classification": "security", "score": 0.9698117891508292, "event_breakdown": "Tel Aviv: 16 people killed in Israeli air attack\n- Hamas health department reports the death toll from an Israeli air attack in Tel Aviv as 16.\n- Media sources reveal that nine members of one family and seven members of another family were among the casualties.\n\nRafah region: IDF stages air attack\n- The Israeli Defense Force (IDF) stages an air attack on Tel Aviv from the Rafah region early morning.\n\nWar cabinet meeting scheduled\n- Defense Minister Yoav Gallant and Minister without portfolio Benny Gantz will participate in a war cabinet meeting later in the day.\n\nKerem Shalom crossing: Rocket and mortar fire\n- Hamas fires rockets and mortars at Kerem Shalom crossing, killing three IDF soldiers.\n- Israel retaliates against the attack.\n\nPeace talks in Cairo affected\n- The escalation of violence due to the rocket and mortar firing by Hamas and Israel's retaliation is expected to impact the progress of peace talks in Cairo."}, {"id": "b9b89322-f46b-41d6-bdbf-7d246c8fd5c1", "title": "After Hamas rocket attack , 16 killed in Israeli airstrikes in Rafah", "date": "2024-05-06 06:30", "url": "https://www.dailyexcelsior.com/after-hamas-rocket-attack-16-killed-in-israeli-airstrikes-in-rafah/", "message": "Tel Aviv, May 6 : The Hamas health department said that 16 people were killed in an Israeli air attack on Monday.\nMedia has reported that nine people from one family and seven members from another family were killed in the air attack.\nThe airstrike was in retaliation to the barrage of rockets fired by Hamas at a ground near Kerem Shalom in Southern Israel killing three Israel Defense Forces (IDF) soldiers and injuring 11 soldiers.\nThe attack, according to IDF, was staged from the Rafah region early morning.\nThe rocket and mortar firing by Hamas at Kerem Shalom crossing killing three IDF soldiers and Israel’s retaliation is likely to affect the progress of peace talks in Cairo.", "location": "Rafah", "classification": "security", "score": 0.9952013459894679, "event_breakdown": "- 16 people killed in Israeli air attack in Tel Aviv\n- Nine people from one family and seven from another family killed in the air attack\n- Hamas rockets fired at ground near Kerem Shalom in Southern Israel, killing three IDF soldiers and injuring 11 soldiers\n- IDF retaliates with airstrike from Rafah region\n- Hamas rocket and mortar firing at Kerem Shalom crossing affecting peace talks in Cairo"}, {"id": "d9b9deb0-8cbe-45ce-a14d-456b3859e83b", "title": "Car Bomb Kills Russian Who Tortured Ukrainian Prisoners", "date": "2024-05-06 08:30", "url": "https://www.kyivpost.com/post/32166", "message": "77 and may have been involved in the interrogation of Ukrainian military and civilian prisoners.\nIt said it was carrying out forensic investigations and had initiated a criminal procedure and instituted operational measures to identify those involved in the car bombing.\nRussia has also been attempting to develop rail links between Berdyansk and other occupied cities.\nSeveral Russian-installed officials have been killed in car explosions in occupied territories since the start of the full-scale invasion.\nOn March 6 Svitlana Samoilenko, another Kremlin-installed official who was helping to arrange activities linked to the Russian presidential elections in occupied Berdyansk was killed in a similar way.", "location": "Berdyansk", "classification": "security", "score": 0.9680974598053619, "event_breakdown": "- Car bombing targeting a Kremlin-installed official in Berdyansk\n- Russian efforts to develop rail links between Berdyansk and other occupied cities\n- Assassination of several Russian-installed officials in occupied territories through car explosions\n- Killing of Svitlana Samoilenko, a Kremlin-installed official involved in activities related to Russian presidential elections in occupied Berdyansk"}, {"id": "0832036e-a09e-490b-beb3-0b7c07d92f16", "title": "4 killed in Israeli strikes in S . Lebanon - Xinhua", "date": "2024-05-05 15:30", "url": "https://english.news.cn/20240505/2e6299d9a3b8480090eea4fb5e8773f9/c.html", "message": "This photo taken from Kibbutz Malkia in northern Israel bordering Lebanon shows smoke billowing above the southeast Lebanese village of Mays al-Jabal during an Israeli bombardment on May 5, 2024.\n(Ayal Margolin/JINI via Xinhua)BEIRUT, May 5 (Xinhua) -- Four people were killed and three others were injured on Sunday in an Israeli airstrike on the southeast village of Mays al-Jabal, Lebanese military sources told Xinhua.\nMeanwhile, the Lebanese armed group Hezbollah said its fighters targeted the northern Israeli city of Kiryat Shmona with dozens of rockets in retaliation to Israeli strikes in southern Lebanon without specifying the casualties.\nA Lebanese military source told Xinhua that about 20 surface-to-surface missiles were launched from southern Lebanon toward northern Israel, some of which were intercepted by Israeli Iron Dome missiles.\n■This photo taken from Kibbutz Malkia in northern Israel bordering Lebanon shows smoke billowing above the southeast Lebanese village of Mays al-Jabal during an Israeli bombardment on May 5, 2024.", "location": "Mays al-Jabal", "classification": "security", "score": 0.9933883777031085, "event_breakdown": "- Israeli airstrike on the southeast village of Mays al-Jabal\n- Four people killed and three others injured in the airstrike\n- Hezbollah fighters targeting the northern Israeli city of Kiryat Shmona with rockets\n- Retaliation by Hezbollah to Israeli strikes in southern Lebanon\n- Launch of approximately 20 surface-to-surface missiles from southern Lebanon towards northern Israel \n- Some of the missiles intercepted by Israeli Iron Dome missiles"}, {"id": "918e8850-967a-4a3b-b41c-3843aec031fe", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://www.yahoo.com/news/latest-israeli-military-orders-evacuation-081150261.html", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nISRAEL SAYS IT WILL KEEP UP MILITARY OPERATIONS IN GAZA AS OFFICIALS CONSIDER HAMAS CEASE-FIRE PROPOSALJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nISRAELI OFFICIAL WARNS THAT HAMAS CEASE-FIRE PROPOSAL DOES NOT MEET ISRAELI FRAMEWORKJERUSALEM -- An official familiar with Israeli thinking says Israeli officials are examining the cease-fire proposal approved by Hamas.", "location": "RAFAH", "classification": "security", "score": 0.896804087295191, "event_breakdown": "- Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack\n- Israeli military conducts targeted strikes against Hamas in Rafah\n- Israel will keep up military operations in Gaza as officials consider Hamas cease-fire proposal\n- Israeli official warns that Hamas cease-fire proposal does not meet Israeli framework"}, {"id": "3b28d5fa-15dd-4e3b-9394-344618d61245", "title": "IDF strikes Hezbollah - Radwan base after drone strike on Metula", "date": "2024-05-06 13:00", "url": "https://www.ynetnews.com/article/s1joamlmc", "message": "The Iran-backed terror group fired a barrage of at least 30 rockets at the Golan Heights, in response to the overnight strike on a Hezbollah base deep inside Lebanon, where at least three people were injured, claiming to aim for a military position there.", "location": "Golan Heights", "classification": "security", "score": 0.9898011445093401, "event_breakdown": "Here are the events in the provided text:\n\n- The Iran-backed terror group launches a barrage of at least 30 rockets at the Golan Heights.\n- The rocket attack is in response to an overnight strike on a Hezbollah base deep inside Lebanon.\n- The strike in Lebanon results in at least three people being injured, with claims of targeting a military position."}, {"id": "e0d65c71-ec31-4cdf-ae76-a825b44b03bb", "title": "  Radicalised  teenager shot dead by police after stabbing man in the back in Australia", "date": "2024-05-05 10:00", "url": "https://www.independent.co.uk/news/world/australasia/perth-australia-teenager-shot-dead-b2539883.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian city of Perth.\nHe was shot dead after Tasers failed to subdue him and he lunged towards officers while armed with a knife.\nI also want to commend the local Muslim community who had flagged the individual prior with the police,” he added.\nThe 40-year-old attacker in the mall attack was shot dead by police, who have yet to reveal the man’s motive.", "location": "", "classification": "security", "score": 0.9019061572218047, "event_breakdown": "- A 16-year-old boy armed with a knife was shot dead by police in Perth, Australia, after stabbing a man.\n- The boy was shot dead after Tasers failed to subdue him and he lunged towards officers while armed with a knife.\n- The local Muslim community had flagged the individual to the police prior to the incident.\n- A 40-year-old attacker in a mall attack was shot dead by police in an unknown location."}, {"id": "ba9c396d-b282-4713-b09d-405beae4b12f", "title": "Elevator Damaged In Poltava Region Due To Missile Attack", "date": "2024-05-05 19:45", "url": "https://menafn.com/1108175771/Elevator-Damaged-In-Poltava-Region-Due-To-Missile-Attack", "message": "(MENAFN- UkrinForm) An elevator in the Poltava region was damaged by a Russian missile attack.\nThe head of the Poltava Regional Military Administration, Philip Pronin, reported this on Telegram , according to Ukrinform.\nA missile strike damaged an elevator in the Poltava community,” he said.\nInjury toll in Russian missile strike onregion rises to 16According to Pronin, there were no casualties.\nThe RMA confirmed the sounds of an explosion in the Poltava region.", "location": "Poltava", "classification": "security", "score": 0.8281786118933321, "event_breakdown": "The events reported in the text are as follows:\n\n- Russian missile attack damages an elevator in the Poltava region, Ukraine.\n- Head of the Poltava Regional Military Administration, Philip Pronin, reports the damage on Telegram, according to Ukrinform.\n- Pronin confirms no casualties from the missile strike.\n- Regional Military Administration confirms sounds of an explosion in the Poltava region."}, {"id": "c29ebb0a-598b-4e9d-9bf6-29dea5cd0ac0", "title": "Hamas attack on aid crossing that killed Israeli troops", "date": "2024-05-06 01:30", "url": "https://www.dailymail.co.uk/news/article-13385905/Hamas-attack-aid-crossing-killed-Israeli-troops-leaves-peace-hopes-tatters.html", "message": "A Hamas attack on an aid crossing that killed Israeli troops was last night branded proof that the terror group is using Palestinians as 'human shields', dashing hopes for an end to the violence in Gaza.\nThe escalation came as the latest round of ceasefire talks were 'near to collapse', with Israeli Prime Minister Benjamin Netanyahu flatly ruling out any end to the war.\nTen rockets were launched from close to civilian shelters in southern Gaza towards the Kerem Shalom crossing yesterday – killing three soldiers and injuring 11, the Israeli military said.\nBut Hamas sources insisted the target was an Israeli military base and denied using civilians as human shields.\nIt came as talks between Hamas negotiators and Egyptian and Qatari mediators in Cairo threatened to break down.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.9714955760515206, "event_breakdown": ""}, {"id": "e125afcf-4e66-452d-ab19-9bfd3377f166", "title": "Hezbollah responds to deadly Israeli strike on south Lebanon", "date": "2024-05-06 12:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240505-irna04.htm", "message": "Hezbollah responds to deadly Israeli strike on south LebanonIRNA - Islamic Republic News AgencyMay 5, 2024Tehran, IRNA -- Lebanon's Hezbollah resistance movement has launched rockets towards northern Israeli-occupied territories after at least two civilians were killed when the Israeli regime hit a border village in southern Lebanon.\nThe Israeli military said on Sunday that sirens were sounding in Kiryat Shmona and other parts of northern occupied territories following the rocket attack by Hezbollah.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nZionist media sources also announced that several Zionists were injured following Hezbollah's attack with 65 rockets.\nSince October 8, a day after the Israeli regime launched its genocidal war on Gaza, Hezbollah and the Israeli military have traded fire across the border on an almost daily basis.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9792180740131913, "event_breakdown": "The events reported in the text are as follows:\n\n- Hezbollah launches rockets toward northern Israeli-occupied territories after Israeli airstrike kills at least two civilians in a border village in southern Lebanon.\n- Israeli military reports sirens sounding in Kiryat Shmona and other parts of northern Israeli-occupied territories following the rocket attack by Hezbollah.\n- Zionist media sources report several Zionists injured after Hezbollah's attack with 65 rockets.\n- Since October 8, Hezbollah and the Israeli military have been exchanging fire across the border almost daily."}, {"id": "6a84fe18-ae62-4969-b476-d664ccacbcaa", "title": "Hezbollah attacks Israel after deadly south Lebanon strike", "date": "2024-05-06 04:00", "url": "https://dunyanews.tv/en/World/809697-Hezbollah-attacks-Israel-after-deadly-south-Lebanon-strike", "message": "Hezbollah attacks Israel after deadly south Lebanon strikeWorld World Hezbollah attacks Israel after deadly south Lebanon strikeIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire.\nFighting has intensified in recent weeks, with Hamas ally Hezbollah stepping up its attacks on northern Israel, and the Israeli military striking deeper into Lebanese territory.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nIt also said \"fighter jets struck Hezbollah military structures and terrorist infrastructure\" in several areas of southern Lebanon.\nHezbollah has repeatedly declared that only a ceasefire in Gaza will end its attacks on Israel, which it says are in support of Gazans and Hamas.", "location": "", "classification": "security", "score": 0.9740135152182403, "event_breakdown": "- Israel and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire\n- Hezbollah stepped up its attacks on northern Israel\n- The Israeli military struck deeper into Lebanese territory\n- A Lebanese security source confirmed the strike killed \"four civilians\"\n- Fighter jets struck Hezbollah military structures and terrorist infrastructure in several areas of southern Lebanon"}, {"id": "4e6139f6-780c-4e8a-a77b-7ce02ef5f2f5", "title": "Teen shot dead by police blows up toilet with homemade bomb", "date": "2024-05-07 03:30", "url": "https://www.perthnow.com.au/news/teen-shot-dead-by-police-blows-up-toilet-with-homemade-bomb-c-14574103", "message": "Footage has resurfaced of the Perth teenager shot dead by police using a homemade explosive to blow up a school toilet two years earlier.\nIn the video, students are left screaming and laughing following the explosion inside Rossmoyne Senior High School in Perth.\nREAD NOWCamera Icon The 16-year-old was shot by police after a carpark stabbing.\nSupplied Credit: NCA NewsWireCamera Icon The Rossmoyne Senior High School student had been enrolled in a deradicalisation program.\nCamera Icon The 16-year-old boy blew up a school toilet with a homemade explosive device.", "location": "Perth, Australia", "classification": "security", "score": 0.9700914613138167, "event_breakdown": "1. A Perth teenager was shot dead by police after a carpark stabbing.\n2. Footage resurfaced showing the teenager using a homemade explosive to blow up a school toilet at Rossmoyne Senior High School in Perth.\n3. Students were left screaming and laughing following the explosion inside the school.\n4. The 16-year-old boy who was shot had been enrolled in a deradicalisation program."}, {"id": "9341d409-efba-4e70-b70e-3f9f2a2ba955", "title": "Combat Terrorism in Poonch - Rajouri", "date": "2024-05-06 04:00", "url": "https://www.dailyexcelsior.com/combat-terrorism-in-poonch-rajouri/", "message": "The martyrdom of Vicky Pahade underscores the urgent need for a concerted and unified effort to combat terrorism in the troubled region.\nDespite concerted efforts by security forces, terrorists continue to find ways to perpetrate violence and sow fear among civilians by attacking security personnel.\nHowever, these cowardly acts won’t dampen the resolve of security forces, who vow to respond effectively.\nGiven the varied terror activities across different districts, security forces must reassess their strategies to counter evolving threats.\nAttacks on security forces cannot be tolerated, and the public’s cooperation in providing vital information is essential.", "location": "districts", "classification": "security", "score": 0.8290469359618707, "event_breakdown": "1. The martyrdom of Vicky Pahade in a terrorist attack\n2. Continued attacks by terrorists on security personnel despite efforts to combat terrorism\n3. Security forces remaining resolved to respond effectively to terrorist attacks\n4. The need for security forces to reassess their strategies due to varied terror activities across different districts\n5. The importance of public cooperation in providing vital information to combat attacks on security forces."}, {"id": "5085f113-d03a-46db-b9d4-e70b1ed0c87c", "title": "Lebanon Hezbollah says fired dozens of rockets at Israeli base", "date": "2024-05-06 11:45", "url": "https://www.philstar.com/world/2024/05/06/2353097/lebanons-hezbollah-says-fired-dozens-rockets-israeli-base", "message": "BEIRUT, Lebanon — The Iran-backed Hezbollah group said it fired \"dozens of Katyusha rockets\" at an Israeli base in the occupied Golan Heights on Monday in retaliation for a strike in Lebanon's east.\nEarlier, Lebanese official media said three people had been wounded in an Israeli strike early Monday in the country's east, with the Israeli army saying it had struck a Hezbollah \"military compound\".\nIsrael and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\".\nLast month, a building in Sifri was targeted in an Israeli raid, according to a source close to Hezbollah, while the Israeli army said it had targeted Hezbollah sites in Lebanon's east.", "location": "Safri", "classification": "security", "score": 0.9752655696157615, "event_breakdown": "- Hezbollah fired dozens of Katyusha rockets at an Israeli base in the occupied Golan Heights\n- Three people were wounded in an Israeli strike in Lebanon's east\n- Israeli army struck a Hezbollah \"military compound\" in Lebanon\n- Israeli warplanes struck a Hezbollah military structure deep inside Lebanon in a location referred to as \"Safri\"\n- Previous Israeli raid targeted a building in Sifri in Lebanon, according to a source close to Hezbollah"}, {"id": "7fb63747-7710-41d7-8676-00ee77c9f8b4", "title": "Iran IRGC Terrorists Sail Warship into Southern Hemisphere", "date": "2024-05-07 03:30", "url": "https://www.breitbart.com/middle-east/2024/05/06/irans-irgc-terrorists-sail-warship-into-southern-hemisphere/", "message": "Iran announced that Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\nThe Shahid Mahdavi is on a “long-distance mission” in international waters, the Iranian state-owned PressTV propaganda outlet reported.\nIranian state media claimed that the warship was “conducting its biggest mission in terms of distance and operation,” without specifying further.\nIran's IRGC Navy floating base Shahid Mahdavi used as mobile platform at sea to launch ballistic missiles.\nDezful medium-range ballistic missile launched from 40-foot containers on the deck of the Shahid Mahdavi.", "location": "Southern Hemisphere", "classification": "security", "score": 0.3213328453789115, "event_breakdown": ""}, {"id": "a5f3fbbe-6bb6-46ac-b400-e8d10c5b1cff", "title": "Hezbollah Says Launches Dozens Of Rockets At Israeli Base In Retaliation", "date": "2024-05-06 13:45", "url": "https://www.ndtv.com/world-news/hezbollah-says-launches-dozens-of-rockets-at-israeli-base-in-retaliation-5601556", "message": "(File)Lebanese official media said an Israeli strike Monday wounded three people in the country's east, with Hezbollah saying it launched \"dozens of Katyusha rockets\" at an Israeli base in retaliation.\nIsrael and Lebanon's Hezbollah have exchanged regular cross-border fire since Palestinian combatant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\nIn recent weeks Hamas-ally Hezbollah has stepped up its attacks on northern Israel, and the Israeli military has struck deeper into Lebanese territory.\nThe Israeli army said its warplanes \"struck a Hezbollah military structure... deep inside Lebanon,\" referring to the location as \"Safri\".\nLast month, a building in Sifri was targeted in an Israeli raid, while the Israeli army said it had targeted Hezbollah sites in Lebanon's east.", "location": "", "classification": "security", "score": 0.9779945560199335, "event_breakdown": "- Israeli strike wounds three people in Lebanon's east\n- Hezbollah launches dozens of Katyusha rockets at an Israeli base in retaliation\n- Regular cross-border fire between Israel and Hezbollah\n- Hamas attack on southern Israel sparks war in Gaza Strip\n- Hezbollah steps up attacks on northern Israel\n- Israeli military strikes deeper into Lebanese territory\n- Israeli warplanes strike Hezbollah military structure in Safri, Lebanon"}, {"id": "6dc5c80c-9530-43c8-ace6-6103fd06176c", "title": "Islamic Jihad commander killed in Rafah , says Israeli army", "date": "2024-05-05 09:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/islamic-jihad-commander-killed-in-rafah-says-israeli-army/articleshow/109852449.cms", "message": "NEW DELHI: A top commander of the Islamic Jihad Rafah Brigade who commanded the Islamic Jihad's elite forces during October 7 attack was killed in an airstrike on Rafah, the Israel Defense Forces (IDF) announced on Saturday, Xinhua news agency reported.Aiman Zaarab \"commanded and directed\" the Islamic Jihad's special soldiers during the October 7 attack on Kibbutz Sufa and the Sufa military post on the Gaza Strip's border.He also led multiple strikes and had been leading the Islamic Jihads' preparations for a battle against the Israeli forces in the southern Gaza Strip in recent days, according to the statement.In addition to Zaarab, two additional Islamic Jihad operatives were killed during the operation, according to the IDF.Meanwhile, Hamas has said that it would not agree to any Gaza ceasefire that does not involve a complete end to the war.Calling Israeli PM Netanyahu's stance on sending ground soldiers into Rafah as the main stumbling point in ceasefire talks, Hamas official said, \"We are eager to reach an agreement, but not at any cost,\" further adding \"full responsibility for insisting on entering Rafah instead of ceasing the aggression\".", "location": "Rafah", "classification": "security", "score": 0.93590586052842, "event_breakdown": ""}, {"id": "90bc9908-12c2-4ec2-9652-4c17b5491ab0", "title": "The Latest | Israeli military orders evacuation of parts of Rafah ahead of possible ground invasion", "date": "2024-05-06 09:00", "url": "https://abcnews.go.com/International/wireStory/latest-israeli-military-orders-evacuation-parts-rafah-ahead-109948804", "message": "Hours earlier, the Hamas militant group announced it had accepted a cease-fire proposal brought forward by mediators Egypt and Qatar.\n— Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\nThe Israeli military said it was conducting “targeted strikes” against Hamas in Rafah without providing details.\nJERUSALEM — Israel will keep carrying out operations in Gaza as officials deliberate over a cease-fire proposal approved by Hamas, an Israeli military spokesperson says.\nRAFAH, Gaza Strip -- The United Nations agency serving Palestinian refugees says it will not comply with an Israeli military order to evacuate parts of the southern Gaza city of Rafah.", "location": "The main location where the main event takes place is **Rafah**.", "classification": "security", "score": 0.9147268901561623, "event_breakdown": "- Hamas accepts cease-fire proposal for Gaza, after Israel orders Rafah evacuation ahead of attack.\n- Israeli military conducting \"targeted strikes\" against Hamas in Rafah without providing details.\n- Israel to continue operations in Gaza as officials deliberate over Hamas-approved cease-fire proposal.\n- United Nations agency serving Palestinian refugees refuses to comply with Israeli military order to evacuate parts of Rafah, Gaza Strip."}]