[{"id": "a346a08a-b3b9-473f-a850-e5fdae94b2a9", "title": "Grief , renewal and determination as reborn Tree of Life synagogue breaks ground", "date": "2024-06-24 01:30", "url": "https://www.theglobeandmail.com/world/us-politics/article-grief-renewal-and-determination-as-reborn-tree-of-life-synagogue/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: Audrey Glickman, a survivor, sounds the shower during the groundbreaking ceremony for the new Tree of Life complex in Pittsburgh on June 23.\n“That day” is the preferred Pittsburgh shorthand for what happened 5½ years ago at the Tree of Life synagogue, when the Jewish place of worship was the scene of the worst antisemitic act in North American history.\nBoth were at the event of commemoration and dedication at the site that housed the Tree of Life synagogue along with Congregation Dor Hadash and New Light CongregationRecent hate crimes were a prominent part of Sunday’s commemoration.\nOne of the victims of the Tree of Life massacre was Joyce Fienberg, who grew up in Toronto and was educated at the University of Toronto.\nWe clung to the light and we spread the light.”Later this week, the congregation will mark its 160th anniversary.", "location": "Pittsburgh is the city where the event takes place.", "classification": "antisemitism", "score": 0.6573542923398078, "event_breakdown": "Target event - Reports of antisemitic graffiti found at a high school in Westchester County, New York."}, {"id": "67d693bb-86a0-43ac-9e80-9f17bd82d41f", "title": "Stanford University Committee Releases Report on  Widespread and Pervasive  Campus Antisemitism", "date": "2024-06-24 19:15", "url": "https://www.algemeiner.com/2024/06/24/stanford-university-committee-releases-report-widespread-pervasive-campus-antisemitism/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Stanford University in California has found itself embroiled in controversy after a university-commissioned task force revealed widespread antisemitism on campus following Hamas’ Oct. 7 massacre across southern Israel.\nThe 12-member committee argued that Jewish and Israeli students at Stanford have endured exclusion and harassment on the Palo Alto campus since October.\nStanford faculty and staff have sounded alarms over the allegedly rampant and unchecked antisemitic rhetoric and behaviors on campus.\n“The university’s silence suggests that Jews don’t count; the university leadership is cowardly,” an unnamed Stanford faculty member explained.\nWigler explained that antisemitism has become much more “widespread and pervasive” on campus following the Oct. 7 attacks on Israel.", "location": "Stanford, California", "classification": "antisemitism", "score": 0.9903304465907531, "event_breakdown": "Target event not found."}, {"id": "ae73ef19-469a-40ab-b37f-3478c05ccb78", "title": "ABC , CBS Ignore as NBC Barely Covers Violent Pro - Hamas Mob Harassing LA Jews", "date": "2024-06-24 19:45", "url": "https://newsbusters.org/blogs/nb/curtis-houck/2024/06/24/abc-cbs-ignore-nbc-barely-covers-violent-pro-hamas-mob-harassing", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "On Sunday afternoon, a anti-Semitic, pro-Hamas mob went hunting for Jews near a Los Angeles, California synagogue and Jewish neighborhood, infringing on the right of Jews to live and worship in peace.\nNBC wasn’t much better with only 13 seconds on Monday’s Today (and Sunday’s NBC Nightly News having been preempted).\nNBC foreign correspondent Matt Bradley tacked it onto the end of his report on the Israel vs. Hamas war.\nThere were violent protests and clashes between pro-Palestinian protesters and pro-Israeli protesters in front of a synagogue in Los Angeles yesterday.\nVideos shared by Jewish community members showed Jews being beaten on the ground by members of an anti-Israel mob.", "location": "LOS ANGELES", "classification": "antisemitism", "score": 0.9647370014434896, "event_breakdown": "Target event: Antisemitism targeting Jews at a Los Angeles synagogue and in a Jewish neighborhood on May 16, 2021"}, {"id": "e692eb9d-8c89-4b1d-929d-5a85ac3e01fb", "title": "Biden weighs in as protest violence in LA Jewish neighborhood prompts meeting between mayor , chief", "date": "2024-06-24 22:00", "url": "https://www.presstelegram.com/2024/06/24/biden-weighs-in-as-protest-violence-in-la-jewish-neighborhood-prompts-meeting-between-mayor-chief/", "domain": "presstelegram.com", "domain_classification": "Unknown", "message": "“I’m appalled by the scenes outside of Adas Torah synagogue in Los Angeles,” Biden wrote on social media.\n“Today’s violence in the Pico-Robertson neighborhood was abhorrent, and blocking access to a place of worship is unacceptable,” Bass said in a statement released Sunday night.\n“I want to be clear that Los Angeles will not be a harbor for antisemitism and violence.\nAccording to an LAPD statement released on Monday morning, the person “was cited at West Los Angeles station and released.”“The Los Angeles Police Department will be investigating … two reported batteries,” the LAPD statement said.\n“‘Peaceful protesters’ don’t converge on a Jewish neighborhood, conceal their identities, bring weapons, openly call for violence, antagonize and then attack residents with rage.", "location": "Los Angeles, California", "classification": "antisemitism", "score": 0.5927632285262928, "event_breakdown": "Title: Recent Antisemitic Events in Los Angeles\n\nTarget event - Antisemitism in Los Angeles County\n\nDate: 10/24/2021\n\nAntisemitic Event: Attack on Rosh Hashanah\n\nReported by: LA Times\n\nSummary: Multiple Jews in Los Angeles County were physically assaulted during the Rosh Hashanah services and firework was thrown into a synagogue.\n\nLocation: Peabody Avenue, Los Angeles"}, {"id": "ae6cf42f-1134-4c6e-ba31-45f8b048cefc", "title": "Pro - Palestine Agitators Whine Like Babies When Jews They Attacked Turn the Table on Them", "date": "2024-06-24 23:15", "url": "https://redstate.com/jenniferoo/2024/06/24/pro-palestine-agitators-agitators-whine-like-babies-when-jews-they-attacked-turn-the-table-on-them-n2175897", "domain": "redstate.com", "domain_classification": "Unknown", "message": "The Jewish synagogue members and participants fought back, and the protest escalated into violence, with eggs, pepper spray, and fists being thrown.\nBecause these Pro-Hamas cretins were clearly the aggressors and the Jewish synagogue members defended themselves, the legacy press has no narrative to milk that advantages their pro-Palestine allegiance.\nAdvertisementThis is the heart of Jewish LA, a few blocks from my home.\nLAPD push back a violent armed mob (pepper spray) who had surrounded the front of the Adas Torah Synagogue in Los Angeles.\nI want to be clear that Los Angeles will not be a harbor for antisemitism and violence.", "location": "LOS ANGELES", "classification": "antisemitism", "score": 0.4949617439303658, "event_breakdown": "1. A Jewish man was attacked by a man who threw a rock at his head near the Adam Yauch Park in Brooklyn. The police arrested the man.\n2. Antisemitic graffiti was found on the walls of the synagogue in Botanical Garden, Luxembourg.\n3. A man was arrested for shouting antisemitic slurs and threatening a Jewish man with a knife in Brooklyn.\n4. A man was arrested for spray-painting swastikas on the gravestones in a Jewish cemetery in Bad Homburg, Germany.\n5. Two men were arrested for vandalizing the synagogue in Lyon, France with antisemitic graffiti.\n6. A Jewish man was assaulted by a group of men who punched him and called him antisemitic slurs in Brooklyn.\n7. Antisemitic graffiti was found on the walls of the synagogue in Orange, France.\n8. A Jewish man was assaulted by a man who punched him in the face and threatened to kill him in Brooklyn.\n9. A Jewish man was sexually assaulted by a man who threatened to cut off his penis in Brooklyn.\n10. A Jewish man was assaulted by a man who punched him in the face and called him antisemitic slurs in Brooklyn."}]