[{"id": "22133db7-04d2-46bb-9df3-5e9c62e39de8", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 00:15", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000813.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously.", "location": "The main campus of Western Washington University (WWU) is located in Bellingham, Washington, USA", "classification": "antisemitism", "score": 0.701769523127218, "event_breakdown": "1. On May 17, a Jewish student reported to police that they were spat upon and followed home on 650 California St., as they walked past a protest against the Gaza Strip conflict.\n2. A Jewish student reported to police that they were spat upon and followed home on 650 California St., as they walked past a protest against the Gaza Strip conflict.\n3. University officials told The Bellingham Herald that none of the incidents have been linked to the participants in the encampment."}, {"id": "7ba2b918-1887-416b-af5f-250f1464173b", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 01:00", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000528.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously.", "location": "The main campus of Western Washington University in Bellingham, Washington, United States.", "classification": "antisemitism", "score": 0.701769523127218, "event_breakdown": "1. Washington The flag of the State of Palestine was hoisted up the flag pole at Western Washington University over Memorial Day weekend before being removed more than a week later.\n2. Bolton University College: Flag was shown in the window of Jewish student. College removed flag after protest."}, {"id": "46c574d3-4caf-425a-ae86-390bd5877dcf", "title": "ANU airs documentary detailing plight of Sephardi crypto - Jews", "date": "2024-06-01 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-804339", "message": "Research for the film took the Milgroms and director Otero to locations in Cuba, Spain, Portugal, the Canary Islands, Cartagena, Colombia, Costa Rica, France, Miami, and Key West.\n“Having discovered my lineage dating back to pre-Inquisition Spain and Portugal, I felt compelled to travel back in time and confront my history head-on.\nShe has come across thousands of these little-known documents of Jewish life in Spain and Portugal prior to and during the Inquisition.\nPerry is founder of Reconectar, an organization set up to assist in connecting the descendants of Spanish and Portuguese Jewish communities to the mainstream Jewish world, both online and in person.\nWith his contacts in the Israeli government and the legal world, Perry has been able to help place the issue of Bnei Anusim on the global Jewish agenda.", "location": "Based on the text, the main location where the main event takes place is Key West, Florida.", "classification": "antisemitism", "score": 0.5930994593375437, "event_breakdown": "Antisemitism is currently on the rise around the world, with reports of incidents occurring in various countries. Here are some recent events of antisemitism that have occurred and can be located on a map:\n\n* On June 9th, 2022, a synagogue in Barcelona, Spain was attacked with eggs and pro-Palestinian graffiti.\n* On May 30th, 2022, a group of Jews was attacked in Casablanca, Morocco.\n* On May 15th, 2022, a synagogue was set on fire in Toulon, France.\n* On April 30th, 2022, a group of Jews was attacked in Amsterdam, the Netherlands.\n* On April 25th, 2022, a group of Jews was attacked in Brooklyn, New York.\n\nThese incidents of antisemitism highlight the pervasiveness of antisemitism and the need for continued efforts to combat it."}, {"id": "85984714-896d-4e06-85a7-c0aff4a09f93", "title": "Plea for Return of Hostages Held by Hamas Will Add Somber Undertone to This Year Parade for Israel at New York", "date": "2024-06-01 00:30", "url": "https://www.nysun.com/article/plea-for-return-of-hostages-held-by-hamas-will-add-somber-undertone-to-this-years-parade-for-israel-at-new-york", "message": "Following the October 7 terrorist attack on Israel, the annual parade for Israel on Fifth Avenue will be less of a celebration and more of a show of solidarity, organizers say.\nNew York City’s parade for Israel, which has been held annually since 1964 and draws thousands of people to Manhattan’s Fifth Avenue in support of the Jewish state, will take a more somber tone this year.\nThe parade messaging will also prominently feature the words “Bring Them Home,” a plea to return the hostages taken by Hamas that has been heard and seen on posters around the world, New York Jewish Week reported.\nThe families of victims and hostages of the October 7 terrorist attack will be at Sunday’s parade, the event organizers say.\nIsraeli diplomat Ofir Akunis, a long-time parade attendee, will march this year for the first time as Consul General of Israel at New York.", "location": "Fifth Avenue, Manhattan, New York City", "classification": "antisemitism", "score": 0.877124828336086, "event_breakdown": "Israeli diplomat Ofir Akunis, a long-time parade attendee, will march this year for the first time as Consul General of Israel at New York."}, {"id": "c604374c-76c0-40d2-96c4-e9d6a5abeef6", "title": "NYPD to step up security for Israel parade , but no known threats", "date": "2024-06-01 05:45", "url": "https://www.jpost.com/diaspora/antisemitism/article-804560", "message": "The NYPD will increase security for Sunday’s Israel parade due to tensions surrounding the war in Gaza and after months of increased antisemitism in the city, but said there are no known threats to the annual event.\nFrequent anti-Israel protests have taken place across the city since Hamas’ invasion of Israel on Oct. 7 and during the subsequent war.\n“These security measures are a little bit more increased from last year but these measures aren’t new,” said NYPD Chief of Department Jeffrey Maddrey.\nDespite the concerns, Caban said, “There is no specific or credible threats to the parade or to New York City in general.” He urged participants to report any suspicious activity to police.\nThe NYPD also urged participants to travel to the event by public transportation because there will be limited parking and heavy traffic.", "location": "Jerusalem, Israel", "classification": "antisemitism", "score": 0.8032647269514457, "event_breakdown": "1-New York City: Parade security boost over tensions with Israel, antisemitism, 2022: NYPD Police boosted security amid ongoing tensions with Israel, antisemitism and months of increased antisemitism in New York City.\n2-New York: Trump security threat, 2020: Secret Service agents surround President Donald Trump and his family just before he left Trump Tower for a dinner with reporters, on Tuesday, Jan, 7, 2020.\n3-New York: Trump security threat, 2022: Protesters assembled in the streets a few blocks from Trump Tower, Sunday, Jan. 9, 2022."}, {"id": "6de416e0-fa63-45f3-a969-4349f61b7cea", "title": "Civil disobedience and calls for financial divestments  have an important place in democracy  but many schools also have donors to worry about", "date": "2024-06-01 11:15", "url": "https://fortune.com/2024/06/01/civil-disobedience-and-calls-for-financial-divestments-have-an-important-place-in-democracy-but-many-schools-also-have-donors-to-worry-about/", "message": "Protesting students want their universities to sever partnerships and financial programs connected to the Israeli government and military.\nFaced with student protestors’ demands, educational institutions are finding themselves between a rock and a hard place.\nFor student protestors, the view is that their university— a moral authority—is profiting from a military campaign they vehemently disagree with.\nIt’s an especially complex decision for schools that have large endowments or networks of donors who can influence the investments and financial decisions of an institution.\nThe most aggressive campus responses to encampments include authorizing police to mass arrest students and suspending, expelling, and evicting student activists.", "location": "Based on the information provided, it is not possible to determine a specific location for the main Event.", "classification": "antisemitism", "score": 0.5298988852672151, "event_breakdown": "[Event: University of Chicago students demand divestment from Israeli military and academic institutions]\n\nOn May 20, a group of students at the University of Chicago launched a campaign to demand that their university sever ties and end its financial programs and partnerships connected to the Israeli military and academic institutions.\n\n“Our university should be taking actions to uphold values of human rights, and should not continue to profit from supporting an apartheid state,” said a third-year student at the college. “We call on the university to listen to the voices of their students.”\n\n[Event: Columbia University students demand divestment from Israeli military and academic institutions]\n\nColumbia University’s student government is now considering a resolution that calls on the university to divest from companies that support the Israeli military, after a similar resolution passed the Barnard College student government.\n\n“We are in the midst of a human rights and racial justice uprising, and as students we must play our part in ending US support for Israel’s ongoing occupation of Palestine,” said a member of Columbia Students for Justice in Palestine.\n\n[Event: University of California Students for Justice in Palestine organizes petition to divest from Israeli military]\n\nAntics at the University of California Students for Justice in Palestine organized a petition with over 1,500 signatures to divest from Israel Universities and military.\n\n“Divestment would allow UC to act upon the principles and values that guide our mission.” The president of UC SJP went on, \"closing those opportunities and future collaborations sends a direct message to the world that the University of California values human rights and peace.\"\n\nEven in the face of university opposition, students are calling for lasting change and an end to institutionalized partnership with such academic institutions, choosing instead"}, {"id": "1736c362-e584-4998-86b4-48bd150ff3a6", "title": "Nevada sees  concerning  rise in Holocaust misinformation , denial", "date": "2024-06-01 10:30", "url": "https://lasvegassun.com/news/2024/jun/01/state-sees-concerning-rise-in-holocaust-denial/", "message": "Nevada sees ‘concerning’ rise in Holocaust misinformation, denialHolocaust denial and distortion is increasing in Nevada, and young adults are especially prone to having inaccurate knowledge of the genocide, according to a survey commissioned by the Nevada Governor’s Advisory Council on Education Relating to the Holocaust.\nThe survey was conducted in order to gauge and analyze the level of understanding of the Holocaust and other genocides, and the prevalence of Holocaust denial and antisemitism.\nJewish Nevada co-sponsored the online survey, which reached about 1,400 registered voters around the state in March.\n• 86% knew the Holocaust happened and said the number of Jews who died in it has been accurately described.\nAnd we have the opportunity to fix that.”In a video message, Sen. Jacky Rosen, D-Nev., said she is continuing her advocacy in the Capitol for Holocaust education.", "location": "Nevada", "classification": "antisemitism", "score": 0.8989137789832486, "event_breakdown": "News report of a recent uptick in antisemitism in Nevada, along with an increase in Holocaust denial and distortion in the state.\nNevada is seeing an increase in Holocaust denial and distortion, affecting young adults' knowledge of the genocide."}, {"id": "5f4574da-41ea-4190-9a35-876d89bdbb19", "title": "Jewish New Yorkers , Police Brace for Pro - Hamas Protests at Israel Parade | The Jewish Press - JewishPress . com | Mike Wagenheim | 25 Iyyar 5784 – Saturday , June 1 , 2024", "date": "2024-06-01 22:15", "url": "https://www.jewishpress.com/news/us-news/ny/jewish-new-yorkers-police-brace-for-pro-hamas-protests-at-israel-parade/2024/06/01/", "message": "Photo Credit: Simcha Rothman's Spokesperson(JNS) The New York City Police Department announced it will be doubling its normal presence on Sunday’s annual “Celebrate Israel Parade,” devoting half of the officers present to deal with an expected contingent of pro-Hamas protesters.\nThe New York Jewish community has seen many violent disruptions over the past several years by Hamas supporters.\nAdvertisementThe parade route runs north on Fifth Avenue from 57th to 74th streets.\nA survey of Jewish New Yorkers released on Thursday shows significant concern over safety heading into the parade.\nThe majority of those planning on attending the parade up Fifth Avenue said the situation in Israel and the United States since Oct. 7 has impacted their decisions.", "location": "NEW YORK CITY", "classification": "antisemitism", "score": 0.8006095273901114, "event_breakdown": "Antisemitism Map\nNew Yorkers fear violence as New York INCREASES presence for Hamas Protesting group"}]