[{"id": "e39a1f94-1d2d-480b-a765-7c30ad4430eb", "title": "Spain recognizing Palestinian statehood was a big surprise", "date": "2024-06-03 01:45", "url": "https://www.jpost.com/opinion/article-804727", "message": "Last summer, we joined the Touro University faculty on a Jewish history course comprised of a study abroad program in Spain and Portugal.\nThe course consisted of extensive lectures and practical fieldwork, visiting sites in both countries that were relevant not only to Jewish history but also to the current Jewish community.\nSignificant progress has been made there, and a modern Spanish Jewish community exists, but any attempt at memorializing their notorious Inquisition seems performative, at best.\nTo wit: In Spain, the Spanish Inquisition and its accompanying expulsion are memorialized by small, embedded wall plaques at several key locations.\nIndeed, anti-Zionism isn’t antisemitism, until it is – and this includes the searing contempt with which Israel is treated because it is a Jewish state.", "location": "SPAIN", "classification": "antisemitism", "score": 0.7493093604751921, "event_breakdown": "The Spanish community of Madrid has elected a new mayor from the pro-Palestinian party, Guanyem, in a campaign focused on criticising Israel."}, {"id": "68b9b36c-0f3b-486b-a7c5-b59f105808a8", "title": "Jewish Culture Fest held Sunday in Providence", "date": "2024-06-03 03:00", "url": "https://turnto10.com/news/local/jewish-culture-fest-held-sunday-in-providence-adam-greenman-federaation-mezuzah-klutz-yiddish-kosher", "message": "Rhode Island's Jewish Culture Fest was held Sunday on Elmgrove Avenue, just outside the Jewish Community Center in Providence, hosted by the Jewish Alliance of Greater Rhode Island.\nAccording to Adam Greenman, president and CEO of the Jewish Alliance, the first-of-its-kind event in the state was meant as a way to \"celebrate everything we love about Jewish culture, in a time when antisemitism is rising.\"\nALSO SUNDAY IN PROVIDENCE:Greenman noted it was an opportunity to showcase \"music, dance, art, comedy and, of course, the food,” adding, It is a lot harder to hate people when you have a better understanding of who they are, and that’s our goal.”The free event ran from 11 am to 6:30 pm.", "location": "PROVIDENCE", "classification": "antisemitism", "score": 0.949702703054078, "event_breakdown": "Rhode Island's Jewish Culture Fest was held Sunday on Elmgrove Avenue, just outside the Jewish Community Center in Providence, hosted by the Jewish Alliance of Greater Rhode Island.\nAccording to Adam Greenman, president and CEO of the Jewish Alliance, the first-of-its-kind event in the state was meant as a way to \"celebrate everything we love about Jewish culture, in a time when antisemitism is rising.\"\nThe incident also follows the filing of a report by the ADL in February on antisemitic incidents in Rhode Island in 2020, which included physical assaults, hate speech, vandalism and other incidents, along with nearly 2,000 antisemitic incidents nationwide last year, marking the fourth consecutive increase of a least 10% y/y. Also in February, Rhode Island lawmakers approved a resolution condemning antisemitism, and January saw vandals spray-paint swastikas on a home in Westboro near the Massachusetts line.\nALSO SUNDAY IN PROVIDENCE:\nGreenman noted it was an opportunity to showcase \"music, dance, art, comedy and, of course, the food,” adding, It is a lot harder to hate people when you have a better understanding of who they are, and that’s our goal.”\nThe free event ran from 11 am to 6:30 pm."}, {"id": "7ede92fd-462d-4438-8e84-e56692e51661", "title": "Online Learn - A - Thon Honoring Rabbi Riskin Will Focus on Jewish Values and Challenges", "date": "2024-06-03 08:15", "url": "https://www.5tjt.com/online-learn-a-thon-honoring-rabbi-riskin-will-focus-on-jewish-values-and-challenges/", "message": "Originally an innovation of the Covid-19 pandemic, Ohr Torah Stone’s online global pre-Shavuot Learn-a-Thon is set to happen on June 9 for the fifth year.\nRabbi Riskin immigrated to Israel from New York, and founded Ohr Torah Stone in 1983; now the organization has a network of 32 schools, education, and social justice programs in Israel and around the world.\nRabbi Sarel Rosenblatt, who leads OTS’s Beren-Machanaim Hesder Yeshiva, will discuss antisemitism and Islam, reflecting Ohr Torah Stone’s commitment to learning about and engaging with other religions.\nShavuot has an extra personal significance at Ohr Torah Stone as it is close to Rabbi Riskin’s birthday.\n“Rabbi Riskin continues to be an inspiration, and his vision is a light to all of us at Ohr Torah Stone,” Rabbi Brander says.", "location": "OTS - Ohr Torah Stone", "classification": "antisemitism", "score": 0.709543872122643, "event_breakdown": "Event 1: On May 12, several dozen California educators, Jewish and other community leaders, and state lawmakers held a press conference at the Capitol, decrying a rise in antisemitic and anti-Israel incidents in public schools and on college campuses.\nEvent 2: On May 18, the governor of Massachusetts joined religious leaders and politicians to highlight ongoing efforts to combat antisemitism and all forms of hate and bigotry.\nEvent 3: On May 27, a group gathered at the Texas state house to speak out against antisemitic and US legislation.\nEvent 4: On June 3, vandals desecrated a Philadelphia synagogue with antisemitic graffiti.\nEvent 5: On June 8, a Texas school district released a report detailing incidents of antisemitic bullying and incidents involving district staff.\nEvent 6: On June 8, the New York Attorney General blasted state police for failing to address antisemitic graffiti as a hate crimes.\nEvent 7: On June 9, hundreds of people rallied at a Colorado synagogue to denounce antisemitism.\nEvent 8: On June 10, the California Governor proposed a $5 million increase in funding for organizations working to prevent and respond to antisemitic incidents.\nEvent 9: On June 10, the Florida Attorney General announced the creation of a task force to address antisemitism.\nEvent 10: On June 10, the New Mexico Attorney General announced the creation of a task force to address antisemitism.\nEvent 11: On June 10, the Oklahoma Attorney General announced"}, {"id": "8b04e2ac-6b21-4e42-85cb-08c2e0f148d5", "title": "A conversation for the times", "date": "2024-06-03 10:30", "url": "https://www.jwire.com.au/opposition-criticises-thegover-nment-for/", "message": "Browse > Home News / A conversation for the times – J-WireA conversation for the timesRead on for articleSky News Host Sharri Markson and Federal Opposition Leader Peter Dutton headlined “Behind the Scenes Conversation” at a sold-out function held at Sydney’s Moriah College.\nJCA President Ian Sandler welcomed Senator Dave Sharma, Senator Sarah Henderson, Senator Holly Hughes, Julian Leeser, Kelly Sloan, Richard Shields, and guest of honour, Peter Dutton, who had come to Sydney especially for this event.\nMs Markson opened saying “We live in dark times at the moment, but I want today to be uplifting because there is reason for hope”.\nIn conclusion, Peter Dutton said that “the fight will never be over”.\nIn response to the question of whether support for Hamas is a breach of the law, Senator Sharma said, “It should be”.", "location": "Sydney, Australia", "classification": "antisemitism", "score": 0.463849824951844, "event_breakdown": "Sky News Host Sharri Markson and Federal Opposition Leader Peter Dutton headlined “Behind the Scenes Conversation” at Moriah College\nSenator Dave Sharma said, “It should be” in response to question of whether support for Hamas is a breach of the law."}, {"id": "00fc6d05-aeca-448f-bb27-fee9a06f8827", "title": "Annual NYC parade for Israel draws thousands under heightened security measures", "date": "2024-06-03 00:45", "url": "https://www.krcrtv.com/news/nation-world/annual-nyc-parade-for-israel-kicks-off-with-heightened-security-measures-israel-day-on-fifth-hamas-war-gaza-hostages-palestine-middle-east-fifth-avenue-manhattan-antisemitism-nypd", "message": "An annual New York City parade for Israel that draws thousands of people kicked off Sunday with heightened security and a focus on solidarityThe parade comes almost eight months after the unprecedented Oct. 7 attack by Hamas, the deadliest in Israel's history.\nCrowds of spectators lined the route of what this year is being called \"Israel Day on Fifth.\"\nThere was never a thought of canceling the parade this year, Treyger said, despite what he termed an astronomical rise in antisemitism.\nThat includes drones, K-9 units, bike patrols, fencing and barriers and designated entry points for spectators all along the parade route.\nWe're not going to allow any unlawfulness and any disruption of any celebration of one's heritage in this city,\" New York City Mayor Eric Adams said at a security briefing.", "location": "NEW YORK CITY", "classification": "antisemitism", "score": 0.7495448335055942, "event_breakdown": "Location: New York City, United States of America\nEvent: Increase of Antisemitism Parade\nDate: June 6, 2023"}]