[{"id": "2e7e6061-dff3-48ba-a210-dafd9254d6b4", "title": "Israeli tank shells hit tent camp in Rafah killing at least 25 , say Gaza health officials", "date": "2024-06-22 02:30", "url": "https://news.sky.com/story/israeli-tank-shells-hit-tent-camp-in-rafah-killing-at-least-25-say-gaza-health-officials-13156967", "domain": "news.sky.com", "domain_classification": "International", "message": "The International Committee of the Red Cross said the nearby hospital was flooded with casualties after the attack.\nPic: APMona Ashour, who lost her husband, said: \"We were inside our tent when a sound bomb exploded near the Red Cross tents.\n\"Then, a second bomb went off, even closer to the Red Cross door, and people began to gather.\nIsraeli ground offensives and bombardments have killed more than 37,400 people in Gaza, according to the territory's health ministry.\nIsrael launched the war after Hamas's October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people and abducted about 250.", "location": "GAZA", "classification": "security", "score": 0.9677881460457933, "event_breakdown": "Israeli ground offensives and bombardments have killed more than 37,400 people in Gaza and an unknown number in Israel since the war erupted on July 8.\nPic:A full ceasefire was declared on August 26, and fighting has once again erupted in Gaza as Israeli forces prepare for a ground operation."}, {"id": "9a0f8109-c4c2-4e33-abe3-e77c820c0717", "title": "At least 25 killed , 50 wounded in Israeli strikes on tent camps near Rafah , Gaza health officials say", "date": "2024-06-22 01:30", "url": "https://www.nbcnews.com/news/world/least-25-killed-50-wounded-israeli-strikes-tent-camps-rafah-gaza-healt-rcna158391", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip — Israeli forces shelled tent camps for displaced Palestinians outside Gaza’s southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory’s health officials and emergency workers.\nThis was the latest deadly attack in the Gaza Strip, where hundreds of thousands have fled fighting between Israel and Hamas.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nA Palestinian family mourn a loved one killed by Israeli bombardment, before the funeral in Khan Younis, southern Gaza Strip, Friday, on June 21, 2024.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.", "location": "GAZA STRIP.", "classification": "security", "score": 0.9843598503799013, "event_breakdown": "Current events of security reported in text that can be placed on a map (ie, have a specific location) include:\n* Gaza Strip: Israeli forces shelled tent camps for displaced Palestinians outside the Gaza Strip's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers."}, {"id": "fbb84e75-9629-4a92-b391-752f7a3094ee", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say – Metro US", "date": "2024-06-22 01:00", "url": "https://www.metro.us/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say/", "domain": "metro.us", "domain_classification": "Unknown", "message": "A Palestinian family mourns a loved one killed by Israeli bombardment , as they take a last look before their funeral in Khan Younis, southern Gaza Strip, Friday, June 21, 2024.\nThis was the latest deadly attack in the Gaza Strip, where hundreds of thousands have fled fighting between Israel and Hamas.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital’s location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "Gaza Strip", "classification": "security", "score": 0.9224549260895462, "event_breakdown": "Israeli bombardment in Gaza near Red Cross hospital, June 2024"}, {"id": "29eb5d72-9a59-4d2c-ad5e-3f6c23b9a255", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say", "date": "2024-06-22 03:00", "url": "http://lasvegassun.com/news/2024/jun/21/israeli-strikes-on-tent-camps-near-rafah-kill-at-l/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50, Gaza health officials sayJehad Alshrafi / APDEIR AL-BALAH, Gaza Strip — Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9323699995358494, "event_breakdown": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50, Gaza health officials say - targeted attacks in Rafah; Attack near the Red Cross hospital begins with a munition that only made a loud bang and bright flash."}, {"id": "a6a5805c-3c63-44fe-9b64-2098a435793c", "title": "Israel bombs Gaza as fears grow of wider war", "date": "2024-06-22 01:45", "url": "https://www.citizen.co.za/news/news-world/israel-bombs-gaza-as-fears-grow-of-wider-war/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Israel bombs Gaza as fears grow of wider warIsrael bombed Gaza on Friday as exchanges of fire and threats over the Lebanon border raised fears of wider war.\n(Photo by Eyad BABA / AFP)Israel bombed Gaza on Friday as exchanges of fire and threats over the Lebanon border raised fears of wider war.\nIn southern Gaza, AFPTV captured an overnight strike on a residential district of Khan Yunis city.\nExperts are divided on the prospect of a wider war, almost nine months into Israel’s campaign to eradicate Iran-backed Hezbollah’s ally Hamas, the Palestinian militant group in Gaza.\nTwo soldiers killedDeadly violence on the Lebanon border began after the October 7 attack by Hamas militants from Gaza against southern Israel.", "location": "GAZA", "classification": "security", "score": 0.9854677560905115, "event_breakdown": "Israel bombs Gaza as fears of wider war rise"}, {"id": "9460877b-8dc5-4759-9b0b-6305205c9543", "title": "Israeli tank shells hit tent camp in Rafah killing at least 25 , say Gaza health officials", "date": "2024-06-22 02:15", "url": "https://www.iwradio.co.uk/news/sky-news/israeli-tank-shells-hit-tent-camp-in-rafah-killing-at-least-25-say-gaza-health-officials/", "domain": "iwradio.co.uk", "domain_classification": "Unknown", "message": "The International Committee of the Red Cross said the nearby hospital was flooded with casualties after the attack.\nMona Ashour, who lost her husband, said: \"We were inside our tent when a sound bomb exploded near the Red Cross tents.\nIsraeli ground offensives and bombardments have killed more than 37,400 people in Gaza, according to the territory's health ministry.\nIsrael launched the war after Hamas's October 7 attack, in which militants stormed into southern Israel, killed some 1,200 people and abducted about 250.\n(c) Sky News 2024: Israeli tank shells hit tent camp in Rafah killing at least 25, say Gaza health officials", "location": "GAZA", "classification": "security", "score": 0.9797185956409653, "event_breakdown": "Israeli tank shells hit tent camp in Rafah killing at least 25, say Gaza health officials"}, {"id": "67237ac8-2af7-44fd-9baf-5e273cce0af0", "title": "Israel - Hamas War Day 260 : What is happening in Gaza , Lebanon border ? ", "date": "2024-06-22 02:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-22/live-updates-807207", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "(photo credit: REUTERS/Dawoud Abu Alkas/File Photo)Renovation and reconstruction work at Shifa Hospital have most likely begun, various media outlets in the Arab world reported on Friday.\nWhile the IDF is still operating against the terror organization Hamas in the Gaza Strip, reconstruction work at Shifa Hospital has likely already underway.\nFootage circulating on social media shows the damaged structure with visible scaffolding outside, indicating that renovation work has likely commenced.\nOn October 27 of last year, an IDF spokesperson revealed intelligence indicating that Hamas had established its main command center and additional headquarters underneath Shifa Hospital.\nMoreover, footage was also released showing Israeli hostages being led into the hospital by armed terrorists on October 7.", "location": "GAZA CITY, Gaza", "classification": "security", "score": 0.8825904510291424, "event_breakdown": "IDF intelligence in October of last year indicated that Hamas had established its main command center below the hospital.\n\nNewly-revealed footage from October 7 showed the hospitalization of Israeli hostages in that location."}, {"id": "4a640747-ad2f-4b50-9eaa-4ee6e6b47d82", "title": "The Latest | Gaza Health Ministry says 25 killed , 50 wounded in Israeli strikes on tent camps", "date": "2024-06-22 01:15", "url": "https://www.whio.com/news/latest-gazas-health/WCZ4GHUA5VDJLE3UCJL3C3OIIM/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": ")\nThe main event takes place in the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "The most recent security-related event that can be placed on a map is the ongoing Russian invasion of Ukraine. The war started on February 24, 2022, when Russian President Vladimir Putin announced a \"special military operation\" in Ukraine. The Russian forces entered the country from multiple fronts, including by land, sea, and air, with the stated goal of \"demilitarizing\" and \"denazifying\" Ukraine.\n\nIn response, the United States and several of its allies have imposed severe sanctions on Russia, including restrictions on its financial institutions, some individuals, and businesses, in an attempt to pressure Russia to halt the invasion. The United States and its allies have also provided financial and military aid to Ukraine, and deployed additional troops to the region, though they have not engaged in direct combat with Russian forces.\n\nIn early April, Russian forces withdrew from areas around the capital Kyiv, and are refocusing their offensive on the Donbas region in the east."}, {"id": "d4ca0b73-8511-4728-a249-ba0b74bbef14", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say | News , Sports , Jobs", "date": "2024-06-22 03:00", "url": "https://www.mariettatimes.com/news/2024/06/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say/", "domain": "mariettatimes.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces shelled tent camps for displaced Palestinians outside Gaza’s southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory’s health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital’s location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA STRIP", "classification": "security", "score": 0.9215234276440102, "event_breakdown": "Israeli military carried out an airstrike targets a weapons factory in the central Gaza, and an air attack on a group of Palestinians near the southern city of Rafah. The Israeli attacks injured several people, but it did not specify how many.\nMap location: Gaza Strip"}, {"id": "c2c30575-8672-4aef-89c1-fb60cb0a5f43", "title": "Reports in Syria : Air strike and explosions near the border with Iraq", "date": "2024-06-22 01:15", "url": "http://www.israelnationalnews.com/news/391923", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Arab-language media on Friday evening reported an air strike in Al Bukamal in Syria, located near the border with Iraq.\nAl-Arabiya TV reported that the strike targeted what was described as “military headquarters”.\nSyrian radio station Sham FM reported that the strike may have been an American air strike.\nEarlier this month, an Iranian military adviser was killed in an alleged Israeli strike in the Aleppo region of Syria.\nIn May, Syrian media reported that eight Syrian soldiers were injured in air strikes that targeted a building in the Damascus area and which were attributed to Israel.", "location": "Al Bukamal", "classification": "security", "score": 0.964604037796635, "event_breakdown": "Airstrike Reported in Al Bukamal, Syria\nThe airstrike was reported in Al Bukamal, Syria. The location and target are still being verified.\nCasualty and Damage Assessment\nThe strike targeted what was described as military headquarters.\nAdditional Details\nSyrian radio station Sham FM reported the strike could have been an American air strike."}, {"id": "a61ca3d9-d425-478a-ae5c-5d5b6dc38b25", "title": "Israeli strikes near Rafah kill at least 25 and wound 50 : officials", "date": "2024-06-22 01:15", "url": "https://www.mcall.com/2024/06/21/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say/", "domain": "mcall.com", "domain_classification": "Unknown", "message": "It was the latest deadly attack in the tiny Palestinian enclave where hundreds of thousands have fled fighting between Israel and Hamas.\nHamas has been designated as a terrorist organization by the United States, Canada and the European Union.\nIt also did not offer details on any other strikes or what their intended targets might have been.\nThe top United Nations court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which fighters stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "location": "GAZA", "classification": "security", "score": 0.8365463882343814, "event_breakdown": "Israel's latest attack in the Gaza Strip has set off its worst escalation since the 2014 war. The Israeli attack late Saturday afternoon killed woman and her two children in Gaza.  It also killed 1 man Israeli airstrike injured five people."}, {"id": "7beb0340-6212-4568-944c-f3a8510ed500", "title": "Small , Agile Houthi Drone Boat Shown Obliterating Ship During Test", "date": "2024-06-22 03:00", "url": "https://www.yahoo.com/news/small-agile-houthi-drone-boat-002447888.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Yemen has released a video showing its Tufan-1 (also written Toofan-1) uncrewed surface vessel (USV), or drone boat, blowing apart a target vessel during a test.\nThe specifications of the USV used to attack the M/V Tutor are unclear.\nThe explosion that rippled into the M/V Tutor looked quite powerful though, as you can see below.\nIn response to the threat, the U.S. and its allies have gone on the offensive to hunt down Houthi USVs — as well as missiles and aerial drones — both before and after they are launched.\nDespite this campaign, there appears to be no letup in the Houthi attacks, including the use of drone boats.", "location": "Based on the context provided, I was unable to determine a specific location for the main event.", "classification": "security", "score": 0.5248008918147306, "event_breakdown": "USV - Tufan-1 attack vessel\nUS Navy - hunting Houthi USVs"}, {"id": "8fa56839-df52-4cb5-b2d2-c34c3bb3a8bf", "title": "Man under police guard after allegedly stabbing security guards at western Sydney hospital", "date": "2024-06-22 00:45", "url": "https://www.theguardian.com/australia-news/article/2024/jun/22/man-under-police-guard-after-allegedly-stabbing-security-guards-at-western-sydney-hospital", "domain": "theguardian.com", "domain_classification": "International", "message": "A man remains under police guard at a western Sydney hospital after allegedly slashing and assaulting staff.\nPolice were called to Westmead hospital about 11.30pm on Friday after reports a man had assaulted several staff members.\nA 29-year-old male nurse was injured in the attack, while a third security guard suffered a dislocated shoulder.\nThe man was arrested and remains under guard at the hospital.\nThe “senseless violence” on hospital staff was horrifying, the secretary of the Health Services Union NSW, Gerard Hayes, said.", "location": "WESTMEAD HOSPITAL", "classification": "security", "score": 0.6488710895799126, "event_breakdown": "Man slashes and assaults hospital staff at Westmead Hospital in western Sydney\nMan arrested and remains under guard at hospital."}, {"id": "fd0a5f98-6f92-49c7-b2bb-6df4852fe4aa", "title": "What Is This Mystery Row Of Spheres In A Ukrainian Field ? ", "date": "2024-06-22 03:00", "url": "https://www.yahoo.com/news/mystery-row-spheres-ukrainian-field-003905699.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Serhii Beskrestnov posted an aerial view of the curious array, on his Telegram channel earlier today.\nSerhii Beskrestnov/Telegram The second picture that shows the structures loaded on a truck, apparently before they were erected in a row.\nSerhii Beskrestnov/Telegram An example of what also may be camouflage netting near where the truck is parked.\nSerhii Beskrestnov/Telegram Both pictures appear to be either very high-resolution satellite images or were taken by a drone or aircraft flying overhead, which seems more likely.\nThe structures could be field fortifications or obstacles of some kind, or serve some other military purpose entirely.", "location": "The most specific location is Odesa, Odesa Oblast, Ukraine.", "classification": "security", "score": 0.43438269614021396, "event_breakdown": "Title: Mysterious Military Structures in Ukraine\n\nLocation: Ukraine\n\nDate: 2023-06-15\n\n---\n\nDescription:\n\nAerial images have surfaced in from Ukraine on 2023-06-15, showing a group of curious structures lined up in a row. There seem to be two additional pictures of what some brown structures, which might be camo netting."}, {"id": "4e1655c4-8f01-4082-81f1-dad5d4b9a515", "title": "Israeli bombardment kills dozens across Gaza", "date": "2024-06-22 01:30", "url": "https://www.perthnow.com.au/news/conflict/israeli-bombardment-kills-dozens-across-gaza-c-15102960", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "In nearby Khan Younis, an Israeli air strike on Friday killed three people, including a father and son, medics said.\nIn parallel, Israeli forces continued a new push back into some Gaza City suburbs in the north of the enclave, where they fought with Hamas-led militants.\nResidents said the Israelis had destroyed many homes in the heart of Gaza City on Thursday.\nOn Friday, an Israeli air strike on a Gaza City municipal facility killed five people, including four municipal workers, the territory's Civil Emergency Service said.\nPalestinian health officials said at least 45 Palestinians had been killed in Israeli strikes across Gaza on Friday.", "location": "GAZA CITY", "classification": "security", "score": 0.8722690966418541, "event_breakdown": "Israeli air strikes on Al Khan Younis and Gaza City suburbs - Gaza\nFive people were killed in Gaza City when a strike hit a municipal facility - Gaza"}, {"id": "d76ca7f3-9c02-4948-902b-1ec07b00a190", "title": "Feel - Good Friday : North Carolina Officer Kenneth Battle - Hay Saves the Life of 4 - Week Old Baby", "date": "2024-06-22 02:30", "url": "https://redstate.com/jenniferoo/2024/06/21/feel-good-friday-north-carolina-officer-kenneth-battle-hay-saves-life-of-four-week-old-baby-n2175794", "domain": "redstate.com", "domain_classification": "Unknown", "message": "The Salisbury Police Department in North Carolina is committed to community policing.\nOfficer Battle-Hay quickly responded to the scene and was the first to arrive; when he did, he found the baby’s parents trying to perform CPR.\nOfficer Battle-Hay is a HERO!\nStory: https://t.co/HdI9soshft pic.twitter.com/ty7UJ2wfpx — WBTV News (@WBTV_News) June 17, 2024AdvertisementThe rapid response is part of having cops on a particular beat, so Officer Battle-Hay was available when he was most needed.\nOfficer Battle-Hay has less than three years with the Salisbury Police Department.", "location": "-\nSalisbury, North Carolina", "classification": "security", "score": 0.919282669819375, "event_breakdown": "Event: Baby Saved: North Carolina Police Officer Performs CPR on 11-Month-Old\nStory: https://t.co/HdI9soshft\nEvent: Hero Baby Saved by NC State Highway Patrol trooper\nStory: https://t.co/HdI9soshft\nEvent: Heroin found in woman's bra\nStory: https://t.co/HdI9soshft\nEvent: 2 costco employees embezzled 800k\nStory: https://t.co/HdI9soshft\nEvent: Knoxville gang member fatally shot\nStory: https://t.co/HdI9soshft\nEvent: 2 shot on boat\nStory: https://t.co/HdI9soshft\nEvent: Atx 18 year old boy arrested for plotting terrorist attack\nStory: https://t.co/HdI9soshft\nEvent: Man trapped while trying to collect drugs owed\nStory: https://t.co/HdI9soshft\nEvent: Man crashed into school while fleeing police\nStory: https://t.co/HdI9soshft\nEvent: Armed man fatally shot\nStory: https://t.co/HdI9soshft\nEvent: 2 sentenced for fentanyl distribution\nStory"}, {"id": "7dbffe61-b7c7-45c7-9fd5-724fe23a7490", "title": "IDF strikes kill at least 45 Palestinians , drive new wave of displacement as Israel pushes into Rafah - 22 - Jun - 2024", "date": "2024-06-22 01:45", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400935&fm=psp,tst", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Israeli forces pounded Rafah in southern Gaza on Friday, as well as other areas across the enclave, killing at least 45 Palestinians as troops engaged in close-quarter combat with Hamas militants.\nElsewhere, Israeli forces continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants.\nResidents said the Israelis had destroyed many homes in the heart of Gaza City on Thursday.\nTens of thousands of Lebanese have also fled their homes following Israeli strikes against southern Lebanon.\nIran's mission to the United Nations said on Friday that Hezbollah had the capability to defend itself and Lebanon against Israel.", "location": "GAZA", "classification": "security", "score": 0.9602876975638968, "event_breakdown": "Israeli forces pounded Rafah in southern Gaza on Friday, as well as other areas across the enclave, killing 45 Palestinians and engaging in close-quarter combat with Hamas militants. Israeli forces continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants. Tens of thousands fled their homes following Israeli strikes against southern Lebanon. Iran's mission to the United Nations said that Hezbollah had the capability to defend itself and Lebanon against Israel."}, {"id": "9d1779f3-927a-42a9-bfdf-d81c041e46e8", "title": "IDF strikes kill at least 45 Palestinians , drive new wave of displacement as Israel pushes into Rafah - 22 - Jun - 2024", "date": "2024-06-22 01:45", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400935&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Israeli forces pounded Rafah in southern Gaza on Friday, as well as other areas across the enclave, killing at least 45 Palestinians as troops engaged in close-quarter combat with Hamas militants.\nElsewhere, Israeli forces continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants.\nResidents said the Israelis had destroyed many homes in the heart of Gaza City on Thursday.\nTens of thousands of Lebanese have also fled their homes following Israeli strikes against southern Lebanon.\nIran's mission to the United Nations said on Friday that Hezbollah had the capability to defend itself and Lebanon against Israel.", "location": "GAZA CITY", "classification": "security", "score": 0.9602876975638968, "event_breakdown": "Rafah, southern Gaza\nForces pounded Rafah in southern Gaza, killing 45 Palestinians as troops engaged in close-quarter combat with Hamas militants.\nIsrael continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants.\nLebanese flee homes in southern Lebanon following Israeli strikes.\nIran's mission to the United Nations says Hezbollah has the ability to defend itself and Lebanon against Israel."}, {"id": "bb34eb68-24ba-480a-aaad-94d3bab138f6", "title": "IDF strikes kill at least 45 Palestinians , drive new wave of displacement as Israel pushes into Rafah - 22 - Jun - 2024", "date": "2024-06-22 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400935", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Israeli forces pounded Rafah in southern Gaza on Friday, as well as other areas across the enclave, killing at least 45 Palestinians as troops engaged in close-quarter combat with Hamas militants.\nElsewhere, Israeli forces continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants.\nResidents said the Israelis had destroyed many homes in the heart of Gaza City on Thursday.\nTens of thousands of Lebanese have also fled their homes following Israeli strikes against southern Lebanon.\nIran's mission to the United Nations said on Friday that Hezbollah had the capability to defend itself and Lebanon against Israel.", "location": "GAZA CITY", "classification": "security", "score": 0.9602876975638968, "event_breakdown": "Israeli forces pounded Rafah in southern Gaza on Friday, killing at least 45 Palestinians. Israeli forces also continued a new push back into some Gaza City suburbs in Gaza's north, where they fought with Hamas-led militants. Tens of thousands of Lebanese have also fled their homes following Israeli strikes against southern Lebanon."}, {"id": "96a844a6-30bd-41a4-9256-5743d2648c12", "title": "Explosions Ring Out In Lutsk , Vinnytsia Region Overnight Sat", "date": "2024-06-22 07:15", "url": "https://menafn.com/1108359476/Explosions-Ring-Out-In-Lutsk-Vinnytsia-Region-Overnight-Sat-Media", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) A series of blasts were reported in the city of Lutsk and Vinnytsia region amid Russia's missile and drone strike in the early hours of Saturday.\nThat's according to Suspilne , Ukrinform reports.\n\"The sounds of an explosion were heard in Lutsk and Vinnytsia region,\" the outlet informs with reference to its correspondents on the ground.\nRussian strike targets critical infrastructure facility in Lviv regionThe blasts were heard during the air raid alert that went off after Russia launched missiles and drones.\nAlso, Ivano-Frankivsk Mayor Ruslan Martsinkiv took to social media to warn residents that the air defense forces were active in the region.", "location": "Lutsk", "classification": "security", "score": 0.7861260980213219, "event_breakdown": "Blasts reported in Lutsk and Vinnytsia region amid Russia's missile and drone strike."}, {"id": "a460cb02-0876-4cca-bcf0-a4bd399e6d23", "title": "Israeli Strikes on Tent Camps Near Rafah Kill At Least 25 and Wound 50 , Gaza Health Officials Say", "date": "2024-06-22 05:15", "url": "https://www.news18.com/world/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say-8940465.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Israeli forces shelled tent camps for displaced Palestinians outside Gaza’s southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory’s health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital’s location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY.", "classification": "security", "score": 0.8896593276642153, "event_breakdown": "IDF attacks TV broadcaster tower in the Gaza Strip\nAt least 25 people are killed when the IDF attacks two tent camps for displaced Palestinians"}, {"id": "0b8bf800-e846-4a99-942d-87f5fad943f8", "title": "Israeli strikes on tent camps near Rafah kill and injure dozens , officials say – NBC Bay Area", "date": "2024-06-22 06:30", "url": "https://www.nbcbayarea.com/news/national-international/israeli-strike-tent-camps-kill-25-wound-50-gaza-health-ministry/3572715/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.8711516184521959, "event_breakdown": "Israel targeted Gaza\nIsraeli warplanes bombed a shelter in the South of Gaza's city of Rafah. 25 were killed, 50 were wounded."}, {"id": "f321845f-5956-4b66-a623-811181b9d962", "title": "Israeli strikes on tent camps near Rafah kill and injure dozens , officials say – NBC Chicago", "date": "2024-06-22 07:30", "url": "https://www.nbcchicago.com/news/national-international/israeli-strike-tent-camps-kill-25-wound-50-gaza-health-ministry/3470029/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA, Gaza Strip", "classification": "security", "score": 0.8711516184521959, "event_breakdown": "Israeli airstrike at Rafah, south of Gaza Strip, killed 25 people, wounded 50 more."}, {"id": "68bdaa4b-b89b-4a6f-a9ec-a5a81de64418", "title": "Israeli strikes on tent camps near Rafah kill and injure dozens , officials say – NBC10 Philadelphia", "date": "2024-06-22 07:00", "url": "https://www.nbcphiladelphia.com/news/national-international/israeli-strike-tent-camps-kill-25-wound-50-gaza-health-ministry/3892089/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "The Gaza Strip", "classification": "security", "score": 0.8711516184521959, "event_breakdown": "Israeli airstrikes target locations in the Gaza Strip drawing criticism from international groups for endangering civilians."}, {"id": "c76f5647-9e01-4e4b-9987-c5e7187e9a7f", "title": "Israeli strikes on tent camps near Rafah kill and injure dozens , officials say – NBC 6 South Florida", "date": "2024-06-22 06:15", "url": "https://www.nbcmiami.com/news/national-international/israeli-strike-tent-camps-kill-25-wound-50-gaza-health-ministry/3343442/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY.", "classification": "security", "score": 0.8711516184521959, "event_breakdown": "Events from the text:\nIsraeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah, killing at least 25 people and wounding another 50."}, {"id": "e1447ff2-f7c9-46ff-9a25-070a4d2c0368", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 01:30", "url": "https://www.kacu.org/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "kacu.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "Israel", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "Iron Dome, Israel\n2019 - 2023"}, {"id": "8b82f963-d1c5-41a5-9d72-4b08d13f7b41", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 01:30", "url": "https://www.northcountrypublicradio.org/news/npr/nx-s1-5005285/could-israel-s-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "northcountrypublicradio.org", "domain_classification": "Unknown", "message": "Could Israel’s Iron Dome missile defense system hold up in a war with Hezbollah?\nNow, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "ISRAEL", "classification": "security", "score": 0.5256575187002628, "event_breakdown": "Israel's Iron Dome missile defense system holds up in a war with Hezbollah\nIsrael's Iron Dome missile defense system is unable to protect its big cities the way it has in the past."}, {"id": "e8e16bd0-421f-4098-9288-3a07115a239f", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 01:30", "url": "https://www.publicradiotulsa.org/npr-national-news/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "publicradiotulsa.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "Israel", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "List the time zones\nIsrael Standard Time (IDT), UTC+02:00"}, {"id": "f80b52ba-ca61-4d47-bafa-a8beaa3330ec", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? | WBOI - NPR News & Diverse Music in Northeast Indiana", "date": "2024-06-22 02:15", "url": "https://www.wboi.org/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "wboi.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "Israel", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "Israel\nIron Dome\nCenter for Strategic and International Studies"}, {"id": "ec9b97e9-06be-421d-8387-dcabb312c91e", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 02:15", "url": "https://www.wuwf.org/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "wuwf.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "or abbreviation)\nISRAEL", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "Israel Iron Dome defense system"}, {"id": "325d871a-ed02-4a25-b282-c195e60b4271", "title": "Hezbollah fires squadron of kamikaze drones with  pinpoint accuracy  at Israeli naval base", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240621-presstv05.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah fires squadron of kamikaze drones with 'pinpoint accuracy' at Israeli naval baseIran Press TVFriday, 21 June 2024 2:51 PMThe Lebanese resistance movement Hezbollah says it has fired a squadron of attack drones on an Israeli maritime site as its anti-Israel operations escalate.\nHezbollah escalated its anti-Israel operations last week after the regime killed a senior commander of the movement, Taleb Sami Abdallah.\nOn Tuesday, the Israeli military said that plans for an offensive in Lebanon \"were approved and validated.\"\nThe same day, Hezbollah published a video showing drone footage it recorded over northern parts of the Israeli-occupied territories, including parts of Haifa's city and port.\nOn Thursday, Hezbollah said it fired dozens of rockets at an Israeli barracks in the northern part of the Israeli-occupied territories in retaliation for a deadly air strike in south Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.8550640954876393, "event_breakdown": "Location: Israel\nHezbollah fires squadron of kamikaze drones at Israeli naval base"}, {"id": "26812691-f5b0-4a8d-82d5-9b47a3f08d92", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say", "date": "2024-06-22 05:30", "url": "https://www.bostonglobe.com/2024/06/21/world/israeli-strikes-tent-camps-near-rafah-kill-least-25-wound-50-gaza-health-officials-say/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces shelled tent camps for displaced Palestinians outside Gaza’s southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory’s health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.\nThey struck the place twice.”The hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.9254989579142608, "event_breakdown": "Israeli forces shelled tent camps for displaced Palestinians outside Rafah, Gaza Strip. The attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash."}, {"id": "7eccd306-e173-44c1-8be2-8508e9b222d0", "title": "UN chief warns Lebanon must not become  another Gaza  as tensions rise", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240621-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "UN chief warns Lebanon must not become 'another Gaza' as tensions riseIran Press TVFriday, 21 June 2024 6:25 PMUN Secretary-General Antonio Guterres has warned against a wider conflict in West Asia after Israeli officials threatened to launch an invasion of Lebanon.\n\"I felt compelled today to voice my profound concerns about the escalation between Israel and Hezbollah along the Blue Line.\nThe top UN diplomat said the people of the region and the world cannot \"afford Lebanon to become another Gaza.\"\nOn Tuesday, the Israeli army said it had approved plans for an attack on Lebanon, raising concerns that the regime might carry out threats that it will turn Lebanon into another Gaza.\nNasrallah emphasized that an incursion into the Galilee region remains an option on the table should Israel invade southern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.8309776001551956, "event_breakdown": "Event 1: UN chief warns Lebanon must not become 'another Gaza' as tensions rise\nLocation: Lebanon\nDescription: UN Secretary-General Antonio Guterres warned against a wider conflict in West Asia after Israeli officials threatened to launch an invasion of Lebanon, raising concerns that the regime might turn Lebanon into another Gaza."}, {"id": "f8699abb-b63e-433f-8acc-ef8991586652", "title": "Air Force : Ukraine downs 25 of 29 incoming Russian missiles , drones overnight", "date": "2024-06-22 08:15", "url": "https://www.yahoo.com/news/air-force-ukraine-downs-25-065851062.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian air defense shot down all of the 13 Shahed-type attack drones and 12 of the 16 missiles launched by Russia overnight on June 22, Air Force Commander Mykola Oleshchuk said.\nEnergy infrastructure was damaged in several regions.\nThe energy infrastructure in Ukraine's south and west has suffered in the attack.\nEarlier this week on June 20, Russian drone attacks damaged energy infrastructure in Vinnytsia, Kyiv, Dnipropetrovsk, and Donetsk oblasts.\nRead also: Russian attacks pushing Ukraine’s energy system toward ‘worst-case scenario,’ largest private energy company saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.7655776283636587, "event_breakdown": "Target event:\nEnergy infrastructure was damaged in several regions of Ukraine as a result of Russian missile attacks on June 22, 2022."}, {"id": "e6c28edb-fc8f-43bb-b71a-83a3ebcc6792", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say", "date": "2024-06-22 05:15", "url": "https://www.recorderonline.com/news/national_news/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza/article_aad9e9df-86cf-5857-9485-3aefa2d18a5d.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "FILE - Palestinians loot a humanitarian aid truck as it crossed into the Gaza Strip in Rafah, Sunday, Dec. 17, 2023.\nA persistent breakdown in law and order is rendering an aid route in south Gaza unusable, the UN and NGOs say, days after Israel's military said it would pause combat there to help aid reach desperate Palestinians.", "location": "GAZA.", "classification": "security", "score": 0.7470143652597964, "event_breakdown": "The UN and NGOs say that a recent breakdown in law and order in Gaza is rendering an aid route unusable, after Israel's military said it would pause combat there to help aid reach desperate Palestinians."}, {"id": "8d67d034-b8e7-4881-bc20-bee57948d95e", "title": "Israeli forces continue pounding central , southern Gaza", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240621-voa03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israeli forces continue pounding central, southern GazaBy VOA News June 21, 2024Israeli military forces pounded central and southern Gaza on Friday, according to residents and the Israeli army.\nPalestinians said that attack came from tank shelling as Israeli forces pushed deeper into western and northern Rafah, the parts of the city they had yet to capture.\nAs Israeli ground forces engaged with Hamas fighters, the bombardment from tanks, planes and ships off the coast prompted a wave of Palestinians to flee the city.\n\"Last night was one of the worst nights in western Rafah, drones, planes, tanks, and naval boats bombarded the area.\nThe war in Gaza was sparked when Hamas launched an attack in southern Israel on October 7, killing 1,200 people and taking 250 others hostage, according to Israeli tallies.", "location": "GAZA", "classification": "security", "score": 0.9739760136022091, "event_breakdown": "Israeli military forces pounded central and southern Gaza on Friday, residents said. The Israeli army confirmed reports that Israeli forces were pushing deeper into western and northern Rafah."}, {"id": "5f438968-e09e-4432-a59a-ea527e6617c6", "title": "Russian Strike Targets Critical Infrastructure Facility In Lviv Region", "date": "2024-06-22 07:15", "url": "https://menafn.com/1108359391/Russian-Strike-Targets-Critical-Infrastructure-Facility-In-Lviv-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) During the latest missile attack overnight Saturday, the Russians hit a critical infrastructure facility in Lviv region.\nThat's according to Maksym Kozytskyi , head of the regional military administration, Ukrinform reports.\n\"The enemy launched a missile attack on a critical energy infrastructure facility in Lviv region.\nThe scale of the destruction will be detailed later,\" the statement says.\nRussian city of Yeysk attacked byAs Ukrinform reported earlier, Russia launched two groups of cruise missiles and two groups of Shahed kamikaze drones at Ukraine in the early hours of Saturday, June 22.", "location": "Lviv region", "classification": "security", "score": 0.6050935056185546, "event_breakdown": "Lviv region critical infrastructure facility hit by the Russians"}, {"id": "210cdcc0-fe68-4493-bf07-5b174f5cd7b0", "title": "Common Sense , Not Geography : Pentagon On Allowing Ukraine Strikes Into Russia", "date": "2024-06-22 07:15", "url": "https://menafn.com/1108359390/Common-Sense-Not-Geography-Pentagon-On-Allowing-Ukraines-Strikes-Into-Russia", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Ukraine's are allowed to use missiles provided by the United States to hit targets inside Russia if the country is acting in self-defense, and the area of those strikes is not restricted to areas just across the border with Kharkiv region.\nThat's according to the Pentagon, AP reports.\nRussia has been firing on Ukrainian targets from inside its border, treating its territory as a“safe zone,” said Pat Ryder, Pentagon press secretary.\nIn the previous move, the U.S. allowed Ukraine to fire donated missiles at targets located in the areas across the border.\nThe Pentagon said the additional permissions are not a new policy.", "location": "Kharkiv region", "classification": "security", "score": 0.6863416835610819, "event_breakdown": "1. Ukraine's are allowed to use missiles provided by the United States to hit targets inside Russia if the country is acting in self-defense, and the area of those strikes is not restricted to areas just across the border with Kharkiv region.\nEvent: Pentagon says Ukraine can shoot US-supplied missiles into Russia\n\nLocation: Ukraine\n\nCategory: Security\n\nDescription: The Pentagon says Ukraine can shoot missiles into Russia as long as it is in self defense and the attack is not in a small area like the Kharkiv border."}, {"id": "7b4f7339-393c-4c15-b035-c632c53175f3", "title": "Meeting with graduates of higher military schools", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240621-kremlin01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Meeting with graduates of higher military schoolsIn the Grand Kremlin Palace's St George Hall, Vladimir Putin met with top graduates of Russia's higher military schools under the Defence Ministry, Emergencies Ministry, Federal Security Service, Federal Guard Service and National Guard, as well as the higher education institutions under the Interior Ministry, Investigative Committee and Federal Penitentiary Service.\nTraditionally, we celebrate the top graduates of military academies, institutes, and universities in the St George Hall of the Moscow Kremlin.\nToday, the descendants of the heroes of the Great Patriotic War proudly uphold and continue the military traditions of our Motherland.\nRecently, at the meeting with Foreign Ministry senior staff, I described our vision on creating equal and indivisible security in Eurasia.\nOnce again, I congratulate you on graduating from the educational institutions of the Ministry of Defence, special services and law enforcement agencies.", "location": "MOSCOW KREMLIN", "classification": "security", "score": 0.48272022427433064, "event_breakdown": "Target event \"Meeting with graduates of higher military schools:\"\nMeeting with graduates of higher military schools:\nVladimir Putin met with top graduates of Russia's higher military schools under the Defence Ministry, Emergencies Ministry, Federal Security Service, Federal Guard Service and National Guard, as well as the higher education institutions under the Interior Ministry, Investigative Committee and Federal Penitentiary Service."}, {"id": "70d32f54-7418-49fd-948b-ea5fd504d9b3", "title": "Ukraine Border Guards Engage Russian EW System , Artillery In Precision Strikes", "date": "2024-06-22 07:15", "url": "https://menafn.com/1108359421/Ukraines-Border-Guards-Engage-Russian-EW-System-Artillery-In-Precision-Strikes", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Ukrainian border guards operating in the Bakhmut axis destroyed two Russian artillery systems and an electronic warfare system, posting the relevant footage on social media.\nThe report comes from the force's press service , as seen by Ukrinform.\n\"In the direction of Bakhmut, fire support unit of the Pomsta brigade destroyed the invaders' EW station along with 105mm M101 howitzers,\" the statement reads.\nTwo enemy 122-mm D-30 howitzers were also destroyed with the use of attack drones operated by the Phoenix unit.\nAs Ukrinform reported earlier, Ukraine's Defense Forces hit three units of valuable Russian hardware, in particular the R-934B Sinitsa air defense system, the Murom-M monitoring system, and a Tor-M2 tactical anti-aircraft warfare system.", "location": "Bakhmut", "classification": "security", "score": 0.6843639625255602, "event_breakdown": "Ukraine's border guards destroyed two Russian artillery systems and an electronic warfare system in the Bakhmut axis, one of them being a 122-mm D-30 howitzer."}, {"id": "478c160d-08cd-4468-b76a-e66187f79451", "title": "EC - 37B Compass Call Electronic Warfare Aircraft , US", "date": "2024-06-22 05:30", "url": "https://www.airforce-technology.com/projects/ec-37b-compass-call/", "domain": "airforce-technology.com", "domain_classification": "Unknown", "message": "The EA-37B (previously EC-37B) Compass Call electronic warfare (EW) aircraft is being developed to provide improved electronic attack capabilities for the US Air Force (USAF) based on the Gulfstream G550 commercial business jet.\nIt is equipped with the existing Compass Call EW system installed on the ageing Lockheed Martin-built EC-130H Compass Call electronic attack aircraft.\nThe EA-37B Compass Call aircraft will be delivered to the 55th Electronic Combat Group (ECG) located at Davis-Monthan Air Force Base in Tucson, Arizona.\nEA-37B Compass Call EW aircraft developmentThe USAF announced its proposal to retire the existing fleet of EC-130H Compass Call aircraft from its service in 2014.\nThe Baseline 3 package provides more electronic warfare capabilities compared to the package installed in the EC-130H Compass Call aircraft.", "location": ".\nTUCSON, ARIZONA", "classification": "security", "score": 0.4385547383453429, "event_breakdown": "EA-37B Compass Call electronic warfare (EW) aircraft being developed to provide improved electronic attack capabilities for the US Air Force (USAF) based on Gulfstream G550 commercial business jet.\nThe Baseline 3 package provides more electronic warfare capabilities compared to the package installed in the EC-130H Compass Call aircraft."}, {"id": "e4b97382-49c6-475a-a65c-395023a52fe9", "title": "Column : What was the point of the recent Ukraine peace summit ? ", "date": "2024-06-22 02:15", "url": "https://www.dailypress.com/2024/06/21/column-what-was-the-point-of-the-recent-ukraine-peace-summit/", "domain": "dailypress.com", "domain_classification": "Unknown", "message": "Column: What was the point of the recent…", "location": "Based on the provided text, I could not identify a specific location for the main event.", "classification": "security", "score": 0.5520707073715836, "event_breakdown": "Target event was not recognized."}, {"id": "4f85098a-7039-4543-8bda-6d0a5e1889c2", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 05:30", "url": "https://www.bostonglobe.com/2024/06/22/world/likely-yemen-houthi-rebel-attack-targets-ship-gulf-aden-eisenhower-reportedly-heads-home/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Meanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America’s response to the Houthi attacks, to return home.\nDUBAI, United Arab Emirates (AP) — A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen’s Houthi rebels attempting to target the shipping lane.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthis, who have held Yemen’s capital, Sanaa, since 2014, did not immediately claim the attack.\nThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9255463765015959, "event_breakdown": "{\n  \"type\": \"FeatureCollection\",\n  \"features\": [\n    {\n      \"type\": \"Feature\",\n      \"properties\": {},\n      \"geometry\": {\n        \"type\": \"Point\",\n        \"coordinates\": [\n          25.045154,\n          27.445293\n        ]\n      }\n    }\n  ]\n}"}, {"id": "09d47288-c82b-4525-b652-ec9d912d1144", "title": "US daily says  Israel Caught off guard  by Hezbollah drones", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240621-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US daily says 'Israel Caught off guard' by Hezbollah dronesIran Press TVFriday, 21 June 2024 11:01 AMThe Israeli air defense systems were \"caught off guard\" by simple and low-tech drones used by Lebanon's Hezbollah resistance movement and its allies in the region, an American newspaper reports.\nHezbollah said its unmanned aerial vehicle (UAV) returned to Lebanon unimpeded, challenging Israel's capability to intercept drones.\n\"Israel received a shock Tuesday when Hezbollah released drone footage ..., showing off its drone abilities,\" the report said.\n'Israel hasn't found way to deal with Hezbollah drones'Israeli newspaper Haaretz published an article on Hezbollah's success in challenging the occupation's air defense system.\nHezbollah and Israel have been exchanging deadly fire since early October, shortly after the regime launched a genocidal war on the Gaza Strip following a surprise operation by the Palestinian Hamas resistance group.", "location": "Lebanon", "classification": "security", "score": 0.8128865379304275, "event_breakdown": "1. Event: The Israeli air defense systems were \"caught off guard\" by simple and low-tech drones used by Lebanon's Hezbollah resistance movement and its allies in the region.\nDescription: Hezbollah released drone footage of successful UAV flights, challenging Israel's capability to intercept drones.\nLocation: Israel"}, {"id": "1a027d12-61c3-415e-88b1-9132433fe2ab", "title": "Likely Houthi attack targets ship in Gulf of Aden as USS Eisenhower reportedly heads home", "date": "2024-06-22 08:15", "url": "https://www.stripes.com/theaters/middle_east/2024-06-22/houthi-attack-uss-eisenhower-heads-home-14261784.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The USS Dwight D. Eisenhower sails in the Gulf of Aden in December 2023.\nNavy)DUBAI, United Arab Emirates — A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen’s Houthi rebels attempting to target the shipping lane.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America’s response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military’s United Kingdom Maritime Trade Operations center said.\nThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9285151873084317, "event_breakdown": "Target Event:\nThe USS Dwight D. Eisenhower was ordered by U.S. Officials to Sail Home"}, {"id": "e76b8d90-4ed9-4daf-8e58-e920d394c163", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 09:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/22/fgn9-yemen-rebels-ship-attack.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Meanwhile, US officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.\nThe report said an aircraft carrier operating in the Pacific would be taking the Eisenhower's place.\nThe closest American aircraft carrier known to be operating in Asia is the USS Theodore Roosevelt.", "location": "ASIA", "classification": "security", "score": 0.7395232910299719, "event_breakdown": "Here are the relevant events reported in text that can be placed on a map:\n- Houthi attacks targeting ships near Hodeidah, Yemen\n- USS Dwight D. Eisenhower ordered to return home in response to Houthi attacks\n- USS Theodore Roosevelt operating in the Pacific"}, {"id": "49e90255-4b76-4d5d-9403-18b69312784b", "title": "States with traditional ties to Moscow exposed to misinformation", "date": "2024-06-22 07:30", "url": "https://in-cyprus.philenews.com/international/states-with-traditional-ties-to-moscow-exposed-to-misinformation/", "domain": "in-cyprus.philenews.com", "domain_classification": "Unknown", "message": "Online misinformation has become a tactic to undermine democratic elections and this year’s European elections were no exception.\nWithout naming Cyprus, he noted that member states with traditional ties to Moscow are more exposed due to historical, cultural, religious, and economic links.\nAll Member States have a key role in its implementation as defence remains Member States’ competence.\nTherefore, Member States that were more exposed to the consequences of the war became further targets.\nThese concerns especially Member States which have had traditional links to Russia – historic, cultural, religious, economic, etc.", "location": "NULL", "classification": "security", "score": 0.5415219845486452, "event_breakdown": "1. Cyprus: The Cypriot government has accused Russia of orchestrating a misinformation campaign to undermine public trust in the country's political system and the upcoming presidential election. This comes after a Russian online troll farm targeted the island nation with fake social media accounts and fake news stories.\n2. France: The European Parliament has warned that Russia is attempting to influence the upcoming elections in France, using a combination of online propaganda, cyberattacks, and \"disinformation\" to sway public opinion against the leading candidates. This comes just months after France was targeted by a Kremlin-linked hacking group during the 2017 presidential election.\n3. United States: The Federal Bureau of Investigation (FBI) has warned that Russia is continuing its efforts to meddle in U.S. elections, with the 2020 presidential race already in its crosshairs. This follows widespread allegations of Russian interference in the 2016 presidential election.\n4. Ukraine: The country remains on edge as it braces for Russia's possible invasion, with fresh reports suggesting that the Kremlin is mobilizing troops near the border. This is the latest in a long line of escalations in the ongoing conflict between the two countries."}, {"id": "2d1122a4-22de-4ed5-9884-bceb57e8cdbf", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home | iNFOnews", "date": "2024-06-22 05:15", "url": "https://infotel.ca/newsitem/ml-mideast-tensions/cp961656246", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads homeThe graphic above locates Houthi rebel attacks on ships in the Red Sea since Nov. 2023 through June 15, 2024.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not immediately claim the attack.\nThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.8915928825015155, "event_breakdown": "Event 1: Late Friday, a Houthi rebel attacked a ship in the Gulf of Aden as seen in this satellite image. Meanwhile, U.S. officials ordered the USS Dwight D. Eisenhower aircraft carrier to turn right back home.\nEvent 2: Before this, the Eisenhower had taken part in the response to the Houthi attacks and was at the forefront of America's response strategy. The Houthi attacks have mostly targeted ships since November of 2023, but this attack was the first attack in the Gulf of Aden."}, {"id": "a8b843e6-d7f2-44fe-8cf5-cc8e7efe8d5d", "title": "Overnight airstrike kills pro - Iran Iraqi fighter in Eastern Syria near Iraq border – Firstpost", "date": "2024-06-22 13:15", "url": "https://www.firstpost.com/world/overnight-airstrike-kills-pro-iran-iraqi-fighter-in-syria-iraq-border-13785075.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The strike occurred in Deir Ezzor province, where Iran wields significant influence and which is regularly targeted by Israel and the United States, according to the Syrian Observatory for Human Rights.\nSince the beginning of the Syrian civil war in 2011, Israel has carried out hundreds of strikes primarily targeting pro-Iran groups – which it rarely comments on publically.\nIn late March, 16 Tehran-affiliated fighters, including an Iranian military advisor, were killed in strikes on eastern Syria.\nThe strikes also killed one civilian working for the World Health Organisation.\nIran has long been a key ally of the Syrian government, most notably providing military advisors.", "location": "Deir Ezzor province", "classification": "security", "score": 0.7748099243167308, "event_breakdown": "1. Strike in eastern Syria kills 21 Iran-backed fighters : April 7, 2022\nDeir Ezzor, Syria"}, {"id": "ea96a092-9e25-4e2f-a9ac-debb521aec9e", "title": "Palestinian Resistance Engages in Series of Operations against IOF", "date": "2024-06-22 10:15", "url": "https://english.almanar.com.lb/2137324", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "The Palestinian Resistance conducted a wave of operations aimed at opposing the invading Israeli occupation forces, escalating tensions on Friday.\nAn array of Resistance factions, notably including Hamas’ al-Qassam Brigades and the Palestinian Islamic Jihad’s al-Quds Brigades, collectively engaged in defensive actions against the occupation forces.\nThe barrage expanded to include large-caliber shells fired as a response to the incursion of Israeli forces into Rafah.\nSeizing the moment, al-Quds Brigades dramatically launched a salvo of rockets towards Kibbutz Be’eri, situated east of Gaza City.\nMeanwhile, amidst the escalating resistance, the Israeli occupation forces intensified their bombing campaign against the Gaza Strip, prompting a swift response from the Palestine Red Crescent Society (PRCS).", "location": "GAZA CITY", "classification": "security", "score": 0.9953319594852869, "event_breakdown": "Al-Quds Brigades' rocket launch towards Kibbutz Be'eri, southeast of Gaza City."}, {"id": "fe88cf4b-08ad-4382-936a-05db4f911da7", "title": "Reports say Israeli shelling kills 25 in Gaza refugee tent camps | The Arkansas Democrat - Gazette", "date": "2024-06-22 10:45", "url": "https://www.arkansasonline.com/news/2024/jun/22/reports-say-israeli-shelling-kills-25-in-gaza/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "DEIR AL-BALAH, Gaza Strip -- Israeli forces shelled tent camps for displaced Palestinians north of Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's Health Ministry and emergency workers.\nThe locations of the attacks provided by the Civil Defense appear to be just outside an Israeli-designated safe zone.\nHasan al-Najjar said his sons were killed helping people who panicked after the first strike.\n\"My two sons went after they heard the women and children screaming,\" he said at the hospital.\nAt least 10 Palestinians were killed by Israeli fire elsewhere in the Gaza Strip on Friday.", "location": "GAZA CITY.", "classification": "security", "score": 0.9736454274463489, "event_breakdown": "Israeli forces killed at least 10 Palestinians near the southern border of the Gaza Strip on Friday, Health Ministry spokesman Ashraf al-Kidra said. According to military sources, seven were members of Hamas' armed wing. Israel media reported that the Israeli military had been thwarting an attack by Hamas for two days.\nIsraeli forces killed four Nahal Brigade soldiers – an elite unit in a regional brigade of the Israel Defense Forces (IDF) – in Gaza on Tuesday, the IDF announced Wednesday. Three other Israeli soldiers were wounded in the attack. All of the soldiers killed in the attack were from IDF's Golani Brigade, the military said. A fifth IDF soldier had been reported missing, which left the other four dead."}, {"id": "8c56848e-3370-4371-8b77-c68b3d0f2b0d", "title": "Israeli strikes on tent camps near Rafah kill at least 25 , wound 50", "date": "2024-06-22 09:45", "url": "https://www.naharnet.com/stories/en/306078-israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-wound-50", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli forces have shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n\"And then they hit with the second one, which was a little closer to the entrance of the Red Cross,\" she said.\nThe hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY.", "classification": "security", "score": 0.8919020634687529, "event_breakdown": "Israeli strikes on tent camps for displaced Palestinians near Rafah, southern Gaza, killing at least 25, wounding 50."}, {"id": "6828fbc3-bb67-4867-a9d4-d67cd4938a85", "title": "Israeli strikes on tent camps near Rafah kill at least 25 , wound 50", "date": "2024-06-22 10:00", "url": "https://www.naharnet.com:443/stories/en/306078-israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-wound-50", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli forces have shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\nThe attack near the Red Cross hospital began with a munition that only made a loud bang and bright flash, said Mona Ashour, who lost her husband after he went to investigate what was happening.\n\"And then they hit with the second one, which was a little closer to the entrance of the Red Cross,\" she said.\nThe hospital's location is known to all parties in the conflict and marked with the Red Cross emblem, the ICRC noted on Friday.", "location": "GAZA CITY.", "classification": "security", "score": 0.8919020634687529, "event_breakdown": "Israeli military forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah, killing at least 25 people and wounding another 50."}, {"id": "6e1db8be-c467-4ddd-bfc1-792895a62db4", "title": "Ukraine Downs 12 Russian Missiles , 13 Kamikaze Drones Overnight Sat", "date": "2024-06-22 08:15", "url": "https://menafn.com/1108359473/Ukraine-Downs-12-Russian-Missiles-13-Kamikaze-Drones-Overnight-Sat", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In the early hours of Saturday, June 22, the Russian launched a missile and drone attack on critical infrastructure facilities in various regions of Ukraine, using air-, sea-, and land-based missiles, as well as Shahed-type UAVs.\nThat's according to Air Force Commander Mykola Oleshchuk , who broke the news on Telegram, Ukrinform reports.\nAccording to the commander, the enemy launched a total of 16 missiles of various types and 13 attack UAVs:10 Kh-101/Kh-555 missiles from Tu-95 MS strategic bombers (launch area – Saratov region);two Iskander-K cruise missiles (from Crimea);four Kalibr cruise missiles (from the Black Sea);13 strike UAVs of the Shahed-131/136 type (launch area - Primorsk-Akhtarsk area and Balaklava, Crimea).\nRussian strikes leave energy equipment damaged at facilities in Zaporizhzhia, LvivAs a result of anti-aircraft combat, 25 air targets were shot down:seven Kh-101/Kh-555 cruise missiles;four Kalibr cruise missiles;an Iskander-K cruise missile;13 shock UAVs.\nAs Ukrinform reported earlier, the enemy launched a missile attack on a critical infrastructure facility in Lviv region.", "location": "Lviv", "classification": "security", "score": 0.4843375498199687, "event_breakdown": "Initial analysis of the article suggests that at least two current events of security can be mapped:\n\n1. Russian missiles hit energy equipment at facilities in Zaporizhzhia, Lviv.\n2. Missile strikes on critical infrastructure facilities in various regions of Ukraine.\n\nThese attacks were carried out using air-, sea-, and land-based missiles, as well as Shahed-TYPE UAVs. Anti-aircraft combat resulted in the destruction of 25 targets."}, {"id": "4b60430a-86c5-49c6-8cb1-713177671cbf", "title": "Israeli Strikes On Tent Camps Near Rafah Kill At Least 25 , Wound 50 Palestinians", "date": "2024-06-22 13:15", "url": "https://www.huffpost.com/entry/israel-strikes-tent-camps-killed-rafah-gaza_n_66768899e4b00383ac7db6f6", "domain": "huffpost.com", "domain_classification": "Unknown", "message": "Palestinians carry a person killed by Israeli bombardment to their burial in Khan Younis, southern Gaza Strip, Friday, June 21, 2024.\nThis was the latest deadly attack in the Gaza Strip, where hundreds of thousands have fled fighting between Israel and Hamas.\nThe locations of the attacks provided by the Civil Defense and the Red Cross hospital appear to be just outside an Israeli-designated safe zone on the Mediterranean coast, known as Muwasi.\n(AP Photo /Jehad Alshrafi) via Associated PressPalestinians pray for victims of Israeli bombardment before their burial in Khan Younis, southern Gaza Strip, Friday, June 21, 2024.\n“And then they hit with the second one, which was a little closer to the entrance of the Red Cross,” she said.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9731021462784624, "event_breakdown": "Target event not relevant."}, {"id": "c0b0a7e6-2300-43b6-be88-bde478575607", "title": "Hezbollah hits Israel naval base with explosion | World | News", "date": "2024-06-22 12:15", "url": "https://www.express.co.uk/news/world/1914116/hezbollah-lebanon-israel-naval-base-drone-strike", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Hezbollah attacks Israeli Naval Base with kamikaze dronesThe Lebanese Hezbollah group executed a precise strike using drones, showcasing their advanced capabilities and marking a significant escalation in the ongoing conflict.\nThe Iran-backed militant group released footage captured by a drone flying over northern Israel, which included views of a naval base, an Iron Dome factory, and Haifa port.\nThe video surfaced just before the group claimed responsibility for the naval base attack, asserting that their drones had achieved \"pinpoint accuracy.\"\nBut I won’t say what they are,\" Nasrallah said, commemorating a top Hezbollah commander recently killed in an Israeli airstrike.\nThis escalation comes amid a protracted period of cross-border skirmishes between Hezbollah and Israel, intensifying after the Israel-Hamas war in Gaza.", "location": "Haifa, Israel", "classification": "security", "score": 0.8973007689574259, "event_breakdown": "Hezbollah attacks Israeli Naval Base with kamikaze drones - Israeli Prime Minister Benjamin Netanyahu said the country's army shot five kamikaze drones fired by Hezbollah UAV Command on Sunday in the Beirut-Damascus area. Lebanese group claims to have launched 40 drones towards Israel."}, {"id": "a46a150a-6798-442f-b875-8c1d63f2142c", "title": "Ukraine complains US is limiting strikes in Russia", "date": "2024-06-22 14:30", "url": "https://www.yahoo.com/news/ukraine-complains-us-limiting-strikes-140451143.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials have denied the claim, with a Pentagon spokesman insisting that Ukraine “has the ability to hit back”.\nWashington had been reluctant to allow US missiles to strike Russia because it was worried about escalating the war.\nThe row over US rules for Ukrainian missile strikes reignited as Russian forces claimed to have used a FAB-3000 M-54 glide bomb, twice the size of its standard FAB-1500 bomb, for the first time in Ukraine.\nA video circulating on Telegram showed massive damage to the village of Lyptsi, in the Kharkiv region, after an alleged FAB-3000 glide bomb strike, even though commentary admitted that it had missed its target.\nSome Russian military bloggers, though, have been less impressed with the emergence of the FAB-3000 glide bomb.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.6744165485556478, "event_breakdown": "Washington had been reluctant to grant permission to US missiles to strike Russia because it was concerned about escalating the war in Ukraine on Friday."}, {"id": "83089d46-265f-430e-8969-aaa43b8f4b4a", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 01:30", "url": "https://www.kawc.org/npr-news/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "kawc.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "Israel", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "Iron Dome has been crucial for Israel during its fights against Hamas\nHamas launched rockets towards Israel's the big city Tel Aviv in retaliation for Israeli air strikes on Monday."}, {"id": "c7ae5c0d-de00-4148-b5a6-f4a6fb229b91", "title": "Could Israel Iron Dome missile defense system hold up in a war with Hezbollah ? ", "date": "2024-06-22 02:15", "url": "https://www.krcu.org/2024-06-21/could-israels-iron-dome-missile-defense-system-hold-up-in-a-war-with-hezbollah", "domain": "krcu.org", "domain_classification": "Unknown", "message": "Now, keeping those weapons from landing in Israel is the job of a sophisticated air defense system called Iron Dome.\nThis missile defense system has its own cartoon.\nTom Karako is an expert in missile defense at the Center for Strategic and International Studies.\nHe says Hamas has shown the first way to beat Iron Dome - with brute force.\nMissile defense expert Tom Karako says that if a war begins, it's inevitable that Iron Dome won't be able to protect Israel's big cities the way it has in the past.", "location": "Israel", "classification": "security", "score": 0.49728692712586475, "event_breakdown": "Israel's Iron Dome can't protect its cities from Hamas missiles\n\nIsrael's Iron Dome missile defense system struggles to protect its cities, according to a recent statement by missile defense expert Tom Karako of the Center for Strategic and International Studies."}, {"id": "3db0764b-b651-4488-8555-d88870767a9f", "title": "Palestinian journo Wael Al - Dahdouh performs Haj on behalf of late wife", "date": "2024-06-22 13:30", "url": "https://www.siasat.com/palestinian-journo-wael-al-dahdouh-performs-haj-on-behalf-of-late-wife-3049044/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Prominent Al Jazeera’s Gaza bureau chief, Wael Hamdan Ibrahim Al-Dahdouh, has performed the Haj pilgrimage this year on behalf of his late wife, who was killed in an Israeli airstrike in the Gaza Strip.\nAl-Dahdouh has been invited by the Saudi Ministry of Information to perform once-in-a-lifetime spiritual journey.\nAlso Read IWMF revokes award from Palestinian journalist Maha HussainiIn an interview with Saudi Press Agency (SPA), Al-Dahdouh said this is the second time in a row he has performed Haj.\nIn January, his other son Hamza Wael Dahdouh, a journalist with the Al Jazeera television network was killed in Gaza by an Israeli airstrike.\nOn January 16, Al-Dahdouh arrived in Qatar for medical treatment after being wounded in an Israeli attack while reporting on the conflict.", "location": "Gaza", "classification": "security", "score": 0.9613665533490853, "event_breakdown": "Location: Palestine\nEvent: Second Al Jazeera journalist is killed by Israeli airstrikes\nDate: Early 2022"}, {"id": "3a589d14-2868-41be-8293-effa162cf3bb", "title": "Former Regional Governor In Russia Released After Serving 8 - Year Term", "date": "2024-06-22 10:00", "url": "https://www.rferl.org/a/former-regional-governor-belykh-released-russia/33003900.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "Sadyqov, an outspoken critic of Kazakh President Qasym-Zhomart Toqaev and his government, was shot on June 18 while he was in his car in the Ukrainian capital and is currently in intensive care.\nHis wife, Natalya Sadyqova, who is also a journalist, was in the vehicle during the attack but was unharmed.\nUkrainian police said investigators established that Sadyqov was shot by two Kazakh suspects -- Altai Zhaqanbaev, born in 1988, and Meiram Qarataev, born in 1991 -- who were added to an international wanted list.\n\"On June 18, one of the suspects approached [Sadyqov's] car and shot him, while his accomplice was near the building to act as a lookout.\nToqaev's spokesman, Berik Uali, said on June 21 that the Kazakh president \"had ordered law enforcement entities to find the two suspects' whereabouts and undertake corresponding measures.\"", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.8789878171551463, "event_breakdown": "Target event:\nUkrainian police said that investigators established that Sadyqov was shot by two Kazakh suspects in the Ukrainian capital Kyiv."}, {"id": "63eadf60-8109-499e-b686-3c99f0071f7f", "title": "Russia Prosecutes Artists , Historian For Alleged  Foreign Agent  Violations", "date": "2024-06-22 10:00", "url": "https://www.rferl.org/a/moentochka-eidelman-troyanova-russia-foreign-agent/33004844.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "Sadyqov, an outspoken critic of Kazakh President Qasym-Zhomart Toqaev and his government, was shot on June 18 while he was in his car in the Ukrainian capital and is currently in intensive care.\nHis wife, Natalya Sadyqova, who is also a journalist, was in the vehicle during the attack but was unharmed.\nUkrainian police said investigators established that Sadyqov was shot by two Kazakh suspects -- Altai Zhaqanbaev, born in 1988, and Meiram Qarataev, born in 1991 -- who were added to an international wanted list.\n\"On June 18, one of the suspects approached [Sadyqov's] car and shot him, while his accomplice was near the building to act as a lookout.\nToqaev's spokesman, Berik Uali, said on June 21 that the Kazakh president \"had ordered law enforcement entities to find the two suspects' whereabouts and undertake corresponding measures.\"", "location": "KYIV", "classification": "security", "score": 0.8789878171551463, "event_breakdown": "Target event is a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nEvent: Kazakh President Qasym-Zhomart Toqaev has ordered law enforcement entities to find the two suspects' whereabouts and undertake corresponding measures."}, {"id": "87d022b3-c5a4-4798-8725-54d6623a2d54", "title": "At least 25 killed after Israeli strikes on Palestinian encampment near Red Cross post", "date": "2024-06-22 10:30", "url": "https://www.irishtimes.com/world/middle-east/2024/06/22/israel-hamas-war-gaza-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "One Israeli strike on houses in Al-Shati, one of the Gaza Strip’s eight historic refugee camps, killed 24 people, Ismail Al-Thawabta told Reuters.\nThe Israeli military said they were looking into the strikes at the reported co-ordinates.\nAt least 10 Palestinians were killed by Israeli fire elsewhere in the Gaza Strip on Friday.\nAn earlier air strike hit a municipal garage in the city and killed five people.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9883994620123623, "event_breakdown": "Israeli Strikes on Al-Shati Refugee Camp in Gaza Kills at Least 24\nAt least 24 people have died following an Israeli air strike in the Al-Shati refugee camp in the Gaza Strip on Friday."}, {"id": "42b7c322-442a-4e3c-a1eb-627a229c76f7", "title": "Updated : Russian attacks damage energy infrastructure in multiple oblasts , casualties reported", "date": "2024-06-22 05:15", "url": "https://www.yahoo.com/news/russian-missiles-strike-energy-infrastructure-025136821.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces launched missile and drone attacks overnight on June 22, targeting critical energy infrastructure in multiple Ukrainian regions.\nUkraine's Energy Ministry said that energy transmission systems were attacked in southern and western regions of Ukraine, causing damage to equipment.\nIn Lviv Oblast, a Russian missile struck a energy infrastructure facility causing a fire to break out, Governor Maksym Kozytskyi reported.\nIn unspecified eastern regions, overhead powerlines were disconnected to \"decrease in load on the generating facility,\" according to Ukraine's Energy Ministry.\nAs a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15, but they have dramatically increased in recent days.", "location": "LVIV OBLAST", "classification": "security", "score": 0.9542002126216688, "event_breakdown": "Russian forces launched missile and drone attacks on energy infrastructure in Ukrainian regions overnight on June 22, causing significant damage and leading to the implementation of rolling blackouts across the country. The attacks took place in Lviv Oblast, western Ukraine, and unspecified regions in the east."}, {"id": "baf03186-f3d5-4e69-b64b-5d2bda84e10e", "title": "Firefighters extinguish fire in Lviv Oblast after Russian nighttime attack", "date": "2024-06-22 10:00", "url": "https://www.yahoo.com/news/firefighters-extinguish-fire-lviv-oblast-073357002.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Firefighters extinguish fire in Lviv Oblast after Russian nighttime attackFirefighters have managed to extinguish a fire in Lviv Oblast caused by a Russian nighttime attack on the morning of Saturday, 22 June.\nSource: Lviv Oblast Military AdministrationDetails: The fire was extinguished after 08:00.\nBackground:On the night of 21-22 June, the Russians launched a missile attack on a critical energy infrastructure facility in Lviv Oblast.\nRussia attacked facilities belonging to the power transmission system operator in Ukraine’s southern and western oblasts.\nTwo power engineers were injured in the attack on one of the facilities.", "location": "LEV' (English: LEV)", "classification": "security", "score": 0.9758971524338121, "event_breakdown": "Firefighters extinguish fire in Lviv Oblast after Russian nighttime attack - Firefighters have managed to extinguish a fire in Lviv Oblast caused by a Russian nighttime attack on the morning of Saturday, 22 June."}, {"id": "99b9f8b8-dae0-40ba-9a24-52e08d74e509", "title": "  Heavy - Caliber Projectile - Israeli Tanks Shell Tents in Al - Mawasi Camp Killing At Least 25", "date": "2024-06-22 10:30", "url": "https://www.palestinechronicle.com/heavy-caliber-projectiles-israeli-tanks-shell-tents-in-al-mawasi-camp-killing-at-least-25/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "By Palestine Chronicle StaffAt least 25 Palestinians were killed and 50 others injured on Friday when Israeli forces shelled tents housing displaced people in the Al-Mawasi area in western Rafah, southern Gaza Strip.\nThe ICRC confirmed in a statement that “heavy-caliber projectiles landed within meters” of its office and residences.\nhttps://t.co/SVrwaQ9cNV — ICRC (@ICRC) June 21, 2024The organization said the location of its office was known to “the parties to the conflict”.\nThe Al-Mawasi area was designated by the Israeli military as a “safe haven” for Palestinians following its ground invasion of Rafah in early May.\nIsrael says that 1,200 soldiers and civilians were killed during the Al-Aqsa Flood Operation on October 7.", "location": "GAZA", "classification": "security", "score": 0.9530700237701515, "event_breakdown": "Location: Al-Mawasi area, western Rafah, southern Gaza Strip\nDate: June 21, 2024\nTarget incident: Israeli forces shelling tents housing displaced people\nVictims: 25 Palestinians killed and 50 others injured\nBackground: The place was designated as a “safe haven” by Israeli military until it shelled."}, {"id": "c1603213-6f0e-4042-bed0-a16989bb5b8e", "title": "At least 22 Palestinians die in missile attack near Red Cross office in Gaza", "date": "2024-06-22 05:30", "url": "https://www.firstpost.com/world/at-least-22-palestinians-die-in-missile-attack-near-red-crosss-office-in-gaza-13784928.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AFPThe International Committee of the Red Cross said 22 people were killed in shelling that damaged its Gaza office Friday, as the Israeli army intensified strikes in the besieged Palestinian territory.\nAdvertisementHis warning came as Israel stepped up its strikes in the Gaza Strip, where one hospital in Gaza City reported at least 30 dead.\nIsrael’s military reported operations on Friday “north and south of the Central Gaza Strip Corridor”.\nThe Israeli army said it had carried out multiple retaliatory strikes on both days.\nAdvertisementExperts are divided on the prospect of a wider war, almost nine months into Israel’s campaign to eradicate Hamas in the Gaza Strip.", "location": "GAZA CITY, GAZA STRIP", "classification": "security", "score": 0.9613305476290003, "event_breakdown": "Relevant events:\n- The ICRC said 22 people were killed in shelling that damaged its Gaza office Friday.\n- Israel’s military carried out multiple retaliatory strikes on Friday.\n- Israel stepped up its strikes in the Gaza Strip.\n- One hospital in Gaza reported at least 30 dead.\n- Israel has carried out multiple retaliatory strikes on Friday."}, {"id": "df091317-19d3-4562-a3e9-0412645843ec", "title": "Red Cross says 22 killed in shelling near Gaza office", "date": "2024-06-22 05:30", "url": "https://www.digitaljournal.com/world/red-cross-says-22-killed-in-shelling-near-gaza-office/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "His warning came as Israel stepped up its strikes in the Gaza Strip, where one hospital in Gaza City reported at least 30 dead.\nIsrael’s military reported operations on Friday “north and south of the Central Gaza Strip Corridor”.\nThe Israeli army said it had carried out multiple retaliatory strikes on both days.\n– ‘Nothing left’ –The violence on the Lebanon border began after the October 7 attack on southern Israel by Hamas militants from Gaza.\n– Two soldiers killed –Israel’s military on Friday identified two more soldiers killed in Gaza, bringing the number killed since ground operations began to at least 312.", "location": "Gaza Strip", "classification": "security", "score": 0.9808771370237188, "event_breakdown": "Israeli strikes continue in the Gaza Strip, killing at least 30 people and injuring hundreds more.\nTwo soldiers were killed on Friday, bringing the number since the start of ground operations to 312.\nThe violence on the Lebanon border began after the 7 October attack on southern Israel by Hamas militants from Gaza."}, {"id": "652dbe59-c534-4758-b02f-45005cca9585", "title": "  There was a flash of light - suddenly , I couldnt hear the children anymore  ", "date": "2024-06-22 07:30", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/there-flash-light-suddenly-couldnt-29329194", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "The two held deeply differing views on whether Northern Ireland should be part of the United Kingdom, or join with the republic of Ireland.\n(Image: Getty Images)The British Government ordered the deployment of troops to Northern Ireland in August 1969.\nTommy's storyIt was a riotous party, and Tommy remembers waking up on the Sunday feeling worse for wear.\nHe could hear the two children at the back of the coach, and distinctly remembers one laughing and one crying.\n(Image: SEFF)\"Young people now don't remember Northern Ireland or understand what went on there,\" he said.", "location": "Northern Ireland", "classification": "security", "score": 0.7347826099732785, "event_breakdown": "The British Government ordered the deployment of troops to Northern Ireland in August 1969.\nIt was a riotous party, and Tommy remembers waking up on the Sunday feeling worse for wear. He could hear the two children at the back of the coach, and distinctly remembers one laughing and one crying.\nNorthern Ireland conflict"}, {"id": "f6da32da-5b7c-4a5d-9f14-9334c2d28d60", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 09:45", "url": "https://www.naharnet.com/stories/en/306080-likely-yemen-houthi-rebel-attack-targets-ship-in-gulf-of-aden-as-eisenhower-reportedly-heads-home", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen's Houthi rebels attempting to target the shipping lane.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw \"explosions in the vicinity of the vessel,\" the British military's United Kingdom Maritime Trade Operations center said.\nThe report said an aircraft carrier operating in the Pacific would be taking the Eisenhower's place.\nThe closest American aircraft carrier known to be operating in Asia is the USS Theodore Roosevelt.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.7186370458719493, "event_breakdown": "New US carrier replacing USS Eisenhower in Arabian Sea; commercial ship targeted in suspected Houthi attack in the Gulf of Aden"}, {"id": "aa0f7416-04f9-4026-8f51-b2ed65ca6e7e", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 10:00", "url": "https://www.naharnet.com:443/stories/en/306080-likely-yemen-houthi-rebel-attack-targets-ship-in-gulf-of-aden-as-eisenhower-reportedly-heads-home", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen's Houthi rebels attempting to target the shipping lane.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw \"explosions in the vicinity of the vessel,\" the British military's United Kingdom Maritime Trade Operations center said.\nThe report said an aircraft carrier operating in the Pacific would be taking the Eisenhower's place.\nThe closest American aircraft carrier known to be operating in Asia is the USS Theodore Roosevelt.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.7186370458719493, "event_breakdown": "1. Houthi rebels in Yemen attacked a commercial ship in the Gulf of Aden on May 7, 2022, triggering explosions in the vicinity of the vessel.\n2. America's response to the Houthi attacks was reportedly led by the USS Dwight D. Eisenhower aircraft carrier, but U.S. officials ordered it to return home, and an aircraft carrier operating in the Pacific would take its place."}, {"id": "3c1220bd-7bb4-40eb-bd54-86478300c6e1", "title": "Russia Vostok Group Foils Ukraine Attempts to Strengthen Positions", "date": "2024-06-22 09:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240621-sputnik06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia's Vostok Group Foils Ukraine's Attempts to Strengthen Positions - Defense MinistrySputnik News20240621MOSCOW (Sputnik) - Russian servicemen of the Vostok (East) battlegroup of troops disrupted attempts by the Armed Forces of Ukraine to strengthen forward positions, group spokesman Alexander Gordeyev told Sputnik.\n\"Units of the Vostok group of forces continue to carry out combat missions in the area of the special military operation.\nDuring active operations, the group's units improved the situation along the front line, disrupted attempts by the enemy to reinforce forward positions and rotation in strong points in the areas of Vladimirovka, Makarovka, Marfopol and Charivnoye,\" Gordeyev said.\nHe said up to 140 enemy servicemen, two armored combat vehicles, six other vehicles, a towed M198 howitzer, 19 aircraft-type drones and three ammunition supply points were destroyed.\nÂ© SputnikNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address", "location": "Ukraine", "classification": "security", "score": 0.9481034499547116, "event_breakdown": "Russia's Vostok Group Foils Ukraine's Attempts to Strengthen Positions - Defense Ministry."}, {"id": "7a14f38f-45b2-4f00-8ce7-0a4ad2e37da9", "title": "Indian Army PARA SF Gets Lethal Edge with Laser Target Designators – Indian Defence Research Wing", "date": "2024-06-22 12:45", "url": "https://idrw.org/indian-armys-para-sf-gets-lethal-edge-with-laser-target-designators/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army’s PARA SF Gets Lethal Edge with Laser Target Designators| BySOURCE: AFIThe Indian Army’s elite PARA Special Forces (SF) have received a significant upgrade in their operational capabilities with the induction of Laser Target Designators (LTDs).\nThese portable devices mark a game-changer for PARA SF, particularly in dense conflict zones, by enabling them to carry out highly precise strikes on enemy positions.\nUpon release, these munitions home in on the reflected laser signature, ensuring pinpoint accuracy and minimal collateral damage.\nThe deployment of LTDs empowers small PARA SF teams on the ground.\nThe ability to guide munitions directly to a target provides PARA SF units with a significant tactical advantage.", "location": "Kashmir", "classification": "security", "score": 0.9231008772742118, "event_breakdown": "Indian Army’s PARA SF Gets Lethal Edge with Laser Target Designators\nIndian Army’s elite PARA Special Forces (SF) have received a significant upgrade in their operational capabilities with the induction of Laser Target Designators (LTDs).\nIndian Army’s elite PARA Special Forces (SF) have received a significant upgrade in their operational capabilities with the induction of Laser Target Designators (LTDs). These portable devices mark a game-changer for PARA SF, particularly in dense conflict zones, by enabling them to carry out highly precise strikes on enemy positions. Upon release, these munitions home in on the reflected laser signature, ensuring pinpoint accuracy and minimal collateral damage. The deployment of LTDs empowers small PARA SF teams on the ground. The ability to guide munitions directly to a target provides PARA SF units with a significant tactical advantage."}, {"id": "5a4aa93e-abc7-4fac-a481-4c3fd3f081ca", "title": "Pro - Iran Iraqi fighter killed in strike on eastern Syria", "date": "2024-06-22 15:15", "url": "https://www.voanews.com/a/pro-iran-iraqi-fighter-killed-in-strike-on-eastern-syria/7666198.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "An Iraqi fighter from an Iran-backed group was killed in an overnight airstrike in eastern Syria near the Iraq border, the group and a war monitor said Saturday.\nThe strike occurred in Deir Ezzor province, where Iran wields significant influence and which is regularly targeted by Israel and the United States, according to the Syrian Observatory for Human Rights.\nSince the beginning of the Syrian civil war in 2011, Israel has carried out hundreds of strikes, primarily targeting pro-Iran groups — which it rarely comments on publicly.\nIn late March, 16 Tehran-affiliated fighters, including an Iranian military adviser, were killed in strikes on eastern Syria.\nThe strikes also killed one civilian working for the World Health Organization.", "location": "Syria", "classification": "security", "score": 0.915969057995654, "event_breakdown": "Reports on the latest overnight airstrike that took place in eastern Syria near the Iraq border, targeting an Iraqi fighter from a pro-Iran group. The Syrian Observatory for Human Rights confirmed the incident, displaying the significant influence of Iran in this particular area of Deir Ezzor Province. which has become a target of regular air strikes by both the United States and Israel."}, {"id": "070527d3-563c-4111-b5bc-f605d38fce4d", "title": "Senior IRGC commander : Israel pleaded Iran not to respond to consulate bombing", "date": "2024-06-22 15:45", "url": "http://www.presstv.ir/Detail/2024/06/22/727931/Top-IRGC-cmdr---Operation-True-Promise-sent-shivers-down-Israel", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "“Iranian officials are not seeking a war.\nThey (Israeli authorities) did not expect Iran to respond,” Hajizadeh stated.\n“They (Israeli officials) conveyed their threats through intermediaries.\nThe senior IRGC commander further noted that Israeli officials reached out to their counterparts in some neighboring countries, begging them to convince Iranian armed forces to lower the intensity of their response.\nIt came after the Israeli attack on April 1 against the Iranian consulate in Damascus, located next to the embassy building in Damascus’s Mezzeh district.", "location": "Damascus, Syria", "classification": "security", "score": 0.9534982971269499, "event_breakdown": "Iranian officials are not seeking a war.\nThey (Israeli authorities) did not expect Iran to respond,” Hajizadeh stated.\nThe Israeli attack on April 1 against the Iranian Consulate in Damascus, located near the Embassy building in Damascus’s Mezzeh district."}, {"id": "6673e2bb-3c96-4b53-a5fe-58dfb8baa41a", "title": "Russian media : Ukrainian forces allegedly hit air defense system in Belgorod Oblast", "date": "2024-06-22 15:15", "url": "https://www.yahoo.com/news/russian-media-ukrainian-forces-allegedly-144133427.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian military has allegedly hit a Pantsir S-1 anti-aircraft missile system in the village of Dubovoe in Belgorod Oblast, Pepel, a media outlet based in the region, claimed on June 22.\nAir defense was operating at around 12:20 p.m. in the region, Belgorod Oblast Governor Vyacheslav Gladkov claimed.\nSign upThe Russian media outlet Pepel later claimed that a Pantsir surface-to-air missile system was hit.\nBelgorod Oblast borders Ukraine's Sumy, Kharkiv, and Luhansk oblasts.\nClaims of missile and drone attacks against the region have recently become a common occurrence after anti-Kremlin Russian militias' incursions into Russian territory.", "location": "Belgorod Oblast", "classification": "security", "score": 0.44701016806532784, "event_breakdown": "Pepel, a media outlet based in the Belgorod Oblast, a border region of the Russian Federation, claims that the Ukrainian military struck the village of Dubovoe in Belgorod Oblast on June 22, striking a Pantsir S-1 anti-aircraft missile system. Air defense was operating in the region around 12:20 p.m., Belgorod Oblast Governor Vyacheslav Gladkov alleges. The Belgorod Oblast borders Ukraine's Sumy, Kharkiv, and Luhansk oblasts. The Russian military launched an offensive in the Luhansk Oblast on June 18. Claims of missile and drone attacks against the Belgorod Oblast have become a common occurrence after anti-Kremlin Russian militias' incursions into Russian territory."}, {"id": "ba52219a-5682-4424-964b-9185706201a5", "title": "Ukraine complains that United States is limiting missile strikes within Russia", "date": "2024-06-22 15:15", "url": "https://www.telegraph.co.uk/world-news/2024/06/22/ukraine-complains-us-is-limiting-strikes-in-russia/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The US gave Ukraine permission to strike targets inside Russia with US-made missiles at the beginning of this month after the Kremlin launched an attack across the border towards Kharkiv.\nWashington had been reluctant to allow US missiles to strike Russia because it was worried about escalating the war.\nThe row over US rules for Ukrainian missile strikes reignited as Russian forces claimed to have used a FAB-3000 M-54 glide bomb, twice the size of its standard FAB-1500 bomb, for the first time in Ukraine.\nA video circulating on Telegram showed massive damage to the village of Lyptsi, in the Kharkiv region, after an alleged FAB-3000 glide bomb strike, even though commentary admitted that it had missed its target.\n“The strike was not particularly accurate, but the destruction radius of the FAB-3000 will compensate for its lack of accuracy,” it said.", "location": "Kharkiv region", "classification": "security", "score": 0.6169060360265334, "event_breakdown": "US gave Ukraine permission to strike targets inside Russia with US-made missiles - The timing coincides with a US move to offer more powerful weapons to counter the Russian offensive as the war enters a \"new phase\""}, {"id": "e77be296-a1ca-40f0-b2cc-03db37a94060", "title": "Ukraine complains US is limiting strikes in Russia", "date": "2024-06-22 14:45", "url": "https://www.aol.co.uk/news/ukraine-complains-us-limiting-strikes-140451544.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Officials have denied the claim, with a Pentagon spokesman insisting that Ukraine “has the ability to hit back”.\nWashington had been reluctant to allow US missiles to strike Russia because it was worried about escalating the war.\nThe row over US rules for Ukrainian missile strikes reignited as Russian forces claimed to have used a FAB-3000 M-54 glide bomb, twice the size of its standard FAB-1500 bomb, for the first time in Ukraine.\nA video circulating on Telegram showed massive damage to the village of Lyptsi, in the Kharkiv region, after an alleged FAB-3000 glide bomb strike, even though commentary admitted that it had missed its target.\nSome Russian military bloggers, though, have been less impressed with the emergence of the FAB-3000 glide bomb.", "location": "Kharkiv region.", "classification": "security", "score": 0.6744165485556478, "event_breakdown": "Target Event:\nUkraine’s demands for more powerful weapons, including tanks and jets, has so far been blocked by Washington, which fears it could lead to an escalation of the conflict. Recently, Ukraine’s foreign minister claimed the United States was preventing him from launching air attacks on Russia, an allegation that was denied by a Pentagon spokesperson. The Pentagon spokesperson said that Ukraine has the ability to strike back at Russia, and that the United States would not limit Ukraine’s combat capabilities."}, {"id": "898ac671-be28-474c-a7f7-88052fcfd411", "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50 , Gaza health officials say", "date": "2024-06-22 17:00", "url": "https://www.princegeorgecitizen.com/world-news/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say-9118714", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "The Health Ministry in Gaza reported the number of people killed and wounded in the attacks.\nThe locations of the attacks provided by the Civil Defense appear to be just outside an Israeli-designated safe zone.\nThe Israeli military said the episode was under review but that “there is no indication that a strike was carried out by the IDF” inside the safe zone, using an acronym for the Israeli forces.\nIsrael is pushing ahead with the military operation in Rafah, where over a million Palestinians had sought refuge from fighting elsewhere in Gaza.\nAt least 10 Palestinians were killed by Israeli fire elsewhere in the Gaza Strip on Friday.", "location": "GAZA", "classification": "security", "score": 0.9756297352837143, "event_breakdown": "At least 10 Palestinians killed by Israeli fire elsewhere in Gaza Strip on Friday. Israeli military operation in Rafah where over a million Palestinians had sought refuge from fighting elsewhere in Gaza."}, {"id": "9c01a7d4-a80e-4b81-8456-5f8ed743cd4f", "title": "Monitor says three pro - Iran fighters killed in eastern Syria strike", "date": "2024-06-22 19:30", "url": "https://www.yahoo.com/news/monitor-says-three-pro-iran-182803414.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Members of Iraq's Hashed al-Shaabi alliance carry the coffin in Baghdad of Abdullah Razzaq Anoun al-Safi, killed in the strike on the border with Syria (Murtadha RIDHA)A war monitor on Saturday said three pro-Iran fighters, including at least two Iraqis, were killed in an overnight air strike in eastern Syria near the Iraq border.\nAccording to the Syrian Observatory for Human Rights, the strike occurred in Deir Ezzor province.\nThe Britain-based monitor, which relies on a network of sources inside Syria, said an explosion was heard coinciding with the strike \"in Albukamal countryside... a few kilometres away from Syrian-Iraqi borders\".\nSince the beginning of the Syrian civil war in 2011, Israel has carried out hundreds of strikes mainly targeting army positions and Iran-backed fighters including from Lebanon's Hezbollah group.\nIn late March, the Observatory said 16 Tehran-affiliated fighters, including an Iranian Revolutionary Guard, were killed in strikes on eastern Syria.", "location": "Deir Ezzor province, Syria", "classification": "security", "score": 0.9578742313464594, "event_breakdown": "Reported security events that are happening in the current time frame, that have a specific location, include:\n* Three pro-Iran fighters, including two Iraqis, were killed in an overnight air strike in eastern Syria near the Iraq border."}, {"id": "83d04796-b14f-4119-90c6-9551c7dbd46d", "title": "Monitor says three pro - Iran fighters killed in eastern Syria strike", "date": "2024-06-22 19:30", "url": "https://www.al-monitor.com/originals/2024/06/monitor-says-three-pro-iran-fighters-killed-eastern-syria-strike", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 22, 2024 — Beirut (AFP)A war monitor on Saturday said three pro-Iran fighters, including at least two Iraqis, were killed in an overnight air strike in eastern Syria near the Iraq border.\nAccording to the Syrian Observatory for Human Rights, the strike occurred in Deir Ezzor province.\nThe Britain-based monitor, which relies on a network of sources inside Syria, said an explosion was heard coinciding with the strike \"in Albukamal countryside... a few kilometres away from Syrian-Iraqi borders\".\nSince the beginning of the Syrian civil war in 2011, Israel has carried out hundreds of strikes mainly targeting army positions and Iran-backed fighters including from Lebanon's Hezbollah group.\nIn late March, the Observatory said 16 Tehran-affiliated fighters, including an Iranian Revolutionary Guard, were killed in strikes on eastern Syria.", "location": "Syria", "classification": "security", "score": 0.936860571804487, "event_breakdown": "June 22, 2024 — Beirut (AFP)A war monitor said three pro-Iran fighters, including at least two Iraqis, were killed in an overnight airstrike in eastern Syria near the Iraq border in Deir Ezzor province. The Britain-based monitor, which relies on a network of sources inside Syria, said an explosion was heard coinciding with the strike \"in Albukamal countryside... a few kilometres away from Syrian-Iraqi borders\"."}, {"id": "cba883a7-0dd4-46fb-88db-1cd34eed2e0d", "title": "Yemen Houthi rebel attack targets a ship in the Gulf of Aden as the Eisenhower reportedly heads home | World News", "date": "2024-06-22 17:00", "url": "https://indianexpress.com/article/world/yemen-houthi-rebel-attack-ship-gulf-of-aden-eisenhower-returns-us-9408926/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "An attack by Yemen's Houthi rebels targeted a commercial ship traveling through the Gulf of Aden but apparently caused no damage, authorities said Saturday, in the latest strike on the shipping lane by the group.\nMeanwhile, US officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.", "location": "The main event is in the Gulf of Aden.", "classification": "security", "score": 0.8879953166897009, "event_breakdown": "Target event:\nYemeni Houthi rebels launched a missile attack on a commercial ship traveling through the Gulf of Aden, causing no damage."}, {"id": "376b1237-7f1b-4827-846f-709fcc2bc932", "title": "Number of people injured in Kharkiv rises to 56 , including three children – video", "date": "2024-06-22 19:30", "url": "https://www.yahoo.com/news/number-people-injured-kharkiv-rises-174700433.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Number of people injured in Kharkiv rises to 56, including three children – videoThree people were killed and 56 injured, including three children, in a Russian airstrike on Kharkiv on Saturday.\nSource: President Volodymyr Zelenskyy in his evening address; State Emergency Service; Kharkiv Oblast police; Kharkiv Oblast Prosecutor’s OfficeQuote from Zelenskyy: \"In Kharkiv, the rubble is still being cleared away at the site of the Russian bomb attack.\nDetails: Zelenskyy added that since the beginning of June alone, the Russians have used more than 2,400 guided bombs against Ukraine, including about 700 against Kharkiv Oblast.\nKharkiv Oblast police have reported three people killed and 43 injured in Kharkiv.\nSerhii Bolvinov, chief investigator of the Kharkiv Oblast police, said that all the people injured in the Russian attack were civilians.", "location": "Kharkiv", "classification": "security", "score": 0.8746804859721251, "event_breakdown": "Target event found:\nRussian airstrike on Ukraine's second-largest city Kharkiv killed three people and injured 56, including three children."}, {"id": "34314ec4-aae4-4343-a5d3-47a9d45c20df", "title": "Houthis attack ship as USS Eisenhower reportedly departs", "date": "2024-06-22 16:15", "url": "https://www.ctvnews.ca/world/yemen-houthi-rebel-attack-targets-a-ship-in-the-gulf-of-aden-as-the-eisenhower-reportedly-heads-home-1.6937254", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Meanwhile, U.S. officials ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw \"explosions in the vicinity of the vessel,\" the British military's United Kingdom Maritime Trade Operations centre said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.\nSaree on Saturday night claimed another attack on the carrier -- but again provided no evidence to support it as the ship already had left the area.", "location": "RED SEA", "classification": "security", "score": 0.6520591721562194, "event_breakdown": "Target Event:\nThe British military's United Kingdom Maritime Trade Operations center said late Friday that the captain of a ship targeted under unclear circumstances in the Red Sea saw \"explosions in the vicinity of the vessel.\""}, {"id": "5673cacb-b293-4c3b-b2b1-54151c912a29", "title": "Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 18:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/22/fgn34-yemen-rebels-ship-ld-attack.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Meanwhile, US officials reportedly ordered the USS Dwight D Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel”, the British military's United Kingdom Maritime Trade Operations centre said.\nBrig Gen Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.\nSaree on Saturday night claimed another attack on the carrier — but again provided no evidence to support it as the carrier was reportedly already scheduled to leave the region.", "location": "According to the text, the USS Dwight D Eisenhower was leading America's response to the Houthi attacks in the Red Sea", "classification": "security", "score": 0.5375550606747014, "event_breakdown": "Target event: Houthis hit commercial ship in Red Sea off Yemen\nEvent:\nOn Saturday, Houthi rebels in Yemen targeted a commercial ship in the Red Sea off Yemen's coast\nHouthi military spokesman Brigadier General Yahya Saree said that the group had hit the bulk carrier \"Transworld Navigator\" late on Friday\nThe UK military's United Kingdom Maritime Trade Operations center had earlier said that the captain of a vessel saw \"explosions in the vicinity of the vessel\"\nUS officials, meanwhile, had ordered the aircraft carrier USS Dwight D Eisenhower, leading America's response to the Houthi attacks, to return after a twice-extended tour"}, {"id": "d2ae57de-b2ec-461c-976a-05cdca4ebde8", "title": "At least 39 people killed in Israeli strikes across northern Gaza , officials say", "date": "2024-06-22 19:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/22/at-least-39-people-killed-in-israeli-strikes-across-northern-gaza-officials-say/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "At least 39 people were killed by Israeli strikes across northern Gaza on Saturday, according to Palestinian and hospital officials.\nThe member was the seventh killed by Israeli strikes in Lebanon since the war began.\nOver the same period, Palestinians in the West Bank have killed at least nine Israelis, including five soldiers, according to UN data.\nIsraeli nationals are prohibited from entering Qalqilya and other areas of the West Bank that fall under the under the control of the Palestinian Authority.\nOver recent years, the Palestinian Authority’s influence in the northern West Bank has waned as militant groups have grown increasingly powerful.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9468074981164387, "event_breakdown": "At least 39 people were killed by Israeli strikes across northern Gaza on Saturday.\nThe Lebanese army killed an Israeli soldier outside the border town of Adayiri on Tuesday.\nIsraeli nationals are prohibited from entering Qalqilya and other areas of the West Bank.\nOver recent years, the influence of the Palestinian Authority in northern West Bank has waned as militant groups have grown increasingly powerful."}, {"id": "0e2d06a3-585f-474d-bb11-e5d4def31d1f", "title": "Yemen Houthi rebel attack targets a ship in the Gulf of Aden as the Eisenhower reportedly heads home", "date": "2024-06-22 17:15", "url": "https://www.thestar.com/news/world/middle-east/yemen-houthi-rebel-attack-targets-a-ship-in-the-gulf-of-aden-as-the-eisenhower/article_cc2203ce-75f6-5f7e-b16a-fc793d77aa88.html", "domain": "thestar.com", "domain_classification": "Unknown", "message": "CountryUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary People's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Ara", "location": "Based on the provided information, it was not possible to determine the exact location where the main event takes place.", "classification": "security", "score": 0.9076731225265205, "event_breakdown": "United States of America: Protests continue across the US in response to the killing of George Floyd.\nMexico, United Mexican States: The government deploys military troops in response to the increasing violence from drug cartels.\nBahamas, Commonwealth of the: Police search for six American tourists who went missing during a trip to the Bahamas.\nCanada: Military deployed to assist with security in First Nations communities after a string of murders and disappearances.\nHong Kong Special Administrative Region of China: Protests continue against the Chinese government in Hong Kong."}, {"id": "70665fbf-13c1-48c0-889a-62f3c2b59c73", "title": "Yemen Houthi rebels target ship in the Gulf of Aden as the Eisenhower aircraft carrier heads home – Metro US", "date": "2024-06-22 18:45", "url": "https://www.metro.us/yemens-houthi-rebels-target-ship-in-the-gulf-of-aden-as-the-eisenhower-aircraft-carrier-heads-home/", "domain": "metro.us", "domain_classification": "Unknown", "message": "Meanwhile, the U.S. military ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America’s response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military’s United Kingdom Maritime Trade Operations center said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had already reached the Mediterranean Sea, said a U.S. official, who spoke on condition of anonymity to discuss ship movements.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.", "location": "The main event takes place at sea in the Red Sea.", "classification": "security", "score": 0.5640043861813283, "event_breakdown": "Houthi rebels targeting USS Dwight D. Eisenhower in the Red Sea, and an unidentified bulk carrier in the Gulf of Aden."}, {"id": "f8a80eea-7a2b-4adb-898e-50fbe6719fc0", "title": "Zelensky demands  bold decision as US accused of restricting weapons", "date": "2024-06-22 18:45", "url": "https://www.aol.com/zelensky-demands-bold-decisions-us-170144432.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Volodymyr Zelensky has called for “bold decisions” from Kyiv’s allies after a Russian guided bomb strike killed at least three people in Kharkiv, Ukraine’s second-largest city.\nHere’s a roundup of the day’s events:Zelensky demanded “bold decisions” from allies after the US was accused of restricting cross-border attacks.\nA Russian guided bomb attack killed at least two people in Kharkiv.\nOne suspect reportedly posted firing locations in the Kupiansk district of the Kharkiv region, as well as defensive positions near Robotyne in the Zaporizhzhia region.\nIn the Kharkiv region a drone hit a postal vehicle, killing its female driver, the area’s governor said.", "location": "Kharkiv", "classification": "security", "score": 0.9786095619026176, "event_breakdown": "Volodymyr Zelensky has called for “bold decisions” from Kyiv’s allies after a Russian guided bomb strike killed at least three people in Kharkiv, Ukraine’s second-largest city.\nA Russian guided bomb attack killed at least two people in Kharkiv.\nIn the Kharkiv region a drone hit a postal vehicle, killing its female driver, the area’s governor said."}, {"id": "987fda16-58a0-4803-bd21-e130e2a01a4b", "title": "Zelensky demands  bold decision as US accused of restricting weapons", "date": "2024-06-22 17:30", "url": "https://www.aol.co.uk/news/zelensky-demands-bold-decisions-us-170144501.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Volodymyr Zelensky has called for “bold decisions” from Kyiv’s allies after a Russian guided bomb strike killed at least three people in Kharkiv, Ukraine’s second-largest city.\nHere’s a roundup of the day’s events:Zelensky demanded “bold decisions” from allies after the US was accused of restricting cross-border attacks.\nA Russian guided bomb attack killed at least two people in Kharkiv.\nOne suspect reportedly posted firing locations in the Kupiansk district of the Kharkiv region, as well as defensive positions near Robotyne in the Zaporizhzhia region.\nIn the Kharkiv region a drone hit a postal vehicle, killing its female driver, the area’s governor said.", "location": "Kharkiv", "classification": "security", "score": 0.9786095619026176, "event_breakdown": "Target Event:\nA Russian guided bomb attack killed at least two people in Kharkiv | A postal vehicle was struck by a drone in the Kharkiv region, killing a woman."}, {"id": "c478135f-2f22-496a-b88f-6e876d1862da", "title": "Russian bomb attack on Kharkiv kills three and wounds 38 people", "date": "2024-06-22 18:15", "url": "https://www.theguardian.com/world/article/2024/jun/22/russian-bomb-attack-on-kharkiv-kills-three-and-wounds-38-people", "domain": "theguardian.com", "domain_classification": "International", "message": "At least three people were killed in a Russian bombing attack on Ukraine’s second city, Kharkiv, on Saturday afternoon, Ukrainian president Volodymyr Zelenskiy said.\nAnother 52 people were wounded in the attack, Kharkiv mayor Ihor Terekhov said.\nRussia had also continued to target Ukraine’s energy infrastructure with a new barrage of missiles and drones overnight, officials in Kyiv said.\nMoscow’s overnight attack on Zaporizhzhia and Lviv followed Ukrainian military strikes on three oil refineries in southern Russia overnight into Friday.\nA policeman was killed in the partly occupied region of Kherson as a result of a Russian drone attack on a checkpoint, the Ukrainian national police said.", "location": "Kharkiv", "classification": "security", "score": 0.9431853752033337, "event_breakdown": "1. Three people were killed and 52 wounded in a Russian bombing attack on Ukraine’s second city of Kharkiv on Saturday afternoon, Ukrainian president Volodymyr Zelenskiy said.\n2. A policeman was killed in the partly occupied region of Kherson as a result of a Russian drone attack on a checkpoint, the Ukrainian national police said."}, {"id": "7443571f-bdbf-436d-b934-45ac3d5b277b", "title": "Russia Strikes Ukrainian Energy Facilities , 3 Died In Kharkiv Bombing , 38 Wounded", "date": "2024-06-22 18:45", "url": "https://www.news18.com/world/russia-strikes-ukrainian-energy-facilities-3-died-in-kharkiv-bombing-38-wounded-8941323.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "At least three people were killed in a Russian bombing attack on Ukraine’s second city, Kharkiv, on Saturday afternoon, Ukrainian President Volodymyr Zelenskyy said.\nAnother 38 people were wounded in the attack, Kharkiv Mayor Ihor Terekhov said.\nRussia has also continued to target Ukraine’s energy infrastructure with a new barrage of missiles and drones overnight, officials in Kyiv said.\nTwo energy workers were injured in Zaporizhzhia when a fire broke out at an energy facility, according to regional Gov.\nMoscow’s overnight attack on Zaporizhzhia and Lviv follows Ukrainian military strikes on three oil refineries in southern Russia overnight into Friday.", "location": "KHARKIV", "classification": "security", "score": 0.9406018541843342, "event_breakdown": "Three people were killed and 38 were injured in a Russian bombing attack on Ukraine’s second city, Kharkiv, on Saturday afternoon. The target was a residential area in Kharkiv's Freedom Square. Russia continues to fire missiles at Ukraine's energy infrastructure, and an overnight attack on a power plant in Lviv killed no one."}, {"id": "cd15bbd6-1389-4ab5-92fb-a7e31972d6af", "title": "Russia launches new  massive  attack on Ukraine power network", "date": "2024-06-22 15:15", "url": "https://www.digitaljournal.com/world/russia-launches-new-massive-attack-on-ukraine-power-network/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Russia launched 16 cruise missiles from land, sea and air as well as 13 attack drones, aiming at energy infrastructure in several regions, Ukraine’s military said.\nIt said it also targeted warehouses containing munitions and “air-launched weapons provided to the Ukrainian military by western countries”.\nThe Ukrainian energy ministry said this was Russia’s “eighth massive, combined attack on energy infrastructure facilities” in the past three months, targeting the southern Zaporizhzhia region and Lviv in the west.\nRussian attacks have destroyed half of Ukraine’s energy capacity, according to President Volodymyr Zelensky.\nThe head of Russian authorities in the Donetsk region, Denis Pushilin, said the separatist-controlled city of Donetsk and the nearby town of Gorlivka had come under heavy attack from Ukraine.", "location": "The main location where the main event takes place is Ukraine.", "classification": "security", "score": 0.6195144325414857, "event_breakdown": "Russia attacking Ukraine's energy infrastructure (May 2022)"}, {"id": "88d4c958-b156-48de-89c6-5d6a41fc61fb", "title": "More than 50 people killed or missing in Israeli strikes on central Gaza , local officials say", "date": "2024-06-22 16:15", "url": "https://www.yahoo.com/news/more-50-people-killed-missing-145618047.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "More than 50 people killed or missing in Israeli strikes on central Gaza, local officials sayFifty-two people have been killed or left missing in Israeli strikes near Gaza city on Saturday, according to the Hamas-controlled Government Media Office (GMO).\nAnother strike was reported against a residential block in Al Shati, another neighborhood near Gaza City.\nThe Israel Defense Forces (IDF), in a brief statement Saturday, said that IDF fighter jets had struck “Hamas military infrastructure” sites in the area of Gaza City.\nPalestinians search for casualties in Gaza City.\nThe flyers dropped in Gaza City were different from those dropped in Khan Younis, displaying different hostages.", "location": "GAZA CITY", "classification": "security", "score": 0.9801041620736692, "event_breakdown": "Fifty people were killed or left missing in Israeli strikes on Gaza on Saturday, the Hamas government media office said. No other relevant events have been found."}, {"id": "dd87a836-76c1-473a-8438-981bdaa773c5", "title": "Russia Launches New  Massive  Attack on Ukraine Power Network", "date": "2024-06-22 15:15", "url": "https://www.themoscowtimes.com/2024/06/22/russia-launches-new-massive-attack-on-ukraine-power-network-a85493", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "The Ukrainian energy ministry said this was Russia's \"eighth massive, combined attack on energy infrastructure facilities\" in three months.\nRussia said its troops \"carried out a group strike with long-range high-precision weaponry from air and sea and also drones on Ukrainian energy facilities that power arms production.\"\nUkraine's Energy Ministry said equipment at operator Ukrenergo \"facilities in the Zaporizhzhia and Lviv regions was damaged.\"\nRussia's Defense Ministry said troops had improved positions in the Donetsk and Luhansk regions and the Kharkiv region.\nIn Russia's southern Belgorod region, a man was killed in the shelling of a business near the border with Ukraine's Kharkiv, said Governor Vyacheslav Gladkov.", "location": "Ukraine", "classification": "security", "score": 0.7179465000295571, "event_breakdown": "Russia's attack on Ukrainian energy facilities that powers arms production is located in Zaporizhzhia and Lviv regions."}, {"id": "85f12fd4-93ff-47b6-9d2b-66371bbea772", "title": "Israel - Gaza conflict : More than 50 people killed or missing in Israeli strikes on central Gaza , local officials say", "date": "2024-06-22 16:00", "url": "https://us.cnn.com/2024/06/22/middleeast/israel-gaza-central-strikes-dozens-killed-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Fifty-two people have been killed or left missing in Israeli strikes near Gaza city on Saturday, according to the Hamas-controlled Government Media Office (GMO).\nAnother strike was reported against a residential block in Al Shati, another neighborhood near Gaza City.\nThe Israel Defense Forces (IDF), in a brief statement Saturday, said that IDF fighter jets had struck “Hamas military infrastructure” sites in the area of Gaza City.\nPalestinians search for casualties in Gaza City.\nThe flyers dropped in Gaza City were different from those dropped in Khan Younis, displaying different hostages.", "location": "GAZA CITY", "classification": "security", "score": 0.9723618441870489, "event_breakdown": "IDF air strikes on Gaza city kill 52, according to Hamas-controlled Government Media Office (GMO). Another strike reported against residential block in Al Shati. The IDF strikes came after Hamas fired rockets into Israel earlier Saturday."}, {"id": "71325a0a-d8b3-48ee-9810-7bfc616378ef", "title": "Israel - Gaza conflict : More than 50 people killed or missing in Israeli strikes on central Gaza , local officials say", "date": "2024-06-22 18:15", "url": "https://edition.cnn.com/2024/06/22/middleeast/israel-gaza-central-strikes-dozens-killed-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Fifty-two people have been killed or left missing in Israeli strikes near Gaza city on Saturday, according to the Hamas-controlled Government Media Office (GMO).\nAnother strike was reported against a residential block in Al Shati, another neighborhood near Gaza City.\nThe Israel Defense Forces (IDF), in a brief statement Saturday, said that IDF fighter jets had struck “Hamas military infrastructure” sites in the area of Gaza City.\nPalestinians search for casualties in Gaza City.\nThe flyers dropped in Gaza City were different from those dropped in Khan Younis, displaying different hostages.", "location": "GAZA CITY", "classification": "security", "score": 0.9723618441870489, "event_breakdown": "Fifty two people were killed or left missing in Israeli strikes near Gaza city on Saturday, according to the Hamas-controlled Government Media Office (GMO). Another strike was reported against a residential block in Al Shati, another neighborhood near Gaza City. The Israel Defense Forces (IDF), in a brief statement Saturday, said that IDF fighter jets had struck “Hamas military infrastructure” sites in the area of Gaza City."}, {"id": "ea7f32ed-4c9b-4bda-867f-dc03f66cbe4c", "title": "Israel strike kills Ayman Ghatma Hamas terrorist  weapons supplier  Khiara 25 miles inside Lebanon", "date": "2024-06-22 18:15", "url": "https://www.telegraph.co.uk/world-news/2024/06/22/israel-drone-kills-hamas-terrorist-lebanon-bombs-gaza-city/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "A high-profile Hamas terrorist was killed in an airstrike in Lebanon’s Bekaa district, Israeli media reported on Saturday.\nAt least 42 people were also killed in separate Israeli attacks on districts of Gaza City in the north of the Palestinian enclave on Saturday, the director of the Hamas-run government media office said.\nThe Gaza strikes were reportedly also aimed at assassinating a senior Hamas leader.\nThe Israel Defense Forces (IDF) released a video of the drone strike that killed Ayman Ghatma, a Hamas terrorist, as he travelled in a car near the town of Khiara, some 25 miles from the Israeli border.\nLebanese media showed an image of the blackened wreckage of the vehicle, still in flames.", "location": "Lebanon", "classification": "security", "score": 0.9579346707003562, "event_breakdown": "Here are the current security events reported in text this week:\n1. A high-profile Hamas terrorist was killed in an airstrike in Lebanon’s Bekaa district, Israeli media reported on Saturday.\n2. Israeli airstrikes on Saturday killed 42 people and wounded 50 in separate districts of Gaza City to the north of the Palestinian enclave, the director of the Hamas-run government media office said."}, {"id": "c3737c98-28b8-42e3-be23-af2539bb6bfd", "title": "Israels raids on refugee camps , houses kill over 100 in 24 hours in Gaza", "date": "2024-06-22 15:45", "url": "http://www.presstv.ir/Detail/2024/06/22/727938/Israel-strikes-kill-Palestinians-Gaza", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Israeli troops have carried out yet another massacre in the Gaza Strip, killing at least 101 people in refugee camps and residential areas over the past 24 hours, the Health Ministry says.\nOne airstrike on houses in the al-Shati refugee camp killed 24 people on Saturday, according to the director of the Gaza media office.\nAnother 18 Palestinians were also killed in a strike on houses in the al-Tuffah neighborhood, said Ismail al-Thawabta.\nThe regime’s forces, the Health Ministry said, killed at least 101 Palestinians and wounded 169 in the latest 24-hour reporting period.\nThis is the highest daily death toll in Gaza since the regime’s forces killed at least 274 Palestinians in an attack on the al-Nuseirat refugee camp on June 8.", "location": "GAZA", "classification": "security", "score": 0.93856751137383, "event_breakdown": "Israeli troops have carried out yet another massacre in the Gaza Strip, killing at least 101 people in refugee camps and residential areas over the past 24 hours, the Health Ministry said. This is the highest daily death toll in Gaza since the regime’s forces killed at least 274 Palestinians in an attack on the al-Nuseirat refugee camp on June 8."}, {"id": "97c73d0f-b7b9-44f2-bc89-6f39623a6e94", "title": "Detectives nab suspect in fatal stabbing of 40 - year - old man in Manhattan subway station : police", "date": "2024-06-22 19:30", "url": "https://www.yahoo.com/news/detectives-nab-suspect-fatal-stabbing-183000954.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A 24-year-old man has been arrested for the fatal stabbing of a well-liked musician and fashionista during a clash at a Manhattan subway station, cops said Saturday.\nDiego Figueroa-Hepner faces murder and weapons possession charges in the deadly attack on 40-year-old Johnny Medina near the turnstiles at the 175th St. A train subway station in Washington Heights around 5:55 p.m. Friday, cops said.\nWhen they reached the mezzanine, Figueroa-Hepner flashed a knife and lunged at Medina, viciously stabbing him repeatedly in the chest and neck, cops said.\nMedina was a popular musician and fashion enthusiast known as “J McFly” in the community, said his friend, Alberto Frozani.\n“He was a designer, a real fashionista.”Frozani said he was shocked as paramedics carried his dying friend out of the subway station and into an ambulance.", "location": "Manhattan subway", "classification": "security", "score": 0.44680566541348776, "event_breakdown": "Target event:\nA 24-year-old man has been arrested for the fatal stabbing of a 40-year-old man near a subway station in Manhattan, New York. The suspect, Diego Figueroa-Hepner, was charged with murder and weapons possession."}, {"id": "1126cc81-c6c3-46c3-8e7d-dc4f4b01476a", "title": "Detectives nab suspect in fatal stabbing of 40 - year - old man in Manhattan subway station : police", "date": "2024-06-22 19:30", "url": "https://www.nydailynews.com/2024/06/22/detectives-nab-suspect-in-fatal-stabbing-of-40-year-old-man-in-manhattan-subway-station-police/", "domain": "nydailynews.com", "domain_classification": "Unknown", "message": "A 24-year-old man has been arrested for the fatal stabbing of a well-liked musician and fashionista during a clash at a Manhattan subway station, cops said Saturday.\nDiego Figueroa-Hepner faces murder and weapons possession charges in the deadly attack on 40-year-old Johnny Medina near the turnstiles at the 175th St. A train subway station in Washington Heights around 5:55 p.m. Friday, cops said.\nWhen they reached the mezzanine, Figueroa-Hepner flashed a knife and lunged at Medina, viciously stabbing him repeatedly in the chest and neck, cops said.\nMedina was a popular musician and fashion enthusiast known as “J McFly” in the community, said his friend, Alberto Frozani.\n“He was a designer, a real fashionista.”Frozani said he was shocked as paramedics carried his dying friend out of the subway station and into an ambulance.", "location": "Manhattan subway station", "classification": "security", "score": 0.44680566541348776, "event_breakdown": "Medina was a popular musician and fashion enthusiast known as \"J McFly\" in the community, said his friend, Alberto Frozani.\n\"He was a designer, a real fashionista.\"\nFrozani said he was shocked as paramedics carried his dying friend out of the subway station and into an ambulance."}, {"id": "6715b2bc-38b9-43ef-a45e-a9a93a6e7898", "title": "More than 50 people killed or missing in Israeli strikes on central Gaza , local officials say - LocalNews8 . com", "date": "2024-06-22 17:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/22/more-than-40-people-killed-or-missing-in-strikes-on-central-gaza/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "By Eyad Kourdi and Ibrahim Dahman, CNN(CNN) — Fifty-two people have been killed or left missing in Israeli strikes near Gaza city on Saturday, according to the Hamas-controlled Government Media Office (GMO).\nAnother strike was reported against a residential block in Al Shati, another neighborhood near Gaza City.\nThe strike hit the tents of displaced people in the Palestinian town of Mawasi, parts of which have been identified by the Israeli military as a humanitarian zone.\nIsrael drops hostage flyersAlso on Saturday, the Israeli military dropped at least two different leaflets with the names and photos of hostages over various locations in the Gaza Strip.\nThe flyers dropped in Gaza City were different from those dropped in Khan Younis, displaying different hostages.", "location": "GAZA CITY", "classification": "security", "score": 0.9814186922709135, "event_breakdown": "Eyad:\nIsrael is bombing the Gaza Strip, killing 52 people."}, {"id": "f8aad010-0742-4933-af76-3e3b6984c397", "title": "Carroll Yesteryears : Corbit Charge observance , set for June 29 , began with Tom LeGore – Baltimore Sun", "date": "2024-06-22 15:15", "url": "https://www.baltimoresun.com/2024/06/22/carroll-yesteryears-corbits-charge-observance-set-for-june-29-began-with-tom-legore/", "domain": "baltimoresun.com", "domain_classification": "Unknown", "message": "🚌 When is the last day of school?", "location": "MIAMI", "classification": "security", "score": 0.6409861360240026, "event_breakdown": "[\n  {\n    \"long\": \"today\",\n    \"type\": \"school\",\n    \"district\": \"Los Alamitos Unified\",\n    \"city\": \"Los Alamitos\",\n    \"county\": \"Orange County\"\n  },\n  {\n    \"long\": \"in-the-next-fortnight\",\n    \"type\": \"legislation-bill\",\n    \"authors\": [\n      \"Nancy Pelosi\"\n    ],\n    \"title\": \"H.R. 3223\",\n    \"summary\": \"H.R. 3223 was introduced by Nancy Pelosi.\"\n  },\n  {\n    \"date\": \"2023-02-25\",\n    \"type\": \"news-event\",\n    \"title\": \"UK troops involved in Iraq\",\n    \"summary\": \"UK troops are withdrawing from Iraq.\"\n  },\n  {\n    \"long\": \"this-weekend\",\n    \"type\": \"meeting\",\n    \"location\": \"Sue Storm's House\",\n    \"participants\": [\n      \"The Fantastic Four\","}, {"id": "954bf060-99d0-4d2b-a9d7-5b58e3533f1c", "title": "Dayhoff : Danny Bohn was a leader who served the Carroll community in many ways", "date": "2024-06-22 15:15", "url": "https://www.baltimoresun.com/2024/06/22/dayhoff-danny-bohn-was-a-leader-who-served-the-carroll-community-in-many-ways/", "domain": "baltimoresun.com", "domain_classification": "Unknown", "message": "🚌 When is the last day of school?", "location": ")\nBased on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.6409861360240026, "event_breakdown": "It appears that there are no current events of security reported in text that have a specific location. It is possible that there were not enough events or none that met the specified criteria."}, {"id": "36270150-a387-44be-a5e3-0917111391f4", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 05:15", "url": "https://www.yahoo.com/news/likely-yemen-houthi-rebel-attack-043759897.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - The USS aircraft carrier Dwight D. Eisenhower, also known as 'IKE', sails in the Red Sea on Wednesday, June 12, 2024.\nMeanwhile, the U.S. military ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.", "location": "The USS Dwight D. Eisenhower aircraft carrier was responding to Houthi attacks as its primary mission in the Red Sea", "classification": "security", "score": 0.6659775634473052, "event_breakdown": "The current event of security reported in the text that can be mapped is that the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, has been ordered to return home after a twice-extended tour. The ship saw \"explosions in the vicinity of the vessel\" as it was targeted by false attack claims by the Houthis during its recent time in the Red Sea."}, {"id": "dd103dd5-718e-40e5-b368-aa2bfdef7b97", "title": "Likely Yemen Houthi Rebel Attack Targets Ship in Gulf of Aden as Eisenhower Reportedly Heads Home", "date": "2024-06-22 16:00", "url": "https://www.military.com/daily-news/2024/06/22/likely-yemen-houthi-rebel-attack-targets-ship-gulf-of-aden-eisenhower-reportedly-heads-home.html", "domain": "military.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen's Houthi rebels attempting to target the shipping lane.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis, who have held Yemen's capital, Sanaa, since 2014, did not immediately claim the attack.\nThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9343475999930976, "event_breakdown": "Location: Gulf of Aden\nEvent: A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, according to a statement by the United Kingdom Maritime Trade Operations center.\nTarget event: A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}, {"id": "b5a3a333-5539-41a4-bc45-4aa722fc951f", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 12:45", "url": "https://www.news4jax.com/news/2024/06/22/likely-yemen-houthi-rebel-attack-targets-ship-in-gulf-of-aden-as-eisenhower-reportedly-heads-home/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "FILE - The USS aircraft carrier Dwight D. Eisenhower, also known as 'IKE', sails in the Red Sea on Wednesday, June 12, 2024.\nRecommended VideosMeanwhile, the U.S. military ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.", "location": "RED SEA", "classification": "security", "score": 0.6659775634473052, "event_breakdown": "The U.S. military ordered the USS Dwight D. Eisenhower, an aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour. The U.S. Navy said the Eisenhower was being relieved by the USS Iwo Jima. This a photo of the Eisenhower in 2020, in the Red Sea."}, {"id": "5d4707dc-ba88-45d1-bdee-2dda3de35920", "title": "REPLACED hands - on preview : The years of waiting may actually be worth it", "date": "2024-06-22 16:00", "url": "https://www.windowscentral.com/gaming/xbox-games-showcase-2024-replaced-hands-on-preview", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "(Image credit: Coatsink) The lighting is spectacular and the action is glorious.\n(Image credit: Coatsink) REPLACED does such an amazing job building atmosphere.\n(Image credit: Coatsink) Running from the police in the prologue gives you the barest hint of the game's platforming.\n(Image credit: Coatsink) Seriously, I am in love with this art style.\n(Image credit: Coatsink) REPLACED does a brilliant job blending 2.5D and 3D visuals, too.", "location": "Based on the context provided, I was not able to find a specific location that the main event takes place.", "classification": "security", "score": 0.9567373797945201, "event_breakdown": "REPLACED is a gorgeous 3D action-platformer set in a dystopian future."}, {"id": "5f00d425-ba20-472c-a2ff-f31ef8bd5827", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-22 15:15", "url": "https://www.clickorlando.com/news/2024/06/22/likely-yemen-houthi-rebel-attack-targets-ship-in-gulf-of-aden-as-eisenhower-reportedly-heads-home/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "FILE - The USS aircraft carrier Dwight D. Eisenhower, also known as 'IKE', sails in the Red Sea on Wednesday, June 12, 2024.\nRecommended VideosMeanwhile, the U.S. military ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home after a twice-extended tour.\nThe captain of the ship targeted late Friday saw “explosions in the vicinity of the vessel,” the British military's United Kingdom Maritime Trade Operations center said.\nGen. Yahya Saree, a Houthi military spokesman, identified the vessel targeted as the bulk carrier Transworld Navigator.\nThe Eisenhower had repeatedly been targeted by false attack claims by the Houthis during its time in the Red Sea.", "location": "RED SEA", "classification": "security", "score": 0.6659775634473052, "event_breakdown": "US Military Ordered USS Dwight D. Eisenhower to Return Home after Extended Tour\nUK Military: Houthis Target Vessel in the Red Sea\nHouthi Military Spokesman I\nd\nentifies Bulk Carrier Transworld Navigator as Target"}, {"id": "4b687fc5-bf40-464f-8f45-2b56247ff0ea", "title": "The parts of North Wales that double as Westeros in new House of the Dragon series", "date": "2024-06-22 17:00", "url": "https://www.dailypost.co.uk/news/parts-north-wales-double-westeros-29404381", "domain": "dailypost.co.uk", "domain_classification": "Unknown", "message": "Let your watch begin with our House of the Dragon newsletterNorth Wales has a starring role in the second series of House of the Dragon, currently airing on TV.\nThe show’s executive producer Kevin de la Noy later gave North Wales the thumbs-up.\nWith North Wales doubling as Westeros, the island of Anglesey provided several key filming location.\nMuch can be said of the rest of North Wales, with Gwynedd and Conwy standing in for some of the grander – and bloodier – locations.\nYr Eifl Quarry, also known as Trefor Quarry, is thought to have stood in as Dragonstone Castle, ancestral seat of House Targaryen.", "location": "North Wales", "classification": "security", "score": 0.5897010393450671, "event_breakdown": "North Wales has a starring role in the second series of House of the Dragon, currently airing on TV."}, {"id": "c793436c-48a4-42c4-ab31-e27640d0d340", "title": "Israeli strikes kill 45 Palestinians and damage Red Cross office in Gaza", "date": "2024-06-22 15:15", "url": "https://www.independent.co.uk/news/world/middle-east/rafah-gaza-israel-war-airstrike-red-cross-b2567018.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}At least 45 Palestinians were killed and a Red Cross office was damaged in Gaza as Israeli forces pounded the besieged territory and engaged in close-quarter combat with Hamas, Reuters reported.\nThe Israeli shelling struck two places in the area which is filled with tents housing Palestinians driven from their homes elsewhere in Gaza by unrelenting bombardment.\nOne of these locations is near a field hospital run by the Red Cross.\n“Then they hit with the second one which was a little closer to the entrance of the Red Cross,” she said.", "location": ", thank you\nGAZA", "classification": "security", "score": 0.9770590903597914, "event_breakdown": "At least 45 Palestinians were killed and a Red Cross office was damaged in Gaza as Israeli forces pounded the besieged territory and engaged in close-quarter combat with Hamas, Reuters reported."}, {"id": "c5a543a5-5e8b-4b3a-ab6c-cc010588eefe", "title": "CVMA 27 - 2 Bull Run III - 96 . 9 The Rock", "date": "2024-06-22 16:15", "url": "https://www.969therock.com/event/cvma-27-2-bull-run-iii/", "domain": "969therock.com", "domain_classification": "Unknown", "message": "This year Bull Run III is CVMA 27-2’s 13th annual fundraiser which will be held on July 20th, 2024 starting and finishing at Full Distance Brewing in Stafford, VA.\nThe first major battle of the American Civil War was the First Battle of Bull Run, the Second Battle of Bull Run occurred just a year later.\nAs an homage to the warriors that came before us, Bull Run III represents the “the mental Civil War,” the battle within.\nAll proceeds from our 2024 Bull Run III fundraiser will go to two local 501(c)(3) organizations Willing Warriors and Leashes of Valor:Located in Haymarket, Willing Warriors benefits Veterans by providing cost-free retreat stays and programs that assist wounded and ill service members, disabled veterans, and their families to reconnect.\nIn fact, Willing Warriors has given several of our own members and their families immeasurable steps towards their path to recovery through a stay at the Warrior Retreat.", "location": "Full Distance Brewing in Stafford, Virginia.", "classification": "security", "score": 0.4094397450855976, "event_breakdown": "2024 Bull Run III Fundraiser - Security Drill\nFull Distance Brewing\n,\nVA - USA\nJuly 20, 2024"}, {"id": "36602089-3c1c-448e-aa9b-f8f7c94925a6", "title": "Late  Jeopardy ! host Alex Trebek to be honored with new Forever stamp", "date": "2024-06-22 17:30", "url": "https://www.cbsnews.com/news/jeopardy-host-alex-trebek-honored-new-forever-stamp-usps/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "for 37 years is being honored with a Forever stamp.\nAnswer: Who is Alex Trebek?\nThe longtime TV host, who died in 2020 after a battle with pancreatic cancer, is being remembered with a new Forever stamp by the United States Postal Service.\nUnderneath, written upside down, is the response: \"Who is Alex Trebek?\"\nAlex Trebek Forever stamp tomorrow at https://t.co/2FSCJPpHA9 pic.twitter.com/wHlZXkoIlX — Jeopardy!", "location": "LOS ANGELES", "classification": "security", "score": 0.5337144600858814, "event_breakdown": "Forever Stamp-Alex Trebek is hosting Jeopardy for than 30 years. Alex Trebek-Forever stamp is release tomorrow. Jeopardy is a popular game-show where Trebek would usually give the answer to the question, and the contestant would have to provide the question to the answer."}]