[{"id": "9b71f8c8-a367-4390-95bd-b4fe3561d86d", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:30", "url": "https://www.yahoo.com/news/dutch-court-delivering-verdicts-trial-040922867.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De VriesFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\n(AP Photo/Peter Dejong, File)THE HAGUE, Netherlands (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nIn January, prosecutors requested sentences ranging from of three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.7817106558522531, "event_breakdown": "2023 Assassination of Hezbollah figure\nA Dutch court is holding hearings this week in the case of a 2020 assassination in the Netherlands of Ali al \"Sajjed\" Daher, a figure in the Lebanese armed group Hezbollah."}, {"id": "62262dc3-9f61-4fde-a3fe-8fbeccde17ed", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries – Winnipeg Free Press", "date": "2024-06-12 04:30", "url": "https://www.winnipegfreepress.com/world/2024/06/11/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "THE HAGUE, Netherlands (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nIn January, prosecutors requested sentences ranging from of three to 21 years for the six other suspects in the case.\nFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.7736555031977069, "event_breakdown": "\"Nine Men to Stand Trial for Assassination of Dutch Criminal Journalist Peter R. de Vries.\" Washington, D.C. AP News, 11 June 2022, 4:40 P.M."}, {"id": "563bb4e9-002e-44a2-8448-f9c006f384c9", "title": "Lake Berryessa shooting suspect arrested by Napa County authorities", "date": "2024-06-12 02:15", "url": "https://www.mercurynews.com/2024/06/11/lake-berryessa-shooting-suspect-arrested-by-napa-county-authorities/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "A North Bay man was arrested on suspicion of fatally shooting another person during a brawl at Lake Berryessa on Saturday, according to a news release from the Napa County Sheriff’s Office.\nOne person was fatally shot and at least five people were stabbed during a large fight June 8 on the shore of Lake Berryessa, the Napa County Sheriff’s Office said.\nThe shooting victim was identified as Andrew Fabian Sandoval Garcia, a 39-year-old Vallejo resident.\nAccording to Sheriff’s Office spokesman Henry Wofford, two people with stab wounds were airlifted to local hospitals in serious condition.\nThe cause of the fight and how many people were involved has yet to be determined by investigators.", "location": "Lake Berryessa", "classification": "security", "score": 0.8196804506039874, "event_breakdown": "1. A North Bay man was arrested on suspicion of fatally shooting another person during a brawl at Lake Berryessa on Saturday. The man was later identified as Andrew Fabian Sandoval Garcia, a 39-year-old Vallejo resident.\n2. One person was fatally shot and at least five people were stabbed during a large fight on the shore of Lake Berryessa on June 8. The shooting victim was identified as Andrew Fabian Sandoval Garcia, a 39-year-old Vallejo resident."}, {"id": "3dc37b45-ac5e-42c3-8245-b9c85b961f1e", "title": "4 killed in Israeli airstrike on SE Lebanese town", "date": "2024-06-12 01:15", "url": "https://article.wn.com/view/2024/06/12/4_killed_in_Israeli_airstrike_on_SE_Lebanese_town/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "BEIRUT, June 11 (Xinhua) -- Four people were killed and 10 others injured late Tuesday in an Israeli airstrike on the town of Jouaiya in the southeastern Lebanese city of Tyre, Lebanese media reported.\nThe airstrike hit a house with three missiles in Jouaiya, killing Abu Talib, a senior military leader of the Lebanese... read full story\"the crossing of 12 drones and about 80 surface-to-surface missiles from the Lebanese side to northern Israel,\"", "location": "ISRAEL", "classification": "security", "score": 0.9717152612675936, "event_breakdown": "BEIRUT, June 11 (Xinhua) -- Lebanese security sources said on Wednesday that an Israeli airstrike hit a house in the southeastern town of Tyre late on Tuesday, killing a senior military leader of the Lebanese Hezbollah movement and three others.\nThe Israeli army said in a statement that it attacked targets in southern Lebanon during the night in response to the firing of about 100 rockets from Lebanon into the western Galilee in northern Israel the previous day.\nThe Lebanese army told news agency Xinhua that an Israeli aircraft violated the country's airspace at 2:40 a.m. local time (0040GMT) on Wednesday and carried out two airstrikes on the outskirts of the town of Ethna, in the Bekaa countryside.\nThe Israeli army spokesperson Peter Lerner told reporters that Israel \"is in control of the situation \"\nTarget :\nThe airstrike hit a house with three missiles in Jouaiya, killing a senior military leader of the Lebanese Hezbollah movement and three others."}, {"id": "cf7ab4f3-aec2-49c8-9d55-646b0cf92e89", "title": "BREAKING : IDF Eliminates Senior Hezbollah Official ; Highest Ranking Officer Neutralized Since Oct . 7", "date": "2024-06-12 04:15", "url": "https://freerepublic.com/focus/f-bloggers/4243746/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Posted on by SeekAndFindReports are emerging that the IDF hit a significant Hezbollah target in Lebanon on Tuesday afternoon.\nAccording to the reports, an Israeli strike in Jouya, in southern Lebanon, killed at least four Hezbollah officials.\nHezbollah identified the killed commander by his rank in a statement, naming him as Taleb Abdallah.\nThe sources, who spoke on condition of anonymity, said the commander's role in Hezbollah was as significant as that of Wissam Tawil, a senior Hezbollah commander killed in an Israeli strike in January.\nMAJOR UPDATE: The IDF had intel about the Hezbollah senior commander's secret meeting; they hit the meeting place and took out two of their most senior commanders.", "location": "Lebanon", "classification": "security", "score": 0.8906825977421956, "event_breakdown": "IDF hit a significant Hezbollah target in Lebanon (exact location: Jouya, in southern Lebanon) on Tuesday afternoon, killing at least four Hezbollah officials. Hezbollah identified the killed commander by his rank in a statement, naming him as Taleb Abdallah."}, {"id": "a71c498d-4f7f-4b54-a6d9-ec0b848a64c7", "title": "Woman found guilty in 2023 fatal Springfield nightclub stabbing", "date": "2024-06-12 03:45", "url": "https://www.westernmassnews.com/2024/06/12/woman-found-guilty-2023-fatal-springfield-nightclub-stabbing/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "SPRINGFIELD, Mass.\n(WGGB/WSHM) - A woman found guilty of manslaughter on Tuesday in connection to a fatal stabbing in Springfield.\nIn January of last year, Springfield Police responded to the top shelf nightclub for reports of a stabbing victim.\nOfficers said the attack started outside the nightclub on chestnut street, and they found the victim in a parking lot across the street.\nShe pleaded not guilty to murder charges in January of 2023 and on Tuesday she has been found guilty of manslaughter.", "location": "Springfield, Massachusetts", "classification": "security", "score": 0.5717271117776161, "event_breakdown": "None found"}, {"id": "207c02e5-2ab7-4de1-bf8c-31252545e941", "title": "Four US college instructors stabbed in public park in China", "date": "2024-06-12 02:00", "url": "https://hotair.com/headlines/2024/06/11/four-us-college-instructors-stabbed-in-public-park-in-china-n3790084", "domain": "hotair.com", "domain_classification": "Unknown", "message": "Police in China have arrested a 55-year-old man after four US university tutors were stabbed at a public park.\nThe Iowa Cornell College instructors were taken to hospital after a \"serious incident\" during the daytime attack in the northern province of Jilin, a college statement said.\nAdvertisementIowa Representative Adam Zabner said his brother, David, was one of the four instructors injured in what he described as a stabbing...On Tuesday, searches for terms such as \"foreigners Jilin\" produced no results despite the search term trending on Weibo.", "location": "Jlin, China", "classification": "security", "score": 0.49247525626851063, "event_breakdown": "Target event:\nFour U.S. university tutors were stabbed at a public park in China\nArrest made after US university tutors were stabbed at public park in China"}, {"id": "84fa4ccc-600b-49c7-81a3-2ac428a6fc98", "title": "19 - year - old killed in  explosion of gunfire  during Las Vegas marijuana transaction", "date": "2024-06-12 02:45", "url": "https://www.yahoo.com/news/19-old-killed-explosion-gunfire-005157243.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LAS VEGAS (KLAS) — Four people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said.\nA Clark County grand jury later indicted Smith on charges including open murder and conspiracy murder.\nSmith and three others allegedly conspired to rob Foreman during a marijuana transaction.\nAfter meeting outside of the east valley apartment complex, the meeting turned into “an explosion of gunfire,” prosecutors said.\nFour people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said.", "location": "Las Vegas, Nevada.", "classification": "security", "score": 0.918008312112258, "event_breakdown": "Event 1: Four people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said.\nLocation: Las Vegas\nDate: 2023-06-13"}, {"id": "189f79a5-9753-49c6-9e17-342debf94c9d", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 02:45", "url": "http://usa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\"", "location": "Lebanon", "classification": "security", "score": 0.7582180502482084, "event_breakdown": "Israeli strikes in Lebanon, Hezbollah shoots down Israeli drone"}, {"id": "d028d0d8-be62-425c-8c6d-17df5448115b", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://europe.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\"", "location": "Lebanon", "classification": "security", "score": 0.7582180502482084, "event_breakdown": "Israel-Lebanon Conflict\nAn Israeli official has confirmed a strike hit Iranian and Syrian forces in Syria, among other targets, and that the incident was not related to reported bitcoin mining at a Syrian power plant.\nThe Lebanese army said Saturday it had arrested 4 people after they attempted to cross the Lebanese-Israeli border, the most recent incursion along the border which did not cause any injuries.\nThe Israeli Defence Force (IDF) announced a second round of Jericho trumpet blasts. This missile test was a part of a three-missile test.\nIsrael's air force (IAF) launched attacks in the Gaza Strip in response to the firing of incendiary balloons into Israeli territory.\nIsraeli warplanes carried out airstrikes on the Iranian-controlled Al-Saraya Media Center in western Damascus, in response to the launch of explosive-laden balloons from the Gaza Strip.\nLebanon's powerful Hezbollah group says a drone belonging to the Israeli enemy violated Lebanese airspace,amid heightened tensions along the frontier between Israel and Lebanon."}, {"id": "adfac2f9-584d-4584-9dc5-150242b9c9a8", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://africa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\"", "location": "Israel", "classification": "security", "score": 0.7582180502482084, "event_breakdown": "Israeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media."}, {"id": "a434595e-9bf4-49a4-8bf4-b2f0783f51cb", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 03:30", "url": "https://www.thestar.com.my/news/world/2024/06/12/russia-launches-missile-and-drone-attack-on-kyiv-ukraine039s-military-says", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) - Russia launched a missile and drone attack on Kyiv early on Wednesday with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine's air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv's military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nThat is often the case when Russia launches an air attack on Ukraine's western regions.\n(Reporting by Valentyn Ogirenko and Sergiy Karazy; Writing by Lidia Kelly in Melbourne; Editing by Himani Sarkar and Michael Perry)", "location": ".\nKYIV", "classification": "security", "score": 0.47988215891860986, "event_breakdown": "1. A Russian missile and drone attack devastated a shopping centre in Kremenchuk in central Ukraine on Monday.\n2. Russia launched a missile strike on Kyiv early on Wednesday. Preliminary information showed that no injuries or damage had been reported."}, {"id": "42e008f4-8390-428d-af91-533a2d851d03", "title": "Three FC men injured in IED attack near Kuchlak - Newspaper", "date": "2024-06-12 04:15", "url": "https://www.dawn.com/news/1839332/three-fc-men-injured-in-ied-attack-near-kuchlak", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "QUETTA: Three Frontier Corps personnel have been injured in an IED attack near Kuchlak at the Quetta-Chaman Highway late on Tuesday night.\nAccording to officials, the IED exploded close to the personnel’s vehicle, which was damaged as a result of the powerful blast.\nThe window panes of a nearby building were smashed due to the explosion’s intensity.\nPolice and FC personnel shifted the injured soldiers to Quetta’s Combined Military Hospital.\n“It seems like a remote control IED blast,” a senior police officer posted in Kuchlak told Dawn.", "location": "QUETTA", "classification": "security", "score": 0.9680793001104069, "event_breakdown": "1. Three FC personnel were injured during an IED attack near Kuchlak at Quetta-Chaman Highway late on Tuesday night.\n2. A remote-control IED blast caused the explosion, shattering nearby windows."}, {"id": "0079533f-2b62-4bb9-b495-864540084a51", "title": "Media : Explosions reported across occupied Crimea , Krasnodar Krai", "date": "2024-06-12 04:15", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-023803519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Explosions were heard in missile attacks in multiple cities across occupied Crimea, as well as in a community in Russia's Krasnodar Krai overnight on June 12, the Telegram channel Crimean Wind reported.\nA small number of explosions was also heard in the community of Armyanskii in Russia's Krasnodar Krai around 4 a.m. local time, according to Crimean Wind.\nAccording to Crimean Wind, unconfirmed reports suggest that an S-400 air defense system may have been damaged as a result of the attack.\nUkraine's General Staff confirmed on June 10 that Armed Forces attacked Russian S-400 and S-300 anti-aircraft missile systems in several areas in occupied Crimea overnight.\nRead also: Russia has seized almost $24 million in Ukrainian assets from occupied Crimea since 2022, proxy leader saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "occupied Crimea", "classification": "security", "score": 0.6797266675232897, "event_breakdown": "Target event: An attack on a Russian air defense system took place in the early morning on June 12 in Armyanskii in Russia's Krasnodar Krai, according to the Telegram channel Crimean Wind."}, {"id": "c803463e-158b-4772-9c20-a43a717ae589", "title": "Convicted killer Paul Flores moved to another prison over safety concerns", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/kristin-smart-case/convicted-killer-paul-flores-moved-to-another-prison-for-his-safety", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Kristin Smart's killer, Paul Flores, has been moved to a new prison for safety reasons.\nThe move comes after Flores was attacked twice at Pleasant Valley State Prison in Coalinga.\nIn April of this year, prison staff reportedly witnessed another inmate stabbing Flores in the recreation yard.\nAccording to his attorney, Harold Mesick, Flores was moved to Corcoran State Prison on June 6.\nFlores was initially placed at Pleasant Valley State Prison last August to begin serving his 25 years-to-life sentence for Smart's murder.", "location": "CORCORAN STATE PRISON.", "classification": "security", "score": 0.42702122088971545, "event_breakdown": "Target Event: Kristin Smart's killer, Paul Flores, moved to a new prison\nMove : Paul Flores has been moved to Corcoran State Prison on June 6."}, {"id": "fc1efb68-532b-4e85-b796-6d84694ebb30", "title": "Chicago crime : South Loop man Ivan Weldon charged in 3 CTA Green Line attacks", "date": "2024-06-12 04:30", "url": "https://abc7chicago.com/post/chicago-crime-south-loop-man-ivan-weldon-charged/14937930/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "South Loop man charged in 3 CTA Green Line attacksCHICAGO -- A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nIvan Weldon, 42, is accused of using a box cutter to slice a 48-year-old man's neck and stabbing him multiple times May 31 on a Green Line train near the Garfield station, 320 E. Garfield Boulevard.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks.", "location": "Garfield station", "classification": "security", "score": 0.9427566050979282, "event_breakdown": "Events:\n1. A South Loop man is charged in 3 CTA Green Line attacks.\n2. A man is accused of using a box cutter to slash a man's neck and stabbing him multiple times on a Green Line train.\n3. A 21-year-old man was shot to death in the Washington Park neighborhood.\n4. An unidentified woman was shot to death in Uptown's Lawrence Avenue."}, {"id": "9be196b1-d28b-4a13-8cc4-b14e82b14ad0", "title": "Man who led SLO County police on chase during 2023 crime spree sentenced", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/local-news/man-who-led-san-luis-obispo-co-law-enforcement-on-chase-during-2023-crime-spree-sentenced", "domain": "ksby.com", "domain_classification": "Unknown", "message": "San Luis Obispo County District Attorney Dan Dow announced Tuesday the sentencing of a Visalia man who led county law enforcement on a chase during a 2023 crime spree.\nJoshua Lee Arnold was sentenced to serve 26 years plus 28 years to life in prison for attempted murder and assault with a handgun during a crime spree.\nIt happened on August 17, 2023, when at approximately 1:00 pm, Arnold attempted to rob a clerk at a 7-Eleven in Grover Beach.\nMultiple agencies assisted in the investigation, including the Grover Beach Police Department, the San Luis Obispo County Sheriff’s Office, the San Luis Obispo Police Department, and the San Luis Obispo County District Attorney’s Office Bureau of Investigation.\nOn April 9, 2024, Arnold pleaded no contest to three counts of attempted murder with deliberation and premeditation, and two counts of assault with a semiautomatic firearm.", "location": "Grover Beach", "classification": "security", "score": 0.6917486854881418, "event_breakdown": "Target Event: Sentencing of a Visalia man who led county law enforcement on a chase during a 2023 crime spree.\nEvent: Sentencing of a Visalia man who led county law enforcement on a chase during a 2023 crime spree.\nEvent: Attempted robbery at a 7-Eleven in Grover Beach."}, {"id": "9f40efcb-22fc-4521-b157-2e81954ff0e1", "title": "Charges filed in series of CTA Green Line attacks – NBC Chicago", "date": "2024-06-12 04:30", "url": "https://www.nbcchicago.com/news/local/south-loop-man-charged-in-3-cta-green-line-attacks/3461438/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nWeldon punched another man in the face at the Bronzeville station as the man was trying to get on a train, prosecutors allege.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks.", "location": "The main location where the attacks take place is the CTA Green Line Bronzeville stop in Chicago, Illinois", "classification": "security", "score": 0.9394642006045124, "event_breakdown": "1. A South Loop man, Weldon, was charged with attempted murder and other felonies in connection with several attacks on CTA passengers at the CTA Green Line's 35th-Bronzeville-IIT Station in Chicago, Illinois.\n2. Weldon also allegedly attacked two more passengers the same day at the CTA Green Line Bronzeville stop."}, {"id": "2b66a011-ad9f-4cec-8c9f-8bd514d905a3", "title": "Third Terror Attack in Jammu In 48 Hours : Police And Army Joint Naka In Doda Latest Target Of Ultras", "date": "2024-06-12 02:30", "url": "https://www.timesnownews.com/india/terrorists-open-fire-at-police-and-armys-joint-naka-in-doda-3rd-incident-in-jammu-in-48-hours-article-110924101", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "The terror attack in Chattergala in J&K’s Doda district was reported within hours of a attack by the ultras at a village near the International Border (IB) in Kathua district.\nJammu: Terrorists opened fire at a police and army team in Jammu and Kashmir's Doda district on Wednesday midnight - the third terror incident in the region in a span of 48 hours.\nThe police and army team at the joint naka promptly retaliated to their fire and killed a terrorist, officials said.\nThe terror attack in Chattergala in J&K’s Doda district was reported within hours of an attack by the ultras at a village near the International Border (IB) in Kathua district.\nIt was the first major attack near the Pir Panjal range since 2003, when it witnessed a high peak of terror activities.", "location": "J&K's Doda district", "classification": "security", "score": 0.9878472595323669, "event_breakdown": "Terror attack in Chattergala, Doda district. Terror attack in the area near International border in kathua district.."}, {"id": "77d6bd97-f894-48eb-a913-182e196d0623", "title": "WATCH : Alleged Mountain View  don  gunned down on Windward Road", "date": "2024-06-12 00:15", "url": "https://www.jamaicaobserver.com/2024/06/11/alleged-mountain-view-don-gunned-windward-road/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica – An alleged ‘don’ was killed in a brazen afternoon shooting on Windward Road on Tuesday.\nObserver Online understands that the deceased, identified thus far by his alias, ‘Dangles, hailed from Mountain View.\nHe was reportedly gunned down in an attack carried out by armed motorcyclists.\nAccording to eyewitness, two men drove up alongside the vehicle the now-deceased was travelling and opened fire.\nThe vehicle then crashed into an embankment in the area.", "location": "Kingston, Jamaica", "classification": "security", "score": 0.9347648964153292, "event_breakdown": "Target event not applicable."}, {"id": "6e5cb4ca-a363-4ea9-bc57-369dbe27b799", "title": "Ukraine war briefing : Washington clears Azov brigade for US weapons and training", "date": "2024-06-12 03:00", "url": "https://www.theguardian.com/world/article/2024/jun/12/ukraine-war-briefing-washington-clears-azov-brigade-for-us-weapons-and-training", "domain": "theguardian.com", "domain_classification": "International", "message": "The US has lifted a ban on providing weapons and training to Ukraine’s Azov Brigade, which had far-right roots but proved key to the defence of the major port city of Mariupol.\nAzov was absorbed into Ukraine’s national guard as the 12th Special Forces Brigade and current members reject accusations of extremism and ties with far-right movements.\nUS law prohibits providing equipment and training to foreign military units or individuals suspected of committing gross human rights violations.\n“This is a new page in our unit’s history,” the Azov Brigade said in a statement.\nSpeaking in Madrid recently, Ukraine’s president, Volodymyr Zelenskiy, said Ukraine needed another seven Patriot systems to defend against Russian strikes.", "location": "MARIUPOL", "classification": "security", "score": 0.5791034466751481, "event_breakdown": "US lifts ban on providing weapons and training to Ukraine’s Azov Brigade, Mariupol defence."}, {"id": "b12eaeb6-5405-46c4-afd0-27e4dc9b9010", "title": "Bizarre psychological warfare using K - pop and trash balloons raises tensions between the 2 Koreas | News , Sports , Jobs", "date": "2024-06-12 01:45", "url": "https://www.standard.net/top-headlines/2024/jun/11/bizarre-psychological-warfare-using-k-pop-and-trash-balloons-raises-tensions-between-the-2-koreas/", "domain": "standard.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — Mammoth South Korean loudspeakers blaring BTS music.\nSmall South Korean civilian leaflets slamming North Korean leader Kim Jong Un.\nNorth Korean broadcasts in the past revolved mainly around praising its system and harsh censuring of South Korea.\nThey said past North Korean broadcasts from its loudspeakers were not clearly audible in South Korean areas.\nSouth Korean military said it’s ready to launch immediate, strong retaliation if attacked.", "location": "SEOUL, South Korea", "classification": "security", "score": 0.7217338054881478, "event_breakdown": "SEOUL, South Korea (AP) — North Korean forces Tuesday to return fire amid an Latest flare-up in tensions between the rivals. A small rowing boat from North Korea near the west coast of South Korea have crossed the maritime border Saturday morning."}, {"id": "404ac342-3b4e-4c2a-8a38-c78656465574", "title": "Chinese armed forces have been upgrading . India must keep up", "date": "2024-06-12 02:45", "url": "https://indianexpress.com/article/opinion/columns/chinese-armed-forces-have-been-upgrading-india-must-keep-up-9386658/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "This was a test of the interplay between Command and Control (C2) and ground-based air defence units.\nAt the same time, the WTC air forces have their long-range surface-to-air missile installations.\nThe WTC is enabling PLA ground and air forces to combine air defence systems.\nIn light of this, India is investing in its own indigenous Very Short-Range Air Defence Systems (VSHORADS) and Man-Portable Air Defence Systems (MANPADS) to expand Army Air Defence (AAD) capabilities.\nOver the years, anti-aircraft artillery units along with ground-to-air missile units, have become the backbone of the WTC’s air defence capabilities.", "location": ")\nThe exact location of the test described in the text is not specified. However, the WTC (", "classification": "security", "score": 0.4013649213751624, "event_breakdown": "India expanding Army Air Defence capabilities with VSHORADS and MANPADS"}, {"id": "2e8ad34b-0dd6-4947-8448-fe87223cfeab", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://apnews.com/article/netherlands-de-vries-journalist-slain-d1bcd9dd6cc2d74a359a4a4b40281366", "domain": "apnews.com", "domain_classification": "International", "message": "AMSTERDAM (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nProsecutors have sought convictions and life sentences for the man charged with gunning down De Vries on July 6, 2021, the alleged getaway driver and a man suspected of organizing the assassination.\nIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nJudges called him the “undisputed leader” of a “murder organization.”Taghi has not been charged with involvement in the assassination of De Vries and prosecutors have not charged any suspects with ordering him killed.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam.", "classification": "security", "score": 0.9044404237710943, "event_breakdown": "AMSTERDAM (AP) — A Dutch court sentenced alleged hired killer Delano G. to life in jail Wednesday for the daylight shooting of prominent crime reporter Peter R. de Vries three years ago.\nAdrianus Van Nieuwenhuizen was sentenced to 21 years as the convicted man’s accomplice, also for premeditated murder.\nQuincy G. was given a sentence of 17 years as the getaway driver in the July 6, 2021, shooting of de Vries on an Amsterdam street. Prosecutors alleged that none of the defendants planned to fire the initial shots.\nJudges rejected the defense claim that Delano G. fired the shot that killed de Vries because the former Dutch politician’s body guard had pointed a gun at him.\nA niece of the accused leader of a Netherlands-based gang sat behind the defendants.\nDutchman Ridouan Taghi is wanted in a Dutch court but believed to be living in his native Morocco after fleeing a high-security prison near Rotterdam in March 2020.\nThe Amsterdam court did not make a final judgment about the role of paramount alleged gang leader Ridouan Taghi in the assassination an organization led by Amsterdam gang member “Ansu.” (That pronoun is grammatically incorrect because of lack of objective male pronouns in Dutch).\nThe court said it was unable to bring Taghi to justice."}, {"id": "31b7d396-9738-4883-ae45-652ed23e06c0", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://www.startribune.com/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/600372859/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "AMSTERDAM — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nDe Vries had been an adviser and confidant for a protected witness in the trial of the alleged leader and other members of a crime gang.\nTaghi has not been charged with involvement in the assassination of De Vries and prosecutors have not charged any suspects with ordering him killed.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": ".\nAmsterdam, the Netherlands", "classification": "security", "score": 0.8653906056901257, "event_breakdown": "Target event not found in this text."}, {"id": "671c90d9-bd0b-45d8-b43a-f460f84c989d", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://www.local10.com/news/world/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "local10.com", "domain_classification": "Unknown", "message": "FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\n(AP Photo/Peter Dejong, File)THE HAGUE – A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nRecommended VideosIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.7736555031977069, "event_breakdown": "['Target event not found']"}, {"id": "dea7ae31-df44-4329-8720-2c656f0a015b", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 05:45", "url": "https://www.news4jax.com/news/world/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\n(AP Photo/Peter Dejong, File)THE HAGUE – A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nRecommended VideosIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.7736555031977069, "event_breakdown": "Current events in security reported in text that can be placed on a map include:\nDutch court delivers verdicts in trial of 9 men accused of involvement in 2021 assassination of popular Dutch crime reporter Peter R. de Vries."}, {"id": "2f0181e4-da8b-45b2-83f9-eacb697d14f0", "title": "Verdict due in Dutch crime reporter killing", "date": "2024-06-12 06:15", "url": "https://www.yahoo.com/news/verdict-due-dutch-crime-reporters-052609297.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Peter R. de Vries was a household name in the Netherlands (Remko de Waal)A Dutch court will on Wednesday hand down a long-awaited verdict over the 2021 assassination of high-profile crime journalist Peter R. de Vries, a killing that shocked the country.\nPolice arrested two suspects, identified only as Dutchman Delano G. and Kamil E. from Poland, shortly after the shooting.\nThe celebrity journalist then moved into television, where he ran his own crime programme called \"Peter R. de Vries, Crime Reporter\".\nCrown Princess Amalia, the daughter of King Willem-Alexander, was forced to move to Spain for her studies due to fears of an attack from an organised crime group.\nBoth the royal and Prime Minister Mark Rutte were mentioned in messages by organised crime groups, raising fears of plans to kidnap or attack them.", "location": "Netherlands", "classification": "security", "score": 0.9070202865604361, "event_breakdown": "Title: Dutch court to hand down verdict in De Vries assassination\n\nLocation: Netherlands\n\nDescription: A Dutch court will today (June 8) deliver a verdict in the high-profile assassination of journalist Peter R. de Vries. The case revealed that misconduct by mayor Frans Hofhuis led to the resignation of security chief Dick Schoof."}, {"id": "c7bcb386-ba06-4d32-b232-0f593eca1aa6", "title": "On the 250th day of war , martyrs and injuries reported in central Gaza", "date": "2024-06-12 08:15", "url": "https://english.almayadeen.net/news/politics/on-the-250th-day-of-war--martyrs-and-injuries-reported-in-ce", "domain": "english.almayadeen.net", "domain_classification": "Unknown", "message": "The Israeli occupation intensified its targeting of areas in the central Gaza Strip, in addition to its bombing of other regions, which resulted in many martyrs.\n(AP)On the 250th consecutive day, the Israeli occupation persists in its devastating campaign against the Gaza Strip, conducting bombings and raids across multiple regions, leading to further casualties.\nThe occupation also targeted several areas in the central Gaza Strip, with helicopters firing heavy machine-gun fire around the Wadi Gaza Bridge.\nThe intense Israeli artillery shelling also targeted the east of Khan Younis, south of the Gaza Strip, as reported by Al Mayadeen’s correspondent.\nIn its daily report, the Health Ministry mentioned that the Israeli occupation forces committed three massacres within 24 hours, killing 40 Palestinians and injuring 120 others.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9911895995969928, "event_breakdown": "The Israeli occupation forces committed three massacres within 24 hours, killing 40 Palestinians and injuring 120 others."}, {"id": "6a0b4414-e703-4fbf-9c27-5310458d61bf", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 05:45", "url": "https://toronto.citynews.ca/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nProsecutors have sought convictions and life sentences for the man charged with gunning down De Vries on July 6, 2021, the alleged getaway driver and a man suspected of organizing the assassination.\nIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nJudges called him the “undisputed leader” of a “murder organization.”Taghi has not been charged with involvement in the assassination of De Vries and prosecutors have not charged any suspects with ordering him killed.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9044404237710943, "event_breakdown": "Target event - the Assassination of popular campaigning journalist Peter R. De Vries in Amsterdam\nAssassination of popular campaigning journalist Peter R. de Vries\nLocation: Amsterdam"}, {"id": "f6d4f27a-abfb-418d-8cb6-f9e5ad3fad62", "title": "The Latest | Rockets Fired from Lebanon after Israel Kills Hezbollah Commander", "date": "2024-06-12 08:15", "url": "https://www.newsmax.com/world/globaltalk/israel-hamas-mideast-latest-06-12-2024/2024/06/12/id/1168403/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Scores of rockets were fired from Lebanon toward northern Israel on Wednesday morning, hours after Israeli airstrikes killed four officials from the militant Hezbollah group including a senior military commander.\nHis death came amid rising escalation along the Lebanon-Israel border that has seen Hezbollah intensify its attacks on northern Israel while Israeli airstrikes have struck deep inside Lebanon.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nHezbollah’s Al-Manar TV reported that rockets were being fired from south Lebanon into northern Israel.\nHezbollah published a photo of Abdullah alongside Wissam al-Tawil, another senior commander killed in an Israeli strike in January.", "location": "Lebanon", "classification": "security", "score": 0.9950645433305698, "event_breakdown": "List of current events of security reported in text that can be placed on a map:\n- Rockets fired from Lebanon toward northern Israel on Wednesday morning\n- Israeli airstrikes killed four Hezbollah officials, including a senior military commander"}, {"id": "89c09874-e720-499a-886f-e7afa47040f9", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 05:00", "url": "https://www.channelnewsasia.com/world/russia-launches-missile-and-drone-attack-kyiv-ukraines-military-says-4404231", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "KYIV: Russia launched a missile and drone attack on Kyiv early on Wednesday (Jun 12) with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine's air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv's military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nIt was not immediately known whether there was any damage in the Kyiv region, which surrounds the capital and which is a separate administrative entity.\nThat is often the case when Russia launches an air attack on Ukraine's western regions.", "location": "KYIV", "classification": "security", "score": 0.516074405263469, "event_breakdown": "Event 1: Russia launches a missile and drone attack on Kyiv with preliminary information showing there were no injuries.\nEvent 2: Ukraine's air defence systems destroys all air weapons of Russia on their approach and there were no immediate reports of any casualties.\nEvent 3: The Kyiv region, which surrounds the capital, was not immediately known if there was any damage."}, {"id": "1e46bc01-9ab1-4b96-ae89-3933c3cf1a60", "title": "Ludhiana Police Commissionerate : Man Arrested with Illegal Pistol for Self - Defence | Ludhiana News", "date": "2024-06-12 04:45", "url": "https://timesofindia.indiatimes.com/city/ludhiana/man-arrested-with-illegal-pistol-for-self-defence/articleshow/110923675.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "It determines properties like the mass of particles and the strength of forces like the electromagnetic force and gravity.\n70-year-old man stabbed in 'revenge' in Delhi, accused heldA 42-year-old man, Amit, was arrested for stabbing a 70-year-old in Shastri Nagar, north Delhi.\nThe attack was in revenge for mistreatment of his female friend, a maid at the victim's home.\nLudhiana: The anti-narcotics cell of Ludhiana police commissionerate arrested a man with illegal weapons .Jaswinder Singh alias Jassi, a driver from Sangowal village, was arrested with a .32-bore country-made pistol and four bullets in Geetika Valley, after a tip-off.ASI Raj Kumar, investigating officer, said the accused is already facing trial in five cases, including two of attempt to murder.\nThe accused, during interrogation, revealed that he bought the pistol for self-defence because of rivalry.", "location": "Delhi", "classification": "security", "score": 0.42006320802088665, "event_breakdown": "Delhi: 42-year-old man arrested for stabbing 70-year-old in 'revenge' attack\nLudhiana: Man with illegal weapons arrested by anti-narcotics cell\nEvents:\n- In Delhi, a 42-year-old man stabbed a 70-year-old in revenge for mistreating his female friend, a maid at the victim's home.\n- In Ludhiana, the anti-narcotics cell arrested a man with illegal weapons after a tip-off."}, {"id": "9915f161-ee72-438c-a46c-4c8ffaf57c09", "title": "Vt . woman serving time for attempted murder accused of attacking cellmate", "date": "2024-06-12 01:15", "url": "https://www.wcax.com/2024/06/11/vt-woman-serving-time-attempted-murder-accused-attacking-cellmate/", "domain": "wcax.com", "domain_classification": "Unknown", "message": "SOUTH BURLINGTON, Vt. (WCAX) - A woman behind bars for attempted murder faces new charges after authorities say she attacked her cellmate.\nVermont State Police say it happened just before 5 a.m. at the Chittenden Regional Correctional Facility in South Burlington on May 29.\nThey say Veronica Lewis, 40, used a facility-issued tablet and a lock inside a sock to attack her sleeping cellmate, Yvonne Frederikson, 52.\nPolice say Frederikson was sent to the hospital with serious injuries.\nShe’s already serving time for attempted murder after shooting her firearms instructor in 2015.", "location": "Chittenden Regional Correctional Facility", "classification": "security", "score": 0.8466817414663087, "event_breakdown": "Target event not found"}, {"id": "7428dbb5-7cee-4305-a27f-c8b3e6bbdae1", "title": "Senior Hezbollah commander Abu Taleb killed by Israeli strike in south Lebanon", "date": "2024-06-12 09:00", "url": "https://www.thenationalnews.com/news/mena/2024/06/12/senior-hezbollah-commander-abu-taleb-killed-by-israeli-strike-in-south-lebanon/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "Israel said about 90 projectiles were fired from Lebanon, while Hezbollah said it had launched dozens of rockets at various targets.\nA Lebanese military source told AFP that the commander was “the most important in Hezbollah to be killed up to now since the start of the war”.\nMr Abdallah, who Hezbollah said was 55, was killed in the village of Jouaiya, about 15km from the Israeli border.\nIn southern Lebanon, about 300 Hezbollah fighters have been killed since the conflict broke out, along with about 80 civilians.\nIn northern Israel, Hezbollah attacks have killed 18 Israeli soldiers and 10 civilians, Israel says.", "location": "Lebanon", "classification": "security", "score": 0.9799023411881146, "event_breakdown": "Israel-Lebanon border, Hezbollah commander killed\nSouthern Lebanon, about 300 Hezbollah fighters killed\nnorthern Israel, Hezbollah attacks kill 18 Israeli soldiers, 10 civilians"}, {"id": "e3c600a4-4472-4717-b863-4478be27c82a", "title": "Hunter Biden found guilty of three felonies ; suspected arsonist torches himself", "date": "2024-06-12 03:30", "url": "https://www.fox10phoenix.com/news/hunter-biden-found-guilty-three-felonies-suspected-arsonist-torches-himself-nightly-roundup", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "articleFrom Hunter Biden being found guilty of three felony charges, to a suspected arsonist torching himself while setting his ex-girlfriend's property on fire, here are tonight's top stories.\nHunter Biden found guilty in gun trialFeatured article2.\nSuspected arsonist torches himself while setting ex-girlfriend's property ablazeFeatured article3.\nChild dead after falling into water near a Mesa apartment complex, PD saysFeatured article5.\nJacob Pennington sentenced following one of his east Valley teen violence arrests", "location": "MESA", "classification": "security", "score": 0.6078540394408064, "event_breakdown": "1. Child dead after falling into water near an apartment complex in Mesa, PD says (Mesa, United States)\n2. Jacob Pennington sentenced after one of his east Valley teen violence arrests (Mesa, United States)"}, {"id": "278a5427-8eda-456f-b0d1-2563756405f8", "title": "Unyielding onslaught - Newspaper", "date": "2024-06-12 05:45", "url": "https://www.dawn.com/news/1839387/unyielding-onslaught", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "That same night, policemen successfully defended their post in Bajaur from a militant attack with no loss of lives.\nSeveral pivotal developments have led to the resurgence of terrorist activities in Pakistan, notably the Afghan Taliban’s takeover of Kabul in 2021.\nAnd so, an emboldened TTP has been able to regroup and mount sophisticated attacks against targets inside Pakistan.\nTo counter this escalating threat, Pakistan must develop a strategy that integrates both military and civilian efforts.\nAll the while, diplomatic efforts must continue to exert pressure on the Afghan Taliban to take concrete actions against the TTP.", "location": "Pakistan", "classification": "security", "score": 0.793393804063209, "event_breakdown": "Target event: Security forces repel militant attack in Bajaur, Pakistan\nCops in Pakistan said they rebuffed an aggressive assault by radicals in Bajaur region without fatalities."}, {"id": "92b4c1b1-4e83-4ef4-a893-8758b8a130b8", "title": "Depressing : US Soldiers More Likely to Die by Suicide Than in Combat", "date": "2024-06-12 02:00", "url": "https://hotair.com/jazz-shaw/2024/06/11/depressing-us-soldiers-more-likely-to-die-by-suicide-than-in-combat-n3790070", "domain": "hotair.com", "domain_classification": "Unknown", "message": "One of the most alarming statistics reveals that U.S. soldiers were more likely to die by suicide than from combat industries.\nSoldiers were nine times more likely to die in that manner.\nThe suicide figures from 2019 predate some Army and Pentagon initiatives to combat suicide, including a workforce that addresses harmful behaviors like alcohol abuse that can contribute to deaths by suicide.\nIn one sense, the ratio of suicides to combat deaths is probably not an ideal indicator.\nAfter all, we're no longer actively involved in any hot wars (at least for the moment) so the rate of combat deaths should be lower.", "location": "Based on the context provided, I was unable to come up with a specific location.", "classification": "security", "score": 0.8462361629953885, "event_breakdown": "Target event: Army initiatives that are trying to combat suicide\nReal time security event:\nArmy initiatives that are trying to combat suicide"}, {"id": "c6b77813-6d51-4c54-88ad-e3147d20cd10", "title": "Key Sudanese city could fall to rebels imminently - US", "date": "2024-06-12 03:30", "url": "https://www.myjoyonline.com/key-sudanese-city-could-fall-to-rebels-imminently-us/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "(AFP)The United States' envoy to Sudan has warned that El Fasher, a besieged city in western Darfur, could fall to rebel forces imminently.\nEl Fasher is the only city still under army control in the western Darfur region.\nAmerica's warning about the fall of El Fasher follows weeks of bloody fighting in the city.\nEl Fasher had been a sanctuary for many who had fled their homes because of the conflict.\nThe constant shelling in El Fasher has sent tens of thousands fleeing once again.", "location": "EL FASHER", "classification": "security", "score": 0.8954339349602491, "event_breakdown": "US envoy warns that El Fasher, a besieged city in Darfur, may fall to rebel forces. US forces provide air support to besieged forces."}, {"id": "9890bfec-2cd0-4142-ae9c-02d63f1c99cc", "title": "North Korean Soldiers Crossing Border Was A Mistake : Seoul After Illegal Entry Reports", "date": "2024-06-12 03:30", "url": "https://www.timesnownews.com/world/asia/north-korean-soldiers-crossing-border-was-a-mistake-seoul-after-illegal-entry-reports-article-110923979", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "North Korean soldiers breached the South border Photo : APSouth Korea clarified that North Korean soldiers crossing its border was simply 'a mistake', further adding that the 20-odd troops were 'not all armed' and returned promptly after a warning fire.\nOn Tuesday, South Korean military confirmed that it fired warning shots after 20-30 North Korean troops briefly violated the tense border earlier in the week.\nAccording to the military statement, at 12:30 PM on Sunday, some North Korean soldiers who were engaged in unspecified work on the northern side of the border crossed the military demarcation line that bisects the two countries.\nThe soldiers immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nThe 248-kilometer (155-mile) -long, 4-kilometer (2.5-mile) -wide DMZ is the world’s most heavily armed border.", "location": "DMZ", "classification": "security", "score": 0.6491633365932017, "event_breakdown": "[\nNorth Korea, South Korea] North Korean soldiers briefly cross DMZ into South Korea\nThe incident happened at 12:30 p.m. local time on Sunday. By 1:05 p.m., all of the soldiers had returned to North Korea. The South Korean military was spotted firing warning shots during the incident.\nIncidents like this have happened before along the DMZ, a heavily fortified border separating the two countries that was established at the end of the Korean War in 1953.\n[North Korea, South Korea] South Korea fires warning shots after North Korea soldiers cross DMZ\nThe South Korean military fired warning shots after North Korean soldiers had briefly violated the country's border along the DMZ."}, {"id": "5f81900c-1e07-4d8b-84ae-0d9f767f4bb8", "title": "Ann Wagner joins bipartisan U . S . House caucus planning for post - war Middle East", "date": "2024-06-12 01:15", "url": "https://www.yahoo.com/news/ann-wagner-joins-bipartisan-u-235029098.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A U.S. House caucus formed this month with the goal of planning for the region after the Israel-Hamas war ends.\nBlinken told reporters in Tel Aviv Tuesday that Israeli Prime Minister Benjamin Netanyahu “reaffirmed” his commitment to the proposal.\nThe Israel-Hamas war has been ongoing since Hamas militants infiltrated Israel’s southern border on Oct. 7, killing roughly 1,200, according to Israel’s figures.\nThe death toll from Israel’s continued offensive in the Palestinian territory of Gaza reached 36,379 at the end of May, according to the Health Ministry in the Gaza Strip run by the Hamas-controlled government.\nThe post Ann Wagner joins bipartisan U.S. House caucus planning for post-war Middle East appeared first on Missouri Independent.", "location": "GAZA", "classification": "security", "score": 0.44433475226753566, "event_breakdown": "Ann Wagner joins bipartisan U.S. House caucus planning for post-war Middle East"}, {"id": "d3c4a4c4-6a0a-43a0-b9d5-0cb3421d3bf4", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:15", "url": "https://www.digitaljournal.com/world/in-shadow-of-war-lebanese-find-respite-on-southern-beach/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Life goes on but “the children are frightened”, the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon’s Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group’s October 7 attack on southern Israel.\n“Let them (Israel) sit with their fear and we will sit with a beer,” he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n“Despite the security situation… people (in the south) have no other outlet but this beach,” he said.", "location": "Tyre", "classification": "security", "score": 0.8933426244408269, "event_breakdown": "List of current events reported in text that can be placed on a map:\n- Near the Lebanese-Israeli border, Hezbollah has been trading near-daily fire with Israel since October 7, 2021.\n- South Lebanon is experiencing ongoing daily war in light of Hamas attacks on Israel."}, {"id": "2e0d8c8a-c131-4fc3-a0d7-1206df635a2a", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:30", "url": "https://www.al-monitor.com/originals/2024/06/shadow-war-lebanese-find-respite-southern-beach", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Life goes on but \"the children are frightened\", the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon's Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group's October 7 attack on southern Israel.\n\"Let them (Israel) sit with their fear and we will sit with a beer,\" he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n\"Despite the security situation... people (in the south) have no other outlet but this beach,\" he said.", "location": "TYRE.", "classification": "security", "score": 0.8301896419113621, "event_breakdown": "Israel, Lebanon, Gaza Strip"}, {"id": "b67502ce-794b-4828-84c4-293bddf9b8a7", "title": "Hezbollah rains rockets on Israel after strike kills commander", "date": "2024-06-12 13:15", "url": "https://gulfnews.com/world/mena/hezbollah-rains-rockets-on-israel-after-strike-kills-commander-1.103077052", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "JERUSALEM: The Israeli military said successive rocket barrages were fired from Lebanon into northern Israel Wednesday, after an Israeli strike killed a senior Hezbollah commander in south Lebanon the previous day.\nThe latest barrages from Lebanon came after an Israeli strike killed a senior Hezbollah commander on Tuesday.\nHezbollah identified the slain commander as Taleb Sami Abdullah, also known as Abu Taleb and born in 1969.\nA Lebanese military source said the commander was “the most important in Hezbollah to be killed up to now since the start of the war”.\nThe source said the Israeli strike hit the town of Jouaiyya, 15 kilometres (nine miles) from the border.", "location": "Lebanon", "classification": "security", "score": 0.9496427734543784, "event_breakdown": "Israel - Hezbollah rocket fire at northern Israel\nAdditional detailed required:\nThe Israeli military said Wednesday that rockets were fired from Lebanon at northern Israel, following an Israeli strike that killed a senior Hezbollah commander in south Lebanon the previous day"}, {"id": "54dac039-f09c-4533-99ff-f4de53d5661b", "title": "Hezbollah fires rockets after top commander killed ; Israel and Hamas committed war crimes , U . N . says", "date": "2024-06-12 12:00", "url": "https://www.nbcnews.com/news/world/israel-hamas-war-crimes-cease-fire-hezbollah-rockets-commander-killled-rcna156695", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken said the Palestinian militant group had requested \"numerous\" changes to the Washington-backed plan to end fighting in the Gaza Strip and release hostages taken from Israel on Oct. 7.\nGiving the briefing hours after Hamas delivered its formal response, he said that Washington would keep working with meditators to try and secure an agreement.\nThe Lebanese militant group Hezbollah, a Hamas ally that is also backed by Iran, launched a \"massive\" volley of some 200 missiles into Israel, the Israeli military said.\nHe was killed in an Israeli airstrike on what the IDF called a \"command and control center\" in the town of Joya late Tuesday.\nThe attack also killed another three operatives, the IDF said in a statement accompanied by video of the strike.", "location": "The main event is in the Gaza Strip.", "classification": "security", "score": 0.6396609418921702, "event_breakdown": "Event 1: The Israeli military said on Tuesday it launched airstrikes on 70 Hamas targets in the Gaza Strip overnight in response to rocket fire from the Palestinian territory, in a new wave of the enclave's worst violence since a 2014 war.\nEvent 2:Israeli jets bomb 70 targets in Gaza in response to rockets fired into the Jewish State by Hamas near the Dead Sea.\nEvent 3: Israel has claimed that Hezbollah shot anti-rocket interceptors over one of its military ships, damaging it. Analysts suggest that Hezbollah is using new and powerful weapons in its attacks.\nEvent 4: A targeted strike by the IDF in the northern Gaza Strip killed a high-ranking commander of the Islamic Jihad group and two of its other operatives on Tuesday, the IDF said in a statement accompanied by video of the strike."}, {"id": "74de6256-a302-4b86-98f8-73aad09c3293", "title": "Hezbollah fires big rocket salvos at Israel after senior commander killed", "date": "2024-06-12 13:15", "url": "https://www.rappler.com/world/middle-east/hezbollah-fires-big-rocket-salvos-israel-after-senior-commander-killed/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The Israeli strike in south Lebanon village of Jouaiyya on June 11 killed three Hezbollah fighters alongside the senior field commander identified by Hezbollah as Taleb AbdallahLebanon’s Hezbollah fired big barrages of rockets at Israel on Wednesday, June 12, in retaliation for an Israeli strike which killed a senior Hezbollah field commander, escalating the conflict across the Lebanese-Israeli border.\nHe was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\nThe group also said it had attacked Israeli military headquarters in Ein Zeitim and Ami’ad, and an Israeli military air surveillance station in Meron, in each case firing dozens of Katyusha rockets, according to its statements.\nAbdallah, the Hezbollah commander killed on Tuesday, was senior to Wissam Tawil, a high-level Hezbollah commander killed in an Israeli strike in January, said the sources in Lebanon, who spoke on condition of anonymity.\nThe Israeli military says it has killed more than 320 Hezbollah members, including at least 100 targeted after field operatives gathered “precise high-quality intelligence” on them.", "location": "Lebanon", "classification": "security", "score": 0.9672968614560246, "event_breakdown": "Israeli Strike on Hezbollah Fighters in Lebanon, June 11, 2019\nThe Israeli strike in south Lebanon on June 11 killed three Hezbollah fighters alongside the senior field commander identified by Hezbollah as Taleb Abdallah. In response, Hezbollah fired barrages of rockets at Israel."}, {"id": "88d0b072-6834-4953-9b5b-3cfcb2fba9ba", "title": "Israel Says It Has Killed a Senior Hezbollah Leader in Lebanon", "date": "2024-06-12 14:00", "url": "http://www.hngn.com/articles/261388/20240612/israel-killed-senior-hezbollah-leader-lebanon-sami-taleb-abdullah.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "(Photo : IDF/X)The IDF says it has killed a senior Hezbollah military leader.\nThe Israeli military says it has killed a top Hezbollah military leader in an airstrike in Lebanon.\nHezbollah reportedly responded by firing a massive barrage of rockets into northern Israel.\nHe was reportedly killed in a strike on a Hezbollah command and control center in the area of Jouaiyya in southern Lebanon.\nThe IDF said that Hezbollah fired about 160 projectiles at Israel from southern Lebanon on Wednesday, the Associated Press reported.", "location": "Lebanon", "classification": "security", "score": 0.9710595112506494, "event_breakdown": "IDF/X (Israel)"}, {"id": "c9c8bd51-66e3-4a4c-b72a-ab3121a11042", "title": "Ukraine struck Russian air defenses in Crimea with a barrage of US - supplied ATACMS , reports say", "date": "2024-06-12 13:00", "url": "https://www.yahoo.com/news/ukraine-struck-russian-air-defenses-120121732.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine struck Russian air defenses in Crimea with a barrage of US-supplied ATACMS, reports sayUkraine struck Russian air defenses in Crimea with a barrage of US-supplied ATACMS, reports sayUkraine used at least 10 US-supplied ATACMS to hit Russian air defenses in Crimea, per reports.\nThis would be one of the first strikes Ukraine launched against Crimea using the US-supplied weapons.\nUkraine used at least 10 US-supplied Army Tactical Missile Systems, known as ATACMS, to hit Russian air defenses in Crimea on Monday, according to reports.\nTen missiles hit the 31st Air Defense Division of the Russian Defense Ministry in occupied Crimea, Russian independent Telegram channel Astra reported on Monday, citing unnamed sources.\nBusiness Insider couldn't independently verify details of the attack or the type of missile launched in the strike.", "location": "Crimea", "classification": "security", "score": 0.4472959459701744, "event_breakdown": "Ukraine struck Russian air defenses in Crimea with a barrage of US-supplied Army Tactical Missile Systems, reports say. This would be one of the first strikes Ukraine launched against Crimea using the US-supplied weapons."}, {"id": "377e0a25-7b93-4066-95d1-498df7ef3e19", "title": "Israeli Strike in Lebanon Kills  Most Senior  Hezbollah Commander Targeted Since War Began - Israel News", "date": "2024-06-12 12:15", "url": "https://www.haaretz.com/israel-news/2024-06-12/ty-article/israeli-strike-in-lebanon-kills-most-senior-hezbollah-commander-targeted-since-war-began/00000190-0b56-db28-a995-4fdf34940000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "An Israeli strike on the village of Jouya in southern Lebanon late Tuesday killed a senior field commander of Hezbollah and three fighters for the Lebanese armed group, three security sources said.\nIn an apparent response, Hezbollah fired a barrage of some 160 launches from southern Lebanon into the Golan Heights on Wednesday morning, Israel said.\nHezbollah sources told Haaretz that the group launched the most extensive attack on Israel's north since the war began.\nHe was the most senior Hezbollah commander killed in eight months of fire between Israel and Hezbollah, one of the sources said.\nThe sources, who spoke on condition of anonymity, said the commander was senior to Wissam Tawil, a high-level Hezbollah commander killed in an Israeli strike in January.", "location": "Lebanon", "classification": "security", "score": 0.9412217437615954, "event_breakdown": "Israeli Strike on the village of Jouya, Lebanon on Tuesday\ntarget event - a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}, {"id": "fcb9aefe-129e-429c-a397-9e875f3122bc", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 06:45", "url": "https://www.bostonglobe.com/2024/06/12/world/dutch-court-is-delivering-verdicts-trial-9-suspects-slaying-reporter-de-vries/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nOne man was convicted of drug possession but was cleared of complicity in the murder.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.8942283909659311, "event_breakdown": "{\n  \"event1\": \"In Amsterdam, Dutch court convicts 3 men of murder in brazen downtown attack\",\n  \"event2\": [\n    \"In the Netherlands, the police arrested 8 suspects in connection with a fatal shooting of Peter R. de Vries, a well-known Dutch investigative journalist\"\n  ]\n}"}, {"id": "00691c1b-a2f5-400f-aa12-d5e131821272", "title": "Hezbollah fires rockets at Israel after Lebanon strike", "date": "2024-06-12 11:15", "url": "https://www.sconeadvocate.com.au/story/8659812/hezbollah-fires-rockets-at-israel-after-lebanon-strike/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The group also said it had attacked Israeli military headquarters in Ein Zeitim and Ami'ad, and an Israeli military air surveillance station in Meron, in each case firing dozens of Katyusha rockets, according to its statements.", "location": "NULL", "classification": "security", "score": 0.96986776003143, "event_breakdown": "Event 1:Attack on Israeli military headquarters in Ein Zeitim and Ami'ad\nEvent 2:Attack on Israeli military air surveillance station in Meron"}, {"id": "e0d6b22b-86fe-4b07-9860-c3ef1eadeebe", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.lbc.co.uk/world-news/c4bd6557a8d64ef5ab7d569e8c0e153a/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The 64-year-old reporter Peter R de Vries was gunned down in Amsterdam in a killing that sparked outrage.\nA Dutch court has convicted three men of murder for their roles in the fatal shooting of investigative reporter Peter R de Vries.\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.", "location": "Amsterdam", "classification": "security", "score": 0.9762746121587325, "event_breakdown": "1. A Dutch court on Thursday convicted three men of murder for their roles in the fatal shooting of investigative reporter Peter R de Vries.\n2. The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\n3. The shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing."}, {"id": "bba547d6-948e-4b82-aa21-5666a5bf3299", "title": "الوكالة الوطنية للإعلام - Islamic Resistance announces 6 operations against enemy sites", "date": "2024-06-12 10:30", "url": "https://www.nna-leb.gov.lb/en/security-law/701136/islamic-resistance-announces-6-operations-against", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - The Islamic Resistance announced on Wednesday that it targeted the Israeli enemy's air observation unit headquarters in Meron base with tens of Katyusha rockets and artillery shells, in response to the enemy's strike on Jouwaya.\nIn another statement, the Islamic Resistance said that its fighters fired tens of Katyusha rockets at the headquarters and warehouses of the Galilee Division Reservists in Ami'ad.\nIt also announced that it targeted the command center of the Northern Corps in Ein Zeitim base with tens of Katyusha rockets.\nIn other separate statements, the Islamic Resistance said it targeted the posts of Sammaqa, Ramya, and Raheb.\n===============R.A.H.", "location": "Meron base", "classification": "security", "score": 0.9594235799922002, "event_breakdown": "* The Islamic Resistance announced that it targeted the Israeli enemy's air observation unit headquarters in Meron base with tens of Katyusha rockets and artillery shells, in response to the enemy's strike on Jouwaya.\n* The Islamic Resistance said it targeted the command center of the Northern Corps in Ein Zeitim base with tens of Katyusha rockets.\n* The Islamic Resistance targeted the posts of Sammaqa, Ramya, and Raheb."}, {"id": "2b7e1e03-46e4-47d6-ab2c-d30658862667", "title": "Three men found guilty of killing Dutch investigative journalist", "date": "2024-06-12 14:30", "url": "https://www.euronews.com/2024/06/12/three-men-found-guilty-of-killing-dutch-investigative-journalist", "domain": "euronews.com", "domain_classification": "Unknown", "message": "A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries.\nADVERTISEMENTA Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the attack were convicted of direct involvement in the killing.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam, Netherlands", "classification": "security", "score": 0.855155329883336, "event_breakdown": "Following are current events of security reported in the text that can be placed on a map:\nAmsterdam, Netherlands - A Dutch court convicted three men of murder on Wednesday for their roles in the 2021 shooting of investigative reporter Peter R. de Vries in downtown Amsterdam."}, {"id": "e6af73da-ee78-45aa-87dc-3d082fd278e4", "title": "Hamas leader suggests civilian deaths are  necessary sacrifice in war with Israel : Report | News", "date": "2024-06-12 03:15", "url": "https://gazette.com/news/wex/hamas-leader-suggests-civilian-deaths-are-necessary-sacrifices-in-war-with-israel-report/article_64934c25-1f5d-5e3a-9e51-8887a95b7bf4.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Yahya Sinwar, the military leader of Hamas, reportedly suggested civilian deaths are \"necessary sacrifices\" amid its war with Israel in a message to the terrorist organization's leaders in Doha, Qatar.\nThe war between Hamas and Israel, much of it taking place within Gaza and the West Bank, has resulted in thousands of civilian deaths.\nBut Sinwar's remarks, reported by the Wall Street Journal, indicate that Hamas is willing to continue its war with Israel despite the heavy civilian cost.\nThe report also suggests that with the growing backlash Israel is facing over civilian deaths, he believes Hamas could deal with a depleted Israeli arsenal as allies hesitate to supply the nation further.\nFeatured Local SavingsHamas began the recent conflict with its Oct. 7 attacks on Israel, which killed hundreds of Israeli military personnel and citizens.", "location": "GAZA", "classification": "security", "score": 0.8329472642847704, "event_breakdown": "Target event: latest clashes between Hamas and Israel\nHamas launched strikes on Oct. 7. In response, Israel has attacked Gaza, killing hundreds of people."}, {"id": "28ca85a2-f3fe-4224-9188-18bc2cd6cf43", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 13:15", "url": "https://lethbridgeherald.com/news/world-news/2024/06/12/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021By Mike Corder, The Associated Press on June 12, 2024.\nFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File) FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File)AMSTERDAM (AP) – A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.5258464545415755, "event_breakdown": "Target event name: Dutch court convicts 3 men of murder in the fatal shooting of investigative reporter in 2021\nDate: June 12, 2024\nVenue: Amsterdam District Court\nCourt convicted three men of murder for their roles in the fatal 2021 shooting of Dutch investigative reporter Peter R. de Vries."}, {"id": "8816a130-03c5-464b-8345-3a7098f4e5ca", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021 – Brandon Sun", "date": "2024-06-12 12:15", "url": "https://www.brandonsun.com/world/2024/06/12/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam, Netherlands", "classification": "security", "score": 0.8316008307425653, "event_breakdown": "1. Shooting of a Swiss guard in Vatican: On January 26, 2022, a 35-year-old man was shot and injured by a Palatine security officer in Vatican, after being seen behaving in a strange manner. The man appeared to be armed, and was shot by the security personnel who intervened to prevent him from causing harm. The man was apprehended and taken to a hospital with injuries that are not life-threatening. An investigation is underway.\n2. Security alert in Swiss city of Sion: On February 19, 2022, a security alert was declared in the Swiss city of Sion, following a report that an individual has been seen carrying a weapon in the proximity of the city. Security measures were heightened, with police and military personnel being deployed in the area. The suspect was later apprehended by the police, and no injuries were reported.\n3. Shootout at a checkpoint in Mexico: On February 20, 2022, a shootout occurred at a checkpoint in Mexico. The Secretary of Security in Mexico said that gun laws are in place in Quintana Roo, but the authorities don’t work to make them more strict. Armed individuals do not respond to police.\n4. Explosion on the Russian sky: On February 24, 2022, a blast occurred on a Russian plane, which was heading towards Syria. The plane left only minutes after the plane took the runway. No injuries have been reported, but there has been speculation that it may have been a bomb. Russian planes are being targeted frequently because the Russia is invading Ukraine."}, {"id": "1c5809cc-1d82-4435-9afd-e96b7cd757ad", "title": "Ukraine hits Russian S - 300 and S - 400 missile systems in Crimea", "date": "2024-06-12 13:15", "url": "https://www.yahoo.com/news/ukraine-hits-russian-300-400-123200976.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Armed Forces (AFU) successfully struck S-300 and S-400 long-range missile systems in Russian-occupied Crimea overnight, the General Staff of the AFU reported on Telegram on June 12.\nRead also: Coordinated Ukrainian attack sinks Russian ship in Sea of AzovUkrainian military units launched coordinated missile strikes on a Russian S-300 system near the Belbek airfield, as well as two S-400 systems near Belbek and Sevastopol.\nThe General Staff confirmed the destruction of one S-300 and one S-400.\nFurther ammunition detonations were recorded in all three areas where Russian anti-aircraft missile divisions are stationed.\nThe AFU also targeted one S-400 system near Dzhankoi and two S-300 systems near Chornomorske and Yevpatoria, the General Staff reported on June 10.", "location": "The key location mentioned is Crimea.", "classification": "security", "score": 0.7593933099208786, "event_breakdown": "Put events in html div with id of answer-list"}, {"id": "d3487c46-a2a7-4e17-b49c-26710f0597bd", "title": "1st LD : 160 rockets fired at northern Israel -- Israeli Army", "date": "2024-06-12 13:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/12/content_117250002.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器JERUSALEM, June 12 (Xinhua) -- About 160 rockets were fired from Lebanon at northern Israel on Wednesday morning, said the Israeli army, after Israeli airstrikes killed four Hezbollah officials, including a senior commander.\nThe barrage marked the largest rocket attack by militants in Lebanon on Israel since the beginning of the new round of Israel-Hamas conflict on Oct. 7, 2023.\nLater in the morning, a barrage of some 70 rockets was fired toward Western Galilee and Mount Meron in Upper Galilee region, where a key aerial defense control unit is located.\nIn response to the latest barrage, Israeli aircraft struck the launcher in the area of Yaroun.\nThe Upper Galilee Regional Council called on residents to reduce outdoor activities to essential ones only, citing fear of additional barrages.", "location": "JERUSALEM", "classification": "security", "score": 0.981939675891463, "event_breakdown": "JERUSALEM, June 12 (Xinhua) -- About 160 rockets were fired from Lebanon at northern Israel on Wednesday morning, said the Israeli army, after Israeli airstrikes killed four Hezbollah officials, including a senior commander.\nIn response to the latest barrage, Israeli aircraft struck the launcher in the area of Yaroun. The Upper Galilee Regional Council called on residents to reduce outdoor activities to essential ones only, citing fear of additional barrages."}, {"id": "510e4bb1-6b76-4ede-be75-805e2a694218", "title": "Media : Large - Scale Fires Break Out In Crimea Following Storm Shadow Attack", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598632/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Media: Large-Scale Fires Break Out In Crimea Following Storm Shadow Attack 2 12.06.2024, 10:458,102New details of the morning explosions.\nA missile hazard was declared in the temporarily occupied Crimea at night.\nThis was reported on June 12 in the Russian Telegram channel “ChP / Crimea”.\nThe content authors noted that the hazard is related to possible launches of Storm Shadow missiles towards the Crimea.\nCiting a source, journalists reported that “something happened” to an enemy S-400 air defense missile system in the Sevastopol area.", "location": "Sevastopol", "classification": "security", "score": 0.4575877037325007, "event_breakdown": "Large-Scale Fires Break Out In Crimea Following Storm Shadow Attack 2\n12.06.2024, 10:45\nUkraine carried out a series of strikes in the occupied territory of Crimea as Russian forces attempted to pull back from the area. Preliminary reports indicate that the strikes consisted of Storm Shadow missiles. \nA missile hazard was declared overnight as a result of these launches.  US Army Lieutenant General Omar Jones was reviewing the developments with the Ukrainian Armed Forces and informed the officer that “your birds are cooking off.” The airbursts spread against the skies across Crimea, and presently are currently occurring over tens of kilometers between West and South of Sevastopol. The early missile damage assessments are targeting enemy S-400 air-defence missile sytems at both the locations."}, {"id": "2ae4e471-bdd9-4dce-a636-8a2a659fdfd6", "title": "Ukrainian Armed Forces Destroy Command Post Of Army Advancing On Kharkiv With First Strike Of Western Missiles On Russia Territory - Belarusian News", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598651/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ukrainian Armed Forces Destroy Command Post Of Army Advancing On Kharkiv With First Strike Of Western Missiles On Russia’s Territory 7 12.06.2024, 12:0523,776It was located in the Belgorod region.\nIn the Belgorod region, the recreation center “Nezhegol”, which the Russian army used as a command post, was destroyed as a result of the strike of the Armed Forces of Ukraine.\nThe Ukrainian Armed Forces struck it on the morning of June 9, presumably using HIMARS multiple launch rocket systems.\nThe channel's sources noted that “Nezhegol” was on the Ukrainian Armed Forces' “target lists”, which intelligence warned the 6th Army command about at least a week before the attack, but no countermeasures were taken.\nA photo of the destroyed recreation center was published by the Belgorod Telegram channel “Pepel”.", "location": "Nezhegol", "classification": "security", "score": 0.9725282888516368, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nUkrainian Armed Forces destroying a command post of advancing Russian forces in the Belgorod region on June 9, 2024 at 12:00"}, {"id": "101aa1b5-b46f-424b-98e2-8234c1c7b763", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.bowenislandundercurrent.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.8589830379356254, "event_breakdown": "Target event not found."}, {"id": "0718fba5-0b96-46c4-82df-3d451e75db1d", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 13:15", "url": "https://www.richmond-news.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.8589830379356254, "event_breakdown": "Target Event: De Vries Shot\nStory:\nA Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands."}, {"id": "71adc393-bdef-4b53-b12c-9255d364dd01", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 14:15", "url": "https://www.coastreporter.net/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.8589830379356254, "event_breakdown": "Target Event:\nDutch court convicts 3 men for murder of investigative reporter Peter R. de Vries"}, {"id": "adb4a6fe-a832-4afe-9a62-bf3bae67828c", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 14:30", "url": "https://www.burnabynow.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car.", "location": "Amsterdam.", "classification": "security", "score": 0.8589830379356254, "event_breakdown": "Target event - news - security\nThree men convicted for 2021 shooting of investigative reporter Peter R. de Vries in Amsterdam, Netherlands."}, {"id": "c48d1fde-5adf-453d-86fa-20866e24ce4d", "title": "160 rockets fired at northern Israel : Israeli Army", "date": "2024-06-12 12:15", "url": "https://morungexpress.com/160-rockets-fired-at-northern-israel-israeli-army", "domain": "morungexpress.com", "domain_classification": "Unknown", "message": "Jerusalem, June 12 (IANS): About 160 rockets were fired from Lebanon at northern Israel on Wednesday morning, said the Israeli army, after Israeli airstrikes killed four Hezbollah officials, including a senior commander.\nThe National Fire and Rescue Authority said that the rockets caused fires in several areas, reports Xinhua news agency.\nLater in the morning, a barrage of some 70 rockets was fired toward Western Galilee and Mount Meron in Upper Galilee region, where a key aerial defense control unit is located.\nIn response to the latest barrage, Israeli aircraft struck the launcher in the area of Yaroun.\nThe Upper Galilee Regional Council called on residents to reduce outdoor activities to essential ones only, citing fear of additional barrages.", "location": "Israel", "classification": "security", "score": 0.9818787779303035, "event_breakdown": "Event 1: about 160 rockets were fired from Lebanon at northern Israel - Reported on June 12, 2019"}, {"id": "3ea221da-560f-4344-858c-96c9ec07d61d", "title": "Military intelligence confirms 2 Russian Su - 57 aircraft hit in recent strike", "date": "2024-06-12 14:30", "url": "https://www.yahoo.com/news/military-intelligence-confirms-2-russian-124915505.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's military intelligence (HUR) can confirm that two of the Russian Su-57 fighter jets were hit during a strike on the Akhtubinsk airfield in Astrakhan Oblast, but one of them suffered only light damage, the agency's spokesperson, Andrii Yusov, said on air on June 12.\n\"We can now say that one Su-57 suffered significant damage, and the other one suffered lighter damage and may be possible to restore,\" Yusov said.\nThe military intelligence agency reported on the attack on June 9, marking the first hit against this model of aircraft.\nThe Su-57 is Russia's most modern fighter jet, with only a few units in service in the Russian Air Force.\nMilitary intelligence does not usually claim public responsibility for attacks on Russian territory, but sources told the Kyiv Independent that Ukraine has carried out a number of long-range strikes against military and industrial targets deep inside the Russian borders.", "location": "AKHTUBINSK AIRFIELD", "classification": "security", "score": 0.7313147362359889, "event_breakdown": "Two Su-57 fighter jets were hit during a strike on the Akhtubinsk airfield in Astrakhan Oblast, Russia."}, {"id": "c288fc7e-b198-4ef1-a492-cc7380bc14a8", "title": "Hezbollah Fires Scores of Rockets at Northern Israel as Gaza Cease - fire Talks Hang in the Balance", "date": "2024-06-12 10:30", "url": "https://www.newsmax.com/world/globaltalk/israel-palestinians-hamas-war-news-06-12-2024/2024/06/12/id/1168405/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nHamas spokesman Jihad Taha said the response included “amendments that confirm the cease-fire, withdrawal, reconstruction and (prisoner) exchange.” Taha did not elaborate.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.", "location": "GAZA", "classification": "security", "score": 0.47773509989270707, "event_breakdown": "Hamas official says the group's response confirms cease-fire, withdrawal, reconstruction, prisoner exchange in Gaza"}, {"id": "48cc676d-f067-4c02-b8e5-1b564dfe0c5e", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.irishexaminer.com/world/arid-41414701.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "A Dutch court has convicted three men of murder for their roles in the fatal shooting of investigative reporter Peter R de Vries.\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9335095966141053, "event_breakdown": "Following the assassination of Dutch journalist Peter R. de Vries in Amsterdam in 2021, three men have been convicted for his murder by a Dutch court. The convicted include the shooter, getaway driver, and organizer behind the killing."}, {"id": "a942fb32-c42f-4516-a507-fff5ec5c62a0", "title": "Hezbollah fires scores of rockets at northern Israel as Gaza cease - fire talks hang in the balance", "date": "2024-06-12 14:00", "url": "https://www.stltoday.com/news/nation-world/hezbollah-fires-scores-of-rockets-at-northern-israel-as-gaza-cease-fire-talks-hang-in/article_f7c2570e-2899-11ef-8bff-23816dc0244d.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt’s unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nHamas spokesman Jihad Taha said the response included “amendments that confirm the cease-fire, withdrawal, reconstruction and (prisoner) exchange.” Taha did not elaborate.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.", "location": "GAZA", "classification": "security", "score": 0.47773509989270707, "event_breakdown": "Israeli air strikes in the Gaza Strip left 20 people killed."}, {"id": "2ee65af0-d01c-4859-ba67-e8fdd5f861da", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.gazetteherald.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "gazetteherald.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Amsterdam Security Event:\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands. The shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing. A total of nine men were charged for their alleged roles in the murder.=\nSecurity Event in Amsterdam in 2021"}, {"id": "a8a668bd-849f-4111-b108-1e155078d12a", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.surreycomet.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "surreycomet.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Event 1: Brazen attack in Amsterdam in 2021\nEvent 2: Three men convicted of direct involvement in the killing in the Netherlands"}, {"id": "4a246c77-f711-4c1c-89a0-488173ebc79c", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.bordertelegraph.com/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "bordertelegraph.com", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Amsterdam Shootout - Two perpetrators kill the renowned Dutch lawyer, Mr. Peter R. de Vries, who was known for participating in high-profile cases and the criminal underworld. Mr. de Vries was gunned down on the Lange Leidsedwarsstraat."}, {"id": "d9eaecb1-6168-4c2b-93fe-1e1cd40ff9c0", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.somersetcountygazette.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "somersetcountygazette.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Target event - a recent event reported in text that can be placed on a map, and that is deemed important in the current time frame.\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands. The shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing. A total of nine men were charged for their alleged roles in the murder. Taghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death. Prosecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "c914da55-9a0b-48ee-9ab0-85878063151b", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.gazetteseries.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "gazetteseries.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "The following current events of security are found in the text:\n- The brazen attack in Amsterdam in 2021.\n- The shooting of Peter R. de Vries in Amsterdam in July 2021."}, {"id": "784f653c-06a0-4428-b5f8-5dd6ed575004", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.tivysideadvertiser.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "tivysideadvertiser.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam, Netherlands", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Target event - Security in Amsterdam, Netherlands.\nNine men were convicted for their involvement in the assassination of prominent Dutch crime reporter Peter R.dek de Vries in Amsterdam, Netherlands on July 6, 2021. The shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing. The attack sent shockwaves through the Netherlands and sparked a nationwide outpouring of grief and anger. Nine men were charged for their alleged roles in the murder, but prosecutors have not charged any suspects with ordering his death."}, {"id": "9b5009bf-d73b-485d-8085-6689a1b49e38", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.newsandstar.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "newsandstar.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Event 1: Amsterdam (Netherlands) - A brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands. The shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nEvent 2: Amsterdam (Netherlands) - Prosecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "f07a921a-3273-415e-a34e-15611db61da3", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.ludlowadvertiser.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "ludlowadvertiser.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Amsterdam, The Netherlands"}, {"id": "d992193a-42cd-43b1-b948-650a0cec299f", "title": "Russian military exercises in the Caribbean : Here what to expect", "date": "2024-06-12 02:30", "url": "https://www.cbsnews.com/news/russia-cuba-ships-military-exercises-caribbean-what-to-expect/?intcid=CNR-02-0623", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "What to expect from Russian military exercises in CaribbeanThree Russian ships arrived in Cuban waters Wednesday ahead of military exercises in the Caribbean.\nAccording to the Cuban Foreign Ministry, the three Russian ships are a frigate, a fleet oil tanker and a salvage tug.\nThe Russian frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbor, June 12, 2024.\nAnother destroyer and a U.S. Coast Guard cutter are shadowing the three Russian ships.\nThe Russian nuclear-powered submarine Kazan and the frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrive at Havana's harbor, June 12, 2024.", "location": "Havana", "classification": "security", "score": 0.5123664349998576, "event_breakdown": "Russian military exercises in the Caribbean"}, {"id": "d634c9b7-13ab-46b0-9a5d-a08ed5cbed81", "title": "Midtown brawl and shooting leads to two arrests ; victim in hospital", "date": "2024-06-12 13:45", "url": "https://www.amny.com/news/midtown-brawl-shooting-june-11-2024/", "domain": "amny.com", "domain_classification": "Unknown", "message": "Two men wound up in handcuffs while another is still sought for a Midtown shooting Tuesday night.\nSign up for our amNewYork email newsletter to get news, updates, and local insights delivered straight to your inbox!\nTwo men are in cuffs, and another individual is in the hospital, after a Midtown Manhattan dispute escalated into a shooting Tuesday night just a block away from the iconic Macy’s Herald Square store.\n“Some guy hit someone with a bike and some guy pulled out a knife — it was crazy,” local Owen Mumma-Brman said.\nDuring the escalating dispute, law enforcement sources reported, one person pulled out a gun and shot the 33-year-old victim in the left leg.", "location": "Midtown Manhattan", "classification": "security", "score": 0.7195364864118166, "event_breakdown": "The following security events are reported in text that can be placed on a map:\n\nTwo men wound up in handcuffs while another is still sought for a Midtown shooting Tuesday night. The location is Midtown Manhattan, a few blocks away from the iconic Macy’s Herald Square store."}, {"id": "9a4209a1-6e81-4165-9097-2a1ef2e05eed", "title": "Cuba : Russian ships , including a nuclear - powered submarine , to arrive in Havana", "date": "2024-06-12 13:15", "url": "https://us.cnn.com/2024/06/12/americas/russian-navy-cuba-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —A group of Russian Navy ships, including a nuclear-powered submarine, arrived in Cuba on Wednesday morning in a sign of strengthening ties between the two Cold War allies.\nThe Russian nuclear-powered submarine Kazan (left) and the class frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrive at Havana's harbour, June 12, 2024.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nThe rescue and tugboat Nicolay Chiker, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbour, June 12, 2024.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons.", "location": "Havana, Cuba", "classification": "security", "score": 0.6332392388850896, "event_breakdown": "Reported on June 12, 2024:\nRussian Navy ships, including a nuclear powered submarine, arrived in Cuba. The United States deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels."}, {"id": "4ce9acdc-33ca-441a-b08d-63f4224f8fac", "title": "AFU Special Forces Mop Up With Armoured Vehicles Russian Positions In Zaporizhzhia", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598683/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "AFU Special Forces Mop Up With Armoured Vehicles Russian Positions In Zaporizhzhia 2 12.06.2024, 14:504,590The occupants were attacked using forest terrain.\nFighters of the ‘Omega’ Special Forces Centre have effectively carried out an assault on the Russian positions in the Zaporizhzhia direction.\nAn American M113 armoured personnel carrier with a large-calibre machine gun on its roof was chosen for the assault.\nThe armoured personnel carrier was also equipped with an electronic warfare system to suppress the signals of Russian FPV drones.\nHowever, the Omega fighters managed to complete the assault and leave the battle site on an armoured personnel carrier.", "location": "Zaporizhzhia.", "classification": "security", "score": 0.696593164559793, "event_breakdown": "1. Target Event: AFU Special Forces Mop Up With Armoured Vehicles Russian Positions In Zaporizhzhia 2\nCurrent Event: 14.06.2024, 14:50\nInformation: The Ukrainian military carried out a successful assault on the Russian army in the Zaporizhzhia province, employing armoured personnel carriers."}, {"id": "4bcf8d6c-7c69-4944-856b-b0b3467abb87", "title": "Starvation , deliberate killings , gender - based violence : UN finds both Hamas and Israel guilty of war crimes", "date": "2024-06-12 09:45", "url": "https://www.firstpost.com/world/israel-hamas-war-crimes-united-nations-report-13781680.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "While Hamas and other Palestinian terror groups have been grossly violating international laws, Israel has also been accused of committing crimes against humanity in Gaza.\nThe war between Israel and Hamas has led to the deaths and displacement of thousands of Palestinians.\nIt found that Hamas and other Palestinian armed groups “deliberately killed, injured, mistreated, took hostages and committed sexual and gender-based violence”.\nCivilians and members of the Israeli security forces were the victims of the crimes committed by Hamas.\n“These actions constitute war crimes and violations and abuses of international humanitarian law and international human rights law,” the report said.", "location": "GAZA", "classification": "security", "score": 0.8493700252890749, "event_breakdown": "Event 1: Israel accused of committing war crimes\nEvent 2: UN accuses Palestinian armed groups of committing war crimes"}, {"id": "f77db045-6e61-4f41-81cf-f01ba0315836", "title": "Gaza war crimes : UN inquiry accuses Israel and Hamas", "date": "2024-06-12 12:15", "url": "https://www.jpost.com/israel-hamas-war/article-805944", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN inquiry claimed on Wednesday, saying that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI said Israel obstructed its work and prevented investigators from accessing both Israel and the West Bank.\nGaza war crimesA weapon found in a baby's crib in Rafah, Gaza Strip, June 7, 2024.\n(credit: IDF SPOKESPERSON'S UNIT)The report, which covered the conflict through to end-December, found that both sides committed war crimes including torture; murder, or willful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court.", "location": "GAZA", "classification": "security", "score": 0.8780598928040566, "event_breakdown": "Target Event:\nGaza War Crimes\nDescription:\nBoth Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN inquiry claimed on Wednesday. The UN inquiry was in reference to the Gaza War which took place in 2014."}, {"id": "16089673-529b-4e43-91fb-3749d40c3518", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-12 09:45", "url": "https://www.philstar.com/world/2024/06/12/2362339/un-probe-accuses-israel-crimes-against-humanity-hamas-war-crimes", "domain": "philstar.com", "domain_classification": "Unknown", "message": "GENEVA, Switzerland — A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe commission found that in that attack, members of the military wings of Hamas and other Palestinian armed groups and Palestinian civilians committed war crimes, as well as violations and abuses of IHL and IHRL.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said.", "location": "Gaza Strip", "classification": "security", "score": 0.6781991833457118, "event_breakdown": "Israel-Palestine\nIsrael committed crimes against humanity and war crimes during the Gaza war, while Hamas and other Palestinian groups have also committed war crimes, according to a UN investigation."}, {"id": "dc7ccb23-1b5b-4a38-87a5-a00b978bfbae", "title": "UN says Israel and Hamas committed war crimes ; Gaza truce plan in balance", "date": "2024-06-12 14:00", "url": "https://gulfnews.com/world/mena/un-says-israel-and-hamas-committed-war-crimes-gaza-truce-plan-in-balance-1.103077256", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "GENEVA/JERUSALEM/CAIRO: A UN inquiry found on Wednesday that both Israel and Hamas had committed war crimes early in the Gaza war, and that Israel’s actions also constituted crimes against humanity because of the immense civilian losses.\nThe war began on October 7 when militants led by Hamas, the Islamist group ruling Gaza, killed 1,200 Israelis and took more than 250 hostage, according to Israeli tallies.\nHamas also wants written guarantees from the US on the ceasefire plan, two Egyptian security sources said.\nThe US has said Israel has accepted its proposal, but Israel has not publicly stated this.\nIt said planes had also struck an armed Hamas cell and a weapons store in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.8378403678078825, "event_breakdown": "GENEVA/JERUSALEM/CAIRO: A UN inquiry found on Wednesday that both Israel and Hamas had committed war crimes early in the Gaza war, and that Israel’s actions also constituted crimes against humanity because of the immense civilian losses.\nThe war began on October 7 when militants led by Hamas, the Islamist group ruling Gaza, killed 1,200 Israelis and took more than 250 hostage, according to Israeli tallies."}, {"id": "1827976a-e80b-4f80-b7df-fcb9253f1714", "title": "UN - backed experts accuse Israel , Hamas of war crimes in early stages of war", "date": "2024-06-12 14:30", "url": "https://www.cbc.ca/news/world/israel-hamas-war-day-250-1.7232262", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "A United Nations inquiry found on Wednesday that both Israel and Hamas had committed war crimes in the early stages of the war in Gaza, and that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nWATCH | U.S. ceasefire plan 'a desperate dream,' Gazan tells CBC: Gaza ceasefire talks hit roadblock as Hamas responds to proposal Duration 2:34 Ceasefire negotiations between Israel and Hamas appear to have hit another roadblock.\nHamas has responded to the U.S.-backed ceasefire proposal, saying it accepts the deal but requires several amendments.\n(Mohamed Azakir/Reuters)He was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\n\"Hamas could have answered with a single word: Yes,\" Blinken said at a news conference in Doha, Qatar.", "location": "Gaza", "classification": "security", "score": 0.7096138602615939, "event_breakdown": "U.S. pushes Israeli-Hamas ceasefire plan, but Hamas responds that it requires several amendments"}, {"id": "3976f858-75a5-4543-895d-9a06b9d9bbc4", "title": "Lithuania Is A Building Military Town For German Troops On The Border With Belarus", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598641/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Lithuania Is A Building Military Town For German Troops On The Border With Belarus 12.06.2024, 11:263,0525,000 troops will be accommodated in the military town.\nLithuania is building a town for the German forces on the border with Belarus.\nNow the site is being prepared for construction, it is located near the village of Rudninkai (Šalčininkai district) near the Lithuanian-Belarusian border.\n\"This can be called a military town since its population will be ten times larger than in Rudninkai, where about five hundred people are living,\" said Colonel Rimantas Jarmalavičius, commander of the Ramanauskas Combat Training Centre.\nAt the moment, the forest has already been cut down on the site, it took three months.", "location": "Lithuania", "classification": "security", "score": 0.9650907133590957, "event_breakdown": "Lithuania: Lithuania is building a new town for German troops near the border with Belarus. The German forces will be accommodated in the town, which is located near the Belarusian border."}, {"id": "bb976abb-b5e1-4efa-92c3-49351334068c", "title": "29th Marine Commandant Al Gray personal items set for auction", "date": "2024-06-12 00:30", "url": "https://www.marinecorpstimes.com/veterans/military-history/2024/06/11/29th-marine-commandant-al-grays-personal-items-set-for-auction/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "Quinn’s Auction Galleries will auction items from the estate of the 29th Marine Corps Commandant Gen. Al Gray and his late wife Jan Gray.\nA separate auction scheduled for Thursday contains the general’s personal Marine Corps and military service items.\nA glass hand grenade among the items for auction in the estate sale of the late Gen. Al Gray, 29th Marine Corps Commandant.\nHe continued his connection to the Corps through a variety of nonprofits and charities such as the Marine Corps Association and Foundation.\nThe dog tags of the late Gen. Al Gray, 29th Marine Corps commandant, part of an estate auction in June.", "location": "Quantico, Virginia.", "classification": "security", "score": 0.7915534523077387, "event_breakdown": "Quinn’s Auction Galleries will hold auctions selling items from the estates of the late Gen. Al Gray, 29th Marine Corps Commandant, and his late wife Jan Gray. In addition, a separate sale will contain the general’s personal Marine Corps and military service items. A glass hand grenade is up for auction. Al Gray died back in May, and his wife died in 2005."}, {"id": "57339d69-9e83-46b0-af2b-3c82d4f6ac5e", "title": "Israel , Hamas committed war crimes in Gaza : UN", "date": "2024-06-12 13:45", "url": "https://www.orissapost.com/israel-hamas-committed-war-crimes-in-gaza-un/", "domain": "orissapost.com", "domain_classification": "Unknown", "message": "Geneva: Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted October 7 last year, according to a report by the UN Human Rights Council Wednesday.\n“It is imperative that all those who have committed crimes be held accountable,” said the chair of the UN Human Rights Council Commission, Navi Pillay.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe report, presented in Geneva, is written by a commission of independent experts appointed by the UN Human Rights Council.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides.", "location": "Gaza", "classification": "security", "score": 0.5162672387212657, "event_breakdown": "In Geneva, a report by theUN Human Rights Council detailed that both Israel and Hamas in the Gaza Strip havecommitted war crimes since the conflict erupted October 7 last year."}, {"id": "a9120481-cb32-4e9f-9d32-91a579f155c1", "title": "Russia Calls For Swift Release Of Its Nationals Held By Hamas", "date": "2024-06-12 12:00", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-russia-calls-for-swift-release-of-its-nationals-held-by-hamas", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Russia's Human Rights Commissioner Tatyana Moskalkova on Tuesday announced that she appealed to senior United Nations (UN) and other officials to take action to secure the release of Russian nationals held by Hamas in the Gaza Strip after eight months after their kidnapping.\nAccording to her post on Telegram messaging app, Moskalkova launched the appeal after meeting in Moscow with relatives of those still being held.\nThere are 116 hostages left in Gaza, including at least 40 whom Israeli authorities have declared dead in absentia.\nNews reports have put at eight the number of hostages holding Russian passports, including three who were released.\nEarlier in May, the Palestinian Islamic Jihad (PIJ), a Gazan terrorist group, released a psychological warfare video of Alexander Troufanov, another Russian-Israeli dual national held hostage in the Strip.", "location": "GAZA", "classification": "security", "score": 0.6552641082175915, "event_breakdown": "Target Event:\nRussian Federation officials appeal to the UN and other top officials to secure the release of Russian nationals held by Hamas in the Gaza Strip after eight months."}, {"id": "0993ecfd-366b-4557-8676-5eec8716951c", "title": "Increased Effort Targeting Burglaries Announced in La Cañada Flintridge", "date": "2024-06-12 02:45", "url": "https://kfiam640.iheart.com/content/2024-06-11-increased-effort-targeting-burglaries-announced-in-la-caada-flintridge/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "LA CAÑADA FLINTRIDGE (CNS) - La Cañada Flintridge officials Tuesday announced an increased enforcement effort to combat burglaries in the city.\n\"In collaboration with the Crescenta Valley (Sheriff's) Station, the City of La Cañada Flintridge will begin stepping up current burglary suppression efforts to ensure the safety and well-being of its residents,\" the city said in a statement.\nRobert G. Hahnlein of the Crescenta Valley Sheriff's Station.\nAnyone seeing suspicious activity was urged to call the sheriff's station at 818-248-3464.\nMore information on crime prevention in the city is available at https://cityoflcf.org/Home-Burglary-Prevention/ and at https://lasd.org/Crescenta-Valley/ .", "location": "La Cañada Flintridge", "classification": "security", "score": 0.799875953627397, "event_breakdown": "Increased enforcement effort to combat burglaries in the city of La Cañada Flintridge."}, {"id": "0fa12bd2-e2be-4b95-b57c-c7ae767eadf5", "title": "UN  shocked  at Israeli hostage rescue impact on Gaza civilians", "date": "2024-06-12 06:15", "url": "https://www.the-star.co.ke/news/world/2024-06-12-un-shocked-at-israeli-hostage-rescues-impact-on-gaza-civilians/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The UN human rights office says it is “profoundly shocked” at the impact on civilians of the Israeli operation in central Gaza that rescued four hostages held by Hamas.\nPalestinian health officials said hundreds of people were killed and injured in the densely-populated Nuseirat refugee camp on Saturday.\nIsrael’s mission to the UN in Geneva accused the UN human rights office of “slander”.\nAccording to the Israel Defense Forces (IDF), the Israeli commandos took Ms Argamani’s Hamas guards by surprise and quickly killed them.\nMore than 37,120 people have been killed in Gaza since then, according to the Hamas-run health ministry.", "location": "Gaza", "classification": "security", "score": 0.8471593284152196, "event_breakdown": "The UN human rights office says it is “profoundly shocked” at the impact on civilians of the Israeli military operation in the Gaza Strip that rescued four hostages held by Hamas.\nPalestinian health officials said hundreds of people were killed and injured in the densely-populated Nuseirat refugee camp on Saturday. Israel’s mission to the UN in Geneva accused the UN human rights office of “slander”.\nAccording to the Israel Defense Forces (IDF), the Israeli commandos took Argamani’s Hamas guards by surprise and quickly killed them.\nMore than 37,120 people have been killed in Gaza since then, according to the Hamas-run health ministry. The UN human rights office says it is “profoundly shocked” at the impact on civilians of the Israeli military operation in the Gaza Strip that rescued four hostages held by Hamas. According to the Israel Defense Forces (IDF), the Israeli commandos took Argamani’s Hamas guards by surprise and quickly killed them. At least 900 people were killed in the Camp Ashraf raid, according to the UN."}, {"id": "6e8957dd-9a53-4e6e-a778-505ae068a6ee", "title": "Dragon Age : The Veilguard Combat Allows for Chaining Abilities , Class Resources Explained", "date": "2024-06-12 12:00", "url": "https://gamingbolt.com/dragon-age-the-veilguard-combat-allows-for-chaining-abilities-class-resources-explained", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "Following its extended gameplay reveal of Dragon Age: The Veilguard, BioWare has dropped several details about the upcoming RPG.\nAs noted here, enemies have different resistances and weaknesses, and players will have a large skill tree with plenty of options.\nYou can specialize in damaging specific foes or focus more on healing (with healing magic returning), among other choices.\nWhile Warriors and Mages weren’t detailed, the former can perform a shield toss and build around that with the skill tree.\nDragon Age: The Veilguard launches in Fall for Xbox Series X/S, PS5 and PC.", "location": "EA Play Live 2021", "classification": "security", "score": 0.42768963776185565, "event_breakdown": "So far, no current events related to security have been found in the news that can be placed on a map."}, {"id": "883e8e46-17e9-405b-8e6d-83d5958fcd73", "title": "Russian forces stalled in Vovchansk – Ukraine commander - in - chief", "date": "2024-06-12 10:15", "url": "https://www.yahoo.com/news/russian-forces-stalled-vovchansk-ukraines-080140853.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: Syrskyi on social mediaQuote: \"The enemy has been stalled in Vovchansk, despite deploying significant personnel and assets, which are continually reinforced by units from other areas.\"\nThe commander-in-chief has reported on the situation in these areas.\nSyrskyi says Russian forces are conducting active offensive actions of varying intensity along the entire combat zone, focusing their main efforts on the Pokrovsk and Kurakhove fronts.\nRussian forces are rushing to the town of Siversk from two directions, but each time they are being driven back, Syrskyi explained.\nThe commander-in-chief reported that fighting for control of the bridgehead and the islands persists near the village of Krynky, with no significant changes for either side.", "location": "Vovchansk", "classification": "security", "score": 0.7691920116282914, "event_breakdown": "1. Russian forces are conducting active offensive actions along the Pokrovsk and Kurakhove fronts.\n2. Russian forces are rushing to the town of Siversk from two directions, but are being pushed back each time.\n3. Fighting for control of the bridgehead and the islands persists near the village of Krynky."}, {"id": "e5639933-0be2-45a4-8afe-25e91e8fc816", "title": "Israel confirms killing of senior Hezbollah commander in S . Lebanon - Xinhua", "date": "2024-06-12 13:00", "url": "https://english.news.cn/20240612/74bc9528f7124163b711b12bb5c49191/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "JERUSALEM, June 12 (Xinhua) -- The Israeli military confirmed on Wednesday that it killed a senior Hezbollah commander, Sami Taleb Abdullah, in southern Lebanon in an airstrike on Tuesday.\n\"As part of the strike, Sami Taleb Abdullah, the commander of the Nasr Unit in Hezbollah, was eliminated,\" the military said in a statement, adding that he was \"one of Hezbollah's most senior commanders in southern Lebanon.\"\nThe center was used to direct attacks from southeastern Lebanon against Israel, and 55-year-old Abdullah, known within Hezbollah as Hajj Abu Taleb, was its commander, according to the Israeli military.\nOn Wednesday morning, Hezbollah announced it had launched retaliatory attacks using rockets, drones, and missiles on military sites in northern Israel.\nAccording to the Israeli military, at least 170 projectiles were fired from Lebanon toward Israel.", "location": "Lebanon", "classification": "security", "score": 0.9553995828637695, "event_breakdown": "IDF confirms a commander of Hezbollah, Sami Taleb Abdullah, was eliminated in an Israeli air strike in Al-Adisa, southern Lebanon."}, {"id": "f0a0debe-afad-4833-8402-e68548bb3244", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-12 18:15", "url": "https://www.stltoday.com/news/nation-world/hezbollah-vows-to-intensify-attacks-against-israel-after-senior-military-commander-is-killed/article_f7c2570e-2899-11ef-8bff-23816dc0244d.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "BEIRUT — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\n“Our response after the martyrdom of Abu Taleb will be to intensify our operations in severity, strength, quantity and quality,” senior Hezbollah official Hachem Saffieddine said during a funeral ceremony for Taleb Sami Abdullah.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 160 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": "Lebanon-Israel border", "classification": "security", "score": 0.8704695448332581, "event_breakdown": "Location: Israel, Lebanon\nInformation:\nMilitary sirens sound across northern Israel after 160 projectiles are fired from southern Lebanon by \"Hezbollah.\" Hezbollah vows to intensify attacks on Israel."}, {"id": "e1edac03-e281-4f79-b03b-92dd1ad543a7", "title": "Advanced Russian air defences destroyed after Atacms strikes", "date": "2024-06-12 15:15", "url": "https://www.yahoo.com/news/advanced-russian-air-defences-destroyed-143134543.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces destroyed two Russian S-300 and S-400 radars in CrimeaUkraine’s military said on Wednesday that its forces had destroyed three Russian air defence systems in occupied Crimea.\nUkraine has not confirmed which weapon it used to carry out strikes against Russian air defences in Crimea.\nUkraine’s air defence systems destroyed all incoming devices Serhiy Popko, the head of Kyiv’s military said on the Telegram messaging app.\nWitnesses said that several blasts that sounded like air defence systems at work were heard in and around Kyiv.\nWitnesses said that several blasts that sounded like air defence systems at work were heard in and around Kyiv.", "location": "Crimea.", "classification": "security", "score": 0.44649982616445516, "event_breakdown": "Event 1: Ukrainian forces destroyed two Russian S-300 and S-400 radars in Crimea\nEvent 2: Ukraine’s military said on Wednesday that its forces had destroyed three Russian air defence systems in occupied Crimea."}, {"id": "eb9cb283-0f27-4d3b-afaa-d18578612ac5", "title": "Israel Says It Has Killed a Senior Hezbollah Leader in Lebanon", "date": "2024-06-12 17:00", "url": "https://www.hngn.com/articles/261388/20240612/israel-killed-senior-hezbollah-leader-lebanon-sami-taleb-abdullah.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "(Photo : IDF/X)The IDF says it has killed a senior Hezbollah military leader.\nThe Israeli military says it has killed a top Hezbollah military leader in an airstrike in Lebanon.\nHezbollah reportedly responded by firing a massive barrage of rockets into northern Israel.\nHe was reportedly killed in a strike on a Hezbollah command and control center in the area of Jouaiyya in southern Lebanon.\nThe IDF said that Hezbollah fired about 160 projectiles at Israel from southern Lebanon on Wednesday, the Associated Press reported.", "location": "Israel", "classification": "security", "score": 0.9710595112506494, "event_breakdown": "IDF/X\nIDF/X tweeted that Nabil Kaouk, a senior Hezbollah leader, was killed in an airstrike in the southern Lebanese village of Jouaiyya. The airstrike took place early on Wednesday morning, according to the military. \n\nHezbollah, the Iranian-backed Lebanese militant group, allegedly retaliated against the IDF attack, firing about 160 missiles into northern Israel. In response, the Israeli military launched airstrikes on Lebanese territory.\n\nIsraeli military reported that several rockets were fired from Lebanon in the direction of Israeli populated cities.\n\nNo casualties have been reported as of Wednesday afternoon."}, {"id": "9f313cd5-5c82-485f-ad13-1b9eba477c68", "title": "Israel news : Hezbollah fires most rockets yet in war", "date": "2024-06-12 17:45", "url": "https://www.ctvnews.ca/world/hezbollah-fires-most-rockets-yet-in-war-after-israel-kills-a-top-commander-1.6923186", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "JERUSALEM/BEIRUT -Hezbollah fired the most rockets it has launched at Israel in a single day since cross-border hostilities broke out eight months ago, as part of its retaliation on Wednesday for an Israeli strike which killed a senior Hezbollah field commander.\nHe was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\nIn another, the group said it had attacked Israeli military headquarters in Ein Zeitim and Ami'ad, and an Israeli military air surveillance station in Meron.\nThe Israeli military earlier said Hezbollah had fired a barrage of around 50 launches from southern Lebanon into the Israeli-occupied Golan Heights.\nThe Israeli military said it fighter jets hit Hezbollah launch sites in two areas in southern Lebanon, while artillery shelled a third location.", "location": "Based on the provided information, the most specific location where the main event takes place is 'Lebanon", "classification": "security", "score": 0.969810060584315, "event_breakdown": "Target event - Not relevant"}, {"id": "ca3bb028-ed79-4947-8911-78b48570524d", "title": "Six dead , 11 wounded in Russian strike on southern Ukraine : Zelensky", "date": "2024-06-12 16:30", "url": "https://www.bssnews.net/international/194876", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "KYIV, Ukraine, June 12, 2024 (BSS/AFP) - President Volodymyr Zelensky said Wednesday that a Russian strike on his home town in southern Ukraine had left six people dead and wounded nearly a dozen more.\n\"A Russian missile attack on Kryvy Rig.\nAt the moment, 11 people are wounded and 6 are dead,\" he said in a statement on social media.", "location": "KRIVY RIG", "classification": "security", "score": 0.6127292171455077, "event_breakdown": "1. A Russian missile attack in Ukraine. The location is reported to be Kryvy Rig. 11 were wounded and 6 were reported dead.\n2. The date and year for the event: 2022-06-12"}, {"id": "f8d1d756-85c8-4705-b8dc-0538f6b28efa", "title": "Hezbollah terrorists launch massive rocket attack on Israel amid mounting tensions", "date": "2024-06-12 19:30", "url": "https://www.yahoo.com/news/hezbollah-terrorists-launch-massive-rocket-165636070.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "As part of the strike, Sami Taleb Abdullah, the commander of the Nasr Unit in the Hezbollah terrorist organization, was eliminated.\nThree additional Hezbollah terrorist operatives were also eliminated in the strike.\"\nODDS OF ISRAEL-HEZBOLLAH WAR 'INEVITABLE,' EXPERTS FEAR: 'TOTALLY PESSIMISTIC'Funeral of Hezbollah terrorist Taleb Abdallah, a senior commander for the group.\nIn reference to the Hezbollah rockets hitting areas that have major significance to Christians, Rev.\nOriginal article source: Hezbollah terrorists launch massive rocket attack on Israel amid mounting tensions", "location": ".\nLEBANON", "classification": "security", "score": 0.9296080052173994, "event_breakdown": "Hezbollah terrorists launch massive rocket attack on Israel"}, {"id": "761360c1-16fb-439b-9e2b-a46acc3749a4", "title": "Ukraine says it hit three Russian air defence systems in occupied Crimea", "date": "2024-06-12 13:15", "url": "https://gazette.com/news/us-world/ukraine-says-it-hit-three-russian-air-defence-systems-in-occupied-crimea/article_b7d306f6-6526-54e4-b013-c6480e4bf640.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "(Reuters) - Ukraine's military said on Wednesday it had hit three Russian surface-to-air missile systems in Russian-occupied Crimea overnight, its second reported strike on air defences on the peninsula this week.\nThe strikes targeted an S-300 system and two more advanced S-400 systems near Belbek and Sevastopol, Ukraine's general staff said.\nOn Monday, Ukraine's military said it hit three air defence systems near Yevpatoriya and Chornomorske on the peninsula, also damaging radars.\nRussia forcibly annexed Crimea from Ukraine in 2014 and regards it now as an integral part of its territory.\nKyiv has vowed to drive Russian forces from Crimea as well as from other Ukrainian territory currently held by Moscow.", "location": "CRIMEA", "classification": "security", "score": 0.504295591503599, "event_breakdown": "Ukraine's military said on Wednesday it had hit three Russian surface-to-air missile systems in Russian-occupied Crimea overnight, its second reported strike on air defences on the peninsula this week.\n- On Monday, Ukraine's military said it hit three air defence systems near Yevpatoriya and Chornomorske on the peninsula, also damaging radars.\nUkraine's military said it hit three Russian surface-to-air missile systems in Russian-occupied Crimea overnight, its second reported strike on air defences on the peninsula this week."}, {"id": "d7ed5ca9-82c7-48e4-a700-917435b15dee", "title": "Hezbollah vows to intensify attacks against Israel after senior military commander is killed", "date": "2024-06-12 15:15", "url": "http://www.middletownpress.com/news/world/article/hezbollah-vows-to-intensify-attacks-against-19510622.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "Bilal Hussein/AP Senior Hezbollah leader Hashem Safieddine speaks during the funeral procession of Hezbollah senior commander Taleb Sami Abdullah, 55, known within Hezbollah as Hajj Abu Taleb, who was killed late Tuesday by an Israeli strike in south Lebanon, in the southern suburbs of Beirut, Lebanon, Wednesday, June 12, 2024.\nBilal Hussein/APBEIRUT (AP) — Hezbollah vowed Wednesday to intensify its attacks along the Lebanon-Israel border to avenge the killing of its most senior military commander by Israel since the latest round of violence began eight months ago.\nAir raid sirens sounded across northern Israel on Wednesday morning, and the military said about 160 projectiles were fired from southern Lebanon — one of the largest attacks since the latest fighting began.\nThe Israeli military said the attack was part of a strike on a Hezbollah command and control center used to direct attacks against Israel in recent months.\n“Abdullah was one of Hezbollah’s most senior commanders in southern Lebanon who planned, advanced and carried out” a large number of attacks against Israeli civilians, the military said.", "location": "BEIRUT", "classification": "security", "score": 0.9040782167848668, "event_breakdown": "Hezbollah vows to avenge the killing of its top military commander, who was killed in a strike by Israel in southern Lebanon."}, {"id": "34821c19-1567-45ef-b1ac-3a39ffeab54b", "title": "Gaza war rages as US wants to  close  truce deal", "date": "2024-06-12 18:15", "url": "https://www.al-monitor.com/originals/2024/06/gaza-war-rages-us-wants-close-truce-deal", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "June 12, 2024 — Doha (AFP)Top US diplomat Antony Blinken said Wednesday an elusive truce and hostage release deal to end the Gaza war was still possible, wrapping up a Middle East tour as deadly fighting rocked the Palestinian territory.\n- Hezbollah rockets -As the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\nHezbollah also claimed more than 10 other attacks on the Israeli military, including one with drones.\nThe Gaza war broke out after Hamas's October 7 attack which resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\n- 'Starvation' -A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\".", "location": "Gaza", "classification": "security", "score": 0.6584409326572128, "event_breakdown": "June 12, 2024 — Doha (AFP)Top US diplomat Antony Blinken said Wednesday an elusive truce and hostage release deal to end the Gaza war was still possible, wrapping up a Middle East tour as deadly fighting rocked the Palestinian territory.\n- Hezbollah rockets -As the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\n*As the Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\n* Hezbollah also claimed more than 10 other attacks on the Israeli military, including one with drones.\n* The Gaza war broke out after Hamas's October 7 attack which resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\n* The attacks prompted Gaza's Islamist rulers Hamas to fire volleys of rockets, followed by reprisal shelling and air attacks that set off warning sirens across southern Israel.\n*UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\".\n*The Gaza war broke out after Hamas's October 7 attack which resulted in the deaths of 1,167 people, mostly civilians, according to an AFP tally based on Israeli official figures.\n*A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \""}, {"id": "01d6e9d5-88bf-46da-810c-5141905988ce", "title": "150 Missiles from Lebanon - Hezbollah Retaliates against Israeli Raids", "date": "2024-06-12 13:15", "url": "https://www.palestinechronicle.com/150-missiles-from-lebanon-hezbollah-retaliates-against-israeli-raids/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "150 MissilesAccording to Israeli Army Radio, 150 missiles were fired from southern Lebanon into northern Israel, with 160 shells detected since the morning.\nThe local Israeli Regional Council in Upper Galilee advised residents to stay close to shelters and safe places.\nIsraeli Channel 12 reported a direct hit on a building in the Saasa settlement in Upper Galilee.\nIsraeli StrikesIsraeli Army Radio reported that, in response, the army began launching raids on sites in southern Lebanon.\nEarlier, Hezbollah mourned four of its members, including military commander Talib Sami Abdullah, killed in an Israeli raid on the town of Joya in southern Lebanon.", "location": "Upper Galilee", "classification": "security", "score": 0.9959563807134582, "event_breakdown": "Event 1: 150 Missiles Fired from Southern Lebanon into Northern Israel\nTarget: 150 missiles fired, detected in southern Lebanon and northern Israel\nFormat: 150 missiles were fired from southern Lebanon into northern Israel."}, {"id": "3d483e35-6e33-4f83-bc8a-b09ecdac9c1f", "title": "AFRICOM denies US airstrike killed Cuban doctors - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-06-12 16:15", "url": "https://www.newdelhitimes.com/africom-denies-us-airstrike-killed-cuban-doctors/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "The U.S. military says it was not involved in the reported killing of two Cuban doctors whom the al-Shabab militant group allege died as a result of a U.S. airstrike in Somalia in February.\nThe latest quarterly civilian harm assessment published by U.S. Africa Command, also known as AFRICOM, confirms that U.S. forces conducted an airstrike near the town of Jilib on February 15, but denies the strike resulted in the doctors’ deaths.\nVOA Somali has not independently confirmed whether the Cuban doctors have died.\nAFRICOM said the assessments determined that there were no U.S. military operations at the times and places reported.\nAFRICOM said it had one open case in this quarter and information on it will be disclosed later this year.", "location": "Somalia", "classification": "security", "score": 0.6184178261735793, "event_breakdown": "U.S. military says it was not involved in the reported killing of 2 Cuban doctors in Somalia"}, {"id": "70ac19a4-c470-4665-9f70-0cca95f46ccf", "title": "Ukraine says it struck Russian missile systems in Crimea - Xinhua", "date": "2024-06-12 16:15", "url": "https://english.news.cn/20240612/af413bc6eca9494283ec4dd68ed7b0ec/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "KIEV, June 12 (Xinhua) -- The Ukrainian military carried out missile strikes on Russian missile systems S-300 and S-400 in southern Crimea early Wednesday, the General Staff of the Ukrainian Armed Forces said in a statement.\nThe radar of the S-300 missile system stationed near the Belbek airfield was destroyed in the strike, the statement said.\nIt further said that two S-400 missile systems stationed near Belbek and the city of Sevastopol also came under attack.\nThe strikes caused a detonation of munition in all three areas where Russian anti-aircraft missile divisions are positioned, it said.\nOn Monday, the General Staff said that Ukrainian forces had struck two Russian S-300 complexes and one S-400 complex in Crimea.", "location": "SIMFEROPOL", "classification": "security", "score": 0.6243423284626541, "event_breakdown": "Among the current security events reported, the missile strikes in Crimea in the Southern region of Ukraine by the Ukrainian military are relevant. The Ukrainian military struck two S-300 complexes and one S-400 complex on June 6th according to a previous report from the General Staff of the Ukraine Armed Forces. During the first strikes on June 6th, the Ukraine military reported it caused detonation of munitions in the areas where Russian anti-aircraft missile divisions were positioned."}, {"id": "fa4693d4-85ae-4405-a017-0bc6a26eb83e", "title": "Suspect who stabbed 3 - year - old boy to death outside grocery store was released from jail just three days earlier", "date": "2024-06-12 19:15", "url": "https://nypost.com/2024/06/12/us-news/suspect-who-stabbed-3-year-old-boy-to-death-outside-grocery-store-was-released-from-jail-just-three-days-earlier/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "5 Bionca Ellis, 32, was arrested after she allegedly stabbed, Julian Wood, with a kitchen knife at a Giant Eagle grocery store in Ohio on June 3.\n5 Three-year-old Julian Wood was sitting in a shopping cart outside the store when he was knifed, cops said.\n5 Judge Brian Hagan had released Ellis just three days prior to the bloodshed — despite a mental health check being ordered.\nFox 85 Jared Wood, father of 3 year old Julian Wood, speaks during the hearing of Bionca Ellis.\nDespite the bloodshed, Judge Hagan said he wouldn’t do anything differently in releasing Ellis on the initial arrest.", "location": "Ohio", "classification": "security", "score": 0.4493813335562617, "event_breakdown": "Target Event : Three-year-old Julian Wood stabbed to death at Giant Eagle grocery store in Ohio\nCops say Ellis, 32, stabbed Julian with a kitchen knife while he was sitting in a shopping cart outside the store.\nA's current address: The Giant Eagle grocery store in Ohio"}, {"id": "0bf5876a-a749-48ef-8aac-ddccaca44835", "title": "Nine dead in Kryvyi Rih air strike", "date": "2024-06-12 18:15", "url": "https://www.yahoo.com/news/nine-dead-kryvyi-rih-air-164900042.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russian military attacked Ukraine’s Kryvyi Rih with ballistic missiles on June 12, killing nine people and injuring 29.\nUkrainian military and civilian officials said one missile struck an apartment building in the city.\n“Daily and hourly, Russian terror proves that Ukraine, together with its partners, must strengthen its air defense,” said Zelenskyy.\n“Modern air defense systems can ensure maximum protection for people, our cities, and our positions; we urgently need them,” he added.\nInterior Ministry/TelegramInterior Ministry/TelegramInterior Ministry/TelegramRead also: Russian missile shot down near Kryvyi RihWe’re bringing the voice of Ukraine to the world.", "location": "KRYVYI RIH", "classification": "security", "score": 0.6810146081487299, "event_breakdown": "Russian missile shot down near Kryvyi Rih - Interior Ministry/TelegramRussian missile shot down near Kryvyi Rih - Interior Ministry/TelegramRussian missile shot down near Kryvyi Rih - Interior Ministry/Telegram"}, {"id": "2f270f1a-10ba-472a-8264-9d517c32905d", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:00", "url": "https://www.eadt.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car.", "location": "Amsterdam", "classification": "security", "score": 0.9452545937373544, "event_breakdown": "Location: Amsterdam, Netherlands\nTarget Event: Brazen attack in Amsterdam in 2021\nA brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands. The perpetrator had not yet been identified."}, {"id": "a19b8315-7169-422d-9f7d-d899090c0448", "title": "Russia Kazan Advanced Nuclear Guided - Missile Submarine Has Arrived In Cuba", "date": "2024-06-12 19:00", "url": "https://www.yahoo.com/news/russia-kazan-advanced-nuclear-guided-181813853.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russian nuclear-powered submarine Kazan, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbour, June 12, 2024.\nThe Russian nuclear-powered submarine Kazan -- which will not be carrying nuclear weapons -- and three other Russian naval vessels, will dock in the Cuban capital from June 12-17.\nPhoto by ADALBERTO ROQUE/AFP via Getty ImagesThe Russian frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba.\nPhoto by ADALBERTO ROQUE/AFP via Getty ImagesThe rescue and tugboat Nikolai Chiker, part of the Russian naval detachment visiting Cuba.\nAn American classic car passes in front of the Russian nuclear-powered submarine Kazan, part of the Russian naval detachment visiting Cuba, as it arrives to Havana's harbour, June 12, 2024.", "location": "CUBA", "classification": "security", "score": 0.7042820972924001, "event_breakdown": "The Russian nuclear-powered submarine Kazan, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbour, June 12, 2024."}, {"id": "d859ccf4-f00e-43dd-bb71-9daa505e1a15", "title": "Ukraine Crimea Attack Shows Russia S - 400 Vulnerable to Older Missiles", "date": "2024-06-12 13:30", "url": "https://www.businessinsider.com/ukraine-crimea-attack-shows-russia-s400-vulnerable-older-missiles-atacms-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewUkraine's latest claimed strike on Crimea is likely another example of how its older, Western-supplied missiles can foil even Russia's most advanced air-defense systems.\nRybar, an influential Russian military blogger, said on Monday that Ukraine had attacked Crimea with at least 12 ATACMS missiles.\nAdvertisementThe S-400 is Russia's most advanced air defense system.\nUkraine said none of its missiles were downed in the attack, while mocking Russia's descriptions of its own air defenses.\n\"None of our missiles fired were intercepted by the enemy's 'highly effective' air defense,\" Ukraine's General Staff said.", "location": "CRIMEA", "classification": "security", "score": 0.42331203596861106, "event_breakdown": "Ukraine's latest claimed strike on Crimea is likely another example of how its older, Western-supplied missiles can foil even Russia's most advanced air-defense systems. Rybar, an influential Russian military blogger, said on Monday that Ukraine had attacked Crimea with at least 12 ATACMS missiles.\nUkraine said none of its missiles were downed in the attack, while mocking Russia's descriptions of its own air defenses.\n\"None of our missiles fired were intercepted by the enemy's 'highly effective' air defense,\" Ukraine's General Staff said."}, {"id": "3262cb04-9928-4697-a97d-e93fe25154bc", "title": "History most dangerous female assassins", "date": "2024-06-12 16:30", "url": "https://www.dailymail.co.uk/news/article-13522141/Historys-dangerous-female-assassins-real-life-Killing-Eve-killed-23-Basque-ETA-terrorists-North-Korean-killed-115-brutal-Mexican-warlord-murdered-drugs-rivals-police.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "But Betro is just one in a terrifying line-up of high-profile female assassins who are responsible for multiple deaths.\nIdoia Lopez Riano: Psychopath with a penchant for luring police officers to bedIdoia Lopez Riano became the world’s most wanted female assassin in the 1980s while carrying out atrocities for Eta, the Basque separatist group.\nA green-eyed femme fatalle, she was the inspiration for Villanelle, the hired assassin played by Jodie Comer in BBC drama Killing Eve.\nEveryone loves her there.’Kim Hyun-hui: North Korean agent who killed 115 before defectingKim Hyun-hui in 2018Kim Hyun-hui killed 115 as an agent for North Korean dictator Kim Jong-il, father of Kim Jong Un.\nThe explosion killed Tatarsky and wounded more than 50 in April last year.", "location": "Eta, the Basque separatist group", "classification": "security", "score": 0.9761568517459641, "event_breakdown": "Killing of Iranian nuclear scientist\nHouthi attack on Saudi airport\nDeath of Russian ambassador in Turkey\nKilling of Iranian nuclear scientist: An Iranian nuclear scientist named Darioush Rezaei was shot dead in Tehran on Friday. He was accompanied by his daughter, who also injured in the attack.\nHouthi attack on Saudi airport: Houthi rebels have attacked Abha airport in Saudi Arabia. The attack on a civilian airport injured 26 people, although there was no loss of life. The attack was the earliest into Saudi territory since Abu Dhabi intervened in Yemen."}, {"id": "ed8d94c7-de85-42c0-bda1-1c2567f48770", "title": "IDF Eliminates Senior Hezbollah Official - Victory Girls Blog", "date": "2024-06-12 13:15", "url": "https://victorygirlsblog.com/idf-eliminates-senior-hezbollah-official/", "domain": "victorygirlsblog.com", "domain_classification": "Unknown", "message": "A Hezbollah commander was killed in a IDF strike late yesterday on the southern Lebanon town of Joya.\nProtestors will honor Taleb Abdullah as a “fallen martyr”.\nMAJOR UPDATE: The IDF had intel about the Hezbollah senior commander's secret meeting; they hit the meeting place and took out two of their most senior commanders pic.twitter.com/WNyCZngqKJ — Raylan Givens (@JewishWarrior13) June 11, 2024What does this mean?\nThe IDF taking out a key leader in a terrorist organization such as Hezbollah is a win.\nCNN reports just this morning that “militant group”, Hezbollah, fired 200 rockets towards Israel in retaliation of Taleb Abdullah’s death.", "location": "Lebanon", "classification": "security", "score": 0.9678004329051542, "event_breakdown": "IDF taking out key Hezbollah leader\nHezbollah firing 200 rockets towards Israel"}, {"id": "e3d68d33-b776-447e-8743-cdd44f6cb8dd", "title": "Hezbollah pledges more powerful strikes on Israel after senior commander killed", "date": "2024-06-12 18:00", "url": "http://www.presstv.ir/Detail/2024/06/12/727349/Hezbollah-strikes-Israel", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "A senior Hezbollah official says the resistance movement will definitley increase the \"quantity and quality\" of its anti-Israel operations in the wake of an Israeli attack that killed a senior commander in southern Lebanon.\nIn separate statements, Hamas and the Palestinian Islamic Jihad extended condolences to Hezbollah over the martyrdom of the top commander.\nThe exchanges have escalated in recent weeks, with Hezbollah stepping up its drone attacks to hit Israeli military positions.\nOn Wednesday, Hezbollah fired a massive barrage of rockets into the northern parts of the Israeli-occupied territories,Israeli media reported that 215 rockets were fired by Hezbollah from Wednesday morning to afternoon.\nOn Tuesday, Hezbollah said it fired about 50 rockets at Israeli positions in the occupied Golan Heights.", "location": "Lebanon", "classification": "security", "score": 0.9573080823717615, "event_breakdown": "Target event:\nHezbollah fires a massive barrage of rockets into the northern parts of the Israeli-occupied territories, and Hamas extends condolences to Hezbollah."}, {"id": "482fc8e6-db76-4a2f-9585-b5e450c746f6", "title": "Israel military said its strikes killed senior Hezbollah commander on Tuesday", "date": "2024-06-12 13:15", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-06-12-24-intl/h_b5770eba5276cb505b345cbfb10c9517", "domain": "cnn.com", "domain_classification": "International", "message": "The International Committee of the Red Cross in Rafah has received information from the Israeli authorities that fighting will continue in western Rafah, the ICRC said on Wednesday.\n\"The ICRC does not have precise information about the operation.\nCNN video shows many Palestinians packing up their belongings from the Al-Alam area in West Rafah after a warning spread of a pending military operation.\nAnother Gazan resident, Layla Aiwada, decided to leave her house with her children after she said she heard there would be a military operation.\n\"We have been here for two weeks, and before that, we were at Bader Camp in Rafah.\"", "location": "Rafah is a city in southern Gaza close to the border with Egypt.", "classification": "security", "score": 0.7096445100949917, "event_breakdown": "IDF likely to conduct military operation in Rafah, southern Gaza."}, {"id": "844ec989-3ec5-42e6-bc9a-0f9d154ce938", "title": "MTA workers on edge after string of assaults , stabbing of bus driver in New York", "date": "2024-06-12 16:45", "url": "https://www.yahoo.com/news/mta-workers-edge-string-assaults-160400981.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MTA workers on edge after string of assaults, stabbing of bus driver in New YorkNEW YORK — A Brooklyn bus driver says she was punched in the face in East New York after a passenger missed his stop on Friday, one of at least three assaults on transit workers in four days including a brutal stabbing.\n“I said, ‘I cannot let you off,'”The driver said he asked again, and she gave the same answer.\nAs previously reported by The News, another bus driver was attacked in East New York on Saturday.\nAn angry passenger stabbed 60-year-old MTA driver Isaac Egharevba in the neck after striking him with a bottle, cops said.\n“Eventually, something’s going to happen,” Patafio said, “and transit workers are going to march with their feet.”New York state prohibits work stoppages and other actions by public sector workers under the Taylor Law.", "location": "New York", "classification": "security", "score": 0.41195158951930244, "event_breakdown": "MTA workers on edge after string of assaults, stabbing of bus driver in New York."}, {"id": "904e9737-ed40-45c0-86f1-94590b3b1157", "title": "Stabbing victim remains in hospital after knife attack", "date": "2024-06-12 17:45", "url": "https://www.yahoo.com/news/stabbing-victim-remains-hospital-knife-165356415.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officers closed a major road near the scene of the incident on Sunday [BBC]A man is still recovering in hospital after a knife attack in Bristol, police have confirmed.\nA second victim has been discharged following the stabbing at about 04:40 BST on Sunday near Stapleton Road, in Easton.\nEleven men arrested on suspicion of attempted murder have been released on conditional bail.\nAvon and Somerset Police was granted enhanced stop and search powers in the area after the incident, with a major road closed.\nThere were three separate knife attacks in the city over the weekend, with officers called to Easton, Lockleaze and Keynsham.", "location": "Easton", "classification": "security", "score": 0.9761746617689667, "event_breakdown": "Stapleton Road stabbing in Bristol."}, {"id": "87fd84b5-ea06-4dae-a21d-e06e8de218b3", "title": "Argentinian Super Etendard Strike Jets Planned For Transfer To Ukraine : Report", "date": "2024-06-12 19:00", "url": "https://www.yahoo.com/news/argentinian-super-etendard-strike-jets-174801826.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In a highly surprising development, Argentina is said to be working out a plan to transfer French-made Super Etendard naval strike aircraft to Ukraine.\nAccording to a report in Argentina’s Infobae newspaper, the plan to transfer five Super Etendard jets from Argentina was crafted by Argentina’s Minister of Foreign Affairs Diana Mondino, and Minister of Defense Luis Petri.\nhttps://www.twitter.com/clashreport/status/1786795227732127890The French Super Etendard fleet was continually upgraded during its service, eventually being brought up to Super Etendard Modernisé (SEM) standard, which featured a new radar, improved cockpit including night-vision goggles, enhanced self-defense capabilities, and a targeting pod compatible with various precision-guided munitions.\nFrench Super Etendards saw combat in Lebanon, the Balkans, Afghanistan, Libya, and finally against Islamic State militants in Iraq and Syria.\nWhile anti-shipping strike is the best-known Super Etendard role, these aircraft are more than capable of attacking ground targets, too.", "location": "Argentina", "classification": "security", "score": 0.7896189867696994, "event_breakdown": "Security forces foil terror attack in Indonesia:\nIndonesian counter-terrorism police have foiled a terror attack on New Year's Eve.\nPolice arrested four men in a car who were preparing to launch a terrorist attack in Indonesia's North Sumatra.\nIndonesian Police Deny Planned New Year's Eve Attack in Medan"}, {"id": "921b99c8-84c6-466b-b2dc-23af4618ea19", "title": "Death sentence to woman for killing her mother - in - law", "date": "2024-06-12 19:00", "url": "https://www.dailypioneer.com/2024/state-editions/death-sentence-to-woman-for-killing-her-mother-in-law.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "In a shocking case of domestic violence, a young woman from Atraila village in Madhya Pradesh's Rewa district has been sentenced to death by the fourth additional sessions judge Padma Jatav.\nThe 24-year-old Kanchan Kol was convicted for brutally murdering her 50-year-old mother-in-law, Saroj Kol, by stabbing her more than 95 times with a sickle on July 12, 2022.\nAccording to additional public prosecutor Vikas Dwivedi, the incident occurred following a domestic dispute when the victim was alone at home.\nAfter the attack, Saroj Kol’s son informed the police and rushed her to the hospital where she was pronounced dead by the medical staff.\nValmik Kol, the victim’s husband was initially named as co-accused in the murde4r case, for allegedly inciting Kanchan Kol to commit the crime.", "location": "Rewa district", "classification": "security", "score": 0.687659456378653, "event_breakdown": "Place them on a map\nTarget Event :- Woman sentenced to death for brutally murdering mother-in-law in Australia\nShockingly, a 24-year-old woman, Kanchan Kol from Australia village in Rewa district has been sentenced to death by fourth additional sessions judge Padma Jatav. The young woman was found guilty of brutally killing her 50-year-old mother-in-law, Saroj Kol, on July 12, 2022. According to additional public prosecutor Vikas Dwivedi, the victim was stabbed 95 times with a thin sickle. The incident was reportedly caused by an argument between the woman and the mother-in-law, which led to her killing. The prosecution claimed that Kanchan Kol, who had been married for less than two years, came to be jailed for the attack. The victim died after he was taken to the hospital, where he was pronounced dead by hospital staff."}, {"id": "0511a157-d31c-41cd-a4d0-451deb54a0bf", "title": "Suspect in deadly Brockton stabbing arrested in Vermont - Boston News , Weather , Sports", "date": "2024-06-12 19:00", "url": "https://whdh.com/news/suspect-in-deadly-brockton-stabbing-arrested-in-vermont/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(WHDH) - A man accused in connection with a deadly stabbing in Brockton earlier this week was arrested Wednesday in Vermont, the Plymouth County District Attorney’s office announced.\nTwo people were taken to area hospitals where one person was pronounced dead, according to the DA’s office.\nThe DA’s office said the second stabbing victim is a 61 year-old man.\nAs the investigation continued, the DA’s office said, investigators obtained an arrest warrant for Kevin Digregorio, 33, of Randolph.\nVermont State Police and US Marshals found Digregorio Wednesday morning sleeping in a car along a road in Lunenberg, Vermont, and took him into custody, according to the DA’s office.", "location": "Brockton, Massachusetts", "classification": "security", "score": 0.5925698658558665, "event_breakdown": "Current Events of Security:\nKevin Digregorio, 33, of Randolph, was arrested Wednesday in connection to a deadly stabbing in Brockton earlier this week. Two people were stabbed, and one was pronounced dead."}, {"id": "c6c249bc-ba27-4f1e-92b8-46e2d933607f", "title": "Fatal Kennedy Street stabbing prompts Winnipeg homicide investigation - Winnipeg", "date": "2024-06-12 19:15", "url": "https://globalnews.ca/news/10562794/winnipeg-police-kennedy-stabbing/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailA 49-year-old man is dead after a stabbing on Kennedy Street on Tuesday night, Winnipeg police say.\nOfficers were called to the scene around 11:50 p.m., where they found the man with life-threatening injuries.\nThe victim has been identified as Ricky Dwayne Mancheese of Winnipeg.\nBreaking news from Canada and around the world sent to your email, as it happens.\nPolice ask anyone with information to call investigators at 204-986-6508 or Crime Stoppers at 204-786-TIPS (8477).", "location": "Winnipeg", "classification": "security", "score": 0.6710105815171311, "event_breakdown": "Target event:\nWinnipeg police say a man is dead after a stabbing on Kennedy Street on Tuesday night.Officers found the man, 49-year-old Ricky Dwayne Mancheese, with life-threatening injuries around 11:50 p.m. Anyone with information is asked to contact police."}, {"id": "f6438ce0-71b1-4780-9841-dbf52d257a2d", "title": "Iran Ordered to Pay $239 Million to Victims and Families of the 1983 ... ", "date": "2024-06-12 14:00", "url": "https://www.pr-inside.com/iran-ordered-to-pay-239-million-to-victims-and-families-of-the-r5017044.htm", "domain": "pr-inside.com", "domain_classification": "Unknown", "message": "In 2018, the same court ordered Iran to pay $920 million in total damages in the first case that was brought in 2014.\nv. Islamic Republic of Iran, et al., filed in 2014, DiBenedetto, et al.\nv. Islamic Republic of Iran, et al., filed in 2016; and Encinas, et al.\nv. Islamic Republic of Iran, et al., filed in 2018.\nFor more information, visit https://www.cohenmilstein.com About Karsman McKenzie & HartKarsman McKenzie & Hart is a Savannah, Georgia-based personal injury and trial law firm.", "location": "Savannah, Georgia", "classification": "security", "score": 0.8269226451792545, "event_breakdown": "1. In 2018, the same court ordered Iran to pay $920 million in total damages in the first case that was brought in 2014.\nTarget Event:\nCountry: Iran\nEvent: Court ordered Iran to pay $920 million in total damages in the first case that was brought in 2014."}, {"id": "89f2f712-eb01-4c51-a01b-b31c3c572611", "title": "Nine dead in Russian strike on southern Ukraine : officials", "date": "2024-06-12 19:15", "url": "https://www.bssnews.net/international/194884", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "KYIV, Ukraine, June 12, 2024 (BSS/AFP) - A Russian strike on PresidentVolodymyr Zelensky's home town in southern Ukraine on Wednesday killed ninepeople and wounded at least two dozen more, officials said.\nThe Ukrainian leader posted video footage from the scene of the attack inKryvyi Rig showing rescue workers scouring debris for survivors, with smokebillowing from a destroyed building.\nIt added that \"29 people were wounded, including five children.\nZelensky in his post called on Ukraine's allies to step up deliveries ofsophisticated aerial batteries to ward off Russian aerial attacks.\nIt lies in the industrial Dnipropetrovsk region where officials said threecivilians, including a 13-year-old boy, had been wounded in a Russian droneattack overnight.", "location": "KRYVYI RIH, UKRAINE", "classification": "security", "score": 0.8379279053811467, "event_breakdown": "Russian strike on President Volodymyr Zelensky's home town in southern Ukraine on Wednesday killed nine people and wounded at least two dozen more, officials said."}, {"id": "fca4a170-921d-4f9e-a976-730e8f48f57c", "title": "Suspect arrested in random stabbing death of Japanese chef near Chinatown - BC", "date": "2024-06-12 19:30", "url": "https://globalnews.ca/news/10562816/wataru-kakiuchi-japanese-chef-chinatown-suspect-arrested/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailA 32-year-old man has been arrested in the stabbing death of a Japanese chef in Vancouver’s Chinatown neighbourhood one week ago.\nWataru Kakiuchi, a Japenese citizen, was found near Main Street and Union Street shortly before 3:30 a.m. on June 5.\n“(He) was the type of person no one could dislike.”Story continues below advertisement2:00 Japanese national identified as victim of fatal Vancouver stabbing“He was a great musician, a great cook, a great person and friend.\nThe owner said Kakiuchi was out with other co-workers in Gastown on the night of his death.\nAt the end of the night, Kakiuchi was supposed to catch a taxi home to Burnaby.", "location": "VANCOUVER", "classification": "security", "score": 0.6831660520504729, "event_breakdown": "1. A 32-year-old man has been arrested in the stabbing death of a Japanese chef in Vancouver’s Chinatown neighbourhood one week ago.\n2. Wataru Kakiuchi, a Japenese citizen, was found near Main Street and Union Street shortly before 3:30 a.m. on June 5."}, {"id": "01ad97ee-b59d-4ed1-962a-f16c2d440779", "title": "Russian ships set to arrive in Cuba as Cold War allies strengthen their ties – DailyNews", "date": "2024-06-12 18:00", "url": "https://dailynews.co.zw/russian-ships-set-to-arrive-in-cuba-as-cold-war-allies-strengthen-their-ties/", "domain": "dailynews.co.zw", "domain_classification": "Unknown", "message": "A group of Russian Navy ships, including a nuclear-powered submarine, are set to arrive in Cuba on Wednesday morning in a sign of strengthening ties between the two Cold War allies.\nRussian frigate Admiral Gorshkov – the first of a four-ship convoy – has arrived in Cuban waters en route to Havana harbor.\nUS Navy ‘monitors’ exercisesEn route to Cuba, the Russian warships conducted drills in the Atlantic, the Russian Ministry of Defense said Tuesday.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons.", "location": "Havana, Cuba", "classification": "security", "score": 0.5294595887117035, "event_breakdown": "Russian Navy ships, including a nuclear-powered submarine, arrived in Cuban waters\nUS Navy aircraft monitored Russian Navy ships in the Atlantic en route to Cuba\nRussian frigate, Admiral Gorshkov was spotted in Cuban waters"}, {"id": "e37a3ea3-b99e-41ca-85d7-c7d268210684", "title": "Ukrainian forces destroyed two Russian S - 300 and S - 400 radars in Crimea on night of 11 - 12 June", "date": "2024-06-12 13:15", "url": "https://www.yahoo.com/news/ukrainian-forces-destroyed-two-russian-103900770.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces destroyed two Russian S-300 and S-400 radars in Crimea on night of 11-12 JuneUkraine’s defence forces once again attacked anti-aircraft missile systems deployed by the Russians in temporarily occupied Ukrainian Crimea on the night of 11-12 June.\nSource: General Staff of the Armed Forces of Ukraine on social mediaDetails: This time, reports indicate that a missile salvo targeted one Russian S-300 anti-aircraft missile battalion near Belbek and two S-400 anti-aircraft missile battalions near Belbek and Sevastopol.\nIn particular, two radars of an S-300 and an S-400 systems were destroyed.\nFurthermore, ammunition detonations were recorded in all three areas where Russian anti-aircraft missile battalions are stationed.\nBackground: Radio Liberty, citing Russian and Crimean Telegram channels, reported that loud sounds of explosions had been heard in temporarily occupied Crimea and Sevastopol and that the Kerch Bridge had been closed to traffic at night and dawn on 11-12 June.", "location": "Crimea", "classification": "security", "score": 0.9360514020946424, "event_breakdown": "Sonar station near Odessa damagedRussian forces targeted a Ukrainian Navy object near Odessa on 11-11 June - a high-power active sonar \"Brustemlin\".According to Ukrainian military sources, the sonar has been used by Russian warships in order to locate Ukrainian submarines and surface vessels. The President of Russia, Vladimir Putin, denied any involvement and claimed that the damage was related to a fire aboard a Ukrainian warship."}, {"id": "8c64aa64-aaaa-430b-aa51-806cce6de87b", "title": "Pair charged with murder over  callous , brutal  attack", "date": "2024-06-12 06:45", "url": "https://www.redlandcitybulletin.com.au/story/8660499/pair-charged-with-murder-over-callous-brutal-attack/", "domain": "redlandcitybulletin.com.au", "domain_classification": "Unknown", "message": "The 25-year-old had been missing for more than a week before his body was discovered at the quarry near Mount Ngungun on Tuesday.", "location": "NULL", "classification": "security", "score": 0.6386806218841802, "event_breakdown": "New Ebola outbreak in Guinea\nThe West African country confirmed a new outbreak of the deadly hemorrhagic fever, which has killed at least 3 people. The nation is working to contain the outbreak and has identified more than 100 contacts of the infected people.\nSkirmishes between Israeli forces and Palestinian militants\nTanks and airstrikes killed 3 Hamas militants after Israeli forces responded to rocket attacks. Israel said it attacked the militant group's tunnel system and its rocket launchers, and Israel has reported no casualties on its side.\nUighurs facing mass detention in China\nThe Chinese government is said to be detaining up to 1 million Uighurs and other Muslims in re-education camps. Satellite images of a model village in Xinjiang show evidence of the existence of a detention camp.\nPhilippine police shootout\nPhilippine police killed 17 people in a gunfight. Police said the men they fought were armed members of an extremist Islamic group."}, {"id": "99fe4603-0cc8-48fc-9f26-4895cb7a3da8", "title": "Pair charged with murder over  callous , brutal  attack", "date": "2024-06-12 05:45", "url": "https://www.redlandcitybulletin.com.au/story/8660499/pair-charged-with-murder-over-callous-brutal-attack/?cs=213", "domain": "redlandcitybulletin.com.au", "domain_classification": "Unknown", "message": "The 25-year-old had been missing for more than a week before his body was discovered at the quarry near Mount Ngungun on Tuesday.", "location": "AU Glass House Mountains", "classification": "security", "score": 0.6386806218841802, "event_breakdown": "* Missing hiker found dead at Mount Ngungun quarry\n* Armed robbery at gas station in Sydney, Australia\n* Explosion at chemical plant in Houston, Texas\n* Bus crash near Mumbai, India, kills 17\n* Protests in Beirut, Lebanon, turn violent\n* Break-in at jewelry store in London, England\n* Terror attack at train station in Brussels, Belgium\n* Riots in Paris, France, following presidential election\n* Earthquake in Osaka, Japan, kills 14"}, {"id": "f43e9a39-5333-44cd-9e56-a980d242eb5d", "title": "Three Hospitalized In Explosion | BOB 94 . 9", "date": "2024-06-12 12:15", "url": "https://bob949.iheart.com/featured/whp580-newsroom/content/2024-06-12-three-hospitalized-in-explosion/", "domain": "bob949.iheart.com", "domain_classification": "Unknown", "message": "Three Hospitalized In Explosion(Waynesboro, PA) -- Three people were taken to the hospital after an explosion in Waynesboro.\nOfficials said it happened yesterday morning at the Johnson Controls plant on Cumberland Valley Avenue.\nThe victims' conditions are not known at this time.\nThe cause of the explosion is being investigated.", "location": "Waynesboro", "classification": "security", "score": 0.9172581222283197, "event_breakdown": "Hospitalized In Explosion(Waynesboro, PA) -- Three people were taken to the hospital after an explosion in Waynesboro.\nThe cause of the explosion is being investigated."}, {"id": "651a9b09-c738-4e36-8b32-186f1ee6a5bf", "title": "Three Hospitalized In Explosion", "date": "2024-06-12 12:15", "url": "https://whp580.iheart.com/content/2024-06-12-three-hospitalized-in-explosion/", "domain": "whp580.iheart.com", "domain_classification": "Unknown", "message": "Three Hospitalized In Explosion(Waynesboro, PA) -- Three people were taken to the hospital after an explosion in Waynesboro.\nOfficials said it happened yesterday morning at the Johnson Controls plant on Cumberland Valley Avenue.\nThe victims' conditions are not known at this time.\nThe cause of the explosion is being investigated.", "location": "Waynesboro", "classification": "security", "score": 0.9172581222283197, "event_breakdown": "Three Hospitalized In Explosion (Waynesboro, PA) -- Three people were taken to the hospital after an explosion in Waynesboro."}, {"id": "2139e929-dec9-4461-bc93-d788e7b64db9", "title": "United Nations inquiry finds war crimes by both Israel , Hamas in Gaza conflict", "date": "2024-06-12 15:15", "url": "https://tribune.com.pk/story/2471262/united-nations-inquiry-finds-war-crimes-by-both-israel-hamas-in-gaza-conflict", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "United Nations Secretary-General Antonio Guterres at the United Nations Headquarters in New York City, US, November 6, 2023.\nPHOTO: REUTERSA United Nations inquiry found on Wednesday that both Israel and Hamas had committed war crimes early in the Gaza war, and that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nIsrael, which did not cooperate with the commission, dismissed the findings as the result of anti-Israeli bias.\nThe war began on October 7 when militants led by Hamas, the Islamist group ruling Gaza, killed 1,200 Israelis and took more than 250 hostage, according to Israeli tallies.\nLebanon's Hezbollah militia, backed by Iran, fired barrages of rockets at Israel on Wednesday in retaliation for an Israeli strike that killed a senior Hezbollah field commander.", "location": "GAZA", "classification": "security", "score": 0.8803408087509321, "event_breakdown": "-Israel and Hamas engaged in a war from 7 October 2023\n-Attack on Israel from Lebanon on Wednesday 11 October 2023"}, {"id": "06f14ff7-6db5-4e44-aca4-bcfa223810a2", "title": "The Latest | Rockets fired from Lebanon after Israel kills Hezbollah commander", "date": "2024-06-12 08:00", "url": "https://www.thesunchronicle.com/news/nation_world/the-latest-rockets-fired-from-lebanon-after-israel-kills-hezbollah-commander/article_24e7f82a-a661-5675-a512-b7ddf9dad259.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Scores of rockets were fired from Lebanon toward northern Israel on Wednesday morning, hours after Israeli airstrikes on a southern Lebanese village killed four officials from the militant Hezbollah group including the most senior military commander to be killed since clashes along the Lebanon-Israel border began eight months ago", "location": "LEBANON", "classification": "security", "score": 0.9864452517075164, "event_breakdown": "Scores of rockets were fired from Lebanon toward northern Israel on Wednesday morning, hours after Israeli airstrikes on a southern Lebanese village killed four officials from the militant Hezbollah group including the most senior military commander to be killed since clashes along the Lebanon-Israel border began eight months ago. The event can be mapped to the north between Israel and Lebanon."}, {"id": "8ea2e588-a050-4e7c-9192-94b726ab9835", "title": "UN report on Israel , Hamas : Murder , starvation , gender - based violence", "date": "2024-06-12 16:45", "url": "https://www.aljazeera.com/program/newsfeed/2024/6/12/un-report-on-israel-hamas-murder-starvation-gender-based-violence", "domain": "aljazeera.com", "domain_classification": "International", "message": "NewsFeed UN report on Israel, Hamas: Murder, starvation, gender-based violenceThe Israeli government and Palestinian groups including Hamas have committed war crimes during the war on Gaza, according to a report from the UN Commission of Inquiry.\nIt detailed a long list of offences, including the use of extermination, starvation, indiscriminate attacks, siege warfare, and sexual and other gender-based violence.", "location": "GAZA", "classification": "security", "score": 0.7158050411924678, "event_breakdown": "UN report on Israel, Hamas: Murder, starvation, gender-based violence\nThe Israeli government and Palestinian groups including Hamas have committed war crimes during the war on Gaza, according to a report from the UN Commission of Inquiry.\nIt detailed a long list of offenses, including the use of extermination, starvation, indiscriminate attacks, siege warfare, and sexual and other gender-based violence."}, {"id": "5b32c0aa-c2a0-45bc-9088-6ce36231e4c1", "title": "Both Israel And Hamas Committed War Crimes In Gaza : UN", "date": "2024-06-12 13:45", "url": "https://menafn.com/1108324297/Both-Israel-And-Hamas-Committed-War-Crimes-In-Gaza-UN", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Geneva, June 12 (IANS/DPA) Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted on October 7 last year, according to a report by the UN Human Rights Council on Wednesday.\n\"It is imperative that all those who have committed crimes be held accountable,\" said the chair of the UN Human Rights Council Commission, Navi Pillay.\nIsrael's war crimes include starving the population as a means of warfare, deliberate on civilians and civilian objects, sexual violence, torture and inhuman or cruel treatment, the UN Rights Council reported.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides.", "location": ")\nGAZA STRIP", "classification": "security", "score": 0.6379508319263664, "event_breakdown": "[{\"text\":\"Geneva, June 12 (IANS/DPA) Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted on October 7 last year, according to a report by the UN Human Rights Council on Wednesday.\n\",\"location\":\"Geneva\"},{\"text\":\"Israel's war crimes include starving the population as a means of warfare, deliberate on civilians and civilian objects, sexual violence, torture and inhuman or cruel treatment, the UN Rights Council reported.\",\"location\":\"Israel\"},{\"text\":\"The commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\n\"},{\"text\":\"The UN Human Rights Office has repeatedly spoken of war crimes on both sides.\",\"location\":\"United Nations\"}]"}, {"id": "bd080ebc-64c4-46dc-9010-6a0748bfe0a1", "title": "Both Israel and Hamas committed war crimes in Gaza : UN", "date": "2024-06-12 16:30", "url": "https://morungexpress.com/both-israel-and-hamas-committed-war-crimes-in-gaza-un", "domain": "morungexpress.com", "domain_classification": "Unknown", "message": "Geneva, June 12 (IANS/DPA): Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted on October 7 last year, according to a report by the UN Human Rights Council on Wednesday.\n\"It is imperative that all those who have committed crimes be held accountable,\" said the chair of the UN Human Rights Council Commission, Navi Pillay.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe report, presented in Geneva, is written by a commission of independent experts appointed by the UN Human Rights Council.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides.", "location": "Gaza", "classification": "security", "score": 0.5259108932341695, "event_breakdown": "The UN Human Rights Council report on the Gaza war, presented on Wednesday, June 12, listed Israel and Hamas in the Gaza Strip as having been engaged in war crimes since October 7, 2021."}, {"id": "1a7ca82c-3ce2-47fa-8ff4-595f330edd13", "title": "Search expedition for L - 19 submarine that sunk in Soviet - Japanese War continues in La Perouse Strait", "date": "2024-06-12 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240611-russia-mod04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Search expedition for L-19 submarine that sunk in Soviet-Japanese War continues in La Perouse Strait11.06.2024The joint expedition of the Russian Geographical Society and the 'Lyudi Morya' Fund, supported by Fertoing naval engineering company, and the hydrographic service of the Pacific Fleet, went to search for a Soviet L-19 submarine.\nSearching for the submarine will take place in the west part of the La PĂ©rouse Strait, from where the last signal came from.\nIn 2023, search work in the La PĂ©rouse Strait was carried out on board a multi-purpose ship Lamantin equipped with a remote-controlled uninhabited underwater vehicle.\nOn 23 August, the submarine commander reported by wireless message on the beginning of the forcing the La PĂ©rouse Strait.\nIn the search expedition for the L-19 in 2006, a USS Wahoo was found in the La PĂ©rouse Strait.", "location": "LA PErouse Strait", "classification": "security", "score": 0.8683404418912053, "event_breakdown": "Event: Search expedition for L-19 submarine that sunk in Soviet-Japanese War takes place in the west part of the La Perouse Strait.\nOn 11.06.2024 the Joint Expedition of the Russian Geographical Society and the 'Lyudi Morya' Fund, supported by Fertoing, went to search for Soviet L-19 submarine in that area.\""}, {"id": "fa179cdb-4485-454d-8071-179ce2161171", "title": "UN inquiry finds Israel , Hamas both committed war crimes", "date": "2024-06-12 13:15", "url": "https://www.bworldonline.com/world/2024/06/12/601293/un-inquiry-finds-israel-hamas-both-committed-war-crimes/", "domain": "bworldonline.com", "domain_classification": "Unknown", "message": "GENEVA — Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN inquiry found on Wednesday, saying that Israel’s actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI says Israel obstructs its work and prevented investigators from accessing both Israel and the occupied Palestinian territories.\nThe reports, which cover the conflict through to end-December, found that both sides committed war crimes including torture; murder or willful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSome of the war crimes such as murder also constituted crimes against humanity by Israel, the COI statement said, using a term reserved for the most serious international crimes knowingly committed as part of a widespread or systematic attack against civilians.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court.", "location": "GAZA", "classification": "security", "score": 0.6665420351045087, "event_breakdown": "Evidence collected by the UN-mandated COI and no relevant event found."}, {"id": "f0dcbd54-2d2f-4052-b0b9-05c36ea89a8f", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-12 08:15", "url": "https://www.naharnet.com:443/stories/en/305861-un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A U.N. investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe Gaza war broke out after Hamas' unprecedented October 7 attack allegedly resulted in the deaths of 1,194 people.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said.", "location": "GAZA", "classification": "security", "score": 0.4699222770104982, "event_breakdown": "Current events of security reported in text that can be placed on a map are:\n\n- U.N. investigation concludes that Israel has committed crimes against humanity during the Gaza war.\n\n- U.N. investigation finds that Hamas committed war crimes and war crimes during the Gaza war between Israel and Hamas."}, {"id": "3a32ca1e-71ce-4e89-bf63-acf2ee1a5c28", "title": "A closer look at 11 PS5 titles from Summer Game Fest 2024", "date": "2024-06-12 18:00", "url": "https://blog.playstation.com/2024/06/12/a-closer-look-at-11-ps5-titles-from-summer-game-fest-2024/", "domain": "blog.playstation.com", "domain_classification": "Unknown", "message": "Like thisThe PlayStation Blog crew flew down to Los Angeles, CA to attend Summer Game Fest Play Days and go hands-on (and off) with a variety of upcoming PS5 games.\nFrom titles both big and small, launching soon or further in the future, here are 11 exciting games we checked out at Summer Game Fest.\nKunitsu-Gami | Coming July 19View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close ClosePart action game, part resource-management strategy, Kunitsu-Gami: Path of the Goddess was one of the most unique games I played over the SGF weekend.\nPublisher: Reflector Entertainment | Developer: Bandai Namco Entertainment | PS5, PS4Dragon Age: The Veilguard | Coming Fall 2024View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close Close View and download image Download the image close CloseBioWare have lifted the veil on the first hour of gameplay in the long-anticipated return to Thedas.\nPublisher: All Possible Futures | Developer: Devolver Digital | PS5Keep an eye out for all these and more cool titles featured at Summer Game Fest coming to PlayStation.", "location": "Los Angeles, California", "classification": "security", "score": 0.40635391858914127, "event_breakdown": "1. The PlayStation Blog crew flew down to Los Angeles, CA to attend Summer Game Fest Play Days and go hands-on (and off) with a variety of upcoming PS5 games.\n2. Keep an eye out for all these and more cool titles featured at Summer Game Fest coming to PlayStation."}, {"id": "facc11f8-9966-4444-a13f-10826d6dde6a", "title": "The Garhwal Regiment glorious military heritage", "date": "2024-06-12 06:15", "url": "https://www.dailypioneer.com/2024/columnists/the-garhwal-regiment---s-glorious-military-heritage.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "The sprawling Bungalow No 6 amongst a hundred such, constructed in 1906 was home to Colonel Mainwaring commandant of 3/9 Royal Garhwal Rifles and was bought by MES for a princely Rs 10,053!\nScattered but indistinguishable descendants of erstwhile Nepalese can be found in Pathankot village as are remnants of 2/3 Gorkha Rifles also raised here which have an umbilical cord with the Garhwal Regiment.\nIt was a silver replica of this Unknown Soldier that PM Modi presented to the PM of France in 2015 to commemorate the centenary of WWI.\nThe Darwan Singh War Museum is the grand repository of the history and achievements in war and peace of the Regiment.\nThe Garhwal regimental legacy is protected by its three symbols: Lord Badrinath, the regimental deity, the iconic Unknown Soldier and the Royal Rassi.", "location": "Pathankot", "classification": "security", "score": 0.5951098572053698, "event_breakdown": "Bungalow if rebuilt Chapel:\nThe Bungalow if rebuilt will be a take away story in the times to come.\nRebuilding of the Chapel is underway and is currently at the critical stage of the process of fixing the altar and the pulpit."}, {"id": "e7f43d13-a089-42e5-bf1f-62f0732f3184", "title": "Russian ships arrive in Cuba as Cold War allies strengthen their ties", "date": "2024-06-12 17:45", "url": "https://ktvz.com/news/national-world/cnn-world/2024/06/12/russian-ships-arrive-in-cuba-as-cold-war-allies-strengthen-their-ties/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "CNN(CNN) — A group of Russian Navy ships, including a nuclear-powered submarine, arrived in Cuba on Wednesday morning in a sign of strengthening ties between the two Cold War allies.\nA CNN team on the ground saw members of the small Russian community in Cuba and Russian diplomats carrying national flags to welcome the crews.\nThe four Russian ships are now docked in berths usually occupied by cruise ships.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons.", "location": "Cuba", "classification": "security", "score": 0.642875257202933, "event_breakdown": "Russia - The arrival of a group of Russian Navy ships, including a nuclear powered submarine, in Cuba on Wednesday."}, {"id": "340b0b7a-3562-4c87-8548-d34e909c1d46", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:30", "url": "https://www.yahoo.com/news/shadow-war-lebanese-respite-southern-034540373.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Life goes on but \"the children are frightened\", the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon's Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group's October 7 attack on southern Israel.\n\"Let them (Israel) sit with their fear and we will sit with a beer,\" he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n\"Despite the security situation... people (in the south) have no other outlet but this beach,\" he said.", "location": "TYR", "classification": "security", "score": 0.8301896419113621, "event_breakdown": "Syria, Lebanon, Israel"}, {"id": "ed5294e5-fa86-4535-969c-420c4f0dd86e", "title": "Both Israel And Hamas Committed War Crimes In Gaza : UN", "date": "2024-06-12 19:15", "url": "https://easternmirrornagaland.com/both-israel-and-hamas-committed-war-crimes-in-gaza-un/", "domain": "easternmirrornagaland.com", "domain_classification": "Unknown", "message": "GENEVA — Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted on October 7 last year, according to a report by the UN Human Rights Council on Wednesday.\n“It is imperative that all those who have committed crimes be held accountable,” said the chair of the UN Human Rights Council Commission, Navi Pillay.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe report, presented in Geneva, is written by a commission of independent experts appointed by the UN Human Rights Council.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides.", "location": "GAZA", "classification": "security", "score": 0.5162672387212657, "event_breakdown": "The conflict between Israel and Hamas in the Gaza Strip has lasted for five months. Both Israel and Hamas have been accused of committing war crimes by the UN Human Rights Council. Both warring parties have attacked civilians and engaged in torture, hostage-taking, and inhumane treatment. The report highlights Israel's bombing of civilian targets and Hamas' indiscriminate firing of rockets at Israeli cities."}, {"id": "0cb3da00-8abe-4baa-94e3-f222063a4084", "title": "Russia Calls for Swift Release of Its Nationals Held by Hamas", "date": "2024-06-12 19:15", "url": "https://www.algemeiner.com/2024/06/12/russia-calls-for-swift-release-of-its-nationals-held-by-hamas/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "i24 News – Russia’s Human Rights Commissioner Tatyana Moskalkova on Tuesday announced that she appealed to senior United Nations (UN) and other officials to take action to secure the release of Russian nationals held by Hamas in the Gaza Strip after eight months after their kidnapping.\nAccording to her post on Telegram messaging app, Moskalkova launched the appeal after meeting in Moscow with relatives of those still being held.\nNews reports have put at eight the number of hostages holding Russian passports, including three who were released.\nAn Israeli-Russian dual national Andrey Kozlov was among the four hostages the Israel Defense Forces (IDF) rescued in an operation on Saturday.\npic.twitter.com/CiDndo7Ezb — Michael Freund (@msfreund) June 9, 2024Earlier in May, the Palestinian Islamic Jihad (PIJ), a Gazan terrorist group, released a psychological warfare video of Alexander Troufanov, another Russian-Israeli dual national held hostage in the Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.5595508778692468, "event_breakdown": "Location: Gaza Strip\nRussia’s Human Rights Commissioner appeals to UN to secure release of Russian nationals held by Hamas in Gaza"}, {"id": "2b44fac8-5eb6-44be-b75b-cd2c76fde4d1", "title": "Navy Relieved 12 Commanders in 6 Months Including 3 Firings that Were Never Publicly Announced", "date": "2024-06-12 02:30", "url": "https://www.military.com/daily-news/2024/06/11/navy-relieved-12-commanders-6-months-including-3-firings-were-never-publicly-announced.html", "domain": "military.com", "domain_classification": "Unknown", "message": "In addition to the nine publicly announced firings, Capt.\nDavid Wilson, commander of Naval Support Activity South Potomac, were also relieved of their commands in the past six months, a Navy spokesman said.\nHowever, commanders can also be relieved for medical reasons or ask to be relieved themselves, the Navy spokesman noted.\nFinally, also in January, the Navy fired the commander of the USS Georgia's blue crew -- Capt.\nTwo of the 12 fired Navy commanders were chaplains assigned to the Coast Guard.", "location": "NONE", "classification": "security", "score": 0.74459814242649, "event_breakdown": "1. Firing of nine publicly announced commanders of Navy base in the past six months\n2. Navy fired the commander of the USS Georgia's blue crew - Capt.\n3. Two chaplains assigned to the Coast Guard were Navy commanders fired."}, {"id": "acb08e93-9938-4143-8812-c7fe2607a9d4", "title": "Mindef signs deal for three Turkish LMS", "date": "2024-06-12 02:15", "url": "https://www.thestar.com.my/news/nation/2024/06/12/mindef-signs-deal-for-three-turkish-lms", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "ANKARA: The Defence Ministry (Mindef) has handed over the letter of agreement (LOA) for the purchase of the second batch of three Littoral Mission Ships (LMS) to Turkiye defence company, Savunma Teknolojileri Muhendislik (STM).\n“With the acquisition of this second batch of three LMS, it is hoped that it will help us reach the 18 ships needed for RMN.\nThe construction and equipping of the ship will be carried out in Turkiye, involving the cooperation of 50 companies from the Turkish defence sector.\nThe ship will be integrated with advanced systems and equipped with advanced weapon systems, sensors, and command and control systems that enable TLDM to carry out various missions effectively.\nThe second batch of LMS is an Ada-class corvette, a type of patrol and anti-submarine warfare (ASW) vessel equipped with advanced anti-aircraft missiles.", "location": "ANKARA", "classification": "security", "score": 0.78368972007277, "event_breakdown": "Event 1: The Defence Ministry (Mindef) has handed over the letter of agreement (LOA) for the purchase of three Littoral Mission Ships (LMS) to Turkiye defence company, Savunma Teknolojileri Muhendislik (STM).\nEvent 2: A new batch of LMS is an Ada-class corvette, a type of patrol and anti-submarine warfare (ASW) vessel equipped with advanced anti-aircraft missiles."}]