[{"id": "953e3a56-9965-4e54-8808-68c6b4a594dc", "title": "Rep . Ilhan Omar Shrugs Off Pro - Hamas Unrest on College Campuses", "date": "2024-05-24 00:15", "url": "https://redstate.com/jeffc/2024/05/23/rep-ilhan-omar-shrugs-off-pro-hamas-unrest-on-college-campuses-n2174594", "message": "During a congressional hearing on Thursday, Rep. Ilhan Omar (D-MN) downplayed antisemitism displayed by pro-Hamas activists on college campuses at the University of California, Los Angeles (UCLA).\nThe incident was brought to light when video footage surfaced showing anti-Israel protesters blocking a Jewish student from walking around on campus.\nHowever, multiple news reports show that the lion’s share of the unrest is being fomented by those advocating against Israel.\nEarlier this week, pro-Hamas activists pressured UCLA into shutting down a pro-Israel event that would have featured Jihad Watch’s Robert Spencer.\n\"UCPD has been there every single day, just standing idly by, and I think that's because UCLA administration never told them to intervene.", "location": "The location of the incident reported on during Thursday's congressional hearing is not mentioned in the text.", "classification": "antisemitism", "score": 0.9169313398349205, "event_breakdown": "\"\nPro-Hamas activists protesting UCLA regularly involved in Antisemitic bias incidents - Rep. Omar Thu. 15 Sep. - 12:17 AM PST - Pro-Hamas activists have been at the forefront of antisemitism events on college campuses and pressure University of California, Los Angeles (UCLA) into shutting down pro-Israel events, also featured by Jihad Watch’s Robert Spencer. More on https://t.co/7J58D3Mux5."}, {"id": "f98c648a-845e-4382-a7fa-b6ba49d15cc9", "title": "UK : Anti - Zionist Jewish students ignored in  antisemitic  NUS vote furore", "date": "2024-05-24 19:15", "url": "https://www.middleeasteye.net/news/uk-anti-zionist-jewish-students-ignored-antisemitic-nus-vote", "message": "The delegate saw the Union of Jewish Students (UJS), the NUS’s largest member body claiming to represent Jewish students, as excluding and marginalising Jews who are critical of Zionism.\nCombatting anti-Israel rhetoricThe Union of Jewish Students describes itself as the “voice of Jewish students”, spanning “over 75 Jewish societies” at universities in the UK and Ireland.\nIn January, it supported and co-signed a public statement taking a “stand against anti-Zionist Jewish groups and their damage to our Jewish community”.\nMEE has asked the National Union of Students and the Union of Jewish Students for comment.\nAnother Jewish NUS delegate, Elise, told MEE that anti-Zionist Jewish students are “part of the rich tapestry of Jewish thought, resistance and experience”.", "location": "England", "classification": "antisemitism", "score": 0.6572226265644285, "event_breakdown": "Event 1: In January 2021, the Union of Jewish Students (UJS) supported and co-signed a public statement taking a \"stand against anti-Zionist Jewish groups and their damage to our Jewish community”.ME EUROPE EVENTS\nEvent 2: Another Jewish NUS delegate, Elise, told Middle East Eye that anti-Zionist Jewish students are \"part of the rich tapestry of Jewish thought, resistance and experience\"."}, {"id": "70788f2f-004b-4f31-9a78-f45d3dcf74ca", "title": "John Fetterman ,  hero of Israel , will receive high honor at Yeshiva University commencement", "date": "2024-05-24 21:30", "url": "https://cumberlink.com/news/state-regional/john-fetterman-hero-of-israel-will-receive-high-honor-at-yeshiva-university-commencement/article_aa874ea4-1886-11ef-ba7c-4f703fa1df94.html", "message": "Yeshiva University will honor Sen. John Fetterman for his staunch support of Israel with a medallion that last year went to the inventor of Israel’s Iron Dome.\nThe university praised Fetterman for deeply engaging in “the post-October 7th battle against antisemitism” and “pursuit of justice” for hostages still in Hamas captivity.\n“It is truly humbling to be invited to share in this milestone with the graduates of Yeshiva University,” Fetterman said.\nThe senator has put himself at odds with pro-Palestinian protesters and has unequivocally supported Israel in its war against Hamas.\nYeshiva University has 7,400 undergraduate and graduate students across four campuses in New York City, according to the school, and more than 1,700 graduates this year.", "location": "New York", "classification": "antisemitism", "score": 0.8734037414964599, "event_breakdown": "* October 7, 2021 - A shooter attacked a synagogue in Halle, Germany.\n* Ongoing battle against antisemitism - Fetterman has been actively engaged in supporting the fight against antisemitism.\n* Hostages in Hamas captivity - Fetterman has been fighting for justice for hostages still held by Hamas."}]