[{"id": "1993dacc-4e5d-4d25-b44d-b15dd7996680", "title": "Russian attacks on DIY store , city center in Ukraine Kharkiv kill 6 , injure dozens", "date": "2024-05-26 02:30", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_375343.html", "message": "Russian strikes on a crowded DIY hardware store and a residential area in the Ukrainian city of Kharkiv on Saturday killed at least six people and injured dozens, local officials said.\n\"The attack targeted the shopping center, where there were many people - this is clearly terrorism,\" Terekhov said.\nFirefighters battle blazeAndriy Kudinov, director of the suburban shopping center, told local media the hardware store was full of shoppers buying items for their summer cottages.\nHuge clouds of dark smoke billowed into the sky over the shopping center.\nWitnesses described panicked scenes at the shopping center.", "location": "KHARKIV", "classification": "security", "score": 0.8960276289638718, "event_breakdown": "Security Events:\n- Russian strikes on DIY hardware store in Ukrainian city of Kharkiv on Saturday.\n- Russian strikes on residential area in Ukrainian city of Kharkiv on Saturday.\n- Russian attack on suburban shopping center in Kharkiv on Saturday.\n- Fire broke out at shopping center in Kharkiv on Saturday.\n- Firefighters battled blaze at shopping center.\n- Many shoppers buying items for their summer cottages present in shopping center when struck by russian.\n- Dark smoke billowed into the sky over the shopping center.\n- Witnesses described panicked scenes at the shopping center. - Russian strikes targeted the suburban shopping center in Kharkiv."}, {"id": "ce344a77-273c-4fd6-9757-0f6bb546779f", "title": "Russian strikes on Kharkiv kill at least 6 , injure dozens", "date": "2024-05-26 00:45", "url": "https://www.voanews.com/a/russian-strikes-on-kharkiv-kill-at-least-6-injure-dozens/7627025.html", "message": "Kharkiv Mayor Ihor Terekhov said about 120 people were in the hardware store when the bombs struck.\nKharkiv, Ukraine second-largest city, is about 30 kilometers from the Russian border and has come under attack for a few weeks as Russian forces have made a push into the northeast region as it tests Ukraine’s defenses along the front line farther south in the Donetsk region.\nUkrainian shelling in BelgorodMeanwhile, Ukrainian shelling on the Belgorod region, about 10 kilometers from the border, killed four people Saturday, Belgorod region Governor Vyacheslav Gladkov said.\nZelenskyy said that Ukrainian forces managed to take combat control of border areas in northern parts of Kharkiv where Russian troops launched an attack this month.\nVodolatskiy was quoted by the state-run Tass news agency as saying Russian forces controlled more than half the territory of the town of Vovchansk, five kilometers inside the Ukrainian border.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.664824484992494, "event_breakdown": "1. Russian troops launched an attack in the Kharkiv region in northern Ukraine.\n2. Four people were killed by Ukrainian shelling in the Belgorod region.\n3. Ukrainian president Volodymyr Zelenskyy said Ukrainian forces managed to take control of border areas of northern Kharkiv.\n4. Tass news agency in Russia said Russian forces controlled more than half the territory of Vovchansk, five kilometers inside the Ukrainian border."}, {"id": "e37d61e5-6cd4-4bdf-be3a-996ddc7da76e", "title": "Russian attack on Kharkiv shopping centre  utterly unacceptable , says senior UN official Global Issues", "date": "2024-05-26 03:00", "url": "https://www.globalissues.org/news/2024/05/25/36810", "message": "“I am appalled and shocked by the terrifying news arriving from Kharkiv”, said Ms. Brown in a statement.\nThe strike hit a busy shopping centre with scores of civilian casualties and massive damage to civilian facilities”.\nThe senior UN official added that attacks by Russian forces hitting civilians and civilian infrastructure must stop, and noted that intentionally directing an attack against civilian infrastructure is strictly prohibited under international humanitarian law.\nAccording to UN sources, a second attack on Saturday is believed to have caused some 12 casualties.\nFollowing Russian advances, the northeastern Kharkiv region is now on the frontline of the war in Ukraine.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.7422947652821792, "event_breakdown": "1. 24 April 2022 | Kharkiv, Ukraine: Dozens killed as Russian forces bomb a shopping and cinema complex.\n2. 25 April 2022 | Kharkiv, Ukraine: Dozens reported injured in Russian mortar attack."}, {"id": "2b2aef58-77c3-4405-a4e6-6d4e92849522", "title": "Multiple people killed , dozens injured in Russian airstrike on Ukraine shopping center – KTBB News , Weather , Talk", "date": "2024-05-26 00:00", "url": "https://ktbb.com/post/?p=1325268", "message": "Multiple people killed, dozens injured in Russian airstrike on Ukraine shopping centerPosted/updated on: May 25, 2024 at 4:09 pmGetty Image - STOCK(UKRAINE) -- Russian forces struck a Ukrainian shopping center in Kharkiv on Saturday, leaving four people dead and 38 people wounded according to local officials.\nOleh Synyehubov, the Kharkiv governor, said on Ukrainian television that they have so far identified 16 people as officially missing.\nSynyehubov also said there was a second strike in Kharkiv that injured 12 people, including a 13-year-old boy.\nUkrainian President Volodymyr Zelenskyy said 200 people were believed to have been in the shopping center when the attack happened.\n\"If Ukraine had enough air defense and modern combat aircraft, such Russian strikes would simply be impossible.", "location": ")\nKharkiv", "classification": "security", "score": 0.8228945531530928, "event_breakdown": "1. Four people were killed and 38 people injured in a Russian airstrike on a shopping centre in Kharkiv on Saturday.\n2. Second strike in Kharkiv injured 12 people, including a 13-year-old boy.\n3. 200 people were believed to have been in the shopping centre at the time of the attack."}, {"id": "31a44738-d4ba-44df-b1be-f929d7266bd5", "title": "Zelenskyy : Ukraine takes back control in areas of Kharkiv region | News , Sports , Jobs", "date": "2024-05-26 00:00", "url": "https://www.tribtoday.com/news/latest-news/2024/05/zelenskyy-ukraine-takes-back-control-in-areas-of-kharkiv-region/", "message": "KYIV, Ukraine (AP) — Ukrainian forces have secured “combat control” of areas where Russian troops entered the northeastern Kharkiv region earlier this month, President Volodymyr Zelenskyy said.\nKharkiv is about 12 miles from the Russian border.\nVovchansk has been a flashpoint for fighting since Russia launched the offensive in the Kharkiv region.\nRussian President Vladimir Putin has said the Kremlin’s army is attempting to create a “buffer zone” in the Kharkiv region to prevent Ukrainian cross-border attacks.\nIn addition to the ground offensive operation along Ukraine’s northeastern border, Russia is continuing to bombard the Kharkiv region with missiles, guided aerial bombs and drones.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.6612773680681135, "event_breakdown": "* Ukrainian forces have gained control of areas in which Russian troops entered northeastern Kharkiv, Ukraine.\n* The Kharkiv region has been experiencing intense fighting since Russia launched its offensive in the region.\n* Russia's objective is to invade Ukraine to create \"buffer zones\" and prevent cross-border attacks.\n* Kharkiv has been bombarded by missiles, guided aerial bombs, and drones."}, {"id": "10fa30c6-e96c-4d53-9edc-124066433de6", "title": "At least four killed and others missing after Russia strikes hardware store in Kharkiv", "date": "2024-05-26 04:15", "url": "https://krdo.com/news/2024/05/25/at-least-two-killed-and-others-missing-after-russia-strikes-hardware-store-in-kharkiv/", "message": "By Maria Kostenko and Radina Gigova and Darya Tarasova, CNN(CNN) — At least four people have been killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\nOfficials have said there were nearly 200 people inside the building when the strike occurred.\nHowever there were still people inside the building,” Oleh Syniehubov, the head of the Kharkiv regional military administration, said Saturday in an interview on national television.\nSeven people were killed in Russian strikes on the city Thursday, after locations including a printing house were targeted.\nEvery day we call on the world: give us air defense, save people.", "location": "Kharkiv", "classification": "security", "score": 0.4630305670150256, "event_breakdown": "1. At least four people were killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\n2. Officials said there were nearly 200 people inside the building when the strike occurred, but there were still people inside the building."}, {"id": "d33002da-ef9d-4c10-8c8b-72571c492332", "title": "Netanyahu : Israel has  Surprising  Plans for Hezbollah | The Jewish Press - JewishPress . com | Jewish News Syndicate ( JNS ) | 18 Iyyar 5784 – Sunday , May 26 , 2024", "date": "2024-05-26 01:30", "url": "https://www.jewishpress.com/news/middle-east/hezbollah/netanyahu-israel-has-surprising-plans-for-hezbollah/2024/05/26/", "message": "“We have detailed, important and even surprising plans,” the premier told Israel Defense Forces troops during a visit to the army’s Northern Command headquarters in the Upper Galilee city of Safed.\nHezbollah terrorists fired a barrage of around 30 rockets from southern Lebanon at the Upper Galilee on Thursday.\nAccording to the Upper Galilee Regional Council, there were no injuries, though the rockets caused several fires.\nHezbollah took credit for the salvo, saying that it had fired “dozens of Katyushas” at a military base.\nHezbollah has carried out near-daily attacks on Israel since joining the war against the Jewish state.", "location": "Upper Galilee", "classification": "security", "score": 0.9572244869664828, "event_breakdown": "* Hezbollah terrorists fired a barrage of around 30 rockets at the Upper Galilee on Thursday.\n* According to the Upper Galilee Regional Council, there were no injuries.\n* Hezbollah took credit for the salvo, saying that it had fired “dozens of Katyushas” at a military base.\n* Hezbollah has carried out near-daily attacks on Israel since joining the war against the Jewish state."}, {"id": "554a15ec-5ca6-4f6b-afdc-2e109cb9c226", "title": "At least four killed and others missing after Russia strikes hardware store in Kharkiv", "date": "2024-05-26 00:00", "url": "https://us.cnn.com/2024/05/25/europe/kharkiv-russian-strike-hypermarket-ukraine-intl/", "message": "CNN —At least four people have been killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\n“The air raid siren went off and some people managed to get out of the building, roughly 100 people.\nHowever there were still people inside the building,” Oleh Syniehubov, the head of the Kharkiv regional military administration, said Saturday in an interview on national television.\n“There is not a single military object nearby,” he added.\nSeven people were killed in Russian strikes on the city Thursday, after locations including a printing house were targeted.", "location": "Kharkiv", "classification": "security", "score": 0.583048087067898, "event_breakdown": "Events:\n- Russian military has struck a large hardware store in Kharkiv, Ukraine.\n- 33 people were wounded in the attack.\n- Several people were saved by a air raid siren.\n- Regional officials claim there was still people inside the store after the attack.\n- An official states there was no nearby military objects."}, {"id": "141fcc79-d650-403d-b94d-fd00fb86e5ef", "title": "UN official condemns Russian strike against Kharkiv hypermarket", "date": "2024-05-26 00:00", "url": "https://www.yahoo.com/news/un-official-condemns-russian-strike-230652506.html", "message": "Russian forces attacked a busy building materials hypermarket in Kharkiv with two guided bombs in the middle of the day on May 25, killing at least six people and injuring at least 40 others.\nThe strike hit a busy shopping centre with scores of civilian casualties and massive damage to civilian facilities.\"\nThe bombing of the hypermarket comes amid intensifying attacks against Kharkiv.\nRussian forces regularly conduct ground shelling and aerial attacks against population centers in Kharkiv Oblast.\nRead also: Russia’s latest offensive into Kharkiv Oblast is stretching Ukrainian defensesWe’ve been working hard to bring you independent, locally-sourced news from Ukraine.", "location": "KHARKIV", "classification": "security", "score": 0.9789466902652952, "event_breakdown": "- Russian forces attacked a building materials hypermarket in Kharkiv, Ukraine, on May 25, 2022, killing at least six people, injuring at least 40 others, and destroying scores of apartment buildings.\n- This attack follows the intensified ground shelling and aerial attacks that Russian forces have been conducting against population centers in Kharkiv Oblast."}, {"id": "2dfe6fd8-92bc-44f6-94c3-0fa5cd12f8ed", "title": "Editorial : On Memorial Day , remember the fallen and those they left behind", "date": "2024-05-26 01:30", "url": "https://www.dailypress.com/2024/05/25/editorial-on-memorial-day-remember-the-fallen-and-those-they-left-behind/", "message": "Editorial: On Memorial Day, remember the fallen — and those they left behind", "location": "MEMORIAL DAY", "classification": "security", "score": 0.8122754451517724, "event_breakdown": "Based on the content of the provided text, there are no security events listed that are mentionable."}, {"id": "89e5749f-4540-4828-abc9-144aae6d3bdd", "title": "Israel - Gaza war : anti - government protesters clash with Tel Aviv police and demand hostage deal", "date": "2024-05-26 03:45", "url": "https://www.theguardian.com/world/article/2024/may/26/israel-gaza-war-anti-government-protesters-clash-with-tel-aviv-police-and-demand-hostage-deal", "message": "View image in fullscreen Protesters clash with police officers during a demonstration in Tel Aviv on Saturday.\nThe announcement came less than a week after the army said it found the bodies of three other Israeli hostages killed on 7 October.\nHe said several people were killed, adding: “Even schools are not safe anymore.”The Israeli military said it was looking into the report.\nNo injuries were reported and the aid pier remains fully functional, Centcom said in a statement, adding that no US personnel would enter Gaza.\nAmerican officials hope the pier at maximum capacity can bring the equivalent of 150 truckloads of aid to Gaza daily.", "location": ".\nGAZA", "classification": "security", "score": 0.7708121246033968, "event_breakdown": "Event 1: A protest occurs in Tel Aviv, resulting in clashes between protesters and police officers.\nEvent 2: Three Israeli hostages are killed by unknown individuals on 7 October.\nEvent 3: The Israeli military announces that the bodies of three more Israeli hostages killed on 7 October have been found.\nEvent 4: US military personnel are unable to enter Gaza due to security concerns.\nEvent 5: A delivery pier remains fully functional despite security events.\nEvent 6: US military personnel hope to bring 150 truckloads of aid to Gaza daily. Event 7: The security events prevent American officials from bringing aid to Gaza."}, {"id": "298becf6-581a-46ee-8e6a-df53979f792f", "title": "Russian strike on Kharkiv DIY store kills six : governor", "date": "2024-05-26 01:30", "url": "https://www.fairfieldsuntimes.com/news/national/russian-strike-on-kharkiv-diy-store-kills-six-governor/article_454e94ce-28f3-5782-8448-361fd960b66a.html", "message": "Kharkiv regional governor Oleg Synegubov said on Telegram that six people \"died on the spot\", 40 were wounded and 16 missing after two guided Russian bombs hit the store.\n- 'Brutal blow' -Later Saturday, another strike hit the centre of Kharkiv, wounding 14 in an area containing a post office, a hairdresser and a cafe, the city's mayor Igor Terekhov said.\nThe latest attacks came after Russia launched a ground offensive in the Kharkiv region on May 10.\n- Border strikes -Russia and Ukraine accused each others' forces of attacks in the border area Saturday.\nUkraine said Russia shelled the village of Kupiansk-Vuzlovyi, a railway hub in the Kharkiv region near the border, wounding five, the regional prosecutor's office said.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.9300668556795119, "event_breakdown": "- Russia bombs a shopping centre in Kharkiv, killing at least six people, wounding 40 and destroying a post office, hairdressers and cafes. - On Saturday, Russia launched the first ground attack in the Kharkiv region May 10, on the same day that a Russian strike wounded 14 Ukrainians in the centre of Kharkiv. - Both sides accused each other of shelling on the border."}, {"id": "adaece1e-836b-4c8a-9d10-81c7f69271cf", "title": "At least four killed and others missing after Russia strikes hardware store in Kharkiv", "date": "2024-05-26 02:30", "url": "https://www.cbs58.com/news/at-least-four-killed-and-others-missing-after-russia-strikes-hardware-store-in-kharkiv", "message": "At least four killed and others missing after Russia strikes hardware store in KharkivValentyn Ogirenko/Reuters via CNN NewsourceBy Maria Kostenko and Radina Gigova and Darya Tarasova(CNN) — At least four people have been killed and 33 injured after a Russian strike hit a large hardware store in Kharkiv, Ukraine, on Saturday, according to officials.\nOfficials have said there were nearly 200 people inside the building when the strike occurred.\n“The air raid siren went off and some people managed to get out of the building, roughly 100 people.\nHowever there were still people inside the building,” Oleh Syniehubov, the head of the Kharkiv regional military administration, said Saturday in an interview on national television.\nSeven people were killed in Russian strikes on the city Thursday, after locations including a printing house were targeted.", "location": "KHARKIV", "classification": "security", "score": 0.7714100699327942, "event_breakdown": "Here is the list of security events related to the strike on a hardware store in Ukraine's Kharkiv:\n1. Russian military strike hit a large hardware store in Kharkiv, Ukraine on April 23rd 2022.\n2. There have been 4 people killed and 33 injured as a result of this strike.\n3. There were people inside the building when the air raid siren went off nearly 200 people."}, {"id": "f59260eb-89f6-4ccc-b9b9-48d7d40c3f21", "title": "  Gross Display Of Antisemitism : Jewish Elementary School In Canada Toronto Hit By Gunfire", "date": "2024-05-26 03:45", "url": "https://www.news18.com/world/gross-display-of-antisemitism-jewish-elementary-school-in-canadas-toronto-hit-by-gunfire-8904401.html", "message": "A Jewish girls’ school in Toronto, Canada was hit by gunfire early Saturday, without causing any injuries but prompting authorities to step up security at other schools and synagogues.\nPolice increased their presence in the school’s north Toronto neighborhood, as well as at other schools and synagogues, Krawczyk said.\n“Reports of shots fired at a Jewish elementary school in North York are despicable — a brazen act of antisemitism,” said Prime Minister Justin Trudeau.\nThe shooting comes amid the war in Gaza sparked by Palestinian militant group Hamas’s unprecedented October 7 attack on Israel.\nIn November, a Jewish school in Montreal was hit by gunfire twice in one week.", "location": "Toronto", "classification": "security", "score": 0.5157874434502453, "event_breakdown": "Reports of shots fired at a Jewish elementary school in North York, Toronto, Canada, early Saturday.\nReports of a brazen act of antisemitism at a Toronto school by shooting at a Jewish girls’ school."}]