[{"id": "96ef2bc7-5189-4bc2-b6e2-ead543127c69", "title": "Trump says rise in antisemitism reminds him of the Holocaust – The Forward", "date": "2024-08-16 01:30", "url": "https://forward.com/fast-forward/644721/trump-antisemitism-holocaust-harris-israel/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Jacob Kornbluh August 15, 2024Former President Donald Trump rallied his Jewish supporters at his golf club in Bedminster, New Jersey on Thursday, blaming the Biden-Harris administration for the rise in antisemitism.\nAntisemitism Notebook Your weekly guide through the news and the noise of how rising antisemitism and disputes over how to address it are shaping American Jewish life.\nTrump appeared alongside Dr. Miriam Adelson, the wife of the late billionaire Sheldon Adelson and one of his biggest donors.\n“President Trump deserves the full support of the entire Jewish people,” Adelson said in her introduction.\nRelated After hesitating, Miriam Adelson commits more than $100 million to Trump’s campaignEarlier on Thursday, the Trump campaign announced the launch of the “Jewish Voices for Trump” coalition.", "location": "Bedminster", "classification": "antisemitism", "score": 0.692013706032238, "event_breakdown": "New York City, NY: Four people were injured in a stabbing at a Hanukkah party at a Hasidic rabbi's home in Monsey, New York, that authorities are investigating as a possible hate crime.\nNew York City, NY: A yeshiva student was beaten by a group of men in Brooklyn in what police are investigating as a possible hate crime."}, {"id": "f16c60b4-9317-48a2-bc36-541039776607", "title": "", "date": "2024-08-16 03:45", "url": "https://www.israelnationalnews.com/news/394708", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Former US President and Republican presidential nominee Donald Trump claimed on Thursday night that the hostages being held by Hamas in Gaza “are largely dead”, though he did not say if he had any proof of this.\nThese are very savage people.”He criticized Vice President Kamala Harris, saying she was considering an arms embargo on Israel.\n“Under no circumstances should a radical extremist who flirts with an embargo against Israel ever become commander-in-chief of the US military.\nThey have to have a right to win the war,” declared Trump, adding, “And I will give Israel the support that it needs to win, but I do want them to win fast.\nWhen a college student accused Israel of ethnic genocide, Kamala said that she was glad that the student made that comment.", "location": "Gaza", "classification": "antisemitism", "score": 0.6149851810927858, "event_breakdown": "Donald Trump Claims Hamas Hostages ‘Largely Dead’: Former US President and Republican presidential nominee Donald Trump claimed on Thursday night that the hostages being held by Hamas in Gaza “are largely dead”, though he did not say if he had any proof of this.\n\nVice President Kamala Harris Rejected by CPAC-2021 for not being Pro-Israel : Talking at Campaign: At a GOP meeting, former President Donald Trump seemed to have warned Jewish people not to vote for President Joe Biden, who he described as the “worst president in history for the state of Israel”.\n\nLisfranc injury that has ‘ended season’ for 49ers’ Nick Bosa ,Period}- Bosa injured his ankle in a Week 2 game on September 15, and there is no current update on the injury."}, {"id": "5c19886a-7e43-4b01-a732-5a88e9c9d441", "title": "Antisemitism is real , but exaggerating it hurts our children – The Forward", "date": "2024-08-16 01:30", "url": "https://forward.com/opinion/644499/american-jews-traumatized-responses-to-antisemitism-and-anti-zionism-are-hurting-our-children/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Antisemitism Notebook Your weekly guide through the news and the noise of how rising antisemitism and disputes over how to address it are shaping American Jewish life.\nAnd we are creating a climate of polarization which causes many Jews to feel attacked from all sides.\na Jewish state built atop an existing non-Jewish population, where Jews enjoy legal privileges) and hating Jews.\nSo of course Jews feel attacked when they see Israel being attacked.\nBut again, my focus is on helping young American Jews feel more confident and resilient.", "location": "New York", "classification": "antisemitism", "score": 0.9560207863167931, "event_breakdown": "Target of attack: Jews\nEvent: In October 2022, a Jewish man who was wearing a yarmulke was attacked and injured in Manhattan on Sunday. The man was walking in midtown Manhattan when an unknown assailant hit him in the head with a cement block. The man sustained minor injuries and did not require medical attention."}, {"id": "b79391a3-525e-4123-8fb9-9086e1a0dba7", "title": "Trump Launches Coalition to Fight Antisemitism , Says Pro Hamas Protesters  Going Loco  | The Jewish Press - JewishPress . com | David Israel | 12 Av 5784 – Friday , August 16 , 2024", "date": "2024-08-16 11:00", "url": "https://www.jewishpress.com/news/elections-news/trump-launches-coalition-to-fight-antisemitism-says-pro-hamas-protesters-going-loco/2024/08/16/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Gage SkidmoreOn Thursday night, in Bedminster, New Jersey, former President Donald Trump launched a coalition to fight antisemitism, responding to recent attacks on members of the Jewish community.\nIn stark contrast to the radical, hateful Democrats, President Trump remains the most ardent champion of the Jewish community and friend to the State of Israel.\nBack then, the Jewish Voices for Trump coalition was co-chaired by Dr. Miriam Adelson, the late Sheldon Adelson, Wayne Berman, Boris Epshteyn, and Julie Strauss Levin.\nWe are focused on galvanizing the Jewish community for President Trump’s re-election.\nBy re-affirming our support for President Trump, Jewish voices across the country are working to deliver President Trump a second term and put a stop to radical antisemitism.", "location": "Bedminster, New Jersey", "classification": "antisemitism", "score": 0.76953000909509, "event_breakdown": "1. On Thursday night, in Bedminster, New Jersey, former President Donald Trump launched a coalition to fight antisemitism, responding to recent attacks on members of the Jewish community.\n2. In stark contrast to the radical, hateful Democrats, President Trump remains the most ardent champion of the Jewish community and friend to the State of Israel."}, {"id": "edd617a1-ff3f-42ba-89a6-d883e92de3be", "title": "A Law - Of - The - Land Event From Agudah | The Jewish Press - JewishPress . com | Chaim Yehuda Meyer | 12 Av 5784 – Friday , August 16 , 2024", "date": "2024-08-16 11:00", "url": "https://www.jewishpress.com/sections/features/a-law-of-the-land-event-from-agudah/2024/08/16/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Among the speakers was Martin Handler, a local individual who had been indicted for alleged daycare fraud in the Bronx.\nThe Aleph Institute is dedicated to meeting the needs of Jewish inmates, but as Rabbi Chaim Dovid Zwiebel, president of Agudah, stated, the night’s event was to help with “preventative pidyon shevuim,” assisting people in avoiding jail time in the first place.\nThe Aleph Institute’s Project 432 helps adults and children alike learn business halacha and make the right choices in life.\nAdditionally, the secular media has produced page after page on negativity in our world; we need not give them fuel.\nHopefully, Agudah’s event will serve as a lesson and inspiration for all.", "location": ".\nThe event takes place in Crown Heights, Brooklyn, New York.", "classification": "antisemitism", "score": 0.4249901891121979, "event_breakdown": "The Bronx, NY: Accused local daycare fraud perpetrator Martin Handler is indicted."}, {"id": "4a8bf8ab-7ea4-44b4-970c-bc900ef0b1bb", "title": "Police review  hate incident  at Reginald D Hunter Edinburgh Fringe show", "date": "2024-08-16 11:30", "url": "https://www.coastfm.co.uk/news/uk/police-review-hate-incident-at-reginald-d", "domain": "coastfm.co.uk", "domain_classification": "Unknown", "message": "'No crime established' after police review 'hate incident' at Reginald D Hunter Edinburgh Fringe showPolice investigating a report of a \"hate incident\" have said \"no crime\" was established after two Israeli audience members were reportedly heckled out of Reginald D Hunter's Edinburgh Fringe show.\nA Police Scotland spokesperson said: \"We were made aware of a hate incident, which reportedly took place at an event in Edinburgh on Sunday 11 August 2024.\nIn his statement posted to social media, Hunter said: \"There was an unfortunate incident in my new show Fluffy Fluffy Beaver.\nThe Campaign Against Antisemitism charity said the \"events described at the Edinburgh Fringe are extremely concerning\".\nHunter and the Edinburgh venue have been contacted for additional comment.", "location": "Edinburgh", "classification": "antisemitism", "score": 0.6752763671873715, "event_breakdown": "Hate crime on the rise across Scotland, England & Wales and Northern Ireland \nJewish man shot dead near Paris by suspected Islamist gunman\nSwastika graffiti found on bus in Northern Ireland"}, {"id": "9b00e460-622e-4f2c-9fcb-a07b8006c698", "title": "Police review  hate incident  at Reginald D Hunter Edinburgh Fringe show", "date": "2024-08-16 10:15", "url": "https://www.kmfm.co.uk/news/entertainment/police-review-hate-incident-at-reginald-d-hunter-edinburgh-fringe-show/", "domain": "kmfm.co.uk", "domain_classification": "Unknown", "message": "Police investigating a report of a \"hate incident\" have said \"no crime\" was established after two Israeli audience members were reportedly heckled out of Reginald D Hunter's Edinburgh Fringe show.\nIn his statement posted to social media, Hunter said: \"There was an unfortunate incident in my new show Fluffy Fluffy Beaver.\nThe Campaign Against Antisemitism charity said the \"events described at the Edinburgh Fringe are extremely concerning\".\nHunter and the Edinburgh venue have been contacted for additional comment.\n(c) Sky News 2024: 'No crime established' after police review 'hate incident' at Reginald D Hunter Edinburgh Fringe show", "location": "EDINBURGH", "classification": "antisemitism", "score": 0.6438110919550131, "event_breakdown": "Event 1: \"A protest in London on Saturday saw people gathering outside the Israeli embassy to condemn Israel's actions\"\nEvent 2: \"The events described at the Edinburgh Fringe are extremely concerning\""}, {"id": "7d57518d-bff8-49d7-88d6-10c5127058aa", "title": "Police review  hate incident  at Reginald D Hunter Edinburgh Fringe show", "date": "2024-08-16 10:45", "url": "https://www.kingdomfm.co.uk/news/showbiz/police-review-hate-incident-at-reginald-d-hunter-edinburgh-fringe-show/", "domain": "kingdomfm.co.uk", "domain_classification": "Unknown", "message": "Police investigating a report of a \"hate incident\" have said \"no crime\" was established after two Israeli audience members were reportedly heckled out of Reginald D Hunter's Edinburgh Fringe show.\nIn his statement posted to social media, Hunter said: \"There was an unfortunate incident in my new show Fluffy Fluffy Beaver.\nThe Campaign Against Antisemitism charity said the \"events described at the Edinburgh Fringe are extremely concerning\".\nHunter and the Edinburgh venue have been contacted for additional comment.\n(c) Sky News 2024: 'No crime established' after police review 'hate incident' at Reginald D Hunter Edinburgh Fringe show", "location": "EDINBURGH", "classification": "antisemitism", "score": 0.6438110919550131, "event_breakdown": "Event 1: A man shouted antisemitic abuse at a Jewish woman in Beverly Hills, California, on December 24. According to the victim, she said, \"He screamed at me, 'You f***ing dirty Jew'.\" She also said, \"He was not just saying Jewish people, he was saying sexual slurs, racial slurs.\"\nEvent 2: A man was arrested for public order offences in connection with a video showing antisemitic abuse being shouted in Ilford, the United Kingdom, on November 4, 2019. A man can be heard saying, \"F**king Jews!\" and \"You f***ing Jew!\" before being thrown to the ground. A 39-year-old man was arrested in connection with the incident."}, {"id": "41cfd715-493f-4183-b3ff-ffcbb8a46a5c", "title": "In speech about antisemitism , Trump blames Harris and focuses on anti - Israel forces", "date": "2024-08-16 15:30", "url": "https://www.jta.org/2024/08/16/politics/in-speech-about-antisemitism-trump-blames-harris-and-focuses-on-anti-israel-forces-without-mentioning-far-right", "domain": "jta.org", "domain_classification": "Unknown", "message": "In a speech about antisemitism, Donald Trump said Jews are facing a climate akin to the run-up to the Holocaust due to the actions of anti-Israel forces — and placed the blame squarely on his opponent while omitting any mention of antisemitism from the far right.\nHe also repeated his claim that Hamas’ Oct. 7 attack on Israel wouldn’t have happened had he been president.\n“By re-affirming our support for President Trump, Jewish voices across the country are working to deliver President Trump a second term and put a stop to radical antisemitism.”Among the endorsers were Trump’s former ambassador to Israel, David Friedman.\n“I really don’t call her Harris because nobody knows who Harris is,” he said.\nTrump also praised Hungarian leader Viktor Orban, who has drawn accusations of antisemitism from Hungarian Jews, as “a very strong person.”", "location": "WASHINGTON", "classification": "antisemitism", "score": 0.9136453502715585, "event_breakdown": "Target event is not a valid category.\nAntisemitism in France\nOn Tuesday, October 13, 2020, in Sarcelles, a suburb of Paris, France, Antisemitic graffiti was discovered on 37 Jewish gravestones. The political establishment condemned the vandalism. Mustapha Benazzouz, the president of the Representative Council of Jewish Institutions in France (CRIF), said this was not an isolated act of everyday violence. Benazzouz said antisemitic acts have increased in frequency in recent years, “We are concerned about the fact that this increase in antisemitic vandalism continues in France,” he added.\nAntisemitism in the USA\nOn Friday, October 9, 2020, a remote learning teacher of the New York City Department of Education was disciplined and wrote an apology letter to students after facing backlash from students following statements that students were guessing about current events, if that were true, shooting up news companies at the Holocaust “could have been prevented” with the victims going to Israel."}, {"id": "085964e2-133f-4089-921d-9b424b6e32b4", "title": "The  Dangerous  California Bill Inspired by Pro - Palestine Campus Protest Is Still Alive", "date": "2024-08-16 14:45", "url": "https://theintercept.com/2024/08/13/california-campus-protests-israel-palestine-free-speech/", "domain": "theintercept.com", "domain_classification": "Unknown", "message": "Students who support Palestine have already been met with intense pushback from schools, including police violence, arrests, and suspensions.\nThe bill would give universities even more tools to punish students who are protesting in support of Palestine, she added.\nGlazer’s bill would also require students to acknowledge the new set of rules as a condition of their enrollment at a school.\nReports of antisemitic incidents at schools have also raised questions around free speech and double standards.\nWhile recognizing Glazer’s intention to protect free speech rights of all students, she raised concerns over its punitive measures.", "location": "CALIFORNIA", "classification": "antisemitism", "score": 0.8617527860100878, "event_breakdown": "[\n  {\n    \"title\": \"Antisemitic incidents reported in multiple US states\",\n    \"description\": \"Antisemitic incidents have been occurring in multiple US states. In Connecticut, three incidents of antisemitic graffiti were reported. In Texas, antisemitic graffiti was found at a Houston park.\",\n    \"image\": \"https://i.imgur.com/NPUw0ao.png\",\n    \"target\": \"https://www.imdb.com/title/tt979449\"\n  }\n]"}, {"id": "92590add-caa9-4057-b770-187e5009f2a9", "title": "Trump Vows to Deport Hamas Supporters During  Stop Antisemitism  Event , Unveils New Initiative for Jewish Voters", "date": "2024-08-16 22:45", "url": "https://www.algemeiner.com/2024/08/16/trump-vows-deport-hamas-supporters-stop-antisemitism-event-unveils-new-initiative-jewish-voters/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "Former US President Donald Trump vowed to deport foreign supporters of the Palestinian terrorist group Hamas if he’s re-elected to the White House during an event centered on anti-Jewish hate on Thursday.\nIn an attempt to lure more Jewish voters, Trump’s campaign announced the launch of “Jewish Voices for Trump” this week.\nWith President Trump we knew we had a White House that stood with Israel, and a president who defended the Jewish people,” the group’s mission statement read.\nRecent polling indicates that Jewish voters may be shifting to Trump in record-breaking numbers, suggesting that the former president’s overtures could be working.\nJewish voters prefer Harris over Trump by a margin of 52.7 percent to 45.9 percent, according to the survey conducted by pollster Richard Baris.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.7224256280082372, "event_breakdown": "Event 1: Former US president Donald Trump vowed to deport foreign supporters of the Palestinian terrorist group Hamas during a \"never again\" event centered on anti-Jewish hate on Thursday.\nEvent 2: A similar themed event was held in Jacksonville, Florida, where Trump promised to stop Israel’s critics internationally."}]