[{"id": "9aad2802-57c8-4272-9008-a18af19c2ffc", "title": "Pentagon admits killing a shepherd with a Hellfire missile in Syria in botched drone strike after mistaking him for a senior Al Qaeda leader", "date": "2024-05-02 18:15", "url": "https://www.dailymail.co.uk/news/article-13376575/pentagon-drone-strike-syria-al-qaeda-shepherd-death.html", "message": "A botched U.S. drone strike in Syria killed a shepherd last year after he was mistakenly identified as a senior Al Qaeda operative.\nThe Pentagon has admitted a civilian and not a terrorist leader was slain on May 3, 2023 after an internal Central Command (CENTCOM) investigation.\nThe victim has since been 56-year-old father-of-10 Lufti Hasan Masto, who was killed while he was tending to his sheep.\nA MQ-9 predator drone was tracking his movements in fields around his home in the rural town of Qorqanya when a Hellfire missile was fired in his direction.\nCENTCOM 'determined U.S. forces misidentified the intended Al Qaeda target and that a civilian, Mr. Lufti Hasan Masto (Masto), was struck and killed instead'.", "location": "Qorqanya", "classification": "security", "score": 0.9847305783547525, "event_breakdown": "- A botched U.S. drone strike in Syria mistakenly killed a shepherd identified as a senior Al Qaeda operative\n- The Pentagon admitted that a civilian, 56-year-old father-of-10 Lufti Hasan Masto, was killed in the strike\n- The victim was tending to his sheep in the rural town of Qorqanya when a Hellfire missile was fired at him by a MQ-9 predator drone\n- CENTCOM confirmed that U.S. forces misidentified the target, leading to the death of Mr. Lufti Hasan Masto"}, {"id": "3be8def8-e0e2-4ec0-8da3-00314af2c572", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354779.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes kill scores of Russian troops.\n- UK Defense Ministry estimates 450,000 Russian troops killed or wounded since the conflict began.\n- Attack kills over 100 Russian soldiers in a single strike, according to OSINT and military analysts.\n- Russian troops killed while training on Dzharylhach island.\n- Ukrainian footage shows HIMARS strike on a sandbar.\n- Ukrainian official describes the situation as \"funny\" because Russian soldiers made themselves sitting ducks."}, {"id": "e80976a3-733a-4d2e-8c3f-c7fc2cbc17dc", "title": "9 of Ukraine deadliest strikes that killed scores of Russians with a single blow US HIMARS and ATACMS take a toll", "date": "2024-05-04 10:30", "url": "https://www.yahoo.com/news/6-russias-deadliest-moments-ukraine-115354241.html", "message": "Some Ukrainian strikes have killed scores of Russian troops with a single blow.\nThe UK Defense Ministry said on April 27, 2024, that it estimated 450,000 Russian troops had been killed or wounded since the start of the conflict.\nThe attack killed more than 100 Russian soldiers in one fell swoop, according to OSINT and military analysts.\nRussians killed while training on Dzharylhach islandFootage uploaded by Ukraine of a HIMARS strike on a sandbar.\nAn unnamed Ukrainian official told the Kyiv Post that it was a \"funny situation\" because the Russian soldiers had made themselves sitting ducks.", "location": "Dzharylhach island", "classification": "security", "score": 0.6441261900959085, "event_breakdown": "- Ukrainian strikes kill scores of Russian troops in a single blow\n- UK Defense Ministry estimates 450,000 Russian troops killed or wounded since start of conflict\n- Attack kills over 100 Russian soldiers, as reported by OSINT and military analysts\n- Russians killed while training on Dzharylhach island\n- Ukraine uploads footage of HIMARS strike on sandbar\n- Unnamed Ukrainian official describes Russian soldiers as sitting ducks"}, {"id": "62e7b9a9-6ce2-4223-bd28-058cc647ddd0", "title": "CENTCOM Report : US Drone Strike Killed Shepherd", "date": "2024-05-02 20:15", "url": "https://www.newsmax.com/world/globaltalk/syria-centcom-drone-strike/2024/05/02/id/1163279/", "message": "Following a yearlong investigation, United States Central Command has admitted that a U.S. drone strike in Syria last year killed a 56-year old shepherd and not a terrorist leader.\nU.S. forces released a Hellfire missile near Masto’s home killing him and several of his sheep.\nCentral Command acknowledges and regrets the civilian harm that resulted from the airstrike.\nWe take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm,” CENTCOM wrote in their press release.\n“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the report stated.", "location": "Syria", "classification": "security", "score": 0.9311538199665129, "event_breakdown": "- A U.S. drone strike in Syria killed a 56-year old shepherd instead of a terrorist leader after a yearlong investigation by United States Central Command.\n- The strike took place near Masto's home, resulting in the death of Masto and several of his sheep.\n- Central Command admitted and regretted the civilian harm caused by the airstrike.\n- CENTCOM emphasized that they take reports of civilian harm seriously and strive to minimize such harm through thorough targeting and strike processes.\n- The report stated that efforts would be made to learn from the incident and enhance targeting processes to reduce potential civilian casualties."}, {"id": "ca6635b4-454b-474e-b40f-d41e5cf9b47d", "title": "Israeli precision - guided munition likely killed group of children playing foosball in Gaza , weapons experts say", "date": "2024-05-03 10:00", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/02/israeli-precision-guided-munition-likely-killed-group-of-children-playing-foosball-in-gaza-weapons-experts-say/", "message": "“My soul is gone.”In the two weeks since the attack, the Israeli military’s statements have shifted, but it has not taken responsibility for the strike that ultimately killed Shahed and 10 other children.\nAn analysis of the site of the attack, documented by a freelance journalist working for CNN in Gaza, paints a very different picture of Israeli military responsibility.\nCobb-Smith said he believed there was “no question” that an Israeli munition was used in the attack, saying Palestinian militants “do not have anything with this amount of sophistication” in their arsenal.\nIsraeli military’s shifting responseCNN has pressed the Israeli military for details about the strike, which took place on April 16 at about 3:40 p.m., according to video evidence.\nThe Israeli military declined to provide any additional evidence to back up its claims.", "location": "Gaza", "classification": "security", "score": 0.9033308524075278, "event_breakdown": "1. Israeli military strike kills Shahed and 10 other children, with no clear responsibility taken by the Israeli military.\n2. Analysis of the attack site suggests Israeli munition was used, indicating Israeli military responsibility.\n3. CNN presses Israeli military for details about the strike, but Israeli military declines to provide additional evidence."}, {"id": "d505dd1e-2d83-40de-a0b7-0a8e7a903d09", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.yahoo.com/news/u-central-command-finds-2023-184350267.html", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nFile Photo by Bonnie Cash/UPIMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"\nThe strike investigation, conducted by Army Brigadier General John P. Cogbill, wrapped up Nov. 15, 2023.", "location": "Syria", "classification": "security", "score": 0.8860074744325478, "event_breakdown": "- U.S. airstrike in Syria on May 3, 2023, targeting senior Al Qaeda leader killed civilian Lufti Hasan Masto\n- U.S. Central Command investigation conducted by Army Brigadier General John P. Cogbill wrapped up on November 15, 2023"}, {"id": "2657f8eb-04ce-43b5-8b8b-1b47eb6e9543", "title": "U . S . Central Command finds 2023 U . S . airstrike in Syria killed civilian , not terrorist", "date": "2024-05-02 19:30", "url": "https://www.upi.com/Top_News/World-News/2024/05/02/CENTCOM-Syria-strike-civilian-killed/1701714674364/", "message": "U.S. Central Command said Thursday an investigation found that a civilian was killed instead of an Al Qaeda terrorist leader in a May 2023 U.S. strike in Syria.\nCENTCOM said it is fully engaged in implementing Defense Secretary Lloyd Austin's (pictured) Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes.\nFile Photo by Bonnie Cash/UPI | License PhotoMay 2 (UPI) -- U.S. Central Command said Thursday that a May 3, 2023, airstrike in Syria targeting a senior Al Qaeda leader instead killed civilian Lufti Hasan Masto.\n\"U.S. Central Command acknowledges and regrets the civilian harm that resulted from the airstrike,\" Centcom's statement said.\n\"We take all reports of civilian harm caused by U.S. military operations seriously and continue to employ thorough and deliberate targeting and strike processes to minimize civilian harm.\"", "location": "Syria", "classification": "security", "score": 0.8318856970406131, "event_breakdown": "- May 3, 2023: U.S. airstrike in Syria targeting Al Qaeda leader results in civilian Lufti Hasan Masto being killed instead.\n- U.S. Central Command acknowledges and regrets civilian harm from the airstrike. \n- Investigation finds civilian killed instead of Al Qaeda leader in the U.S. strike in Syria.\n- CENTCOM fully engaged in implementing Defense Secretary Lloyd Austin's Civilian Harm Mitigation and Response Action Plan to minimize civilian harm in future strikes."}, {"id": "69b42543-143a-4f34-805b-babf08082c56", "title": "2 Nigerian military officers to face court martial over drone strike that killed civilians", "date": "2024-05-03 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240502-voa08.htm", "message": "2 Nigerian military officers to face court martial over drone strike that killed civiliansBy VOA News May 02, 2024Two Nigerian military officers will face a court martial over a December drone strike that killed at least 85 civilians, the Defense Headquarters said on Thursday.\nThe Nigerian military acknowledged the drone accidentally struck a village in northwest Kaduna State, killing residents as they celebrated a Muslim festival.\nThe military depends on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n\"The military has conducted a painstaking investigation into the incident and has initiated disciplinary action against those culpable,\" he said.\nThe United Nations human rights office said the drone strike was the latest of at least four airstrikes since 2017 that caused significant civilian fatalities.", "location": "Kaduna State", "classification": "security", "score": 0.8801605478683782, "event_breakdown": "- Location: Kaduna State, Nigeria\n  - Two Nigerian military officers to face court martial over a drone strike that killed at least 85 civilians in a village.\n  - The drone strike occurred in December, accidentally hitting a village during a Muslim festival celebration.\n  - The Nigerian military relies on aerial assaults to combat Islamic militants in the northeast and armed kidnapping gangs in the northwest.\n  - The United Nations human rights office has cited this drone strike as one of several airstrikes since 2017 that resulted in significant civilian casualties."}, {"id": "1ed3378c-c160-4e10-a4ae-4e6a64f0e383", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 20:30", "url": "https://www.devdiscourse.com/article/law-order/2925923-us-airstrike-targeting-al-qaida-leader-in-syria-killed-a-farmer-american-military-says", "message": "A US airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, US Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nUS Central Command said an investigation into the May 3 strike concluded that US forces misidentified the intended al-Qaida target \"and that a civilian, Mr. Lufti Hasan Masto, was struck and killed.\"\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIn a statement, Central Command said much of the investigation and findings are classified but acknowledged it revealed \"several issues that could be improved.\"\nThe US also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida's second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6595479662729967, "event_breakdown": "- US airstrike in Syria in May 2023 targeting an al-Qaida leader resulted in the death of an innocent civilian, Mr. Lufti Hasan Masto.\n- US Central Command confirmed the incident on Thursday following reports from residents and family members.\n- The investigation into the May 3 strike concluded that US forces misidentified the intended target as an al-Qaida leader.\n- The investigation was completed in November but was only publicly released on Thursday.\n- Central Command stated that the findings of the investigation are classified but acknowledged that there were \"several issues that could be improved.\"\n- The US continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida's second in command in Syria."}, {"id": "acaaf569-2e75-450f-835c-4de8803facdb", "title": "US airstrike targeting al - Qaida leader in Syria killed a farmer , American military says", "date": "2024-05-02 21:15", "url": "https://www.independent.co.uk/news/syria-ap-washington-american-syrian-observatory-for-human-rights-b2538804.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A U.S. airstrike in Syria in May 2023 that was targeting an al-Qaida leader killed an innocent civilian instead, U.S. Central Command said Thursday, confirming early reports from residents and family members shortly after the attack.\nCentral Command said the investigation into the strike was completed last November — but it wasn't released publicly until Thursday.\nIt set up a detailed investigation and review process for strikes when there are allegations of innocent people being killed.\nThe U.S. also continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria.", "location": "Syria", "classification": "security", "score": 0.6023448210491533, "event_breakdown": "- U.S. airstrike in Syria targeting an al-Qaida leader kills an innocent civilian instead, as confirmed by U.S. Central Command.\n- Central Command completes investigation into the strike in November but only releases it publicly on Thursday.\n- Detailed investigation and review process set up for strikes involving allegations of innocent casualties.\n- U.S. continues to target al-Qaida and Islamic State leaders in Syria, including the 2017 airstrike that killed Abu al-Kheir al-Masri, a former aide to Osama bin Laden and al-Qaida’s second in command in Syria."}, {"id": "e7964c08-f9cd-45c4-92cc-3e7de04b7879", "title": "Explosion at DRC displaced person camp kills at least 9", "date": "2024-05-03 19:00", "url": "https://www.voanews.com/a/explosion-at-drc-displaced-persons-camp-kills-at-least-9-/7596984.html", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at the Mugunga displaced persons camp in Goma reported by DRC journalist Daniel Michombero\n- At least nine people, mostly children, killed following explosion(s) at the displaced persons camp in Goma\n- Witnesses and local officials saw at least nine bodies and 20 wounded\n- Local hospital received 32 wounded and four bodies\n- DRC government spokesman Patrick Muyaya blames Rwandan army and M23 rebels for the attack"}, {"id": "856b6d8b-265d-42d4-8240-56499bc108d5", "title": "Explosion at DRC displaced person camp kills at least 9 - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-05-04 16:30", "url": "https://www.newdelhitimes.com/explosion-at-drc-displaced-persons-camp-kills-at-least-9/", "message": "Local officials and media reports in the eastern Democratic Republic of Congo say at least nine people – most of them children – were killed Friday following an explosion or explosions at displaced persons camp in the eastern city of Goma.\nFrom his X social media account, DRC journalist Daniel Michombero reported an explosion at the Mugunga displaced persons camp in Goma.\nWitnesses and local officials reported seeing at least nine bodies at the scene and at least 20 wounded.\nA local hospital official told the French news agency AFP the facility had received 32 wounded and four bodies.\nIn a statement on his official X account, DRC government spokesman Patrick Muyaya blamed the Rwandan army and its “terrorist auxiliaries” the M23 rebels for the attack.", "location": "Goma", "classification": "security", "score": 0.8547022541090561, "event_breakdown": "- Explosion at Mugunga displaced persons camp in Goma, Democratic Republic of Congo\n- At least nine people, most of them children, killed in the explosion\n- At least 20 people wounded in the explosion\n- DRC government spokesman Patrick Muyaya blaming the Rwandan army and M23 rebels for the attack"}, {"id": "04878edb-0cac-4e7f-9d64-a97f9e91627a", "title": "Armies need their own drone air force flown by specialist soldiers , study says", "date": "2024-05-04 10:00", "url": "https://www.yahoo.com/news/armies-own-drone-air-force-090001120.html", "message": "The air war in Ukraine has become a cat-and-mouse game where drones must constantly evolve.\nRUSI envisions each drone battalion being equipped with everything needed to conduct a variety of UAV operations.\nThis would include \"situational awareness UAVs optimized for tactical reconnaissance; tactical strike UAVs; ISR [reconnaissance] UAVs able to penetrate into operational depth; operational strike UAVs; and platform-launched effects designed specifically to synchronize with and enable other weapons systems.\"\nTo support friendly ground troops in contact with the enemy, flocks of expendable reconnaissance drones would operate up to 5 miles beyond the enemy front line.\n\"It therefore makes sense to concentrate UAV operation if UAVs are parts of a mass precision strike complex,\" the report concluded.", "location": "Ukraine", "classification": "security", "score": 0.21068914930339053, "event_breakdown": "- Location: Ukraine\n  - The air war in Ukraine evolves into a cat-and-mouse game, necessitating constant evolution of drones.\n  - RUSI proposes equipping each drone battalion with resources for various UAV operations, including tactical reconnaissance, tactical strike, ISR (reconnaissance) penetrating into operational depth, operational strike, and platform-launched effects.\n  - Expendable reconnaissance drones would operate in flocks up to 5 miles beyond the enemy front line to support friendly ground troops.\n  - Concentration of UAV operations is suggested if UAVs are part of a mass precision strike complex, according to the report."}, {"id": "c70ea3bb-89b0-499d-9422-39577a3b7529", "title": "Journalist , 2 others killed after vehicle hit with remote - controlled blast in Khuzdar", "date": "2024-05-03 13:15", "url": "https://www.geo.tv/latest/542275-journalist-killed-after-vehicle-hit-with-remote-controlled-blast-in-khuzdar", "message": "Journalist, 2 others killed after vehicle hit with remote-controlled blast in KhuzdarRemote-controlled blast was carried out on the Sultan Ibrahim Khan Road on National HighwayMohammad Siddiq Mengal car is seen damaged following the blast on May 3, 2024, in this still taken from a video.\nKHUZDAR: Mohammad Siddiq Mengal, a journalist and president of the Khuzdar Press Club, was killed along with two others on Friday after a remote-controlled bomb targeted his vehicle in Khuzdar, police told Geo News.\nThe killed passers-by were seriously injured in the remote-controlled blast and were brought to the hospital, while the other eight injured in the blast are undergoing treatment in different hospitals, police said.\nAccording to the police, the remote-controlled blast was carried out on the Sultan Ibrahim Khan Road on the National Highway.\nThe station house officer said that the journalist's vehicle was the target of the blast and was hit when he was going to university from his home.", "location": "Khuzdar", "classification": "security", "score": 0.982317040954408, "event_breakdown": "- Journalist, 2 others killed after vehicle hit with remote-controlled blast in Khuzdar\n- Remote-controlled blast carried out on Sultan Ibrahim Khan Road on National Highway\n- Mohammad Siddiq Mengal's car damaged following the blast"}, {"id": "c1294a6b-6c38-4b6a-9cea-7d2631894831", "title": "Eight Syrian soldiers injured in Israeli airstrike near Damascus", "date": "2024-05-03 10:45", "url": "https://news.webindia123.com/news/Articles/World/20240503/4193717.html", "message": "Syrian defence ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing Syrian state-run broadcaster said the strike caused \"material losses.\"\nIsraeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defence ministry said according to the Syrian Arab News Agency.\nAlso Russian state media TASS quoted Dubai-based Al Hadath TV as saying that the attack targeted a base of Lebanon's Shia militia, Hezbollah, located southwest of Damascus International Airport.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.", "location": "Damascus", "classification": "security", "score": 0.8854851289834088, "event_breakdown": "- Syrian defence ministry claimed eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\n- The strike caused \"material losses,\" according to The Times of Israel citing Syrian state-run broadcaster.\n- Israeli warplanes launched missiles from over the Golan Heights at a site near the capital, as reported by the Syrian defence ministry via the Syrian Arab News Agency.\n- Russian state media TASS cited Dubai-based Al Hadath TV stating that the attack targeted a base of Lebanon's Shia militia, Hezbollah, southwest of Damascus International Airport.\n- There was no official confirmation by Israeli authorities regarding the reported reprisal strike."}, {"id": "9d32ac01-d7ad-475b-bc81-9483b5b8cdde", "title": "Moment more than 100 of Putin troops  are wiped out  in long - range strike with newly supplied US ATACMS ballistic missile", "date": "2024-05-03 09:30", "url": "https://www.dailymail.co.uk/news/article-13378811/Moment-100-Putins-troops-wiped-long-range-strike-newly-supplied-ATACMS-ballistic-missile.html", "message": "This is the moment more than 100 Russian troops are believed to have been killed in an ATACMS tactical ballistic missile strike on occupied Luhansk.\nA military training ground was seen being hit by multiple explosions typical of an ATACMS strike in footage captured by a drone flying high above.\nFootage of the recent attack appears to show the training ground as one such target.\nOver the area where the Russian soldiers were seen seconds earlier, hundreds of flashes of smoke are seen erupting over the clearing.\nThese flashes, according to analysts, were the M74 APAM mini-bombs detonating on the training ground, killing many of the Russian troops gathered there.", "location": "Luhansk", "classification": "security", "score": 0.6081572083828758, "event_breakdown": "- Location: Occupied Luhansk\n  - More than 100 Russian troops believed to have been killed in an ATACMS tactical ballistic missile strike on a military training ground.\n  - Footage captured by a drone shows multiple explosions typical of an ATACMS strike hitting the training ground.\n  - The attack targeted the area where Russian soldiers were gathered, with hundreds of flashes of smoke seen erupting over the clearing, indicating detonation of M74 APAM mini-bombs and resulting in casualties."}, {"id": "3454294c-c27e-41f8-8ae3-9631189df1fc", "title": "N Korea plotting attacks on embassies , Seoul says", "date": "2024-05-03 19:45", "url": "https://www.taipeitimes.com/News/world/archives/2024/05/04/2003817373", "message": "N Korea plotting attacks on embassies, Seoul saysAFP, SEOULSouth Korea’s spy agency yesterday said that Pyongyang was plotting “terrorist” attacks targeting Seoul’s officials and citizens overseas, with the South Korean Ministry of Foreign Affairs raising the alert level for diplomatic missions in five countries.\nNorth Korean leader Kim Jong-un, right, visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology in Pyongyang on Friday.\nAs a result, the North may be “plotting retaliation” against South Korean embassy staff on such pretenses, NIS added.\nThis marked the highest number of defections by North Korean elites to the South since 2017, Seoul said.\nThe consul, also an intelligence agent, had been monitoring Pyongyang’s illicit activities, including drug trafficking and the production of counterfeit banknotes, according to South Korean reports.", "location": "SEOUL", "classification": "security", "score": 0.4236494391586273, "event_breakdown": "- Location: Various countries (not specified)\n  - South Korea's spy agency warns of North Korea plotting \"terrorist\" attacks targeting Seoul's officials and citizens overseas.\n  - South Korean Ministry of Foreign Affairs raises the alert level for diplomatic missions in five countries in response to the threat.\n- Location: Pyongyang, North Korea\n  - North Korean leader Kim Jong-un visits the Pyongyang General Control Center at the State Directorate of Aerospace Technology.\n- Location: North Korea (specific location not provided)\n  - North Korea may be \"plotting retaliation\" against South Korean embassy staff.\n- Location: South Korea (not specified)\n  - South Korea reports the highest number of defections by North Korean elites to the South since 2017.\n  - A consul, also an intelligence agent, who had been monitoring Pyongyang's illicit activities, including drug trafficking and the production of counterfeit banknotes, defects to South Korea."}, {"id": "2c90295d-dd5f-4dc4-b1bf-29b9b39adfdf", "title": "Military concludes airstrike in Syria last May killed civilian , not terrorist", "date": "2024-05-02 18:30", "url": "https://www.wsgw.com/military-concludes-airstrike-in-syria-last-may-killed-civilian-not-terrorist/", "message": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.\nThough the investigation found several areas the command could improve on, according to the summary, it did not recommend any accountability actions for killing a civilian.\nIn a tweet on May 3, the same day as the strike, a group known as “The White Helmets” who work as first responders in Syria identified Masto as the civilian killed.\nThe White Helmets said Masto was grazing sheep when the strike killed him and several of the sheep.\nDefense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations after a series of media reports revealed operations in Syria, Iraq, and Afghanistan had killed more civilians than initially reported.", "location": "northwestern Syria", "classification": "security", "score": 0.8691106551687732, "event_breakdown": "- U.S. military airstrike in northwestern Syria in May\n- U.S. military initially claimed to have killed a senior al Qaeda leader in the airstrike\n- U.S. military investigation concluded that a civilian was killed in the airstrike\n- \"The White Helmets\" identified the civilian killed as Masto in a tweet on the same day as the strike\n- Masto was grazing sheep when the strike killed him and several of the sheep\n- Defense Secretary Lloyd Austin issued a Civilian Harm Mitigation and Response Action Plan to limit civilian casualties in U.S. military operations"}, {"id": "a61a115b-d82c-4fd8-b40b-e7443f69cb03", "title": "Rafah offensive and war in Gaza : Threat of a dangerous escalation", "date": "2024-05-04 06:45", "url": "https://www.firstpost.com/opinion/rafah-offensive-and-war-in-gaza-threat-of-a-dangerous-escalation-13767004.html", "message": "Rafah and RegionWithin the region, there is apprehension about the Rafah offensive.\nIn case of the Rafah offensive going ahead, there is all likelihood that the engagements from Hezbollah into northern Israel will grow.\nConclusionLike the Israeli strike on the Iranian consulate in Damascus, the Rafah offensive too threatens to escalate the conflict if launched.\nWhile the Iran-Israel spat was short, the Rafah offensive could spread very fast.\nThe only face-saving exit for either of the parties is an early and long lasting ceasefire in Gaza before any offensive in Rafah.", "location": "Rafah", "classification": "security", "score": 0.5080231489088098, "event_breakdown": "- Apprehension in the region about the Rafah offensive.\n- Likelihood of increased engagements from Hezbollah into northern Israel if the Rafah offensive proceeds.\n- Rafah offensive threatens to escalate the conflict, similar to the Israeli strike on the Iranian consulate in Damascus.\n- Potential for rapid spread of conflict if the Rafah offensive is launched.\n- Early and long-lasting ceasefire in Gaza seen as the only face-saving exit for either party before any offensive in Rafah."}, {"id": "fa00e033-7519-41be-822c-f3e0268c1d9e", "title": "Australian Muslims claim  double standard  in police handling of hate crime incidents – International Shia News Agency", "date": "2024-05-04 12:15", "url": "https://en.shafaqna.com/367278/australian-muslims-claim-double-standard-in-police-handling-of-hate-crime-incidents/", "message": "Shafaqna English- Australian Muslims claim ‘double standard’ in police handling of hate crime incidents, ead of the Australian National Imams Council (ANIC) said.\nAn April 13 knife attack in a mall in Sydney, Australia killed six people before police killed the attacker.\nDays later, Australian police said the attacker had mental health problems that led to the isolated act and that the attack was not related to terrorism.\n“One was described as a mental health issue, the other one was labeled a terrorist act.\nEmphasizing that the language used by police did not help the situation, Al-Suleiman said they conveyed their concerns about a double standard to authorities but got unsatisfactory feedback.", "location": "Sydney, Australia", "classification": "security", "score": 0.4265718112077503, "event_breakdown": "- Knife attack in a mall in Sydney, Australia on April 13, killing six people\n- Australian police stating the attacker had mental health problems\n- Australian National Imams Council (ANIC) criticizing police for double standards in handling hate crime incidents."}, {"id": "89289aea-f029-44a5-89b3-9a3650a6d649", "title": "Teenagers and terrorism : What is being done ? ", "date": "2024-05-03 20:45", "url": "https://www.brisbanetimes.com.au/national/vulnerable-cohort-what-is-it-about-teenagers-and-terrorism-and-what-is-being-done-20240502-p5foez.html", "message": "AdvertisementNor is the link yet clear between the six charged this week and the church attacker, though one described him as a “mate”.\nThey had comprised half of ASIO’s “priority counter-terrorism caseload” just a couple of years ago, and “it’s picked up again”, he said.\nASIO Director-General Mike Burgess told the press club that young terror suspects were not a new problem.\nMuslim leaders have slammed authorities for not exploring alternatives to the counter-terrorism raids in Sydney last month.\nThe speed with which police designated the church stabbing a terrorist incident, just hours after it occurred, remains another source of grievance.", "location": "Sydney", "classification": "security", "score": 0.3949117641785517, "event_breakdown": "- ASIO's \"priority counter-terrorism caseload\" involving six charged individuals\n- Lack of clear link between the six charged individuals and the church attacker\n- ASIO Director-General Mike Burgess highlighting the issue of young terror suspects\n- Muslim leaders criticizing authorities for not exploring alternatives to counter-terrorism raids in Sydney\n- Controversy surrounding the swift designation of the church stabbing as a terrorist incident"}, {"id": "0df0c2ba-d656-4b3b-91ba-7157a14ef790", "title": "Ukraine wiped out 100 Russian troops at once in a strike showcasing the range and power of its new US ATACMS", "date": "2024-05-04 05:45", "url": "https://www.businessinsider.in/international/news/ukraine-wiped-out-100-russian-troops-at-once-in-a-strike-showcasing-the-range-and-power-of-its-new-us-atacms/articleshow/109819475.cms", "message": "Ukrainian forces took out more than 100 Russian soldiers with an ATACMS missile, per OSINT analysts.\nAdvertisementA Ukrainian ATACMS long-range missile strike killed more than 100 Russian soldiers in an occupied region 50 miles from the front line, according to OSINT and military analysts.\nOsinttechnical said at least one of the missiles struck a gathering of more than 100 Russian soldiers, with hundreds of M74 APAM bomblets falling on them.\nThe US had previously sent ATACMS with a shorter range to Ukraine, but the versions sent recently can travel about 190 miles — which puts higher-value targets in Ukraine's crosshairs.\nThe US sent Ukraine ATACMS with a shorter range last fall, which enabled Ukraine to destroy Russian helicopters and airfields behind the front lines, but not go after more distant targets.", "location": "Occupied region 50 miles from the front line", "classification": "security", "score": 0.6165030683517179, "event_breakdown": "- Location: Occupied region (specific location not provided)\n  - Ukrainian forces use ATACMS missile to target a gathering of over 100 Russian soldiers, killing them, according to OSINT analysts.\n  - The strike occurred approximately 50 miles from the front line.\n  - The ATACMS missile released hundreds of M74 APAM bomblets on the targeted area.\n  - The US recently sent Ukraine ATACMS missiles with a longer range of about 190 miles, allowing Ukraine to target higher-value and more distant Russian assets.\n  - Previously, the US had supplied Ukraine with ATACMS missiles with a shorter range, which were used to destroy Russian helicopters and airfields behind the front lines."}, {"id": "a2f90014-67c6-44d7-9c0b-f1e37e28d74a", "title": "USS Cole Anniversary Today : Media Silent", "date": "2024-05-03 13:45", "url": "https://www.newsbusters.org/blogs/nb/richard-newcomb/2007/10/12/uss-cole-anniversary-today-media-silent", "message": "On this day in the year 2000, the guided missile destroyer USS Cole was attacked by Islamic terrorists associated with Osama bin Laden's al-Quaeda group.\nToday is the seventh anniversary of that attack.\nThe most recent example occured in 1968 when North Korea attacked the USS Pueblo.\nYet not a single media organ seems to care that Americans were attacked and killed.\nThe USS Pueblo was attacked and captured by North Korea, not North Vietnam.", "location": "Yemen.", "classification": "security", "score": 0.9382491564323843, "event_breakdown": "- Location: Aden, Yemen\n  - USS Cole attacked by Islamic terrorists associated with Osama bin Laden's al-Qaeda group in the year 2000.\n  - Today marks the seventh anniversary of the USS Cole attack.\n  - In 1968, North Korea attacked and captured the USS Pueblo.\n  - Media seemingly indifferent to attacks on American vessels such as the USS Cole and USS Pueblo."}, {"id": "fbdb9ee8-6c83-4a38-92b8-cb519df349ad", "title": "For Decades , Moscow Has Sought to Silence Its Critics Abroad", "date": "2024-05-03 07:30", "url": "https://www.newsmax.com/world/globaltalk/russia-kgb-killings-spies-assassinations/2024/05/03/id/1163339/", "message": "Security expert Andrei Soldatov said the work of the Kremlin's intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat's how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky's ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.\nBritain accused Russia in the attack, which the Kremlin denied being behind, and Western nations expelled Russian spies in response.", "location": "Munich", "classification": "security", "score": 0.799525666224368, "event_breakdown": "- Sidney Reilly, a Ukrainian-born agent working for Britain, caught by the Kremlin's intelligence services\n- Ramon Mercader befriending Sidney Reilly to spy on Trotsky\n- Soviet agent confronting Stepan Bandera in Munich, resulting in his death by cyanide\n- Britain accusing Russia of the attack on Stepan Bandera\n- Western nations expelling Russian spies in response to the allegations"}, {"id": "8d3af4c4-5b8a-4fc8-acbd-8e2d7cb60f46", "title": "Iranian - Made Cruise Missile Crashes in Somalia , No Casualties Reported", "date": "2024-05-03 12:45", "url": "https://horseedmedia.net/iranian-made-cruise-missile-crashes-in-somalia-no-casualties-reported-389579", "message": "TALEEX, Somalia (Horseed Media) – An apparent Iranian-made cruise missile crashed in Somalia’s Sool region late Thursday night, according to witness accounts and visual evidence from the scene, though no casualties have been reported.\nDebris an apparent Iranian-made cruise missile crashed in Somalia’s SoolResidents of Taleex district described hearing a loud explosion around midnight, with wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile (LACM).\nNo group has claimed responsibility for the apparent cruise missile launch violating Somali airspace.\n“These actions are taken to protect freedom of navigation and make international waters safer and more secure for US, coalition, and merchant vessels,” CENTCOM said in a statement.\nNo casualties have been reported in Somalia from the apparent failed cruise missile strike.", "location": "TALEEX", "classification": "security", "score": 0.6868776696100055, "event_breakdown": "- An apparent Iranian-made cruise missile crashed in Somalia’s Sool region\n- Debris of the Iranian-made cruise missile found in Taleex district, Somalia\n- Residents of Taleex district heard a loud explosion around midnight\n- Wreckage discovered in the morning bearing resemblance to an Iranian Quds land-attack cruise missile\n- No group has claimed responsibility for the apparent cruise missile launch violating Somali airspace\n- CENTCOM stated that the actions were taken to protect freedom of navigation\n- No casualties have been reported in Somalia from the apparent failed cruise missile strike."}, {"id": "22e2ea16-a82c-4a06-8124-7ed445a0cfb9", "title": "Alleged Israeli Airstrike Injures Eight Syrian Soldiers Near Damascus", "date": "2024-05-03 10:45", "url": "https://www.i24news.tv/en/news/israel/defense/artc-alleged-israeli-airstrike-injures-eight-syrian-soldiers-near-damascus", "message": "Eight Syrian soldiers were injured in an alleged Israeli airstrike on the outskirts of Damascus, according to Syrian state media reports.\nThe strike, which occurred shortly before 11 p.m., targeted a military position in the Damascus area, as confirmed by the Syrian Defense Ministry.\nSyria's state-run SANA broadcaster cited a military source reporting that Israeli warplanes launched missiles from over the Golan Heights in northern Israel, resulting in material losses.\nThe targeted building, located just south of the Sayyeda Zeinab shrine, was allegedly used by Syrian security forces, according to a security source in the alliance backing Syrian President Bashar Assad’s government.\nThis strike marks a development since the April 1 incident, where several top Islamic Republic Revolutionary Guard Corps officers were killed in a strike also attributed to Israel.", "location": "Damascus", "classification": "security", "score": 0.9687736038777326, "event_breakdown": "- Location: Outskirts of Damascus, Syria\n  - Eight Syrian soldiers injured in an alleged Israeli airstrike.\n  - Strike occurs shortly before 11 p.m. and targets a military position, confirmed by the Syrian Defense Ministry.\n  - Israeli warplanes launch missiles from over the Golan Heights, according to Syrian state-run SANA broadcaster.\n  - Targeted building allegedly used by Syrian security forces, located south of the Sayyeda Zeinab shrine.\n  - Development since April 1 incident where top Islamic Republic Revolutionary Guard Corps officers were killed in a strike attributed to Israel."}, {"id": "80049497-682d-4daf-9423-58bf7135acb1", "title": "When Tony Blair Bombed Montenegro", "date": "2024-05-02 19:45", "url": "https://consortiumnews.com/2024/05/02/when-tony-blair-bombed-montenegro/", "message": "It came amid airstrikes on Yugoslav forces in Kosovo, where Bill Clinton and Tony Blair waged a “humanitarian intervention” ostensibly to save ethnic Albanians from Serb leader Slobodan Milosevic.\nSuch secrecy would become a common feature of future NATO air wars, making it hard for victims to hold individual states responsible.\nBlair’s ally in the conflict, Kosovo Liberation Army (KLA) leader Hashem Thaci, is currently on trial for war crimes.\nDuring the air war, Sawers pushed for Britain to deepen ties with the KLA, who were fighting Serb forces on the ground.\na decade on from the Kosovo war.", "location": "Kosovo", "classification": "security", "score": 0.6044193724653399, "event_breakdown": "- Location: Kosovo\n  - Airstrikes on Yugoslav forces in Kosovo conducted during a \"humanitarian intervention\" led by Bill Clinton and Tony Blair to protect ethnic Albanians from Serb leader Slobodan Milosevic.\n  - Secrecy surrounding NATO air wars becomes a common feature, making it difficult for victims to hold individual states responsible.\n  - Kosovo Liberation Army (KLA) leader Hashem Thaci is currently on trial for war crimes, being Blair's ally during the conflict.\n  - During the air war, efforts were made to deepen ties between Britain and the KLA, who were fighting against Serb forces on the ground.\n  - Reflecting on the Kosovo war, a decade later."}, {"id": "f2f23de5-015d-4c92-bd08-4f5d1939b352", "title": "Gaza : 54 Palestinians killed , 102 injured by Israeli bombardments last 48hrs - The Muslim News", "date": "2024-05-03 23:45", "url": "https://muslimnews.co.uk/news/palestine/gaza-54-palestinians-killed-102-injured-by-israeli-bombardments-last-48hrs/", "message": "Gaza City, (Al Jazeera, Wafa, AA): Between the afternoons of 1 and 3 May, according to the Ministry of Health (MoH) in Gaza, 54 Palestinians were killed and 102 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip.\nIsrael’s attacks have so far directly caused $33 billion of damage in the Gaza Strip, it said.\nMeanwhile, nine more civilians were injured in another Israeli strike on the Bureij refugee camp in the central Gaza Strip.\nMeanwhile, nine more civilians were injured in another Israeli strike on the Bureij refugee camp in the central Gaza Strip.\n[Photo: Children in Rafah city queue to receive a bowl of food for their families from charity organizations, in Rafah, Gaza on 03 05 2024.", "location": "Gaza Strip", "classification": "security", "score": 0.9925868363863584, "event_breakdown": "- Between the afternoons of 1 and 3 May, 54 Palestinians were killed and 102 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza City.\n- Israel's attacks have caused $33 billion of damage in the Gaza Strip.\n- Nine civilians were injured in an Israeli strike on the Bureij refugee camp in the central Gaza Strip."}, {"id": "d9086c95-2da9-4437-a0e8-2d22b654e712", "title": "Haunted by their colleague deaths : The journalists risking their lives to report from Gaza", "date": "2024-05-03 09:15", "url": "https://edition.cnn.com/2024/05/02/middleeast/palestinian-journalists-gaza-world-press-freedom-day-intl-cmd/", "message": "Gazan journalists told CNN they are haunted by their colleagues’ deaths, as they balance the emotional labor of covering the war with trying to protect their families.\nIsrael launched a military assault on Gaza on October 7 after the militant group Hamas, which governs Gaza, killed at least 1,200 people in Israel and abducted more than 250 others.\nAfter nearly seven months of war, Abu Dagga told CNN that she, too, wants to leave.\nThe photojournalist for Turkish state broadcaster TRT told CNN he had been traveling through the neighborhood, after being displaced from the local refugee camp.\n“This was a huge burden on me,” Dahman, 36, told CNN last month.", "location": "Gaza", "classification": "security", "score": 0.7677629001437708, "event_breakdown": "null"}, {"id": "6fdd2569-a689-4f69-90c5-86a4838ff55a", "title": "Russia Says It Killed Ukrainian Agent Plotting  Terrorist  Acts : Report", "date": "2024-05-03 13:45", "url": "https://www.ndtv.com/world-news/ukrainian-saboteur-killed-by-russias-fsb-for-planning-terror-attacks-5580056", "message": "The man was planning to attack a fuel depot in the Leningrad region.\n(Representational)Russia's FSB security service said on Friday it had killed a man recruited by Ukraine to blow up military buildings and energy sites in Russia, state media reported.\nThe FSB said on Friday it had \"neutralised\" a man who had \"planned to commit a series of terrorist acts in Russia\", Russian state-run news agencies quoted an FSB statement as saying.\nThese, it said, included attacks \"against defence ministry facilities in the Moscow region and against members of a volunteer battalion and a volunteer centre in Saint Petersburg\".\nThe man was planning to attack a fuel depot in the Leningrad region, the FSB alleged.", "location": "Saint Petersburg", "classification": "security", "score": 0.4280794057909932, "event_breakdown": "- Location: Leningrad region, Russia\n  - FSB security service reports a man planned to attack a fuel depot in the Leningrad region.\n- Location: Moscow region and Saint Petersburg, Russia\n  - FSB neutralizes a man recruited by Ukraine to blow up military buildings and energy sites, including defense ministry facilities in the Moscow region and attacks against members of a volunteer battalion and center in Saint Petersburg."}, {"id": "e6b27467-e2da-41b6-8831-77e0d7989097", "title": "US military admits that air strike killed civilian in Syria last year", "date": "2024-05-02 19:30", "url": "https://us.cnn.com/2024/05/02/politics/us-military-admits-air-strike-killed-civilian-syria/", "message": "“We are committed to learning from this incident and improving our targeting processes to mitigate potential civilian harm,” the summary says.\nStill, the US did not launch an official investigation of the strike until nearly 8 weeks later after the strike that killed him.\nMohammad Mesto sits next to the grave of his brother Lutfi, who was killed on May 3 in a suspected US military strike in northern Syria.\nIn that case, CENTCOM opened a formal 15-6 investigation into the strike within a week of the operation.\nMesto’s family previously told CNN that he had been out grazing his sheep when he was killed.", "location": "Northern Syria", "classification": "security", "score": 0.48503599557855004, "event_breakdown": "- Location: Northern Syria\n  - Mohammad Mesto sits next to the grave of his brother Lutfi, killed in a suspected US military strike.\n  - US commits to learning from the incident and improving targeting processes to mitigate potential civilian harm.\n  - US launches an official investigation into the strike nearly 8 weeks after it occurred.\n  - CENTCOM opens a formal 15-6 investigation into the strike within a week of the operation.\n  - Mesto's family reports that Lutfi was killed while grazing his sheep."}, {"id": "c4007b69-68bf-4cdc-9480-01b80a7b3272", "title": "Russian missiles hit Ukraine Odesa for third time in a week , injuring 14", "date": "2024-05-03 08:45", "url": "https://naharnet.com/stories/en/304982-russian-missiles-hit-ukraine-s-odesa-for-third-time-in-a-week-injuring-14", "message": "Russia struck the southern Ukrainian port city of Odesa with ballistic missiles in a nighttime attack, injuring 14 people and starting a massive blaze, local officials and emergency services said.\nThe third attack on the city in a week hit a sorting depot belonging to Ukraine's biggest private delivery company, Nova Poshta.\nUkraine has deployed increasingly sophisticated long-range drones to hit back, aiming at targets on Russian soil, especially infrastructure that sustains the Russian economy and war effort.\nThe governors of three Russian regions reported that energy facilities were damaged by Ukrainian drone strikes overnight.\nThe Russian Defense Ministry said Ukrainian drones were shot down over the Bryansk, Krasnodar, Rostov and Belgorod regions.", "location": "Odesa", "classification": "security", "score": 0.8647478397809565, "event_breakdown": "- Russia struck Odesa, Ukraine with ballistic missiles, injuring 14 people and starting a massive blaze\n- The attack hit a sorting depot belonging to Nova Poshta in Odesa\n- Ukraine deployed long-range drones to hit back, targeting infrastructure on Russian soil\n- Energy facilities in three Russian regions were reported damaged by Ukrainian drone strikes\n- Russian Defense Ministry reported Ukrainian drones shot down over Bryansk, Krasnodar, Rostov, and Belgorod regions"}, {"id": "25dcbc7f-5a86-4f71-bbdb-348908120eef", "title": "For decades , Moscow has sought to silence its critics abroad", "date": "2024-05-04 10:45", "url": "https://wtop.com/national/2024/05/for-decades-moscow-has-sought-to-silence-its-critics-abroad/", "message": "Security expert Andrei Soldatov said the work of the Kremlin’s intelligence services, then and now, has been defined by threats from dissidents abroad.\nThat’s how it caught Sidney Reilly, a Ukrainian-born agent who worked for Britain both inside Russia and abroad.\nHe was befriended there by Ramon Mercader, who pretended to be sympathetic to Trotsky’s ideas but in reality was a Soviet agent.\nWhile living in exile in Munich in 1959, Bandera, 50, was killed after being confronted by a Soviet agent with a gun that sprayed cyanide.\nBritain accused Russia in the attack, which the Kremlin denied being behind, and Western nations expelled Russian spies in response.", "location": "Munich", "classification": "security", "score": 0.799525666224368, "event_breakdown": "- Security expert Andrei Soldatov mentions the threat from dissidents abroad faced by the Kremlin's intelligence services.\n- Ukrainian-born agent Sidney Reilly, working for Britain both in Russia and abroad, is caught by the Kremlin's intelligence services.\n- Ramon Mercader befriends Sidney Reilly and is revealed to be a Soviet agent despite pretending to sympathize with Trotsky’s ideas.\n- In Munich in 1959, Ukrainian nationalist Bandera, aged 50, is killed by a Soviet agent using a cyanide-spraying gun.\n- Britain accuses Russia of the attack on Bandera, which the Kremlin denies, leading Western nations to expel Russian spies in response."}, {"id": "012bff15-7f49-44a2-a13b-e10f84328664", "title": "On This Day , May 4 : Construction begins on Panama Canal", "date": "2024-05-04 07:45", "url": "https://www.upi.com/Top_News/2024/05/04/On-This-Day-Construction-begins-on-Panama-Canal/2111714788645/", "message": "1 of 7 | Construction of the Panama Canal is underway in 1912.\nThe canal began construction on May 4, 1904.\nIn 1904, construction began on the Panama Canal.\nAdvertisementIn 1970, National Guardsmen killed four students at Kent State University in Ohio during a demonstration against the Vietnam War.\nFile Photo courtesy of Kent State University ArchivesIn 1980, President Joseph Broz Tito of Yugoslavia died at age 87.", "location": "Panama City", "classification": "security", "score": 0.7246918517733413, "event_breakdown": "1. Construction of the Panama Canal begins in 1904.\n2. National Guardsmen kill four students at Kent State University in Ohio during a demonstration against the Vietnam War in 1970.\n3. President Joseph Broz Tito of Yugoslavia dies at age 87 in 1980."}, {"id": "f2de444c-1fc2-4afb-a6f4-5b3582a2274b", "title": "Eight Syrian soldiers injured in Israeli airstrike - News Today", "date": "2024-05-04 06:45", "url": "https://newstodaynet.com/2024/05/04/eight-syrian-soldiers-injured-in-israeli-airstrike/", "message": "Syrian defense ministry claimed on Friday that eight Syrian soldiers were injured in an Israeli airstrike near Damascus.\nThe Times of Israel citing a Syrian state-run broadcaster said the strike caused “material losses.”Israeli warplanes launched their missiles from over the Golan Heights at a site in the area of the capital, the Syrian defense ministry said according to the Syrian Arab News Agency.\nFollowing this development, US media reported that Israel had carried out overnight airstrikes against Israel after which Iran fired air defense batteries and shut down flight operations in several cities including Tehran, Shiraz and Isfahan that was later lifted.\nThere was no official confirmation by Israeli authorities on the reported reprisal strike.\nMeanwhile, The US Department of Defence said that a drone strike in the year 2023 in Syria, initially said to have successfully targeted an al-Qaeda leader, actually killed a farmer, Washington Post reported from the summary of an internal investigation done by the Pentagon released on Thursday (US local time).", "location": "Damascus", "classification": "security", "score": 0.7803895401213266, "event_breakdown": "- Syrian defense ministry claims eight soldiers injured in Israeli airstrike near Damascus\n- Israeli warplanes launch missiles from Golan Heights at site near capital according to Syrian defense ministry\n- Israel reportedly carries out overnight airstrikes against Syria\n- Iran fires air defense batteries and shuts down flight operations in several cities\n- US media reports on Israeli reprisal strike without official confirmation\n- Pentagon investigation reveals drone strike in Syria targeted farmer instead of al-Qaeda leader"}, {"id": "7e40bcb9-2115-45c5-9e5a-affae0767b96", "title": "Explosions rock Kharkiv as Russia strikes it with guided aerial bombs , one person reported dead", "date": "2024-05-03 17:15", "url": "https://www.yahoo.com/news/explosions-rock-kharkiv-russia-strikes-153600684.html", "message": "Russian forces attacked the Kholodnohirsky district of Kharkiv with guided bombs, leaving one woman dead, two people wounded, while someone may still be under debris, Kharkiv regional governor Oleh Synehubov wrote on Telegram on May 3.\nRead also: Russian bombs hit Kharkiv residential areaSynehubov added that strike caused a fire in a private house.\nRead also: At least one dead, seven injured as Russia attacks Kharkiv with guided aerial bombsHe later said that private sector of Kharkiv was hit, several buildings were destroyed, and people are trapped under rubble.\nUkrainian Air Force also warned about Russian guided aerial bombs in Kharkiv Oblast.\nRussian strikes on Kharkiv and Kharkiv OblastRecently, strikes on Kharkiv and the oblast has become more frequent.", "location": "Kharkiv", "classification": "security", "score": 0.9109406324121285, "event_breakdown": "null"}]