[{"id": "48bfecb4-20a0-4e25-8bbc-dd42d0b68d5b", "title": "Global Terror Threat Has Skyrocketed Due to Oct . 7 Hamas Attack , Gaza War , Experts Warn", "date": "2024-05-08 00:45", "url": "https://www.algemeiner.com/2024/05/07/global-terror-threat-has-skyrocketed-due-oct-7-hamas-attack-gaza-war-experts-warn/", "message": "The threat of terrorist attacks in the West has escalated in the wake of the Hamas terror group’s Oct. 7 massacre across southern Israel and amid the ensuing war in Gaza, according to experts who spoke with The Algemeiner.\nTerrorist groups are using Israel’s war against Hamas to encourage more attacks against the US, Guillot argued.\nExperts also noted the threat posed by Iran, which the US government has consistently deemed the world’s foremost state sponsor of terrorism.\n“The ongoing and primary terrorist threat is from the Iranian regime and its proxies,” said Marshall Wittman, a spokesperson for the American Israel Public Affairs Committee (AIPAC).\nMost of the outrages occurred after Oct. 7, during the ensuing Israel-Hamas war in Gaza.", "location": "southern Israel", "classification": "security", "score": 0.5368598524327733, "event_breakdown": "- Oct. 7: Hamas terror group's massacre across southern Israel\n- Ensuing war in Gaza\n- Threat of terrorist attacks in the West escalates\n- Terrorist groups using Israel's war against Hamas to encourage attacks against the US\n- Threat posed by Iran as the world's foremost state sponsor of terrorism\n- Most outrages occurred after Oct. 7 during the Israel-Hamas war in Gaza"}, {"id": "b65a9f4b-5a15-4808-bcb2-a52a386f97a1", "title": "Australia : Police shoot dead 16 - year - old accused of extremist stabbing", "date": "2024-05-08 07:00", "url": "https://www.wsws.org/en/articles/2024/05/08/zdli-m08.html", "message": "Police who attended claim that when they arrived the boy refused to put down the knife, instead running towards them.\nBlanch proclaimed that the stabbing “certainly has all the hallmarks” of being a terrorism-related incident.\nThere has been no explanation as to why a purported terror attack would be staged in a quiet suburban carpark.\nDetails about the victim of the stabbing have not been made public, but it appears likely the unfortunate target was chosen at random.\nOn April 22, a 16-year-old boy stabbed an Assyrian bishop at a Church in the southwestern Sydney suburb of Wakeley.", "location": "Wakeley", "classification": "security", "score": 0.8793809481606457, "event_breakdown": "1. Stabbing incident involving a 16-year-old boy and an Assyrian bishop at a church in Wakeley, southwestern Sydney.\n2. Police report that upon arrival, the boy refused to put down the knife and ran towards them.\n3. Blanch suggests the stabbing may be terrorism-related.\n4. No explanation provided for why a purported terror attack would occur in a quiet suburban carpark.\n5. Victim's details not disclosed, but it seems the target was chosen at random."}, {"id": "bac07a7f-e333-4304-8a55-83645ea0b56d", "title": "US halts bomb shipments to Israel amid concerns of full - scale Rafah invasion as Biden rift with Netanyahu deepens", "date": "2024-05-08 06:15", "url": "https://www.dailymail.co.uk/news/article-13394521/US-halts-bomb-shipments-Israel-amid-concerns-scale-Rafah-invasion-Bidens-rift-Netanyahu-escalates.html", "message": "The US paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah.\nThe U.S. has historically provided enormous amounts of military aid for Israel.\nA decision against Israel would further add to pressure on Biden to curb the flow of weapons and money to Israel´s military.\nThe package included more than $14 billion in military aid for Israel, though the stalled transfer was not related to that measure.\nIsrael, by contrast, has used the bomb frequently in the seven-month Gaza war.", "location": "Rafah", "classification": "security", "score": 0.5473426539230661, "event_breakdown": "1. The US paused a shipment of bombs to Israel over concerns of an impending assault on Rafah.\n2. The US has historically provided significant military aid to Israel.\n3. A decision against Israel would increase pressure on Biden to restrict the flow of weapons and funds to the Israeli military.\n4. The stalled transfer of bombs was not related to the $14 billion in military aid package for Israel.\n5. Israel has frequently utilized bombs during the seven-month Gaza war."}, {"id": "49786c1a-f9d5-4d2a-ad82-1981d6348d02", "title": "Conservative Principles , Political Reality , and the War on Terrorism", "date": "2024-05-08 05:00", "url": "https://www.heritage.org/homeland-security/report/conservative-principles-political-reality-and-the-war-terrorism", "message": "And when the Taliban government there refused, the United States and its allies attacked.\nExplained in military terms, this was one campaign in the global war on terrorism.\nThis is essentially the position in which the United States found itself with Iraq.\nRemember that the head of the United Nations Disarmament Organization would have been Saddam Hussein's Iraq, and the head of the United Nations Commission on Human Rights is Libya.\nI doubt very much that, left to their own devices, our military war planners would have opted for the force configuration and flow that they used.", "location": "IraqHello! What can I do for you today?", "classification": "security", "score": 0.8345013294665995, "event_breakdown": "- The United States and its allies attacked the Taliban government in Afghanistan\n- The United States found itself in a position with Iraq\n- Saddam Hussein's Iraq was the head of the United Nations Disarmament Organization\n- Libya was the head of the United Nations Commission on Human Rights"}, {"id": "7993e23a-def6-4a70-ac42-2ef8ef4361c4", "title": "HRW declares Israeli attack on Lebanon rescuers  unlawful  - Newspaper", "date": "2024-05-08 07:45", "url": "https://www.dawn.com/news/1832135/hrw-declares-israeli-attack-on-lebanon-rescuers-unlawful", "message": "BEIRUT: Human Rights Watch said on Tuesday an Israeli strike in Lebanon that killed seven first responders was “an unlawful attack on civilians”, and urged Washington to suspend weapons sales to Israel.\n“An Israeli strike on an emergency and relief centre” in the southern village of Habariyeh on March 27 “killed seven emergency and relief volunteers” and constituted an “unlawful attack on civilians that failed to take all necessary precautions”, HRW said in a statement.\nThe Israeli military did not immediately comment when contacted.\n“Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,” HRW’s Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to “immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully”.", "location": "Habariyeh", "classification": "security", "score": 0.871043794071978, "event_breakdown": "- Israeli strike in Lebanon kills seven first responders in the village of Habariyeh on March 27\n- Human Rights Watch labels the strike as an \"unlawful attack on civilians\" and calls for the suspension of weapons sales to Israel\n- HRW accuses Israeli forces of using a US weapon to conduct the strike\n- HRW urges the United States to immediately suspend arms sales and military assistance to Israel"}, {"id": "e3df5648-dac6-4c4b-a8b4-e6098d6287dd", "title": "Zelensky Assassination Plot : Ukraine Thwarts Alleged Russia - Backed Attempt", "date": "2024-05-08 01:00", "url": "https://foreignpolicy.com/2024/05/07/zelensky-assassination-plot-attempt-putin-russia-gordon-black-soldier/?tpcc=recirc_trending062921", "message": "Failed Hit on ZelenskyKyiv foiled what it said was a Russian-coordinated plot to assassinate senior Ukrainian officials, including President Volodymyr Zelensky, Ukraine’s security service announced on Tuesday.\nFederal authorities arrested two Ukrainian security officials on suspicion of treason, which carries a life sentence, and of preparing a terrorist act.\nRussian President Vladimir Putin provided no immediate response to the allegation.\nUkrainian officials said the suspects planned to kill Budanov before Orthodox Easter, which fell on May 5 this year, by providing information on his whereabouts to target him in a rocket and drone strike.\nKyiv usually remains tight-lipped about assassination attempts against senior officials, of which there have been several since Russia’s war against Ukraine began.", "location": "Kyiv", "classification": "security", "score": 0.5304352600824518, "event_breakdown": "1. Foiled plot to assassinate senior Ukrainian officials, including President Volodymyr Zelensky, announced by Ukraine's security service in Kyiv.\n2. Arrest of two Ukrainian security officials on suspicion of treason and preparing a terrorist act in connection with the foiled assassination plot.\n3. Allegations made by Ukrainian officials that the suspects planned to target President Zelensky with a rocket and drone strike before Orthodox Easter, with Budanov also potentially targeted.\n4. Lack of immediate response from Russian President Vladimir Putin regarding the allegation.\n5. Mention of previous assassination attempts against senior Ukrainian officials since the beginning of Russia's war against Ukraine."}, {"id": "4b8f8bc9-e0ba-40ef-95ea-148b7eed2bee", "title": "Sette morti e diversi feriti in un raid di Israele su Gaza", "date": "2024-05-08 03:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/sette-morti-e-diversi-feriti-in-un-raid-di-israele-su-gaza-khqfngug", "message": "GAZA, 08 MAG - Almeno sette persone sono rimaste uccise e diverse altre ferite oggi in un attacco aereo israeliano sulla città di Gaza, rende noto l'ospedale al-Ahli.\nL'agenzia di stampa palestinese Wafa afferma che il raid ha colpito un edificio residenziale nel quartiere orientale di Zeitoun.\nLe vittime apparterrebbero tutte alla stessa famiglia e tra loro ci sarebbero anche alcuni bambini, aggiunge la Wafa.\nIl bilancio dal 7 ottobre scorso nella Striscia di Gaza è di almeno 34.789 morti e 78.204 feriti, secondo il ministero della Sanità locale gestito da Hamas.", "location": "Gaza", "classification": "security", "score": 0.9531312870958195, "event_breakdown": ""}, {"id": "e4a16425-e2a3-423f-b8e4-e72b8175d64e", "title": "Immigrants , crime , crime rate , terrorism , order security | Homeland Security Newswire", "date": "2024-05-08 03:15", "url": "https://www.homelandsecuritynewswire.com/dr20240507-the-manufactured-crisis-of-migrant-terrorists-at-the-border", "message": "Reports that illegal border crossers who are on the terrorist watch list have been apprehended seem to validate these fears.\nSince late 2020, Border Patrol has encountered 357 foreigners on the terrorist watch list attempting to cross the southwest border illegally.\nBut being on the watch list does not necessarily indicate an intent to commit terrorism on U.S. soil—which is what the public actually cares about.\nAlmost 98 percent of all victims of foreign‐born terrorists were murdered in the 9/11 terror attacks—the deadliest in world history.\nThis is not to trivialize the threat posed by foreign‐born terrorists to the lives, liberty, and private property of Americans.", "location": "", "classification": "security", "score": 0.772474593067622, "event_breakdown": "1. Reports of illegal border crossers on the terrorist watch list being apprehended.\n2. Border Patrol encountering 357 foreigners on the terrorist watch list attempting to cross the southwest border illegally.\n3. The public's concern about potential terrorism on U.S. soil.\n4. The majority of victims of foreign-born terrorists being killed in the 9/11 terror attacks.\n5. Acknowledgment of the threat posed by foreign-born terrorists to Americans' lives, liberty, and private property."}, {"id": "25457eb7-e489-439c-a51b-08a3bac80fb2", "title": "Ukraine War , Day 805 : Russia Plot to Assassinate Zelenskiy", "date": "2024-05-08 09:30", "url": "https://eaworldview.com/2024/05/ukraine-russia-plot-to-assassinate-zelenskiy/", "message": "On Remembrance and Victory over Nazism in World War II Day, Nazi Putin launched a massive missile attack on Ukraine.\nFirst responders dealing with the aftermath of a Russian attack on the Kyiv region:shows rescuers eliminating the consequences of Russia's night missile attack in Kyiv Oblast.\nLocal officials reported the Russian attack on 8 May injured 2 people in Kyiv Oblast and, an 8-year-old child in Kirovograd Oblast.\nLast month Polish and Ukrainian prosecutors announced the detention of a man suspected of aiding a Russian scheme to kill Zelenskiy.\nIn August 2023, the SBU said a woman had been arrested for trying to uncover details of Zelenskiy’s movements outside Kyiv.", "location": "Kyiv", "classification": "security", "score": 0.6462859063115821, "event_breakdown": "- On Remembrance and Victory over Nazism in World War II Day, Nazi Putin launched a massive missile attack on Ukraine.\n- First responders dealing with the aftermath of a Russian attack on the Kyiv region: shows rescuers eliminating the consequences of Russia's night missile attack in Kyiv Oblast.\n- Local officials reported the Russian attack on 8 May injured 2 people in Kyiv Oblast and, an 8-year-old child in Kirovograd Oblast.\n- Last month Polish and Ukrainian prosecutors announced the detention of a man suspected of aiding a Russian scheme to kill Zelenskiy.\n- In August 2023, the SBU said a woman had been arrested for trying to uncover details of Zelenskiy’s movements outside Kyiv."}]