[{"id": "", "title": "Israeli tanks reach center of Rafah in fight against Hamas | Nation and World", "date": "2024-05-29 05:15", "url": "https://www.reviewjournal.com/news/nation-and-world/probe-of-israeli-airstrike-looking-into-secondary-explosion-3058200/", "message": "Arms stored by Hamas might have contributed to toll in Israeli airstrike, Israeli military spokesman says.\n(AP Photo/Leo Correa)An Israeli Apache helicopter fires a missile towards the Gaza Strip, as seen from southern Israel, Tuesday, May 28, 2024.\nAn Israeli military official said tanks were being used as part of what he called a limited and precise set of operations.\nOn Tuesday, another Israeli strike on Rafah killed 20 Palestinians, Gaza’s civil defense service reported.\nThe fighting in Rafah has made it difficult for humanitarian groups to import and distribute aid to southern Gaza.", "location": "GAZA STRIP", "classification": "security", "score": 0.9094106831879415, "event_breakdown": "Events in the Text:\n- Israeli military using tanks in Rafah, southern Gaza\n- Israeli airstrike on Rafah\n- Israeli strike kills 20 Palestinians in Rafah"}, {"id": "", "title": "US condemns deadly Israeli airstrike in Rafah – NBC New York", "date": "2024-05-29 01:00", "url": "https://www.nbcnewyork.com/news/national-international/us-condemns-israel-airstrike-rafah-amid-military-operation-against-hamas/5454747/", "message": "The White House on Tuesday condemned the loss of life of dozens of civilians as a result of an Israeli airstrike in Rafah, but said it is not planning any policy changes as a result of the Israeli actions.\n“Everything that we can see tells us that they are not moving into a major ground operation in population centers in the center of Rafah,\" Kirby said.\n“We understand that this strike did kill two senior Hamas heads who are directly responsible for attacks,” Kirby said.\nThe U.S. had urged Israel not to replicate those earlier attacks in Rafah, given the vulnerable civilians crowded there.\nSingh said the U.S. has not paused shipments to Israel in the wake of the strike.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.4225016140195557, "event_breakdown": "- Israeli airstrike in Rafah kills dozens of civilians\n- The White House condemns the loss of life but says it is not planning any policy changes as a result of the Israeli actions.\n- The U.S. urges Israel not to replicate the attacks in Rafah, given the vulnerable civilians.\n- The strike did kill two senior Hamas heads who are directly responsible for attacks.\n- The U.S. has not paused shipments to Israel in the wake of the strike."}, {"id": "", "title": "IDF :  Small  Munitions Used in Deadly Rafah Strike Could Not Have Caused Such Devastation by Themselves", "date": "2024-05-29 10:30", "url": "https://redstate.com/bobhoge/2024/05/29/idf-munitions-used-in-deadly-rafah-strike-could-not-have-caused-such-devastation-by-themselves-n2174789", "message": "Amid world outcry against an Israeli airstrike that took out two Hamas terrorist leaders but also reportedly killed dozens of Palestinian civilians, Israel Defense Forces said Tuesday that the “small munitions” used in the attack simply could not have caused the fire that caused such devastation.\nThe targeted strike in Rafah, 1.7 km from the humanitarian area, used precise munitions carrying 34kg of explosives to eliminate 2 senior Hamas terrorists.\nLast night, the @IAFsite carried out an intelligence-based precise strike that targeted senior Hamas terrorists in Tal as Sultan.\nContrary to Hamas' lies and misinformation, the strike did not take place in the Al-Mawasi Humanitarian Area.\nThis is the area where the strike… pic.twitter.com/IiyOdnQfx9 — Israel Defense Forces (@IDF) May 27, 2024The international outcry has been intense, with numerous countries and leaders calling on Israel to end their prosecution of the war.", "location": "GAZA", "classification": "security", "score": 0.9490783767972192, "event_breakdown": "Israeli airstrike took out two Hamas terrorist leaders but also killed dozens of Palestinian civilians, IDF said the strike didn't take place at Al-Mawasi Humanitarian Area, IDF used precise munitions carrying 34kg of explosives to eliminate 2 senior Hamas terrorists, IDF carried out an intelligence-based precise strike that targeted senior Hamas terrorists in Tal as Sultan."}, {"id": "", "title": "White House insists Israel airstrike on Rafah did NOT cross a  red line  despite killing dozens of civilians and there is still  no major ground operation  ", "date": "2024-05-29 00:00", "url": "https://www.dailymail.co.uk/news/article-13469463/white-house-israel-airstrike-rafah-did-not-cross-red-line.html", "message": "The White House on Tuesday defended U.S. ally Israel's response to the airstrike that killed dozens of civilians in Gaza, even comparing the tragic error to U.S. strikes in Iraq and Afghanistan.\n'We have conducted airstrikes in places like Iraq and Afghanistan where, tragically, we caused civilian casualties,' White House national security spokesman John Kirby told reporters at the White House.\n'Everything that we can see tells us that they are not moving into a major ground operation in population centers in the center of Rafah,' Kirby said.\nAnd Qatar, a key mediator in attempts to secure a cease-fire and the release of hostages held by Hamas, said the Rafah strike could 'complicate' talks.\nThe U.S. had urged Israel not to replicate those earlier attacks in Rafah, given the vulnerable civilians crowded there.", "location": "GAZA", "classification": "security", "score": 0.6302806881456088, "event_breakdown": "Security events:\n- an Israeli airstrike in Rafah, Gaza, kills dozens of Palestinian civilians.\n- The United States compares the strike to the civilian casualties it caused in Iraq and Afghanistan.\n- The Qatar Ministry of Foreign Affairs says the strike could 'complicate' talks with Israel.\n- The U.S. urged Israel not to replicate earlier attacks in Rafah, given the crowded population."}, {"id": "", "title": "Ukraine : Russia Odesa Cluster Munition Attack Harms Civilians", "date": "2024-05-29 04:30", "url": "https://www.hrw.org/news/2024/05/29/ukraine-russias-odesa-cluster-munition-attack-harms-civilians", "message": "Click to expand Image Odesa Legal Academy in flames after a Russian cluster munition attack, April 29, 2024.\nThe cluster munition attacks began in Vuhledar, followed by subsequent attacks in Kharkiv, Mykolaiv, Chernihiv, Kherson, and other cities.\nThe Russian cluster munition attack on the crowded Kramatorsk train station on April 8, 2022, remains one of the single deadliest incidents for civilians during the war.\n“The deaths and injuries to civilians in Odesa from cluster munitions sadly won’t be the last time civilians are harmed by these weapons,” Wille said.\n“Concerted international pressure is needed not only to end cluster munition use in Ukraine but throughout the world.”", "location": "ODESSA", "classification": "security", "score": 0.8092236332589072, "event_breakdown": "1. Russian cluster munition attacks began in Vuhledar, followed by subsequent attacks in Kharkiv, Mykolaiv, Chernihiv, Kherson, and other cities.\n2. The Russian cluster munition attack on the crowded Kramatorsk train station on April 8, 2022, remains one of the single deadliest incidents for civilians during the war.\n3. The deaths and injuries to civilians in Odesa from cluster munitions sadly won't be the last time civilians are harmed by these weapons.\n4. Concerted international pressure is needed not only to end cluster munition use in Ukraine but throughout the world."}, {"id": "", "title": "  No policy change : Israel attack on Rafah tent camp does not cross red line , says US", "date": "2024-05-29 08:00", "url": "https://www.firstpost.com/world/israel-hamas-war-rafah-tent-camp-attack-us-13776381.html", "message": "ReutersIsraeli strike on an encampment in Rafah seems to have made no impact on US arms shipment to the warring country as Washington says that Israel “did not cross any red lines” by carrying out the attack.\nMeanwhile, Israel’s military is trying to pin the blame on Hamas by trying to investigate reports that a strike it carried out against commanders of the Islamist terrorist group in Rafah had caused the fire.\nWhen asked if the latest deadly strike would prompt US to withdraw its military shipment to Israel, Kirby said, “I believe that’s what I’ve been saying here.\nOn Tuesday, Israel’s military denied striking a tent camp west of Rafah after Gaza health authorities said Israeli tank shelling had killed at least 21 people there, in an area Israel has designated a civilian evacuation zone.\nAdvertisementWith inputs from agencies", "location": "GAZA", "classification": "security", "score": 0.633566919249127, "event_breakdown": "* Israeli strike on civilian encampment in Rafah, 21 killed. * Israel did not cross any red lines by carrying out the attack. * Israel’s military is trying to investigate reports that a strike it carried out against commanders of the Islamic terrorist group in Rafah had caused the fire. * Israel’s military denies striking tent camp in Rafah after Gaza health authorities says Israeli tank shelling killed 21 INstaed.\n* US not withdrawing its military shipment to Israel due to the event."}, {"id": "", "title": "US - made bombs reportedly used in strike on Rafah refugee camp that killed 45", "date": "2024-05-29 09:15", "url": "https://www.mirror.co.uk/news/world-news/made-bombs-reportedly-used-strike-32913296", "message": "They say that the site is close to an area used to launch rockets and the Israeli strike may have ignited Hamas munitions.\nThe strike or the subsequent fire could also have ignited fuel, cooking gas canisters or other materials in the camp.\nImage: AFP via Getty Images) AFP via Getty Images)He said: “The warhead portion [of the bomb] is distinct, and the guidance and wing section is extremely unique compared to other munitions.\nImage: AFP via Getty Images) AFP via Getty Images)The strikes over the past few days have hit areas west of Rafah, where the military had not ordered civilians to evacuate.\nIsraeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.", "location": "GAZA CITY.", "classification": "security", "score": 0.9570055162879703, "event_breakdown": "It is reported that the site is close to an area used to launch rockets and the site was struck in an Israeli strike that may have ignited Hamas munitions and caused a fire. The strike occurred in an area west of Rafah where Israeli tanks had been operating."}, {"id": "", "title": "Russia Belgorod Oblast came under drone and missile attack overnight", "date": "2024-05-29 10:30", "url": "https://www.yahoo.com/news/russias-belgorod-oblast-came-under-093100613.html", "message": "Russia's Belgorod Oblast came under drone and missile attack overnightFacilities in Russia's Belgorod Oblast came under attack overnight by aircraft-type drones and Grad multiple rocket launchers, Russia's Defense Ministry claimed.\nRussian air defense systems intercepted and destroyed one drone and seven Grad rockets, the ministry claimed.\nRead also: Two Russian aerial bombs strike Belgorod Oblast in single day – Local mediaA drone strike caused windows to be shattered in a house in the town of Grayvoron, Belgorod Oblast governor, Vyacheslav Gladkov, stated.\nRead also: Fire damage can be seen in satellite image of Russian radar hit in drone attack 1,800 km from Ukraine's borderThere were no reported casualties, he claimed.\nRead also: Possible attack on Taganrog’s aircraft repair plant: Fires and satellite evidenceWe’re bringing the voice of Ukraine to the world.", "location": "Belgorod Oblast", "classification": "security", "score": 0.9496146065666385, "event_breakdown": "1. A drone strike on Belgorod Oblast in Russia caused windows to be shattered in a house.\n2. Russia's Defense Ministry reported an aircraft-type drone and Grad multiple rocket launcher attack.\n3. Russia's Defense Ministry said one drone and seven rockets were intercepted and destroyed.\n4. Russian officials reported no reported casualties."}, {"id": "", "title": "Hamas munitions likely caused fire in Rafah DP camp , says Israel", "date": "2024-05-29 05:00", "url": "https://news.webindia123.com/news/Articles/World/20240529/4201405.html", "message": "Tel Aviv [Israel], May 29 (ANI/TPS): A fire at a displaced persons camp in Rafah following an airstrike was likely caused by Hamas munitions, according to a preliminary military investigation, the Israel Defense Forces said on Tuesday.\nThe Sunday night airstrike killed Hamas commanders Yassin Rabia and Khaled Nagar in a compound in the Rafah neighborhood of Tel Sultan.\nThe military believes the fire was likely caused by secondary explosions from Hamas munitions or some other material it was not aware of.\nThe IDF also released a recording of two Rafah residents specifically saying the fire was caused by Hamas explosives.\nIsrael took control of the Palestinian side of the Rafah border crossing on May 7 to prevent Hamas from commandeering humanitarian aid deliveries from Egypt.", "location": "RAFAH", "classification": "security", "score": 0.9717301907941998, "event_breakdown": "1. Airstrike in Rafah\n2. Fire at a displaced persons camp in Rafah\n3. Military investigation by Israel claim the fire could have been caused by secondary explosions from Hamas munitions."}, {"id": "", "title": "Hamas munitions likely caused fire in Rafah DP camp , says Israel", "date": "2024-05-29 07:30", "url": "https://www.devdiscourse.com/article/international/2953600-hamas-munitions-likely-caused-fire-in-rafah-dp-camp-says-israel", "message": "Tel Aviv [Israel], May 29 (ANI/TPS): A fire at a displaced persons camp in Rafah following an airstrike was likely caused by Hamas munitions, according to a preliminary military investigation, the Israel Defense Forces said on Tuesday.\nThe Sunday night airstrike killed Hamas commanders Yassin Rabia and Khaled Nagar in a compound in the Rafah neighborhood of Tel Sultan.\nThe military believes the fire was likely caused by secondary explosions from Hamas munitions or some other material it was not aware of.\n\"We have a suspicion, following intelligence surveillance and analysis of the videos from the event that were distributed on social networks, that secondary explosions at the site were caused by Hamas ammunition storage.\nThe IDF also released a recording of two Rafah residents specifically saying the fire was caused by Hamas explosives.", "location": "GAZA", "classification": "security", "score": 0.9597792214019161, "event_breakdown": "* An airstrike kills two Hamas commanders in Rafah, Tel Sultan\n* A fire at a displaced persons camp in Rafah following the airstrike\n* The military believes the fire was likely due to Hamas munitions"}, {"id": "", "title": "Israel Says Hamas Weapons Stored Near Rafah Camp Led To Deadly Fire", "date": "2024-05-29 03:45", "url": "https://www.ndtv.com/world-news/israel-blames-unforeseen-circumstances-for-deadly-attack-on-rafah-camp-5767748", "message": "The attack resulted in the deaths of at least 45 Palestinians.\nThe IDF accused the two Hamas officials of \"orchestrating and executing terror attacks against Israelis\".\nHagari released video and photos of the targeted structure, pointing out that \"no tents\" were nearby and that the entire area had been evacuated in advance.\nThe Palestinian official news agency WAFA reported that an Israeli airstrike targeted on Sunday evening the tents in a newly established camp for the displaced civilians in Rafah.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "location": "Based on the information provided, I cannot find a specific location for the main event.", "classification": "security", "score": 0.9582946749119902, "event_breakdown": "Events Listed from the text:\nIsraeli airstrike targeting a structure in Rafah\nIsraeli airstrike targeting tents in a newly established camp in Rafah"}, {"id": "", "title": "Civilian deaths in Rafah caused by unexpected secondary explosions , fire : Israeli army", "date": "2024-05-29 00:00", "url": "https://www.prokerala.com/news/articles/a1535053.html", "message": "Jerusalem, May 29 : The Israeli military has said its initial investigation findings indicated that it was unexpected secondary explosions and fire that caused dozens of civilian deaths in its airstrike on Rafah, southern Gaza Strip, on Sunday night.\nThe IDF accused the two Hamas officials of \"orchestrating and executing terror attacks against Israelis\".\nHagari said that \"due to unforeseen circumstances, a fire was tragically ignited, resulting in the loss of lives of nearby Gazan civilians\".\nHagari released video and photos of the targeted structure, pointing out that \"no tents\" were nearby and that the entire area had been evacuated in advance.\nThe Palestinian official news agency WAFA reported that an Israeli airstrike targeted on Sunday evening the tents in a newly established camp for the displaced civilians in Rafah.", "location": ".\nGaza", "classification": "security", "score": 0.9545833099485747, "event_breakdown": "1. Israeli airstrike on Rafah, southern Gaza Strip, on May 29, 2022.\n2. Israeli military investigation"}, {"id": "", "title": "Civilian deaths in Rafah caused by unexpected secondary explosions : Israeli army", "date": "2024-05-29 08:45", "url": "https://www.siasat.com/civilian-deaths-in-rafah-caused-by-unexpected-secondary-explosions-israeli-army-3034402/", "message": "Jerusalem: The Israeli military has said its initial investigation findings indicated that it was unexpected secondary explosions and fire that caused dozens of civilian deaths in its airstrike on Rafah, southern Gaza Strip, on Sunday night.\n“Despite our efforts to minimize civilian casualties during the strike, the fire that broke out was unexpected and unintended…Our investigation seeks to determine what may have caused such a large fire to ignite.“Watch the full statement by IDF Spokesperson RAdm.\nThe spokesman said the IDF has taken “all measures” in advance to prevent harm to civilians, as “the war is against Hamas, not the people of Gaza”.\nThe Palestinian official news agency WAFA reported that an Israeli airstrike targeted on Sunday evening the tents in a newly established camp for the displaced civilians in Rafah.\nThe attack, which resulted in the deaths of at least 45 Palestinians and injuries to numerous others, has sparked severe criticism from regional countries and the international community.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.9620565853618129, "event_breakdown": "1. Israeli military says it unintentionally caused a large number of civilian deaths. \n2. There were secondary explosions in an Israeli airstrike on a newly established camp in Rafah in southern Gaza."}, {"id": "", "title": "Chicago police fatally shoot stabbing suspect , wound the person he was trying to stab", "date": "2024-05-29 03:00", "url": "https://pantagraph.com/news/state-regional/crime-courts/chicago-police-fatally-shoot-stabbing-suspect-wound-the-person-he-was-trying-to-stab/article_b4cc17da-1d33-11ef-b98d-ebb2ff2df884.html", "message": "CHICAGO — Chicago police fatally shot a stabbing suspect and wounded the person he was trying to stab after the suspect refused to drop his weapon, police said.\nOfficers were patrolling the city's west side about 11 p.m. Monday when they saw a male attempting to stab a male in the street and ordered the suspect to drop his weapon, police said.\nWhen the suspect continued the attack, officers opened fire, wounding both the suspect and the victim, the Chicago Police Department said in a statement Tuesday morning.\nThe suspect was later pronounced dead at a hospital, and the other person was hospitalized in critical condition, police said.\nThe shooting occurred near the border of the Harrison and Austin police districts, two of Chicago's most violent districts, the Chicago Sun-Times reported.", "location": "CHICAGO", "classification": "security", "score": 0.9687674134016686, "event_breakdown": ".\n- A male attempting to stab a male in the street\n- Male suspect refusing to drop his weapon after police order\n- Police officers shooting both the person being stabbed and the suspect\n- Suspect being pronounced dead at the hospital\n- The other person suffering critical injuries."}, {"id": "", "title": "Reports : U . N . Security Council Prepares for Another Resolution Demanding Israel Stop Fighting Hamas", "date": "2024-05-29 04:00", "url": "https://www.breitbart.com/middle-east/2024/05/28/reports-u-n-security-council-prepares-another-resolution-demanding-israel-stop-fighting-hamas/", "message": "Multiple reports on Tuesday indicated that representatives from Algeria had prepared a draft resolution for the United Nations Security Council that would demand Israel stop its self-defense operations against the terrorist group Hamas in Gaza.\nAlgeria called the U.N. Security Council meeting on Tuesday and reportedly prepared a resolution calling for an immediate end to operations in Rafah.\nIf passed, the proposed U.N. resolution would be the second time the Security Council calls for a ceasefire in Gaza.\nThe IDF began its operations in northern Gaza and has since pulled into Rafah, the Gaza Strip’s southernmost city, which borders Egypt.\nThe airstrike prompting the proposed resolution this week reportedly killed two senior members of the Hamas “Judea and Samaria” wing, Khaled Nagar and Yassin Rabia.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.7700275184412257, "event_breakdown": "1. Representatives from Algeria prepared a draft resolution for the United Nations Security Council demanding Israel stop its self-defense operations against the terrorist group Hamas in Gaza.\n2. Algeria called the U.N. Security Council meeting on Tuesday and reportedly prepared a resolution for the U.N. demanding an immediate end to operations in Rafah.\n3. If passed, the proposed U.N. resolution would be the second time the Security Council calls for a ceasefire in Gaza.\n4. The IDF began its operations in northern Gaza and has since pulled into Rafah, the Gaza Strip’s southernmost city, which borders Egypt.\n5. The airstrike prompting the proposed resolution this week reportedly killed two senior members of the Hamas “Judea and Samaria” wing, Khaled Nagar and Yassin Rabia."}, {"id": "", "title": "Israeli airstrike that killed dozens in Rafah carried out using type of bomb supplied by US", "date": "2024-05-29 03:30", "url": "https://www.coastfm.co.uk/news/world/israeli-airstrike-that-killed-dozens-in-rafah", "message": "Israeli airstrike that killed dozens in Rafah carried out using type of bomb supplied by USOn the night of 26 May, an Israeli airstrike hit the neighbourhood of Tel al Sultan in Rafah.\nGeolocated footage and satellite imagery shows the strike destroyed buildings immediately adjacent to a sign identifying Kuwaiti Al-Salam Camp 1.\nThe footage ultimately verified by Sky News shows numerous bodies being pulled from the wreckage of destroyed buildings.\nSatellite imagery captured by Planet Labs PBC on 27 May shows four buildings were destroyed in this strike.\nThe area targeted lies between these two zones, in the neighbourhood numbered by the Israeli government as 2372.", "location": "The airstrike took place in Rafah, a city in northeastern Egypt near the border with Israel.", "classification": "security", "score": 0.9856246288243032, "event_breakdown": "1. Israeli airstrike hit the neighbourhood of Tel al Sultan in Rafah during the night of 26 May.\n2. Geolocated footage shows buildings destroyed by the strike which is verified by Sky News.\n3. Satellite imagery captured four buildings were destroyed.\n4. The area targeted lies between two zones.\n5. This area was numbered by the Israeli government as 2372."}, {"id": "", "title": "Israeli tanks roll into centre of Rafah for the first time", "date": "2024-05-29 00:45", "url": "https://www.dailymail.co.uk/news/article-13469625/Israeli-tanks-centre-Rafah-killed-shelling-tent-camps-following-Sundays-refugee-zone-airstrike-global-outrage.html", "message": "The latest military action comes amid growing international pressure for Israel to justify its military operation in Rafah following the refugee airstrike.\nIsrael's Defence Forces (IDF) yesterday declared they had launched a 'precise strike' on a Hamas compound and killed two high-ranking Hamas officials.\nThe court also reiterated calls for the immediate and unconditional release of hostages held in Gaza by Hamas.\n'Hamas launched these rockets from near two mosques in Rafah,' Israeli military spokesman Rear Admiral Daniel Hagari said.\nHamas triggered the war with its October 7 attack into Israel, in which Palestinian militants killed some 1,200 people, mostly civilians.", "location": "GAZA", "classification": "security", "score": 0.973101779734509, "event_breakdown": "Hamas triggered the war with its October 7 attack into Israel\nIsraeli military spokesman Rear Admiral Daniel Hagari said Hamas launched these rockets from near two mosques in Rafah"}, {"id": "", "title": "Rafah , Israel - Gaza : Charred Bodies , Children Screaming : Rafah Refugee Camp Recounts Horror", "date": "2024-05-29 03:45", "url": "https://www.ndtv.com/world-news/rafah-israel-gaza-saw-charred-bodies-victims-recount-rafah-camp-horror-after-israel-strike-5768418", "message": "The Rafah refugee camp in Gaza witnessed scenes of horror and devastation in the wake of an Israeli airstrike on Sunday.\nGaza's civil defence agency reported that the death count had risen to 45 from the overnight strikes, which ignited tents and sparked widespread condemnation across the globe.\nThe agency described the aftermath as a \"massacre,\" with many bodies charred beyond recognition and numerous victims suffering severe injuries.\nBy morning, the charred remains of tents and vehicles were all that was left of the refugee camp in Rafah known as the Kuwaiti Al-Salam Camp 1.\nThe conflict, the deadliest in Gaza's history, began with a deadly attack by Hamas on southern Israel on October 7, resulting in 1,189 Israeli deaths and 252 hostages taken.", "location": "GAZA", "classification": "security", "score": 0.7505768578039805, "event_breakdown": "1. Deadly attack by Hamas on southern Israel, resulting in 1,189 Israeli deaths and 252 hostages taken\n2. Israeli airstrike on Rafah refugee camp in Gaza, resulting in widespread destruction and 45 deaths"}, {"id": "", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions", "date": "2024-05-29 12:00", "url": "https://www.wfmz.com/news/ap/ap-business/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite/article_cecf88c4-f17d-5c3c-bb1e-13106e58b7da.html", "message": "In this photo provided by the North Korean government, North Korean leader Kim Jong Un delivers a speech at the North’s Academy of Defense Sciences in North Korea, Tuesday, May 28, 2024.\nIndependent journalists were not given access to cover the event depicted in this image distributed by the North Korean government.\nThe content of this image is as provided and cannot be independently verified.\nKorean language watermark on image as provided by source reads: \"KCNA\" which is the abbreviation for Korean Central News Agency.\n(Korean Central News Agency/Korea News Service via AP)", "location": "NORTH KOREA", "classification": "security", "score": 0.6582060045832547, "event_breakdown": "[1] North Korean leader delivers a speech at the North's Academy of Defense Sciences.\n[2] Independent journalists were not given access to cover the event.\n[3] The content of the image cannot be independently verified."}, {"id": "", "title": "Ukraine Fires AIM - 9X Sidewinder Missiles from NASAMS", "date": "2024-05-29 12:00", "url": "https://theaviationist.com/2024/05/29/ukraine-fires-aim-9x-from-nasams/", "message": "Recently released footage shows an AIM-9X Sidewinder missile being fired from Ukrainian NASAMS fire unit.\nUkraine has begun using the AIM-9X Sidewinder AAM (Air-to-Air Missile) as a ground-launched AD (Air Defense) missile from the NASAMS (National Advanced Surface-to-Air Missile System), going by a promotional feature released by Ukraine recenlty.\n⚡🇺🇦💪🚀💥Ukraine has received the AIM-9X Sidewinder RVV for use with their NASAMS SAMs.\nThe AIM-9X is the latest version of the AIM-9 and confirms that Ukraine has received the most advanced NASAMS 3 SAMs.\nThis was then concluded to be a Russian strategy of allowing the tactical losses of its missiles for the larger strategic goal of depleting Ukraine’s Western missiles.", "location": "Kyiv", "classification": "security", "score": 0.41679699181367497, "event_breakdown": "Security Events extracted from the text:\n\n1. AIM-9X Sidewinder AAM fired by Ukraine NASAMS fire unit.\n2. Ukraine's beginning of using the AIM-9X Sidewinder as a ground-launched AD. \n3. Ukraine promotional feature for the AIM-9X Sidewinder AD missile recently shared."}, {"id": "", "title": "Oman reiterates condemnation of Israeli aggression", "date": "2024-05-29 09:00", "url": "https://www.omanobserver.om/article/1154376/oman/community/oman-reiterates-condemnation-of-israeli-aggression", "message": "Muscat: The Sultanate of Oman expressed its strong condemnation and denunciation of the continued Israeli aggression targeting the camps for displaced people in Rafah in the Gaza Strip.\nAFP journalists in Rafah reported new strikes early Wednesday, hours after witnesses and a Palestinian security source said Israeli tanks had penetrated the heart of the city.\n\"People are currently inside their homes because Israeli drones are shooting at anyone who moves,\" resident Abdel Khatib said.\n\"We have not seen them smash into Rafah,\" said the US National Security Council spokesman John Kirby.\nIsrael's army rejected allegations that it had carried out Tuesday's strike in a designated humanitarian area.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.914617107863098, "event_breakdown": "1. The Sultanate of Oman condemned Israel's ongoing aggression against displaced people camps in Rafah, Gaza Strip.\n2. AFP journalists reported new strikes in Rafah early Wednesday, hours after witnesses said Israeli tanks had entered the city.\n3. Resident Abdel Khatib said residents were staying inside due to drone attacks targeting people.\n4. The US National Security Council denied Israeli forces had targeted Rafah, but denied the claims.\n5. Israel's army denied Tuesday's strike in a humanitarian zone. 6. Israel and the Palestinians have been in conflict for some time."}, {"id": "", "title": "Unrepentant Israel kills 21 in strike on another camp - World", "date": "2024-05-29 05:30", "url": "https://www.dawn.com/news/1836352/unrepentant-israel-kills-21-in-strike-on-another-camp", "message": "RAFAH: Another str­ike on a camp for displa­ced Palestinians claimed 21 lives on Tuesday, tanks rolled through the centre of the southern Gaza city, which has been a refuge for those fleeing Israeli bombardment.\nIn Rafah, residents and a Palestinian security source said Israeli tanks had now penetrated the heart of the southern city.\nIn central Rafah, tanks and armoured vehicles mounted with machineguns were spotted near Al-Awda mosque, a city landmark, witnesses told Reuters.\nThe Israeli military said its forces continued to operate in the Rafah area, without commenting on reported advances into the city centre.\nAn Israeli military spokesperson had no immediate comment.", "location": "RAFAH", "classification": "security", "score": 0.9342469426950333, "event_breakdown": "Tank rolling through the centre of Rafah City, a city in southern Gaza. The Israeli army said it operates in Rafah and tanks and armored vehicles were in the center of the city and near Auda Mosque."}, {"id": "", "title": "Civil defence says 21 dead in new strike on Gaza camp that Israel denies", "date": "2024-05-29 03:15", "url": "http://jordantimes.com/news/region/civil-defence-says-21-dead-new-strike-%C2%A0gaza%C2%A0camp-israel-denies", "message": "Despite mounting concerns over the civilian toll of its war on Hamas, Israel has shown no signs of changing course and international efforts aimed at securing a ceasefire remain stalled.\nIn the latest bloodshed, Gaza civil defence agency official Mohammad Al Mughayyir said 21 people were killed in an \"occupation strike targeting the tents of displaced people\" in west Rafah.\nHamas said an Israeli strike on the area caused \"dozens of martyrs and wounded\".\nThe civilian death toll in the Gaza camp prompted a wave of condemnation, with Palestinians and many Arab countries calling it a “massacre”.\nThe United States said it was “deeply saddened” over Sunday’s Rafah strike and that it would follow Israel’s investigation closely.", "location": "GAZA", "classification": "security", "score": 0.8723875286298517, "event_breakdown": "Gaza: 21 killed in an \"occupation strike\" on the Tents of displaced people; 2 children killed on farmland near Rafah as an airstrike hit a nearby Hamas position.\nThe United States said it was \"deeply saddened\" and closely following Israel's investigation."}, {"id": "", "title": "Civil defence says 21 dead in new strike on Gaza camp that Israel denies", "date": "2024-05-29 00:45", "url": "https://thesun.my/world/civil-defence-says-21-dead-in-new-strike-on-gaza-camp-that-israel-denies-MG12505922", "message": "RAFAH, Palestinian Territories: A civil defence official in Hamas-run Gaza said an Israeli strike on a displacement camp west of Rafah on Tuesday killed at least 21 people, after a similar strike that sparked global outrage.\nIn the latest bloodshed, Gaza civil defence agency official Mohammad al-Mughayyir said 21 people were killed in an “occupation strike targeting the tents of displaced people” in west Rafah.\nHamas said an Israeli strike on the area caused “dozens of martyrs and wounded”.\nThe civilian death toll in the Gaza camp prompted a wave of condemnation, with Palestinians and many Arab countries calling it a “massacre”.\nThe United States said it was “deeply saddened” over Sunday’s Rafah strike and that it would follow Israel’s investigation closely.", "location": "RAFAH, Palestinian Territories", "classification": "security", "score": 0.7514463668642996, "event_breakdown": ".\nIsraeli strike on the Gaza Strip targeting a displacement camp caused a string of deadly events:\n- A civil defence official said an Israeli strike on Tuesday killed at least 21 people in an \"occupation strike targeting the tents of displaced people\" in west Rafah.\n- Hamas said an Israeli strike caused “dozens of martyrs and wounded”."}, {"id": "", "title": "Ukraine war : The children adapting to survive Russia invasion", "date": "2024-05-29 05:30", "url": "https://www.bbc.com/news/articles/c4nn0jdejw8o", "message": "Last summer a Russian missile attack shattered one of her legs, and left the other badly burned.\nClose to 2,000 children have been injured or killed in Ukraine since Vladimir Putin launched his full-scale invasion.\nNow in western Ukraine, Daniel keeps himself busy with wrestling classes and skateboardingBut the boy from the north east still struggles to fit in.\nBut it actually means there’s fighting somewhere else in Ukraine.” Daniel counts the hours between online calls with his dad.\nLike Lera and Daniel, Angelina is adapting to this war as best she can.", "location": "Ukraine", "classification": "security", "score": 0.5121274116564195, "event_breakdown": "Security events in the text:\n\n1. Russian military attack in Ukraine - Missile attack shattered Daniel's leg, left other leg badly burned.\n2. Russian full-scale invasion of Ukraine - Vladimir Putin is responsible for a large number of children (close to 2,000) injured or killed.\n3. Ongoing fighting in Ukraine - Daniel lives on the Western part of Ukraine and uses wrestling classes to keep himself busy. Also, young Daniel has a remarkably reference to online text-based interactions with his father, despite the fact he is still alive. \n4. Location uncertainty - Also mentioned is the fact that town to be visited might not be safe for Daniel, making the final decision to go here an open question."}, {"id": "", "title": "Dozens reported killed in Israeli strike on Rafah - The Ghanaian Chronicle", "date": "2024-05-29 11:15", "url": "https://thechronicle.com.gh/dozens-reported-killed-in-israeli-strike-on-rafah/", "message": "At least 45 people have been killed, including women and children, in an Israeli air strike on a camp for displaced Palestinians in the southern Gaza city of Rafah, the Hamas-run health ministry says.\nVideos from the scene in the Tal al-Sultan area on Sunday night showed a large explosion and intense fires burning.\nThe Israel Defense Forces (IDF) said it had killed two senior Hamas officials and that it was reviewing reports that civilians were harmed as a result of the strike and fire it ignited.\nHours earlier, Hamas had fired eight rockets from Rafah towards Tel Aviv – the first long-range attacks on the central Israeli city since January.\nThe Palestinian Red Crescent said Sunday’s air strike targeted tents for displaced people near a UN facility in Tal al-Sultan, about 2km (1.2 miles) north-west of the centre of Rafah.", "location": "GAZA", "classification": "security", "score": 0.9660886530957083, "event_breakdown": "* Israeli airstrike on Rafah camp for displaced Palestinians in southern Gaza city\n* Hamas fired 8 rockets from Rafah towards Tel Aviv earlier on Sunday"}, {"id": "", "title": "Missile attacks damage a ship in the Red Sea off Yemen near previous Houthi rebel assaults", "date": "2024-05-29 08:15", "url": "https://www.thehindu.com/news/international/missile-attacks-damage-a-ship-in-the-red-sea-off-yemen-near-previous-houthi-rebel-assaults/article68227622.ece", "message": "Missile attacks twice damaged a Marshall Islands-flagged, Greek-owned ship on May 28, in the Red Sea off the coast of Yemen, with a private security firm saying radio traffic suggested the vessel took on water after being struck.\nThe vessel reported being headed to Fujairah in the United Arab Emirates.\nCentral Command separately said it destroyed five Houthi drones over the Red Sea amid the attacks.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "The main location where the main event takes place is the Red Sea off the coast of Yemen.", "classification": "security", "score": 0.7743969604809979, "event_breakdown": "Events:\n1. Missile attacks hit a Marshall Islands-flagged, Greek-owned ship on May 28.\n2. The vessel reported taking on water after being struck in the Red Sea off the coast of Yemen.\n3. A private security firm suggested the vessel took on water after being struck in the Red Sea off the coast of Yemen.\n4. Central Command said it destroyed five Houthi drones over the Red Sea amid the attacks.\n5. Shipping through the Red Sea and Gulf of Aden has declined because of the threat.\n6. In recent weeks, the tempo of Houthi attacks has dropped.\n7. The Houthi have claimed shooting down U.S. surveillance drones in recent weeks."}, {"id": "", "title": "UN chief condemns Israeli massacre of 45 Palestinians , urged an end to this horror – Ya Libnan", "date": "2024-05-29 04:00", "url": "https://yalibnan.com/2024/05/29/un-chief-condemns-israeli-massacre-of-45-palestinians-urged-an-end-to-this-horror/", "message": "45 displaced Palestinians , mainly women, and children were killed in a tent by the Israeli strike in Rafah, Gaza.\nUN Secretary-General Antonio Guterres on Monday condemned Israel’s deadly airstrike on a camp of displaced people in Rafah city, southern Gaza Strip.\n“I condemn Israel’s actions which killed scores of innocent civilians who were only seeking shelter from this deadly conflict” Guterres wrote on X.\nThe attack occurred near the logistics base of the UN agency for Palestinian refugees (UNRWA) in Tal al-Sultan, said the Gaza-based Government Media Office.\nIsrael has killed more than 36,000 Palestinians in the Gaza Strip since a cross-border attack by Hamas on Oct. 7 last year.", "location": "GAZA", "classification": "security", "score": 0.9118763016393224, "event_breakdown": ".\n1. Israel kills more than 36,000 Palestinians in the Gaza Strip since a cross-border attack by Hamas on Oct. 7 last year.\n2. Israel killed 45 displaced Palestinians , mainly women, and children, in a tent by the Israeli strike in Rafah.\n3. UN Secretary-General Antonio Guterres condemned the attack.\n4. The attack occurred near the logistics base of the UN agency for Palestinian refugees (UNRWA) in Tal al-Sultan."}, {"id": "", "title": "Israeli strikes kill at least 37 Palestinians , most in tents , near Gaza Rafah as offensive expands", "date": "2024-05-29 01:30", "url": "https://japantoday.com/category/world/israeli-strikes-kill-16-in-rafah-medics-say-as-residents-report-heavy-fighting", "message": "Palestinians fleeing from the southern Gaza city of Rafah during an Israeli ground and air offensive in the city on Tuesday, May 28, 2024.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nOn Friday, the International Court of Justice called on Israel to halt its Rafah offensive, an order it has no power to enforce.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.\nThe fighting in Rafah has made it nearly impossible for humanitarian groups to import and distribute aid to southern Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.8163083432611551, "event_breakdown": "Events:\n- Palestinians fleeing from Rafah in southern Gaza on Tuesday during an Israeli ground and air offensive.\n- The International Court of Justice called on Israel to halt its Rafah offensive on Friday.\n- Most of the Rafah residents are from the same neighborhood in Gaza City that they fled earlier in the war."}, {"id": "", "title": "All eyes on Rafah : US says deadly strike didnt cross  red line as Israel widens assault", "date": "2024-05-29 06:30", "url": "https://www.indiatoday.in/world/story/us-says-deadly-rafah-strike-didnt-cross-red-lines-as-israel-widens-assault-2545068-2024-05-29", "message": "However, Israel's ongoing assault in Rafah still does not amount to a full-scale invasion which would breach Biden's \"red lines\", he added.\nMeanwhile, Algeria will present a draft resolution at the UN Security Council on Wednesday, calling \"to stop the killing in Rafah\".\nHere are the latest developments: US National Security Council spokesman John Kirby told reporters that \"the Israelis have said they used 37-pound bombs, precision-guided munitions...\nDanielâ\u0080æ pic.twitter.com/fzaRSnpgbE — Israel Defense Forces (@IDF) May 28, 2024On Tuesday, Israeli shelling and airstrikes killed at least 37 people near Rafah.\nAlgerian Ambassador Amar Bendjama told reporters that “it will be a short text, a decisive text, to stop the killing in Rafah\".", "location": "Rafah", "classification": "security", "score": 0.5167356654993306, "event_breakdown": "Draft Security Council Resolution Calling for An Immediate End to the Hostile Practices of the State of Israel Against the Palestinian People\n\nAlgerian Ambassador to the UN Amar Bendjama told a press conference after meeting that “it would be a short text, a decisive text, to stop the killing in Rafah”, noting that a vote on the text might be held on Thursday, 09 June.\n\nHe added that the draft calls for an end to Israeli hostilities against the Palestinians, an end to violence, and the establishment of a Palestinian State."}, {"id": "", "title": "Three Nahal Brigade soldiers fell in battle in Gaza", "date": "2024-05-29 11:00", "url": "http://www.israelnationalnews.com/news/390745", "message": "The IDF Spokesperson cleared the publication today (Wednesday) of the names of three soldiers from the 50th Battalion of the Nahal Brigade who fell in battle in the Gaza Strip.\nThe three were named as Staff sergeant Amir Galilove, Staff sergeant Uri Bar Or, and Staff sergeant Ido Appel.\nIn the incident where the three fell, a combat officer and two other combat soldiers from the 50th Battalion were seriously injured.\nIn another incident yesterday, an officer and a soldier from Battalion 614 were seriously injured in a battle in the northern Gaza Strip.\nIn a third incident yesterday, a soldier from the Yahalom Unit was seriously injured in a battle in the southern Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9798922579525828, "event_breakdown": "1. Three soldiers from the 50th Battalion of the Nahal Brigade were killed in action in the Gaza Strip on Wednesday.\n2. In a separate incident on Wednesday, an officer and a soldier from Battalion 614 were seriously injured in a battle in the northern Gaza Strip.\n3. In a third incident on Wednesday, a soldier from the Yahalom Unit was seriously injured in a battle in the southern Gaza Strip."}, {"id": "", "title": "Tejas LA - 2018 LSP Variant Spotted likely in Calibration Sortie Near Indo - Pak Border – Indian Defence Research Wing", "date": "2024-05-29 05:00", "url": "https://idrw.org/tejas-la-2018-lsp-variant-spotted-likely-in-calibration-sortie-near-indo-pak-border/", "message": "Tejas LA-2018 LSP Variant Spotted likely in Calibration Sortie Near Indo-Pak Border| BySOURCE: AFICREDIT DEFENCE CHAMBER @DefenceChamberThe indigenously developed Light Combat Aircraft (LCA) Tejas, in its LA-2018 LSP (Limited Serial Production) variant, was recently spotted taking off from INS Hansa base in Goa.\nThis mission, most likely, was a crucial step in evaluating and testing the LA-2018’s onboard sensors.\nThe border region likely mirrors the operational scenarios where the LA-2018 might be deployed.\nEvaluating its sensors near the border provides valuable data for its eventual deployment on the high seas.\nHowever, the aircraft’s flight path near the border suggests a potential focus on evaluating its capabilities in a strategically significant location.", "location": "India", "classification": "security", "score": 0.5793934543868489, "event_breakdown": "The security events in the text are as follows:\n\n* The presence of a Light Combat Aircraft (LCA) Tejas, in its LA-2018 LSP (Limited Serial Production) variant, at the INS Hansa base in Goa.\n* The takeoff of the LCA Tejas LA-2018 LSP variant from INS Hansa base in Goa.\n* The location of the test flight of the LCA Tejas LA-2018 LSP variant near the border between India and Pakistan."}, {"id": "", "title": "Ukraine shoots down 13 of 14 Russian drones over three oblasts in overnight attack", "date": "2024-05-29 09:30", "url": "https://www.yahoo.com/news/ukraine-shoots-down-13-14-083000204.html", "message": "Ukraine shoots down 13 of 14 Russian drones over three oblasts in overnight attackAir Defense Forces repel another Russian Shahed drones attack at nightUkrainian air defense forces destroyed 13 of Russia's 14 Shahed attack drones overnight on May 29, Ukrainian Air Force Commander, Mykola Oleschuk, reported on Telegram.\nUkrainian air defense forces destroyed 13 of Russia's 14 Shahed attack drones overnight on May 29, Ukrainian Air Force Commander, Mykola Oleschuk, reported on Telegram.\nRead also: Over 5,600 acres of forests on fire in Kharkiv Oblast, mostly due to Russian shellingUkrainian air defense shot down the 13 drones over the Mykolaiv, Kirovohrad, and Rivne oblasts.\nRead also: Russian army drops 1,500 kg bomb on Donetsk village, injuring three, including childAir raid alerts were issued across several Ukrainian oblasts due to the launch of Russian drones overnight on May 29.\nA factory in Russian Yelabuga, Tatarstan, Russia, plans to produce 6,000 Shahed-131/136 attack drones annually, in addition to reconnaissance drones, which could impact the course of Russia's war against Ukraine, The Wall Street Journal reported.", "location": "Ukraine", "classification": "security", "score": 0.8803934692409552, "event_breakdown": ":\n* Ukrainian air defense forces shot down 13 Russian Shahed attack drones over the Mykolaiv, Kirovohrad, and Rivne Oblasts overnight on May 29.\n* Ukraine's air defense forces destroyed 13 of Russia's 14 Shahed attack drones.\n* Several Ukrainian oblasts had issued air raid alerts due to the launch of Russian drones overnight on May 29."}, {"id": "", "title": "Rohingya forced to fight alongside Myanmar army tormentors", "date": "2024-05-29 03:15", "url": "https://www.yahoo.com/news/rohingya-forced-fight-alongside-myanmar-023713107.html", "message": "In their recruitment drive, militants say Rohingya need to ally with old enemies in the Myanmar army to face a new threat.\nSeveral Rohingya diaspora groups said in a statement that fighters forced Rohingya to flee, then looted and burned their homes -- claims the Arakan Army called \"propaganda\".\nBut Arakan Army spokesperson Khaing Thu Kha accused three groups -- RSO, ARSA and the Arakan Rohingya Army (ARA) -- of recruiting Rohingya from Bangladesh.\nHe said the conscripts were taken for training in a Myanmar army base, before \"fighting alongside\" the junta's forces.\nRohingya armed groups working in concert with the military have recruited hundreds more men and boys in Myanmar itself.", "location": "Myanmar", "classification": "security", "score": 0.7896503181994635, "event_breakdown": "1. Militants are encouraging Rohingya people to ally with Myanmar army to face a new threat.\n2. Several Rohingya diaspora groups are accusing Arakan Army of burning and looting Rohingya's homes.\n3. Arakan Army is accusing RSO, ARSA, and Arakan Rohingya Army of recruiting Rohingya people to fight against junta's forces.\n4. Conscripted Rohingya men were taken to Myanmar army base for training and to fight against junta's forces."}, {"id": "", "title": "Sudan : El Fasher Engulfed in Violence as Hospitals Suffer Repeated Attacks", "date": "2024-05-29 09:15", "url": "https://www.jowhar.com/sudan-el-fasher-engulfed-in-violence-as-hospitals-suffer-repeated-attacks/", "message": "In El Fasher, Sudan, relentless conflict exposes civilians to constant danger, with escalating attacks including patients and healthcare workers in the casualties, as highlighted by Médecins Sans Frontières (MSF).\nRecent assaults have damaged all three major health centers in El Fasher, following attacks on the MSF-backed South Hospital, leaving two out of three facilities operational amid confrontations between Sudanese Armed Forces and Rapid Support Forces in the heart of North Darfur.\n“El Fasher is witnessing a horrific escalation of combat, leaving no moment of peace for civilians.\n“Due to the escalating violence, South Hospital has become overwhelmed, managing over 1,000 casualties since hostilities erupted on 10 May,” reports Abdifatah Yusuf Ibrahim from MSF.\nTragedy struck an MSF worker on 25 May when his residence, near El Fasher’s central market, was destroyed in an attack, underscoring that no location in El Fasher is immune to the conflict’s reach.", "location": "EL FASHER", "classification": "security", "score": 0.9877973631165219, "event_breakdown": "- MSF reports on escalating conflict in El Fasher, Sudan.\n- Recent assaults have damaged all major health centers in El Fasher.\n- MSF's South Hospital, the only facility that provides internal medicine services in El Fasher, has been handling over 1,000 casualties since the recent waves of fighting commenced.\n- Local MSF personnel were evacuated as a bomb landed in front of the South Hospital.\n- A bomb struck near MSF's warehouse/equipment room recently, causing widespread damage."}, {"id": "", "title": "China Unveils Rifle - Toting Robot Dogs For Military Drills , Prompting Comparisons To  Black Mirror  ", "date": "2024-05-29 09:15", "url": "https://www.benzinga.com/news/24/05/39056351/china-unveils-rifle-toting-robot-dogs-for-military-drills-prompting-comparisons-to-black-mirror", "message": "In a recent display of military prowess, China has showcased robot dogs armed with rifles during joint military exercises with Cambodia, sparking concerns about the future of warfare.\nWhat Happened: The Chinese military recently exhibited a robot dog equipped with an automatic rifle during joint military exercises with Cambodia.\nState broadcaster CCTV captured the robot dog performing various movements under the control of a remote operator.\nThe Asian Superpower Reportedly Sets Up Biggest Semiconductor FundChina has previously displayed similar military applications of robot dogs and small aerial drones.\nWhy It Matters: The unveiling of rifle-toting robot dogs by China’s military comes amid heightened military activities and advancements.", "location": "Cambodia", "classification": "security", "score": 0.4049429410814022, "event_breakdown": "* Robot dog equipped with automatic rifle showcased during joint military exercises with China\n* Robot dog performed various movements under the control of a remote operator\n* China has previously displayed small aerial drones and robot dogs with military applications"}, {"id": "", "title": "Who Were The Niland Brothers ? Exploring The True Story Behind Steven Spielberg Saving Private Ryan", "date": "2024-05-29 10:45", "url": "https://www.pinkvilla.com/entertainment/hollywood/who-were-the-niland-brothers-exploring-the-true-story-behind-steven-spielbergs-saving-private-ryan-1310509", "message": "Meet the Niland brothers—Edward, Preston, Robert, and Frederick.\nLet’s delve into the remarkable journey of the Niland brothers, the real-life inspiration behind this movie.\nThe true story behind Saving Private RyanBack in 1998, a remarkable movie stormed into theaters, which was based on World War II.\nAs World War II unfolds, each brother feels the call to serve the country and joins the military.\nBut in reality, the Niland brothers died in Normandy.", "location": "Normandy", "classification": "security", "score": 0.4132933148622589, "event_breakdown": "Events in the text:\n1 World War II unfolds\n2. Each Niland brother joins the military\n3. The Niland brothers die in Normandy"}, {"id": "", "title": "What Israelis wish we could see . ", "date": "2024-05-29 11:15", "url": "https://slate.com/podcasts/what-next/2024/05/what-israelis-wish-we-could-see", "message": "If you can't access your feeds, please contact customer support.\nCheck your phone for a link to finish setting up your feed.\nPlease enter a 10-digit phone number.\nListen on your phone:RECOMMENDEDEnter your phone number and we'll text you a link to set up the podcast in your app:Text me the link!\nWe'll only text you about setting up this podcast, no spam.", "location": "Based on the provided text, I was unable to come up with an answer.", "classification": "security", "score": 0.697655615570284, "event_breakdown": "[Event 1]: A link is sent to a phone number for setting up a link to a podcast.\n[Event 2]: The phone number is requested to send a text to set up the podcast's link.\n[Event 3]: A link is received in a text message to set up the link to the podcast."}, {"id": "", "title": "North Korea flies rubbish - filled balloons to South in  tit - for - tat  attack | Politics News", "date": "2024-05-29 11:15", "url": "https://www.aljazeera.com/news/2024/5/29/north-korea-flies-rubbish-filled-balloons-to-south-in-tit-for-tat-attack", "message": "North Korea has sent hundreds of balloons loaded with rubbish and faeces across the heavily fortified border to the South.\nThe South Korean military released photos on Wednesday, some showing rubbish strewn around collapsed balloons, with the word “excrement” written on a bag in one photograph.\nThe North said that the swarm, containing toilet paper and suspected animal faeces, was a response to South Korean propaganda campaigns using balloons.\nSouth Korean activists, often led by North Korean defectors, have regularly sent balloons carrying leaflets with messages critical of Pyongyang and even USB memory sticks with K-pop music videos the other way.\nThat saw North Korean leader Kim Jong Un criticise the South’s “recklessness,” according to a Korean Central News Agency report on Wednesday.", "location": "North Korea", "classification": "security", "score": 0.43579653893038944, "event_breakdown": ".\nList\nNorth Korean government used hundreds of balloons to send rubbish, suspected animal feces, and toilet paper across the border to the South as a retaliation for South Korean groups sending balloons critical of Pyongyang and pop culture USB drives."}, {"id": "", "title": "Ukraine - Russia war latest : French and German leaders say Ukraine allowed to strike inside Russia", "date": "2024-05-29 10:00", "url": "https://news.sky.com/story/ukraine-russia-war-latest-french-and-german-leaders-say-ukraine-allowed-to-strike-inside-russia-12541713", "message": "Agreements on using Western weapons confidential, says GermanyA German government spokesperson says agreements on how Ukraine deploys weapons supplied by the West are confidential.\nThey batted away questions on whether Ukrainian forces could use them to strike into Russian territory.\nThe government was pressed on the issue at a news conference after French and German leaders said Kyiv should be allowed to hit military sites inside Russia from which missiles were being fired at Ukrainian territory.\nYesterday, Vladimir Putin tried to frame his invasion across the Kharkiv border, opening up a second front, as a result of the West failing to prevent Kyiv from attacking Russian targets.", "location": "BERLIN", "classification": "security", "score": 0.6773408478377958, "event_breakdown": "Title: Agreements on Using Western Weapons Confidential, Says Germany\n\n1. German government spokesperson declines to answer questions on whether Ukraine can use Western-supplied weapons to strike into Russian territory.\n2. Russian President Vladimir Putin attempted to frame his invasion of Kharkiv as a response to the West's failure to prevent Ukraine from hitting Russian targets.\n3. France and Germany suggested Ukraine should be allowed to strike military sites in Russia from which missiles were being fired at Ukrainian territory."}, {"id": "", "title": "Iran intervention in Sudan civil war advances its geopolitical goals − but not without risks", "date": "2024-05-29 04:00", "url": "http://www.econotimes.com/Irans-intervention-in-Sudans-civil-war-advances-its-geopolitical-goals--but-not-without-risks-1678487", "message": "But Tehran has received little coverage of its military intervention in another deadly conflict: Sudan’s civil war.\nIn the immediate aftermath of fighting breaking out between two rival factions of Sudan’s military government, Iran limited its involvement to supplying humanitarian aid.\nIn 2014, Sudan closed Iran’s cultural center and expelled its diplomatic officials for purportedly proselytizing Shiism in a predominantly Sunni country.\nMaking inroads in the HornThe civil war has provided an opportunity for Iran to correct course with Sudan.\nAnd unlike the wars in Syria and Ukraine, in Sudan, Tehran has found itself in the awkward position of supporting an adversary of Russia, which sponsors the RSF.", "location": "Sudan", "classification": "security", "score": 0.7974915884805674, "event_breakdown": "Security events:\n\n1. Iran supplied humanitarian aid to Sudan in the midst of the immediate aftermath of fighting between two rival factions of Sudan's military government.\n2. In 2014, Sudan closed down Iran's cultural center and expelled its diplomatic officials.\n3. Sudan's civil war provided an opportunity for Iran to make in roads with Sudan.\n4. The civil war in Sudan saw Iran in the awkward position of supporting an adversary of Russia."}, {"id": "", "title": "Father Jerry Pokorsky : Save Freedom of Worship", "date": "2024-05-29 03:00", "url": "https://www.newsbusters.org/blogs/nb/father-jerry-pokorsky/2024/05/28/save-freedom-worship", "message": "Dad convinced us for many decades that his time in the Navy was like a vacation in the tropics.\nThe Government duplicated the original into propaganda posters for the WWII war effort.\nSo, the poster included these words:SAVE FREEDOM OF WORSHIP EACH ACCORDING TO THE DICTATES OF HIS OWN CONSCIENCE BUY WAR BONDSOur national authorities understood the culture our soldiers left behind and used the poster to advance the war effort.\nLast year, the National Park Service denied the Knights of Columbus permission to organize a Memorial Day Catholic Mass at Poplar Grove National Cemetery in Petersburg, Virginia.\nSave freedom of worship.", "location": "PETERSBURG, VIRGINIA", "classification": "security", "score": 0.45759238363239507, "event_breakdown": "- the World War II poster that included the words \"Save freedom of worship\"\n- the National Park Service's denial of the Knights of Columbus's request to organize a Memorial Day Catholic Mass at Poplar Grove National Cemetery in Petersburg, Virginia."}, {"id": "", "title": "Air Force : Ukraine downs 13 Russian drones overnight", "date": "2024-05-29 07:15", "url": "https://www.yahoo.com/news/air-force-ukraine-downs-13-043600253.html", "message": "Ukrainian air defenses shot down 13 of the 14 Shahed-type attack drones launched during a Russian attack overnight on May 29, according to Ukraine's Air Force Commander, Mykola Oleshchuk.\nThe drones were reportedly launched from the Russian port town of Primorsko-Akhtarsk, located on the coast of the Azov Sea.\nThe town lies approximately 153 kilometers (95 miles) from Kerch, which is located on the Crimean Peninsula that Russia annexed from Ukraine in 2014.\nAircraft, missile and electronic warfare units, and mobile fire groups of the Ukrainian Air Force intercepted the drones over Mykolaiv, Kirovohrad, and Rivne oblasts, the Air Force said in its morning update.\nIn recent months, Russia has intensified attacks against Ukraine's energy infrastructure, launching massive drone and missile strikes targeting critical facilities.", "location": "The location from which Russia launched the Shahed-type attack drones during the attack on May 29", "classification": "security", "score": 0.8361121533178947, "event_breakdown": "1. Russian forces launch Shahed-type attack drones from Primorsko-Akhtarsk.\n2. Ukrainians intercepted the drones over Mykolaiv, Kirovohrad, and Rivne Oblasts."}, {"id": "", "title": "Underwater detonation of WWII - era shells closes popular beaches in southern Okinawa", "date": "2024-05-29 08:45", "url": "https://www.stripes.com/theaters/asia_pacific/2024-05-29/uxo-wwii-shells-miyako-okinawa-14013607.html", "message": "Japanese authorities detonate 30 World War II-era shells off Miyako Island, Okinawa, May 28, 2024.\n(Japan Maritime Self-Defense Force)CAMP FOSTER, Okinawa — Japanese authorities safely detonated 30 shells believed to be left over from World War II this week on Miyakojima, a popular tourist destination 170 miles southwest of Okinawa’s main island.\nThe ordnance was discovered in December during dredging at Port Hirara, a hub for many ferries and cargo ships.\nPopular tourist destinations, including Painagama and Sunayama beaches, where off-limits during the operation.\nApproximately 10,000 tons of ordnance were dropped on Okinawa during the Battle of Okinawa and nearly 2,000 tons remain undiscovered, according to the prefecture’s General Bureau website.", "location": "Okinawa, Japan", "classification": "security", "score": 0.8514243587276413, "event_breakdown": "Security Events:\n\n* 30 World War II-era shells detonated off the coast of Miyako Island, Okinawa, May 28, 2024.\n* 10,000 tons of ordnance dropped on Okinawa during World War II.\n* 2,000 tons of undiscovered ordnance on Okinawa.\n* Unexploded WWII-era ordnance discovered in port dredging at Port Hirara, Miyakojima, December 2024.\n* Popular beaches Painagama and Sunayama off-limits during ordnance disposal operations."}, {"id": "", "title": "Pressure builds on Biden after Israeli strike kills dozens of civilians in Rafah", "date": "2024-05-29 02:45", "url": "https://www.yahoo.com/news/pressure-builds-biden-israeli-strike-020912209.html", "message": "There should be no innocent life lost here as a result of this conflict,\" National Security Communications Adviser John Kirby said during a White House press briefing.\nAnd we understand that this strike did kill two senior Hamas terrorists who are directly responsible for attacks against the Israeli people,\" he continued.\nPHOTO: U.S. White House National Security Communications Advisor John Kirby speaks during a press briefing at the White House in Washington, May 28, 2024.\n(Reuters)PHOTO: Palestinians search for food among burnt debris in the aftermath of an Israeli strike on an area designated for displaced people, in Rafah in the southern Gaza Strip, May 27, 2024.\nPressure builds on Biden after Israeli strike kills dozens of civilians in Rafah originally appeared on abcnews.go.com", "location": "GAZA", "classification": "security", "score": 0.6081563000291409, "event_breakdown": "form\nNational Security Communications Adviser John Kirby said during a White House briefing that we should understand that this strike killed two senior Hamas terrorists who are directly responsible for attacks against the Israeli people, while also saying that peaceful and diplomatic means should be taken and innocent life should not be lost. However, pressure builds on Biden after an Israeli strike in the Gaza Strip kills dozens of civilians, including at least three dozen innocent Palestinian civilians, the majority of whom were women and children, according to the Gaza Health Ministry of the time."}, {"id": "", "title": "2025 Toyota LandCruiser Prado 250 v 2024 Toyota LandCruiser Prado 150 : Spec battle", "date": "2024-05-29 08:00", "url": "https://www.canberratimes.com.au/story/8645846/2025-toyota-landcruiser-prado-250-v-2024-toyota-landcruiser-prado-150-spec-battle/?cs=34616", "message": "Its time is up though, and in its place comes the 250 Series Prado – bigger, boxier, and packed with new tech that brings it well and truly into the modern age.", "location": "CAIRO", "classification": "security", "score": 0.47593154509562113, "event_breakdown": "Security Events:\n\n* Introduction of new 250 Series Prado\n* Introduction of bigger and boxier Prado\n* Introduction of new tech in 250 Series Prado"}, {"id": "", "title": "Ukrainians risk lives to flee draft via icy Romanian pass", "date": "2024-05-29 04:00", "url": "https://www.yahoo.com/news/ukrainians-risk-lives-flee-draft-031253223.html", "message": "He was one of thousands who have been fleeing secretly across the border to EU member Romania as Ukraine has tightened its draft rules.\n\"Many of them say that they'd rather come and die on the mountain than die in the war.\"\nThey risk freezing in the mountains or drowning in the Tisa River that runs along part of the northern border.\nSince Russia invaded Ukraine, 23 Ukrainians have been found dead on Romanian soil, border police say.\nAmong the Ukrainians arriving there in vans and cars was a 29-year-old man travelling with his wife and daughter.", "location": "given\nUkraine", "classification": "security", "score": 0.5533585612683227, "event_breakdown": "Events:\n- Thousands of Ukrainians fleeing secretly across the border to Romania as Ukraine tightens its draft rules.\n- 23 Ukrainians have been found dead on Romanian soil since Russia invaded Ukraine, border police say."}, {"id": "", "title": "Tower of death admin paperwork wins ADF art prize", "date": "2024-05-29 05:30", "url": "https://www.canberratimes.com.au/story/8645528/tower-of-death-admin-paperwork-wins-adf-art-prize/?cs=14264", "message": "The 3000-page pile, as tall as the artist herself, is made up of requests for financial support before and after Andrew died, and documents regarding the department's investigations into why he died.", "location": "BROOKLYN", "classification": "security", "score": 0.643710603039272, "event_breakdown": "Security Events:\n\n1. Investigation into the death of the artist's partner, Andrew.\n2. Request for financial support before and after the artist's partner, Andrew, died.\n3. Investigation by the department into the circumstances surrounding the artist's partner, Andrew's death."}, {"id": "", "title": "Tower of death admin paperwork wins ADF art prize", "date": "2024-05-29 05:15", "url": "https://www.illawarramercury.com.au/story/8645528/tower-of-death-admin-paperwork-wins-adf-art-prize/", "message": "The 3000-page pile, as tall as the artist herself, is made up of requests for financial support before and after Andrew died, and documents regarding the department's investigations into why he died.", "location": "SAN DIEGO", "classification": "security", "score": 0.643710603039272, "event_breakdown": "Security events:\n\n* Andrew's death\n* Investigations into Andrew's death"}, {"id": "", "title": "Caitlin Clark Career - High 30 Points Wows WNBA Fans as Fever Lose to Brink , Sparks", "date": "2024-05-29 06:00", "url": "https://bleacherreport.com/articles/10122844-caitlin-clarks-career-high-30-points-wows-wnba-fans-as-fever-lose-to-brink-sparks", "message": "Clark was mostly fantastic for the Indiana Fever, scoring a career-high 30 points to go along with six assists, five rebounds, three steals and three blocks.\nBut Brink's Los Angeles Sparks were better, winning 88-82 behind Aari McDonald's 21 points off the bench.\nBrink was something of a non-factor, finishing with three points, three rebounds, two blocks and two assists.\nIt hasn't been the banner start to her career from a wins and losses perspective, as the Fever are now just 1-7.\nIt didn't help that McDonald and Nurse got red-hot from three in the second half, finishing a combined 8-of-13 from beyond the arc.", "location": "Indiana", "classification": "security", "score": 0.44688222283782303, "event_breakdown": ".\n- Clark scores a career-high 30 points for the Indiana Fever\n- The Los Angeles Sparks defeat the Indiana Fever 88-82\n- Aari McDonald scores 21 points off the bench for the Sparks\n- Elissa Cunane scores 17 points off the bench for the Fever\n- The Sparks shoot 47.6% from the field, while the Fever shoot 42.4%\n- The Sparks shoot 38.1% from three, while the Fever shoot 34.6%"}, {"id": "", "title": "Latest Articles", "date": "2024-05-29 02:00", "url": "https://freerepublic.com/tag/*/index?more=4240686", "message": "\"He that hath an ear, let him hear what the Spirit saith unto the churches; To him that overcometh will I give to eat of the hidden manna, and will give him a white stone, and in the stone a new name written, which no man knoweth saving he that receiveth it.\"\n\"If any man speak in an unknown tongue, let it be by two, or at the most by three, and that by course; and let one interpret.\nBut if there be no interpreter, let him keep silence in the church; and let him speak to himself, and to...", "location": "The exact location cannot be determined from the provided information.", "classification": "security", "score": 0.836730465979777, "event_breakdown": "Security events in the text:\n\n1. Access to a secret manna is granted to one who overcomes.\n2. A white stone is given to the one who overcomes, with a new name written upon it.\n3. Speaking in unknown tongues is allowed during church services, but only with interpretation.\n4. If there is no interpreter, the speaker should remain silent during the service.\n5. Speaking in unknown tongues is allowed during the service when there is an interpreter present.\n6. Speaking in unknown tongues during the service should be kept to a minimum, with two or three people speaking at most.\n7. The order of speaking should be maintained, with one person speaking at a time.\n8. If an interpreter is not found, the speaker should speak only to himself and not to the church.\n\nNote: While these events might seem straightforward, some of them could have potential security implications depending on the context in which they are interpreted."}, {"id": "", "title": "North Korea flies trash balloons after failed satellite launch", "date": "2024-05-29 13:00", "url": "https://www.ctvnews.ca/world/in-bizarre-provocation-north-korea-flies-trash-manure-balloons-over-the-south-1.6904835", "message": "SEOUL, South Korea -North Korea flew hundreds of balloons carrying trash and manure toward South Korea in one of its most bizarre provocations against its rival in years, prompting the South's military to mobilize chemical and explosive response teams to recover objects and debris in different parts of the country.\nPhotos released by the South Korean military showed trash scattered across highways and roads in different parts of the country.\nThis photo provided by South Korea Defence Ministry, shows balloons with trash presumably sent by North Korea, in South Chungcheong Province, South Korea, Wednesday, May 29, 2024.\nIt is believed that North Korea's previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "South Korea", "classification": "security", "score": 0.6448979925032192, "event_breakdown": "1. North Korea sent trash and manure to South Korea using balloons\n2. South Korea's military mobilized chemically and explosively response teams\n3. The South Korean military discovered trash scattered on highways and roads\n4. Photos released by the South Korean military showed trash in different areas of the country.\n5. South Korea condemned the illegal crossing of the western sea border by North Korea\n6. It is believed that North Korea provided military supplies to help prolong Russia's fighting in Ukraine."}, {"id": "", "title": "North Korea flies trash balloons over the South as Kim Jong - un doubles down on satellite ambitions", "date": "2024-05-29 13:30", "url": "https://www.theglobeandmail.com/world/article-north-korea-flies-trash-balloons-over-the-south-as-kim-doubles-down-on/", "message": "It advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nSimilar North Korean balloon activities damaged cars and other property in 2016.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the context provided, it was not possible to determine a specific location for the event.", "classification": "security", "score": 0.906809865086057, "event_breakdown": "Security Events:\nExplosive balloons flown by North Korea damaging cars and other property in 2016\nNorth Korean spy satellites launched to enhance threat of nuclear capable missiles"}, {"id": "", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions", "date": "2024-05-29 13:00", "url": "https://apnews.com/article/north-korea-kim-jong-un-military-spy-satellite-fa72d5e7327edf285f79587e56e5b560", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "Based on the provided information, the main focus of the event appears to be North Korea.", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "Events:\n1. North Korea has been flying garbage-carrying balloons toward South Korea since Tuesday night.\n2. North Korea has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\n3. The U.S. and South Korea have accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.\n4. It is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\n5. North Korea's previous space rockets were described as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles."}, {"id": "", "title": "North Korea flies balloons carrying rubbish over the South", "date": "2024-05-29 13:30", "url": "https://www.salisburyjournal.co.uk/news/national/24352060.north-korea-flies-balloons-carrying-rubbish-south/", "message": "Balloons with rubbish, thought to have been sent by North Korea, in South Chungcheong Province, South Korea (South Korea Presidential Office via AP)In a speech on Tuesday, Mr Kim described the South Korean response as a “hysterical attack formation flight and strike drill” and “direct military challenge” towards North Korea, the North’s official Korean Central News Agency said on Wednesday.\nIn another sign of tensions between the war-divided rivals, South Korea’s Joint Chiefs of Staff said North Korea has also been flying large numbers of balloons carrying rubbish towards the South since Tuesday night, in an apparent retaliation against South Korean activists for flying anti-Pyongyang propaganda leaflets across the border.\nRubbish from a balloon in Seoul, South Korea (South Korea Presidential Office via AP)There were no immediate reports of damage caused by the balloons.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidiser.\nThe US and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "SEOUL", "classification": "security", "score": 0.644589893826974, "event_breakdown": ".\nDate: 2022-06-08\n\nLocations: South Chungcheong Province, South Korea\n\nReported event: South Korea Presidential Office informed that North Korea launched balloons with rubbish towards the South on Tuesday night as a retaliation against activists for flying anti-Pyongyang propaganda leaflets across the border.\n\nReported event: South Korea’s Joint Chiefs of Staff said North Korea launched several hundred balloons towards the South since Tuesday night, in an apparent retaliation against South Korean activists for flying anti-Pyongyang propaganda leaflets across the border.\n\nSuggestion: I believe that they were the same event, and they should be listed as a single event."}, {"id": "", "title": "North Korea flies balloons carrying rubbish over the South", "date": "2024-05-29 13:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24352060.north-korea-flies-balloons-carrying-rubbish-south/", "message": "Balloons with rubbish, thought to have been sent by North Korea, in South Chungcheong Province, South Korea (South Korea Presidential Office via AP)In a speech on Tuesday, Mr Kim described the South Korean response as a “hysterical attack formation flight and strike drill” and “direct military challenge” towards North Korea, the North’s official Korean Central News Agency said on Wednesday.\nIn another sign of tensions between the war-divided rivals, South Korea’s Joint Chiefs of Staff said North Korea has also been flying large numbers of balloons carrying rubbish towards the South since Tuesday night, in an apparent retaliation against South Korean activists for flying anti-Pyongyang propaganda leaflets across the border.\nRubbish from a balloon in Seoul, South Korea (South Korea Presidential Office via AP)There were no immediate reports of damage caused by the balloons.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidiser.\nThe US and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "SEOUL", "classification": "security", "score": 0.644589893826974, "event_breakdown": "Security events in the text:\n1. Balloons with rubbish, thought to have been sent by North Korea, in South Chungcheong Province, South Korea\n2. South Korea’s Joint Chiefs of Staff saying North Korea has been flying large numbers of balloons carrying rubbish towards the South since Tuesday night."}, {"id": "", "title": "US - made munitions used in deadly strike on Rafah tent camp , CNN analysis shows", "date": "2024-05-29 05:30", "url": "https://www.yahoo.com/news/us-made-munitions-used-deadly-035638990.html", "message": "Munitions made in the United States were used in the deadly Israeli strike on a displacement camp in Rafah on Sunday, a CNN analysis of video from the scene and a review by explosive weapons experts has found.\nIn this image which CNN geolocated to the scene of Sunday's strike in Rafah, four explosive weapons experts identified the tail of a US-made GBU-39 small diameter bomb (SDB).\n“The warhead portion [of the munition] is distinct, and the guidance and wing section is extremely unique compared to other munitions.\nAsked for comment on the munitions used in the Rafah strike at Tuesday’s briefing, Pentagon deputy press secretary Sabrina Singh told reporters: “I do not know what type of munition was used in that airstrike.\nHagari said the deadly fire which occurred following the strike was not caused solely by weapons used by the Israeli military.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.786718638829662, "event_breakdown": "* Deadly Israeli strike on displacement camp in Rafah\n* CNN analysis of video showing US-made munitions used in strike\n* Review of video by explosive weapons experts identifies US-made GBU-39 small diameter bomb (SDB)\n* Pentagon deputy press secretary Sabrina Singh says does not know what type of munition was used in Rafah strike"}, {"id": "", "title": "Rafah , Gaza : US - made munitions used in deadly strike on tent camp , CNN analysis shows", "date": "2024-05-29 04:00", "url": "https://us.cnn.com/2024/05/28/middleeast/gaza-us-munitions-rafah-strike-analysis-intl-hnk/", "message": "CNN —Munitions made in the United States were used in the deadly Israeli strike on a displacement camp in Rafah on Sunday, a CNN analysis of video from the scene and a review by explosive weapons experts has found.\nFootage obtained by CNN showed swathes of the camp in Rafah in flames, with scores of men, women and children frantically trying to find cover from the nighttime assault.\nIn this image which CNN geolocated to the scene of Sunday's strike in Rafah, four explosive weapons experts identified the tail of a US-made GBU-39 small diameter bomb (SDB).\nAsked for comment on the munitions used in the Rafah strike at Tuesday’s briefing, Pentagon deputy press secretary Sabrina Singh told reporters: “I do not know what type of munition was used in that airstrike.\nHagari said the deadly fire which occurred following the strike was not caused solely by weapons used by the Israeli military.", "location": "Rafah, Gaza", "classification": "security", "score": 0.6284827459167056, "event_breakdown": ".\n- Sunday 11th August : A video showed a displacement camp in Rafah in flames, following a deadly Israeli strike.\n- Tuesday 13th August : Footage obtained by CNN showed the aftermath of the strike, in which scores of men, women and children tried to find cover.\n- Tuesday 13th August : A video showed a US-made GBU-39 small diameter bomb (SDB) at the scene of the strike."}, {"id": "", "title": "Israel says munitions used  too small  to ignite deadly fire at Rafah tent , blames second blast", "date": "2024-05-29 02:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-says-munitions-used-too-small-to-ignite-deadly-fire-at-rafah-tent-blames-second-blast/articleshow/110514542.cms", "message": "Displaced Palestinians inspect their tents destroyed by Israel's bombardment, adjunct to an UNRWA facility west of Rafah city.\n(AP Photo)The Israeli military says an initial investigation into a strike that sparked a deadly fire in Rafah has found the blaze was caused by a secondary explosion .\nDaniel Hagari, the chief military spokesman, said Tuesday that the military fired two 17-kg munitions that targeted two senior Hamas militants .\nHe says the munitions would have been too small to ignite a fire on their own.\nHagari said the army is looking into the possibility that weapons were stored in the area.", "location": "RAFAH", "classification": "security", "score": 0.9723568690912259, "event_breakdown": "- Israeli military strike in Rafah causes deadly fire\n- Israeli military fires two 17-kg munitions at Hamas militants"}, {"id": "", "title": "Israeli Strikes Kill At Least 37 Palestinians Sheltering In Tents Near Gaza Rafah", "date": "2024-05-29 04:15", "url": "https://www.news18.com/world/israeli-strikes-kill-at-least-37-palestinians-sheltering-in-tents-near-gazas-rafah-8907911.html", "message": "The blaze killed 45 Palestinians, according to Gaza health officials’ count.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nOn Friday, the International Court of Justice called on Israel to halt its Rafah offensive, an order it has no power to enforce.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.\nThe fighting in Rafah has made it nearly impossible for humanitarian groups to import and distribute aid to southern Gaza.", "location": "GAZA CITY, Gaza Strip.", "classification": "security", "score": 0.7951941714986371, "event_breakdown": "Events:\n-May 15-18, 2021: Israeli attacks in the area\nMay 17, 2021: Israeli attacks in the area\nMay 18, 2021: Israeli attacks in the area\nMay 19-21, 2021: Israeli attack in stairwell\nMay 20, 2021: Israeli attack in stairwell\nMay 21, 2021: Israeli attack in stairwell\nMay 21, 2021: Israeli attack in stairwell\nIt is not specified in the text whether there is a direct relationship between the security events listed."}, {"id": "", "title": "All Eyes On Rafah : What Happening In Gaza City As Israel Steps Up Assault", "date": "2024-05-29 03:00", "url": "https://www.ndtv.com/world-news/all-eyes-on-rafah-whats-happening-in-gaza-city-as-israel-steps-up-assault-5768489", "message": "All eyes on Rafah' is a phrase that refers to the ongoing genocide in this Gaza city.\nAt least 45 people, including children, were killed at a refugee camp in Gaza's Rafah after an Israeli air strike.\nAll Eyes On Rafah'All eyes on Rafah' is a phrase that refers to the ongoing genocide in this Gaza city.\nThe phrase has picked up steam as a call for awareness of the ongoing war.\nIsrael, however, vowed to press on with the Rafah strike despite the global condemnation and a US warning.", "location": "GAZA CITY", "classification": "security", "score": 0.7148660321079702, "event_breakdown": "* 45 people were killed at a refugee camp in Rafah after an Israeli airstrike\n* Israel has vowed to press on with the Rafah strike despite the global condemnation and a US warning"}, {"id": "", "title": "Israeli army says civilian deaths in Rafah caused by unexpected secondary explosions", "date": "2024-05-29 05:30", "url": "https://www.orissapost.com/israeli-army-says-civilian-deaths-in-rafah-caused-by-unexpected-secondary-explosions/", "message": "Jerusalem: The Israeli military has said its initial investigation findings indicated that it was unexpected secondary explosions and fire that caused dozens of civilian deaths in its airstrike on Rafah, southern Gaza Strip, Sunday night.\nThe IDF accused the two Hamas officials of “orchestrating and executing terror attacks against Israelis”.\nHagari said that “due to unforeseen circumstances, a fire was tragically ignited, resulting in the loss of lives of nearby Gazan civilians”.\nThe Palestinian official news agency WAFA reported that an Israeli airstrike targeted Sunday evening the tents in a newly established camp for the displaced civilians in Rafah.\nThe attack, which resulted in the deaths of at least 45 Palestinians and injuries to numerous others, has sparked severe criticism from regional countries and the international community.", "location": "GAZA", "classification": "security", "score": 0.9145307613683468, "event_breakdown": "Event: IDF claims coordinated Hamas terror attacks, 45 Palestinians killed and injured in airstrike on Rafah, southern Gaza Strip.\nEvent: 45 Palestinians killed, injured in Israeli airstrike on newly established camp for displaced civilians in Rafah."}, {"id": "", "title": "Israeli strikes kill at least 37 Palestinians , most in tents , near Gaza Rafah as offensive expands | World News", "date": "2024-05-29 02:45", "url": "https://indianexpress.com/article/world/israeli-strikes-kill-at-least-37-palestinians-most-in-tents-near-gazas-rafah-as-offensive-expands-9358197/", "message": "The tent camp inferno has drawn widespread international outrage, including from some of Israel’s closest allies, over the military’s expanding offensive into Rafah.\nIsraeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nThe International Court of Justice ordered Israel to halt its Rafah offensive last week as part of South Africa's case accusing Israel of committing genocide against the Palestinians in Gaza.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.", "location": "GAZA CITY.", "classification": "security", "score": 0.8571135336451418, "event_breakdown": "Events:\n- Israeli ground troops are operating in eastern Rafah.\n- Israeli tanks are operating in central parts of Rafah.\n- Israeli ground troops are operating along the Gaza-Egypt border.\n- Many people in Gaza fled to Tel al-Sultan.\n- The people of Tel al-Sultan have fled from the same neighborhood in Gaza City earlier in the war."}, {"id": "", "title": "Israeli Strikes Kill at Least 37 Near Rafah as Offensive Expands", "date": "2024-05-29 13:15", "url": "https://time.com/6983069/israel-rafah-offensive-expands/", "message": "The tent camp inferno has drawn widespread international outrage, including from some of Israel’s closest allies, over the military’s expanding offensive into Rafah.\nIsraeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nThe International Court of Justice ordered Israel to halt its Rafah offensive last week as part of South Africa's case accusing Israel of committing genocide against the Palestinians in Gaza.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.", "location": "RAFAH.", "classification": "security", "score": 0.8571135336451418, "event_breakdown": "- Israeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n- International Court of Justice ordered Israel to halt its Rafah offensive last week.\n- Most of those there had fled from the same neighborhood in Gaza City earlier in the war."}, {"id": "", "title": "Israeli strikes kill at least 37 Palestinians", "date": "2024-05-29 02:00", "url": "https://www.chicagotribune.com/2024/05/28/israeli-strikes-kill-at-least-37-palestinians-most-in-tents-near-gazas-rafah-as-offensive-expands/", "message": "The Israeli military suggested Sunday’s blaze in the tent camp may have been caused by secondary explosions, possibly from Palestinian fighter’s weapons.\nIsraeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.\nMore than 100 were released during a weeklong cease-fire in November in exchange for Palestinians imprisoned by Israel.", "location": "GAZA CITY, GAZA", "classification": "security", "score": 0.9682931459143521, "event_breakdown": "- Israeli ground troops and tanks were operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n- The Israeli air force fired several missiles into eastern Rafah, Gaza City, and northern Jabalia.\n- Israeli warplanes conducted several airstrikes on targets in the northern Gaza Strip."}, {"id": "", "title": "China secret tank packs drone - killer tech , leaked images reveal", "date": "2024-05-29 14:00", "url": "https://interestingengineering.com/military/china-secret-tank-leaked", "message": "Some have also speculated that the two tanks spotted are likely variants of the new tank.\nEach variant is likely armed with different main guns, one with a 105mm and the other a heavier 125mm gun.\nThe secret tankThe tank’s defenses can reportedly preemptively detect and neutralize incoming missiles at 360 degrees.\nStill, many nations are exploring fourth-generation tanks due to warfare’s evolving nature and the increased threat from drones and missiles.\nOne notable example is the Russian T-14 Armata, unveiled in 2015 and claims to have APS and an automated, unmanned turret.", "location": "Russia", "classification": "security", "score": 0.45087681426189585, "event_breakdown": "Secret Russian tank spotted\nNew variant of Russian tank possibly unveiled\nNew Russian tank equipped with APS"}, {"id": "", "title": "North Korea Sent Garbage Balloon To South Korea", "date": "2024-05-29 14:30", "url": "https://news24online.com/world/north-koreas-provocative-move-garbage-filled-balloons-sent-to-south-korea-275082/275082/", "message": "Kim Jong Un escalated psychological warfare by sending balloons filled with garbage from North Korea to South Korea, aiming to provoke and humiliate while denouncing the South’s leadership.\nIn a bizarre escalation of propaganda tactics, North Korea has reportedly sent large balloons filled with garbage, including used toilet paper and cigarette butts, etc into South Korea.\n🤣 North Korea used balloons to throw shit and garbage at South Korea.\nBoth North and South Korea have a history of using balloons to send propaganda across the Demilitarized Zone (DMZ).\nSouth Korean activists have previously launched balloons carrying anti-North Korea messages, which often infuriate the North Korean regime and have led to threats of retaliation.", "location": "DMZ", "classification": "security", "score": 0.7030154966912974, "event_breakdown": "Security Event: North Korea sent balloons containing garbage, used toilet paper, cigarette butts, and propaganda leaflets into South Korea."}, {"id": "", "title": "Air Force Participates in NATO Exercise with Gripen Fighter Jets in the Czech Republic", "date": "2024-05-29 13:30", "url": "https://hungarytoday.hu/air-force-participates-in-nato-exercise-with-gripen-fighter-jets-in-the-czech-republic/", "message": "In order to maintain and further develop operational capabilities, it is of paramount importance for the Hungarian Air Force to exercise in a large group, integrated into a NATO unit.\nThe priority of the Lion Effort exercise was the composite air operations (COMAO) tasks.\nFact From May 9-27, 2024, the Czech Air Force 21st Tactical Air Force Base Čáslav From May 9-27, 2024, the Czech Air Force 21st Tactical Air Force Base Čáslav hosted the multinational exercise “Lion Effort 2024” (LE24), training approximately 500 service personnel, roughly 150 of whom were international participants.\nLion Effort is the fifth iteration of an air exercise for countries operating the JAS-39 Gripen aircraft, also known as the Gripen Users Group (GUG).\nRelated article Next Gen Hungarian Air Force Fighter Jets on the Horizon The Air Force's current Gripen fleet is ageing, so a replacement could not come soon enough.Continue readingVia Honvedelem.hu; Army.cz; Featured image: Facebook/21.", "location": "Čáslav, Czech Republic", "classification": "security", "score": 0.4219374406190237, "event_breakdown": "Event 1: Lion Effort 2024, multinational exercise, hosted by Czech Air Force, approximately 500 service personnel, roughly 150 of whom were international participants, from May 9-27, 2024\nEvent 2: Lion Effort is the fifth iteration of an air exercise for countries operating the JAS-39 Gripen aircraft, also known as the Gripen Users Group (GUG)"}, {"id": "", "title": "China military shows off robot dogs during drills with Cambodia", "date": "2024-05-29 13:15", "url": "https://abc30.com/post/chinas-military-shows-off-robot-dogs-drills-cambodia/14886387/", "message": "China's military shows off robot dog with automatic rifle mounted on its backDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back, essentially turning man's best (electronic) friend into a killing machine.", "location": "CAMBODIA", "classification": "security", "score": 0.6245231558049479, "event_breakdown": "1. China's military shows off robot dog with automatic rifle mounted on its back\n2. China's military trains with Cambodia's military"}, {"id": "", "title": "Netanyahu frequently makes claims of antisemitism . Critics say he deflecting from his own problems", "date": "2024-05-29 05:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/netanyahu-frequently-makes-claims-of-antisemitism-critics-say-hes-deflecting-from-his-own-problems/article_1d617e9e-5b2b-5696-bd80-03535882acb1.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission.", "location": "NULL", "classification": "security", "score": 0.6245355648029417, "event_breakdown": "Based on the text you provided, the security events mentioned in the text are:\n\n1. The Associated Press is copyrighting its content.\n2. The Associated Press is requesting permission to use its content with credit.\n3. The Associated Press is requesting that its content not be broadcast or republished without permission."}, {"id": "", "title": "Blinken Visits Moldova In Show Of U . S . Support For Country Western Path", "date": "2024-05-29 07:30", "url": "https://www.rferl.org/a/moldova-blinken-sandu-eu/32970091.html", "message": "De Croo stressed that the planes are to be used only above the territory of Ukraine.\n\"The security agreement stipulates that military equipment will be used by the armed forces of Ukraine and on the territory of Ukraine,\" he said.\nUkraine has been frustrated by the lack of permission from some of its allies, mainly the United States and Germany, to hit military targets inside Russia with Western weapons systems.\nLive Briefing: Russia's Invasion Of Ukraine RFE/RL's Live Briefing gives you all of the latest developments on Russia's full-scale invasion, Kyiv's counteroffensive, Western military aid, global reaction, and the plight of civilians.\nNATO Secretary-General Jens Stoltenberg has also thrown his weight behind Ukraine's plea, saying concerns that the use of Western weapons inside Russia would implicate the alliance in the war are unfounded.", "location": "KYIV", "classification": "security", "score": 0.7966866867193342, "event_breakdown": "* the Belgian government-approved the delivery of anti-tank weapons and 2 fighter planes to support Ukraine.\n* It stipulates that military equipment will be used only above the territory of Ukraine.\n* It could implicate NATO in the war."}, {"id": "", "title": "Ukraine Repels Russian Drone Attacks On Three Regions", "date": "2024-05-29 07:30", "url": "https://www.rferl.org/a/ukraine-repels-drone-attacks/32970104.html", "message": "De Croo stressed that the planes are to be used only above the territory of Ukraine.\n\"The security agreement stipulates that military equipment will be used by the armed forces of Ukraine and on the territory of Ukraine,\" he said.\nUkraine has been frustrated by the lack of permission from some of its allies, mainly the United States and Germany, to hit military targets inside Russia with Western weapons systems.\nHe stressed, however, that Ukraine should not be allowed to hit other targets in Russia or civilian facilities.\nRussian President Vladimir Putin warned earlier on May 28 that hitting Russian soil with Western-supplied long-range weapons could set the war on a dangerous new path.", "location": "NOGENT, BELGIUM", "classification": "security", "score": 0.904444955968308, "event_breakdown": "Text does not contain relevant information."}, {"id": "", "title": "Rohingya forced to fight alongside Myanmar army tormentors", "date": "2024-05-29 14:30", "url": "https://thefrontierpost.com/rohingya-forced-to-fight-alongside-myanmar-army-tormentors/", "message": "In their recruitment drive, militants say Rohingya need to ally with old enemies in the Myanmar army to face a new threat.\nSeveral Rohingya diaspora groups said in a statement that fighters forced Rohingya to flee, then looted and burned their homes — claims the Arakan Army called “propaganda”.\nBut Arakan Army spokesperson Khaing Thu Kha accused three groups — RSO, ARSA and the Arakan Rohingya Army (ARA) — of recruiting Rohingya from Bangladesh.\nHe said the conscripts were taken for training in a Myanmar army base, before “fighting alongside” the junta’s forces.\nRohingya armed groups working in concert with the military have recruited hundreds more men and boys in Myanmar itself.", "location": "Bangladesh", "classification": "security", "score": 0.7896503181994635, "event_breakdown": "* Militant groups recruiting Rohingya men and boys from Bangladesh\n* Rohingya diaspora groups accusing fighters of forcing Rohingya to flee\n* Arakan Army spokesperson accusing three groups of recruiting Rohingya from Bangladesh\n* Conscripts allegedly being taken for training in a Myanmar army base\n* Conscripts fighting alongside the junta’s forces"}, {"id": "", "title": "North Korean trash balloons are dumping  filth  on South Korea - Boston News , Weather , Sports", "date": "2024-05-29 13:00", "url": "https://whdh.com/news/north-korean-trash-balloons-are-dumping-filth-on-south-korea/", "message": "Seoul, South Korea (CNN) — North Korea has adopted a new strategy to contend with its southern neighbor: sending floating bags of trash containing “filth” across the border, carried by massive balloons.\n“All responsibility arising from the North Korean balloons lies entirely with North Korea, and we sternly warn North Korea to immediately stop its inhumane and low-level actions.”Local governments also sent messages to residents in the northern Gyeonggi and Gangwon provinces to warn of the “unidentified objects,” and advised against outdoor activities.\nFor decades, North Korea has been almost completely closed off from the rest of the world, with tight control over what information gets in or out.\nEarlier this year a South Korean research group has released rare footage that it claimed showed North Korean teenagers sentenced to hard labor for watching and distributing K-dramas.\nBut the situation in North Korea deteriorated in the following years and diplomatic talks fell apart – prompting strict rules to snap back into place in the North.", "location": "Seoul, South Korea", "classification": "security", "score": 0.636785326532664, "event_breakdown": "Security Events:\n\n1. North Korea has been sending floating bags of trash over the border into South Korea. The trash is contained in massive balloons.\n2. The South Korean government is blaming North Korea for the trash.\n3. The South Korean government has warned North Korea to stop sending the trash.\n4. The South Korean government has advised people in northern parts of the country to avoid outdoor activities because of the trash.\n5. Following rules being relaxed in the past, diplomatic talks have fallen apart in North Korea leading strict rules to snap back into place."}, {"id": "", "title": "Netanyahu To Troops :  This Is The Iron Wall Of The State Of Israel  – The Yeshiva World", "date": "2024-05-29 02:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2286476/netanyahu-to-troops-this-is-the-iron-wall-of-the-state-of-israel.html", "message": "Prime Minister Benjamin Netanyahu visited the IDF Northern District Intelligence Branch base on Tuesday, accompanied by Intelligence Branch Commander Maj.-Gen. Aharon Haliva and Unit 8200 Commander Brig.-Gen. Y.\nDuring his visit, the Prime Minister received a detailed briefing on the intelligence landscape and the threats in the northern sector.\nFollowing the briefing, Netanyahu visited a post on the northern border where he met with fighters from the Golani Brigade Reconnaissance Unit.\nI see the fire in your eyes and I would tell the citizens of Israel: This is the iron wall of the State of Israel.\nWell done.”The Prime Minister was joined by his Chief-of-Staff, Tzachi Braverman, National Security Council Director Tzachi Hanegbi, and his Military Secretary, Maj.-Gen. Roman Gofman.", "location": "Northern District Intelligence Branch base", "classification": "security", "score": 0.7913606912229129, "event_breakdown": ".\n* Prime Minister Benjamin Netanyahu visited the IDF Northern District Intelligence Branch base.\n* He received a briefing on the intelligence landscape.\n* Netanyahu met fighters from the Golani Brigade Reconnaissance Unit."}, {"id": "", "title": "West Michigan World War II veteran laid to rest 80 years after death", "date": "2024-05-29 03:30", "url": "https://wwmt.com/news/local/richard-kasten-wwii-laid-rest-battle-creek-world-war-two-80-years-death-air-force-france-dna-buried-remains-west-michigan-fort-custer-cemetery", "message": "After 80 years, U.S. Army Air Force 1st Lieutenant Richard J. Kasten, 24, of Kalamazoo, was laid to rest in Battle Creek Tuesday during a ceremony.\nLocal:On Jan. 21, 1944, Kasten's plane, known as an American heavy bomber, crashed near Lignières-Châtelain, killing four of its 11 crewmembers.\nGerman forces recovered three sets of remains from the crash, which were later interred in the French cemetery at Poix-de-la-Somme, according to the DPAA.\nAbout 75 years later in April 2019, DPAA historians and American Battle Monuments personnel exhumed the remains, including a set designated as X-411 St. Andre, from Suresnes American Cemetery, officials said.\nUsing anthropological analysis and mitochondrial DNA, scientists determined that the remains of X-411 belonged to Kasten, according to the DPAA.", "location": ".\nBattle Creek, Michigan", "classification": "security", "score": 0.5848998637332268, "event_breakdown": "* January 21, 1944: An American heavy bomber plane crashed near Lignières-Châtelain, France, killing four of its 11 crewmembers.\n* April 2019: Remains of American soldier Richard J. Kasten, who had been on the plane, were exhumed from Suresnes American Cemetery in France."}, {"id": "", "title": "National Geographic special tracks recovery of Tuskegee Airman plane from Lake Huron", "date": "2024-05-29 13:00", "url": "https://www.yahoo.com/news/national-geographic-special-tracks-recovery-120134104.html", "message": "The search for Moody's crashed World War II-era plane is explored in National Geographic's \"The Real Red Tails.\"\nNarrated by Sheryl Lee Ralph of ABC’s “Abbott Elementary,” the hourlong documentary gives a history of the Tuskegee Airmen, the first all-Black fighter squadron in the United States.\nNicknamed the Red Tails, they played a crucial role in defeating Hitler and preserving democracy in America.\nJames H. Harvey at the Tuskegee Airmen National Museum in Detroit in a scene from National Geographic's \"The Real Red Tails.\"\nToday, the Tuskegee Airmen National Museum and other groups continue to amplify just how important they were to the victory against Hitler’s forces.", "location": "DETROIT", "classification": "security", "score": 0.42771220753859046, "event_breakdown": "1. The Tuskegee Airmen: The first all-Black fighter squadron in the United States.\n2. WWII in America: The Germans had the upper hand over Europe, and Allied forces played a crucial role in preserving democracy in America.\n3. Red Tails: They were the first all-Black fighter squadron and played a vital role in defeating Hitler.\n4. The Search for Moody's Plane: During World War II, the Tuskegee Airmen's plane, piloted by Lawrence \"Lighthorse\" Moody, went missing.\n5. The Airplane Down: On Sept. 18, 1943, Moody and his fellow airmen flew a mission in North Africa. His B-24 Liberator bomber was struck by gunfire and went down, never to be seen again."}, {"id": "", "title": "North Korean trash balloons are dumping  filth  on South Korea", "date": "2024-05-29 13:30", "url": "https://saudigazette.com.sa/article/643183/World/North-Korean-trash-balloons-are-dumping-filth-on-South-Korea", "message": "SEOUL — North Korea has adopted a new strategy to contend with its southern neighbor: sending floating bags of trash containing “filth” across the border, carried by massive balloons.\n“All responsibility arising from the North Korean balloons lies entirely with North Korea, and we sternly warn North Korea to immediately stop its inhumane and low-level actions.”Local governments also sent messages to residents in the northern Gyeonggi and Gangwon provinces to warn of the “unidentified objects,” and advised against outdoor activities.\nThe move, according to North Korean state media KCNA, was to retaliate against South Korean activists who often send materials to the North – including propaganda leaflets, food, medicine, radios and USB sticks containing South Korean news and television dramas, all prohibited in the isolated totalitarian dictatorship.\nEarlier this year a South Korean research group has released rare footage that it claimed showed North Korean teenagers sentenced to hard labor for watching and distributing K-dramas.\nBut the situation in North Korea deteriorated in the following years and diplomatic talks fell apart – prompting strict rules to snap back into place in the North.", "location": "North Korea.", "classification": "security", "score": 0.6420288989930925, "event_breakdown": "Event 1: North Korea sends floating garbage bags to South Korea by balloons.\nEvent 2: South Korean warns citizens about possible unknown objects after North Korea's action.\nEvent 3: North Korea adopts new strategy with floating trash to retaliate against South Korea.\nEvent 4: South Korea admonishes North Korea for floating garbage."}, {"id": "", "title": "Israeli national security adviser says war will extend through 2024", "date": "2024-05-29 18:00", "url": "https://www.washingtonexaminer.com/news/world/3020598/israeli-national-security-adviser-war-through-2024/", "message": "Israel’s war against Hamas in Gaza will likely extend past the end of the calendar year, Israeli national security adviser Tzachi Hanegbi said Wednesday.\nIsraeli forces entered Gaza on Oct. 27, 2023, about three weeks after Hamas carried out the Oct. 7 terrorist attack that ignited the conflict.\nIsraeli forces began operations in the north and urged Palestinian civilians to flee south, which many did.\nSmoke rises following an Israeli airstrike east of Rafah, Gaza Strip on Monday, May 6, 2024.\n(AP Photo/Ismael Abu Dayyah)Over the weekend, Israeli forces launched an airstrike targeting two Hamas leaders in Rafah.", "location": "Gaza Strip", "classification": "security", "score": 0.8820637600372115, "event_breakdown": "* Hamas carries out a terrorist attack in Israel on Oct 7, 2023\n* Israeli forces enter Gaza on Oct 27, 2023\n* Israeli forces launch an airstrike targeting two Hamas leaders in Rafah on May 6, 2024"}, {"id": "", "title": "Surviving the Kharkiv Epicenter hypermarket attack : A firsthand account of terror and devastation", "date": "2024-05-29 15:30", "url": "https://www.yahoo.com/news/surviving-kharkiv-epicenter-hypermarket-attack-135600182.html", "message": "Read also: Kharkiv mall attack death toll reaches 18, five still missing\"Someone shouted that we had to get people out,\" says the Kharkiv resident.\nEarlier, on May 29, the Kharkiv Oblast Military Administration reported that another victim of the Epicenter attack had died, bringing the number of fatalities to 19.\nRussian strike on Kharkiv's Epicenter on May 25An explosion rocked a residential area in Kharkiv on May 25, at 4:02 p.m., Mayor Ihor Terekhov confirmed.\nLaw enforcement officers have identified 18 victims of the Russian attack, including a 12-year-old girl and her mother, the Prosecutor General's Office reported.\nThe number of deaths from the Russian strike increased to 19 people on May 29.", "location": "Kharkiv", "classification": "security", "score": 0.6282043113166955, "event_breakdown": "Russian strike on Kharkiv's Epicenter on May 25\nExplosion rocks residential area in Kharkiv"}, {"id": "", "title": "US - manufactured munition employed in lethal Rafah strike : Report", "date": "2024-05-29 18:45", "url": "https://tribune.com.pk/story/2468885/us-manufactured-munition-employed-in-lethal-rafah-strike-report", "message": "Fire rages following an Israeli strike on an area designated for displaced Palestinians, in Rafah in the southern Gaza Strip, May 26, 2024.\nVideos that show tents engulfed in flames following the strike on the “Kuwait Peace Camp 1” were geolocated.\nRead also: Israel’s killing of 45 at Rafah camp triggers global outrageIsraeli tanks were seen Tuesday advancing deeper into Rafah for the first time in Israel’s nearly eight-month war on Gaza, marking a new phase in its onslaught.\nThe strike occurred near the logistics base of the UN Agency for Palestinian Refugees (UNRWA) in Tal al-Sultan.\nVast swathes of Gaza lay in ruins amid a crippling blockade of food, clean water and medicine.", "location": "GAZA", "classification": "security", "score": 0.684976571201014, "event_breakdown": "1. Israeli strike on the \"Kuwait Peace Camp 1\"\n2. Israeli tanks moving into Rafah\n3. Israeli tanks advancing deeper into Rafah"}, {"id": "", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions", "date": "2024-05-29 18:45", "url": "https://www.baltimoresun.com/2024/05/28/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions/", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine.", "location": "NULL", "classification": "security", "score": 0.7584109719413954, "event_breakdown": "-South Korea says North Korea fired short-range projectiles into its waters on Wednesday\n-South Koreans have reported that North Korea has been firing your trash-carrying balloons at them since Tuesday night\n-North Korea said its new tactical guided weapons fired on Wednesday are 'a prompt, accurate, powerful this system for testing'\n-President Kim Jong Un is introduced the newly developed guided missile with features like the world's highest precision guidance and lowest tactical error\n-An analysis of North Korea's previous space rockets suggests that U.S. intelligence may not be prepared for nuclear-capable missiles."}, {"id": "", "title": "Giant Hole In Radar Coverage In Russia", "date": "2024-05-29 11:00", "url": "https://charter97.org/en/news/2024/5/29/596827/", "message": "Giant Hole In Radar Coverage In Russia 17 29.05.2024, 7:4530,050After the Ukrainian strikes.\nOver the past couple of months, Ukraine has disabled three of Russia's strategic radar systems.\nThe other day, Ukrainians hit the Voronezh-M radar of the Russian Armed Forces at a distance of 1.800 km, breaking the next record for attack range.\nThere is a huge radar hole thousands of kilometers away,\" the journalist said.\nHe specified that the radar station in Armavir, struck by Ukrainian UAVs, scanned a very large part of the territories in the Eastern Mediterranean up to the coast of Morocco.", "location": "Russia", "classification": "security", "score": 0.460956379328868, "event_breakdown": "Events:\n1. Ukrainian strikes hits Voronezh-M radar of Russian Armed Forces.\n2. Ukrainians hits 1.800 kilometers range of Voronezh-M radar.\n3. Ukrainians hits Voronezh-M radar of Armavir, about 1200 kilometers southeast of Moscow.\n4. Ukrainian UAVs strike Radar Station in Armavir.\n5. Radar Station of Armavir scanned a territories up to Morocco is Eastern Mediterranean.\n\nFor the title:\nUkrainian strikes on Voronezh-M radar in Armavir"}, {"id": "", "title": "U . S .- British Coalition Launches Airstrikes On Houthis In Yemen", "date": "2024-05-29 05:30", "url": "https://menafn.com/1108268592/US-British-Coalition-Launches-Airstrikes-On-Houthis-In-Yemen", "message": "(MENAFN- Nam News Network) SANAA, May 29 (NNN-SABA) – A warplane of the naval coalition of the United States and Britain, launched two airstrikes against Houthi targets in Yemen's Red Sea port city of Hodeidah, yesterday, Houthi-run al-Masirah TV reported.\nThe Houthi television said, the warplane hit the Al-Jabanah district in the western part of the city without revealing further details.\nAfter the airstrikes, the Houthi fighters cordoned off the area, which is near the port of Hodeidah.\nThe coalition has yet to comment, but it usually says it targeted missile and drone mobile launchers.\nLast Nov, the Houthis began to launch anti-ship ballistic missiles and drones targeting what they said were Israeli-linked ships transiting the Red Sea to show solidarity with Palestinians in the Gaza Strip.– NNN-SABA", "location": "Hodeidah", "classification": "security", "score": 0.6114768825206119, "event_breakdown": "Text:\nA warplane of the naval coalition of the United States and Britain launched two strikes against Houthi targets in Yemen's Red Sea port city of Hodeidah, according to Houthi-run al-Masirah TV.\nThe coalition has yet to comment on the airstrikes, but it usually says it targets missile and drone mobile launchers.– NNN/Agencies"}, {"id": "", "title": "JFK assassination investigating detective Elmer Boyd dead at 96", "date": "2024-05-29 09:15", "url": "https://nypost.com/2024/05/29/us-news/elmer-boyd-last-dallas-detective-to-investigate-jfk-assassination-took-lee-harvey-oswald-into-custody-dead-at-96/", "message": "The Sixth Floor Museum at Dealey Plaza“He was a true Southern gentleman and will be deeply missed.\nOur heartfelt condolences go out to the entire Boyd family.”Born in Blooming Grove outside of Dallas, Boyd joined the Dallas Police Department as a patrolman in May 1952 and was later promoted to a homicide and robbery detective in October 1957.\n11 Lee Harvey Oswald in a mug shot after he was arrested for assassinating President John F. Kennedy in Dallas.\nThat charge was added to the Warren Commission Report — the 888-page official government report that investigated the assassination of President Kennedy.\nIn 2023, Boyd donated his firearms, cowboy hat, and the handcuffs used on Oswald after his arrest to The Sixth Floor Museum in Dallas.", "location": "Dallas", "classification": "security", "score": 0.6976164940713437, "event_breakdown": "Security Events:\n1. Arrest of Lee Harvey Oswald in a mug shot\n2. Transfer of Lee Harvey Oswald\n3. Donation of firearms, cowboy hat, and handcuffs by William \"Bill\" F Boyd to The Sixth Floor Museum at Dealey Plaza"}, {"id": "", "title": "Israeli strikes kill at least 37 Palestinians , most in tents , near Rafah as offensive expands", "date": "2024-05-29 03:15", "url": "https://www.theday.com/nation/20240528/israeli-strikes-kill-at-least-37-palestinians-most-in-tents-near-rafah-as-offensive-expands/", "message": "Palestinians fleeing from the southern Gaza city of Rafah during an Israeli ground and air offensive in the city on Tuesday, May 28, 2024.\nIsraeli soldiers move on the top of a tank near the Israeli-Gaza border, as seen from southern Israel, Tuesday, May 28, 2024.\n(AP Photo/Abdel Kareem Hana)Palestinians flee from the southern Gaza city of Rafah during an Israeli ground and air offensive in the city on Tuesday, May 28, 2024.\n(AP Photo/Jehad Alshrafi)Displaced Palestinians inspect their tents destroyed by Israel's bombardment, adjunct to an UNRWA facility west of Rafah city, Gaza Strip, Tuesday, May 28, 2024.\n(AP Photo/Leo Correa)Palestinians fleeing from the southern Gaza city of Rafah during an Israeli ground and air offensive in the city on Tuesday, May 28, 2024.", "location": "GAZA CITY", "classification": "security", "score": 0.9083571207939853, "event_breakdown": "The security events described in the text are:\n\n1. Israeli ground and air offensive in Rafah, southern Gaza city, on Tuesday, May 28, 2024.\n2. Israeli soldiers moving on the top of a tank near the Israeli-Gaza border.\n3. Displacement of Palestinians in Gaza, and their tents being destroyed by Israel."}, {"id": "", "title": "International Outrage Over Israel Rafah Tent Massacre Has Not Slowed IDF Offensive", "date": "2024-05-29 00:15", "url": "https://www.yahoo.com/news/international-outrage-over-israel-rafah-234601749.html", "message": "Israeli forces bombed a displacement camp in Tal al-Sultan on Sunday night, engulfing the tents sheltering Palestinians in flames.\nThe Israeli attack killed at least 45 people and wounded hundreds more, and it resulted in condemnation and expressions of horror from many in the international community.\nThe shelling killed at least 21 people, more than half of them women and girls, according to the Gaza Health Ministry.\nA Palestinian boy cries next to the bodies of those killed in an Israeli attack Monday west of Rafah, Gaza.\nGaza medics say that even after Sunday’s massacre, Israel is still bombing Tal al-Sultan, killing 16 more Palestinians overnight.", "location": "GAZA", "classification": "security", "score": 0.9092933826427232, "event_breakdown": "Events:\nIsraeli Forces bomb Tal al-Sultan displacement camp in Gaza - 45 dead and hundreds injured\nAt least 21 killed in shelling of Tal al-Sultan, more than half of them women and girls\nSixteen more Palestinians killed in overnight bombings at Tal al-Sultan"}, {"id": "", "title": "Boeing gets $7 . 5 billion to build more of the smart bombs being withheld from Israel", "date": "2024-05-29 17:30", "url": "https://qz.com/boeing-contract-jdams-1851506696", "message": "Boeing just won a multi-billion-dollar contract from the U.S. government for so-called “smart” bombs.\n(The university’s supply chain management research center is named after Boeing, and it collaborates with the company on an engineering talent pipeline development program.)\nBoeing-converted and U.S.-supplied JDAMs are often used by the Israeli Defense Forces, often in areas populated heavily by civilians.\nThe Biden administration paused a delivery of more of them to deter an incursion into the Rafah area of the Gaza Strip.\nAdvertisementThe station also found that the company manufactured the largest number of so-called small diameter bombs supplied to the IDF.", "location": "Palestine", "classification": "security", "score": 0.8836582398133168, "event_breakdown": "Security Events:\n- Boeing wins a multi-billion-dollar contract from the U.S. government for \"smart\" bombs. This event is related to a locations: United States\n- Boeing-converted and U.S.-supplied JDAMs are often used by the Israeli Defense Forces. JDAMs stands for Joint Direct Attack Munitions. This event may be related to multiple locations: United States, Israel\n- The U.S. administration paused a delivery of more of Boeing-converted and U.S.-supplied JDAMs to deter an incursion into the Rafah area of the Gaza Strip. This event may be related to multiple locations: United States, Israel, Gaza Strip\n- The station also found that the company manufactured the largest number of so-called small diameter bombs supplied to the IDF. Small diameter bombs were supplied to the IDF, which stands for Israel Defense Forces This event is related to multiple locations: Israel"}, {"id": "", "title": "Police report reveals new details about stabbing at Braintree AMC theater during South Shore stabbing spree - Boston News , Weather , Sports", "date": "2024-05-29 17:30", "url": "https://whdh.com/news/police-report-reveals-new-details-about-stabbing-at-braintree-amc-theater-during-south-shore-stabbing-spree/", "message": "(WHDH) - New details emerged Wednesday about the stabbing attack that injured four girls at an AMC theater in Braintree over the weekend.\nThe incident in Braintree happened on Saturday as part of a larger stabbing spree and police chase.\nAccording to reports, Ravizza tried to enter the AMC theater but was stopped by a manager for not paying.\nAuthorities identified the Braintree stabbing victims as 9-year-old twins, their 17-year-old sister, and another 17-year-old girl.\nRavizza was arraigned on charges in connection with the Plymouth stabbing on Tuesday.", "location": "Braintree", "classification": "security", "score": 0.6222405163021101, "event_breakdown": "Security Events:\n\n- Stabbing Attack at AMC Theater in Braintree\n- Stabbing Spree\n- Police Chase\n- Attempted Entry Into AMC Theater Without Paying\n- Braintree Stabbing Victims\n- Plymouth Stabbing\n- Arraignment on Charges\n\nNote: These events are described in the text but are not directly related to each other in terms of location."}, {"id": "", "title": "Artillery : Missile Merchants of Israel", "date": "2024-05-29 07:30", "url": "http://www.strategypage.com/htmw/htart/articles/2024052901950.aspx", "message": "In 2023 Israel used Shavit to launch Ofek (Horizon) 13, the latest version of its Ofek surveillance satellites.\nOfek satellites have proved very reliable and are now built to recover from problems that often lead to the loss of satellites from other nations.\nFor example, in late 2016 Israel launched Ofek 11.\nIn addition to photo satellites, Israel also has a military-grade radar satellite called TekSar.\nIn 2021 Israel sold Vietnam a military surveillance satellite that Israel built and launched.", "location": "Israel", "classification": "security", "score": 0.5196085725217119, "event_breakdown": "1. Israel launches Ofek 13, the latest version of its Ofek surveillance satellites, using the Shavit launcher.\n2. Israel launches Ofek 11 in late 2016.\n3. In addition to photo satellites, Israel also has a military-grade radar satellite called TekSar.\n4. Israel sells Vietnam a military surveillance satellite that Israel built and launched in 2021."}, {"id": "", "title": "Palestinians flee Rafah as Israeli assault intensifies", "date": "2024-05-29 02:45", "url": "https://dunyanews.tv/en/World/814870-Palestinians-flee-Rafah-as-Israeli-assault-intensifies", "message": "Palestinians flee Rafah as Israeli assault intensifiesWorld World Palestinians flee Rafah as Israeli assault intensifiesHundreds braved roads in Rafah in south Gaza Tuesday as they fled Israel's expanding ground assault.\nRafah city on the Palestinian territory's southern border with Egypt has been under Israeli ground assault since early May.\nYasser Adwan, a 22-year-old resident of west Rafah, told AFP that \"Israeli drones targeted anyone moving or walking in the streets of Rafah\".\nYasser Adwan in west Rafah told AFP tanks had also taken up position \"on the Al-Awda roundabout in the centre of the city of Rafah\".\nThe UN Palestinian refugee agency, UNRWA, reported Tuesday that \"around one million people\" fled Rafah over the past three weeks.", "location": "RAFAH", "classification": "security", "score": 0.6168494960031943, "event_breakdown": "Ground assault, drones targeting, tanks taking up position."}, {"id": "", "title": "Israeli strikes kill at least 37 , most in tents , near Gaza Rafah", "date": "2024-05-29 11:15", "url": "https://www.naharnet.com:443/stories/en/305533-israeli-strikes-kill-at-least-37-most-in-tents-near-gaza-s-rafah", "message": "Israeli ground troops and tanks have been operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border.\n\"It was a night of horror,\" said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nOn Tuesday afternoon, an Israeli drone strike hit tents near a field hospital by the Mediterranean coast west of Rafah, killing at least 21 people, including 13 women, Gaza's Health Ministry said.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.\nThe fighting in Rafah has made it nearly impossible for humanitarian groups to import and distribute aid to southern Gaza.", "location": "GAZA CITY, GAZA.", "classification": "security", "score": 0.8876524382684636, "event_breakdown": "* Israeli ground troops and tanks operating in eastern Rafah, in central parts of the city, and along the Gaza-Egypt border\n* Israeli drone strike near a field hospital by the Mediterranean coast in Rafah, killing at least 21 people, including 13 women"}, {"id": "", "title": "Latest Israeli strikes kill at least 37 Palestinians", "date": "2024-05-29 02:00", "url": "https://www.stltoday.com/news/nation-world/israel-palestinians-gaza-rafah-hamas-airstrikes-kill-at-least-37/article_82f2342e-d57e-5673-b109-4a6c49cf9ff3.html", "message": "The tent camp inferno has drawn widespread international outrage, including from some of Israel’s closest allies, over the military’s expanding offensive into Rafah.\nThe Israeli military suggested Sunday's blaze in the tent camp may have been caused by secondary explosions, possibly from Palestinian militants' weapons.\n“It was a night of horror,” said Abdel-Rahman Abu Ismail, a Palestinian from Gaza City who has been sheltering in Tel al-Sultan since December.\nThe International Court of Justice has ordered Israel to halt its Rafah offensive as part of South Africa's case accusing Israel of committing genocide against the Palestinians in Gaza.\nMost of those living there had fled from the same neighborhood in Gaza City earlier in the war.", "location": "GAZA CITY", "classification": "security", "score": 0.948459002337291, "event_breakdown": "* The Israeli military's expanding offensive into Rafah\n* The tent camp inferno has drawn widespread international outrage, including from Israel's closest allies\n* The military's suggestion (though not conclusive) that the camp fire may have been caused by secondary explosions from Palestinian militants' weapons\n* The ordeal of Palestinians camping in Tel al-Sultan, who had to flee from another neighborhood in Gaza City earlier in the war.\n* The ICJ has ordered Israel to halt its Rafah offensive, as part of a case against Israel for committing genocide against Palestinians in Gaza."}, {"id": "", "title": "Israel shrugs off UNSC bid to  stop the killing  to continue Rafah assault | Gaza News", "date": "2024-05-29 11:15", "url": "https://www.aljazeera.com/news/2024/5/29/israel-shrugs-off-unsc-bid-to-stop-the-killing-to-continue-rafah-assault", "message": "Israel has continued its assault on Rafah, ignoring a draft resolution to the UN Security Council to “stop the killing” in the city in southern Gaza.\nPreviously, as it attacked targets in northern and central Gaza, Israel’s military had designated Rafah as a safe zone.\nUS President Joe Biden has joined the calls for Israel to refrain from launching a major military operation in Rafah.\n“We have not seen them smash into Rafah,” said National Security Council spokesman John Kirby.\nA civil defence official in Gaza said an Israeli strike on a displacement camp west of Rafah on Tuesday killed at least 21 people.", "location": "GAZA", "classification": "security", "score": 0.6538291471278048, "event_breakdown": "* Israel's attack on Rafah, southern Gaza\n* Draft UN Security Council resolution to “stop the killing” in Rafah\n* Israeli designation of Rafah as a safe zone during previous attacks\n* US President Joe Biden's call for Israel to refrain from launching a major military operation in Rafah\n* Israeli strike on a displacement camp west of Rafah, killing at least 21 people"}, {"id": "", "title": "Israel denies strike on camp near Rafah that Gaza officials say killed 21 people", "date": "2024-05-29 03:15", "url": "https://www.rappler.com/world/middle-east/israel-war-hamas-updates-may-29-2024/", "message": "The United States, Israel’s closest ally, reiterated its opposition to a major Israeli ground offensive in Rafah but said it did not believe such an operation was under way.\nAt least 12 of the dead on Tuesday were women, according to medical officials in the Hamas militant-run Palestinian enclave.\nThe Israeli military said its forces continued to operate in the Rafah area, without commenting on reported advances into the city center.\nHamas has said talks are pointless unless Israel ends its offensive in Rafah.\nMore than 36,000 Palestinians have been killed in Israel’s offensive, Gaza’s health ministry says.", "location": "GAZA", "classification": "security", "score": 0.8525847087289157, "event_breakdown": "- Israeli forces continued to operate in the Rafah area on Tuesday\n- Medical officials said at least 12 people on Tuesday were women\n- Israeli forces advanced into the city center according to sources, without commenting on the report"}, {"id": "", "title": "Israel denies strike on camp near Rafah that Gaza officials say killed 21 people", "date": "2024-05-29 02:45", "url": "https://www.asiaone.com/world/israel-denies-strike-camp-near-rafah-gaza-officials-say-killed-21-people", "message": "At least 12 of the dead on Tuesday were women, according to medical officials in the Hamas militant-run Palestinian enclave.\nThe Israeli military said its forces continued to operate in the Rafah area, without commenting on reported advances into the city centre.\nThe Israeli military said it was investigating the possibility that munitions stored near a compound targeted by Sunday's airstrike may have ignited and touched off the blaze.\nMore than 36,000 Palestinians have been killed in Israel's offencive, Gaza's health ministry says.\nALSO READ: Israeli attack on Rafah tent camp kills 45, prompts international outcry", "location": "GAZA", "classification": "security", "score": 0.848155332179748, "event_breakdown": "* Israeli airstrike on Rafah\n* Number of Palestinians killed in Israel's offensive\n* At least 12 of the dead on Tuesday were women"}, {"id": "", "title": "Arrests made in gel bead gun attacks Sunday in San Mateo", "date": "2024-05-29 02:15", "url": "https://www.mercurynews.com/2024/05/28/arrests-made-in-gel-bead-gun-attacks-sunday-in-san-mateo/", "message": "SAN MATEO – Three men were arrested in connection with a series of drive-by gel bead gun shootings over the weekend in San Mateo, police said.\nA second shooting happened an hour later in the 3300 block of Los Prados Street and a third shooting happened around 9 p.m. in the 700 block of Monte Diablo Avenue.\nPolice said the suspects shot the husband several times, drove away and returned to shoot him again, narrowly missing his eyes.\nInside the car, officers found three Hydro Strike Pulsar gel bead guns and a bottle of Gel-Tek gel beads, police said.\nThe occupants of the BMW – identified as a 19-year-old man and two 20-year-old men, all of San Mateo – were arrested and booked into San Mateo County jail on charges of assault with a deadly weapon and conspiracy to commit a crime, police said.", "location": "SAN MATEO", "classification": "security", "score": 0.9694435868605237, "event_breakdown": "Brief:\nShootings in San Mateo, CA, on Los Prados and Monte Diablo Avenue\nShooting in San Mateo, CA, injuring husband\nDrive-by shooting in San Mateo, CA\nThree suspects arrested in San Mateo, CA\nThree incidents of gel bead gun shootings in San Mateo reported by authorities."}, {"id": "", "title": "Saudi Arabia Accuses Israel of  Continuous Genocidal Massacres , Throwing Doubt on Biden Future Deal", "date": "2024-05-29 14:00", "url": "https://www.breitbart.com/middle-east/2024/05/29/saudi-arabia-accuses-israel-of-continuous-genocidal-massacres-throwing-doubt-on-deal/", "message": "Saudi Arabia accused Israel on Wednesday of committing “continuous genocidal massacres” against Palestinians, casting the Biden administration’s efforts to broker a “normalization” deal between Israel and Saudi Arabia in doubt.\nIn a statement, the Saudi Foreign Ministry — which has taken a tougher line toward Israel than Crown Prince Mohammed bin Salman (MBS) — accused Israel of deliberately targeting the tents of Palestinians in Gaza.\nAn Israeli investigation found that Hamas munitions, which may have been hit by shrapnel from the airstrike, likely caused fires.\nThe Biden administration has been trying to urge Israel to accept an end to the war in Gaza, and a Palestinian state, dangling the prospect of “normalization” with Saudi Arabia.\nIsraelis are opposed to a Palestinian state due to repeated terror attacks by Hamas from Gaza, which Palestinians controlled entirely after the Israeli “disengagement” of 2005.", "location": "GAZA", "classification": "security", "score": 0.43519104188170704, "event_breakdown": "Events:\n- Hamas (a Palestinian group) fire munitions at Israel from Gaza.\n- Israeli investigation of airstrike incident find out shrapnel of Hamas munitions caused fires on tents in Palestine.\n- Israel endorses a two-state solution with Palestine to end wars in Gaza.\n- Saudi Arabia opposes Israeli approach."}, {"id": "", "title": "Israeli minister says Netanyahu  failing , calls for elections", "date": "2024-05-29 18:45", "url": "https://www.yahoo.com/news/israeli-minister-says-netanyahu-failing-182458777.html", "message": "JERUSALEM (Reuters) - An Israeli cabinet minister accused Prime Minister Benjamin Netanyahu's coalition of \"failing miserably\" amid the Gaza war on Wednesday, prompting a rebuke from Netanyahu's Likud party as political divisions deepen.\nKnesset member Gadi Eisenkot, an observer in the war cabinet, said Netanyahu had failed on security and the economy and called for elections by year's end.\n\"It will take three to five years to stabilize [Gaza] and then many more years to build an alternative to Hamas.\"\nIsrael launched an air and ground offensive in Gaza last October vowing to destroy the Palestinian Islamist militant group Hamas.\nIn a statement on Telegram, the Likud party said Eisenkot and Israeli war cabinet minister Benny Gantz, Netanyahu's main challenger, were looking for excuses to quit the coalition at the height the war.", "location": "JERUSALEM", "classification": "security", "score": 0.5887742581991683, "event_breakdown": "* An Israeli cabinet minister accused Netanyahu's coalition of \"failing miserably\" amid the Gaza war on Wednesday\n* In October, Israel launched an air and ground offensive in Gaza to vow to destroy the Palestinian Islamist militant group Hamas"}, {"id": "", "title": "Israeli minister says Netanyahu  failing , calls for elections", "date": "2024-05-29 19:30", "url": "https://www.aol.com/israeli-minister-says-netanyahu-failing-182458132.html", "message": "JERUSALEM (Reuters) - An Israeli cabinet minister accused Prime Minister Benjamin Netanyahu's coalition of \"failing miserably\" amid the Gaza war on Wednesday, prompting a rebuke from Netanyahu's Likud party as political divisions deepen.\nKnesset member Gadi Eisenkot, an observer in the war cabinet, said Netanyahu had failed on security and the economy and called for elections by year's end.\n\"It will take three to five years to stabilize [Gaza] and then many more years to build an alternative to Hamas.\"\nIsrael launched an air and ground offensive in Gaza last October vowing to destroy the Palestinian Islamist militant group Hamas.\nIn a statement on Telegram, the Likud party said Eisenkot and Israeli war cabinet minister Benny Gantz, Netanyahu's main challenger, were looking for excuses to quit the coalition at the height the war.", "location": "JERUSALEM", "classification": "security", "score": 0.5887742581991683, "event_breakdown": "* Gaza War (October 2021): An Israeli air and ground offensive in Gaza launched last October vowing to destroy the Palestinian Islamist militant group Hamas."}, {"id": "", "title": "Sudan : Iran Intervention in Sudan Civil War Advances Its Geopolitical Goals - but Not Without Risks", "date": "2024-05-29 16:15", "url": "https://allafrica.com/stories/202405290557.html", "message": "But Tehran has received little coverage of its military intervention in another deadly conflict: Sudan's civil war.\nWhile the conflict in Sudan has gotten less global attention than those in Ukraine and Gaza, it is strategically significant for Tehran.\nIn 2014, Sudan closed Iran's cultural center and expelled its diplomatic officials for purportedly proselytizing Shiism in a predominantly Sunni country.\nMaking inroads in the HornThe civil war has provided an opportunity for Iran to correct course with Sudan.\nAnd unlike the wars in Syria and Ukraine, in Sudan, Tehran has found itself in the awkward position of supporting an adversary of Russia, which sponsors the RSF.", "location": "KASSAB, SUDANNA", "classification": "security", "score": 0.5965502727651846, "event_breakdown": "- In 2014, Sudan closed Iran's cultural center and expelled its diplomatic officials\n- Sudan's civil war has provided an opportunity for Iran to correct course with Sudan\n- In Sudan, Tehran has found itself in the awkward position of supporting an adversary of Russia"}, {"id": "", "title": "Warzone Season 4 patch notes : Increased player count , Tac - Sprint Boots , KAR - 98K", "date": "2024-05-29 15:00", "url": "https://www.destructoid.com/warzone-season-4-early-patch-notes-unlimited-tac-sprint-boots-rebirth-island-ranked-resurgence-more/", "message": "Decreased sprint speed to 5.8m/s, down from 6.2m/s.\nBAL-27Near-Mid Damage Range increased to 49.53 meters, up from 39.37.\nMid Damage Range increased to 60.96 meters, up from 50.8.\nHolger 556Near-Mid Damage Range increased to 50.8 meters, up from 45.72.\nNew Damage Range Added Mid Damage set to 25 Mid Damage Range set to 34.29 meters.", "location": "BAL-27Near-Mid Damage Range increased to 49.53 meters,", "classification": "security", "score": 0.847790489252277, "event_breakdown": "Security Events:\n\n1. Decreased sprint speed to 5.8m/s from 6.2m/s\n2. BAL-27 Near-Mid Damage Range increased to 49.53 meters, up from 39.37.\n3. Mid Damage Range increased to 60.96 meters, up from 50.8.\n4. Holger 556 Near-Mid Damage Range increased to 50.8 meters, up from 45.72.\n5. New Damage Range Added Mid Damage set to 25, Mid Damage Range set to 34.29 meters."}, {"id": "", "title": "China military shows off robot dogs during drills with Cambodia", "date": "2024-05-29 15:45", "url": "https://abc11.com/post/chinas-military-shows-off-robot-dogs-drills-cambodia/14886387/", "message": "China's military shows off robot dog with automatic rifle mounted on its backDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back, essentially turning man's best (electronic) friend into a killing machine.", "location": "CAMBODIA", "classification": "security", "score": 0.6245231558049479, "event_breakdown": "China's military shows off robot dog with automatic rifle mounted on its back during recent military drills with Cambodia."}, {"id": "", "title": "China military shows off robot dogs during drills with Cambodia", "date": "2024-05-29 14:45", "url": "https://abc7chicago.com/post/chinas-military-shows-off-robot-dogs-drills-cambodia/14886387/", "message": "China's military shows off robot dog with automatic rifle mounted on its backDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back.\nDuring recent military drills with Cambodia, China's military showed off a robot dog with an automatic rifle mounted on its back, essentially turning man's best (electronic) friend into a killing machine.", "location": "CAMBODIA", "classification": "security", "score": 0.6245231558049479, "event_breakdown": "1. Military drills with China and Cambodia\n2. Robot dog with automatic rifle on back"}, {"id": "", "title": "Noah Flora | The Nation", "date": "2024-05-29 16:00", "url": "https://www.thenation.com/authors/noah-flora/", "message": "In the Archive of the Filipino Revolution In the Archive of the Filipino RevolutionThe Revolution According to Raymundo Mata looks at a colony on the cusp of revolt and how historians influence the way these moments are remembered.\nJun 30, 2021 / Books & the Arts / Noah Flora", "location": "MANILA", "classification": "security", "score": 0.5259176087709552, "event_breakdown": "1. The Cry of Pugad Lawin\n2. The Tejeros Convention\n3. The Pact of Biak-na-Bato\n4. The Outbreak of the Philippine-American War\n5. The Battle of Manila (1899)\n6. The Battle of Calumpit (1899)\n7. The Battle of Aguinaldo Hill (1899)\n8. The Battle of Tirad Pass (1899)\n9. The Battle of San Juan del Monte (1899)\n10. The Battle of San Mateo (1899)\n11. The Battle of Zapote River (1899)\n12. The Battle of Pasay (1899)\n13. The Battle of Paye (1899)\n14. The Battle of Zapote Bridge (1899)\n15. The Battle of Caloocan (1899)\n16. The Battle of San Pedro Macati (1899)\n17. The Battle of San Francisco del Monte (1899)\n18. The Battle of Malate (1899)\n19. The Battle of Las Pinas (1899)\n20. The Battle of Cavite (1899)\n21. The Battle of Calumpit ("}, {"id": "", "title": "Indian Air Force Rafales Soar to Red Flag Alaska – Indian Defence Research Wing", "date": "2024-05-29 14:45", "url": "https://idrw.org/indian-air-force-rafales-soar-to-red-flag-alaska/", "message": "Indian Air Force Rafales Soar to Red Flag Alaska| BySOURCE: AFICREDIT IN IMAGEOn May 24th, a formidable force from the Indian Air Force (IAF) set off for Exercise Red Flag Alaska 24-2.\nAn Indian Air Force C-17A Globemaster III cargo aircraft, identified as CB-8008, provided crucial logistical support, while an Il-78MK Midair refueling aircraft), designated KJ-3450, ensured the long-range deployment could be achieved.\nTheir final destination: Eielson Air Force Base in Alaska, the heart of Red Flag-Alaska.\nRed Flag-Alaska is a premier multi-national combat training exercise designed to hone the skills of participating aircrews in a realistic and challenging environment.\nThe hallmark of Red Flag is its multi-service, multi-platform approach.", "location": "Eielson Air Force Base in Alaska", "classification": "security", "score": 0.7178215766015684, "event_breakdown": "Indian Air Force Rafale aircraft participate in Exercise Red Flag Alaska 24-2\nIndian Air Force aircraft provide logistical and mid-air refueling support to Indian Air Force aircraft participating in exercise Red Flag Alaska 24-2\nIndian Air Force aircraft fly to Eielson Air Force Base in Alaska, USA, to participate in Exercise Red Flag Alaska 24-2"}, {"id": "", "title": "National Security Council addresses terrorism , Gaza crisis", "date": "2024-05-29 08:15", "url": "https://www.hurriyetdailynews.com/national-security-council-addresses-terrorism-gaza-crisis-194053", "message": "National Security Council addresses terrorism, Gaza crisisANKARAThe National Security Council (MGK) meeting, chaired by President Recep Tayyip Erdoğan on May 28, drew attention to the activities of the PKK terrorists in Syria, stating that any attempt that threatens national security and the territorial integrity of the region will not be tolerated.\n“Any fait accompli in violation of our national security and the territorial integrity of our neighbors will not be given an opportunity,” the statement released after the MGK meeting said, drawing attention to the PKK's election scheme in Syria.\nIn defiance of a United Nations Security Council (UNSC) resolution, the PYD/YPG, an offshoot of the PKK terrorist organization, called for illegal local elections in Syria, where a civil war has been raging since 2011.\nThe four-hour-long meeting reiterated Türkiye’s determination to eliminate terrorist organizations that target the country’s national security and safety in the region.\nIsrael's offensive has killed more than 36,000 people in Gaza, mostly civilians, according to the Hamas-run territory's health ministry.", "location": "GAZA", "classification": "security", "score": 0.7833976874598441, "event_breakdown": "1. National Security Council addresses terrorism, Gaza crisis\n2. National Security Council draws attention to PKK terrorists in Syria\n3. National Security Council says any attempt that threatens national security and territorial integrity of the region will not be tolerated.\n4. Muslim Brotherhood's Egypt rejects report by Human Rights Council fact-finding mission on Gaza.\n5. Examine the statement of the National Security Council following the meeting.\n6. Muslim Brotherhood called upon the top UN rights body to hold a special session on the recent escalation in Israel and the Occupied Palestinian Territory to discuss the latest Israeli attacks on Palestinians in East Jerusalem and the violations of Al-Aqsa Mosque's sanctity.\n7. The Gaza Strip is enduring power cuts of up to 16 hours per day, after Israel reduced the 120 megawatts of power it supplies from the 12 megawatts previously.\n8. Israeli aggressions happend in violation of international law and decreed by UNSCR 338 and 465.\n9. Israel's crackdown on Palestinian demonstrators in East Jerusalem and the attack on the Al-Aqsa Mosque compound has triggered violence in Hamas-controlled Gaza.\n10. More than 36,000 people in Gaza were killed, mostly civilians."}, {"id": "", "title": "North Korean trash balloons are dumping  filth  on South Korea", "date": "2024-05-29 08:15", "url": "https://us.cnn.com/2024/05/29/asia/north-korea-trash-balloons-intl-hnk/", "message": "Seoul, South Korea CNN —North Korea has adopted a new strategy to contend with its southern neighbor: sending floating bags of trash containing “filth” across the border, carried by massive balloons.\nSouth Korean authorities said the balloons, which landed in several locations, were filled with \"filth and garbage.\"\n“All responsibility arising from the North Korean balloons lies entirely with North Korea, and we sternly warn North Korea to immediately stop its inhumane and low-level actions.”Local governments also sent messages to residents in the northern Gyeonggi and Gangwon provinces to warn of the “unidentified objects,” and advised against outdoor activities.\nKim compared North Korea’s actions to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets towards her nation.\nEarlier this year a South Korean research group has released rare footage that it claimed showed North Korean teenagers sentenced to hard labor for watching and distributing K-dramas.", "location": "South Korea", "classification": "security", "score": 0.775206047474794, "event_breakdown": "North Korean balloons with floating bags of trash and \"filth\" land in South Korea, critically injuring one person. South Korea blames North Korea for the incident."}, {"id": "", "title": "North Korean trash balloons are dumping  filth  on South Korea", "date": "2024-05-29 08:15", "url": "https://www.cnn.com/2024/05/29/asia/north-korea-trash-balloons-intl-hnk/", "message": "Seoul, South Korea CNN —North Korea has adopted a new strategy to contend with its southern neighbor: sending floating bags of trash containing “filth” across the border, carried by massive balloons.\nSouth Korean authorities said the balloons, which landed in several locations, were filled with \"filth and garbage.\"\n“All responsibility arising from the North Korean balloons lies entirely with North Korea, and we sternly warn North Korea to immediately stop its inhumane and low-level actions.”Local governments also sent messages to residents in the northern Gyeonggi and Gangwon provinces to warn of the “unidentified objects,” and advised against outdoor activities.\nKim compared North Korea’s actions to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets towards her nation.\nEarlier this year a South Korean research group has released rare footage that it claimed showed North Korean teenagers sentenced to hard labor for watching and distributing K-dramas.", "location": ")\nSeoul, South Korea", "classification": "security", "score": 0.775206047474794, "event_breakdown": "North Korean floating bags of trash full of “filth and garbage” sent towards its neighbor to the south"}, {"id": "", "title": "A Jewish veteran from London prepares to commemorate the 80th anniversary of the D - Day landings", "date": "2024-05-29 13:45", "url": "https://www.yahoo.com/news/jewish-veteran-london-prepares-commemorate-124901524.html", "message": "Mervyn Kersh D-Day veteran who fought in the Normandy Campaign, at his home in London, Monday, April 8, 2024.\nA Jewish veteran is preparing to commemorate the 80th anniversary of the D-Day landings.\nKersh will return to France next week for ceremonies marking the 80th anniversary of the D-Day landings and the Battle of Normandy that followed.\nGrowing up in a Jewish family in south London during the 1930s and ’40s, Kersh, now 99, was doubly motivated to defeat Adolf Hitler.\nThe French government in 2015 awarded Kersh the Legion d’Honneur, the country’s highest order of merit, for his participation in the Normandy campaign.", "location": "LONDON", "classification": "security", "score": 0.4370988083765444, "event_breakdown": "Events:\n* Mervyn Kersh D-Day veteran.\n* Mervyn Kersh fought in Normandy.\n* Mervyn Kersh awarded Legion d’Honneur.\n* Mervyn Kersh participated in Normandy Campaign."}]