[{"id": "f9748784-a6b2-42cc-a436-ac8b74936e17", "title": "GOP and Democrats revamp party platforms on Israel : What to know", "date": "2024-07-19 04:00", "url": "https://www.washingtonexaminer.com/news/campaigns/3089965/gop-democrats-revamped-party-platforms-israel/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "The document emphasizes a “strong, secure and democratic Israel is vital to the interests of the United States,” while also committing to Israel’s security and right to defend itself.\nSome progressive activists attempted to add a clause to the party platform, rejecting U.S. aid to Israel.\n“I think this platform is going to be the platform of the Democratic Party.\n“Obviously the Democratic platform has so much more content and depth,” Rayman said.\n[The Democrats] have proved over and over again over the last four years that they do not support Israel,” Basle said, speaking with the Washington Examiner in Milwaukee at the convention.", "location": "Milwaukee", "classification": "antisemitism", "score": 0.4369110082249452, "event_breakdown": "1. On September 16, 2020, during the Democratic National Convention, pro-Israel activists voiced their opposition to a platform that supported a Palestinian state.\n2. On September 5th, 2020, The Joe Biden Campaign and Jewish Democrats defended former vice president Joe Biden against charges of being secretly anti-Israel."}, {"id": "481eaa72-2740-48ed-b36a-09295176488c", "title": "UCL Responds to Jewish Chronicle on Marxism 2024 Festival", "date": "2024-07-19 09:30", "url": "https://www.miragenews.com/ucl-responds-to-jewish-chronicle-on-marxism-1279274/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "University College LondonIn response to an article published by the Jewish Chronicle on Thursday, July 18th, about alleged comments made at the recent Marxism 2024 festival, we are publishing the following statement, outlining our total and utter condemnation of antisemitism.\nA UCL spokesperson said: \"We are horrified by these reports of appalling and unacceptable comments made at the Marxism Festival and have reported these to the police.\nWe utterly condemn all forms of antisemitism and have made clear to our community that this will not be tolerated at UCL.\n\"We are urgently investigating a number of incidents that allegedly took place at the Marxism Festival on our property in breach of these terms.\n\"We urge anyone who experiences or witnesses any form of racism or other unacceptable behaviour at the university to report this to us.\"", "location": "London", "classification": "antisemitism", "score": 0.8192397116316442, "event_breakdown": "UCL launches investigation into antisemitism at recent Marxism festival"}, {"id": "50079947-e28f-45ef-837b-b7d817259f1e", "title": "Weekly roundup of world briefs", "date": "2024-07-19 14:45", "url": "https://www.heritagefl.com/story/2024/07/19/news/weekly-roundup-of-world-briefs/20260.html", "domain": "heritagefl.com", "domain_classification": "Unknown", "message": "Israel has said that aid arrives in Gaza and sits idly without nonprofits retrieving and distributing it.\nA 1987 graduate of Harvard who was born in Cambridge, Mass., she earned her legal degree at Georgetown University.\nBoth groups have organized anti-Israel protests around the country since the Hamas terrorist attacks in southern Israel on Oct. 7.\nCardin stated that “we are faced with the tragic reality that antisemitism is on the rise at an alarming pace around the world.\nThe diplomatic sources based the assessment on the response from Hamas officials following the airstrike.", "location": "Gaza", "classification": "antisemitism", "score": 0.8305241983537812, "event_breakdown": "The following current events of antisemitism have been reported in the provided text:\n\n* Israel aid arrives in Gaza but sits idly without distribution by nonprofits\n* Anti-Israel protests organized after terrorist attacks in southern Israel on Oct. 7\n* Diplomatic sources assess response to airstrike on Hamas officials\n* Rise in antisemitism around the world identified by Senator Ben Cardin"}, {"id": "e9d34465-e792-46eb-bf6e-8f099d160f2d", "title": "Adidas pulls  unacceptable  Bella Hadid shoe advertising campaign following Jewish anger", "date": "2024-07-19 16:45", "url": "https://www.telegraph.co.uk/world-news/2024/07/19/adidas-pulls-bella-hadid-shoe-campaign-palestinian-jewish/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Adidas has pulled a shoe campaign featuring the Palestinian model and Israel critic Bella Hadid after it caused anger among Jewish communities.\nMs Hadid has been a vocal critic of Israel’s occupation of Palestinian territories and has sparred with members of Israel’s government over the treatment of Palestinians.\nIn the advertisement, Ms Hadid is pictured wearing the retro red trainers and holding a bouquet of flowers.\nThe American Jewish Committee said Adidas was wrong to pick an allegedly “anti-Israel model” for its campaign.\n“For Adidas to pick a vocal anti-Israel model to recall this dark Olympics is either a massive oversight or intentionally inflammatory.", "location": "Palestine.\"", "classification": "antisemitism", "score": 0.4339060545569914, "event_breakdown": "Location: United States\nEvent: \nAdidas has pulled a campaign featuring the Palestinian model Bella Hadid after it caused anger among some Jewish communities. It has been alleged that the shoe company promoted an allegedly \"anti-Israel model\", angering some American Jewish groups."}, {"id": "d923fafe-bbe1-4b70-b3ba-1cdc0a237664", "title": "Notre Dame Religious Liberty Summit : Advocates Spotlight Growing Global Tensions", "date": "2024-07-19 20:15", "url": "https://www.weaa.org/news/2024-07-19/notre-dame-religious-liberty-summit-advocates-spotlight-growing-global-tensions", "domain": "weaa.org", "domain_classification": "Unknown", "message": "“As the leading Catholic research university in the world, the University of Notre Dame, and Notre Dame Law School, is proud to host you, and to facilitate these discussions,” Cole said.\nThe event was held in banquet facility inside the Notre Dame football stadium that is part of the student center.\nThe Notre Dame law students have representedU.S.\n2024 Notre Dame Prize for Religious LibertyThe law school also welcomedNazila Ghanea, United Nations special rapporteur on freedom of religion or belief, to accept the 2024 Notre Dame Prize for Religious Liberty.\nSeveral speakers said African Americans see religious liberty and religious freedom in different ways.", "location": "Notre Dame football stadium", "classification": "antisemitism", "score": 0.48258577023250454, "event_breakdown": "Antisemitism continues to be a pervasive problem worldwide. In recent times there have been the following incidents that can be mapped:\n1. In Ukraine, a nationalist march held in the city of Lviv featured a banner that read \"Jews out of Ukraine.\"\n2. In Russia, a man stabbed eight people in a supermarket, with the alleged perpetrator later identifying as a Nazi and converting to Islam.\n3. In Sweden, nationalists burned Malmö central and displayed a swastika on the building. It is reported that the incident has sparked several other attacks against Jews in Sweden and that Anadolu news agency has reported the attack as a sign of rising anti-Jewish sentiment in Sweden."}]