[{"id": "8678ba01-7f6d-4fb4-9e80-467b16f745b5", "title": "Russo - Ukraine War - 22 May 2024", "date": "2024-05-23 03:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-22.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe General Staff of the Armed Forces of Ukraine reported that Russian forces concentrated his efforts in the Kharkiv region, as well as on the Pokrovsky and Kurakhivsky directions.\nThe defense forces are aware of the Russian forces' plans and do whatever it takes to thwart them.\nThe situation is controlled by the Defense Forces, Ukrainian defenders give a decent cut.", "location": "Kharkiv", "classification": "security", "score": 0.820289406788462, "event_breakdown": "List of security events:\n- On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia.\n- Russian forces are concentrated in the Kharkiv region of northeast Ukraine.\n- Russian forces are focusing efforts on the Pokrovsky and Kurakhivsky directions."}, {"id": "b03426b9-9a90-472d-aaba-6b76b7ea2f9e", "title": "Ukrainian defence forces down Russian Su - 25 attack aircraft on Pokrovsk front – General Staff", "date": "2024-05-23 00:15", "url": "https://www.yahoo.com/news/ukrainian-defence-forces-down-russian-201842162.html", "message": "Ukrainian defence forces shot down a Russian Su-25 attack aircraft on the Pokrovsk front on 22 May.\nOn the Kharkiv front, there were eight Russian attacks in the vicinity of the villages of Lyptsi and Starytsia.\nSince the beginning of the day, the Russian forces have lost 87 personnel and 21 pieces of military equipment.\nOn the Kupiansk front, Ukrainian defence forces repelled 22 attacks.\nThe Ukrainian defence forces have held their positions.", "location": "Pokrovsk", "classification": "security", "score": 0.9709647529675586, "event_breakdown": "1. Ukrainian defence forces shot down a Russian Su-25 attack aircraft on the Pokrovsk front on 22 May.\n2. On the Kharkiv front, there were eight Russian attacks in the vicinity of the villages of Lyptsi and Starytsia.\n3. Since the beginning of the day, the Russian forces have lost 87 personnel and 21 pieces of military equipment.\n4. Ukrainian defence forces repelled 22 Russian attacks.\n5. The Russian forces have lost personnel and military equipment in the Kupiansk front."}, {"id": "4e526339-bdfc-46ef-a123-39ce8df61d2e", "title": "Israeli forces move deeper into Rafah in night of heavy battle", "date": "2024-05-23 03:15", "url": "https://www.chinadailyhk.com/hk/article/583861", "message": "Israeli army tanks are seen in the central Gaza Strip, May 18, 2024.\nA Palestinian man and his children sit in a destroyed room following the targeting or a residential building by an Israeli airstrike in Rafah in the southern Gaza Strip on May 22, 2024.\nThere has been no stopping of Israeli fire all night, from drones, helicopters, warplanes, and tanks... Tanks made a limited push southeast, still limited but they have advanced under heavy fire all night.\nPalestinians stand around a charred fishing boat that was hit by an Israeli airsrike on the Mediterranean coast of Rafah in the southern Gaza Strip on May 22, 2024.\nIn the central Gaza Strip town of Zawayda, an Israeli air strike killed seven people in one house, medics said.", "location": "-\nGAZA CITY, Gaza Strip", "classification": "security", "score": 0.987972295355058, "event_breakdown": ".\n* Israeli air strikes in the Gaza Strip\n* Tanks entering Rafah, a city in the southeastern Gaza Strip\n* An Israeli air strike in Zawayda, a central Gaza Strip town, killing seven people in one house"}, {"id": "2ac9814b-cbf2-4ffc-8ce8-b5b1179c6ec8", "title": "Austin Bay On PointOf Human Shields , and ICC Corruption", "date": "2024-05-23 03:15", "url": "http://www.strategypage.com/on_point/20240522222636.aspx", "message": "Writing as someone who has analyzed real-world air and artillery targets, human shields means Hamas intentionally places innocent human bodies between Israeli explosives and valid Hamas military targets.\nExpanded quote: \"They [Hamas] use [Palestinian human civilians] as human shields and they target civilians ... they target ours [Israeli civilians] and they hide behind theirs.\"\nOn Oct. 7, Hamas terrorists attacked Israel and killed some 1,200 Israeli human beings -- definitely mass murder.\nHostages become exceptionally valuable human shields, especially when the Israelis strike back.\nOr you kill Gaza residents -- see, Hamas Islamist extremists call Gaza residents \"involuntary martyrs.\"", "location": "Palestine", "classification": "security", "score": 0.9545209577838992, "event_breakdown": "1. Hamas uses innocent human bodies between Israeli explosives and valid military targets\n2. Hamas terrorists attacked Israel and killed 1,200 Israelis on Oct. 7\n3. Palestinians become valuable human shields when Israelis strike back\n4. We killed Gaza residents using Israeli Defence Forces\n5. Gaza residents become involuntary martyrs"}, {"id": "d2ff7f0a-410b-4246-bd4f-92618ba19f71", "title": "Operation Iron Swords", "date": "2024-05-23 03:15", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-22.htm", "message": "Operation Iron Swords - Day 229 - 22 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\n\"They say in the [Israeli forces] that this will take a lot of time, not one year, but years,\" Hanegbi added.\nThe terrorists who were eliminated were operating in the fields of rockets, operating drones and observing Israeli forces.\nAs part of the ongoing operation, the Israeli forces called for reinforcements to Jenin, as confirmed by local Palestinian media.\nThe Israeli forces continued their military operation and expanded throughout several neighborhoods in Jenin and its camp.", "location": "Jenin.", "classification": "security", "score": 0.6967630331288682, "event_breakdown": "Security Events:\n\n1. The Israeli security forces eliminated terrorist elements operating in the fields of rockets.\n2. Israeli forces eliminated terrorist elements operating drones.\n3. The Israeli security forces eliminated terrorist elements that were observing Israeli forces.\n4. The Israeli security forces called for reinforcements to Jenin.\n5. The Israeli forces carried out a military operation and expanded throughout several neighborhoods in Jenin and its camp."}, {"id": "45c7c842-cfc3-473e-838c-e3b747e487f3", "title": "Official : Poland weighs shooting down Russian missiles near border", "date": "2024-05-23 02:15", "url": "https://www.yahoo.com/news/official-poland-weighs-shooting-down-014636938.html", "message": "Poland is considering whether to involve its air defenses in shooting down Russian missiles over Ukrainian territory, Polish Foreign Ministry Spokesperson Pawel Wronski told Ukrinform on May 22.\nPresident Volodymyr Zelensky said in an interview with Reuters on May 20 that Western allies, including Poland, could intervene more directly in Ukraine's defense by shooting down Russian missiles.\nAccording to Wronski, the Polish government has been discussing the legal ramifications of shooting down Russian missiles since this incident.\nWronski clarified that Poland is not considering transferring any of its air defense units to Ukraine.\nThere is no possibility of the Polish air defence system being outside the country's borders,\" he said.", "location": "WARSAW, POLAND", "classification": "security", "score": 0.5600225178673772, "event_breakdown": "1. Poland is considering whether to involve its air defenses in shooting down Russian missiles over Ukrainian territory.\n2. Poland has been discussing the legal ramifications of shooting down Russian missiles since this event occurred.\n3. Poland is not considering transferring any of its air defense units to Ukraine."}, {"id": "ffae2e11-1894-4028-b7de-225b7a294939", "title": "Satirical joke about Mossad agent  Eli Kopter  behind Iranian president crash fools French TV analyst , Hamas", "date": "2024-05-23 04:00", "url": "https://www.yahoo.com/news/satirical-joke-mossad-agent-eli-013055056.html", "message": "\"People are saying the helicopter pilot was an Israeli Mossad Agent named Eli Kopter,\" the Hamas-affiliated Telegram channel \"Al-Qassam Correspondent\" said.\nThe disinformation from Hamas was then floated by a political analyst at i24 News France, who reported on the \"Hamas group\" addressing the rumors about \"Eli Kopter\" on the air.\nThey even provided his name: Eli Kopter.\nOne of the most popular accounts joking about Agent Eli Kopter is a satirical account called \"The Mossad\" on X.\nOriginal article source: Satirical joke about Mossad agent 'Eli Kopter' behind Iranian president's crash fools French TV analyst, Hamas", "location": "Israel", "classification": "security", "score": 0.5867071604237921, "event_breakdown": "* Security Event 1: Hamas-affiliate Telegram channel floated disinformation that helicopter pilot was an Israeli Mossad Agent named Eli Kopter.\n* Security Event 2: Political analyst reported that Hamas group addressed the rumors about 'Eli Kopter' on the air.\n* Security Event 3: 'The Mossad' on X satirical account joked about Eli Kopter being a Mossad Agent."}, {"id": "c4ff03d1-091f-4aa8-8c61-5aaab66fd347", "title": "Student protests , Hamas war , Vietnam war | Homeland Security Newswire", "date": "2024-05-23 03:45", "url": "https://www.homelandsecuritynewswire.com/dr20240522-student-anger-over-the-vietnam-war-erupted-into-violence-in-the-60s-a-terrorism-expert-explores-whether-the-same-coul", "message": "The wave of recent pro-Palestinian, student-led protests reminds me of another tense era in the U.S. that was also prompted by U.S. engagement in a foreign war – the Vietnam War in the late 1960s and early 1970s.\nAt least in the case of the Columbia University protests, about 29% of the people that New York police arrested were not affiliated with the school.\nThe wave of recent pro-Palestinian, student-led protests reminds me of another tense era in the U.S. that was also prompted by U.S. engagement in a foreign war – the Vietnam War in the late 1960s and early 1970s.\nStudents’ anger over the long-running U.S. war in Vietnam reached a boiling point on Aug. 28, 1968, at the Democratic National Convention in Chicago.\nMeanwhile, President Lyndon Johnson announced in March 1968 he would not seek reelection and was halting U.S. bombing operations in Vietnam.", "location": "Chicago, Illinois", "classification": "security", "score": 0.4163194361383497, "event_breakdown": "Here are the security-related events described in the text:\n\n1. Vietnam War protests at Columbia University, New York, in 1968 and 1970\n2. Democratic National Convention protests in Chicago, 1968"}, {"id": "5cb0e525-0f4a-466c-990a-2b69bdd0c13f", "title": "Satirical joke about Mossad agent  Eli Kopter  behind Iranian president crash fools French TV analyst , Hamas", "date": "2024-05-23 02:15", "url": "https://www.foxnews.com/media/satirical-joke-mossad-agent-eli-kopter-behind-iranian-presidents-crash-fools-french-tv-analyst-hamas", "message": "A French TV channel reported there was a \"rumor\" that Iranian President Ebraim Raisi was killed by Israeli agent \"Eli Kopter\" after jokes about the fictitious character went viral and fooled Hamas.\n\"People are saying the helicopter pilot was an Israeli Mossad Agent named Eli Kopter,\" the Hamas-affiliated Telegram channel \"Al-Qassam Correspondent\" said.\nThe disinformation from Hamas was then floated by a political analyst at i24 News France, who reported on the \"Hamas group\" addressing the rumors about \"Eli Kopter\" on the air.\nThey even provided his name: Eli Kopter.\nOne of the most popular accounts joking about Agent Eli Kopter is a satirical account called \"The Mossad\" on X.", "location": "Tel Aviv", "classification": "security", "score": 0.6914912252462228, "event_breakdown": "Events:\nPotential Iranian president killed by Israeli agent \"Eli Kopter\".\nTelegram channel warned that Israeli Mossad Agent Eli Kopter killed Iranian president.\nPolitical analyst floated Hamas' disinformation on air.\nHamas floated the disinformation rumor about Israeli agent \"Eli Kopter\" fooling them."}, {"id": "ebb4772c-1016-450f-b05e-c0c94e218880", "title": "  Everything is burning : Battles rage outside Kharkiv as Ukraine tries to hold back Russian advance", "date": "2024-05-23 00:45", "url": "https://kvia.com/news/us-world/cnn-world/2024/05/22/everything-is-burning-battles-rage-outside-kharkiv-as-ukraine-tries-to-hold-back-russian-advance/", "message": "Russia’s relentless onslaught has a key goal: If they take Lyptsi, then they can position artillery within range of Ukraine’s second city, Kharkiv, 20 minutes down the road.\n“They’re not sending just anyone into the assaults.”His stare lengthens when asked about what fortifications were in place before the surprise Russian attack.\nAt one position closer to the Russian border, the 92nd Assault Brigade showed CNN a Russian artillery gun, captured in the first days of the war, from which they are now firing French mortar shells.\nThe gun was partially hidden by a wire net, aimed at providing some protection from an attack drone.\nAttacks persisted in the distance however, keeping the city’s residents awake through violently loud nights, now amplified by the threat of Russian artillery edging closer.", "location": "LVTSI.", "classification": "security", "score": 0.8561941388173286, "event_breakdown": "Security events reported in this text are as follows:\n\n1. Russia's relentless onslaught in Ukraine, with a goal to take Lyptsi and establish artillery within range of Ukraine's second city Kharkiv.\n2. The use of Russian artillery guns to attack Ukraine's positions and capture French mortar shells in the first days of the war.\n3. The ongoing attacks by Russian forces on Ukraine's positions in Kharkiv, keeping the city's residents awake through violently loud nights.\n4. The threat of Russian artillery edging closer to Kharkiv, as evidenced by the presence of captured Russian artillery guns aimed at providing protection from attack drones."}, {"id": "0439f769-f6f1-4295-b759-bf59c3aed280", "title": "  Everything is burning : Battles rage outside Kharkiv as Ukraine tries to hold back Russian advance", "date": "2024-05-23 01:00", "url": "https://krdo.com/news/national-world/cnn-world/2024/05/22/everything-is-burning-battles-rage-outside-kharkiv-as-ukraine-tries-to-hold-back-russian-advance-2/", "message": "Russia’s relentless onslaught has a key goal: If they take Lyptsi, then they can position artillery within range of Ukraine’s second city, Kharkiv, 20 minutes down the road.\n“They’re not sending just anyone into the assaults.”His stare lengthens when asked about what fortifications were in place before the surprise Russian attack.\nAt one position closer to the Russian border, the 92nd Assault Brigade showed CNN a Russian artillery gun, captured in the first days of the war, from which they are now firing French mortar shells.\nThe gun was partially hidden by a wire net, aimed at providing some protection from an attack drone.\nAttacks persisted in the distance however, keeping the city’s residents awake through violently loud nights, now amplified by the threat of Russian artillery edging closer.", "location": "KHARKIV, UKRAINE", "classification": "security", "score": 0.8561941388173286, "event_breakdown": "Events:\n- Russian onslaught pushes closer to Lyptsi\n- Artillery guns positioned within range of Kharkiv, Ukraine's second city\n- Captured Russian artillery used by Ukrainians\n- Artillery nets used to partially hide guns from attack drones"}, {"id": "b3aa3db3-92e4-4eb4-ac49-33819131e370", "title": "  Everything is burning : Battles rage outside Kharkiv as Ukraine tries to hold back Russian advance", "date": "2024-05-23 00:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/22/everything-is-burning-battles-rage-outside-kharkiv-as-ukraine-tries-to-hold-back-russian-advance-2/", "message": "Russia’s relentless onslaught has a key goal: If they take Lyptsi, then they can position artillery within range of Ukraine’s second city, Kharkiv, 20 minutes down the road.\n“They’re not sending just anyone into the assaults.”His stare lengthens when asked about what fortifications were in place before the surprise Russian attack.\nAt one position closer to the Russian border, the 92nd Assault Brigade showed CNN a Russian artillery gun, captured in the first days of the war, from which they are now firing French mortar shells.\nThe gun was partially hidden by a wire net, aimed at providing some protection from an attack drone.\nAttacks persisted in the distance however, keeping the city’s residents awake through violently loud nights, now amplified by the threat of Russian artillery edging closer.", "location": "Kharkiv.", "classification": "security", "score": 0.8561941388173286, "event_breakdown": "Security Events:\n\n1. Russia’s relentless onslaught on Lyptsi to position artillery within range of Ukraine’s second city, Kharkiv.\n2. 92nd Assault Brigade using captured Russian artillery gun to fire French mortar shells.\n3. Russian artillery gun partially hidden by a wire net to protect against attack drones.\n4. Attacks persist in the distance keeping city residents awake.\n5. Threat of Russian artillery edging closer amplifies the already violent loud nights.\n6. Russian attack on Lyptsi to position artillery within range of Ukraine’s second city Kharkiv.\n7. 92nd Assault Brigade captured Russian artillery gun to fire French mortar shells."}, {"id": "3aaa8a92-ff67-4dc9-9f20-c6aa35a5572a", "title": "Editorial : Unacceptable Parity Between Hamas , Israel", "date": "2024-05-23 02:45", "url": "https://www.freepressjournal.in/analysis/editorial-unacceptable-parity-between-hamas-israel", "message": "Israel-Hamas War | File ImageThe seeming equivalence sought to be imposed by the International Criminal Court between the terrorist organisation Hamas and Israel Prime Minister Benjamin Netanyahu, to say the very least, is outrageous.\nWhatever be the excesses and collateral damage of Israel’s armed action against Hamas following its October 7 massacre of innocents in Israel, it does not warrant parity between the two.\nWhile conceding that Israel had the right to protect its citizens, the ICC charge said that Netanyahu’s action against Hamas involved “starvation as a method of war”.\nBesides, the other petro-dollar-rich Arab nations were unwilling to shelter the Gaza civilians till IDF waged a war to the finish against Hamas.\nThat Israel is not a signatory of the Rome Declaration setting up ICC further absolves its leaders from obeying its dictate.", "location": "GAZA", "classification": "security", "score": 0.7527099820735902, "event_breakdown": "* Israel-Hamas War\n* October 7 massacre of innocents in Israel\n* Israel's armed action against Hamas following the massacre\n* ICC charge against Benjamin Netanyahu\n* ICC accusation that Netanyahu’s use of action against Hamas involved “starvation as a method of war”\n* Other petro-dollar-rich Arab nations’ unwillingness to shelter Gaza civilians"}, {"id": "8c88bca2-7d3b-46a2-a137-149e2e8f2eae", "title": "Ukrainian forces shoot down another Russian Su - 25 aircraft", "date": "2024-05-23 03:45", "url": "https://www.yahoo.com/news/ukrainian-forces-shoot-down-another-021439461.html", "message": "Ukrainian troops destroyed a Russian Su-25 attack aircraft near Pokrovsk in Donetsk Oblast on May 22, the General Staff of Ukraine's Armed Forces said in an operational update.\nThis is the fifth Russian Su-25 jet that Ukraine has shot down this month.\nThe Soviet-designed Su-25, nicknamed \"Frogfoot\" by NATO, is a heavily armored ground-attack aircraft that provides close air support for Russian ground troops.\n\"According to available information, Ukrainian troops destroyed a Russian Su-25 attack aircraft,\" the General Staff reported.\nThe General Staff said on May 18 that Russia has lost over 350 planes since the launch of the full-scale invasion.", "location": "Pokrovsk, Donetsk Oblast", "classification": "security", "score": 0.6413204928742225, "event_breakdown": "Event 1: Ukrainian troops destroyed a Russian Su-25 attack aircraft near Pokrovsk in Donetsk Oblast on May 22.\nEvent 2: The General Staff reported that this is the fifth Russian Su-25 jet Ukraine has shot down this month."}, {"id": "7c70f2a2-1e2e-42d4-96ae-86a459cc978f", "title": "The World Daily Brief : Spain , Ireland , and Norway will officially recognize Palestinian statehood", "date": "2024-05-23 00:15", "url": "https://www.baltimoresun.com/2024/05/22/the-world-daily-brief-spain-ireland-and-norway-will-officially-recognize-palestinian-statehood/", "message": "International NewsGazaSpain, Ireland, and Norway announced that they will officially recognize Palestinian statehood next Tuesday.\nREAD MOREDRCAnglo-French oil producer Perenco announced that its Congolese subsidiary, Muanda International Oil Company, discovered oil off the coast of DRC in the Moke-East well.\nREAD MOREAfghanistanTurkish Airlines relaunched regular flights to Kabul’s international airport, which the Taliban quickly renamed Kabul International Airport after it took over in 2021 (it was previously Hamid Karzai International Airport).\nREAD MOREThe World Daily Brief is composed daily by former CIA and Intelligence officers.\nArmstrong Williams (www.armstrongwilliams.com; @arightside) is a political analyst, syndicated columnist and owner of the broadcasting company, Howard Stirk Holdings.", "location": ".\nGaza", "classification": "security", "score": 0.5652394671280181, "event_breakdown": "Here are the security-related events from the text:\n\nGaza: Three countries (Spain, Ireland, and Norway) announced that they will recognize Palestinian statehood next week.\n\nDRC: Anglo-French oil producer Perenco announced that its subsidiary, Muanda International Oil Company, discovered oil off the west coast of the Democratic Republic of the Congo in the Moke-East well.\n\nAfghanistan: Turkish Airlines relaunched regular flights to Kabul’s international airport, which the Taliban quickly renamed Kabul International Airport after it took over in 2021 (it was previously Hamid Karzai International Airport)."}, {"id": "a59e7269-8201-4b31-8704-9c87b661f605", "title": "Robin Givhan : Amid worldwide outrage and red tape , court questions Israel moral compass", "date": "2024-05-23 03:15", "url": "https://www.independent.ie/opinion/comment/robin-givhan-amid-worldwide-outrage-and-red-tape-court-questions-israels-moral-compass/a477248572.html", "message": "The International Criminal Court (ICC) is seeking arrest warrants for high-ranking members of Hamas and the Israeli government, charging that they have committed war crimes and crimes against humanity.\nThose offences, as detailed in a statement by prosecutor Karim Khan, include the taking of hostages, sexual violence and torture, all instigated by three named members of Hamas during the October 7 attack on Israel.\nThe alleged crimes committed by Israeli prime minister Benjamin Netanyahu and defence minister Yoav Gallant include using the starvation of civilians as a form of warfare and intentionally directing attacks against a civilian population.", "location": "Palestine", "classification": "security", "score": 0.8840737982458389, "event_breakdown": "Here are the security events mentioned in the text:\n\n1. Alleged war crimes perpetrated by Hamas members during the October 7 attack on Israel, including the taking of hostages, sexual violence and torture\n2. Alleged war crimes committed by Israeli prime minister Benjamin Netanyahu and defence minister Yoav Gallant, including the intentional directing of attacks against a civilian population and the starvation of civilians as a form of warfare"}, {"id": "8a8f9905-7b44-41c2-9f59-3e9a445d167b", "title": "Gaza , media : 8 morti in raid Israele su campo profughi Nuseirat", "date": "2024-05-23 04:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/gaza-media-8-morti-in-raid-israele-su-campo-profughi-nuseirat-nl9w47bd", "message": "ROMA, 23 MAG - L'agenzia di stampa palestinese Wafa afferma che otto persone sono morte e diverse altre sono rimaste ferite in un bombardamento israeliano che stanotte ha colpito una casa del campo profughi di Nuseirat, nel centro della Striscia di Gaza.\nLa maggior parte delle vittime sono donne e bambini, specifica la Wafa.\nE il bilancio potrebbe aumentare, riferiscono fonti mediche locali.\nDal 7 ottobre nell'enclave palestinese ci sono stati almeno 35.709 morti e 79.990 feriti, secondo il Ministero della Sanità locale gestito dal movimento islamista Hamas.", "location": "GAZA", "classification": "security", "score": 0.9449642103279311, "event_breakdown": "1. The Israeli army bombed a refugee camp in Nuseirat, central Gaza Strip, at night, killing eight people and wounding several others.\n2. Victims are reported to be mostly women and children.\n3. The death toll could rise, according to reports from local hospitals.\n4. At least 35,709 people have been killed and 79,990 injured in the Palestinian enclave since October 7, according to the local Ministry of Health, operated by Islamist movement Hamas."}, {"id": "bc76b230-2773-40f6-bb1e-4e4b23d7a120", "title": "Israel furious as European trio recognises Palestinian state", "date": "2024-05-23 04:00", "url": "https://myrepublica.nagariknetwork.com/news/israel-furious-as-european-trio-recognises-palestinian-state/", "message": "Israel charged that the move amounts to \"rewarding terrorism\" after Palestinian militant group Hamas launched its October 7 attack which sparked the Gaza war.\nForeign Minister Israel Katz charged that \"the twisted step of these countries is an injustice to the memory of the 7/10 victims\".\n- 'Essential step -According to the Palestinian Authority, which rules parts of the occupied West Bank, 142 of the 193 UN member countries already recognise a Palestinian state.\nThe Palestine Liberation Organisation, seen internationally as the sole legitimate representative of the Palestinian people, hailed the European moves as \"historical\".\nThe militants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.", "location": "GAZA CITY", "classification": "security", "score": 0.8648973929078397, "event_breakdown": "* Hamas launched an attack on October 7 which sparked the Gaza war\n* Palestinian militant group Hamas took 252 hostages in the attack\n* 124 of the hostages remain in Gaza, including 37 that Israel says are dead\n* 142 of 193 UN member countries recognise a Palestinian state"}, {"id": "4c862664-1696-40d1-9220-e0ae37ad54d0", "title": "Israel Pushes Into Heart Of Rafah Amid Criticism From Biden Administration", "date": "2024-05-23 03:15", "url": "https://www.worthynews.com/95600-israel-pushes-into-heart-of-rafah-amid-criticism-from-biden-administration", "message": "by Emmitt Barry, Worthy News Correspondent(Worthy News) – The Israel Defense Forces (IDF) announced on Wednesday that their forces have made significant progress in their conflict with Hamas.\nMeanwhile, the Biden Administration continues to criticize Israel’s military operation in Gaza.\nThe IDF reported destroying rocket launchers aimed at Israel throughout Rafah.\nAdditionally, Politico reported that Israel has destroyed only 65 percent of Hamas’ vast network of underground tunnels, which the group has used to carry out attacks.\nBiden Administration officials are now publicly criticizing Israel’s strategy in Gaza, calling it self-defeating and likely to facilitate Hamas’ return.", "location": "GAZA", "classification": "security", "score": 0.6310701918666637, "event_breakdown": "* The Israel Defense Forces and Hamas are locked in a conflict in Gaza\n* The IDF has made significant progress in destroying Hamas rocket launchers\n* Israel also has destroyed 65% of Hamas' underground tunnels\n* The Biden administration is publicly criticizing Israel's operation in Gaza"}, {"id": "f7ffb101-2cd9-4523-ba05-73cff9341d34", "title": "Russia - Ukraine war : List of key events , day 818", "date": "2024-05-23 02:15", "url": "https://www.aljazeera.com/news/2024/5/23/russia-ukraine-war-list-of-key-events-day-818", "message": "Russia handed six more Ukrainian children – aged from six to 17 – to Kyiv in a deal brokered by Qatar, Russia’s TASS news agency reported.\nUkraine has accused Moscow of forcibly deporting thousands of Ukrainian children from occupied territories to Russia.\nRussian patriotic bloggers expressed anger over the arrest of Major General Ivan Popov, the former commander of Russia’s 58th army, who was detained for “large-scale fraud”.\nPopov was sacked last July after he criticised army leaders and raised concerns about the high casualty rate in Ukraine.", "location": "Ukraine", "classification": "security", "score": 0.6494598788441512, "event_breakdown": ".\n* Six Ukrainian children were handed over to Kyiv in a deal brokered by Qatar and Russia\n* Ukraine has accused Moscow of forcibly deporting thousands of Ukrainian children from occupied territories to Russia.\n* The arrest of the Russian former commander of 58th army, Major General Ivan Popov, for “large-scale fraud”."}, {"id": "af74ca6e-cd3e-47a0-8255-059bd3dc61c7", "title": "Violent night in Charlotte : 2 shootings and serious stabbing with two crimes connected", "date": "2024-05-23 03:00", "url": "https://www.wbtv.com/2024/05/23/violent-night-charlotte-2-shootings-serious-stabbing-with-two-crimes-connected/", "message": "CHARLOTTE, N.C. (WBTV) - A violent day in Charlotte as investigators are dealing with three serious crimes.\nPolice say at the very least two of these crimes are directly connected, and they’re checking to see if the third one is related as well.\nPolice investigating both crimes say these two are related, although how wasn’t readily apparent.\nBut I posed the question to police, if two of the crimes were related, could the homicide also somehow be tied in as well?\n“We wouldn’t rule it out, we couldn’t rule it out until we did the full investigation we couldn’t say yeah or nay if they were related,” Tellis said.", "location": "Charlotte", "classification": "security", "score": 0.6185104211450382, "event_breakdown": ".\n- Violent day in Charlotte\n- Two violent crimes -tied\n- Homicide\n- Check to see if homicide related"}, {"id": "aa14cb2d-a2d1-44a4-9925-9003bfc20a79", "title": "9 Investigates : In the Line of Fire – WSOC TV", "date": "2024-05-23 01:30", "url": "https://www.wsoctv.com/lineoffire/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "USA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Security Events:\n- Attempt to access website from outside the United States."}, {"id": "fc42e7b2-7900-4535-aa82-1bc2afa62641", "title": "Man Charged with Stabbing at Anaheim Business", "date": "2024-05-23 04:45", "url": "https://mynewsla.com/crime/2024/05/22/man-charged-with-stabbing-at-anaheim-business/", "message": "A 44-year-old Garden Grove man is facing attempted murder charges for a stabbing attack in Anaheim earlier this month, police said Wednesday.\nGilbert David Marquez was charged last week with attempted murder with sentencing enhancements for the personal use of a deadly weapon and inflicting great bodily injury on the victim.\nMarquez was accused of stabbing the man at a business in the 400 block of South Euclid Street on May 1, police said.\nPolice responded to a hospital at about 6 a.m. that day regarding the victim, authorities said.\nThe defendant was arrested Friday in downtown Anaheim, police said.", "location": "Anaheim", "classification": "security", "score": 0.45322509536549405, "event_breakdown": "* May 1: Stabbing attack in Anaheim, California, United States.\n* May 1: Victim of the stabbing attack hospitalized.\n* May 6: Suspect Gilbert David Marquez arrested and charged with attempted murder."}, {"id": "dc75fe13-8f76-475c-8007-ad535728bf3e", "title": "Middle East Crisis update : Israel recalls three European ambassadors over Palestine support", "date": "2024-05-23 03:15", "url": "https://www.dailymaverick.co.za/article/2024-05-23-israel-recalls-three-european-envoys-over-palestine-support-houthis-have-weapons-that-can-reach-mediterranean-sea/", "message": "Norway and Spain have also recognised Palestine, and Israel has recalled its ambassadors from all three European nations.\nIsrael recalls Ireland, Norway, Spain envoys over PalestineIsrael recalled its ambassadors to Ireland, Norway and Spain after they announced they would recognise a Palestinian state.\n“Israel will not be complacent against those who undermine its sovereignty and endanger its security,” Foreign Minister Israel Katz said on Wednesday in a statement.\nAround 140 nations already recognise a Palestinian state, but very few in Europe have.\n“A Palestinian state is a prerequisite for achieving peace in the Middle East,” he said.", "location": "PALESTINE", "classification": "security", "score": 0.4426230571539929, "event_breakdown": ".\n* Norway and Spain have recognized Palestine.\n* Israel has recalled its ambassadors from all three nations."}, {"id": "06d1977a-f6a7-49d5-8bcb-6941a7386fd0", "title": "Montreal Police Arrest Muslim Suspect In Connection With Shots Fired At Yeshiva Gedolah Of Montreal", "date": "2024-05-23 04:45", "url": "https://www.theyeshivaworld.com/news/general/2285217/montreal-police-arrest-muslim-suspect-in-connection-with-shots-fired-at-yeshiva-gedolah-of-montreal.html", "message": "A 20-year-old suspect, Abdirazak Mahdi Ahmed, was arrested and charged on Wednesday in connection with shots fired at a Jewish school in the Côte-des-Neiges—Notre-Dame-de-Grâce borough last fall.\nThis incident was the second shooting at the yeshiva in just four days, following shots fired at it and the Talmud Torah on St-Kevin Ave. overnight.\nThe week prior, Molotov cocktails were thrown at a shul and Jewish community center in the West Island.\nEta Yudin of The Centre for Israel and Jewish Affairs released a statement applauding police for the arrest.\n“This attack marked a significant change in the threats experienced by the Jewish community in Quebec since Oct. 7 and well before,” Yudin said.", "location": "Côte-des-Neiges—Notre-Dame-de-Grâce", "classification": "security", "score": 0.7622707361195554, "event_breakdown": "* October 7, 2021: First shots were fired at a yeshiva in the Côte-des-Neiges—Notre-Dame-de-Grâce borough for four days.\n* October 3, 2021: Molotov cocktails were thrown at a shul and Jewish community center in the West Island\n  * October 7, 2021: A man has been arrested for the gunshots at the yeshiva in the Côte-des-Neiges—Notre-Dame-de-Grâce borough"}, {"id": "424bb5a6-1856-46ad-8130-4a0a8b203945", "title": "Morale : Dig We Must to Prevent PTSD", "date": "2024-05-23 05:30", "url": "https://www.strategypage.com/htmw/htmoral/articles/2024052301453.aspx", "message": "These included more breaks from combat, better living conditions in the combat zone and prompt treatment when PTSD was detected.\nThis extended their useful time in combat before PTSD, also known as bad morale, set in.\nFor the troops PTSD is just another injury and not a disorder.\nFor example, there were 47,359 combat deaths in Vietnam, which represented 81.4 percent of the military deaths in Vietnam.\nSome civilians thought air-conditioned sleeping quarters for combat troops, and lots of other amenities in base camps, was simply indulgent.", "location": "Based on the text provided, I was unable to identify a specific location.", "classification": "security", "score": 0.8515462628447457, "event_breakdown": "Security Events in the Text:\n\n1. 47,359 combat deaths in Vietnam\n2. Air-conditioned sleeping quarters for combat troops\n3. Better living conditions in base camps\n4. Prompt treatment of PTSD in troops\n5. Treatment as an Injury vs Disorder\n6. Extended useful time in combat before PTSD sets in"}, {"id": "1c017f99-0e55-4602-97c3-468bcf52822c", "title": "12 people injured after Russian shelling in Kharkiv", "date": "2024-05-23 05:30", "url": "https://www.euronews.com/2024/05/23/12-people-injured-after-russian-shelling-in-kharkiv", "message": "By Euronews12 people have been injured after Russian shelling in Kharkiv, while in the Ukrainian village of Rig, two people have been killed and several more buried under rubble - including a ten year old boy.\nADVERTISEMENT12 people have been injured as a result of an airstrike on Kharkiv on Wednesday after Russians launched two glider munitions at the city.\nOne hit a business in the west of the city, while one woman with an acute stress reaction sought medical attention.\nTwo dead in Donetsk, 10 year old boy buried under the rubbleTwo have been killed and two wounded after a Russian shelling on the village of Rig in the Pokrovska community in the Donetsk region.\nThe hit buried a 10-year-old boy in the rubble, and killed his parents, who were also in residence a the time.", "location": "Kharkiv", "classification": "security", "score": 0.9695449653513061, "event_breakdown": "Security Events:\n- 12 people injured in Kharkiv after Russian shelling\n- 2 people killed, 10 year old boy buried after Russian shelling in Rig village, Donetsk"}, {"id": "01bb4854-41dc-424e-80f5-bfa433c4a4a4", "title": "Lockerbie Verdict Vindicates Continued Sanctions Against Libya", "date": "2024-05-23 09:00", "url": "https://www.heritage.org/africa/report/lockerbie-verdict-vindicates-continued-sanctions-against-libya", "message": "The outcome of the Lockerbie bombing trial underscores the need for a firm U.S. policy toward Libyan dictator Muammar Qadhafi.\nThe U.N. Security Council imposed sanctions on Libya in 1992 because of Qadhafi's refusal to extradite the two Libyans accused of organizing the Lockerbie bombing.\nThe Clinton Administration's priority in agreeing to the Lockerbie trial arrangements was to rehabilitate Libya rather than to pursue justice.\nAll of these should be maintained, including the 1996 Iran and Libya Sanctions Act, which penalizes foreign oil companies that invest in the oil and gas industries of Libya or Iran.\nAlthough Libya sacrificed one of its intelligence agents in the Lockerbie trial, it did so to lift sanctions that threatened Qadhafi's rule.", "location": "Lockerbie bombing", "classification": "security", "score": 0.588566145976278, "event_breakdown": "Security events in the text:\n\n- Lockerbie bombing\n- U.N. sanctions on Libya\n- U.S. policy toward Qadhafi\n- Clinton Administration and Lockerbie trial\n- Iran and Libya Sanctions Act"}, {"id": "a946dee9-18f0-4fff-bf31-b0065f84a00e", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 09:00", "url": "https://www.ksat.com/news/2024/05/23/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n(AP Photo/Leo Correa)The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.8412835034178089, "event_breakdown": "* The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25."}, {"id": "29e6e990-571e-4baf-8998-e7eb221b80c3", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 09:00", "url": "https://www.clickorlando.com/news/2024/05/23/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n(AP Photo/Leo Correa)The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "-\nWEST BANK", "classification": "security", "score": 0.8412835034178089, "event_breakdown": "1. Israeli military conducted an operation in the occupied West Bank.\n2. Israeli military operation killed 12 Palestinians and wounded 25.\n3. The Palestinian Health Ministry said the Israeli military completed an operation on May 12 and May 13 in the occupied West Bank.\n4. The International Court of Justice is also considering allegations of genocide that Israel has strenuously denied."}, {"id": "562cf04d-517b-40f4-b6f9-5ae3c72c10b2", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation – Winnipeg Free Press", "date": "2024-05-23 08:45", "url": "https://www.winnipegfreepress.com/world/2024/05/23/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\nThe Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n12 PALESTINIANS KILLED IN ISRAEL’S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.8421258330004427, "event_breakdown": "1- Israel military conducted an operation in the West Bank for 2 days, resulting in 12 Palestinians being killed and 25 were wounded.\n2- The International Court of Justice is considering genocide allegations against Israel which it has strenuously denied."}, {"id": "4a4cf0b9-d8ed-4444-8941-7f292fd2e69e", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation | iNFOnews", "date": "2024-05-23 09:00", "url": "https://infotel.ca/newsitem/ml-mideast-tensions-the-latest/cp1023801505", "message": "The Latest | 12 Palestinians killed and 25 wounded in Israel's 2-day West Bank operationPalestinians place the body of the doctor Ossayed Kamal Jabareen on a CT scan before his funeral at the government hospital in the West Bank city of Jenin, Thursday, May 23, 2024.\nThe Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "West Bank", "classification": "security", "score": 0.8772194977086489, "event_breakdown": "The West Bank is the scene of frequent Israeli military raids targeting suspected Palestinian fighters and activists.\nPalestinians say Israel is violating international law by occupying land and imposing harsh restrictions on their movements.\nThe Israeli raid has prompted widespread international condemnation, with the United Nations calling it a violation of international law.\nThe Israeli government says the raids are necessary to stop Palestinian violence.\nIn Washington, a State Department official condemned the \"unacceptable violence\" and called for an \"immediate halt\" to the raids.\nIn the Gaza Strip, Hamas, the Islamic militant group that controls the territory, says Israel is committing genocide against the Palestinian people.\nThe International Court of Justice in the Hague is considering allegations of genocide that Israel has strenuously denied.\nThe Israeli military said Thursday it has completed a two-day operation in the West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25."}, {"id": "c9de78c8-c459-46b3-8aac-71f512d2a7d0", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 09:30", "url": "https://www.wdio.com/front-page/world-national/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\nThe Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n12 PALESTINIANS KILLED IN ISRAEL’S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.8421258330004427, "event_breakdown": "Here are the security events from the text:\n\n1. Israeli operation in the West Bank resulting in the deaths of 12 Palestinians and wounding 25.\n\nNote: The text does not mention a specific location for the events, so I cannot provide that information."}, {"id": "797cd414-0522-41df-ac13-78ae6d24c5dd", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 08:30", "url": "https://www.yahoo.com/news/missile-splashes-red-sea-causing-075747512.html", "message": "(AP Photo)DUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": ".\nThe main event takes place in the southern Red Sea near the crucial Bab el-Mandeb Strait", "classification": "security", "score": 0.7706265336522016, "event_breakdown": "Security Events from text:\n- Houthi rebels attacked a missile in the water of the Red Sea on Thursday. (location: Red Sea)\n- A Possible attack from Houthi rebels on commercial vessel in the southern Red Sea near Bab el-Mandeb Strait. (location: southern Red Sea)\n- Houthi rebels also shooting down U.S. surveillance drones in recent weeks, they didn't claim the previous attack. (location: Red Sea)\n- The tempo of Houthi attack has dropped recently. (location: Red Sea)"}, {"id": "c13b8909-e5bb-49b7-8267-dadb6753935d", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:00", "url": "https://www.aol.com/missile-splashes-red-sea-causing-075747079.html", "message": "DUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": ".\nThe primary location where the missile splashed down in the waters of the Red Sea is the southern Red Sea near the Bab", "classification": "security", "score": 0.7706265336522016, "event_breakdown": "Event 1: A missile splashed down in the waters of the Red Sea.\nEvent 2: A passing commercial vessel appears to have sustained no damage in the attack.\nEvent 3: The attack likely was carried out by Yemen's Houthi rebels.\nEvent 4: The attack happened near the crucial Bab el-Mandeb Strait."}, {"id": "426e9ce2-a23d-467e-9df5-4f4256fe4458", "title": "Missile Splashes into the Red Sea , Causing No Damage in Latest Suspected Yemen Houthi Rebel Attack", "date": "2024-05-23 09:00", "url": "https://www.newsmax.com/world/globaltalk/yemen-houthi-rebels-israel-hamas-red-sea/2024/05/23/id/1165812/", "message": "DUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.7706265336522016, "event_breakdown": "Security Events from the Text:\n1. A missile splashed down in the waters of the Red Sea;\n2. A commercial vessel was reportedly not damaged by a missile that was splashed down in the waters of the Red Sea;\n3. The United Kingdom Maritime Trade Operations center reported that the attack happened near the crucial Bab el-Mandeb Strait;\n4. Shipping through the Red Sea and Gulf of Aden has been in decline due to the threat of sabotage bombs, mines, and alleged weapons shipments."}, {"id": "0091aecb-5f92-40fa-8817-ca0d061257d9", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:00", "url": "https://www.startribune.com/missile-splashes-into-the-red-sea-causing-no-damage-in-latest-suspected-yemen-houthi-rebel-attack/600368066/", "message": "DUBAI, United Arab Emirates — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.7706265336522016, "event_breakdown": "1 - Houthi rebels in Yemen likely launched a missile attack on a commercial vessel in the southern Red Sea near the crucial Bab el-Mandeb Strait (or near to it by context). \n\n2 - The United Kingdom Maritime Trade Operations center said that there was a missile splash down in the waters of the Red Sea (this may also be the event from event 1).\n\n3 - Houthi rebels did not immediately claim the attack, which likely means that a governorate of the government of Iran did not take this move, but that it was a natural Houthi rebel move."}, {"id": "537bbcd6-65fe-48eb-8f9f-a7b5cdcb41ad", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:00", "url": "https://www.ksat.com/news/world/2024/05/23/missile-splashes-into-the-red-sea-causing-no-damage-in-latest-suspected-yemen-houthi-rebel-attack/", "message": "(AP Photo)DUBAI – A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nRecommended VideosThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.7329054511776454, "event_breakdown": "1. Houthi rebels likely carried out a missile attack in the Red Sea on Thursday.\n2. The attack caused no damage to a passing commercial vessel.\n3. The Houthis did not immediately claim the attack.\n4. The attack happened in the southern part of the Red Sea near the crucial Bab el-Mandeb Strait.\n5. Shipping through the Red Sea and Gulf of Aden has declined because of the threat.\n6. In recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones."}, {"id": "38e3c5e8-e3e8-48ed-8dc2-8a2f2bd39a2f", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:00", "url": "https://www.clickorlando.com/news/world/2024/05/23/missile-splashes-into-the-red-sea-causing-no-damage-in-latest-suspected-yemen-houthi-rebel-attack/", "message": "(AP Photo)DUBAI – A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nRecommended VideosThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "NULL", "classification": "security", "score": 0.7329054511776454, "event_breakdown": "Security events:\n- Houthi rebels fired a missile at a passing commercial vessel in the Red Sea, south of the crucial Bab el-Mandeb Strait.\n- British military's United Kingdom Maritime Trade Operations center issued an alert about the missile.\n- Houthis did not immediately claim the attack, though couple of hours or days may pass."}, {"id": "b0553a4a-3eb6-4790-b205-e5b6e5c2c84e", "title": "12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 09:30", "url": "https://www.sunstar.com.ph/network/12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nMore than 400 people have been killed in Lebanon since Israel and Hezbollah began exchanging fire the day after the latest war in Gaza began.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\nAt least 35,000 Palestinians have been killed, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.\nIsrael launched its war in Gaza after Hamas’ Oct. 7 attack in which militants stormed into southern Israel, killed about 1,200 people — mostly civilians — and abducted about 250.", "location": "GAZA", "classification": "security", "score": 0.9225402053365401, "event_breakdown": "Events:\n- Israel launched war in Gaza on June 28 after Hamas' Oct. 7 attack in which militants killed about 1,200 people, mostly civilians, and abducted about 250.\n- Lebanese people killed in Palestine while Israel and Hezbollah exchange grib fire.\n- 35,000 Palestinians killed, Gaza Health Ministry no distinguishes between combatants and civilians"}, {"id": "d2b91a26-18a9-4277-ba87-90660c0d75c6", "title": "Russians Shelled Sumy Region Thirty Times During Day", "date": "2024-05-23 06:15", "url": "https://menafn.com/1108247921/Russians-Shelled-Sumy-Region-Thirty-Times-During-Day", "message": "(MENAFN- UkrinForm) During the day, Russians fired thirty times at Sumy regionThis was reported in the Telegram of the Sumy Regional Military Administration (RMA), Ukrinform reports.\n\"During the day, the Russians fired 30 times at the border areas and settlements of the Sumy region.\nEsman community: mortar shelling was recorded (6 explosions).\nBilopilska community: tank shelling (5 explosions), artillery shelling (17 explosions), mortar shelling (3 explosions) and the dropping of VOG ammunition from a UAV (5 explosions),\" the RMA reported.\nAs Ukrinform reported, on 21 May, Russians fired a missile at the town of Konotop.", "location": "Sumy region", "classification": "security", "score": 0.9576387722071981, "event_breakdown": "specific terms\n- Russians fired thirty times at Sumy region.\n- Esman community: mortar shelling recorded (6 explosions).\n- Bilopilska community: tank shelling (5explosions), artillery shelling (17 explosions), mortar shelling (3 explosions) and VOG ammunition (being dropped from a UAV, 5 explosions)."}, {"id": "ef7b0b58-984d-4d9c-a607-9827a708dd90", "title": "Israeli Forces Move Deeper into Rafah in Night of Heavy Battle", "date": "2024-05-23 09:00", "url": "https://chronicle.lu/category/international-news/49876-israeli-forces-move-deeper-into-rafah-in-night-of-heavy-battle", "message": "Israel's assault on Rafah on Gaza's southern edge has set hundreds of thousands of people fleeing in what had been a refuge for half of the enclave's 2.3 million people.\nIts troops have been slowly moving into the eastern outskirts of Rafah since the start of the month.\n\"Tanks made a limited push southeast, still limited but they have advanced under heavy fire all night,\" he told Reuters via a chat app.\nThere was no immediate word from the Israeli military on Rafah.\nIn the central Gaza Strip town of Zawayda, an Israeli air strike killed seven people in one house, medics said.", "location": "GAZA STRIP", "classification": "security", "score": 0.6668420567629275, "event_breakdown": "* Israel has assaulted Rafah on Gaza's southern edge.\n* Its troops have been moving into the eastern outskirts of Rafah since the start of the month.\n* Tanks have made a limited push to the southeast in Rafah under heavy fire all night.\n* Seven people were killed in an Israeli air strike in Zawayda, a central Gaza Strip town."}, {"id": "ed3e63ff-9ae4-4222-8c68-57b009454be7", "title": "Ukraine war live updates : Russia Belgorod region comes under nighttime attack ; Norway blocks entry for most Russian tourists", "date": "2024-05-23 07:45", "url": "https://www.nbcdfw.com/news/business/money-report/ukraine-war-live-updates-russias-belgorod-region-comes-under-nighttime-attack-norway-blocks-entry-for-most-russian-tourists/3548730/", "message": "Russian attack on Kharkiv city injures five, official saysA Russian attack on the northeastern city of Kharkiv has injured at least five people, the regional governor said Thursday.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nThe offensive is aimed at capturing the entire Kharkiv region and to create a \"buffer zone\" to protect Russian border regions, like Belgorod, from attack, Russia says.\n— Holly EllyattRead CNBC's previous live coverage here:Russia denies wanting to redraw Baltic Sea border; Moscow’s tactical nuclear weapons drills send a warning to the West", "location": "Kharkiv", "classification": "security", "score": 0.8617060474661496, "event_breakdown": "These are the security events described:\n- A Russian attack on the northeastern city of Kharkiv.\n- The fourth arrest of a high-ranking defense figure since April."}, {"id": "78e5c4b4-f89a-4909-a89c-ce249c753f03", "title": "Asia - Pacific Stealth Fighter and Bomber Industry Assessment", "date": "2024-05-23 09:30", "url": "https://www.globenewswire.com/news-release/2024/05/23/2887066/0/en/Asia-Pacific-Stealth-Fighter-and-Bomber-Industry-Assessment-2025-2035-Geopolitical-Tensions-and-Military-Sophistication-Prioritize-Investments-Hypersonic-Threats-Highlight-Stealth-.html", "message": "Dublin, May 23, 2024 (GLOBE NEWSWIRE) -- The \"Asia-Pacific Assessment of Stealth Fighter and Bomber Market: Focus on Application and Country - Analysis and Forecast, 2025-2035\" report has been added to ResearchAndMarkets.com's offering.\nThe need for enhanced range and mission endurance is a key driver fueling the assessment of the stealth fighter and bomber market.\nThe Asia-Pacific (APAC) region is witnessing a robust assessment of the stealth fighter and bomber market driven by evolving security dynamics and modernization efforts.\nAs a result, the APAC region presents lucrative opportunities for manufacturers and suppliers in the stealth fighter and bomber market.\nThe favored strategy for the companies has been merger and acquisition to strengthen their position in the assessment of stealth fighter and bomber market.", "location": "APAC", "classification": "security", "score": 0.8587610516470539, "event_breakdown": "* Evolving security dynamics in the Asia-Pacific (APAC) region are driving the demand for stealth fighters and bombers.\n* Modernization efforts in the APAC region are also contributing to the assessment of the stealth fighter and bomber market."}, {"id": "45268d30-d1c4-4c99-9b97-06a0f0aa26f7", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:15", "url": "https://toronto.citynews.ca/2024/05/23/missile-splashes-into-the-red-sea-causing-no-damage-in-latest-suspected-yemen-houthi-rebel-attack/", "message": "DUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen’s Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military’s United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.7936024474694432, "event_breakdown": "Events:\n- Houthi rebels likely attacked a commercial vessel on Thursday, December 9, 2021. A missile was reported to splash down in the waters of the Red Sea near the Bab el-Mandeb Strait.\n- The attack was not immediately claimed by the Houthis.\n- The attack took place in the southern Red Sea, as declared by the maritime United Kingdom Maritime Trade Operations center.\n- Although shipping through the Red Sea and Gulf of Aden has dropped, it's unclear exactly how the attack will affect traffic in the region."}, {"id": "bef5dd86-8279-4feb-8426-0940fa0fb785", "title": "Netzach Yehuda soldiers carry out focused operation in Beit Hanoun", "date": "2024-05-23 07:45", "url": "https://www.israelnationalnews.com/news/390418", "message": "IDF troops are continuing activities in the area.\nIn cooperation with the IAF, the troops struck numerous terror targets, including an anti-tank launch post, a military compound, and sniper posts.\nMoreover, IDF troops identified a terrorist opening fire at the troops from a nearby military compound and directed an IAF aircraft that targeted and eliminated the terrorist upon identification.\nShortly afterward, an additional terrorist was identified opening fire at IDF troops from the same compound.\nThe troops directed a fighter jet that struck the compound and eliminated the terrorist.", "location": "GAZA CITY.", "classification": "security", "score": 0.9662479721060524, "event_breakdown": "Security Events:\n\n- IDF troops struck several terror targets, including an anti-tank launch post, a military compound, and sniper posts.\n- A terrorist was identified and eliminated after opening fire at IDF troops from a nearby military compound.\n- Another terrorist was identified after opening fire at IDF troops from the same military compound, and the fighter jet struck the compound to eliminate the terrorist."}, {"id": "d0acd802-7358-43b5-a407-3ed2f674a11c", "title": "Ukraine war live updates : Russia Belgorod region comes under nighttime attack ; Norway blocks entry for most Russian tourists", "date": "2024-05-23 08:15", "url": "https://www.nbcsandiego.com/news/business/money-report/ukraine-war-live-updates-russias-belgorod-region-comes-under-nighttime-attack-norway-blocks-entry-for-most-russian-tourists/3522097/", "message": "Russian attack on Kharkiv city injures five, official saysA Russian attack on the northeastern city of Kharkiv has injured at least five people, the regional governor said Thursday.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nThe offensive is aimed at capturing the entire Kharkiv region and to create a \"buffer zone\" to protect Russian border regions, like Belgorod, from attack, Russia says.\n— Holly EllyattRead CNBC's previous live coverage here:Russia denies wanting to redraw Baltic Sea border; Moscow’s tactical nuclear weapons drills send a warning to the West", "location": "Kharkiv", "classification": "security", "score": 0.8617060474661496, "event_breakdown": "Here is the list of security events:\n1. Russian attack on northeastern city of Kharkiv\n2. Detention of high-ranking defense figure, Deputy Defense Minister Timur Ivanov, in April\n3. Detention of another high-ranking defense figure in April"}, {"id": "81139ee2-4acc-4c4b-914b-a2bf61e4d227", "title": "Ukraine war live updates : Russia Belgorod region comes under nighttime attack ; Norway blocks entry for most Russian tourists", "date": "2024-05-23 09:00", "url": "https://www.nbcmiami.com/news/business/money-report/ukraine-war-live-updates-russias-belgorod-region-comes-under-nighttime-attack-norway-blocks-entry-for-most-russian-tourists/3318215/", "message": "Russian attack on Kharkiv city injures five, official saysA Russian attack on the northeastern city of Kharkiv has injured at least five people, the regional governor said Thursday.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nIt is the fourth arrest of a high-ranking defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\nThe offensive is aimed at capturing the entire Kharkiv region and to create a \"buffer zone\" to protect Russian border regions, like Belgorod, from attack, Russia says.\n— Holly EllyattRead CNBC's previous live coverage here:Russia denies wanting to redraw Baltic Sea border; Moscow’s tactical nuclear weapons drills send a warning to the West", "location": "Kharkiv", "classification": "security", "score": 0.8617060474661496, "event_breakdown": ".\n-Russia denies wanting to redraw the Poland-Belarus border, which it says would destabilize the region.\n-Russia's nuclear forces concluded a training exercise that sent a warning to the West, military officials said.\n-Russia attacked Ukraine earlier this month, which led to a series of military events.\n-A Russian offensive in the northeastern city of Kharkiv injured at least five people after the fourth arrest of a high-rank defense figure since April, when Deputy Defense Minister Timur Ivanov was placed in pre-trial detention for suspected bribe-taking.\n\nThese security events have caused tensions and increased the possibility of conflict between Russia and other nations in the area."}, {"id": "90c84443-6ab0-49f1-b833-2efece0561d7", "title": "Israel to Restart Gaza Talks After Hostage Video Sparks Outrage", "date": "2024-05-23 09:30", "url": "https://www.yahoo.com/news/israel-restart-gaza-talks-hostage-083222676.html", "message": "(Bloomberg) -- Israel said it would revive stalled cease-fire talks with Hamas after social media video showing female Israeli soldiers being abducted by the militants on Oct. 7 sparked a public outcry.\nThe women, who Israel confirmed are military personnel, were kidnapped when Hamas invaded Israel and killed 1,200 people.\nThe attack triggered an Israeli military response that’s destroyed much of Gaza and killed more than 35,000 Palestinians.\nIn a statement, Hamas said the video showed “deliberate distortions” and dismissed the women’s injuries as “something to be expected.” The statement didn’t address the talks.\nMost Read from Bloomberg Businessweek©2024 Bloomberg L.P.", "location": "Gaza", "classification": "security", "score": 0.5490107989173141, "event_breakdown": "1. Hamas invades Israel and kills 1,200 people.\n2. Israel destroys the infrastructure of Gaza.\n3. More than 35,000 Palestinians die.\n4.  PM Naftali Bennett approved the temporary halt in Israeli air strikes over Gaza to reinstate a fragile cease-fire that has been in place since 2014, during which Hamas does not respond to Israel.\n5. Hamas takes four soldier hostage and shares a video of the incident on social media."}, {"id": "3017f4ec-153c-4879-8b64-9320c6747830", "title": "How India can improve its military mobility : The foremost winning factor", "date": "2024-05-23 08:15", "url": "https://www.firstpost.com/opinion/how-india-can-improve-its-military-mobility-the-foremost-winning-factor-13774126.html", "message": "AdvertisementFor companies manufacturing military hardware such as armour vehicles, artillery guns, earthmovers, and military vehicles, it is very important for them to design equipment that conforms to military standards of shape and size and is pliable for obilisation.\nEVs shall revolutionise and off-set the power generation in combat; however, in military combat, this may take some time.\nThe air mobility, rail mobility, and road mobility pallets have to be configured by the industry for rapid mobilisation.\nMilitary vehicles need positioning and tracking systems that are secure.\nFuture military vehicles will invariably have drone companions built in to act as guides, surveillance buddies, and logistic support systems.", "location": "INDIA", "classification": "security", "score": 0.4954789842263879, "event_breakdown": "Security events:\n1. Design equipment that conforms to military standards of shape and size.\n2. Design equipment that is pliable for obilisation.\n3. Design rail mobility pallets for rapid mobilisation.\n4. Design air mobility pallets for rapid mobilisation.\n5. Design road mobility pallets for rapid mobilisation.\n6. Design systems that allow for secure positioning and tracking of military vehicles.\n7. Integrate drone companions into future military vehicles to act as guides, surveillance companions, and logistic support systems."}, {"id": "a60739c1-1696-4ccd-8641-a75e3298c274", "title": "Israeli forces kill dozens of Palestinians as they push deeper in Gaza north and south", "date": "2024-05-23 09:30", "url": "https://www.swissinfo.ch/eng/israeli-forces-kill-dozens-of-palestinians-as-they-push-deeper-in-gaza", "message": "Israeli forces kill dozens of Palestinians as they push deeper in Gaza’s north and southreuters_tickers3 minutesBy Nidal al-MughrabiCAIRO (Reuters) – Israeli forces killed 35 Palestinians in aerial and ground bombardments across the Gaza Strip on Thursday and battled in close combat with Hamas-led militants in areas of the southern city of Rafah, health officials and Hamas media said.\nIsraeli tanks advanced in Rafah’s southeast, edged towards the city’s western district of Yibna and continued to operate in three eastern suburbs, residents said.\n“The occupation (Israeli forces) is trying to move further to the west, they are on the edge of Yibna, which is densely populated.\nMoreover, the troops located and dismantled a number of terror tunnel shafts and launchers in the area, and eliminated several terrorists during close-quarters encounters,” the Israeli military statement added.\nSince then, Israel’s assault in Gaza has killed more than 35,000 people, with thousands more feared buried under the rubble, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.962703343514868, "event_breakdown": "Israeli forces killed 35 Palestinians in aerial and ground bombardments across the Gaza Strip. Israeli forces battled in close combat with Hamas-led militants in Rafah, in the southern Gaza Strip. Israeli tanks advanced in Rafah's southeast, edged towards Yibna in the west, and in three eastern suburbs."}, {"id": "e1762fe7-7f29-4a02-9301-3e3f70fa095b", "title": "Ukraine war live updates : Latest news on Russia and the war in Ukraine", "date": "2024-05-23 07:45", "url": "https://www.cnbc.com/2024/05/23/ukraine-war-live-updates-latest-news-on-russia-and-the-war-in-ukraine.html", "message": "Russia said its border region of Belgorod came under a missile and drone attack overnight, claiming that its air defense systems shot down 35 rockets and three drones over the region.\nCNBC was unable to verify the claims but Belgorod, adjacent to Ukraine's northeast Kharkiv region, where Russian forces are waging an intense offensive, has found itself under daily attack by Ukrainian forces.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.934031703651843, "event_breakdown": "1. Russia claims Belgorod came under a missile and drone attack overnight.\n2. Russian air defense systems shot down 35 rockets and three drones over the region of Belgorod."}, {"id": "3afa1398-63ab-4b32-8cf7-00ea0ab05d03", "title": "Spain , Ireland and Norway say they will recognize a Palestinian state . Why does that matter ? ", "date": "2024-05-23 09:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/216670/Spain,-Ireland-and-Norway-say-they-will-recognize-a-Palestinian-state.-Why-does-that-matter", "message": "Currently, seven member of the 27-nation European Union officially recognize a Palestinian state.\nSome 140 of the about 190 countries represented in the U.N. have already recognized a Palestinian state.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nWHO RECOGNIZES A PALESTINIAN STATE?\nGerman, meanwhile, said it will not recognize a Palestinian state for the time being.", "location": "Ramallah", "classification": "security", "score": 0.5416894192133992, "event_breakdown": "Summary of Events:\nSeven EU member countries recognize Palestinian state. Some 140 countries recognize Palestinian state. Leaders of Spain, Ireland, Malta, and Slovenia consider recognizing Palestinian state \"a positive contribution\" towards end to war. German leader says not recognizing Palestinian state \"for the time being\"."}, {"id": "eae55cf8-514c-4c88-81d8-229fa637967a", "title": "Ukraine updates : Russia Kharkiv push displaces thousands – DW – 05 / 23 / 2024", "date": "2024-05-23 08:45", "url": "https://www.dw.com/en/ukraine-updates-russian-kharkiv-push-displaces-thousands/live-69155827", "message": "Ukraine's governor of the Kharkiv region said on Thursday that 10,980 people in total had fled their homes in the roughly two weeks since Russia launched an attack on a line that had long been static at ground level.\nAcross the border in Belgorod, a missile alert warning sounded overnight and Russia's Defense Ministry reported several intercepted projectiles and drones.\nAnd Germany's Defense Minister Boris Pistorius is in Lithuania for a meeting of northern European defense ministers.\nThis comes amid the latest domestic dispute over spending in Berlin, this time pertaining to a new permanent force of Bundeswehr soldiers stationed in Lithuania.\nFollow DW for a roundup of major stories related to Russia's war on Ukraine on May 23, 2024", "location": "Kharkiv", "classification": "security", "score": 0.4774063948723803, "event_breakdown": ".\n1. The Governor of the Kharkiv region said that in total 10,980 people had fled their homes on May 23, 2024, in the roughly two weeks since Russia launched an attack on the region, causing the civilians to flee.\n2. The Russian Ministry of Defense said in a statement released on May 23, 2024, that a missile alert warning had sounded overnight in the Belgorod region on the Russian-Ukrainian border. The ministry also reported several intercepted projectiles and drones.\n3. Germany's Defense Minister Boris Pistorius, who is leading a new permanent force of Bundeswehr soldiers stationed in Lithuania, attended the Lithuanian Ministry of Defense meeting on May 23, 2024. In this meeting, Boris Pistorius met with his northern European counterparts with the aim of establishing a stronger regional defense network.\n4. New domestic dispute in Berlin regarding spending on this new permanent force of Bundeswehr soldiers stationed in Lithuania, on May 23, 2024."}, {"id": "4060153c-9242-43f8-a3bc-f86feebe91c1", "title": "Half a Russian Buk Missile Battalion Destroyed , Ukrainian Special Ops Say", "date": "2024-05-23 08:30", "url": "https://www.kyivpost.com/post/33088", "message": "Operators of the 3rd Separate Regiment of the Special Operations Forces (SSO) destroyed half a battalion of Russian Buk anti-aircraft missile systems in three weeks, Ukraine’s SSO reported on its Telegram channel.\nA standard Buk battalion (divizion) consists of a command vehicle, target acquisition radar vehicle, six transporter erector launcher and radar vehicles, and three transporter erector launcher vehicles.\nThe report does not specify in which operational sector the Russian Buks were destroyed.\nHowever, it does indicate that three anti-aircraft missile complexes were hit by SSO fighters at the end of April and beginning of May, and the fourth Buk was destroyed by special ops a few days ago.\n“The result of the SSO’s successful work is the burning remains of scrapped Russian steel,” read the caption to the published footage.", "location": "Based on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.7555669582630774, "event_breakdown": "Event 1: Russian Buk anti-aircraft missile systems battalion was destroyed by the SSO fighters in three weeks.\nEvent 2: SSO destroyed the Russian Buks at the end of April and the beginning of May.\nEvent 3: Special ops fighters destroyed the fourth Buk a few days ago."}, {"id": "4fa4ea47-9c0b-47c9-8ab8-61e251858edf", "title": "Missile attack targets commercial vessel off Yemen coast", "date": "2024-05-23 09:30", "url": "https://www.khaleejtimes.com/world/gulf/missile-attack-targets-commercial-vessel-off-yemens-coast", "message": "Photo: United Kingdom Maritime Trade Operations/XPublished: Thu 23 May 2024, 12:11 PMA missile attack targeted a commercial vessel transiting southwest of Yemen's port city of Hodeidah without causing any damage or casualties, maritime security firms said on Thursday.\nThe vessel was \"suspiciously approached\" 68 nautical miles (125 kilometres) off Hodeidah, Ambrey said, without identifying the ship or the flag that it was flying.\n\"The vessel had undergone what she described as a 'missile attack' at the location,\" it added, noting that \"no injuries or damages were reported\".\nThe United Kingdom Maritime Trade Operations, run by the Royal Navy, also reported an incident at the same location, with \"a missile impacting the water in close proximity\" to the ship.\n\"Vessel and all crew are safe and proceeding to next port of call,\" it said in an advisory.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.6755862314062181, "event_breakdown": "Here are all the security events related to this incident:\n1. A commercial vessel was transiting southwest of Yemen's port city of Hodeidah when it was targeted by a missile attack.\n2. A vessel was \"suspiciously approached\" by an unknown vessel 68 nautical miles (125 kilometers) off Hodeidah.\n3. The vessel underwent a \"missile attack\" at the location, but no injuries or damages were reported.\n4. The UK Maritime Trade Operations reported a missile impacting the water in close proximity to the targeted commercial vessel.\n5. The UK Maritime Trade Operations advised all vessels transiting in the area to exercise caution."}, {"id": "9bce301b-f62d-456d-8f3f-fc404a61b3b5", "title": "Spain , Ireland and Norway say they will recognize a Palestinian state . Why does that matter ? ", "date": "2024-05-23 08:00", "url": "https://lasvegassun.com/news/2024/may/22/spain-ireland-and-norway-say-they-will-recognize-a/", "message": "Spain, Ireland and Norway say they will recognize a Palestinian state.\nCurrently, seven member of the 27-nation European Union officially recognize a Palestinian state.\nSome 140 of the about 190 countries represented in the U.N. have already recognized a Palestinian state.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nGerman, meanwhile, said it will not recognize a Palestinian state for the time being.", "location": "Ramallah", "classification": "security", "score": 0.5578323226862629, "event_breakdown": "1. Spain, Ireland and Norway say they will recognize a Palestinian state.\n2. Currently, seven member of the 27-nation European Union officially recognize a Palestinian state.\n3. Germany says it will not recognize a Palestinian state for the time being."}, {"id": "b0afefa9-0a47-4a89-b173-009d69891bf5", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 09:45", "url": "https://www.theweek.in/wire-updates/international/2024/05/23/fgn27-mideast-tensions-the-latest.html", "message": "Jerusalem, May 23 (AP) The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nIsrael launched its war in Gaza after Hamas' October 7 attack in which militants stormed into southern Israel, killed about 1,200 people — mostly civilians — and abducted about 250.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since October 7.", "location": "WEST BANK", "classification": "security", "score": 0.952208582651795, "event_breakdown": "* The Israeli military launched an operation in the occupied West Bank on May 21.\n* The Palestinian Health Ministry reported 12 Palestinians killed and 25 wounded during the operation.\n* The Israeli military said it has completed the operation."}, {"id": "8156f133-0c3e-484c-97f0-f6ed93bbc2c2", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 10:15", "url": "https://www.startribune.com/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/600368070/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\nAt least 35,000 Palestinians have been killed, according to Gaza's Health Ministry, which doesn't distinguish between combatants and civilians.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.871138036151233, "event_breakdown": "* On May 12, 2022, the Israeli military conducted a two-day operation in the occupied West Bank. * The Palestinian Health Ministry announced that the operation killed 12 Palestinians and wounded 25. * The International Court of Justice is considering allegations of genocide that Israel has strenuously denied. * The Gaza Health Ministry says that at least 35,000 Palestinians have been killed since Oct. 7, most of them civilians. * The Israeli military operation in the West Bank follows an uptick in violence in the area."}, {"id": "3fb5decd-438c-422f-9267-1b9e97ab5c79", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 10:45", "url": "https://www.local10.com/news/2024/05/23/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n(AP Photo/Leo Correa)The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": ".\nWEST BANK", "classification": "security", "score": 0.8412835034178089, "event_breakdown": "1. The Israeli military conducted an operation in the occupied West Bank for two days, which the Palestinian Health Ministry said killed 12 Palestinians.\n2. The International Court of Justice is considering allegations of genocide that Israel has strenuously denied."}, {"id": "666b42af-d30a-4039-941c-87b6ad912f86", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 10:30", "url": "https://www.wsls.com/news/2024/05/23/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/", "message": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians.\n(AP Photo/Leo Correa)The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\n12 PALESTINIANS KILLED IN ISRAEL'S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.8412835034178089, "event_breakdown": "Israeli operation in the occupied West Bank, 12 Palestinians are confirmed dead and 25 are wounded."}, {"id": "1af8e691-90c5-4ff3-987d-5fd4d2717841", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 12:45", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/article_aac9de11-b0f1-5084-a302-a027ea63d89d.html", "message": "The Israeli military says it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25", "location": "The West Bank", "classification": "security", "score": 0.927162073241577, "event_breakdown": "Security events mentioned in the text:\n- Israeli military operation in the occupied West Bank\n- Palestinian Ministry of Health reports 12 Palestinians killed and 25 wounded during the operation"}, {"id": "221d7f80-0045-4079-8c1a-561bf7980b31", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 11:45", "url": "https://abcnews.go.com/International/wireStory/latest-12-palestinians-killed-25-wounded-israels-2-110493411", "message": "The Israeli military says it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe International Court of Justice is also considering allegations of genocide that Israel has strenuously denied.\nAt least 35,000 Palestinians have been killed, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.\nTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "PALESTINE", "classification": "security", "score": 0.8724915781325762, "event_breakdown": "* Israeli military operation in the West Bank between Oct. 7-9, according to the Palestinian Health Ministry\n* Palestinian Health Ministry reports that 12 Palestinians were killed and 25 were wounded during this operation\n* The International Court of Justice is considering allegations of genocide that Israel has strenuously denied"}, {"id": "709e563a-9ad6-459c-af73-c83ccb58a26c", "title": "Best Trials of Mana Kevin Classes To Choose", "date": "2024-05-23 10:30", "url": "https://segmentnext.com/trials-of-mana-best-kevin-classes-guide/", "message": "With the Brawler class, Kevin gains significant strength and attack power, making him a formidable force in combat.\nThis class provides Kevin with a massive AOE ranged class strike, useful in various game situations.\nThis class excels in multi-target attacks, making it ideal for quickly taking down groups of enemies thanks to its class strike.\nThe new class strike, Suzaku Aerial, is decent but not as strong as other class strikes available to Kevin.\nThis class focuses on quickly building the class strike gauge and unleashing powerful single-target and small AoE attacks.", "location": "Based on the context provided, I could not determine the specific location of the main event.", "classification": "security", "score": 0.6059499706013107, "event_breakdown": "- City security events\n- Regional security events\n- National security events\n- Global security events"}, {"id": "dc1b4161-0d80-4098-96a8-c20d11cd77e9", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 11:00", "url": "https://isp.netscape.com/news/world/story/0001/20240523/9f6c42dbea39cfc7c0ba04e44725b7aa", "message": "Missile splashes into the Red Sea, causing no damage in latest suspected Yemen Houthi rebel attackDUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "NULL", "classification": "security", "score": 0.7822073488251253, "event_breakdown": "1. Missile splashed down into waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel.\n2. Attack likely carried out by Yemen's Houthi rebels.\n3. British military's United Kingdom Maritime Trade Operations center reported the attack happened in southern Red Sea near Bab el-Mandeb Strait.\n4. Shipping through the Red Sea and the Gulf of Aden has declined due to the threat.\n5. tempo of Houthi attacks has dropped in recent weeks, though the rebels have claimed shooting down U.S. surveillance drones."}, {"id": "e937846a-f2db-4728-aac8-37cdc2072cc3", "title": "Letters to the Editor : Hama barbarity and the rules of war we expect Israel to obey", "date": "2024-05-23 10:45", "url": "https://www.yahoo.com/news/letters-editor-hamas-barbarity-rules-100034561.html", "message": "An Israeli flag hangs Nov. 13 between houses attacked by Hamas in the kibbutz Kfar Azza, Israel.\n(Leo Correa / Associated Press)To the editor: All war is horrific.\nPaul Bloustein, Cincinnati..To the editor: No doubt Hamas, a recognized terrorist group, unleashed their worst fanatics for its Oct. 7 attack on Israel.\nMaybe sexual violence was a \"strategy,\" a thought Robin Abcarian considers in her column.\nWould she care to write another column about the Israeli \"strategy\" of dropping bombs on residential areas and hospitals?", "location": "Kfar Azza, Israel", "classification": "security", "score": 0.9160158894613275, "event_breakdown": "Security Events:\n1. Attack on Israel by Hamas on October 7.\n2. Israeli \"strategy\" of dropping bombs on residential areas and hospitals.\n3. Sexual violence during the attack."}, {"id": "67c70de3-9bd0-4d13-bebd-36d8d275e59f", "title": "Missile splashes into the Red Sea in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 10:45", "url": "https://abcnews.go.com/Business/wireStory/missile-splashes-red-sea-causing-damage-latest-suspected-110493152", "message": "A missile has splashed down in the waters of the Red Sea, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen’s Houthi rebelsDUBAI, United Arab Emirates -- A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.8081821958733573, "event_breakdown": ".\nHere are the security events identified in the provided text:\n- A missile splashed down in the waters of the Red Sea near Yemen's coast.\n- The Houthi rebels likely carried out the attack."}, {"id": "ca0b6b18-9b50-4cd9-9611-9aceb3057a10", "title": "Missile splashes into the Red Sea causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 09:45", "url": "https://www.theweek.in/wire-updates/international/2024/05/23/fgn26-mideast-tensions.html", "message": "Dubai, May 23 (AP) A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen's Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down US surveillance drones.", "location": "RED SEA.", "classification": "security", "score": 0.7354004922454969, "event_breakdown": ".\n- Houthi rebels in Yemen attacked a vessel in the Red Sea with a missile.\n- A group of American transport trucks was attacked by a multiple rocket launch in Iraq.\n- Ukrainian troops recaptured the city of Kharkiv from Russian forces.\n- Five soldiers were killed and many others were wounded in an attack in southwestern separatist insurgency in Nigeria.\n- Two oil fields were attacked with drones in Saudi Arabia."}, {"id": "5222243f-2357-473d-8c8a-230a0b0c42e3", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 11:15", "url": "https://www.2news.com/news/national/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation/article_464f4d70-4569-551f-953f-6ff11eb2475b.html", "message": "Mourners hold photos of the late Iranian President Ebrahim Raisi during a vigil in Jakarta, Indonesia, Wednesday, May 22, 2024.\nRaisi and several other officials were found dead on Monday after their helicopter crashed in a foggy, mountainous region of Iran's northwest.\n(AP Photo/Tatan Syuflana)", "location": "JAKARTA", "classification": "security", "score": 0.40895917086699796, "event_breakdown": "The security events in the text are as follows:\n\n1. Ebrahim Raisi, the President in Iran, and several other officials were found dead after their helicopter crashed in a foggy, mountainous region of Iran's northwest."}, {"id": "fb0d2565-f4e3-4501-a05c-89b09aef996c", "title": "Russians attack Kharkiv and oblast , killing 2 and injuring 11 people", "date": "2024-05-23 10:45", "url": "https://www.yahoo.com/news/russians-attack-kharkiv-oblast-killing-082032394.html", "message": "Source: Oleh Syniehubov, the Head of Kharkiv Oblast Military Administration; Kharkiv Mayor Ihor Terekhov; Ukraine's National Police branch in Kharkiv Oblast; Ukrainska Pravda.Culture; Oleksandr Filchakov, Head of Kharkiv Oblast Prosecutor's OfficeQuote: \"The occupiers have struck Kharkiv about 10 times!\nPhoto: Kharkiv Oblast Military AdministrationLater, Syniehubov wrote that Russian soldiers struck Kharkiv Oblast at least 15 times.\nPhoto: Kharkiv Oblast Military AdministrationA few minutes after that, Syniehubov added that six were killed and 11 were wounded in Kharkiv.\nPhoto: Kharkiv Oblast Military AdministrationOleksandr Filchakov, Head of Kharkiv Oblast Prosecutor's Office, noted that two Russian missiles hit the territory of a printing house in Osnovianskyi district.\nPhoto: Kharkiv Oblast Military AdministrationLaw enforcement officers launched a pre-trial investigation into the violation of the laws and customs of war.", "location": "Kharkiv", "classification": "security", "score": 0.8917501049995968, "event_breakdown": "* Russian soldiers hit Kharkiv Oblast at least 15 times\n* Russian soldiers struck Kharkiv at least 10 times\n* Russian soldiers killed six people and injured 11 others in Kharkiv\n* Two Russian missiles hit the territory of a printing house in Osnovianskyi district of Kharkiv Oblast\n* Law enforcement officers launched a pre-trial investigation into the violation of the laws and customs of war"}, {"id": "ff42b51a-4c89-492a-87d4-0de7f05356c1", "title": "1 killed , 3 wounded in Israeli strike on southern Lebanon - Xinhua", "date": "2024-05-23 10:15", "url": "https://english.news.cn/20240523/f1cca28e3e3b4cc5a646790c14207a47/c.html", "message": "BEIRUT, May 23 (Xinhua) -- A Hezbollah official was killed and three civilians were injured on Thursday in an Israeli airstrike on a civilian car on a road in southern Lebanon, Lebanese military sources said.\nThe shrapnel hit the passing school bus, killing the Hezbollah official, who also worked as a physics teacher, and injuring three students.\nAccording to the sources, civil defense members extinguished the fire that broke out in the car and transported the wounded to a hospital in the city of Nabatieh.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nConfrontations between Hezbollah and Israel have killed 482 people on the Lebanese side, including 306 Hezbollah members and 89 civilians, according to Lebanese security sources.", "location": "NULL", "classification": "security", "score": 0.9967715292384377, "event_breakdown": "Event 1: Thursday, a Hezbollah official was killed and three civilians were injured in an Israeli airstrike in a civilian car on a road in southern Lebanon.\nEvent 2: Israel retaliated by firing heavy artillery toward southeastern Lebanon.While one Hezbollah official was killed by Israeli report, another Hezbollah official, who also worked as a physics teacher, was killed as a result of the wreckage of a passing school bus."}, {"id": "cbba7808-0b3b-4d31-bff0-187d5701a249", "title": "Russian missiles kill 7 in Ukraine second - largest city where Moscow troops are pressing", "date": "2024-05-23 12:45", "url": "https://www.yakimaherald.com/news/nation_and_world/world/russian-missiles-kill-7-in-ukraines-second-largest-city-where-moscows-troops-are-pressing/article_be41a580-4c1b-580a-97b8-ce95c26970a9.html", "message": "Officials say that Russian missiles have slammed into Ukraine’s second-largest city in the northeast of the country and killed at least seven civilians", "location": "KRAMATORSK", "classification": "security", "score": 0.8781941317351128, "event_breakdown": "1. Russian missiles hit Ukraine's second largest city in the northeast of the country, killing at least seven civilians.\n2. Russian missiles slammed into Ukraine's second-largest city.\n3. Russian missiles killed at least seven civilians in Ukraine."}, {"id": "a3708af0-b13b-4351-84fc-8ce9cbf6f190", "title": "Somalia : UN Sanctions Three Al - Shabaab Leaders At Request of Somali Government", "date": "2024-05-23 12:45", "url": "https://allafrica.com/stories/202405230373.html", "message": "New York — In a significant move to combat terrorism, the United Nations Security Council has sanctioned three leaders of the Al-Shabaab militant group following a request from the Somali government.\nThe decision was made public on May 23, 2024, and targets three individuals identified as key figures in the organization:1.\nThe Somali government has been working closely with international partners, including the United Nations, to combat Al-Shabaab, a group known for its violent attacks and control over parts of the country.\nThe sanctions are a significant step forward in this ongoing battle, demonstrating the international community's commitment to supporting Somalia's efforts to eradicate terrorism.\nAs of now, the impact of these sanctions on Al-Shabaab's operations and the response from the group remains to be seen.", "location": "Mogadishu", "classification": "security", "score": 0.5265927367425716, "event_breakdown": "1. United Nations Security Council sanctions three leaders of Al-Shabaab militant group following Somali government request.\n2. The Somali government has been working closely with international partners, including the United Nations, to combat Al-Shabaab, a group known for its violent attacks and control over parts of the country.\n3. Sanctions are a significant step forward in this ongoing battle, showing the international community's commitment to supporting Somalia's efforts to eradicate terrorism.\n\nCurrently, the impact of these sanctions on Al-Shabaab's operations is to be seen."}, {"id": "756267e3-41c5-46cc-808b-1a0070f9a02f", "title": "Hezbollah fighter killed , 3 children injured in drone strike on car in Nabatiyeh", "date": "2024-05-23 09:45", "url": "https://www.naharnet.com/stories/en/305403-one-killed-3-children-injured-in-drone-strike-on-car-in-nabatiyeh", "message": "Lebanese school children on a minibus had a narrow escape Thursday when a drone strike killed a Hezbollah fighter in the car ahead, blowing out the windscreen of their vehicle and wounding three pupils.\n\"Suddenly a strike hit the car in front of us\" near the town of Nabatiyeh, about 13 kilometres (eight miles) from the Israeli border, he said.\nThe Israeli army said Farran was in charge of manufacturing strategic weapons belonging to Hezbollah in southern Lebanon.\nThe attack \"killed a car driver\" and \"wounded three pupils\" who were in a bus heading to school, it said.\nThe Hassan Kamel al-Sabah School later said that the man killed, Farran, was a physics teacher at the school and that it mourned his death.", "location": "Lebanon", "classification": "security", "score": 0.9961726625958413, "event_breakdown": "Events from the text:\n- Drone strike kills a Hezbollah fighter near Nabatiyeh, Lebanon\n- School bus windscreen is blown out by strike, wounding three pupils\n- Israeli army says Hezbollah fighter killed was in charge of manufacturing strategic weapons\n- School confirms that killed man was physics teacher and that it mourns his death"}, {"id": "1e1586ca-e2f2-4a56-bc21-1cf095b74e91", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 12:45", "url": "https://www.bostonglobe.com/2024/05/23/world/missile-splashes-into-red-sea-causing-no-damage-latest-suspected-yemen-houthi-rebel-attack/", "message": "DUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen’s Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military's United Kingdom Maritime Trade Operations center said.", "location": "RED SEA", "classification": "security", "score": 0.7208304816966212, "event_breakdown": "and move to the next one\nAttack on commercial vessel in Red Sea"}, {"id": "cd5943b9-aebe-418d-aa68-6722674124f1", "title": "Russia Hits Kharkiv With Missile Strikes , Killing at Least Six", "date": "2024-05-23 11:15", "url": "https://www.bnnbloomberg.ca/russia-hits-kharkiv-with-missile-strikes-killing-at-least-six-1.2076539", "message": "Russia Hits Kharkiv With Missile Strikes, Killing at Least Six(Bloomberg) -- Russian forces hit Kharkiv and the nearby town of Lyubotyn with a barrage of at least 15 simultaneous missile strikes on Thursday, stepping up pressure against Ukraine’s second-largest city.\nThe attack killed at least six civilians and wounded another 16, regional governor Oleh Synehubov said on Telegram.\nS-300 missiles damaged local transport infrastructure as well as a printing facility in Kharkiv, setting off a large fire, according to Telegram reports from Synehubov and city mayor Ihor Terekhov.\nRussian forces are taking advantage of insufficient air defense and Ukraine’s lack of capability to destroy missile launchers located near its borders, President Volodymyr Zelenskiy said in a statement on social platform X.Kremlin troops opened a new front in the Kharkiv region this month, putting additional pressure on Ukraine’s increasingly fragile defenses.\n©2024 Bloomberg L.P.", "location": "Kharkiv", "classification": "security", "score": 0.9048392250638112, "event_breakdown": "1. Russian forces launch a barrage of at least 15 simultaneous missile strikes on Kharkiv and the nearby town of Lyubotyn.\n2. The attack killed at least six civilians and wounded another 16 in Kharkiv and Lyubotyn.\n3. Russian troops open a new front in the Kharkiv region this month.\n4. Russian military takes advantage of insufficient air defense in Ukraine.\n5. Missiles damage local transport infrastructure and a printing facility in Kharkiv and set off a large fire."}, {"id": "8dc21575-b47a-4f93-a889-afa30adcc088", "title": "Pray for his recovery : IDF soldier severely injured northern Gaza", "date": "2024-05-23 12:30", "url": "https://www.israelnationalnews.com/news/390431", "message": "The family of soldier Aharon Sternlib, a resident of Havat Gilad who was severely injured in Gaza and is now sedated and ventilated, calls for prayers for his recovery.\nThey added, \"Please increase your prayers and good deeds for his recovery and for the recovery of all the injured.\"\nYisrael Yudkin, 22 from Kfar Chabad, and Staff Sergeant Eliyahau Haim Emsallem, 21 from Raanana, were soldiers in the 97th Battalion of the Kfir Brigade.\nYisrael Yudkin and Staff Sergeant Eliyahau Haim Emsallem were killed, a soldier from the 97th Battalion was seriously wounded.\nEarlier today, a reservist from Battalion 9263 of the 226th Brigade was seriously wounded in an operations accident on the northern border.", "location": "GAZA", "classification": "security", "score": 0.8472033750927329, "event_breakdown": "Security Events:\n\n1. Soldier Aharon Sternlib, a resident of Havat Gilad, was severely injured in Gaza.\n2. Staff Sergeant Eliyahau Haim Emsallem and Yisrael Yudkin were killed in Gaza.\n3. A soldier in the 97th Battalion was seriously injured in Gaza.\n4. A reservist from Battalion 9263 of the 226th Brigade was seriously injured in an operations accident on the northern border."}, {"id": "7754a214-3e88-469b-b324-00ebc5daddf8", "title": "1 killed , 3 wounded in Israeli strike on southern Lebanon", "date": "2024-05-23 12:45", "url": "https://article.wn.com/view/2024/05/23/1_killed_3_wounded_in_Israeli_strike_on_southern_Lebanon_6/", "message": "BEIRUT, May 23 (Xinhua) -- A Hezbollah official was killed and three civilians were injured on Thursday in an Israeli airstrike on a civilian car on a road in southern Lebanon, Lebanese military sources said.\nThe shrapnel hit the passing school bus, killing the Hezbollah official, who also worked as a physics teacher,... read full story", "location": "Lebanon", "classification": "security", "score": 0.9941012140528505, "event_breakdown": "Event: A Hezbollah official was killed and three civilians were injured in an Israeli airstrike on a civilian car on a road in southern Lebanon.\nEvent: Israeli attack helicopter strike targeting members of the Palestinian group Islamic Jihad's rocket unit in the northern Gaza Strip."}, {"id": "8eddb321-24d0-4ce3-bb93-017fef97fe34", "title": "30 - Rocket Barrage Fired by Hezbollah at Northern Israel | The Jewish Press - JewishPress . com | Hana Levi Julian | 15 Iyyar 5784 – Thursday , May 23 , 2024", "date": "2024-05-23 10:15", "url": "https://www.jewishpress.com/news/israel/30-rocket-barrage-fired-by-hezbollah-at-northern-israel/2024/05/23/", "message": "Photo Credit: Erez Ben Simon / TPSThe Iranian-backed Hezbollah terrorist organization in Lebanon fired a barrage of at least 30 rockets Thursday morning at communities in the Upper Galilee.\nAdvertisementThe attack followed the IDF’s targeted assassination of a Hezbollah operative riding in a vehicle in the southern Lebanese town of Nabatieh.\nIn recent years, Ali Nasser Faran was responsible for the manufacturing of strategic and specialized weapons for Hezbollah.\nOver the last few months, the IDF struck Hezbollah weapons manufacturing infrastructure for which he was responsible.\nHezbollah continues to target civilian communities in northern Israel.", "location": "Lebanon", "classification": "security", "score": 0.9676126157704431, "event_breakdown": "- Hezbollah, an Iranian-backed terrorist organization in Lebanon, fired a barrage of at least 30 rockets at communities in the Upper Galilee.\n- The IDF's targeted assassination of a Hezbollah operative, Ali Nasser Faran, was in the city of Nabatieh.\n- Faran was responsible for manufacturing strategic and specialized weapons for Hezbollah.\n- In the past, the IDF has hit Hezbollah weapons manufacturing infrastructure for which Faran was responsible."}, {"id": "b37bcf45-e92b-4123-b707-ad557b0e2768", "title": "Ukraine Counterattacks Recapture Lost Ground in Kharkiv Sector , US - Made Strykers in Action", "date": "2024-05-23 13:15", "url": "https://www.kyivpost.com/post/33136", "message": "Ukrainian forces since Monday have launched local counterattacks in and around Vovchansk, retaking about half the town and capturing dozens of prisoners.\nInfantrymen from Ukraine’s 82nd Air Assault Brigade stand and sit on a US-manufactured Stryker armored personnel carrier.\nThe brigade, one of the Ukrainian army’s most combat-capable, was recently committed to combat in the town Vovchansk, Kharkiv sector.\nAccording to early reports they took ground and prisoners from Russian forces attacking there.\nA soldier identified as Ivan told ICTV: “We have succeeded in throwing them (Russian forces) back a bit.”", "location": "Vovchansk", "classification": "security", "score": 0.6584714597771578, "event_breakdown": "* Ukrainian forces launch counterattacks in and around Vovchansk\n* Ukrainian forces retake about half of the town and capture dozens of prisoners\n* Infantrymen from Ukraine's 82nd Air Assault Brigade capture ground and prisoners from Russian forces in Vovchansk"}, {"id": "a9f3b168-fd3e-4773-9cae-7062d4353366", "title": "Russian missiles kill 7 in Ukraine second - largest city where Moscow troops are pressing", "date": "2024-05-23 13:30", "url": "https://www.startribune.com/russian-missiles-kill-6-in-ukraines-second-largest-city-where-moscows-troops-are-pressing/600368084/", "message": "At least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, lies about 20 kilometers (12 miles) from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine's depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of Kharkiv city, Russian missiles struck the town's center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.9570072585641066, "event_breakdown": "Events:\n- Russian missiles struck the city of Kharkiv, wounding 16 people.\n- Russian missiles hit Liubotyn, a small town near Kharkiv, injuring eight civilians.\n- Russian forces made incursions in Sumy region.\n- Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka, Donetsk."}, {"id": "997248b5-d220-4422-976d-55e4be1085ef", "title": "Russian missiles kill 7 in Ukraine second - largest city where Moscow troops are pressing", "date": "2024-05-23 13:15", "url": "https://www.clickondetroit.com/news/world/2024/05/23/russian-missiles-kill-6-in-ukraines-second-largest-city-where-moscows-troops-are-pressing/", "message": "Servicemen of Ukraine's 93rd Mechanised Brigade fire a French MO-120-RT heavy mortar at the Russian forces on the front line near the city of Bakhmut in Ukraine's Donetsk region on Wednesday, May 22, 2024.\nAt least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of Kharkiv city, Russian missiles struck the town’s center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "KHARKIV, Ukraine", "classification": "security", "score": 0.9768970731322233, "event_breakdown": "Events:\nEight civilians injured in Russian missile strike on Kharkiv city.\nRussia claims advances in Sumy region.\nRussia claims advances in Donetsk Oblast."}, {"id": "3617f9a2-d403-4da8-a825-5a91fcb1c83c", "title": "Russian missile strike kills 7 civilians in attack on Ukraine Kharkiv", "date": "2024-05-23 13:15", "url": "https://www.foxnews.com/world/russian-missile-strike-kills-7-civilians-extremely-cruel-attack-ukraines-kharkiv", "message": "Russian missiles struck Kharkiv, Ukraine’s second-largest city, killing at least seven civilians and injuring 16 others.\nAt least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 6 miles west of Kharkiv city, Russian missiles struck the town’s center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.9833903402834203, "event_breakdown": "* Russian missiles struck the city of Kharkiv, killing seven civilians and injuring 16 others.\n* Eight civilians were injured in Liubotyn, a town near Kharkiv, when Russian missiles struck the town's center.\n* Russian troops have made incursions in the northern Sumy region.\n* Russian forces have claimed advances in the vicinity of Chasiv Yar, Konstantinovka, and Rozdolivka in Donetsk."}, {"id": "5d22e359-85e7-41d2-a6fa-8723bdbb51d3", "title": "Ukraine updates : Deadly daytime strike hits Kharkiv – DW – 05 / 23 / 2024", "date": "2024-05-23 13:15", "url": "https://www.dw.com/en/ukraine-updates-deadly-daytime-strike-hits-kharkiv/live-69155827", "message": "Ukraine's governor of the Kharkiv region said on Thursday that at least four people had died in an attack during daylight hours.\nAcross the border in Belgorod, a missile alert warning sounded overnight and Russia's Defense Ministry reported several intercepted projectiles and drones.\nAnd Germany's Defense Minister Boris Pistorius is in Lithuania for a meeting of northern European defense ministers.\nThis comes amid the latest domestic dispute over spending in Berlin, this time pertaining to a new permanent force of Bundeswehr soldiers stationed in Lithuania.\nFollow DW for a roundup of major stories related to Russia's war on Ukraine on May 23, 2024", "location": "Kharkiv", "classification": "security", "score": 0.6786839876489, "event_breakdown": "1. Ukraine's governor of the Kharkiv region said that an attack on May 23, 2024, killed at least four people.\n2. Several projectiles and drones were intercepted in Belgorod, Russia, on May 23, 2024.\n3. Germany's Defense Minister is in Lithuania for a meeting of northern European defense ministers."}, {"id": "43ab80be-5ade-4e01-9736-9d0a461e6fa3", "title": "Israel says ready to resume truce talks as Gaza war grinds on", "date": "2024-05-23 12:00", "url": "https://www.al-monitor.com/originals/2024/05/israel-says-ready-resume-truce-talks-gaza-war-grinds", "message": "The Gaza Strip's civil defence agency said two pre-dawn air strikes had killed 26 people, including 15 children, in Gaza City alone.\nThere was no immediate comment from the Israeli military.\n- Bleak assessment -The previous round of truce talks, involving US, Egyptian and Qatari mediators, ended shortly after Israel launched its attack on Gaza's far-southern city of Rafah early this month.\nIsrael has since ordered mass evacuations from the city, and the UN says more than 800,000 people have fled.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.", "location": "GAZA CITY", "classification": "security", "score": 0.9024306551095295, "event_breakdown": "The security events in the text are:\n\n1. Two pre-dawn Israeli air strikes in the Gaza Strip killed 26 people, including 15 children.\n2. The previous round of truce talks involving US, Egyptian, and Qatari mediators ended shortly after Israel launched its attack on Gaza's far-southern city of Rafah.\n3. Israel ordered mass evacuations from the city, and the UN says more than 800,000 people have fled.\n4. Militants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead."}, {"id": "a1daa7c8-c131-41ca-9ed9-cf539aa169b4", "title": "IDF Says Major Commander In Hezbollah Weapons Production Killed", "date": "2024-05-23 16:45", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-says-major-commander-in-hezbollah-weapons-production-killed", "message": "The Israeli army said the hed of Hezbollah's weapons production in southern Lebanon was killed in an airstrike Thursday.\nLater, the terrorist organization responded with dozens of rockets fired into Israel's Upper Galilee region.\nThe terrorist organization said Muhammad Ali Nasser Farran was killed in an IDF airstrike in Kafr Dajjal while he was driving in a vehicle.\nPart of the weapons production infrastructure built by Farran has already been destroyed in IDF raids over the past months, the military said.\nThe targeted killing is a significant blow to the manufacturing capabilities of Hezbollah, which is used to attack northern Israel.", "location": "Southern Lebanon", "classification": "security", "score": 0.9768595516420643, "event_breakdown": "Event 1: On Thursday, the Israeli army announced that it killed the head of Hezbollah's weapons production in southern Lebanon in an airstrike.\nEvent 2: Later, the terrorist organization responded by firing dozens of rockets into Israel's Upper Galilee region.\nEvent 3: The terrorist organization said that the Israeli army killed Muhammad Ali Nasser Farran, who was driving a vehicle in Kafr Dajjal.\nEvent 4: The Israeli army said that a part of the weapons production infrastructure built by Farran had already been destroyed in IDF raids over the past months.\nEvent 5: According to the IDF, the targeted killing of Farran is a significant blow to the manufacturing capabilities of Hezbollah."}, {"id": "2921ebdd-c599-431c-874a-8e98c44e0968", "title": "At least seven killed in Russian strike on Kharkiv as Zelensky pleads for more weapons", "date": "2024-05-23 17:00", "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-kharkiv-strike-zelensky-b2550385.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}At least seven people have been killed and two dozen injured after Russia launched a second massive airstrike on Ukraine’s Kharkiv region in as many days.\nThe strikes were launched using S-300 missile systems from the Russian region of neighbouring Belgorod, military officials said.\nThe printing press in Kharkiv, with dozens inside, was yet another victim.\nMeanwhile, Ukrainian military chief Oleksandr Syrskyi said that the most intense battles across the frontline were taking place in Kupyansk in the southeastern corner of the Kharkiv region.", "location": "Kharkiv", "classification": "security", "score": 0.6116665006912517, "event_breakdown": "1. Russian airstrike kills at least seven people in Kharkiv region.\n2. The printing press in Kharkiv was a victim of the airstrike.\n3. Russian military officials say the S-300 missile systems were used in the strike.\n4. The Ukrainian military chief said the fiercest battles are in the southeastern corner of the Kharkiv region."}, {"id": "7fdde601-05ec-4e1e-9af0-600eaf664333", "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel 2 - day West Bank operation", "date": "2024-05-23 15:45", "url": "https://www.mymotherlode.com/news/world/3362957/the-latest-12-palestinians-killed-and-25-wounded-in-israels-2-day-west-bank-operation.html", "message": "The Latest | Israel’s 2-day raid in West Bank kills 12 Palestinians View PhotoThe Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nAt least 35,000 Palestinians have been killed in Gaza, according to the Health Ministry, which doesn’t distinguish between combatants and civilians.\nWith Hamas holding firm and fighting back in Gaza, Israel faces only bad options.\n12 PALESTINIANS KILLED IN ISRAEL’S 2-DAY WEST BANK OPERATIONTEL AVIV, Israel — The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25.\nThe Palestinian Health Ministry says more than 500 Palestinians have been killed in the West Bank since Oct. 7.", "location": "WEST BANK", "classification": "security", "score": 0.9109720637534489, "event_breakdown": "1. - Sept. 29, 2000: Ariel Sharon visits Al-Aqsa Mosque, a halting of the peace process is given way to the Al-Aqsa Intifada.\n2. Sept. 28, 2000: Both Israeli and U.S. officials warn that Hamas or Islamic Jihad could launch a major terror attack at a rally or march.\n3. Sept. 29, 2000: a suicide bombing attack is carried out at the Ben Yehuda pedestrian mall in Jerusalem, killing 5 and wounding over 100.\n4. Sept. 29, 2000: Israeli troops reoccupy several West Bank cities, and begin curfews on four or five of the worst religiously uptight Arab-Israeli towns within Israel itself.\n5. Sept. 30, 2000: Israeli Defense Minister Benjamin Ben-Eliezer orders his General Staff commander to draw up a plan for a ground invasion of Palestinian areas.\n6. Sept. 30, 2000: a suicide bombing attack is carried out at the crowded Mahane Yehuda open air produce market, 26 people die and at least 167 are wounded.\n7. Sept. 30, 2000: Prime Minister Ehud Barak orders Israel's military to seek ways to topple the Palestinian Authority and restore order.\n8. Nov. 28, 2000: Israeli Prime Minister Ehud Barak agrees to cede to police recommendations to formally charge Ariel Sharon with incitement to"}, {"id": "4f2ee98a-a755-401b-adc0-a84a81ce796a", "title": "Hezbollah commander killed in Lebanon , claims Israel", "date": "2024-05-23 15:45", "url": "https://www.prokerala.com/news/articles/a1533706.html", "message": "Beirut/Tel Aviv, May 23 : Israel said on Thursday it had killed a commander of the pro-Iranian Hezbollah militia in southern Lebanon.\nHezbollah confirmed the death but did not specify the man's rank.\nHezbollah said that it had fired \"dozens of rockets\" at Israeli targets in northern Israel in retaliation.\nSince the beginning of the war in the Gaza Strip, there have been daily military confrontations between the Israeli army and the Hezbollah militia and other groups in the border area between Israel and Lebanon.\nThe exchanges of fire have caused severe destruction in towns on both sides of the border.", "location": "Israel", "classification": "security", "score": 0.9822835715342412, "event_breakdown": "Events:\n- Israel killed a Hezbollah commander in southern Lebanon.\n- Hezbollah fired \"dozens of rockets\" at Israeli targets in northern Israel in retaliation.\n- Israeli military confrontations with Hezbollah militia and other groups have occurred in the border area between Israel and Lebanon since the outbreak of the Gaza war."}, {"id": "1f5d9e26-0162-463b-bb92-ae172ad2eb46", "title": "Russia warns it will strike British targets  in Ukraine and beyond  - forcing NATO to enter the conflict - if united kingdom weapons are used for attacks within its territory", "date": "2024-05-23 15:15", "url": "https://www.dailymail.co.uk/news/article-13452043/Russia-warns-strike-British-targets-Ukraine-forcing-NATO-enter-conflict-UK-weapons-used-attacks-territory.html", "message": "Moscow will retaliate with strikes on British targets if weapons from the UK are used by Ukraine to attack Russian territory, Russian Foreign Ministry spokeswoman Maria Zakharova declared today.\nZakharova's statement came hours after Russia bombarded Ukraine's second city with yet more missiles, killing at least seven people as of this afternoon.\nShocking images showed scenes of utter devastation at a printworks in Kharkiv with rescuers pulling bodies out of the charred rubble.\nThis appeared to change an understanding that Western long-range missiles would be used on Russian-occupied regions of Ukraine, but not in Russia itself.\nIn Liubotyn, a small town about six miles west of Kharkiv city, Russian missiles struck the town's centre, injuring eight civilians.", "location": "Kharkiv", "classification": "security", "score": 0.4692875870206512, "event_breakdown": "* Seven people killed in missile attacks by Russia on Kharkiv, Ukraine's second city\n* Eight civilians injured in attack on Liubotyn, a town six miles west of Kharkiv\n* Zakharova, a spokesman for Russia's Foreign Ministry, threatened retaliation on British targets if UK weapons are used to attack Russian territory"}, {"id": "7f6d21d5-f451-4d46-a006-0eab39ccd23f", "title": "Ukraine decries  world weaknes after Russia latest deadly strike on Kharkiv – The Irish Times", "date": "2024-05-23 17:45", "url": "https://www.irishtimes.com/world/europe/2024/05/23/ukraine-seven-killed-in-russian-missile-strike-on-kharkiv-as-kyiv-calls-for-more-weapons/", "message": "Law enforcement officers carry the body of a person through a destroyed building after a missile attack in Kharkiv, Ukraine, on Thursday.\nUkrainian president Volodymyr Zelenskiy said the “world’s weakness” allowed Moscow’s military to continue bombarding Kharkiv, the country’s second city, which is home to some 1.3 million people and located just 35km from the Russian border.\n“All of them were civilians, all of them were employees of a well-known firm that printed magazines, newspapers and other publications.\nAnd this weakness is not ours, but the world’s, which has not dared to deal with terrorists in the way they deserve,” Mr Zelenskiy said.\nUkraine claims to have destroyed a Russian warship in occupied Crimea and to have hit advanced Russian air defence with missile strikes in recent days.", "location": "Kharkiv, Ukraine", "classification": "security", "score": 0.4370207168142047, "event_breakdown": "1. Ukraine claims to have destroyed a Russian warship in occupied Crimea.\n2. Ukraine claims to have hit advanced Russian air defence with missile strikes in recent days."}, {"id": "c474ec1b-7aca-4f6c-a4c2-82503618d299", "title": "Rewarding Barbaric Behavior Leads to More Barbaric Behavior", "date": "2024-05-23 17:45", "url": "https://www.theepochtimes.com/opinion/rewarding-barbaric-behavior-leads-to-more-barbaric-behavior-5655959", "message": "CommentaryOn May 23, 2024, Ireland, Spain, and Sweden rewarded Hamas’s barbaric behavior by presenting the Palestinian Authority, which cooperates with Hamas, with one of its and Hamas’s stated political goals—international recognition.\nOf course, once that stated objective is achieved, the terrorists commit further atrocities to gain their next set of rewards.\nThat insanity continues despite the visible fact that rewarding criminal behavior inspires rather than deters more of it.\nRewarding such barbaric acts and behavior has neither reduced terrorism nor facilitated political progress in any Middle Eastern dispute.\nWhen will Western political leaders realize that saving Hamas once again will simply lead to its resurgence a few years hence and launch an even deadlier attack?", "location": "Dublin, Ireland", "classification": "security", "score": 0.8523976951317401, "event_breakdown": "* Hamas's barbaric behavior\n* Palestinian Authority's collaboration with Hamas\n* Hamas's stated political goal as international recognition\n* Terrorists' atrocities committed for further rewards\n* Saving Hamas leading to its resurgence in the future\n* Further attacks by Hamas being potentially deadlier"}, {"id": "100a822d-20cc-4640-81e2-f136c177fc74", "title": "What Israel Is Doing To Gaza Is A Choice – OpEd", "date": "2024-05-23 00:15", "url": "https://www.eurasiareview.com/23052024-what-israel-is-doing-to-gaza-is-a-choice-oped/", "message": "By MISESBy Connor O’KeeffeAnyone who has voiced opposition to what the government of Israel is currently doing in Gaza has undoubtedly heard the various ways Israel’s defenders excuse, dismiss, and justify Israel’s actions.\nWith that assumption smuggled in, defenders can then act like anyone who has problems with what Israel is doing in Gaza is actually opposed to the operation’s stated goals—rescuing the hostages and breaking up Hamas.\nBut most of these strikes are designed to kill men that Israeli forces have determined to be Hamas militants.\nBut after the Hamas attacks in October, the Israeli military gave all members of Hamas’s military wing that same designation.\nProcedures like this don’t mesh well with the argument that Israel is doing everything in its power to avoid killing civilians.", "location": "GAZA", "classification": "security", "score": 0.9622268423762993, "event_breakdown": "Events:\n1. Israel’s enemies have kidnapped soldiers.\n2. Israel is currently taking actions in Gaza to rescue their soldiers.\n3. Israel's army gives members of Hamas's military wing the same designation after the attack in October.\n4. Israel's attacks are designed to kill men that have been designated as Hamas militants from the second half of 2019.\n5. Israel's army has given members of Hamas's military wing the same designation after the attack in October.\n6. Israel's attacks are designed to kill men that have been designated as Hamas militants.\n7. Three children are killed during this operation.\n\nConnor O’Keeffe\nPalestine\nHaleema Bar Abu Bakr\nGaza–Jericho Agreement"}, {"id": "4d23653f-9b03-430e-ba79-0d7e7dad770a", "title": "Russia slams Kharkiv with missile barrage , killing printing - plant workers", "date": "2024-05-23 18:15", "url": "https://www.adn.com/nation-world/2024/05/23/russia-slams-kharkiv-with-missile-barrage-killing-printing-plant-workers/", "message": "A rescuer recovers a lifeless body from under the rubble after a Russian missile hit a large printing house in Kharkiv, Ukraine, Thursday, May 23, 2024.\nFirefighters work to extinguish a fire as a lifeless body lies under the rubble after a Russian missile hit a large printing house in Kharkiv, Ukraine, Thursday, May 23, 2024.\n(AP Photo/Andrii Marienko)Kharkiv city lies about 20 miles from the Russian border, and the Kharkiv region abuts Russia’s Belgorod region.\nRussian officials had warned that they planned to increase attacks on logistical targets and other infrastructure.\nLast month, Russian missiles hit railway facilities in three Ukrainian regions, including a train station in Balakliya in the Kharkiv region, killing six and injuring dozens.", "location": "Kharkiv city", "classification": "security", "score": 0.7980640681266687, "event_breakdown": "1. Russian military targets printing house in Kharkiv, Ukraine.\n2. Russian missile hits large printing house in Kharkiv, Ukraine.\n3. Russian missiles strike three railway stations in Ukraine."}, {"id": "d89dbbff-0c3b-46b3-b6ea-bb48aaed0f28", "title": "Russian missiles kill 7 in Ukraine second - largest city as Moscow troops press offensive", "date": "2024-05-23 15:45", "url": "https://isp.netscape.com/news/world/story/0001/20240523/208d1921bb4782fcf403f30cd0fea1d6", "message": "Russian missiles kill 7 in Ukraine's second-largest city as Moscow's troops press offensiveKYIV, Ukraine (AP) — Russian missiles slammed into Ukraine’s second-largest city in the country's northeast and killed at least seven civilians early Thursday, officials said, as Kyiv’s army labored to hold off an intense cross-border offensive by the Kremlin’s larger and better-equipped forces.\nAt least 20 people were wounded as S-300 missiles struck the city of Kharkiv, regional Gov.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of the city of Kharkiv, Russian missiles struck the town’s center, wounding eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.952276789558966, "event_breakdown": "Russian missiles strike in Ukraine’s northeast city of Kharkiv killing 7 civilians on april 14, 2022. Meanwhile, Russian troops make incursions in the north Ukrainian Sumy region and claims advances in several places located in the western Donetsk zone"}, {"id": "330f42ca-4815-44ed-b473-bbc943be53d8", "title": "Missile splashes into the Red Sea , causing no damage in latest suspected Yemen Houthi rebel attack", "date": "2024-05-23 16:30", "url": "https://www.mymotherlode.com/news/world/3362933/missile-splashes-into-the-red-sea-causing-no-damage-in-latest-suspected-yemen-houthi-rebel-attack.html", "message": "Missile splashes into the Red Sea, causing no damage in latest suspected Yemen Houthi rebel attackMissile splashes into the Red Sea, causing no damage in latest suspected Yemen Houthi rebel attack View PhotoDUBAI, United Arab Emirates (AP) — A missile splashed down in the waters of the Red Sea on Thursday, but caused no damage to a passing commercial vessel in an attack likely carried out by Yemen’s Houthi rebels, officials said.\nThe Houthis did not immediately claim the attack, though it can take hours or even days for them to acknowledge their assaults.\nThe attack happened in the southern Red Sea near the crucial Bab el-Mandeb Strait, the British military’s United Kingdom Maritime Trade Operations center said.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones.", "location": "RED SEA", "classification": "security", "score": 0.8269695952729853, "event_breakdown": "* A missile splashed into the Red Sea near the crucial Bab el-Mandeb Strait, likely carried out by Yemen’s Houthi rebels.\n* A commercial vessel encountered a missile in the waters of the Red Sea, likely carried out by Yemen’s Houthi rebels."}, {"id": "68a73a0d-0f0c-4fd8-80f0-86b4ddd49848", "title": "Seven killed , 16 wounded in strikes on Ukraine Kharkiv", "date": "2024-05-23 15:00", "url": "https://www.naharnet.com:443/stories/en/305411-seven-killed-16-wounded-in-strikes-on-ukraine-s-kharkiv", "message": "At least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, lies about 20 kilometers (12 miles) from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine's depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of Kharkiv city, Russian missiles struck the town's center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.9570072585641066, "event_breakdown": "Security Events Reported:\n\n- 16 People Injured as S-300 Missiles Strike City of Kharkiv\n- Incursions Made by Russian Troops in Sumy Region\n- Eight Civilians Injured by Missiles in Liubotyn, near Kharkiv\n- Russian Advances Claimed in Donetsk Region near Chasiv Yar, Konstantinovka and Rozdolivka"}, {"id": "9278ea49-9f7b-4e22-bbe4-56d1f6eaaf8e", "title": "IDF Spokesperson Vows To Free Hostages In  precise  Rafah Operation", "date": "2024-05-23 16:45", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-spokesperson-vows-to-free-hostages-in-precise-rafah-operation", "message": "IDF Spokesman Rear Admiral Daniel Hagari announced Thursday the continuation of a targeted military operation in Rafah, Gaza, aimed at liberating hostages held by Hamas.\nIn an English-language video statement, Hagari emphasized the precision and necessity of the operation to combat Hamas and bring home Israeli hostages.\nHagari explained that Hamas is holding hostages in Rafah, necessitating the IDF's operations in the area.\nIDF SpokespersonHe stressed that the IDF is executing the operation in a \"targeted and precise way,\" aiming to minimize harm to Gazan civilians despite Hamas embedding itself in civilian areas.\nThe IDF, according to Hagari, has extensive experience in conducting precise operations and targeted raids based on accurate intelligence.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9347129051366857, "event_breakdown": "English\n1) IDF operation in Rafah, Gaza for hostage liberation\n2) Hamas hostage taking in a residential area in Rafah\n3) The IDF emphasizes the precision of the actions\n4) The IDF's extensive experience in conducting targeted raids"}, {"id": "374208ee-5328-4da2-9dca-86af92d9d4f2", "title": "At least seven dead in Russian missile attack on Ukraine second - largest city", "date": "2024-05-23 14:45", "url": "https://www.upi.com/Top_News/World-News/2024/05/23/Ukraine-Russia-attack-Kharkiv-dead/1371716468221/", "message": "At least seven people were killed in Russian strikes against Kharkiv Thursday in an ongoing offensive against Ukraine's second-largest city.\nPhoto by Sergey Kozlov/EPA-EFEMay 23 (UPI) -- A Russian missile attack on Ukraine's second-largest city of Kharkiv left at least seven people dead and more than a dozen injured as Moscow continued its renewed offensive in the northeastern part of the country.\nAdvertisementHe added that fighting was ongoing near the tons of Pletenivka and Vovchansk amid a renewed Russian offensive while assuring that Ukrainian forces had a hold on the situation and hitting out at international allies for failing to renew Kyiv's weapon stocks.\nThe attack also targeted transportation infrastructure with Ukraine's state railway company saying multiple facilities were damaged and several employees injured.\nRussia continued its attack with two arial strikes on Kharkiv several hours after the initial bombing on Thursday morning.", "location": "KHARKIV", "classification": "security", "score": 0.7947190113739495, "event_breakdown": "* Russian missile attack on Ukraine's second-largest city of Kharkiv\n* Seven people were killed in the Russian air strikes\n* Ukraine's state railway company says multiple facilities damaged"}, {"id": "5d899787-f985-409c-8f56-b3a4ae9e4dd8", "title": "Russian Missiles Kill 7 In Ukraine Second - Largest City As Moscow Troops Press Offensive – 710am KURV", "date": "2024-05-23 18:00", "url": "https://www.kurv.com/russian-missiles-kill-7-in-ukraines-second-largest-city-as-moscows-troops-press-offensive/", "message": "At least 20 people were wounded as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, is about 20 kilometers (12 miles) from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of the city of Kharkiv, Russian missiles struck the town’s center, wounding eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.9644130010288712, "event_breakdown": "* Russian invasion of Ukraine\n* Missile strikes on Kharkiv, wounding at least 20 people\n* Russian troops make incursions in northern Sumy region\n* Missile strikes on Liubotyn, wounding eight civilians\n* Russian forces claim advances in Donetsk vicinity"}, {"id": "0801a235-f737-4068-a3f9-e6e3e9a09eb4", "title": "I couldnt bury my brother because of Sudan bombing", "date": "2024-05-23 18:30", "url": "https://www.yahoo.com/news/couldnt-bury-brother-because-sudan-174804820.html", "message": "\"I had to abandon my brother's body on my way to the cemetery,\" Mr Abdallah, 30, told the BBC.\nEl Fasher resident Ibrahim al-Tayeb al-Faki said his sister was killed in a military airstrike that had also destroyed his home.\n“There is no safe place in El Fasher right now,” he said.\nEl Fasher residents say that access to food and water has become increasingly difficult.\n\"Survival is incredibly challenging,\" 32-year-old lawyer Mahmoud Ahmed Adam, who has had to move repeatedly to escape the fighting, told the BBC.", "location": "EL FASHER", "classification": "security", "score": 0.49436592970707055, "event_breakdown": "1. Mr Abdallah abandoned his brother's body on his way to the cemetery.\n2. Ibrahim al-Tayeb al-Faki said that his sister was killed in a military airstrike that had also destroyed his home.\n3. El Fasher residents say that access to food and water has become increasingly difficult.\n4. Mahmoud Ahmed Adam, a lawyer, has had to move repeatedly to escape the fighting."}, {"id": "a705b5c0-1de6-4025-afd0-fdc9067f7875", "title": "Father And Son Terrorists Admit To Murder And Rape Of Israeli Women On Oct 7", "date": "2024-05-23 16:45", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-father-and-son-terrorists-admit-to-murder-and-rape-of-israeli-women-on-oct-7", "message": "Jamal Hussein Ahmad Radi, 47, and his 18-year-old son Abdallah, provided graphic accounts of their crimes during interrogations.\nAbdallah’s confession revealed a more harrowing truth: his father killed the woman after multiple rapes by the terrorists, including himself and his cousin.\nFlash90Abdallah stated, \"My father raped her, then I did, and then my cousin did, and then we left, but my father killed the woman after we finished raping her.\"\nBoth father and son are currently in Israeli custody awaiting trial, according to an IDF spokesperson.\nThe report also noted that women attending the Nova music festival on October 7 were among those victimized by Hamas' use of sexual violence as a weapon.", "location": "Gaza", "classification": "security", "score": 0.7522203459998994, "event_breakdown": "Here are the security events mentioned in the text:\n- Jamal Hussein Ahmad Radi and his son Abdallah joining a team of terrorists and raping multiple women at the Nova music festival.\n- Jamal killing a woman after raping her and her being raped by three people.\n- Jamal and Abdallah being arrested by Israeli officials."}, {"id": "0d826c9e-885f-4a9e-8be5-29577c7d1044", "title": "11 - year - old boy injured in village in Kharkiv Oblast due to drone explosion", "date": "2024-05-23 16:45", "url": "https://www.yahoo.com/news/11-old-boy-injured-village-145600749.html", "message": "An 11-year-old boy has been injured in the village of Riasne in Kharkiv Oblast as a result of a drone explosion.\nSource: Oleh Syniehubov, Head of Kharkiv Oblast Military AdministrationQuote: \"An 11-year-old boy has been injured as a result of a drone explosion.\nThe strike occurred at 14:30 in the village of Riasne in the Zolochiv hromada.\nBackground:The Russians launched two large-scale attacks on the city of Kharkiv and Kharkiv Oblast on 23 May.\nThe attack on Kharkiv claimed the lives of seven people and left 20 more injured.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.9960947099793872, "event_breakdown": "1. An 11-year-old boy was injured in Riasne, Kharkiv Oblast as a result of a drone explosion at 2:30 PM on May 23rd.\n2. Seven people were killed and 20 others injured in an attack on the city of Kharkiv on May 23rd."}, {"id": "156ff162-5c3f-46a9-a322-725f80a98706", "title": "Romanian H215M fleet to integrate Marte ER anti - ship missile", "date": "2024-05-23 16:45", "url": "https://www.airforce-technology.com/news/romanian-h215m-fleet-to-integrate-marte-er-anti-ship-missile/", "message": "Romania will acquire a pair of H215M helicopters, configured to local specifications.\nThe Marte ER missile will offer an air-launched surface attack option for Romanian H215M helicopters.\nCredit: MBDABy August of the same year, the agreement between Airbus Helicopters and IAR on H215M cooperation had been extended for a further 15 years.\nThe agreement also covered cooperation between Airbus Helicopters and IAR on the production, assembly, customisation, support and maintenance of H215M helicopters heading to the Romanian Armed Forces, and any export opportunities.\nIt is understood that Romania will soon receive a pair of H215M helicopters, tailored for maritime operations.", "location": "BRASOV, Romania", "classification": "security", "score": 0.628862522819512, "event_breakdown": "Security Events:\n\n1. Romania will acquire a pair of H215M helicopters, configured to local specifications.\"\n2. The Marte ER missile will offer an air-launched surface attack option for Romanian H215M helicopters,\"\n3. Airbus Helicopters and IAR extend collaboration agreement for H215M helicopters for an additional 15 years.\"\n4. The agreement includes cooperation on production, assembly, customization, support, and maintenance of H215M helicopters heading to the Romanian Armed Forces.\"\n5. Romania will receive a pair of H215M helicopters that are tailored for maritime operations."}, {"id": "cfcb63a5-1769-4e28-ad35-2e3a60c51ca3", "title": "Russian missiles kill 7 in Ukraine second - largest city where Moscow troops are pressing | News , Sports , Jobs", "date": "2024-05-23 14:45", "url": "https://www.vindy.com/news/latest-news/2024/05/russian-missiles-kill-7-in-ukraines-second-largest-city-where-moscows-troops-are-pressing/", "message": "At least 16 people were injured as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, lies about 12 miles from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 6 miles west of Kharkiv city, Russian missiles struck the town’s center, injuring eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "KHARKIV", "classification": "security", "score": 0.960468964377795, "event_breakdown": "- Injury of civilians in Liubotyn. Eight civilians injured\n- Russian missiles strike the center of Liubotyn\n- Russian troops make incursions in the Sumy region\n- S-300 missiles strike the city of Kharkiv (16 people injured)"}, {"id": "f9e52b83-867f-4c92-8db7-d625d8e8e1fe", "title": "Father - son terrorists describe raping , executing woman on Oct . 7", "date": "2024-05-23 16:45", "url": "https://nypost.com/2024/05/23/world-news/father-son-terrorists-describe-raping-executing-woman-on-oct-7/", "message": "Bone-chilling new footage shows a Hamas terrorist and his teenage son casually telling Israeli interrogators how they took turns raping a woman, then executed her during the Oct. 7 terror rampage.\n7 The father and son detailed their horrifying attacks on an Israeli woman.\nJamal claimed that he did not know what happened to the woman after the rape, but his teen son told the interrogator that his father killed the desperate victim.\n“My father raped her, then I did and then my cousin did and then we left but my father killed the woman after we finished raping her,” Abdallah said in his own interview tape.\nOf the 400 residents of Kibbutz Nir Oz, at least 20 were killed on Oct. 7 and 80 were kidnapped.", "location": "Nir Oz", "classification": "security", "score": 0.8852971888309181, "event_breakdown": ".\nOctober 7, 2005: At least 20 people were killed in Kibbutz Nir Oz and 80 were kidnapped."}, {"id": "961ad0de-92cd-4a3f-b636-c03cf6a7e2c6", "title": "IDF Spokesman Hagari :  Hamas is holding hostages in Rafah , that why were there  ", "date": "2024-05-23 15:15", "url": "https://www.israelnationalnews.com/news/390444", "message": "IDF Spokesman Hagari: 'As opposed to Hamas, IDF continues to work to protect civilians' IDF SpokespersonIDF Spokesman Rear Admiral Daniel Hagari released a statement on Thursday addressing the IDF’s ongoing operation in Rafah.\nHagari noted: \"Hamas is in Rafah, Hamas has been holding our hostages in Rafah, which is why our forces are maneuvering in Rafah.\nWe’re implementing lessons learned since Hamas started this war on October 7th and refining our operations so that there is minimal harm to the Gazan civilians Hamas is hiding behind.\nHamas terrorists are waging war while embedding themselves inside and under civilian areas in Rafah — Because Hamas wants Gazan civilians to be caught in the crossfire.\n\"Our war is not against the people of Gaza - our war is against Hamas,\" the spokesman declared\"Hamas started this war on October 7th.", "location": "Rafah, a city in the Gaza Strip on the border with Egypt.", "classification": "security", "score": 0.9038637584536052, "event_breakdown": "Hamas started war on October 7th. IDF Spokesman Hagari said:\n- Hamas has been holding our hostages in Rafah.\n- Our forces are maneuvering in Rafah.\n- We're implementing lessons learned since Hamas started this war.\n- We're refining our operations to minimize harm to Gazan civilians.\n- Hamas wants Gazan civilians to be caught in the crossfire.\n- Our war is not against the people of Gaza, it's against Hamas."}, {"id": "673dbb8a-95d3-45bd-93f0-2afa9acfe9e7", "title": "Russian missile attack on Kharkiv leaves at least six dead", "date": "2024-05-23 17:45", "url": "https://www.bolnews.com/international/2024/05/russian-missile-attack-on-kharkiv-leaves-at-least-six-dead/", "message": "A Russian missile attack on Kharkiv, Ukraine, has killed at least six people and injured over a dozen.\nAdvertisementA Russian missile attack on Kharkiv, northeastern Ukraine, has killed at least six people and injured more than a dozen, according to the regional head.\nOleg Sinegubov reported that the attack, which struck Ukraine’s second-largest city at least 15 times, has also left two people missing.\nUkraine’s state railway company reported that the attack had damaged several of its facilities and injured a number of its employees.\nLast week, Mr. Zelensky warned that the Russian ground offensive might be only the “first wave.”Also Read Ukrainian troops retreat in Kharkiv amid Russian offensive Ukraine has withdrawn troops from several villages in the border region of...", "location": "KHARKIV", "classification": "security", "score": 0.8603111208256454, "event_breakdown": "* A Russian missile attack on Kharkiv, northeastern Ukraine, on 21 April 2022 has killed at least six people and injured over a dozen.\n* The missile strike, which struck Ukraine’s second-largest city at least 15 times, has also left two people missing, according to regional head Oleg Sinegubov.\n* Ukraine’s state railway company reported that the attack damaged several of its facilities and injured a number of its employees.\n* On 7 April 2022, President Zelensky warned that the Russian ground offensive might be only the “first wave”.\n* In March 2022, Ukrainian troops withdrew from the northern border with Belarus, including parts of the Kyiv and Zhytomyr regions\n* On 25 February 2022, Russia launched a full-scale invasion of Ukraine."}, {"id": "2c9ea4a2-584c-4b22-9ac9-07049ba7dc84", "title": "Bakery accused of  glorifying terrorist after making Hamas cake for child", "date": "2024-05-23 15:00", "url": "https://www.aol.com/sydney-bakery-faces-backlash-making-134844856.html", "message": "Four-year-old Omar posing with the offending cake while dressed in similar clothingAustralian police are investigating a bakery in Sydney which made a cake featuring a Hamas terrorist and Palestinian flags for a four-year-old boy.\nChris Minns, the premier of New South Wales state, called the images that adorned the cake “horrifying”.\nMark Speakman, the leader of the opposition in New South Wales, described the cake as “truly shocking”.\nThe Hamas spokesman also appeared on a tray of cupcakes made for the birthday party.\n“It takes a rare kind of psychosis to want to teach infant children that Hamas terrorists are to be admired and emulated,” he said.", "location": "SYDNEY", "classification": "security", "score": 0.706506281413668, "event_breakdown": "* Sydney bakery under investigation for making a Hamas terrorist cake for a 4-year-old boy\n* Chris Minns, premier of New South Wales, called the images that adorned the cake “horrifying”\n* Mark Speakman, leader of the opposition in New South Wales, described the cake as “truly shocking”"}, {"id": "4f926fcb-695c-4dbe-a3e3-c5eb445f19ad", "title": "The IAF landed a plane in Eastern Sector using night vision goggles . Here why it is significant – Firstpost", "date": "2024-05-23 15:45", "url": "https://www.firstpost.com/explainers/the-iaf-landed-a-plane-night-goggles-13774366.html", "message": "The IAF has for the first time landed an aircraft using night vision goggles (NGVs) in the Eastern Sector.\nThe IAF has for the first time landed an aircraft using night vision goggles (NGVs) in the Eastern Sector.\nExperts say the importance of night vision goggles in modern warfare cannot be underestimated.\nThe website SP’s Land Forces quoted soldiers, when asked what they needed, telling a senior NATO officer visiting Afghanistan “more NVG’s (Night Vision Goggles) Sir”.\n“In a first, an IAF C-130 J aircraft recently carried out a night landing at the Kargil airstrip,” the IAF wrote on X.", "location": "Kargil", "classification": "security", "score": 0.5462892735418139, "event_breakdown": "* Night landing of IAF C-130 J aircraft at Kargil airstrip."}, {"id": "ba807ad5-3e30-45bf-b428-56c42c5f4c2d", "title": "It unlikely any more hostages will be returned alive , says IDF lieutenant colonel", "date": "2024-05-23 16:15", "url": "https://www.thejc.com/news/israel/its-unlikely-any-more-hostages-will-be-returned-alive-says-idf-lieutenant-colonel-v8mpil15", "message": "Lieutenant Colonel Jonathan Conricus told reporters he was “not optimistic” that any more hostages would be freed alive, although he said that some were known to be held in Rafah.\nAbout the remaining hostages, the colonel said: “There is a lot of ambiguity\".\nOne of the hostages whose body was rescued from Gaza last week was previously thought to be alive.\nThis is \"no diplomatic end in sight” to the tensions with Hezbollah, Conricus went on, and he predicted escalation along the border.\nThere is a vast network of Hamas tunnels that crisscross the city and pass into Egypt.", "location": ".\nRafah, a city in the southern Gaza Strip near the Egypt border", "classification": "security", "score": 0.5893860041793847, "event_breakdown": "* Hostages being held in Gaza\n* Rescue attempts being made\n* Ambiguity surrounding the fate of the remaining hostages\n* Troop movements along the border with Hezbollah"}, {"id": "88b325d2-af0e-401f-a89b-c7f1ed8f4d85", "title": "At least five wounded in second Kharkiv - Derhachi strike by Russia", "date": "2024-05-23 16:45", "url": "https://www.yahoo.com/news/least-five-wounded-second-kharkiv-144400094.html", "message": "The Russian military attacked Kharkiv and Derhachi, Kharkiv Oblast, for the second time in one day, regional governor Oleh Synehubov reported on May 23.\nRead also: Kharkiv attack: SES and police team up in rescue effortsFive people were wounded, the head of the Derhachi military administration reported.\nStrikes on Kharkiv and oblast on May 23Russia launched a massive attack on Kharkiv and the towns of Zolochiv and Liubotyn in Kharkiv Oblast on the afternoon of May 23.\nRead also: Russia fires 15 missiles at once during strike on Kharkiv and Lubotyn — ZelenskyyThe attack killed at least seven people and injured 16 others.\nFive of those killed in Kharkiv were employees of the Vivat printing house.", "location": "Kharkiv Oblast", "classification": "security", "score": 0.9694452306321385, "event_breakdown": "- Russian military attacked Kharkiv on May 23 (2 attacks)\n- Russian military attacked Derhachi, Kharkiv Oblast, on May 23 (2 attacks)\n- Russian military attacked Zolochiv and Liubotyn in Kharkiv Oblast on May 23"}, {"id": "a9e100e5-d07c-46a5-953a-9d386eeeb47a", "title": "The Irish Connection in Libya : A Rogue General Use of a Private Military Company to Enhance His Army", "date": "2024-05-23 16:45", "url": "https://sofrep.com/news/the-irish-connection-in-libya-a-rogue-generals-use-of-a-private-military-company-to-enhance-his-army/", "message": "The result was the swift destruction of Gaddafi’s military as a capable and functioning military force.\nThe result was the swift destruction of Gaddafi’s military as a capable and functioning military force.\nOn May 16, 2014, General Haftar launched Operation Dignity, designed to sweep up and destroy rebel militias, radical Islamic groups.\nAlthough General Haftar succeeded in securing the east, its oil fields, and terminals, he, however, fell short of taking Benghazi.\nFor example, the 166th could train other units within General Haftar’s army to raise their readiness levels and general soldiering skills.", "location": "LIBYA", "classification": "security", "score": 0.9514143087334087, "event_breakdown": "Security Events:\n\n1. On May 16, 2014, General Khalifa Haftar launched Operation Dignity, a military campaign aimed at eliminating various rebel groups and radical Islamic militias.\n2. General Haftar successfully secured important areas, such as the east of the country, oil fields, and terminals, but failed to take control of Benghazi during the operation.\n3. The 166th Brigade could assist in training other units within General Haftar's army, helping them improve their readiness and overall soldiering skills."}, {"id": "c6f5a0e2-4e82-422b-9b87-a68165de27d7", "title": "  Battle of the Walls of Death  - Israeli Forces Withdraw After 46 Hours , Leaving 12 Dead", "date": "2024-05-23 16:30", "url": "https://www.palestinechronicle.com/battle-of-the-walls-of-death-israeli-forces-withdraw-after-46-hours-leaving-12-dead/", "message": "The troops also surrounded the hotel where journalists were staying and a worker at the hotel was wounded by Israeli forces gunfire.\nOn Wednesday evening, Israeli forces besieged a vehicle at the Ahmadein roundabout and fired at the two occupants.\nHe was previously shot by Israeli forces eight months ago in his home town of Silat Al-Harithiyah while confronting invading invading troops.\nScenes of the wreckage of Israeli miliaty vehicles that were targeted by the resistance during the Walls of Death battle in #Jenin on Wednesday.\nIsraeli forces then called in backup and were supported by the army, they would go on to murder primarily civilians.", "location": "Based on the information in the text, it appears that the main focus of the event is the Ahmadein roundabout in the Palestinian town of Sil", "classification": "security", "score": 0.9772318091336593, "event_breakdown": "1. Israeli forces besieged a vehicle with two people in it and shot at it, injuring both occupants.\n2. Israeli forces shot dead a person at a roundabout in Ahmadein.\n3. Israeli forces gunned down a worker at a hotel in Abu Dis with shrapnel from a bomb blast, according to the Palestinian Health Ministry.\n4. Israeli forces brought in backup and were supported by the army, and proceeded to raid a Palestinian neighborhood, killing seven people, including two young children."}, {"id": "c5dcb338-bbbd-4baf-89bc-50aab74ec530", "title": "Hamas terrorist killed by IDF in underground tunnels combat", "date": "2024-05-23 23:00", "url": "https://www.jpost.com/israel-hamas-war/article-802436", "message": "The IDF and Shin Bet killed Hussein Fiad, the commander of Hamas' Bein Hanoun Battalion, during an underground combat in the Jabalya region, the IDF reported on Thursday.\nWhile the IDF operated in the Jabalya area, Israeli Air Force special forces, together with the \"Yahalom\" unit, killed the terrorist Hussein Fiad.\nKey Hamas commanderPOV camera footage of an IDF solider running through the long tunnel in the northern Gaza Strip, March 17, 2024.\nFurthermore, Fiad commanded the extensive mortar fire toward Israeli communities near the northern part of the Gaza Envelope.\nIn their announcement, the IDF stated that Fiad's death is part of the IDF's operational activity above ground to locate tunnels and Hamas terrorists and below the ground to destroy Hamas terror tunnels.", "location": "Gaza Strip", "classification": "security", "score": 0.9599305566014054, "event_breakdown": "1. IDF and Shin Bet kill Hussein Fiad, the commander of Hamas' Bein Hanoun Battalion during underground combat in the Jabalya region.\n2. IDF operated in the Jabalya area, Israeli Air Force special forces, together with the \"Yahalom\" unit, killed the terrorist Hussein Fiad."}, {"id": "eb002cc9-93e6-442b-89bc-4ac046e8931c", "title": "Russian missiles kill 7 in Ukraine second - largest city as Moscow troops press offensive", "date": "2024-05-23 21:00", "url": "https://apnews.com/article/russia-ukraine-war-kharkiv-missiles-border-208d1921bb4782fcf403f30cd0fea1d6", "message": "At least 20 people were wounded as S-300 missiles struck the city of Kharkiv, regional Gov.\nThe city of Kharkiv, which is the capital of the region of the same name, is about 20 kilometers (12 miles) from the Russian border.\nAt the same time, and in an apparent effort to stretch Ukraine’s depleted forces, Russian troops have made incursions in the northern Sumy region.\nIn Liubotyn, a small town about 10 kilometers (6 miles) west of the city of Kharkiv, Russian missiles struck the town’s center, wounding eight civilians.\nElsewhere in Donetsk, Russian forces claimed advances in the vicinity of Chasiv Yar, Konstantinovka and Rozdolivka.", "location": "Kharkiv", "classification": "security", "score": 0.9644130010288712, "event_breakdown": "1. Missiles strike the town of Liubotyn, west of the city of Kharkiv, wounding eight civilians.\n2. Missiles strike the city of Kharkiv.\n3. Russian troops make incursions in the northern Sumy region, possibly in an effort to stretch Ukraine’s depleted forces.\n4. Russian forces claim advances in the vicinity of Chasiv Yar, Konstantinovka, and Rozdolivka in the city of Donetsk."}, {"id": "81c332fa-b608-45f9-b4f8-f5b3225190f5", "title": "Palestinians taking shelter injured after Israeli troops shell school in Gaza", "date": "2024-05-23 20:15", "url": "https://www.mirror.co.uk/news/world-news/palestinians-taking-shelter-injured-after-32880429", "message": "Israeli troops shelled a school in northern Gaza injuring Palestinians who were sheltering - it comes after the deaths of a United Nations worker and other aid workers in the war torn regionPalestinians were injured on Thursday as Israeli troops shelled a school where people were sheltering in northern Gaza.\nThe attack in Beit Hanoun happened amid fears Hamas fighters have regrouped in some of the most embattled Gaza areas.\nIt came as an internal military probe into the death of an Indian United Nations worker killed on May 13 in a United Nations marked car revealed the worker was killed by Israeli troops.\nThat attack sparked a supposed crackdown on Israeli troops taking greater care with humanitarian vehicles.\nTwo Hezbollah operatives were killed by Israeli troops in Lebanon on Thursday.", "location": "Gaza", "classification": "security", "score": 0.9660879970503424, "event_breakdown": ".\nSecurity Events:\n1. Israeli troops shelled a school in Beit Hanoun, Gaza.\n2. UN Worker was killed by Israeli troops in a separate incident.\n3. Two Hezbollah operatives were killed in Lebanon. \n4. Israeli troops killed two Hezbollah operatives in Lebanon."}, {"id": "d9598a8b-4db4-427a-8192-468ef4d2c94a", "title": "The Latest | Largest hospital in central Gaza faces imminent shutdown due to lack of fuel", "date": "2024-05-23 22:00", "url": "https://www.newsday.com/news/nation/israel-iran-hamas-latest-05-23-2024-c21128", "message": "The largest hospital serving central Gaza faces imminent shutdown because it is running out of power after Israel’s military assault in Rafah severely limited entry of fuel for generators, the Health Ministry in Gaza said Thursday.\nWith Hamas holding firm and fighting back in Gaza, Israel faces only bad options.\nLARGEST HOSPITAL IN CENTRAL GAZA FACES IMMINENT SHUTDOWN DUE TO LACK OF FUEL, HEALTH MINISTRY SAYSDEIR AL-BALAH, Gaza Strip — Gaza’s Health Ministry says the largest hospital serving central Gaza faces imminent shutdown because it is running out of power after Israel’s military assault in Rafah severely limited entry of fuel for generators.\nThe hospital received 3,000 liters of fuel on Wednesday but needs 5,000 liters a day to operate, the Health Ministry said.\nGantz’s statement, made in a video posted to X, was another sign of escalating divisions in the Israeli War Cabinet.", "location": "GAZA", "classification": "security", "score": 0.6439944774744527, "event_breakdown": "- Israeli airstrikes on the Gaza Strip on Wednesday, 15 June, hit several targets, including a high-rise building that housed the Gaza City offices of the Associated Press.\n- Gantz said that Hamas, the Palestinian militant group that rules Gaza, would “pay a very heavy price,” for its rocket attacks on Israeli cities.\n- Israeli Defense Minister Benny Gantz said that Israel would step up its operation against Hamas in Gaza."}, {"id": "3e672a2b-66d1-4fe8-bb24-8385175fc82e", "title": "Israel Hamas War : Israeli Forces Kill 50 Palestinians In Bombardments Across Gaza", "date": "2024-05-23 21:45", "url": "https://www.ndtv.com/world-news/israel-hamas-war-israeli-forces-kill-50-palestinians-in-bombardments-across-gaza-5731242", "message": "\"The occupation (Israeli forces) is trying to move further to the west, they are on the edge of Yibna, which is densely populated.\n\"Hamas is in Rafah, Hamas has been holding our hostages in Rafah, which is why our forces are maneuvering in Rafah.\nIsraeli forces have killed around 180 operatives in Rafah so far, Hagari said in a televised news conference.\nA senior Hamas security official, Diaa Aldeen Al-Shurafa, was also killed in an Israeli strike as he toured residential districts of Gaza City, the interior ministry in Hamas-run Gaza said.\nThe Israeli military said three soldiers had been killed in the fighting on Wednesday, raising the number killed since Gaza incursions began on Oct. 20 to 286 soldiers.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9448468318724381, "event_breakdown": "Events:\n1. Israeli forces are moving further into west Gaza, on the edge of Yibna, which is densely populated.\n2. Hamas is holding hostages in the Rafah area, causing Israeli forces to maneuver in the Rafah area.\n3. Israeli forces have killed around 180 operatives in the Rafah area so far.\n4. A Hamas security official toured the residential districts of Gaza City, an Israeli strike killed him."}, {"id": "65043905-4284-4917-9788-c6cd1597eed1", "title": "Israel launches deadly Gaza strikes , says ready for new truce talks", "date": "2024-05-23 21:00", "url": "https://www.gjsentinel.com/news/national/israel-launches-deadly-gaza-strikes-says-ready-for-new-truce-talks/article_7e177156-c3b5-587e-82a7-c4fc47918d5e.html", "message": "Relatives and supporters raise placards with messages and portraits of Israeli hostages held in Gaza since the October 7 attacks in a rally outside the PM's office in Jerusalem on May 22, 2024", "location": "Jerusalem", "classification": "security", "score": 0.9548043392883349, "event_breakdown": "Relatives and supporters of Israeli hostages held in Gaza since the October 7 attacks rally outside the PM's office in Jerusalem on May 22, 2024"}, {"id": "896781f4-c761-4c39-ad6d-3c37d4cbc39e", "title": "Israeli Minister Gantz in favour of official probe into October 7", "date": "2024-05-23 21:00", "url": "https://www.prokerala.com/news/articles/a1533761.html", "message": "Tel Aviv, May 24 : Benny Gantz, a Minister in the Israeli war Cabinet, has spoken out in favour of a commission of inquiry to clarify how the terrorist attack on October 7 could have happened.\nPrime Minister Benjamin Netanyahu earlier denied in a statement that he had received warnings from the military about a possible attack from the Gaza Strip.\nGantz threatened to resign from the government at the weekend if Netanyahu did not present a post-war plan for the Gaza Strip by June 8.\nThe Gaza war began with the terrorist attack by the Palestinian Islamist Hamas movement on Israel on October 7.\nIn the unprecedented massacre by Hamas and other extremist groups, around 1,200 people were killed and more than 250 were taken hostage in the Gaza Strip.", "location": "Tel Aviv", "classification": "security", "score": 0.8596962171235102, "event_breakdown": "Security Events:\n\n1. The attack by the terrorist group Hamas on Israel on October 7."}, {"id": "d9189a47-fa27-4ca3-a16e-354239233985", "title": "Israeli forces kill dozens of Palestinians in Gaza", "date": "2024-05-23 23:00", "url": "https://www.canberratimes.com.au/story/8639567/israeli-forces-kill-dozens-of-palestinians-in-gaza/?cs=14264", "message": "Israel launched its assault on Gaza following a Hamas-led attack on southern Israeli communities on October 7 that killed 1200 people and led to more than 250 hostages, by Israeli tallies.\nSince then, Israel's assault in Gaza has killed more than 35,000 people, with thousands more feared buried under the rubble, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9360633628891979, "event_breakdown": "Events:\n1. Hamas-led attack on southern Israeli communities on October 7\n2. Israel's assault on Gaza\n3. Gaza health authorities report that Israel's assault in Gaza has killed more than 35,000 people\n4. Israel's assault on Gaza has killed more than 35,000 people, with thousands more feared buried under the rubble"}, {"id": "a3424a68-48ce-4895-8139-607dc443544a", "title": "Israeli forces kill dozens of Palestinians in Gaza strikes ; battle Hamas in Rafah", "date": "2024-05-23 22:15", "url": "https://japantoday.com/category/world/israeli-forces-kill-dozens-of-palestinians-in-gaza-strikes-battle-hamas-in-rafah1", "message": "Palestinian kids stand in a house destroyed by an Israeli strike, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah, southern Gaza Strip May 22, 2024.\n\"The occupation (Israeli forces) is trying to move further to the west, they are on the edge of Yibna, which is densely populated.\n\"Hamas is in Rafah, Hamas has been holding our hostages in Rafah, which is why our forces are maneuvering in Rafah.\nIsraeli forces have killed around 180 militants in Rafah so far, Hagari said in a televised news conference.\nA senior Hamas security official, Diaa Aldeen Al-Shurafa, was also killed in an Israeli strike as he toured residential districts of Gaza City, the interior ministry in Hamas-run Gaza said.", "location": "GAZA CITY", "classification": "security", "score": 0.9697551069299561, "event_breakdown": "Event 1: Israeli forces have advanced to Yibna, a densely populated area.\nEvent 2: The Palestinian militant group Hamas is holding hostages in Rafah.\nEvent 3: Israeli forces have killed around 180 militants in the Rafah district of the Gaza Strip.\nEvent 4: A senior Hamas security official named Diaa Aldeen Al-Shurafa was killed in an Israeli strike as he visited residential districts in the Gaza Strip's Gaza City."}, {"id": "4d38112d-b538-4cea-91fa-fb42cfa2d213", "title": "Sudan El Fasher battle : Satellite images of Darfur show RSF destruction", "date": "2024-05-23 22:15", "url": "https://www.bbc.co.uk/news/articles/c722lppyn65o", "message": "The satellite images analysed by Yale University's Humanitarian Research Lab (HRL) show how the RSF is targeting civilian dwellings in and around El Fasher, the army’s last stronghold in Darfur.\n“In Darfur and El Fasher, civilians are being attacked and killed because of the colour of their skin, because of their ethnicity,” Alice Wairimu Nderitu told the UN Security Council on Tuesday, external.\nEl Fasher resident Ibrahim al-Tayeb al-Faki said his sister was killed in a military airstrike that had also destroyed his home.\n“There is no safe place in El Fasher right now,” he said.\nEl Fasher residents say that access to food and water has become increasingly difficult.", "location": "El Fasher", "classification": "security", "score": 0.7692145005783827, "event_breakdown": "1. Darfur and El Fasher residents are being attacked by security forces due to their ethnicity.\n2. Residents of El Fasher have been targeted and killed in a military operation which has also resulted in the destruction of their homes.\n3. The residents of El Fasher are also facing difficulties in accessing food and water."}, {"id": "25cb9083-4672-448e-8424-6ac7b653de3a", "title": "4 - year - old girl dies in hospital after being injured in Russian attack on Odesa on 29 April", "date": "2024-05-23 21:30", "url": "https://www.yahoo.com/news/4-old-girl-dies-hospital-180216008.html", "message": "A child died in hospital on 23 May due to the Russian missile attack on Odesa on 29 April.\nSource: Oleh Kiper, Head of Odesa Oblast Military Administration, on TelegramQuote: \"Unfortunately, the death toll from the Russian attack on 29 April has increased to eight people.\nToday, 4-year-old Zlata died in hospital after a fragment of a Russian missile hit her heart.\nOur doctors fought until the end...\"Background:On 29 April, Russian forces launched a missile attack on Odesa.\nOn 8 May, a man who was injured in a Russian missile attack on Odesa on 29 April died in hospital.", "location": "ODESSA", "classification": "security", "score": 0.7796214356264706, "event_breakdown": "Security events:\n- Russian missile attack on Odesa, April 29\n- Injury of a man who was injured in the missile attack, May 8"}, {"id": "ee0c1b7e-8e38-49d3-8ba4-fac29ea99a4c", "title": "At least 12 Palestinians killed in Israeli airstrike on aid distribution center in Gaza - Xinhua", "date": "2024-05-23 22:15", "url": "https://english.news.cn/20240524/4c5ac70c30094afc9939ef010be979f9/c.html", "message": "GAZA, May 23 (Xinhua) -- At least 12 Palestinians were killed in an Israeli airstrike targeting an aid distribution center in central Gaza, Palestinian security and medical sources said Thursday.\nSecurity sources told Xinhua that an Israeli aircraft targeted the center in the east of Deir al-Balah city with a missile.\nThe bodies of the dead, along with several other wounded, had been transported to the Al-Aqsa Hospital in the city, medical sources said.\nThe majority of the population in the Gaza Strip suffer from a lack of food, medicine, and basic humanitarian needs since the outbreak of the war.\nUN agencies have warned of dire consequences in the enclave, including famine and the spread of epidemics and diseases among the local population.", "location": "GAZA", "classification": "security", "score": 0.9696629292731723, "event_breakdown": "Event 1: An Israeli aircraft targeted an aid distribution center in central Gaza.\nEvent 2: 12 Palestinians were killed in the Israeli airstrike.\nEvent 3: The bodies of the dead, along with several other wounded, had been transported to the Al-Aqsa Hospital in the city."}, {"id": "93fe015c-bf39-4f2d-b9ad-b07a6ab86ea4", "title": "Israel launches deadly Gaza strikes , says ready for new truce talks", "date": "2024-05-23 21:00", "url": "https://www.reformer.com/news/national/israel-launches-deadly-gaza-strikes-says-ready-for-new-truce-talks/article_e9846523-94ef-564b-aec9-89641c39a441.html", "message": "Israel launched devastating air strikes on Gaza Thursday, while also expressing readiness to resume stalled talks on a truce and hostage release deal with Hamas to pause the war raging since October 7.\nThe Gaza Strip's civil defence agency said two pre-dawn air strikes had killed 26 people, including 15 children, in Gaza City.\nBut he stopped short of saying that Israel had addressed US concerns, adding that Washington was closely watching ongoing Israeli actions.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.\nIsrael has imposed a siege on Gaza that has deprived the territory's 2.4 million people of most clean water, food, medicines and fuel.", "location": ")\nGAZA CITY", "classification": "security", "score": 0.6822094630092077, "event_breakdown": "* Gaza-Israel clashes erupted October 7\n* 15 children were among the 26 people killed in two Israeli strikes\n* Israel launched devastating air strikes on Gaza\n* Israel expressed readiness to resume stalled talks on a truce and hostage release deal with Hamas\n* Israel has imposed a siege on Gaza\n* Militants also took 252 hostages, 124 of whom remain in Gaza\n* Israel has imposed a siege on Gaza"}, {"id": "e5c26687-f9a6-43f0-ad55-958c61acd947", "title": "CIA Director Burns heads to Europe to kickstart stalled Gaza truce talks : report", "date": "2024-05-23 19:45", "url": "https://www.al-monitor.com/originals/2024/05/cia-director-burns-heads-europe-kickstart-stalled-gaza-truce-talks-report", "message": "May 23, 2024CIA Director Bill Burns will meet in Europe with his Israeli counterpart, David Barnea, in the coming days in a bid to revive stalled indirect negotiations between Israel and Hamas.\nBurns has been the lead US negotiator trying to broker a truce between the two warring sides in recent months.\nSpeaking at a press conference Thursday evening, Israeli military spokesperson Daniel Hagari addressed the five kidnapped female soldiers directly: “We have failed to protect you, your friends and many other Israeli citizens and soldiers.\nThe Israeli military did not confirm Palestinian reports earlier in the day of Israeli troops operating in the Yabna refugee camp further to the west.\nThe International Court of Justice will make its decision based on a case brought by South Africa against the Israeli military campaign in Gaza.", "location": "EUROPE", "classification": "security", "score": 0.6477024107412103, "event_breakdown": "1. CIA Director Bill Burns will meet with his Israeli counterpart, David Barnea, in Europe in the coming days to try to revive stalled indirect negotiations between Israel and Hamas.\n2. The Israeli military did not confirm Palestinian reports of Israeli troops operating in the Yabna refugee camp.\n3. The International Court of Justice will make a decision based on a case brought by South Africa against the Israeli military campaign in Gaza."}, {"id": "6a150a52-21c4-4252-bfc9-c58dd2383d8b", "title": "Israeli forces kill dozens of Palestinians in Gaza", "date": "2024-05-23 23:30", "url": "https://www.bordermail.com.au/story/8639567/israeli-forces-kill-dozens-of-palestinians-in-gaza/?cs=9929", "message": "Israel launched its assault on Gaza following a Hamas-led attack on southern Israeli communities on October 7 that killed 1200 people and led to more than 250 hostages, by Israeli tallies.\nSince then, Israel's assault in Gaza has killed more than 35,000 people, with thousands more feared buried under the rubble, according to Gaza health authorities.", "location": "GAZA", "classification": "security", "score": 0.9360633628891979, "event_breakdown": "- Hamas-led attack on southern Israeli communities on October 7\n- More than 35,000 people have been killed in Gaza since the launch of Israel's assault\n- Gaza health authorities say thousands more are feared buried under the rubble."}, {"id": "40259c8b-426d-4da4-8c17-cfd112b10532", "title": "  Operation al - Aqsa Flood  Day 230 : Israel lashes out at West Bank in wake of ICC request – Mondoweiss", "date": "2024-05-23 21:00", "url": "https://mondoweiss.net/2024/05/operation-al-aqsa-flood-day-230-israel-lashes-out-at-west-bank-in-response-to-icc-request/", "message": "*519+ Palestinians killed in the occupied West Bank and East Jerusalem.\n** The death toll in the West Bank and Jerusalem is not updated regularly.\nIsrael revokes the 2005 disengagement law for the northern West Bank, allows resettlement of evacuated illegal settlements and outposts.\nIsraeli forces continue to close the border crossings at Rafah and Karam Abu Salem for the 17th consecutive day, blocking essential humanitarian aid from entering the Strip.\nAs of October 7, Jenin has been the target of the most violent Israeli raids in the West Bank since 2022.", "location": "West Bank", "classification": "security", "score": 0.9854569041517913, "event_breakdown": "- 519+ Palestinians killed in the West Bank and East Jerusalem\n- Israel revokes the 2005 disengagement law for the northern West Bank\n- Israeli forces close the border crossings at Rafah and Karam Abu Salem for the 17th consecutive day, blocking essential humanitarian aid from Gaza\n- Jenin is the target of the most violent Israeli raids in the West Bank since 2022"}, {"id": "291a33d4-96d1-44a8-8cd9-67d8bab08e7a", "title": "Israel launches deadly Gaza strikes , says ready for new truce talks", "date": "2024-05-23 21:00", "url": "https://tribune.net.ph/2024/05/23/israel-launches-deadly-gaza-strikes-says-ready-for-new-truce-talks", "message": "Israel launched devastating air strikes on Gaza Thursday, while also expressing readiness to resume stalled talks on a truce and hostage release deal with Hamas to pause the war raging since 7 October.\nThe Gaza Strip's civil defense agency said two pre-dawn air strikes had killed 26 people, including 15 children, in Gaza City.\nIsrael has angrily rejected those moves, voicing \"disgust\" over the ICC request and labelling any recognition of Palestinian statehood a \"reward for terrorism\".\nBut he stopped short of saying that Israel had addressed US concerns, adding that Washington was closely watching ongoing Israeli actions.\nMilitants also took 252 hostages, 124 of whom remain in Gaza, including 37 the army says are dead.", "location": "answer\nGaza City", "classification": "security", "score": 0.7278342797654463, "event_breakdown": "* Israel launched devastating air strikes on Gaza (location: Gaza Strip)\n* Armed factions in Gaza also took 252 hostages (For me, this is NOT a \"security\" event. This is a political event)\n* Hostages were taken most prominently in the West Bank and these three events form a trail of events but they do not occur at the SAME TIME. \n* Israel has resumed stalled talks on a truce with Hamas"}]